{"date": "2022-02-04 14:17:24.691000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3012.25, "close": 3152.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_8epmsf3n&amp;referenceId=1_8epmsf3n&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_8epmsf3n&amp;referenceId=1_8epmsf3n&amp;pageId=RefinitivNewscasts</a></pre>Source: Thomson Reuters<br/><br/>Description: European antitrust tsar Margrethe Vestager’s 2022 agenda includes shepherding through a landmark piece of technology regulation and continuing her fight against behemoths like Amazon. She joined Breakingviews to talk about everything from Joe Rogan to telecoms M&amp;A.<br/>Short Link: <a href=\"https://refini.tv/3ol8JyV\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3ol8JyV</a><br/><br/>Video Transcript:<br/><br/>Hello and welcome to another Reuters Breakingviews 2022 Prediction event. Thank you very much for joining us. My name is Liam, and I'm in the Reuters office in London, joined by my colleague, Lisa Jucca, who's in Milan. Now, we have had some marvelous heavy hitters so far in this series. And we've had the Boston Morgan Stanley, at UniCredit, a senior official at the Federal Reserve, and now we have another real heavyweight in Margrethe Vestager, who is the Executive Vice President of the European Commission with responsibility for digital and competition policy. I don't think she needs much more of an introduction than that, so let's just get down to it. But I will say first of all, that we're very interested in your audience questions. You can post them through the chat forum. My colleague Lisa will pick them up and ask them later on. So, Ms. Vestager, welcome. <br/><br/>Thank you very much. <br/><br/>I'd like to start by asking a kind of broader question about the future of competition policy. Now you've unveiled quite big piece of legislation recently called the Digital Market Act. And it has lot of rules about the way technologies joints are supposed to behave, but how will it interact with the sort of cases we're used to seeing you pursue, which is much more of a kind of legalistic, kind of \"Article 102\" approach? Will the legislative and digi comp? How will these processes work with each other in the future? <br/><br/>I've learned a lot from the specific competition cases that I've been responsible for, you know, not one, not two, but three Google cases, couple of Amazon cases. Now, another Google investigation, three Apple investigation, Facebook investigation. And what I have seen is that some of the issues there are systemic. When things are systemic, I think it's only right to call in regulation to work hand in hand with the case-specific approach that we have. And what we have learned and also inspired from some unfair trading practices in the marketplace, we built, the Digital Markets Act basically saying that responsibility have to be placed where responsibility is due. So if you grow in power, in market power, you also grow in responsibility. And this is why the Digital Markets Act will designate what we call \"gatekeepers.\" So really big companies with a lot of market power. And if you're a designated gatekeeper, you will have a set of obligations and a set of prohibitions that you will have to live up to in order for the market to be open and contestable. We will, of course, continue to enforce the treaty so we will have cases of unilateral behavior. We can have cases of more parties colluding. Probably they will be different and we will learn more from that. And then we hope that we can sort of refresh the Digital Markets Act as we learn so that it will be future proof. <br/><br/>We're not going to see the sort of cases that you've pursued in recent years. We're not going to see them disappear and be replaced by kind of, you know, this person has violated the DMA. That stuff will still go on and they'll go kind of strengthen each other. <br/>Yeah. That will still go on. Also, you know, to some degree, of course, it is thought-provoking that we sort of could continue punish the same illegal behavior. Because there ought to be a learning curve in the marketplace, also the digital marketplace. That one, something has been seen as illegal, then you know, everyone learns and the market moves on. If that is not the case, then of course, the regulation now comes in, designates gatekeepers to say, well, this is the framework within which you will lift your responsibility. And of course, it will be a very important part of the enforcement of the Digital Markets Act to see if gatekeepers indeed do live up to the obligations like, for instance, sharing data. And the prohibitions, you know, not to promote yourself compared to smaller competitors. <br/><br/>And I wanted to ask you about something that's been in the news more recently. So there was a court case that sort of came to a conclusion of sorts last night, last week involving Intel. Obviously, you know, in-office, when this thing was launched, it's very kind of ancient thing. But it's not the first time that we've seen a kind of competition, a European Commission competition thing go through the courts. And the courts have actually disagreed with the original finding of the Commission. It happened quite a few times in recent years. I'm really interested to know what you learn from those court losses. And if it's going to change your approach to the way that you prosecute these cases. I guess one theory is that if there's a greater probability of losing in court, that will increase your incentive to settle earlier on and accept remedy, rather than pushing this through the future to bitter end. What are your reflections on that? <br/><br/>Well, first and foremost, as a citizen, you know, I'm really comforted and happy that I live in a union based on the rule of law, that authorities can lose. It's not a given that an authority is right because it's the real thing that you can go to court and you can challenge the finding of an authority like ours when we do law enforcement. And that I think is exactly how things should work. In every case, we should do our work so that we really do believe that it can stand up in court, but we cannot be so risk averse that we will only do cases where we think that there is almost a guarantee that we will win in court. Because then, we will not be able to do cases with a novel interpretation of the case law that may be prone for a novel market situation. And, and if we want to win every time, I think we will never get the feedback from the courts in a way that will establish a jurisprudence which is of course important. We have the treaty, we have guidelines, we have our regulations, but we also need the court to tell us how the court sees things. So it's an opportunity to learn how to push things forward. And of course, every time, no matter if we win or we lose, we analyze the ruling very, very carefully in order to learn from it. And one of the things I've learned over these seven years, not being a lawyer myself, is that it's really important to be prudent on procedures because it's quite rare that we lose on substance of the case. It's much more often that we lose on procedural points. So of course, this is one of the things where we're very, very specific that things must be done also procedurally by the book, which is why I appreciate that we have, you know, the advice from our legal service. We have the independent hearing officers where parties can go raise complaints if they find that things are not sufficiently dealt with. <br/><br/>Because you hope audience understand what you mean by procedural work when these cases have fallen down for that procedural reasons, what kind of things are we talking about? Are there any examples?<br/><br/>Well, it could be that, for instance, we have had state A cases that has fallen because the courts don't know we should have open, sort of a formal investigation instead of finding a solution with the member state in question, that we should have more doubts. It could be issues of access to file not being handled in what should be the proper way. So, it is sort of the procedural steps at how to move things forward. Should this have been a supplementary statement of objection rather than a little fact? Sometimes we have also cases during an investigation, questioning basically every step we take. So, the procedure takes up a lot of our efforts, as it should of course because that is part of the party's right to defend themselves. <br/><br/>Great. So, onto another kind of newsy topic. I want to ask you about one of the few big European tech platforms, Spotify, which is a Swedish music streamer. It's obviously been in the news recently because it's got a fairly controversial podcast host, with Joe Rogan who some thinks has been spreading vaccine misinformation through his very large audience. How are similarities to the types of complaints that the commission has had with some of the big American platforms? So, I mean, do you see Spotify coming squarely under the kind of scope of the DMA, I guess, and a lot of the kind of- it would fall under your purview, I guess? And can you kind of assure the American groups that you're going to pursue one of Europe's own companies as aggressive as you would an American one? <br/><br/>But our legislation doesn't know your home country. It knows your market behavior to the European market, where we have jurisdiction, that's the important point. And I think you have to see that some US companies, they're more successful in Europe than in the US when you look at their market share. So, Europe is open for business, no matter where you come from, as long as you're following the European rulebook. And that of course goes for Spotify as well. I think the issue in question here it would be more obvious for Spotify to be part of the code conduct. We have strengthened the code of conduct where all big platforms have signed up in order to police what is unlawful or illegal online to be taken down, and of course all of that to be strengthened with another piece of legislation called the \"Digital Services Act\", which addresses how services should be provided within the European Union and what responsibility you have as a platform to have a system on the one hand side to take down what is flat to be illegal, while at the same time having a system where people can complain about to say, \"Well, I may have hurt you but this is not hate speech, so this is actually legal for me to say it.\" That balance to have those systems in place I think that would be more sort of the kind of question that could be asked for Spotify because the Digital Services Act would not only be for gatekeepers, that would be also for larger platforms to oblige these different obligations. <br/><br/>So, more kind of broader question- you have workstations being very tough on Big Tech. But you look at the track record, there's actually quite a few acquisitions by the really big US players- Google-Fitbit, Microsoft-Nuance, recently Facebook, now called \"Meta\", was allowed to acquire some company called \"Kustomer\". Someone who's not following the antitrust kind of ins and outs very closely and isn't reading all these cases might be a bit surprised that Commissioner Vestager is allowing these things to happen. Could you kind of explain what is it- are you totally relaxed  about these types of deals or is it that your hands are tied and, ideally, you might not like it to go ahead but you don't have the proper legal instruments or legal standing in order to stop them? <br/><br/>Actually, in these cases, we have found solutions to the concerns that we would have. And we have gone into great details, so not only the sort of the first phase of a merger procedures but in-depth analysis. And if you take the Google-Fitbit case, so Fitbit I think is 4% of the European market so a very small player when it comes to health tracking. And here, we took commitments to sort of solve the concerns that we had because it could be a concern when a giant buys a health tracker that they would sort of foreclose that no one else could use the operating system, the Android operating system of the phone. So, that was- that concern was solved by saying we will keep an open API for other health trackers. Another concern could be that, \"Oh, wow, a powerful advertising you can do if you combine health data with other data you have on people, their search pattern, what else they do, localization. And that was solved by saying, you need to put health data in a silo, they cannot be used for advertising purposes. So, what we are doing is try to find also novel solutions to competition problems in order to be able for this market to move ahead, so that we are balanced, that we do not see a market consolidation where there is no market consolidation but enables the market to move on. And I think the Google-Fitbit, with a data silo, with an open API, with the necessary belt and braces for that open API to be really open, I think it is possible to find a solution. <br/><br/>And you don't worry that these- they're famously hard to monitor these kind of behavioral remedies, right? And do you feel like, presumably you do, but you feel like you have enough kind of the window into these companies after the fact? I mean, there was a famous example where Facebook told you it would do something and then you subsequently found that they haven't kept their promises basically? <br/><br/>No, that was- the Facebook case was a case of misleading information. It's not that- they wouldn't combine data in a way that we thought they might have done. And for that misleading information, we fine them EUR110 million. But misleading information is different from taking commitments that are legally binding on you and where there will be someone to monitor them. And it's- I think it's important to look at solutions to competition problems more in a spectrum instead of just two boxes, either structural or behavioral, because when you're in sort of data issues, well, having a data silo is seemingly structural remedy. Having real open API, that will be tested every day when those who needs an open API will be trying to get it. So, we get immediate feedback from the market if this doesn't work. <br/><br/>There was an idea- just speaking about where is the bar in clearing deals, there was an idea doing a rounds for a while about flipping the burden of proof in these kind of deals. I think it might have been under a big digital competition policy report that you commissioned by some experts. This idea of saying, as we- \"If you want to do a deal, you have to prove to us that it's not anticompetitive rather than us having to prove this competitive.\" What do you think of that idea? <br/><br/>I don't necessary think that it's a bad idea but that is de facto the back and forth that we have. When we look into a deal, we analyze it, we look at what is the market situation. We may have concerns that this will harm competition. Then of course, the company can say, \"No, no, no, no, no. There will be efficiencies. It will not work as you say, you got the facts wrong.\" So, there is this back and forth. And even if you turn the table, we would still have to assess the arguments.<br/><br/>You might end up having the same conversation, anyway. <br/><br/>I don't think it's a silver bullet.<br/><br/>I just want to remind the audience that you can ask questions. I think we've had some good ones, three, but don't forget about the questions. I'm sticking on the big tech theme for a second. For a really long time, I was writing about your cases. And it was kind of in a global vacuum, almost. There wasn't, really kind of doing something different. That global competition and anti-trust context has completely changed in the past few years. We've seen huge kind of crackdown in China and perhaps more relevant for what you're doing. You've seen enormous amount of investigation launched at the US. How is that context going to change your job and the job of the people that do your job after you do it? Will you have to kind of communicate with these foreign regulators? Will there be some areas that you would leave to the Americans? Is anything off the table or do you just keep kind of going on blinkers as if nothing has changed?<br/><br/>First and foremost, this is a great development. Because we don't have a global competition law, we don't have a global competition on law enforcement. But if you are too to make sure that consumers all over this planet has the benefit of competitive markets, well, then, of course, we need a lot of jurisdictions to do things that supplement and complement one another. So, I think when I draw my map, I have a map, I put a little red dots when another investigation is opening by the Australians, by the South Koreans, by the Canadians, by the Americans, by the South Africans. Also here in Europe, by the Italians or the Germans. I say we're getting there because the market situation is different in different jurisdictions. We have slight different legislation in different jurisdictions, but we're in it with the same mission to keep markets open, contestable, that there's a drive for innovation, for affordable prices. And, of course, it changes how we work. And it changes also our discussions. From the very first days, I have been discussing our cases with colleagues all over the planet. And the better way was we have, of course, the more we can exchange and learn from one another. Which I think is beneficial not only for us as law enforcers, but also for the businesses in question. So that there is a learning from everyone. So of course, it changes, but we still have the obligation in our jurisdiction to make sure that we vigilantly apply a competition law.<br/><br/>You mean not pursue something because you saw the Americans, assuming a similar case, for example.<br/><br/>Itâ\u0080\u0099s really difficult to answer in general because it would depend on the market situation. And that is really tricky to say, sort of, as a general remark.<br/><br/>I'm just speaking of this kind of global patchwork of investigations. I mean, is there a danger of maybe it would be more efficient if everyone moved in lockstep? And you sort of have this kind of slightly messy picture sometimes where it's kind of hard for someone's doing something on whatever App Store fees over there and someone else is thinking more big picture about whether so-and-so should be broken up. Do you worry about that kind of like legal fragmentation, I guess, of anti-trust? And while you surely welcome the fact that more regulators are like-minded now, is there a downside in that possible, kind of, everyone's doing something different?<br/><br/>I think we're very far from over enforcement. I think we're just in the process of correcting under enforcement. Because of course, we have all had to learn about digital markets, how data works. You know, take our sort of traditional theories of harm, update those to see what is really going on in this marketplace. And I don't see it as fragmentation. Actually, I see it as a puzzle coming together to say that with different market situations, there is a coming together of a more aligned global approach to what should be the rules of the game in more and more digitalized markets. And it's really important that it happens now when everything digitalizes. So, you have the digitization outside of what was sort of natively digital in agriculture and transport and energy. Of course, it had it in finance for a long time. It's really important that competition authorities is then up to speed. And I think here we are, we're helping each other and weâ\u0080\u0099re learning from one another.<br/><br/>I just want to ask you a little bit about something a bit closer to industrial policy which kind of touches on your digital arena. You often hear, it's a problem that Europe doesn't have many $100 billion tech companies. What do you think about that? I mean, every day we use American software which runs on the American design chips and devices that are made in Asia. But the blocâ\u0080\u0099s kind of, the premise of the blocâ\u0080\u0099s industrial policy is almost that we need to change this. So how are Europeans losing from the status quo?<br/><br/>You now, sort of on a day-to-day basis, we get excellent products. And prices have come down on hardware to a degree that many, many people can afford it. That is what has happened over the last 10, 15 years, where digitization was exclusively for the few who could afford it. It was tricky. It was unapproachable to the situation today where smartphones is in the hands of everyone. You have a lot of, sort of, much more intuitive assistance for people to use a completely different level of convenience in your daily life because of technology. And I don't think that could have happened without the market dynamics that we have seen over the last 10 to 15 years. So, I think it's a different thing that is at stake here, and we have seen it during the pandemic and with the follow-on chip shortage. That in Europe, we have a wish of having a bigger footprint in the global value chain when it comes to technology. Not to exclude anyone, but to be a much more assertive part of it. Because important assets are held in Europe, in the chips industry, world-class research. And also, essential chip producing machines are produced in Europe to be sort of more assertive about what we would do. But still take what is the best of all worlds while establishing coalitions so that we can prevent, achieve shortage like the one we had, and at the same time enabling what is our goal when it comes to industrial policy, which is that European industry is leading when it comes to digitization and fighting climate change.<br/><br/>I'm going to handover to Lisa, maybe after one or two more questions. So, if anyone has any more questions, do submit them, we got about five or so minutes. Can ask you about state aid during the pandemic? Obviously, you sort of pause a lot of the restrictions for a few years to allow governments to kind of help companies through this quite extraordinary situation. Youâ\u0080\u0099ve been phasing out this kind of temporary state aid things that you have laid out. The kind of like a tapering where I think where up to the middle of 2022 and then there'll be a slightly different regime for six months and so, you know. Ever since you since I read that back in November, you've seen, you know, a new variant flare up, you know, maybe there'll be another one. What if this thing becomes, we have a cycle of strict lock downs, new variants, what does state aid policy look like in that scenario where we have kind of recurring flare ups? Is there such thing as you can kind of go back to normal or would you support a further extension if that was necessary? <br/><br/>First and foremost, I think the teams who have been taken with us in the commission, more than 900 decisions on state aid would be very sad if they heard you say that it has been paused because we have used the flexibility that we have in the treaty when we have a crisis like this, to enable member states to give absolutely necessary support when the state ask you, to close your door, basically to hibernate. Of course, they should also support you through this hibernation in order for healthy companies to survive. But the reason why we are still doing state aid control is to make sure that aid is not given in an unbalanced manner so that someone can just outspend others. Because then we would, you know, wake up after the pandemic, after this sort of hibernation to completely fragmented single market. So, we're taken many, many, many, many decisions to make sure that everyone is on line. Second, we have been following what kind of budget are we dealing with here? And, and I think for, for the European business community, it is, it is really good that state to see that state has been willing to step up support. I think the total budget of, of approved eight is. is more than â\u0082¬3 trillion, and outside of that comes wage support and all kind of stuff. So, that is the bucket, That's the willingness to give support. But the situation has not been as bad as the budget would reflect. So actually, I think basically no more than a third of this budget has been used, which means that actually member states have not outspend each other. So, we do think that we have a functioning single market to help us recover from the crisis. And I think you see it because you have seen a very strong sort of rebounds in the European economy over the last year. <br/><br/>Quite right, to quote me on the word pauses. Absolutely not a pause. <br/><br/>You know, they, they have been working from home, the teams, and they have been, you know, incredibly vigilant and productive in order to make sure that, you know, aid to get out there where it was needed. I just, I really admire the work thatâ\u0080\u0099s been done.<br/><br/>Quite right, I feel like I got a release in my inbox every other day, reminding you of state aid. Just, I want to just press you on that point about the level playing field, though. Because I mean, you mentioned the EUR3 trillion figure, to just to put it into context for the audience, I think was the kind of the notional possible amount of state aid that could have been granted based on member states, kind of the leeway they'd give them themselves in the budget. So, it's kind of difficult to use those numbers, but I mean, I was just doing a quick exercise, basis and figures from the commission. Based on that 3 trillion, it looked like Germany, France, Italy, and Spain were 84% of that roughly. Now as you say, not all of that EUR3 trillion was used. But there are other studies that suggest that Germany and France have accounted for outsized proportion relative to GDP, particularly Germany, that stand to reason that they have a lot of fiscal space in order to help companies. When you look at the numbers, do, do, do, do really feel confident that there isn't a kind of, there hasn't been, some people are outspending each other here. <br/><br/>Of course, we will keep following because I don't think one should be, be confident in this matter. Also, because of the pandemic is not completely over even though my own country, Denmark, as, as from today, have ceased every restriction. But what we have seen when we look at the aid actually paid out based on the numbers from the member states themselves, Germany is not in the lead. I think, I think Italy is in the lead with France close by, and by. <br/><br/>Spain is pretty big as well<br/><br/>That being said, you're right to say that the bigger countries they have spent more than smaller countries. But, but so far still we don't, we don't see big discrepancies. And, and since you know, European industry is indeed European, having, you know, your customers in one maybe become member states, being in good shape, also helps you if you're the supplier to that customer. So, aid given in one member states may actually also indirectly help others because it makes sure that the value chains and supply chains, that they stay dynamic and in full function. <br/><br/>Thank you. I'm going to hand over to Lisa, now whoâ\u0080\u0099s been scrutinizing the audienceâ\u0080\u0099s questions and may have some of her own as well. Lisa, take it away. <br/><br/>Yes, thank you, Liam. So, there's been a few questions coming through and few more are also appearing in my inbox. But I'd like a Vice President, to start if I if I can, on a topic that we haven't discussed yet. And this is competition policy in telecommunication, the telecommunication sector. So, what is the commissioners view on further consolidation? I mean, in the past, Brussels has been opposed to in-country consolidation that would reduce service providers from 4 to 3. Has that view changed, particularly after the O2 Hutchinson judgment? <br/><br/>We do not do magic numbers. We do market analysis. And we have seen a lot of, sort of consolidation from fixed, to mobile, to fiber coming together, where we get sort of a bit nervous is if we see that. That there will be very limited choice for people within a national market. Because that's the thing is, is one of the real pain points of the European single market. That when it comes to telcos, the market are still quite national due to regulatory barriers, culture, habit. It's quite rare that people would have a subscription from a supplier in a neighboring market. So, we would very much want to have, you know, sort of Pan-European consolidation to see if that can be a push for a more â\u0080\u0098Europeanâ\u0080\u0099 market when it comes to the telcos. Because that I think would give that kind of muscle that is indeed need it for the investment, that is also prone to happen in the telco industry, for instance, in 5G.<br/><br/>But I mean, if I can just do a follow up to this. I mean, I take your point that you know that the sector is still very much divided along national lines, but I mean, wouldn't be, be possible to consider slightly, you know, more consolidation at a point in time where these telecom providers have to spend a lot to upgrade their networks and, you know, extend the use of fiber and they will spent quite a lot on 5G technology. So, wouldn't that be fair trade off in a way, I mean, the consumers get the new technology, but you know, the operators are able to merge so that they can sustain the cost of that development. <br/><br/>But one of the things that has been, been really tricky is that so far, you know, our experience still holds true that it's competition that pushes for investments rather than consolidation pushing for investments. What we have done, because obviously, I take part of your point, for instance, to try to encourage member-states to do, you know, sort of beauty contest when new frequencies are released for 5G. So, instead of asking how much will you pay me, asking how fast and how broad will you deploy this frequency in order for the funding to remain in the company winning the auctions. On that, we have not been very successful, but that would be one of the ways actually to have your cake and eat it, to have competition as a driver for more investment. While for, for some funds still to remain in the companies actually having their frequencies and having to do the investment. <br/><br/>Thanks, thanks for this explanation and just maybe moving on to another topic, coming in. There's also some viewers are asking you your view on, on a very interesting legal case. And that's the one that involves Epic and Apple in the United States. So, are there any conclusions or insights that can be drawn, you know, from that situation which is still alive. You know, that, that could be of interest to Europe. <br/><br/>It is indeed still alive, since both parties have, have appealed the judgments. We follow it with, with interest because it is indeed important to see how this question of hosting more app stores can be dealt with. The sort of the payment systems to do so. You will know that we have we have our own cases when it comes to this, both a general case on the Apple App Store, the Spotify case where Apple have an app competing on music streaming and their app does not have to pay the fee and they don't have the rules that they cannot, you know, tell people that they could actually get the subscription cheaper if they took another venue. So, we follow this with great interest. And last but not least, we will be now in the negotiations that the Digital Markets Act that would oblige you to be open for, for more app stores than your own if you're an operating system supplier. So, we look with great interest of the US developments, but of course, now, it's difficult to say because the appeal will now be ongoing from both sides.<br/><br/>Understood, understood. Obviously, still alive case and maybe also touching on a slightly different topic and this is the issue relating to the global corporate tax, which was finally agreed, you know, after long discussions by OECD member states. So, is that somehow, I mean, two questions may be linked to this topic. I mean, has the commission carried out an evaluation of how that would impact the European Union for instance, I mean, the commission has gone after very aggressive tax deals, you know, especially with tech giants, who you remember, won in Ireland, just to mention one. So, you know, is there an assessment of how, you know, this minimum tax changes things for Europe's coffers? And the second question linked to that is, does it mean that maybe we don't need digital taxes anymore, because we have the global minimum tax.<br/><br/>We've been really active in order to get to this global compromise. And you know, there are two sides to it. One is this 15% minimum effective taxation, and I think the word effective, is really important here. And the second which is sort of the distribution of taxing rights, in different sort of trenches, depending on company size. And both these sides together would show a lot of things. And most obviously, the sense that that taxation should be more fair. That's bigger companies should not escape contributing to the countries where they do their business and create value, and to sort of also put a limit to really aggressive tax competition. So we are, you know, really, really stern supporters of this compromise, and we'll do what we can to implement it for a sense of fairness when it comes to taxation. I don't know if colleagues have calculated what it would bring to EU coffers or member states coffers. But I consider it a great progress. I think it's an historic deal and of course, it would be even better if it was also globally implemented.<br/><br/>And on the digital tax. I mean, just you know, my second question on whether the global corporate tax and the minimum corporate tax somehow takes off the shine or the need, let's say to have digital taxes.<br/><br/>I think to a very large degree, you know, some member states had indeed, judicial taxes and it is part of the agreement to seize these taxes once these taxes have been implemented. So, I think there is a balancing thing here. We have finances as a separate consideration, a consideration of own income for the European Union. And we made two proposals, but we have posed all our considerations about digital levy, which is a different kind of tax, because now actually, we might be able to implement this global compromise and that would indeed be really, really good.<br/><br/>Thank you. So maybe just a, you know, another question or two as we're sort of getting to the end of our conversation. There's a lot of interest also in the consolidation, I mean, from our views in the consolidation and receiving the game in the interest industry. I mean, the latest Microsoft deal is of course, what people have in mind. Is that something that will come under your radar screen? I mean, clearly, you have explained to us that, you know, the Commission doesn't look like the as the home base of the companies involved. I mean, is that something that commission will review and how do you assess, let's say consolidation in the video game industry?<br/><br/>I don't know. I don't think we know if it will be directly notifiable to us. That being said, in general, we work with member states in order to be able to see transaction that do not meet our sort of our thresholds for turnover. In example of that would be the Facebook customer that was referred to us. So, you know, we try to broaden our view to see more deals in order to see what is happening in these markets. We will have no sort of specific view of the gaming industry, we want competition between gaming platforms, as well as in as an any other market, but find it of course very interesting because gaming is probably what is getting closer and closer to what is the real a metaverse where you can have a presence. So, both from sort of a market consolidation point of view and from a learning point of view about conditions of the metaverse. These are very interesting developments.<br/><br/>Thank you. So, we're getting close to the end of maybe a final question again, you know, which came from the readers. We have seen action obviously from the European Commission against some of these big tech companies, but individual EU states have also gone against I mean, we had a recent case in Italy against Amazon which was started Germany, I think the address authority there are investigating Apple and the Apple store in particular. So how should we view, I mean, you know, is this actual coordinated by the European Commission. I do understand that there are you know, slight legal differences between the countries, but you know, isnâ\u0080\u0099t there a risk that it is not coordinated then, are mixed messages in a way given to consumers, you know, and to everyone whose working in these segments.<br/><br/>This is a very good point. We have always encouraged strong national competition authorities because we work together to enforce European competition law. Actually, I think in numbers 85% of decisions within sort of or based on European competition law is taken by national competition authorities. And, and in the last mandate, we passed the legislation actually to strengthen national competition authority so that every citizen in Europe would have sort of the same minimum when it comes to strength of their national competition authorities to police the market. So, we actually we really appreciate the strength of authorities and we have a system to coordinate what we're doing because in some member states, they on top of European competition law, they also have national specificities. And here of course, it's really important that we are well coordinated and for instance, in the Italian-Amazon case, we have an Amazon case, which is not just about distribution of goods, but also has a data side to it. But we have then carved out sort of the Italian part of the European market, in order to make sure that they could do their case, but also that or in all fairness, that we would not investigate Amazon behavior, also in the Italian market, when the Italian authorities were doing it.<br/><br/>Okay, well, thank you for this explanation. I think on this note, I'm going to give back the floor to my colleague Liam.<br/>Thank you very much Lisa. Thanks to your questions, audience members. Yeah, I saw I think we'll wrap it up there. I just want to say thank you very much for your time, which was really good to your thoughts.<br/><br/>It was my pleasure. You know, it's really encouraging because competition law enforcement and competition in the marketplace is, is one of the, you know, solutions to digitization to fighting climate change, but of course, also to have resilient supply chains. So that if one supplier has an issue, then you can turn to someone else. So, it's indeed a pleasure to discuss it with you.<br/><br/>Great, thank you very much. Yeah. Thank you very much. See you soon. Bye.<br/><br/>Thank you. Bye-bye.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}