{"date": "2021-11-25 22:12:10.734000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3580.41, "close": 3561.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>BOOSH PLANT BASED BRANDS INC (\"VEGI-Z;VGGIF-0\")\n- 8,000 plus Attend Boosh Sponsored Planted Expo in Vancouver\n\n   Boosh Plant-Based Brands Inc. (\"Boosh\" or the \"Company\") is proud to\nannounce that over 8,000 consumers and investors visited the largest\nplant-based expo in Canada; Planted-Expo at which Boosh was the presenting\nsponsor.  At the event Boosh proudly introduced its brand-new shelf stable\nline of Boosh Mac &amp; Cheeze; Nacho and Better Cheddar to rave reviews, and\nprovided samples to consumers of Boosh's favourite foods including\nShephard's Pie, and recently acquired brands such as Salt Spring Harvest\npate and Pulse Specialty Kitchen plant-based cheeses.\n\n   (iframe width=\"560\" height=\"315\"\nsrc=\"https://www.youtube.com/embed/i0JAWh7SMhU?rel=0\" frameborder=\"0\"\nallow=\"autoplay; encrypted-media\" allowfullscreen)(/iframe)\n\nCannot view this video?  Visit:\n<a href=\"https://www.youtube.com/watch?v=i0JAWh7SMhU\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.youtube.com/watch?v=i0JAWh7SMhU</a>\n\n   \"We were ecstatic that literally thousands of people stopped by our\nbooth and sampled our wonderful variety of plant-based cheeses, entrees and\nmeals.  We also added over 800 social media followers and sold thousands of\ndollars of products from our Booth.  By the end of the event we had even\nsold out of the Mac &amp; Cheeze lines,\" states Connie Marples founder and\npresident of Boosh.\n\n   \"This was an excellent opportunity to meet over one hundred local\nshareholders and investors in a casual setting, share stories and sample\nall types of Boosh products,\" states Jim Pakulis CEO of Boosh. \"Just as\nimportantly, management was also able to introduce Boosh to buyers in the\nfood service industry such as the restaurant and bar sectors. In short, the\nevent was a huge success for Team Boosh!\"\n\n   In other news TJ Walsh, Boosh's newly hired VP of Sales North America,\ncommenced work on Monday.  TJ is responsible for all sales strategy,\ndevelopment, direction and budget. He will be developing on-site sales\ntraining and policy formulation, and will report directly to the president,\nConnie Marples, and CEO Jim Pakulis.  TJ has extensive sales experience\nincluding, but not limited, to National Director of Sales for Silver Hills,\na plant-based bakery and organic foods company.  Prior to that, he was\nSales Manager for UNFI, North America's largest all natural and organic\ndistributor. Previously, he spent eight years with Bolthouse Farms,\neventually being promoted to Director of Field Sales.  At Bolthouse Farms,\nhe was responsible for implementing a multi-million dollar sales budget,\noverseeing 30 sales representatives, developing strategic growth plans for\nselling all new product lines, and creating merchandising and sales\nstrategies for Walmart, Kroger, Target, Safeway/Albertsons, HEB, Loblaws,\nSave On, Kroger's and Whole Foods.\n\n   The board of directors extended CEO Jim Pakulis' consulting agreement\nfor one year of services. In exchange, the Company will provide Jim with\n250,00 warrants priced at $2.00 and an exercise period of four years, and\nfifty thousand dollars.\n\n   \"I'm committed to lead Boosh for the long run, however long that takes.\nEqually important, I'm committed to building our infrastructure, seek out\nkey acquisitions and expand Boosh throughout North America.  My personal\nbelief is a two dollar exercise price for the warrants offered to me is\nfair and equitable based on where I believe the company is heading,\" states\nJim Pakulis.\n\n   On behalf of the Board of Directors\n\n   James Pakulis\nChief Executive Officer\n\n   Telephone: (833) 882-6674\n\n   www.Booshfood.com\n\n   About Boosh Plant-Based Brands Inc.:\n\n   Boosh Plant-Based Brands Inc., through its wholly owned subsidiary,\nBoosh Food (www.booshfood.com), offers high quality, non-GMO, gluten free,\n100% plant-based nutritional comfort foods for the whole family. We\ncurrently offer six frozen meals and three refrigerated meals which are\nsold throughout Canada. Boosh, good for you and good for planet earth.\n\n   The information in this news release includes certain information and\nstatements about management's view of future events, expectations, plans\nand prospects that constitute forward-looking statements. These statements\nare based upon assumptions that are subject to significant risks and\nuncertainties. Because of these risks and uncertainties and as a result of\na variety of factors, the actual results, expectations, achievements or\nperformance may differ materially from those anticipated and indicated by\nthese forward-looking statements. Forward-looking statements in this news\nrelease include, but are not limited to, the Company's proposed use of the\nproceeds of its initial public offering. Any number of factors could cause\nactual results to differ materially from these forward-looking statements\nas well as future results. Although the Company believes that the\nexpectations reflected in forward-looking statements are reasonable, it can\ngive no assurances that the expectations of any forward-looking statements\nwill prove to be correct. Except as required by law, the Company disclaims\nany intention and assumes no obligation to update or revise any\nforward-looking statements to reflect actual results, whether as a result\nof new information, future events, changes in assumptions, changes in\nfactors affecting such forward-looking statements or otherwise.\n\n   Neither the Canadian Securities Exchange nor its Regulation Services\nProvider (as that term is defined in the policies of the Canadian\nSecurities Exchange) accepts responsibility for the adequacy or accuracy of\nthis release.\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132800325.MNPRE2132801320-14051920211125</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}