{"date": "2021-12-19 08:47:00.073000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3400.35, "close": 3408.34}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>EDWARDSVILLE, Ill. - Delivery driver Alonzo Harris was wrapping up his shift around 8 p.m. Dec. 10 when his Amazon-issued phone started buzzing with a weather alert.</p><p>Unfortunately, the automated voice reading the alert aloud as he drove was in Spanish, he said. Harris understood enough to grasp that bad weather was heading his way that Friday night, but he was tired after a long day and didn't pay much attention. He couldn't read the tornado warnings that local authorities were sending to his personal phone, either, because he was driving.</p></div><div class=\"tr-npp-body\"><p>Harris stopped at a gas station to fill up his van. It wasn't until he pulled into the Amazon facility just before 8:30 p.m. that he first heard the word \"tornado\" - shouted by a frantic Amazon manager who was stopping drivers as they drove in, ordering them to abandon their vehicles and run to the shelter zone.</p><p>Moments after Harris reached the shelter area near the restrooms on the north side of the building, the ground began convulsing, debris started flying and an unholy noise filled the air. The EF-3 tornado that hit the facility quickly tore off the roof, collapsed several exterior walls and killed six people.</p><p>Engineering experts say the tragedy is likely to bring new attention to the codes that govern the construction of such expansive but delicately engineered structures. It also is likely to bring new discussion of what employers should do to ensure the safety of their workers. There are no federal requirements for specially built storm shelters in warehouses.</p><p>Harris said he is grateful to the manager - he knows only her first name, Julie - who ordered him to take shelter. \"She saved my life by stopping me right when I pulled in,\" he said in an interview. But he also said he would have sought shelter sooner had he understood earlier that a tornado was coming.</p><p>In a frantic 911 call logged at 8:41 p.m., another survivor said she, too, had been directed to seek shelter, but ended up in the part of the building that collapsed, with another surviving woman and a third who appeared dead. \"As soon as we pulled in, they said, 'Park and go straight to the bathrooms,' so we came into the girls' bathroom,\" the woman told the emergency dispatcher.</p><p>The second surviving woman can be heard on the recording saying that the rubble \"crushed\" the third, apparently dead woman. \"Her body is bent in half,\" she said.</p><p>The only woman who died in the collapse was 34-year-old Etheria S. Hebb, according to local police.</p><p>Federal and local investigators are now examining the collapse. Amazon said the facility was built to code, and that the company followed proper safety procedures. But the tragedy has heightened concerns that building codes may need to be strengthened in the face of powerful storms and climate-change-related natural disasters.</p><p>\"Suffice it to say, that's something we are deeply concerned about, to make sure code is where it ought to be,\" Illinois Gov. J.B. Pritzker (D) said at a news conference in Edwardsville last week. He called the tornado an \"unexpected, major severe storm\" - something, he said, that Illinois is seeing more often.</p><p>According to the National Weather Service, the tornado lasted just four minutes from its formation a few hundred yards west of the Amazon facility to its dissipation four miles to the northeast, where it deposited debris from the warehouse on neighborhoods that suffered mostly minor damage, including blown-off roofing tiles and broken tree limbs. The only deaths or serious injuries came at the Amazon facility.</p><p>The bodies of the six deceased workers were recovered in the rubble at the south end of the building, where the worst of the collapse happened, Amazon spokeswoman Kelly Nantel said. She added that she could not confirm survivor reports that some of the dead had been sheltering in the restrooms on the south end.</p><p>Some concerns raised in initial news reports have proved unfounded. Harris, as well as Amazon workers at a sister facility across the street, said there was no rule preventing them from carrying cellphones while at work, and that most workers do carry phones, allowing them to receive safety alerts. Other accounts tell of workers inside the facility talking to loved ones as the storm approached or dialing emergency services after.</p><p>But why the six workers who died never made it to the shelter zone on the north side of the building is unclear, as is why the building's southern end suffered such serious damage.</p><p>\"We know that this was a super-fast storm. It appeared and disappeared very quickly,\" Nantel said. \"There wasn't a lot of time, but there was enough time for the site leaders to get the vast majority of the people moving to the front of the building. And we're really pleased with that because they saved a lot of lives.\"</p><p>In a statement, the company called the collapse \"a devastating tragedy for our Amazon family.\"</p><p>The Occupational Safety and Health Administration confirmed Monday that compliance officers have been at the collapse site since last weekend. The agency has six months to conduct the investigation, it said in a statement. (Amazon founder Jeff Bezos owns The Washington Post.)</p><p>Amazon, the second-largest private employer in the country, has built a vast network of warehouses, delivery vans and planes across the country, overseeing a logistics operation that rivals United Parcel Service in scale and scope.</p><p>The tech giant, which accounts for about 40 percent of total online sales, according to analyst eMarketer, delivers many of its own packages in a day or two. Of its approximately 1,100 warehouses nationwide, nearly 600 are delivery centers like the one in Edwardsville, according to logistics consulting firm MWPVL International.</p><p>Amazon generally leases distribution centers, which usually are built before a tenant is found, according to a former senior executive who spoke on the condition of anonymity to describe sensitive matters.</p><p>Amazon has been renting the Edwardsville facility since 2020, Nantel said. The warehouse was newly constructed by a local company, according to its website, with internal roadways where vans could pull in and drive around inside the building.</p><p>Warehouses have been vulnerable to storms in the past - another Amazon warehouse in Baltimore partially collapsed in 2018, killing two people during an EF-1 tornado.</p><p>The building collapse has heightened criticism of Amazon over its treatment of warehouse workers. That included early in the pandemic, when workers complained of poor coronavirus safety procedures. Workers have also complained about the speed and pacing of their work.</p><p>Warehouses are not required by federal law to have tornado shelters that meet international or Federal Emergency Management Agency standards. But workplaces are required to have emergency plans and procedures, and Amazon said all of its facilities have \"take shelter\" locations, which are generally interior rooms or areas without windows.</p><p>In Edwardsville, that location was a bank of restrooms and the hall between them, Harris said. There is no basement in the Amazon facility or in the surrounding warehouses used by other companies because of flooding risks, Nantel said.</p><p>There were 46 people on the property when the storm hit, Nantel said. Seven were Amazon employees and the rest were contractors such as Harris, who work for intermediary companies.</p><p>Nantel said the county tornado sirens started sounding at 8:06 p.m. that Friday. Shortly afterward, she said - she couldn't specify the exact minute - Amazon sent alerts to its drivers' phones telling them there was a tornado warning and that they should shelter in place. At the same time, Amazon managers started circulating through the facility and telling everyone to move to the shelter zone on the north side, Nantel said.</p><p>\"There's not a loudspeaker system in that facility, so they have megaphones. And so they were going around the building and just moving people across <span>,\"</span> she said.</p><p>Asked about Harris's report that his alert arrived in Spanish, Nantel said she could not comment. Harris said it's possible a previous driver had switched the phone, which remains in the vehicle, to a Spanish-language setting.</p><p>Text messages on Harris's personal phone show that the city of St. Louis, where he lives, first alerted him to a tornado watch in the area at 5:25 p.m. The city texted again at 8:09 p.m., upgrading the alert to a tornado warning and ordering recipients to \"take shelter now!\"</p><p>Harris was constantly driving his delivery van during those hours and didn't read the messages until later, he said. As he crossed a bridge on his way to the gas station, he could see the weather turning. \"There was lightning everywhere. . . . It was really windy outside. My windows were raised down and the van was, like, rocking. . . . I didn't know it was a tornado coming still. I just thought it was adverse weather.\"</p><p>As the storm approached, Carla Cope called her son, Clayton Cope, who was working in the warehouse. She told Clayton to seek shelter, but he first wanted to help someone else get to a safe area, she said in a phone interview. She later learned that he died when the structure collapsed.</p><p>At 8:16 p.m., the county sent a tornado warning to mobile phones, Nantel said. The tornado hit the Amazon facility 11 minutes later, at 8:27 p.m., she said. The National Weather Service said the tornado \"touched down\" west of the distribution center at 8:28 p.m.</p><p>When Harris reached the shelter zone, he huddled with others in the corridor for a few moments, then dove into the bathroom as he saw debris flying. Within minutes, the noise died down and the worst was over.</p><p>Sixteen people were huddled in the men's restrooms with him, and more were in the women's rooms on the other side of the corridor, he said. Soon, three additional men stumbled into the men's room covered in grime from the debris, Harris said.</p><p>One of the men said he had been sheltering in the restrooms on the south side of the building, where the worst of the collapse occurred. Two other men who had been sheltering with him there didn't make it out, the man told Harris.</p><p>\"He said he heard them hollering and screaming and it just all stopped,\" Harris recalled.</p><p>The two other men who belatedly made it to the shelter zone had been heading that way when the tornado struck and somehow survived amid the flying debris, Harris said they told him. The shelter area remained illuminated when the rest of the warehouse went black, allowing survivors to make their way there, Harris said.</p><p>In their call to 911, the two women trapped in the collapsed bathroom said they were in \"the back\" of the building near the highway, an apparent reference to the south side. \"I hear other people screaming, but I don't know where they are,\" one of the women told the dispatcher.</p><p>\"There's people in the men's bathroom, there's people in the middle of the warehouse, and there's three of us in the women's bathroom,\" the second woman said. The call ended when emergency services arrived.</p><p>The investigation into the warehouse collapse is ongoing. But so far, engineering experts say a tragic combination of events seems to have brought down the walls.</p><p>Warehouses by design have huge open spaces to store inventory or large machinery. Their giant open walls don't rely on vertical supports on the building's perimeter to resist wind load, said Frank Lombardo, an assistant professor at the University of Illinois at Urbana-Champaign, who researches wind engineering and hazard mitigation. Instead, the walls are held in place by the roof.</p><p>When powerful winds hit the sides of the building, the wind load travels up the concrete wall to the roof. If the roof lifts, the massive walls can collapse inward.</p><p>The Amazon facility appears to have been constructed with a \"tilt-up\" method, where the concrete walls are lifted into place and supported by a brace until the roof is installed to hold them in place.</p><p>\"The connection between the roof and walls can fail, and at that point, essentially nothing is holding up the wall,\" Lombardo said. \"The construction method is fine. The issue is when they collapse, the results are catastrophic.\"</p><p>Presumably, the building was built to withstand a certain amount of wind load, he said, but the storm could have outstripped what the construction was prepared to handle.</p><p>Those standards could soon change. The Structural Engineering Institute of the American Society of Civil Engineers published standards on tornado loads for the first time in its latest recommendations - standards that are adopted into building codes.</p><p>The new standards will take time to fully take effect, but they are pushing builders and regulators to take heed of a risk that wasn't historically considered much in construction: tornadoes.</p><p>\"People are realizing that tornadoes are a bigger risk than we thought,\" Lombardo said.</p><p>Warehouses have a huge amount of surface area, and companies generally want to use as much as possible for operations, said John Curtis, chief executive of JEC Consulting Services, which designs the insides of warehouses. It's common to see warehouses mark interior areas without windows as emergency shelters, he said.</p><p>Several logistics consultants who are former executives at companies with large distribution centers said companies are careful to comply with building codes but that shelters built specifically for storms are not common in warehouses.</p><p>Ivan Hofmann, principal of the consulting group Etc &amp; Associates and a former FedEx executive, said he expects there will be a push now for shelter regulations from building authorities.</p><p>Clayton Cope, who would have turned 30 this month, was a \"great kid\" who loved his dog and his Harley-Davidson, his mother said.</p><p>\"We loved the same music. We liked to cook together. He had a really quirky personality, and people just loved him. He was really generous, he would do anything for anyone,\" Carla Cope said.</p><p>Amazon has offered condolences and money to pay for funeral expenses, Cope said. Beyond that, she added, \"I haven't had time to process anything else other than burying my son.\"</p><p>jeanne.whalen@washpost.com</p><p>rachel.lerman@washpost.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 The Washington Post</p></div>"}