{"date": "2022-02-23 12:00:01.134000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p>\n<b>MATRIXX Software<sub> </sub>Announces Availability on AWS Outposts, Creating New Edge Monetization Opportunities for Telecom</b>\n</p><p>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.matrixx.com&amp;esheet=52584017&amp;newsitemid=20220223005611&amp;lan=en-US&amp;anchor=MATRIXX+Software&amp;index=1&amp;md5=aa68635c44444ca97d9b77f271365a5e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">MATRIXX Software</a>, a global leader in 5G monetization, today announced availability of the cloud native MATRIXX Digital Commerce on <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Foutposts%2F&amp;esheet=52584017&amp;newsitemid=20220223005611&amp;lan=en-US&amp;anchor=AWS+Outposts+by+Amazon+Web+Services&amp;index=2&amp;md5=8d92b31489a36a3d393641e371326467\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Outposts by Amazon Web Services</a> (AWS). By running MATRIXX on AWS Outposts, global communications service providers (CSPs) gain an industry-leading edge cloud monetization solution that delivers the cost savings and scalability of public cloud as well as the privacy and performance of on-premises deployments. The joint solution, currently being deployed at a multinational carrier, has a proven ability to power diverse monetization needs, including 4G/5G/fixed monetization of consumer and enterprise services.\n</p><p>\n“Telcos are rapidly adopting public cloud and seeking solutions best suited for modern business,” said Marc Price, chief technology officer at MATRIXX Software. “Hybrid and edge-based cloud solutions are often the best choice, harnessing cloud scalability without compromising on privacy and speed. Leveraging MATRIXX on AWS Outposts, operators gain the benefits of a truly modern monetization solution to unlock performance and cost advantages for new product and service offerings.”\n</p><p>\nBy extending existing capabilities of MATRIXX on Amazon Elastic Kubernetes Service (Amazon EKS), MATRIXX now runs on AWS Outposts, a fully managed solution delivering AWS infrastructure and services to virtually any on-premises or edge location for a truly consistent hybrid experience. MATRIXX on AWS Outposts offers a new way for CSPs to get the benefits of MATRIXX’s high-performance, low-latency monetization capabilities based on their hybrid and edge cloud requirements. By empowering CSPs with a way to harness the benefits of public cloud at the edge, MATRIXX on AWS Outposts makes it possible to develop, scale and monetize innovative new products and services based on each CSPs unique needs and requirements.\n</p><p>\n\"Until recently, operators had to choose between the scalability and cost benefits of the public cloud and the low-latency compute and data residency results of on-premises deployments,\" said Jennifer Kyriakakis, founder and chief marketing officer at MATRIXX Software. \"Now, with MATRIXX Digital Commerce on AWS Outposts, we offer the best of both worlds. Telcos get highly configurable monetization capabilities running in a secure and massively scalable hybrid cloud environment.\"\n</p><p class=\"bwalignc\">\n- ENDS -\n</p><p>\n<b>About MATRIXX Software</b>\n</p><p>\nMATRIXX Software is a global leader in 5G monetization for the communications industry. Serving many of the world’s largest operator groups, regional carriers and emerging digital service providers, MATRIXX delivers a cloud native digital commerce solution that enables unmatched commercial and operational agility. Unifying IT &amp; networks, MATRIXX delivers a network-grade converged charging system (CCS) enabling efficient hyper-scaling of infrastructure to support consumer services, wholesale and enterprise marketplaces. Through its relentless commitment to product excellence and customer success, MATRIXX empowers businesses to harness network assets and business agility to succeed at web scale.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20220223005611r1&amp;sid=ny6r1&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjIwMjIzMDA1NjExcjEmc2lkPW55NnIxJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=04bbd6e0277debe8dc53e70570674d83f96875a68e098fe1db8836b953327d0e71972b6de7fa4b0f27141933bcfddf74d3a81057eb0276ff56c14dd01db8bbd8\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20220223005611/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220223005611/en/</a></span></p><p>\n<b>Media Contact \n</b><br/>Jennifer Kyriakakis\n<br/><a href=\"mailto:mediainquiry@matrixx.com\" data-type=\"email\" translate=\"no\">mediainquiry@matrixx.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2022</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: CA-MATRIXX-SOFTWARE</p></div>"}