{"date": "2021-11-24 20:06:23.072000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3580.04, "close": 3504.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>NEW DELHI</p></div><div class=\"tr-npp-lead\"><p>NEW DELHI, Nov. 24 -- The Supreme Court on Tuesday asked Amazon not to mix up the matters arising out of orders of other courts and tribunals with the main challenge pending before it on the proposed sale of retail assets by Future Group to the Mukesh Ambani-led Reliance Industries.</p><p>A bench, headed by Chief Justice of India NV Ramana, observed that the companies involved in the legal wrangle should institute cases separately against different orders of the courts and not everything related to Amazon and Future would be heard in the same batch of cases.</p></div><div class=\"tr-npp-body\"><p>\"Don't bring everything in this batch of cases. You avail of your remedies separately,\" the bench, which also included justices AS Bopanna and Hima Kohli, told Amazon's lawyer Gopal Subramanium while hearing the clutch of cases relating to Future Group's $3.4 billion sale of retail assets to Reliance.</p><p>Amazon challenged a November 16 order of the Delhi high court by moving an application in the main case. By this order, the HC expedited the proceedings before the Competition Commission of India (CCI) that in June issued a show-cause notice to Amazon over the revocation of approval given to the US-based company for the investment transaction with Future Coupons Pvt Ltd (FCPL). The HC order was passed on a petition filed by the Confederation of All India Traders (CAIT).</p><p>Looking at this application, the bench said that this issue required a separate hearing. \"CCI is a separate forum. Some PIL, some petition (was) filed and the high court passed some order. Right or wrong, we will see separately. But that can't be heard with these cases,\" the bench told Subramanium.</p><p>It also observed that the apex court's September 9 order asking the Delhi HC not to proceed with the Amazon-Future case any further was confined only to the proceedings already initiated before it by the Future Group and Amazon.</p><p>\"Read our order. It is being treated as a gag order. Did we ask the high court not to hear anything? We only passed the order confined to proceedings pending before us. Will we hear all Amazon cases here now? That was never the intent or language of our order,\" added the bench.</p><p>At this, Subramanium apprised the bench that Amazon has also filed a special leave petition separately against Delhi HC order of 16 November. Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}