{"date": "2021-11-16 18:24:25.261000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Chennai</p></div><div class=\"tr-npp-lead\"><p>Chennai, Nov. 16 -- The Vanniyar Sangam, the parent body of the caste-based party Pattali Makkal Katchi (PMK), has issued a legal notice to the makers of Tamil movie Jai Bhim and OTT platform Amazon Prime to remove certain scenes where the organisation's symbol is present, which they say portray their community in poor light.</p><p>PMK is part of the National Democratic Alliance (NDA) in Tamil Nadu.</p></div><div class=\"tr-npp-body\"><p>The notice on Monday sought damages in Rs.5 crore within seven days from the time of receipt of the notice. On behalf of T Arulmozhi, the Vanniyar Sangam state president, PMK's spokesperson and advocate K Balu has issued the legal notice to the team including S Suriya and TJ Gnanavel, the lead actor and director of Jai Bhim , Suriya's wife Jyothika and the couple's production house 2D Entertainment Private Limited and a representative of Amazon Prime demanding they issue an unconditional apology. The legal notice also asked those behind the film to \"cease and desist from making or publishing any false, malicious and defamatory remarks against (the Vanniyar) community and its people.\"</p><p>Jai Bhim is a real life story of a tribal man who was falsely implicated in a case and died in custody due to police torture in 1993 and the film shows how his wife and retired high court justice K Chandru fight for his justice. The case Rajakannu Versus State of Tamil Nadu and others resulted in three policemen being sentenced to 14 years rigorous imprisonment for the murder of Rajakannu.</p><p>The notice stated that the movie has retained the real names of all the characters. \"But deliberately you have changed the name of the sub inspector of police, who had tortured the victim in the police custody,\" the notice stated. They alleged that the real name of the sub-inspector is Anthonysamy but the movie \"deliberately\" named him as Gurumurthy and \"repeatedly referred to him as Guru\" which they said was related to the community's prominent late leader J Guru.</p><p>The notice also pointed out that the symbol Agni Gundam (meaning raging flame from the holy pot) has been a sacred symbol of the Vanniyar community for many centuries which has been used in the movie in reference to the sub-inspector. \"In one of the 4 sequence in the movie, you have shown the symbol of Vanniyar Sangam in the calendar behind the Sub Inspector of Police who commits the atrocity of torture in the movie,\" they said.</p><p>\"You have deliberately got printed a calendar of the year 1995 with the symbol of \"Agni Kundam'' representing the Vanniyar Sangam and community with a malafide intention of defaming the members of Vanniyar sangam and damaging the image and reputation of entire vanniyar community.\" The notice added that the makers have done this \"wantonly, wilfully and intentionally\". They added that it cannot be considered as a \"casual, innocent, inadvertent mistake\" in the movie which has now been viewed by millions of cine lovers across the globe which was released on November 2 on the OTT platform.</p><p>\"You have projected the said wicked person, a wrongdoer, as if he belonged to Vanniyar community thereby imputing that the members of the Vanniyar community are prone to commit wrong and illegal things while in real life the said Sub Inspector does not belong to Vanniyar Community.\"</p><p>The notice said that the community has supported welfare of those marginalised and the film has caused communal disharmony. They noted that if the makers failed to comply, the Vanniyar Sangam would initiate criminal proceedings under section 499, 500 and 505 of the Indian Penal Code and suitable civil proceedings for claiming damages.</p><p>Earlier this month, PMK leader and former union minister Anbumani Ramadoss wrote a letter to actor Suriya demanding answers. The actor had last week responded refuting the allegations.</p><p>In his reply to Anbumani, Suriya said that he had no intention to insult anyone. \"I hope you are aware that corrections were carried out as soon as some people pointed out mistakes,\" he had said on November 12. Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}