{"date": "2022-02-25 18:21:45.206000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3027.16, "close": 3071.26}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>India</p></div><div class=\"tr-npp-lead\"><p>India, Feb. 25 -- Winter in India is on its way out and the great Indian summer is closing in. It is about time one begins to prepare for long periods of heat and sweat. One way to deal with such issues is to pick the right garments. An option for women could be mini skirts.</p><p>They are short and so they obviously are comfortable to wear in summers months. They are stylish and uber chic. What's more is that they can be versatile too. You can wear them with sneakers or stilettos. They also come in a huge variety - from pretty pleated ones, monochrome styles to sequinned ones. Their design too offers much variety - from pencil skirts, skater skirts, flared skirts, ruffled skirts to layered skirts and much more.</p></div><div class=\"tr-npp-body\"><p>For this discussion we have selected those that go well with sneakers. Amazon has an amazing collection of skirts. What's more is that they are also priced moderately. Take a look.</p><p>This beige check skirt has a rather trendy style and can be worn for casual gatherings and sports functions. Whatever the occasion, this skirt will make you look like a fashionista. This is a high-waisted skirt with pleats. It comes with an A-line styling. It has an inner comfortable lycra shorts, which stretches, to fit you perfectly. This is a must-have for your wardrobe. You can wear it in all seasons. It has been made from polyester fabric and can be easily washed. It is available from sizes extra small and goes up to extra large.</p><p>This pencil skirt is made from lycra fabric and can stretch easily. It is a thigh length skirt and looks very smart when paired with sneakers. However, it can also be worn with a pair of stiletto. While it looks good as a casual wear item, it can also transform into a formal wear in no time. It comes with an elasticated waist band. It is available from sizes extra small to large.</p><p>This mini skirt too is a pencil skirt. It is available in colour black. It looks good with a pair of sneakers and can be paired with stilettos and boots as well. It comes in a soft-feel fabric with elastic waist band. This skirt is 17 inches in length. This garment is available from the size 26 and goes up to 36.</p><p>This mini skirt comes with a moderate fit style. Its checkered pattern looks attractive and the skirt drapes well. It comes with elasticated waist band with considerable stretch that provides good scope to fit in different body types. Its fabric is a blend of polyester and spandex. It begins from extra small size and goes up triple extra large size.</p><p>At Hindustan Times, we help you stay up-to-date with latest trends and products. Hindustan Times has affiliate partnership, so we may get a part of the revenue when you make a purchase. Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}