{"date": "2022-01-10 04:05:34.873000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>One of the most useful qualities of labor unions is their ability to force Good Liberals to actually demonstrate their principles in a tangible way. It is easy for a self-proclaimed progressive business owner to say all the nice things about how they believe in equality and fair wages and worker rights – but when their employees unionize and come to <span>claim</span> those rights, those nice bosses must stop talking about how nice they are, and prove it. For limousine liberals, dealing with unions is where the rubber hits the road.</p><p>Needless to say, many Good Liberals turn out to be charlatans. There is a saying in the union world: \"A boss is a boss.\" This is a more pithy way of saying: \"A boss is kind of a greedy jerk, no matter how many 'Nevertheless, she persisted' bumper stickers they have plastered on their Volvos.\"</p></div><div class=\"tr-npp-body\"><p>The New York Times is one of America's most vital totems of mainstream liberalism, right up there with expensive coffee and defensive explanations for sending your kids to private school. The New York Times is also, it turns out, one of America's very best examples of how a boss is a boss. Because even as the paper pontificates about the dangers of inequality and gives sympathetic coverage to major union drives, the leaders of the company's business side are busily trying to undermine their own unions.</p><p>Last April, 650 tech employees at the New York Times announced that they were unionizing. Rather than applauding them and proceeding to negotiate a contract, the company instead refused to voluntarily recognize the union. This is despite <a href=\"https://www.nytimes.com/2007/03/06/opinion/06tues1.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">its own editorial board</a> supporting a bill that would have made it legally binding for employers to voluntarily accept union requests when they are backed by a majority of the staff.</p><p>As the paper's own editorial explained: \"Under current law, an employer can reject the majority's signatures and insist on a secret ballot. But in a disturbingly high number of cases, the employer uses the time before the vote to pressure employees to rethink their decision to unionize.\" Now, this is what the New York Times company is accused of doing to its own employees.</p><p>Since last year, the Times has been accused of trying to <a href=\"https://inthesetimes.com/article/new-york-times-tech-workers-guild-union-drive\" data-type=\"url\" class=\"tr-link\" translate=\"no\">scare</a> workers into changing their minds – to sow division among the employees, divide the unit, and erode support for organized labor. Last week, federal labor regulators <a href=\"https://www.bloomberg.com/news/articles/2022-01-05/new-york-times-illegally-restricted-labor-activism-u-s-alleges?sref=P6Q0mxvj\" data-type=\"url\" class=\"tr-link\" translate=\"no\">claimed</a> that the company had broken the law by telling large swaths of employees that they were actually \"managers\", and that they were therefore prohibited from publicly supporting the union. (A hearing is scheduled for this March. A spokesperson for the Times said they \"strongly disagree\" with the union's allegations.)</p><p>If you find this sort of anti-union behavior from the New York Times surprising, remember that another unit of unionized workers at the paper, those who worked for the product review section Wirecutter, had to go on <a href=\"https://www.nyguild.org/post/wirecutter-union-reaches-deal-on-first-contract-with-the-new-york-times-after-black-friday-strike\" data-type=\"url\" class=\"tr-link\" translate=\"no\">strike</a> during the busy Black Friday shopping weekend in order to secure a minimally fair contract. So while most of the editorial employees at the Times have been unionized for decades, the company is still exhibiting a chesty commitment to doing everything possible to keep any more of its workers from securing the same sort of benefits.</p><p>I don't want to get caught up here in the details of labor regulations and lose sight of the big picture. Which is this: the New York Times Company, which makes its money by branding itself as the foremost defender of liberal American values, is fighting against its own workers pursuing their right to organize a union and bargain collectively. <br/> </p><p>Respectable people don't engage in union-busting. People who run anti-union campaigns are not Good Liberals</p><p>To me, that makes the New York Times an anti-union company. I can say this with no qualms. Companies that are <span>not</span> anti-union will honor a formal request from their employees for voluntary union recognition; they will bargain fair contracts that include pay equity for all; and they will certainly not run internal messaging campaigns trying to convince their employees that unionizing is a bad idea.</p><p>The New York Times has done all of these things, quite recently. This means that it can stand proudly with its dishonorable peers across corporate America in that regard. While its writers editorialize against the deep political and economic problems plaguing our country, its management is very much a part of those problems.</p><p>The New York Times gets away with a lot. They are the journalism equivalent of the supreme court. They offer prestige, big budgets and job stability at a time when those things are in short supply in this industry. The half of our country terrified by Trump sees them as an army of truth, and everyone in media wants to work there. (Call me!) But let's be honest: the people who control the New York Times company are acting like real weasels.</p><p>It's not just that they are hypocritical, yammering about the public good while acting from pure selfishness – it's that they want to have it both ways. While more outwardly evil media bosses like Rupert Murdoch may be proud to embrace their Ayn Randian reputation, those who lead the Times want to be accepted as good people on the Brooklyn-brownstone cocktail party circuit, even as they quietly try to stop those who work for them from having an equal seat at their tastefully appointed table. Screw that.</p><p>I have covered hundreds of anti-union campaigns. No matter where they happen, they are all based on lies and fear. Whether they happen at an Amazon warehouse or at the New York Times, they are a demonstration of contempt for the idea that an employee may deserve to be treated as someone whose humanity is just as real as that of an employer.</p><p>Respectable people don't engage in union-busting. People who run anti-union campaigns are not Good Liberals. Hundreds of workers raising their voices have not been enough to convince the New York Times executives to act right. Maybe it's time to stop inviting them to the cocktail parties.</p><ul class=\"bulleted-list arrowlist\"><li> </li></ul><p>Hamilton Nolan is a labor reporter at In These Times</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 theguardian.com-NonSyndicated</p></div>"}