{"date": "2022-01-17 14:41:17.032000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MOTORSPORT GAMES INC (\"MSGM-Q\")\n- And Live Fast Motorsports Announce Increased Partnership for 2022\n- NASCAR Season\n\n     Motorsport Games Inc. (\"Motorsport Games\"), a leading racing game\ndeveloper, publisher and esports ecosystem provider of official motorsport\nracing series throughout the world, announces its increased technical\npartnership with Live Fast Motorsports, the single-car Ford Mustang team\ncompeting full-time in the NASCAR Cup Series under the No. 78 car. This\ndeal will advance the partnership between Motorsport Games and Live Fast\nMotorsports, co-owned by driver BJ McLeod and Matt Tifft, that began last\nyear.\n\n     The technical partnership will expand Motorsport Games' access to the\nreal-life NASCAR grid throughout the 2022 racing season, including tracks,\nnuances and feedback of professional stock car driving and key data at the\nteam's disposal. Motorsport Games already has strong access to NASCAR\nthrough its work with the series, but this partnership will serve to\nincrease its ability to communicate with a team on a more intimate level.\nThroughout the agreement's term, Motorsport Games will be present within\nthe Live Fast Motorsports garage, opening up lines of communication\npreviously unavailable between racing team personnel and Motorsport Games.\nMotorsport Games will additionally gain real-time experience and feedback\nthat it plans to implement directly into its NASCAR video game franchise,\nincluding the ability to make real-time updates into its NASCAR 21:\nIgnition and future titles, and that overall is designed to provide racing\nenthusiasts with the most realistic and authentic driving experience on the\nmarket.\n\n     \"Motorsport Games cannot have asked for a better strategic partner\nthan Live Fast Motorsports and we look forward to continuing our\ncollaboration into the next NASCAR season,\" said George Holmquist, VP of\nPublishing and Marketing, Motorsport Games. \"BJ, Matt and the entire Live\nFast Motorsports team have been fantastic partners and we cannot thank them\nenough for the unparalleled level of access they are giving our company. We\nwill be taking our real-time on track findings directly from the team on\nthe NASCAR grid into our game designs, further exemplifying our commitment\nto providing our players with the most dynamic and true to life gaming\nexperience imaginable.\"\n\n     \"Throughout the past year, Motorsport Games has been an amazing\npartner to the No. 78 car and we're excited to keep the momentum going by\nrepresenting the company in seven of the biggest races next season,\" said\nBJ McLeod, driver and co-owner, Live Fast Motorsports. \"I've always been a\npersonal fan of video games, especially those involving my favorite sport.\nIt's exciting to have this opportunity to provide feedback throughout the\nseason to help create the best NASCAR game possible. I can't wait to get\nstarted this season with Motorsport Games at Daytona all the way through\nMartinsville.\"\n     \"We're thrilled to welcome Motorsport Games back as our partner for\nthe second year. Last year, they became our founding partner and we had a\nterrific season together,\" added Matt Tifft, co-owner of Live Fast\nMotorsports. \"Motorsport Games has given us the ability to better connect\nwith our younger fans on a more intimate level through its video games.\nThis year, we look forward to keeping the engagement rolling with our\nexpanded partnership. Our entire Live Fast Motorsports family welcomes back\nMotorsport Games, as they are truly one of our own.\"\n\n     NASCAR 21: Ignition, the current iteration of Motorsport Games' NASCAR\nfranchise for the 2021 NASCAR Cup Series, is available now on Sony\nPlayStation 4, Microsoft Xbox One and PC through the Steam store. NASCAR\n21: Ignition is developed and published by Motorsport Games and is powered\nby Unreal Engine and Studio 397's highly-acclaimed rFactor physics engine.\nThe use of both Unreal Engine and rFactor physics gives users a more\nauthentic driving experience, immersive gameplay, dynamic AI and stunning\nvisuals.\n\n     To keep up with the latest Motorsport Game news, please visit\nwww.motorsportgames.com and follow on Twitter, Instagram, Facebook and\nLinkedIn.\n\n     About Motorsport Games:\n     Motorsport Games, a Motorsport Network company, combines innovative\nand engaging video games with exciting esports competitions and content for\nracing fans and gamers around the globe. The Company is the officially\nlicensed video game developer and publisher for iconic motorsport racing\nseries, including NASCAR, INDYCAR, 24 Hours of Le Mans and the British\nTouring Car Championship (\"BTCC\"), across PC, PlayStation, Xbox, Nintendo\nSwitch and mobile. Motorsport Games is an award-winning esports partner of\nchoice for 24 Hours of Le Mans, Formula E, BTCC, the FIA World Rallycross\nChampionship and the eNASCAR Heat Pro League, among others. For more\ninformation about Motorsport Games, visit www.motorsportgames.com.\n\n     Forward-Looking Statements:\n     Certain statements in this press release which are not historical\nfacts are forward-looking statements within the meaning of Section 27A of\nthe Securities Act of 1933, as amended, and Section 21E of the Securities\nExchange Act of 1934, as amended, and are provided pursuant to the safe\nharbor provisions of the Private Securities Litigation Reform Act of 1995.\nAny statements in this press release that are not statements of historical\nfact may be deemed forward-looking statements. Words such as \"continue,\"\n\"will,\" \"may,\" \"could,\" \"should,\" \"expect,\" \"expected,\" \"plans,\" \"intend,\"\n\"anticipate,\" \"believe,\" \"estimate,\" \"predict,\" \"potential,\" and similar\nexpressions are intended to identify such forward-looking statements. These\nforward-looking statements include, but are not limited to, statements\nconcerning the Company's expected benefits from its partnership with Live\nFast Motorsports, such as its plans to implement real-time experience and\nfeedback directly into its NASCAR video game franchise, including making\nreal-time updates into its NASCAR 21: Ignition and future titles, and will\nprovide racing enthusiasts with the most realistic and authentic driving\nexperience on the market. All forward-looking statements involve\nsignificant risks and uncertainties that could cause actual results to\ndiffer materially from those expressed or implied in the forward-looking\nstatements, many of which are generally outside the control of Motorsport\nGames and are difficult to predict. Examples of such risks and\nuncertainties include, but are not limited to difficulties, delays or less\nthan expected results in achieving the Company's expected benefits from its\npartnership with Live Fast Motorsports, such as due to unforeseen technical\ndifficulties, or higher than anticipated costs, in implementing the Live\nFast Motorsports real-time data into its gaming franchises, such as its\nNASCAR 21: Ignition franchise. Factors other than those referred to above\ncould also cause Motorsport Games' results to differ materially from\nexpected results. All forward-looking statements involve significant risks\nand uncertainties that could cause actual results to differ materially from\nthose expressed or implied in the forward-looking statements, many of which\nare generally outside the control of Motorsport Games and are difficult to\npredict. Factors other than those referred to above could also cause\nMotorsport Games' results to differ materially from expected results.\nAdditional factors that could cause actual results to differ materially\nfrom those expressed or implied in the forward-looking statements can be\nfound in Motorsport Games' filings with the SEC, which may be found at\nwww.sec.gov and at ir.motorsportgames.com, including its Annual Report on\nForm 10-K for the fiscal year ended December 31, 2020, its Quarterly\nReports on Form 10-Q filed with the SEC during 2021, as well as in its\nsubsequent filings with the SEC. Motorsport Games anticipates that\nsubsequent events and developments may cause its plans, intentions and\nexpectations to change. Motorsport Games assumes no obligation, and it\nspecifically disclaims any intention or obligation, to update any\nforward-looking statements, whether as a result of new information, future\nevents or otherwise, except as expressly required by law. Forward-looking\nstatements speak only as of the date they are made and should not be relied\nupon as representing Motorsport Games' plans and expectations as of any\nsubsequent date. Additionally, the business and financial materials and any\nother statement or disclosure on, or made available through, Motorsport\nGames' website or other websites referenced or linked to this press release\nshall not be incorporated by reference into this press release.\n\n     Website and Social Media Disclosure:\n     Investors and others should note that we announce material financial\ninformation to our investors using our investor relations website\n(ir.motorsportgames.com), SEC filings, press releases, public conference\ncalls and webcasts. We use these channels, as well as social media and\nblogs, to communicate with our investors and the public about our company\nand our products. It is possible that the information we post on our\nwebsites, social media and blogs could be deemed to be material\ninformation. Therefore, we encourage investors, the media and others\ninterested in our company to review the information we post on these\nwebsites, social media channels and blogs, including the following (which\nlist we will update from time to time on our investor relations website):\n//st\n\n         Websites              Social Media\n\n         motorsportgames.com   Twitter: @msportgames &amp; @traxiongg\n\n         traxion.gg            Instagram: msportgames &amp; traxiongg\n\n         motorsport.com        Facebook: Motorsport Games &amp; traxiongg\n\n                               LinkedIn: Motorsport Games\n\n                               Twitch: traxiongg\n\n                               Reddit: traxiongg\n\n//et\n\n     The contents of these websites and social media channels are not part\nof, nor will they be incorporated by reference into, this press release.\n\nInvestors:\nAshley DeSimone\nAshley.Desimone@icrinc.com\n\nPress:\nASTRSK PR\nmotorsportgames@astrskpr.com\n\n\nTel   : 305-507-8799    MOTORSPORT GAMES INC\nEmail : investors@motorsportgames.com\nWWW   : <a href=\"https://www.motorsportgames.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.motorsportgames.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201600442.MNPRE2201600964-06104820220117</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}