{"date": "2022-01-13 18:15:48.253000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3304.14, "close": 3242.76}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_j2t9heem&amp;referenceId=1_j2t9heem&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_j2t9heem&amp;referenceId=1_j2t9heem&amp;pageId=RefinitivNewscasts</a></pre>Source: Stocktube<br/><br/>Description: GinsGlobal's Anthony Ginsberg spoke to Proactive on trends he's seeing in the tech space as it relates to the HAN-GINS Tech Megatrends ETF. &amp;#xD;&amp;#xD;Ginsberg expalins according to its Monthly Tech Megatrend Market Report for December 2021, while the tech sector has seen volatility as of late, the fund's 8 sub themes have performed well, particularly robotics and automation.<br/>Short Link: <a href=\"https://refini.tv/3Gp9den\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3Gp9den</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; Hello and welcome back to Proactive New York. With me today is Anthony Ginsberg, and as they say we are talking about the GinsGlobal on HANetfs December monthly tech mega-trend market report. How are you? Happy new year. &gt;&gt; Happy new year. It's great to see you, Christine. It's an exciting time actually. Although Tech has had some volatility of late, a number of these sub-themes which we're fortunate to be will equally weigh, of course, across either these sub-themes, some of them have done really well, such as robotics and automation, primarily because of the onshoring and the supply chain problems. Particularly the American companies and a number of EU, large corporations are increasingly onshoring this demand for smarter machine learning. So we're seeing that whole sector has been significantly rerated, specifically robotics. We've also seen a bump up in genomics, which is gene editing and crisper. Another area has been Cloud technology too, which has actually had some large deals that have come through from the likes of Google, but also some very big banks that had actually embraced Cloud computing, people like JPMorgan and Wells Fargo does not adhere to the author I've touched on. This has been the global nature of cybersecurity and the fact that that has actually, because of the hex we saw in the US some months ago, being an embracement and re-balancing basically of embracing cybersecurity usage on one of the Cloud companies and software companies are working together and offering in lockstep deals. So both of those are almost like first cousins at this point. &gt;&gt; Can you talk a bit about electric vehicles and what kind of momentum you've been seeing there. &gt;&gt; Yeah, I neglected to mention that in China we saw a doubling of the sales of EVs in 2021. The results just came out, Tesla poses 80% above it's 2020 deliveries. And what we've seen in China is that EVs are expected to hit about 20% market share. They're currently at 15% based on 21's figures. But the whole point is that it's actually propelling the growth in China need to hit a 20% market share. It's way ahead of the US equivalent. In the US, we're sitting at about 4% mortgage share for EV says a lot of space and the Biden administration is devoting over a trillion dollars now to EV infrastructure. The passage of the recent infrastructure bill in the US Congress and the upcoming Biden budget should actually propel EV, infrastructure and sales here, as you know, by 2035 were outlawing electric vehicles, the highways around LA where I live. You won't see any traditional cars past 2035. So it's an exciting time and obviously Tesla led the way, but there's some big R&amp;D spending, something on the order of 55 billion. If you add up General Motors, Toyota, or in a four or five of the other large providers. So COG I'm just came out and said we're going eat Tesla's lunch in electric vehicles eventually. So all the big guys have committed significantly over the last six to 12 months. &gt;&gt; It's crazy to think about not seeing traditional cars on the road by then. You mentioned the robotics, the game there. What's pushing demand for robotics? &gt;&gt; Part of it is the supply chain problems. So interesting, even in electric vehicles don't use as many computer chips as a traditional car. So a lot of the guys have said, look, if we can bring the supply chain onshore. I mean, here in LA, we had over a 150 ships, big tankers, and containers all blocked at the port facility for months. So a lot of the bigger manufacturers in the US are trying to on-shore production away from China. So there certainly is a big move away. And of course, we also have the US-China political debate, which is also through the fueling, they pushed to have smaller machines and to basically automate increasingly her in the States. So it doesn't mean that employment is going to rise dramatically. It means that there's a huge uptick in demand for a smart machines here. &gt;&gt; You also mentioned the Cloud. Why is that being kind of more broadly embraced since the last time that we spoke? &gt;&gt; Great question. The idea of the hybrid and multi-cloud has allowed the big banks and even certain big trading platforms like NASDAQ and the Chicago Mercantile Exchange to actually embrace Cloud now. So the merger to the huge deal was there was Google also, we've seen firms like Oracle embracing Cloud in the medical space increasingly. The largest hospital group in the US is due to deal also with Google and Microsoft bought a large electronic set medical company to which relies on Cloud. So the genomic space is using Cloud, healthcare is using Cloud. Even Tesla uses the cloud. But I think primarily the big banks and financial services groups have finally come to the party likes of JPMorgan and Wells Fargo as well. By being able to use multi-Cloud platforms and then making the former one specific Cloud provider like AWS from Amazon, they're able to actually spread their risks more broadened, so that's a big reason and also globally they can actually separate their Cloud usage across borders. So it made life a lot easier for them to embrace Cloud. &gt;&gt; Talking about performance. The ETF is up from my understanding, 16% for 2021. Is that right? &gt;&gt; Yes. It was up until the end of November 16 plus percent. It was up overall around 10% because December Obviously there were a few wobbles in technology. The interesting thing is because we're equally weighted, we have a 115 holdings across these eight somethings. We were somewhat protected because the biggest challenges for tech has been some of the big market Fang stocks. So actually our Fang exposure is about a quarter of most tech ETFs. So we have actually our top ten holdings barely 11% of our funds. We quite diverse and spread compared to very concentrated competitors who may have a massive waiting and [inaudible 00:06:12]. We've always been very underweight [inaudible 00:06:14]. And as I said, we have over a 100 holdings equity weighted. So basically it's about a one percent exposure to each holding. &gt;&gt; All right, Anthony, good to catch up and talk about all things tech care. Thanks so much. &gt;&gt; Thanks, Christine.<br/></span></div></div></div></div>"}