{"date": "2022-01-31 17:27:31.220000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Every day, we scour Amazon to find the best deals available. Whether it's something for your kitchen or top-rated tech to give your smart home an upgrade, the online shopping giant offers some of the best prices on a  <span>very</span> wide range of items. Whatever you need, Amazon has you covered.</p></div><div class=\"tr-npp-body\"><p><span><span>Get deals and shopping advice delivered straight to your phone.</span> Sign up for text message alerts from the experts at Reviewed.</span> </p><p>Below, you'll find our top Amazon deals right now, including one of our favorite headphones, a reversible cast-iron grill and some wallet-friendly phones and tablets, all of which have been vetted by our team of deals experts to make sure they're \"best of web\" prices. If you're looking for N95 and KN95 masks this winter, Amazon also has plenty of choices on sale right now.</p><p>► <span>Presidents' Day:</span> Shop the best deals on TVs, appliances and everything in-between</p><p>► <span>Cloth masks are no longer recommended to protect against the omicron variant:</span> Here's how to find the best KN95 masks for kids and N95 masks are your best mask option—here's where to buy them online.</p><p>If you're not already an Amazon Prime subscriber, you can sign up for a 30-day membership for free. An Amazon Prime subscription gets you free two-day shipping and tons of other benefits for $12.99 a month ($6.49 for students and $5.99 for those receiving qualifying government assistance).</p><p class=\"tr-npp-section-title\">The best Amazon deals of the day</p><p><big>1. This reversible cast-iron grill</big> </p><p>Whether you like French toast or a juicy sausage, the Lodge LSRG3 single-burner grill/griddle can help make your favorite meals with ease. Typically listed for $47, this cast iron cookware is available now for at $24.90, or 47% off. Lodge says the 10.5-inch combo piece has one ribbed side for cooking burgers and grilling veggies, with its opposite side a standard grill for whipping up some bacon and eggs. Not only is it sized to go over a single stovetop burner, it also fits over home ovens and campfires.</p><p><span>Get the Lodge LSRG3 Cast Iron Single-Burner Reversible Grill/Griddle for $24.90 (Save $22.10)</span> </p><p><big>2. $40 off: One of our favorite headphones</big> </p><p>Amazon Echo Buds let you save big without sacrificing great audio quality. Normally priced at $119.99, these second-generation wireless earbuds are now available for $79.99 courtesy of a 33% discount. Amazon's latest earbuds are the best affordable headphones we've ever tried, having impressed us with their comfortable feel and the full active noise cancelation that blocked out unwanted surrounding sounds. Our tester found the seal the buds made in his ears was tight and secure whether he was casually enjoying music or out for a run.</p><p><span>Get the Amazon Echo Buds (Second Generation) for $79.99 (Save $40)</span> </p><p><big>3. Up to 25% off: These affordable mobile devices</big> </p><p>If the prices of most smartphones and tablets scare you away from updating your mobile tech, Amazon has a selection of TCL devices on sale. Take the TCL 10L Android smartphone, on sale in its 256-gigabyte capacity with a $60 price cut that brings the cost to $219.99. The brand says the 10L features a 6.53-inch FHD+ Dotch LCD display for the sharpest details and four rear camera lenses. There's also the TCL TAB 10s Android tablet typically listed for $199.99 but now selling for $40 off, bringing the price down to $159.99. With a 10.1-inch widescreen display, the tablet can handle HD video calls through its built-in dual microphone and speaker systems. </p><p><span>Save up to 25% off on TCL mobile devices</span> </p><p><big>4. 65% off: These multi-purpose paper towels</big> </p><p>If you want to keep your garage workstation spotless, the Scott Shop towels can help clean any mess. Typically listed for $54.99, you can get a case of 12 rolls for $18.98 through the Subscribe &amp; Save membership. With Subscribe and Save, you can get 5% off the delivery of your first order and up to 15% off repeat deliveries that you can schedule to arrive anywhere every two weeks to every six months. Scott says the towels are meant to clean up grease, oils and other fluids as an alternative to cloth towels.</p><p><span>Get Scott Shop Towels Original 12-Pack Case for $18.98 (Save $36.01)</span> </p><p><big>5. Save $184: This easy-to-use inversion table</big> </p><p>If you've got back pain, the Teeter FitSpine X3 inversion table promises safe and easy stretching. Normally priced at $469, this deluxe training tool is now 39% off at $284.99. Teeter says the X3 features an eight-point floating suspension system to let your body decompress and an adjustable lumbar bridge that supports and focuses traction on your lower back. The table also responds to simple arm movements that shift body weight, making it easier to invert your position at any time.</p><p><span>Get the Teeter FitSpine X3 Inversion Table for $284.99 (Save $184.01)</span> </p><p class=\"tr-npp-section-title\">The best Amazon deals from this week</p><p><big>1. Instant Vortex 5.7-Quart Air Fryer</big> </p><p>Make your home cooking easier with the Instant Vortex air fryer. Typically listed for $99.99, this 5.7-quart small appliance is now 22% off for $78.45. Instant Pot says the Vortex can air fry, broil, roast and reheat dishes with 95% less oil. You can choose one of those options through the touchscreen display and clean the air fryer's basket with a dishwasher.</p><p><span>Get the Instant Vortex 5.7-Quart Air Fryer for $78.45 (Save $21.54)</span> </p><p><big>2. Sony WH-CH710N Noise Canceling Headphones</big> </p><p>If you're in the market for a new pair of headphones you can pick up one of the best pairs we've ever tested, the Sony WH-CH710N noise canceling headphones, for as little as $98—a huge $81.99 price cut from the usual $179.99 tag. In testing, we were impressed with the headphones' high-tech features and found that they provided balanced sound and had a whopping 35-hour battery life. \"They cancel enough noise to be reliable headphones for work and play, and offer a taste of luxury at a price that's much more manageable than flagship travel cans,\" our testers said. </p><p><span>Get the Sony WH-CH710N Noise Canceling Headphones for $98 (Save $81.99)</span> </p><p><big>3. RubberMaid Meal Prep Premier Food Storage Container Set</big> </p><p>Make meal prep and dinner cleanups easier with the Rubbermaid meal prep premier food storage containers set. This best-selling kitchen storage set includes 14 shatterproof containers and easy-to-clean lids for a total of 28 pieces. The containers nest inside of each other and each lid can be snapped to the bottom of its base, making storage easier than ever. Better still, the set is freezer, microwave and dishwasher safe. Usually ringing up for $44.49, you can take home this kitchen essential for just $32.39 today thanks to a 27% markdown. </p><p><span>Get the Rubbermaid Meal Prep Premier Food Storage Container 28-Piece Set for $32.39 (Save $12.10)</span> </p><p><big>4. eufy by Anker HomeVac S11 Stick Vacuum</big> </p><p>Combat crumbs and pet hair on your floors with the eufy by Anker HomeVac S11 Infinity cordless stick vacuum cleaner, down from $279.99 to just $204.99. Designed for cleaning hardwoods and carpets, this lightweight vacuum comes with an extra detachable battery and plenty of convenient cleaning tools—including a floor brush, a 2-in-1 crevice tool and a soft roller brush. According to the brand, the vacuum can run for as long as 40 minutes on a single charge in low-mode and for up to 25 minutes in mid-mode. </p><p><span>Get the eufy by Anker HomeVac S11 Infinity Cordless Stick Vacuum Cleaner for $204.99 (Save $75)</span> </p><p><big>5. NOCO Boost Plus Jump Starter Box</big> </p><p>It's no secret that starting your car in cold weather can be problematic. Next time you find yourself dealing with a drained battery, give your engine a jump start with the NOCO Boost Plus jump starter box, down from $125.95 to $99.95 right now. This portable 12-volt 1000-amp power bank includes easy-to-use jumper cables, convenient USB ports and an LED flashlight—perfect for keeping in your trunk for an emergency situation. According to the brand, the portable car essential can give up to 20 jump starts on a single charge and works on up to 6-liter gas engines and up to 3-liter diesel engines. </p><p><span>Get the NOCO Boost Plus Jump Starter Box for $99.95 (Save $26)</span> </p><p class=\"tr-npp-section-title\">Other noteworthy Amazon deals we found </p><ul class=\"bulleted-list arrowlist\"><li>Save up to 30% on Amazon Fire TV Omni Series</li><li>Save up to 45% on Crest and Oral-B Tooth Whitening Kits and Toothbrushes</li><li>Save up to 64% on select Adidas footwear</li><li>SupplyAid KN95 Disposable 3-Layer Face Masks for $5.75 (Save $5.22)</li><li>Hertzko Self-Cleaning Slicker Brush for Dogs and Cats for $15.99 (Save $14)</li><li>Colonel Popper Microwave Popcorn Maker from $17.49 (Save $2.03 to $7.51)</li><li>Amazon Fire TV Stick Lite for $18.99 (Save $11)</li><li>Snow Joe SJ-SHLV01 Shovelution Strain-Reducing Snow Shovel for $20.99 (Save $9)</li><li>totes Women's Chelsea Ankle Rain Boots from $21.48 (Save $20.92 to $33.52)</li><li>Tile Sticker for $23.99 (Save $6)</li><li>WWDOLL KN95 Face Mask, 25 Pack for $28.74 (Save $18.68)</li><li>TurboTax Deluxe 2021 Tax Software Federal and State Tax Return PC Download for $39.99 (Save $20)</li><li>Cincom Rechargeable Hand Massager with Heat for $59.99 with coupon (Save $20)</li><li>Fitbit Charge 5 from $119.25 (Save $60 to $60.70)</li><li>Airthings Corentium Home Radon Detector for $135.90 (Save $64.05)</li><li>Apple AirPods Pro for $197 (Save $52)</li><li>eufy by Anker RoboVac G30 Robot Vacuum for $229.99 with coupon (Save $90)</li><li>Tempur-Pedic Queen Tempur Supreme Medium-Firm Mattress Topper for $239.40 (Save $159.60)</li><li>Apple 2020 iPad Air from $499.99 (Save $29.99 to $99.01)</li><li>Samsung 75-Inch Class Neo QLED QN90A 4K UHD Quantum HDR Smart TV for $2,597.99 (Save $902)</li> </ul><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Updated daily: Here are the 10 best Amazon deals today</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}