{"date": "2021-12-22 16:00:31.659000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.34, "close": 3421.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">KELA announces its recent product induction in AWS Marketplace to provide the highest quality attack surface intelligence and protection for organizations, empowering them to neutralize their most relevant threats without compromising on technology needs</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">TEL AVIV, Israel, Dec 22, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">TEL AVIV, Israel</span>, <span class=\"xn-chron\">Dec 22, 2021</span> /PRNewswire/ -- <u><a href=\"https://ke-la.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">KELA</a></u>, a global leader in dark web actionable threat intelligence, today announced that INTELACT, its dark web-based attack surface monitoring product, is now available for purchase in AWS Marketplace, a digital catalog with thousands of software listings from independent software vendors that make it easy to find, test, buy, and deploy software that runs on Amazon Web Services (AWS).</p>\n<div id=\"prni_dvprnejpgdf78left\" style=\"WIDTH:100%;TEXT-ALIGN:left\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img align=\"middle\" alt=\"KELA Dark Web Threat Intelligence\" border=\"0\" id=\"prnejpgdf78left\" src=\"https://mma.prnewswire.com/media/1714558/Kela_Cyber_Logo.jpg\" title=\"KELA Dark Web Threat Intelligence\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMTcxNDU1OC9LZWxhX0N5YmVyX0xvZ28uanBn&amp;key=15c6353a39e5deeaf54ce9bec11a1aaac4851773d76ec9b6ee8e318e64dc540bcbe28cb373d1d9e22fc2da7ac131e64bb1831c4cc8a4e46bd41d5f20a3435741\"/></div></div></div><p>KELA provides unrivaled visibility into adversary behaviors and relevant threats, illuminating and deciphering hidden events, activities, and actors that would typically go undetected and unanalyzed. KELA delivers the contextual intelligence for its customers to proactively neutralize threats before it impacts their business.</p>\n<p>\"An ever-changing cybercrime underground and endless security alerts require specialized intelligence to mitigate the risk of attack,\" said <span class=\"xn-person\">Ayesha Prakash</span>, Global Vice President - Partnerships &amp; Alliances at KELA. \"With the growing migration of technologies from on-premises to cloud, defenders seek automated solutions to neutralize relevant threats, reduce their attack surface, narrow down irrelevant noise, and take automated actions. INTELACT provides visibility into the organization's attack surface as seen from the eyes of potential attackers. With actionable alerts, real-time measurement of risk, and seamless integration to our customers' AWS environment, INTELACT arms our customers with the information and insight needed to stay on top of threats and ahead of attackers while maintaining the use of the most advanced cloud technologies.\"</p>\n<p>With INTELACT's attack surface monitoring, organizations can safely migrate more tools from on-premises infrastructure to the cloud. They can use the most advanced technologies yet remain alert for relevant potential threats to stay ahead of attackers and keep the organization protected. INTELACT's design consists of multiple AWS technologies to support the process and delivery of real-time alerts and contextualized insights to each of KELA's customers.</p>\n<p>INTELACT powerful features include:</p>\n<ul type=\"disc\" class=\"bulleted-list arrowlist\"><li>100% automatic delivery of targeted attack surface intelligence </li><li>Real-time alerts to proactively act on intelligence to eliminate immediate risks </li><li>Specific assets monitoring to receive only targeted and actionable intelligence </li><li>Efficient detection of dark web threats to help users maintain a reduced attack surface </li><li>Seamless integration to AWS environments and other security technologies</li></ul><p>Now and for a limited time only, KELA's customers can save an additional 30% on our dark web threat intelligence products in AWS Marketplace through the end of 2021.</p>\n<p>For more information on KELA's INTELACT on AWS, visit<a href=\"https://aws.amazon.com/marketplace/pp/prodview-3bmcemj62ogxs\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> </a><u><a href=\"https://aws.amazon.com/marketplace/pp/prodview-3bmcemj62ogxs\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://aws.amazon.com/marketplace/pp/prodview-3bmcemj62ogxs</a></u></p>\n<p><b>About KELA</b></p>\n<p>KELA takes away fear of unknown digital threats all organizations face. Trusted worldwide, our combined solution of exceptional automated threat intelligence technology and deep staff expertise delivers actionable threat intelligence that is highly relevant to your organization. Mining the cybercrime underground, KELA's solutions reduce your team's workload while enabling proactive, targeted defense.</p>\n<p>For more information about KELA, please visit <u><a href=\"https://ke-la.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.ke-la.com</a></u>.</p>\n<p><b>Contact Information</b></p>\n<p><span class=\"xn-person\">Efrat David</span><br/>+972-3-970-2720 <br/><u><a href=\"mailto:Marketing@ke-la.com\" data-type=\"email\" translate=\"no\">Marketing@ke-la.com</a></u></p>\n<p>Logo: <a href=\"https://mma.prnewswire.com/media/1714558/Kela_Cyber_Logo.jpg\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://mma.prnewswire.com/media/1714558/Kela_Cyber_Logo.jpg</a> </p>\n</div>\n<div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p></div>"}