{"date": "2021-11-19 19:42:16.191000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3696.06, "close": 3572.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Starbucks has opened a new, cashier-less concept store in New York, US, in partnership with Amazon Go.</p><p>Located at 59th Street between Park and Lexington Avenues, the new store is a combination of a Starbucks Pickup and an Amazon Go, offering an integration of digital and physical retail experiences.It features a modernised lounge with individual workspaces and tables, which are equipped with power outlets and USB ports.Starbucks said that the new concept restaurant offers its full menu as well as a wide range of food and beverage options from the Amazon Go market, including sandwiches, bakery items, snack options and freshly-prepared salads.Customers are required to place their order before their arrival at the Starbucks Pickup store, as it primarily accepts orders that are placed through the Starbucks app.They can place the order by selecting '59th between Park &amp; Lex w/ Amazon Go' as their desired Starbucks location in the app.Once the customer arrives at the location, they can find the status of their order on a digital screen in the store and then pick up their order directly from a Starbucks barista.In order to enter the Amazon Go market or the store's lounge seating, customers will be required to enter their 'In-Store Code' in the Amazon Shopping app, Amazon One or a credit card.Upon completion of their shopping, the purchased goods will be automatically added to the customer's shopping cart, and their card will be charged after the customer leaves the Amazon Go market.The new store concept is said to be part of Starbucks' trade area transformation strategy, with Starbucks and Amazon Go planning to open more such stores next year.Starbucks said that it plans to open the next Starbucks Pickup store at the New York Times Building.Starbucks global growth and development senior vice-president Katie Young said: \"The new Starbucks Pickup with Amazon Go is designed to provide our customers with an experience that delivers convenience and connection in an effortless way.\"In another development, Dine Brands International has announced the opening of its first virtual IHOP location in Toronto, Canada, by partnering with Ghost Kitchens Brands.At its 60 Sudbury Street location, in Toronto's Liberty Village area, guests can now enjoy a selection of IHOP offerings, including pancakes, breakfast combos, omelettes, burritos and bowls, for takeout and delivery.Additionally, customers can place orders for pickup or delivery through third-party delivery service providers.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}