{"date": "2021-11-05 15:46:10.135000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3384.0, "close": 3518.99}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>To Sponsor The Epoch Times Spanish Language YouTube Programs theeopchtimes.com Reaching over 60 million Strong Hispanic and Latino American Population of the USA</p>\n</div>\n<div class=\"tr-npp-body\">\n<pre>GLOBEX DATA LTD (\"SWIS-Z;SWISF-0\")\n- To Sponsor The Epoch Times Spanish Language YouTube\n- Programs - theeopchtimes.com - Reaching over 60 million Strong\n- Hispanic and Latino American Population of the USA\n\n     GlobeX Data Ltd. (\"GlobeX\" or the \"Company\"), the leader in Swiss\nhosted secure communications and secure data management, is pleased to\nannounce that, as part of its US mass marketing strategy to bring awareness\nto GlobeX Data's Sekur solution, it is sponsoring a series of Spanish\nlanguage YouTube episodes of The Epoch Times with hosts David Rojas and\nJulian Bertone, catered to the 60+ Million strong Hispanic and Latino\nAmerican population in the USA. The sponsorship is part of a blended\nmarketing on EMG Group, or Epoch Times, including English language YouTube\nhosts Roman Balmakov, Joshua Philipp and Larry Elder. This is all part of a\nmarketing budget for 2021 and 2022 of over 2.5 million USD.\n     The sponsored ads will describe Sekur 's attributes as the leading\nSwiss hosted Privacy and Security communications application, such as\nencrypted email and secure messaging, without any data mining, including\nSekur 's unique proprietary feature called Chats-by-invites, letting a\nSekur user message a non-Sekur user, without the recipient having to\ndownload or register for Sekur.\n\n     The sponsored programs will be En Primera Plana with David Rojas and\nChina en Foco with Julian Bertone. Additionally, followers will benefit\nfrom a 25% discount Promo code for the first 12 months of subscription to\nSekur at the time of signup.\n\n     About the programs, according to The Epoch Times :\n\n     China en Foco with Julian Bertone\n\n     China en Foco: As China increases its influence in the world, it is\nextremely important that people have honest information about the threats\nposed by the communist regime. At China en Foco we make it a point to\npresent our audience with first-hand news about what is happening inside\nthe Asian giant. China en Foco has 380K subscribers and has gained\n86,173,412 video views since the program being established on YouTube on\nMay 2020.\n\n     En Primera Plana with David Rojas\n\n     En Primera Plana: Freedom of expression today is under threat. Big\nmedia and technology giants control information and censor those who do not\nagree with their vision of the world. En Primera Plana we want people to\nfind the truth, basing our information on real and objective facts. En\nPrimera Plana has 89,767 subscribers and has gained 13,921,204 video views\nsince the Channel being established on YouTube on Dec 2021.\n\n     GlobeX Data and The Epoch Times plan to start the first sponsored\nSpanish language episode on the following times:\n\n*  En Primera Plana channel on November 16 and November 18 2021\n*  China en Foco November 17 &amp; November 19 2021\n\n     According to The Epoch Times, The Epoch Times has received numerous\nawards for our reporting and design, including from the New York Press\nAssociation, the Society of Professional Journalists, and the Society for\nNews Design. The Epoch Times national print readership is over 1 million,\nand theepochtimes.com website monthly pageviews is 110 million. The Epoch\nTimes' media network currently covers 21 languages and 33 countries.\n\n     Alain Ghiai, CEO of GlobeX Data said: \"We are excited to start the\nSpanish language sponsored YouTube episodes on The Epoch Times, targeting\nthe Hispanic and Latino American audience of 60 million plus strong US\ncitizen and residents. As we already have a partnership in Latin America\nwith the largest telecom operator in the continent, Mexico based America\nMovil, and other partners such as Micronet in Colombia, Panama and other\ncountries in Latin America, we felt it was a natural fit to address the\nHispanic population of the United States of America and bring awareness to\nour privacy and security solutions, since we already have our website and\napplications in Spanish language. So far, the English language YouTube\nsponsorships have brought extremely satisfactory consistent and steady\nresults. So much so, that we already booked all of 2022 with them already.\nShould the results in Spanish also be satisfactory, we will continue with\nthe sponsorship into 2022. The Epoch Times' audience will come to know the\nmany unique and critical features provided by Sekur, such as, Swiss hosted\ndata privacy and security, and the right for consumers and businesses not\nto have their data mined by third party service providers, Big Tech\ncompanies, or rogue governments stealing Americans' data and financial and\nmedical information, in order to hold Americans' hostage with ransom\ndemands. As we are not connected, and never have been connected, to AWS,\nMicrosoft Azure or Google Cloud platforms, commonly referred to as \"Big\nTech\", we can offer a truly independent, private and secure means of\ncommunications such as secure and private emails and instant messaging. We\nare looking forward to offer true data privacy and no data mining to all\nAmericans, in both Spanish and English language, and we look forward to\ntell our story on The Epoch Times network.\"\n\n     Sekur , which includes SekurMessenger as part of a bundle of email,\nmessaging and file transfer into one app solutions, includes the Company's\nlatest SekurMail technology, which includes proprietary anti-phishing and\nprivacy feature called SekurSend (R) . SekurSend (R) lets a user send an\nemail to any other recipient, whether they have Sekur or not, in full\nprivacy and security as the email never leaves Sekur 's encrypted email\nservers based in Switzerland. The recipient can then click on the\nnotification and reply in the same manner using SekurReply (R) , without\nthe recipient having to register for a Sekur account. The sender can also\ndecide to protect any email sent by adding a password to open it, a\nread-limit and a self-destruct timer as well. Sending an email with the\nSekurSend (R) feature allows the senders and recipients to add limitless\nsize attachments to the emails without crowding the recipients' email box.\nThis also eliminates BEC attacks for businesses and email phishing attacks.\nAdditionally, SekurMail includes full control of email delivery, automatic\ndata export for large Enterprises and an automatic Data Loss Prevention\ntechnology (\"DLP\") with real time continuous archiving.\n\n     Recent data breaches in messaging applications and in particular in\nthe WhatsApp application have created a certain urgency for businesses and\ndata privacy advocates to protect their communications form cyber-attacks\nand identity theft via mobile and desktop devices.\n\n     SekurMessenger eliminates many of the privacy and security risks by\nnot only not requiring a phone number, which would divulge a user's phone\ndevice ID, but also by not social engineering a user's phone or computer\ncontact list and infecting the contacts by default as well, eliminating a\nhuge loophole in security and privacy. SekurMessenger issues each user a\nusername and a SM number. The SM number is the contact ID a user would\ndisclose in order for other SM users to be added. The service comes with a\nself-destruct timer and other features as well, including GlobeX's\nproprietary VirtualVaults and HeliX technologies with all data stored in\nSwiss hosted encrypted servers.\n\n     Additionally, SekurMessenger now comes with a proprietary feature and\ntechnology called Chat by Invites. This feature allows a SekurMessenger\nuser (\"SM user\") invite a non-SM user, or a group of non-SM users, to chat\nin a fully private and secure way, without the recipient ever having to\nregister to SekurMessenger or download the app. At the end of the chat, the\ninitiator of the conversation can remotely terminate the conversation and\nall traces of the conversation are deleted from all users, including the\nrecipient. This unique feature is now fully deployed and functional on all\niOS and Android devices and web platforms. The target sectors are numerous,\nincluding but not limited to real estate, legal, financial, government,\nenergy, mining, manufacturing, trade and medical sectors.\n\n     GlobeX's Data privacy solutions are all hosted in Switzerland,\nprotecting users' data from any outside data intrusion requests. In\nSwitzerland, the right to privacy is guaranteed in article 13 of the Swiss\nFederal Constitution. The Federal Act on Data Protection (\"FADP\") of 19\nJune 1992 (in force since 1993) has set up a strict protection of privacy\nby prohibiting virtually any processing of personal data which is not\nexpressly authorized by the data subjects. The protection is subject to the\nauthority of the Federal Data Protection and Information Commissioner.\n\n     Under Swiss federal law, it is a crime to publish information based on\nleaked \"secret official discussions.\" In 2010 the Federal Supreme Court of\nSwitzerland found that IP addresses are personal information and that under\nSwiss privacy laws they may not be used to track Internet usage without the\nknowledge of the individuals involved.\n\n     About GlobeX Data Ltd.\n\n     GlobeX Data Ltd. is a Cybersecurity and Internet privacy provider of\nSwiss hosted solutions for secure communications and secure data\nmanagement. The Company distributes a suite of encrypted e-mails, and\nsecure communication tools, secure cloud-based storage, disaster recovery\nand document management. GlobeX Data Ltd. sells its products directly\nthrough its websites, through its approved wholesalers and distributors,\nand telecommunications companies worldwide. GlobeX Data Ltd. serves\nconsumers, businesses and governments worldwide.\n\n     On behalf of Management\nGLOBEX DATA LTD.\n\n     Alain Ghiai\nPresident and Chief Executive Officer\n+1.416.644.8690\ncorporate@globexdata.com\n\n     For more information, please contact GlobeX Data at\ncorporate@globexdatagroup.com or visit us at <a href=\"https://globexdata.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://globexdata.com</a>.\nFor more information on Sekur visit us at: <a href=\"https://www.sekur.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.sekur.com</a>.\n\n     Forward Looking Information\n\n     This news release contains certain forward-looking information within\nthe meaning of applicable Canadian securities laws (\"forward-looking\nstatements\"). All statements other than statements of present or historical\nfact are forward-looking statements. Forward-looking statements are often,\nbut not always, identified by the use of words such as \"anticipate\",\n\"achieve\", \"could\", \"believe\", \"plan\", \"intend\", \"objective\", \"continuous\",\n\"ongoing\", \"estimate\", \"outlook\", \"expect\", \"project\" and similar words,\nincluding negatives thereof, suggesting future outcomes or that certain\nevents or conditions \"may\" or \"will\" occur. These statements are only\npredictions. These statements reflect management's current estimates,\nbeliefs, intentions and expectations; they are not guaranteeing future\nperformance. GlobeX cautions that all forward-looking statements are\ninherently uncertain and that actual performance may be affected by a\nnumber of material factors, many of which are beyond GlobeX's control. Such\nfactors include, among other things: risks and uncertainties relating to\nthe future of the Company's business; the success of marketing and sales\nefforts of the Company; the projections prepared in house and projections\ndelivered by channel partners; the Company's ability to complete the\nnecessary software updates; increases in sales as a result of investments\nsoftware development technology; consumer interest in the Products; future\nsales plans and strategies; reliance on large channel partners and\nexpectations of renewals to ongoing agreements with these partners;\nanticipated events and trends; the economy and other future conditions; and\nother risks and uncertainties, including those described in GlobeX's\nprospectus dated May 8, 2019 filed with the Canadian Securities\nAdministrators and available on www.sedar.com. Accordingly, actual and\nfuture events, conditions and results may differ materially from the\nestimates, beliefs, intentions and expectations expressed or implied in the\nforward-looking information. Except as required under applicable securities\nlegislation, GlobeX undertakes no obligation to publicly update or revise\nforward-looking information.\n\nTel   : 416-644-8690    GLOBEX DATA LTD\nWWW   : <a href=\"https://www.globexdatagroup.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.globexdatagroup.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2130800177.MNPRE2130801257-08441520211105</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}