{"date": "2022-02-25 16:10:44.018000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3027.16, "close": 3071.26}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NAPLES SOAP CO INC (\"GNSG-0\")\n- The Removal of the Caveat Emptor Designation by the OTC\n\n    Naples Soap Company, Inc., a specialty retailer known for its\nhigh-quality skin care, is pleased to announce that the OTC Markets Group,\nInc. ('OTC Markets') has removed the Caveat Emptor designation from the\nCompany's stock. Naples Soap Company shares can now be traded openly under\nthe Pink Sheet Current status.\n\n    \"We've been patiently waiting for this status change as the OTC worked\nthrough a backload of requests,\" said Deanna Wallin, Naples Soap Company\nFounder &amp; CEO. \"With this behind us, we're poised and ready to implement\nour future growth plans through the expansion of our storefront locations,\nwholesale partnerships and direct-to-consumer online sales.\"\n\n    Naples Soap Company is working with the OTC on changing the CUSIP\nnumber and stock trading symbol from GNSG to something that is more aligned\nwith the Naples Soap Company name and brand. The Company hopes to have this\ncompleted in the first half of the year.\n\n    About Naples Soap Company, Inc.\n\n    Founded in 2009 by Deanna Wallin, Naples Soap Company is a health and\nwellness brand that markets more than 300 personal care products including\nbody care, face care and hair care. These products are made in the USA with\npremium, high-quality, natural and organic ingredients. Products are sold\nat the Company's 10 retail locations in Florida, and four more store\nlocations are currently under contract for 2022. Naples Soap Company\nproducts are sold online from the Company's website at www.naplessoap.com,\nthrough other DTC (direct-to-consumer) channels such as Amazon.com and at\nmore than 300 boutiques, spas and stores throughout the United States via\nthe Company's wholesale division. For more information about Naples Soap\nCompany, visit www.naplessoap.com.\n\n    Forward-Looking Statements\n\n    This press release contains certain forward-looking statements within\nthe meaning of Section 27A of the Securities Act of 1933, as amended and\nSection 21E of the Securities Exchange Act of 1934, as amended. All\nforward-looking statements are subject to uncertainty and may not come to\nfruition. Readers are cautioned not to place undue reliance on any\nforward-looking statement including statements that list numbers and dates.\n Contact Information:\n\nDeanna Wallin, Founder and CEO\ninvestorrelations@naplessoap.com | (239) 325-8263\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2205500244.MNPRE2205500919-07094520220225</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}