{"date": "2022-02-01 08:11:46.681000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>system for IoT devices</p>\n<p>1274679 01.02.2022</p>\n</div>\n<div class=\"tr-npp-body\">\n<pre>EQS-News: u-blox AG / Key word(s): Product Launch                              \nu-blox AG: u-blox launches scalable digital certificate management system for  \nIoT devices                                                                    \n                                                                               \n01.02.2022 / 09:00                                                             \n                                                                               \n                                                                               \n------------------------------------------------------------                   \nPress Release                                                                  \n                                                                               \nu-blox launches scalable digital certificate management system for IoT devices \n                                                                               \nThe u-blox IoT certificate manager automatically renews device credentials     \naccording to industry requirements to ensure futureproof protection.           \n                                                                               \nThalwil, Switzerland - February 1, 2022 - u-blox (SIX:UBXN,OTC:UBLXF), a       \nleading global provider of positioning and wireless communication technologies \nand services, has announced the IoT certificate manager, a new security service\nthat continuously renews device credentials in a fully automated mode. Together\nwith u-blox's existing zero touch provisioning service, it provides            \nout-of-the-box on-boarding to IoT cloud platforms with total control of the    \ndevice certificate lifecycle.                                                  \n                                                                               \nCertificate lifecycle control targets IoT devices that integrate with leading  \nIoT cloud platforms including the AWS IoT Core, Azure IoT Hub, and DPS         \nservices. While these take charge of device management and data aggregation,   \nthe u-blox service provides an effortless, secure, and cost-effective way to   \nmanage the X.509 certificates required for device authentication.              \n                                                                               \nX.509 certificates have become a cornerstone of IoT security. Secure           \nprovisioning requires extensive experience, complex software development, and  \nrobust production line tools and processes.                                    \n                                                                               \nCertificate management efforts grow exponentially with increasing fleet size.  \nWhile in the past issued certificates remained valid throughout a device's     \nlifecycle, increases in infrastructure complexity and risks have forced        \nregulatory authorities to demand more frequent - yearly or monthly - renewals. \nFailure to meet renewal deadlines can expose devices to cyberthreats, disrupt  \nservice availability, and undermine business.                                  \n                                                                               \nIoT certificate manager simplifies scaling...                                  \n                                                                               \nu-blox new IoT certificate manager eliminates the task of manually managing    \ncredential renewal on thousands of devices. Designed and optimized for IoT     \nscenarios, it eliminates the errors that can occur during manual operation on  \nlarge IoT deployments, freeing resources for other activities. Delivery via the\nintuitive Thingstream IoT service delivery platform with its simple and        \nflexible price plans lets users engage more efficiently and reduce time to     \nmarket.                                                                        \n                                                                               \n... and futureproofs protection                                                \n                                                                               \nThe IoT certificate manager futureproofs protection by increasing security     \nlevels over the entire device lifetime. Building on the root of trust included \nin u-blox SARA-R5 series LTE-M cellular modems, it provides a fully integrated \nsilicon-to-cloud security solution that is unmatched in the industry.          \n                                                                               \n\"IoT certificate manager is all about enabling IoT solution developers to      \neasily manage device credentials for an IoT lifetime, to scale seamlessly from \nprototyping to huge fleets, and to minimize set-up costs, giving companies more\ntime and resources to grow their business,\" says Giovanni Solito, Senior       \nProduct Manager, Product Center Services, at u-blox.                           \n                                                                               \nZero touch provisioning and IoT certificate manager services are available     \nimmediately.                                                                   \n                                                                               \nAbout u-blox                                                                   \nu-blox (SIX:UBXN) is a global technology leader in positioning and wireless    \ncommunication in automotive, industrial, and consumer markets. Their smart and \nreliable solutions, services and products let people, vehicles, and machines   \ndetermine their precise position and communicate wirelessly over cellular and  \nshort range networks. With a broad portfolio of chips, modules, and secure data\nservices and connectivity, u-blox is uniquely positioned to empower its        \ncustomers to develop innovative and reliable solutions for the Internet of     \nThings, quickly and cost-effectively. With headquarters in Thalwil,            \nSwitzerland, the company is globally present with offices in Europe, Asia, and \nthe USA. (www.u-blox.com) Find us on Facebook, LinkedIn, Twitter @ublox and    \nYouTube                                                                        \nu-blox media contact:                                                          \nNatacha Seitz                                                                  \nSenior Manager PR and Content Marketing                                        \nMobile +41 76 436 0788                                                         \nnatacha.seitz@u-blox.com                                                       \n                                                                               \n                                                                               \n------------------------------------------------------------                   \nEnd of Media Release                                                           \n                                                                               \n------------------------------------------------------------                   \n\n\n\nLanguage:    English           \n\nCompany:     u-blox AG         \n\n             Zürcherstrasse 68 \n\n             8800 Thalwil      \n\n             Switzerland       \n\nPhone:       +41 44 722 74 44  \n\nFax:         +41 44 722 74 47  \n\nE-mail:      info@u-blox.com   \n\nInternet:    www.u-blox.com    \n\nISIN:        CH0033361673      \n\nListed:      SIX Swiss Exchange\n\nEQS News ID: 1274679           \n\n\n\n\n\n\n\n                                      \n\nEnd of News          EQS News Service\n\n\n\n------------------------------------------------------------</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}