{"date": "2021-12-02 17:20:32.220000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3443.72, "close": 3389.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Wednesday, Dec  1</p></div><div class=\"tr-npp-lead\"><p>December 1 (Renewables Now) - US e-commerce giant Amazon.com Inc (NASDAQ:AMZN) and Danish clean energy group Ørsted A/S (CPH:ORSTED) today said they have signed two new corporate power purchase agreements (PPAs) for a combined 116 MW of offshore and onshore wind capacity.</p><p>Amazon will buy the output of an additional 100 MW from Ørsted's 900-MW Borkum Riffgrund 3 offshore wind project in Germany, expanding a 250-MW PPA inked in December last year to offtake a total of 350 MW from the offshore wind park, which is expected to come online in 2025.</p></div><div class=\"tr-npp-body\"><p>Amazon will also purchase the generation of the 16-MW Ballykeel onshore wind farm in Northern Ireland. Ørsted expects to take final investment decision on this project this year.</p><p>\"We're moving quickly on our path to power operations with 100 % renewable energy by 2025 – five years earlier than our original target. The new agreements with Ørsted are an important step on this journey,\" commented Ralf Kleber, country manager of Amazon in Germany.</p><p>In addition to the Borkum Riffgrund 3 and Ballykeel PPAs, Amazon has an offtake contract with Ørsted for a 253-MW onshore wind farm in Texas.</p><p>Just yesterday the Danish energy company announced a 50-MW offtake deal with Google for Borkum Riffgrund 3.</p><p>Ørsted says it is the global leader in offshore wind corporate PPAs, having signed 1,764 MW of such contracts over the past two years. In its onshore portfolio, the company has signed corporate PPAs for a total of 1,350 MW since May 2020.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SeeNews. All rights reserved.</p></div>"}