{"date": "2022-02-09 11:35:28.470000+00:00", "ticker": "ABDN", "mrkt_info": {"open": 243.0, "close": 252.8}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 0818Babrdn PLC08 February 2022</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>NOT FOR RELEASE, PUBLICATION OR DISTRIBUTION, IN WHOLE OR IN PART, IN, INTO, OR FROM ANY JURISDICTION WHERE TO DO SO WOULD CONSTITUTE A VIOLATION OF THE RELEVANT LAWS OF THAT JURISDICTION</span>\n</p>\n<p>\n<span>FOR IMMEDIATE RELEASE</span>\n</p>\n<p>\n<span>9 February 2022</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>abrdn plc (\"abrdn\")</span>\n</p>\n<p>\n<span>Proposed acquisition of interactive investor</span>\n</p>\n<p>\n<span>Publication of Circular and Notice of General Meeting</span>\n</p>\n<p>\n<span>Update on Trading</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Further to the announcement on 2 December 2021 in relation to the proposed acquisition of interactive investor by abrdn (the \" <span>Acquisition</span> \"), abrdn announces that its Class 1 Circular in relation to the Acquisition (the \" <span>Circular</span> \") has today been approved by the Financial Conduct Authority (the \" <span>FCA</span> \"). Copies of the Circular will shortly be posted to abrdn's shareholders (other than those who have elected for notification by electronic communication).</span>\n</p>\n<p>\n<span>Completion of the Acquisition is conditional on, among other things, the approval of abrdn's shareholders. Accordingly, a general meeting of abrdn will be held at 2 p.m. on 15 March 2022 at etc.venues St Paul's, 200 Aldersgate, London, EC1A 4HD, at which an ordinary resolution will be proposed for abrdn's shareholders to approve the Acquisition. A notice convening the general meeting is included in the Circular.</span>\n</p>\n<p>\n<span>The Circular will shortly be submitted to the FCA's National Storage Mechanism and will be available for inspection on its website at</span>\n<span>\n<a href=\"https://data.fca.org.uk/#/nsm/nationalstoragemechanism\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://data.fca.org.uk/#/nsm/nationalstoragemechanism</a>\n</span>\n<span>. The Circular will also be available for viewing on abrdn's website at</span>\n<span>\n<a href=\"https://www.abrdn.com/corporate/investors/acquisition-of-ii\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.abrdn.com/corporate/investors/acquisition-of-ii</a>\n</span>\n<span>.</span>\n</p>\n<p>\n<span>The Circular contains updates on trading for abrdn and interactive investor, as set out below:</span>\n</p>\n<p>\n<span>abrdn</span>\n</p>\n<p>\n<span>The financial results for abrdn for the full year ended 31 December 2021 will be announced on 1 March 2022.</span>\n</p>\n<p>\n<span>Overall, trading for the year was in line with management expectations, with the trajectory in revenue growth seen in the first half of 2021 broadly continuing for the full year. AUMA at 31 December 2021 increased to £542 billion, compared with £535 billion at 31 December 2020.</span>\n</p>\n<p>\n<span>interactive investor</span>\n</p>\n<p>\n<span>interactive investor has continued to have good momentum during the second half of 2021. In the six months to 31 December 2021, the business attracted c.17,500 new customers, c.12 per cent. higher than in the comparable period in 2020, and continues to retain high levels of assets per customer. At 31 December 2021, interactive investor had c.403,000 customers and AUA of c.£59 billion.</span>\n</p>\n<p>\n<span>Trading volumes have remained significantly above pre-COVID-19 levels with daily average retail trades volumes of c.22,000 over the twelve months to 31 December 2021, compared with c.8,700 over the same period to 31 December 2019.</span>\n</p>\n<p>\n<span>Unless otherwise defined, terms used in this announcement shall have the same meaning as those used in the Circular.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Enquiries</span>\n</p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>abrdn plc</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Media</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Stephen Whitehead</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>07920 369595</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Iain Dey (Edelman Smithfield)</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>07976 295906</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Latika Shah (Edelman Smithfield</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>07950 671948</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Institutional equity investors and analysts</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Catherine Nash</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>07798 518657</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Retail equity investors</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Equiniti</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>*0371 384 2464</span>\n</p>\n</td>\n</tr>\n<tr>\n<td colspan=\"2\">\n<p>\n<span>* Calls may be monitored and/or recorded. Call charges will vary.</span>\n</p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Debt investors and analysts</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Graeme McBirnie</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>01313 727760</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Group Secretariat</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Kenneth Gilmour</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>07734 974073</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>J.P. Morgan Cazenove</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>+44 (0) 20 7742 4000</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>(Sole Financial Adviser, Sole Sponsor)</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Conor Hillery</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Edward Squire</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Claire Brooksby</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Ravin Mehta</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n</td><td>\n</td><td>\n</td></tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<p>\n<span>Important notice</span>\n</p>\n<p>\n<span>This announcement is not intended to, and does not constitute, or form part of, an offer to sell or an invitation to purchase or subscribe for any securities or a solicitation of any vote or approval in any jurisdiction. This announcement does not constitute a prospectus or a prospectus equivalent document. abrdn Shareholders are advised to read carefully the formal documentation in relation to the Acquisition once it has been despatched. Any response to the proposals should be made only on the basis of the information in the formal documentation to follow.</span>\n</p>\n<p>\n<span>Overseas jurisdictions</span>\n</p>\n<p>\n<span>The release, publication or distribution of this announcement in jurisdictions other than the United Kingdom may be restricted by law and therefore any persons who are subject to the laws of any jurisdiction other than the United Kingdom should inform themselves about, and observe, any applicable requirements. This announcement has been prepared for the purposes of complying with the Listing Rules and the information disclosed may not be the same as that which would have been disclosed if this announcement had been prepared in accordance with the laws and regulations of any jurisdiction outside of the United Kingdom.</span>\n</p>\n<p>\n<span>Forward-looking statements</span>\n</p>\n<p>\n<span>Certain statements in this announcement are, or may be deemed to be, \"forward-looking statements\". Forward-looking statements are prospective in nature and are not based on historical facts, but rather on current expectations and projections of the management of abrdn and interactive investor about future events, and are therefore subject to risks and uncertainties which could cause actual results to differ materially from the future results expressed or implied by the forward-looking statements. Each forward-looking statement speaks only as of the date of the particular statement, and the events discussed herein may not occur.</span>\n</p>\n<p>\n<span>The forward-looking statements contained in this announcement include statements relating to the expected effects of the Acquisition on abrdn and interactive investor or the Enlarged Group (including their future prospects, developments and strategies), the expected timing and scope of the Acquisition and other statements other than historical facts. Often, but not always, forward-looking statements can be identified by the use of forward-looking words such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"is subject to\", \"budget\", \"projects\", \"strategy\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does not anticipate\", or \"believes\", or variations of such words and phrases or statements that certain actions, events or results \"may\", \"could\", \"should\", \"would\", \"might\" or \"will\" be taken, occur or be achieved. Although abrdn and interactive investor believe that the expectations reflected in such forward-looking statements are reasonable, abrdn and interactive investor can give no assurance that such expectations will prove to be correct.</span>\n</p>\n<p>\n<span>By their nature, forward-looking statements involve risk and uncertainty because they are based on information available at the time they are made, including current expectations and assumptions, and relate to future events and/or depend on circumstances which may be or are beyond the abrdn Group's control, including among other things: UK domestic and global political, economic and business conditions (such as the UK's exit from the EU); market related risks such as fluctuations in interest rates and exchange rates, and the performance of financial markets generally; the impact of inflation and deflation; the impact of competition; the timing, impact and other uncertainties associated with future acquisitions, disposals or combinations undertaken by abrdn or its affiliates and/or within relevant industries; the value of and earnings from the abrdn Group's strategic investments and ongoing commercial relationships; default by counterparties; information technology or data security breaches (including the abrdn Group being subject to cyberattacks); operational information technology risks, including the abrdn Group's operations being highly dependent on its information technology systems (both internal and outsourced); natural or man made catastrophic events; the impact of pandemics, such as the COVID-19 (coronavirus) outbreak; climate change and a transition to a low carbon economy (including the risk that</span>\n<span>\n<span>the abrdn Group may not achieve its targets); exposure to third party risks including as a result of outsourcing; the failure to attract or retain necessary key personnel; the policies and actions of regulatory authorities; and the impact of changes in capital, solvency or accounting standards, and tax and other legislation and regulations in the jurisdictions in which abrdn and its affiliates operate.</span>\n</span></p>\n<p>\n<span>Neither abrdn and interactive investor, nor any of their respective associates or directors, officers or advisers, provides any representation, assurance or guarantee that the occurrence of the events expressed or implied in any forward-looking statements in this announcement will actually occur. You are cautioned not to place any reliance on these forward-looking statements. Other than in accordance with their legal or regulatory obligations, neither abrdn nor interactive investor is under any obligation, and abrdn and interactive investor expressly disclaim any intention or obligation, to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.</span>\n</p>\n<p>\n<span>No profit forecasts, estimates or quantified financial benefits statements</span>\n</p>\n<p>\n<span>No statement in this announcement is intended as a profit forecast, profit estimate or quantified financial benefits statement for any period and no statement in this announcement should be interpreted to mean that earnings or earnings per share for the Enlarged Group, abrdn and/or interactive investor for the current or future financial years would necessarily match or exceed the historical published earnings or earnings per share of abrdn or interactive investor.</span>\n</p>\n<p>\n<span>Rounding</span>\n</p>\n<p>\n<span>Certain figures included in this announcement have been subjected to rounding adjustments.</span>\n</p>\n<p>\n<span>Currency</span>\n</p>\n<p>\n<span>Unless otherwise indicated, all references in this document, to \"£\" are to the lawful currency of the United Kingdom. abrdn prepares its financial statements in pounds sterling.</span>\n</p>\n<p>\n<span>Disclaimer</span>\n</p>\n<p>\n<span>J.P. Morgan Securities plc, which conducts its UK investment banking business as J.P. Morgan Cazenove (\"J.P. Morgan Cazenove\"), and which is authorised in the United Kingdom by the Prudential Regulation Authority (the \"PRA\") and regulated by the PRA and the FCA, is acting as financial adviser exclusively for abrdn and no one else in connection with the Acquisition and will not regard any other person as its client in relation to the Acquisition and will not be responsible to anyone other than interactive investor for providing the protections afforded to clients of J.P. Morgan Cazenove or its affiliates, nor for providing advice in relation to the Acquisition or any other matter or arrangement referred to herein.</span>\n</p>\n<p>\n<span>LEI number of abrdn plc: 0TMBS544NMO7GLCE7H90</span>\n</p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>MSCZZGGZRRKGZZM</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}