{"date": "2022-01-27 17:00:06.947000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2777.45, "close": 2879.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">NEW YORK, Jan. 27, 2022</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">NEW YORK</span>, <span class=\"xn-chron\">Jan. 27, 2022</span> /PRNewswire/ --  ROI Training, an award-winning global information technology (Information Technology) training company, has joined the <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3425730-1&amp;h=2989871834&amp;u=https%3A%2F%2Faws.amazon.com%2Fpartners%2Faws-training-partners%2F&amp;a=AWS+Training+Partner+(ATP)+program\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Training Partner (ATP) program</a></u>, which enables AWS-authorized instructors to deliver training designed at the source by Amazon Web Services, Inc. (AWS). ROI Training announced it is working to deliver AWS training to learners across <span class=\"xn-location\">North America</span>.</p>\n<p>As cloud technologies continue to help organizations transform their businesses at a rapid pace, employees with the necessary cloud skills are in high demand. Research shows that 85% of organizations report deficits in cloud expertise (451 Research, Voice of the Enterprise (VotE): Cloud, Hosting &amp; Managed Services, Organizational Dynamics 2020, part of S&amp;P Global Market Intelligence). The ATP AWS Training Partner Program is designed for Organizations like ROI Training that are experienced in delivering high-quality technical training programs to customers across all verticals are empowered by the ATP program to deliver AWS Training that enables IT professionals and businesses to leverage the power of the AWS Cloud.</p>\n<p>As an ATP AWS Training Partner, ROI Training offers a breadth of AWS training options for all competency levels. The ROI Training team works with organizations to design and implement tailored training plans to accelerate cloud adoption and drive business transformation. Whether your organization is just starting its journey to the cloud or looking to train staff on your specific implementation of AWS, ROI can assess the team's skills, identifying gaps and recommending blended training solutions to close those gaps.</p>\n<p>Since its inception in 2002, ROI Training has worked to build a team of technical trainers that bring expertise, passion, and genuine excitement to the classroom. Having trained over 150,000 people on cloud technologies with consistent customer satisfaction scores of 95% or higher, ROI Training delivers outstanding quality and customer service to customers.</p>\n<p>AWS training is developed and maintained by AWS experts, ensuring the content reflects current best practices. AWS Classroom Training gives learners the opportunity to engage live and get questions answered by an expert instructor. Many courses also include hands-on labs, which allow learners to practice real-world scenarios in a sandbox environment. Training also helps prepare learners for AWS Certification exams, which validate technical skills and expertise with an industry-recognized credential.</p>\n<p>\"Becoming an AWS Training Partner provides a tremendous opportunity to leverage our extensive cloud training expertise to help address the growing demand for cloud skills in the market.  AWS supports millions of customers across virtually every industry and of every size. Our proven ability to scale cutting-edge training will help customers accelerate AWS adoption, become more agile, and innovate faster,\" said <span class=\"xn-person\">David Carey</span>, Chief Executive Officer and Founder at ROI Training.</p>\n<p>\"As cloud technologies continue to help organizations transform their businesses at a rapid pace, employees with the necessary cloud skills are in high demand. The AWS Training Partner Program is designed for organizations like ROI Training that meet or exceed rigorous criteria for delivering or offering high-quality technical training experiences. As part of the program, ROI Training delivers AWS training to enable IT professionals and businesses to leverage the power of the AWS Cloud.\" -- <span class=\"xn-person\">Maureen Lonergan</span>, Vice President, <span class=\"xn-person\">AWS Training</span> and Certification at AWS.</p>\n<p><b>About ROI Training<br/></b>ROI delivers cutting-edge technology and management training solutions to large corporations and government agencies around the world. At ROI, we strive to provide business professionals with the skills and knowledge necessary to increase work performance and drive greater return on investment for the global customers we support. ROI Training is an award-winning provider of training in the cloud space and has been recognized 6 times by Training Industry Inc. as a Top 20 Technology Training Company.</p>\n<p>Founded in 2002, ROI Training is headquartered in <span class=\"xn-location\">New York</span> and delivers customized training in 30+ countries covering 12 languages.</p>\n<p>Media Contact: <u><a href=\"mailto:media@roitraining.com\" data-type=\"email\" translate=\"no\">media@roitraining.com</a></u> </p>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=NY43892&amp;sd=2022-01-27\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1OWTQzODkyJnNkPTIwMjItMDEtMjc=&amp;key=9a07a0b5a2c3c91cc57831ec4f5af41cdd8153d08d1289f29b6660f1aa0877cc3074201145ca1c2d9d92e347e4e3db1b57a6bf154c9389a8879b03e624ae65bb\"/></div></div> View original content:<a href=\"https://www.prnewswire.com/news-releases/roi-training-inc-becomes-aws-training-partner--delivering-aws-cloud-skills-training-to-it-professionals-in-north-america-301469900.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/roi-training-inc-becomes-aws-training-partner--delivering-aws-cloud-skills-training-to-it-professionals-in-north-america-301469900.html</a><p></p>\n<p>SOURCE  ROI Training, Inc.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: ROI-TRAINING-AWS-IT</p></div>"}