{"date": "2021-11-30 14:30:00.318000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Genymobile Achieves AWS Graviton Ready Designation</b>\n</p><p>\nGenymobile, which provides an Android as a service solution, announced today that it has achieved the AWS Graviton Ready designation, part of the Amazon Web Services, Inc. (AWS) Service Ready Program. This designation recognizes that Genymotion, Genymobile’s Android Virtual Devices, has demonstrated successful integration with AWS Graviton Service.\n</p><p>\nAchieving the AWS Graviton Ready designation differentiates Genymobile as an AWS Partner Network (APN) member with Genymotion integrating with AWS Graviton and is generally available and fully supported for AWS customers. In addition, AWS Service Ready Partners have demonstrated success building products integrated with AWS services, helping AWS customers evaluate and use their technology productively, at scale, and with varying levels of complexity.\n</p><p>\n“Genymobile is proud to have been on AWS Graviton since its launch and to achieve AWS Graviton Ready status,” said Tim Danford, CEO at Genymobile. “Our team is dedicated to helping our customers achieve their business and technology objectives by leveraging the agility, breadth of services, and pace of innovation that AWS enables.”\n</p><p>\nTo support the seamless integration and deployment of these solutions, AWS established the <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fpartners%2Fservice-ready%2F&amp;esheet=52541572&amp;newsitemid=20211130005102&amp;lan=en-US&amp;anchor=AWS+Service+Ready+Program&amp;index=1&amp;md5=5ab1e7b7eed18d2aa98ad19d91e2bcfe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Service Ready Program</a> to help customers identify solutions integrated with AWS services and spend less time evaluating new tools, and more time scaling their use of solutions that are integrated with AWS services.\n</p><p>\nWith Genymotion on AWS, Android application developers will be able to seamlessly develop, test, and deploy applications on the same processor architecture as their ‘target’ mobile processor, eliminating the need for cross-development and translation of Arm to x86 instruction sets needed on x86-based emulators. Genymotion integrates into your development and testing infrastructure in the cloud or behind the firewall with full HTTP and Java application programming interfaces (APIs). The integrated develop/test/deploy platform increases compatibility, speeds time to market, and reduces complexity, providing a better developer and customer experience. Using AWS Graviton servers to stream Android from the cloud is more economical, provides higher performance, and delivers better quality.\n</p><p>\n“We monitor Android apps, using them like real users. Genymotion on AWS Graviton meets our performance and compatibility requirements: we can therefore test and monitor all of our customers' mobile apps with the same user experience as on a real device,” said Benoit Boireau, CTO of Ip Label.\n</p><p>\nAbe Blackburn, Tech Solutions Director of The Social Element also declared that \"We use Genymotion on AWS Graviton to deliver a critical service to our clients in marketing and social media. The Genymobile team has always been prompt in their replies, and keen to work with us to find solutions and new suggestions whether it be on complex use cases or security components. They have met our need for flexibility and growth by achieving AWS Graviton Ready status. We appreciate our partnership with Genymotion and always look forward to new updates.\"\n</p><p>\n<b>About Genymobile</b>\n</p><p>\nGenymobile, founded in 2011, is the provider of Genymotion, an Android application development and test solution. More information at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.genymotion.com&amp;esheet=52541572&amp;newsitemid=20211130005102&amp;lan=en-US&amp;anchor=www.genymotion.com&amp;index=2&amp;md5=49b49f1453ac1964c9db44cc53af49db\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.genymotion.com</a>.\n</p><p>\nAndroid is a trademark of Google LLC. Arm is a registered trademark of Arm Limited.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211130005102r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTMwMDA1MTAycjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=4694155f51bd566ce4c59fdbed0e9f7b23b4f0356dfd62b264e204dc41618f1bc3f660d089f91d417c2d3e389e7b1a921ec6cb4f78f198d02a0dee72a4ece12e\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211130005102/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211130005102/en/</a></span></p><p>\nDebora Munsi\n<br/><a href=\"mailto:Dmunsi@genimobile.com\" data-type=\"email\" translate=\"no\">Dmunsi@genimobile.com</a><br/>+33 1 83 64 25 40\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: GENYMOBILE</p></div>"}