{"date": "2022-02-01 11:00:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Jeffrey Dastin</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Feb 1 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>When Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> on Thursday reports how it fared during the holiday quarter, a key question will be if the retailer will finally raise the price of Prime, its fast-delivery and media subscription. </p><p>The company has every reason to do so, analysts say. Amazon had to pay higher wages and signing bonuses to attract workers in a labor shortage. It had to spend more on shipping because it could not get products into the right warehouses. Even steel for construction projects cost more.</p><p>Amazon has forecast an operating profit between $0 and $3 billion, with analysts estimating it landed at the higher end of the range, at about $2.5 billion, according to research firm FactSet. Still, analysts are expecting a price hike soon for Prime. U.S. subscribers' annual fees last went up four years ago to $119 from $99, and they went up four years before that from $79.</p><p>\"It's about time,\" said Michael Pachter of Wedbush Securities. \"Shipping costs have gone up, period.\"</p><p>Mark Mahaney, an analyst at Evercore ISI, said pitching a price hike would be straightforward: fuel is more expensive, trucking is pricier, and goods themselves cost more. Subscribers - more than 200 million globally, including a majority of U.S. households - would pay more because they want fast delivery, he said. That's potentially worth billions of dollars to Amazon's bottom line.</p><p>\"They have pricing power because the value proposition is so strong,\" said Mahaney.</p><p>Rival Netflix Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=NFLX.O\" data-type=\"ric\" data-ric=\"NFLX.O\" translate=\"no\" dir=\"ltr\">NFLX.O</a> <a href=\"https://www.reuters.com/technology/exclusive-netflix-raises-monthly-subscription-prices-us-canada-2022-01-14\" data-type=\"url\" class=\"tr-link\" translate=\"no\">raised its standard U.S. rate</a> weeks ago, too.</p><p>Amazon declined to comment on Prime's pricing. In October, its CFO Brian Olsavsky said the retailer had no hike to announce, but \"we always look at that.\" He cited Prime's value and the time since Amazon's last increase as points to consider.</p><p>Among the factors he did not highlight: reliability. Three people who have worked at Amazon said the company would think twice before raising rates until its operation returned to normal, pointing to some shipping delays. The company had not added a major Prime benefit recently, and it has yet to make one-day delivery the default it promised almost three years ago.</p><p>\"Given all of the Q4 delivery challenges, raising the price of Prime doesn’t seem appropriate,\" said Scott Jacobson, a former senior manager at Amazon, who is now at Madrona Venture Group.</p><p>The decision also boils down to math, he said. More valuable than fees is the way Prime changes the behavior of customers, prompting them to spend more on Amazon to make the most of their membership. Would extra subscription revenue outweigh any hit to spending by those who quit?</p><p>Amazon said it has worked to minimize how the pandemic and operational difficulties have impacted customers. It said in recent years it has added Prime benefits, such as savings on drugs when paying without insurance, and it has sped up delivery while adding popular programs to stream. </p><p>The cause of Amazon's latest challenges may come into focus in its results Thursday, stemming from a surge in demand, the ongoing labor and supply crunch, or both. The National Retail Federation <a href=\"https://www.reuters.com/world/us/us-holiday-sales-endure-supply-chain-omicron-snags-hit-887-bln-nrf-2022-01-14\" data-type=\"url\" class=\"tr-link\" translate=\"no\">has said</a> holiday sales rose 14.1% during November and December, beating its prior forecast.</p><p>The Omicron variant of COVID-19 has surged, too, albeit at the tail end of Amazon's U.S. holiday peak.</p><p>\"You’ve got to believe that Amazon got hit heavily,\" Pachter said, agreeing the company's delivery uncertainties complicated a Prime hike.</p><p>\"To raise my price when I literally ordered (some) hot sauce and it took like nine days to get here, that would be a poke in the eye.\"</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting By Jeffrey Dastin in Palo Alto, Calif; Editing by Lisa Shumaker)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Jeffrey.Dastin@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Jeffrey.Dastin@thomsonreuters.com</a> ; +1 424 434 7548; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-RESULTS/PREVIEW (PREVIEW, PIX)</p></div>"}