{"date": "2022-01-11 19:50:14.380000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Rackspace Technology has launched its collaboration with Auronix to use and optimize Amazon Web Services resulting in a 300% return on investment since implementation.</p><p>Founded in 1994, Auronix is a technology company focused on Calixta, the #1 communication platform-as-a-service in Latin America. Calixta connects brands handling millions of clients, with the right message and time, on the media they prefer, connecting meaningful conversations to systems, processes, and people.Serving the biggest brands in the financial industry, telecom, retail, and ecommerce, Auronix provides communication services for their customers through multiple digital channels and can quickly upgrade their infrastructure to offer availability, redundancy, elastic capacity, and incident monitoring.What we achieved togetherTogether, AWS, Rackspace Technology and Auronix built a more robust infrastructure, helping to strengthen Auronix's security as well as increase speed and scalability by moving all their products to the cloud. In addition, Rackspace Technology is now in charge of infrastructure monitoring, alerts, solution proposals, and risk mitigation planning, which proactively handles issues.These upgrades freed up Auronix resources to develop new applications, allowing the company to continue innovating and growing while realizing a 300% return on the investment and doubled migration speed.\"Rackspace Technology provides end-to-end multicloud expertise and has vast experience centralizing, automating, and optimizing processes more safely and efficiently,\" said Jeff DeVerter, Chief Technology Evangelist at Rackspace Technology. \"Given our track record, Auronix immediately saw that Rackspace Technology would be the perfect partner to help accelerate their digital transformation on AWS.\"\"Rackspace Technology has been an extremely important business partner for us,\" said Adrian Villaseñor, Co-director, Auronix. \"Our partnership has allowed us to manage our AWS infrastructure in a more scalable and a more appropriate way to be able to focus on what we have to do well.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}