{"date": "2022-02-08 19:29:03.687000+00:00", "ticker": "AAF", "mrkt_info": {"open": 155.0, "close": 139.1}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><span>\n              <p>LONDON, Feb 8 (IFR)</p>\n              <h6>Contact us at <a href=\"mailto:IFRECM.EMEA@refinitiv.com\" data-type=\"email\" translate=\"no\">IFRECM.EMEA@refinitiv.com</a></h6>\n              <ul class=\"bulleted-list arrowlist\">\n                <li>Pair sells 1.5% of Airtel Africa on recent rise</li>\n                <li>ImageSat to price Tel Aviv IPO at bottom</li>\n                <li>AD Ports up 13% on debut</li>\n                <li>Ukraine and aftermarkets put Russian ECM on hold for now</li>\n              </ul>\n              <blockquote>\n                <p>\n                  <span>Morgan Stanley</span> is sole bookrunner tonight on an offering of 15m shares in <strong>Deutsche Bank</strong> from Cerberus, representing 0.7% of share capital. The sale launched with guidance of €14.09 to the €14.374 close for a deal size of €211.35m–€215m. The deal was covered in a few minutes and after 5:30pm there was messaging that the transaction will price at €14.15 per share for a €212.25m deal and a 1.6% discount.</p>\n              </blockquote>\n              <p>\n              </p><p>Warburg Pincus and Morningstar Investment cut their stakes in London-listed mobile telecoms business <strong>Airtel Africa</strong> on Monday night for an aggregate £81.2m.</p>\n              <p>The trade is the first accelerated sale in Europe since January 27 when Goldman Sachs led a sale of Phoenix Group shares.</p>\n              <p>The Airtel ABB led by sole bookrunner <span>Citigroup </span>followed a short wall-crossing to fewer than 10 accounts on Monday afternoon that completed with oversubscription on indications.</p>\n              <p>The trade followed strong results for the nine months to December 31 at the end of last week that showed revenues grew by 21.7% and the leverage ratio improved to 1.4 times from 2.1 previously.</p>\n              <p>Airtel Africa shares joined the FTSE 100 index on January 27.</p>\n              <p>As a broker to Airtel Africa, Citi had garnered indicative interest during non-deal roadshows and had significant reverse enquiry ahead of launch.</p>\n              <p>The deal launched with 53m shares on offer, representing 1.4% of Airtel Africa, and was covered in around 15 minutes. The upsize to 58m shares, representing 1.5% of outstanding and around 15 days' trading, was communicated shortly before books closed.</p>\n              <p>Pricing of 140p was a 9.7% discount to Monday’s close of 155p.</p>\n              <p>Airtel Africa shares have risen nearly 10% since the start of the year and more than doubled since the beginning of 2021. The 160p close on February 2 is the highest since listing.</p>\n              <p>The company’s market cap is now £5.82bn compared with £3.1bn at IPO in June 2019.</p>\n              <p>The stock opened on Tuesday just below pricing at 139p and had pushed above after 9am in London. The shares hung around strike for much of the day before closing at 141.7p.</p>\n              <p>The top 10 orders took around 75% of the trade, with highly concentrated allocations and multiple anchor investors in for more than 10% each.</p>\n              <p>The sellers are subject to a 90-day lock-up on their remaining shares.</p>\n              <p>Israel’s <strong>ImageSat International</strong> is expected to price its Tel Aviv IPO at the bottom of the NIS19–NIS25 range when books close at 12pm in London on Wednesday.</p>\n              <p>Books are covered at that price for a deal size of NIS320m (US$100m).</p>\n              <p>ImageSat International has provided defence and intelligence organisations with satellite imaging for more than 20 years. Proceeds will be used for satellite launches over the next two years.</p>\n              <p>\n                <span>UBS</span> is sole bookrunner, with <span>Discount Capital</span> and <span>Barak Capital</span> as local distributors.</p>\n              <p>Shares in <strong>Abu Dhabi Ports</strong> opened up strongly on Tuesday and continued to rise during their ADX debut to close 13% higher following its Dh4bn (US$1.09bn) share sale.</p>\n              <p>AD Ports, which owns and operates 10 ports in the UAE, offered 1.25bn shares at Dh3.20 for a 24.56% free-float.</p>\n              <p>The shares opened at Dh3.50 and closed at Dh3.62. Approximately 77.8m shares changed hands, around 6% of the offered shares.</p>\n              <p>Global focus on Russian president Vladimir Putin's intentions towards Ukraine means that Russian ECM activity is off the table for now, but those working in the region are hopeful that deal flow will return in due course.</p>\n              <p>“There is a pipeline for this year, but with geopolitical issues going on we can’t proceed,” said one Russia-focused banker. “But when things calm down, and they generally do, we can look again.”</p>\n              <p>The banker said that anyone seasoned in Russia and CIS ECM has to appreciate that geopolitical issues regularly impact the ability to print deals. “It’s par for the course,” he said.</p>\n              <p>US sanctions led to a freeze on Russian IPOs between 2017 and 2019, and issuance since has been patchy. Last year there were positive signs with proceeds from Russian IPOs more than doubling to US$3.8bn from eight deals, though overall Russian ECM activity was down 6% by US dollar amount.</p>\n              <h3>Patchy</h3>\n              <p>From the highs of 2014 when 30 Russian ECM deals raised US$8.35bn, there were just nine deals totalling US$1.3bn in 2015. Despite a rise to 49 deals in 2016, volumes were smaller at US$5.5bn.</p>\n              <p>The return after US sanctions made for a bumper year in 2020 despite the impact of Covid-19, with 22 deals totalling US$7.7bn, with last year coming just below that level at 20 deals raising US$7.4bn.</p>\n              <p>Russian convenience store and off-licence operator Mercury Retail cancelled its US$1.2bn–$1.3bn Moscow IPO in November despite being covered on the first day of bookbuilding. The size made it stand out from other Russian deals but not necessarily from a busy European pipeline and the issuer decided it could not attain the desired valuation.</p>\n              <p>Some of the floats that did get away have performed poorly. Softline shares on Friday closed 33% below pricing, Renaissance Insurance shares closed down 44% and SPB Exchange, formerly St Petersburg Exchange, are down 15.5%. Retailer Fix Price's IPO totalled US$1.7bn, and its GDRs are now down 39%.</p>\n              <p>On the flip side, paper producer Segezha is up a quarter since its US$400m domestic float.</p>\n              <p>As with bankers across Europe, underperformance is weighing on the chances of reopening the Russian pipeline, and Russia is not exempt from the shift in focus from growth into value.</p>\n              <p>“Everyone is facing those headwinds, as well as broader macroeconomic conditions and concerns about inflation,” said the banker. “Everyone has question marks in their minds about investor appetite for IPOs unless it’s a particularly strong name. But there are still good stories that fit into the current macroeconomic environment.”</p>\n              <h3>Inherent problems</h3>\n              <p>A senior ECM banker at another bank said Russia has always been the most challenging part of EMEA, and not just from a geopolitical perspective. “Issuers around the world want the best price they can get, but Russian issuers are very, very focused on valuation,” he said. That includes clients complaining about stocks trading up as it meant money had been left on the table.</p>\n              <p>Last year’s Renaissance Insurance IPO of Rbs17.67bn (US$234m) was a prime example, he said. The October IPO had priced at the bottom of a Rbs120–Rbs135 range and shares closed at Rbs67.23 on Friday. “The vendor had clear instructions on what price he wanted, but it was the wrong price,” he said.</p>\n              <p>The Russia-focused banker said that there is more diversification across sectors than previously. “You only have to wind the clock back a few years and the only things you saw out of Russia were natural resources, metals and mining.”</p>\n              <p>As with elsewhere, any product launched into the market will have to overcome questions of how they will operate in a post-pandemic environment, particularly where companies benefited from the circumstances.</p>\n              <p>Potential 2022 candidates include fertiliser business EuroChem Group, paper producer Ilim Group, sugar producer Prodimex and car dealer Rolf.</p>\n              <p>There is also the prospect of further sanctions. The Russia-focused banker was keen to avoid any conversation around sanctions, but was hopeful that it would not come to that.</p>\n              <p>The senior banker reiterated that we have been here before. “Perhaps not as bad as currently, but we have seen this cycle of conflict and sanctions before. You are unlikely to see anything before Easter, possibly pre-summer but more likely the Russian pipeline will return after the summer,” he said.</p>\n              <p>In preparation for an uptick in activity, VTB has bolstered its origination team with <span>Natasha Sanders </span>arriving at the bank two weeks ago. Sanders is based in London with head of equity syndicate Marcus Brown. She joined from Morgan Stanley where Marina Shchukina has added Russia and CIS coverage to her responsibilities for fintech and FIG ECM.</p>\n              <h3>This week's deals</h3>\n              <h4>Monday</h4>\n              <p>\n                <b>Abu Dhabi Ports:</b> Dh4bn (US$1.1bn) ADX IPO, 1.25bn new at Dh3.20, 24.56% free-float, trading February 8.</p>\n              <p>\n                <b>Airtel Africa (UK – Telecoms): </b>£81.2m ABB, 58m (1.5%) secondary, upsized from 53m/1.4%, at 140p (9.7% discount to 155p close). <span>Citigroup</span></p>\n              <h4>Tuesday</h4>\n              <p>\n                <b>Deutsche Bank:</b> €211.35m–€215m ABB, 15m (0.7%) secondary at €14.09–€14.374 (up to 1.97% discount). <span>Morgan Stanley</span></p>\n              <p>\n                <strong>Wednesday</strong>\n              </p>\n              <p>\n                <b>ImageSat International (Israel – Satellite imagery): </b>NIS320m–NIS480m (US$100m–$150m) Tel Aviv IPO, NIS320m primary, NIS160m, up to 37.5% free-float, no greenshoe, books January 31–c. February 8, pricing c. February 9, trading February 15. <span>UBS</span></p>\n              <p>\n                <strong>Thursday</strong>\n              </p>\n              <p>\n                <b>Haffner Energy (France – Green hydrogen): </b>€73m–€85m Paris Euronext Growth IPO, c. €73m primary from up to 8.34m new at €8–€9.50, up to 1.25m secondary/extension, 1.4m secondary greenshoe, 17%–23% free-float, books January 31–February 10, trading February 15. <span>Barclays</span>, <span>Natixis</span>, <span>Portzamparc</span> (<span>Lazard</span> advising)</p>\n              <h3>Pipeline</h3>\n              <p>\n                <strong>February 14 – Polenergia (Poland – Energy)</strong>\n              </p>\n              <p>Z1bn (US$245m) follow-on, 21.4m new shares at up to Z47. Shareholders January 31–February 4, subs open February 10–14, allocations February 17. <span>Ipopema Securities</span></p>\n              <p>\n                <strong>February 14 – Civitanavi Systems (Italy – Sensors)</strong>\n              </p>\n              <p>€43.65m–€50.4m Milan IPO, 9.7m shares (7.2m new, 2.5m secondary) at €4–€5.20, 1.455m greenshoe, 30.1%–34.6% free-float, books February 2–14, trading February 17. <span>Berenberg, Intermonte</span></p>\n              <p>\n                <b>February 15 – Var Energi (Norway – Oil &amp; gas) COVERED 07/02</b>\n              </p>\n              <p>NKr6.16bn–NKr6.93bn (US$704m–$793m) Oslo IPO, 220m all-secondary at NKr28–NKr31.50, potential 55m upsize, 33m share greenshoe, 8.8%–12.7% free-float, books February 7–15, pricing/trading February 16. <span>DNB Markets</span>, <span>JP Morgan</span>, <span>Morgan Stanley</span>, <span>SpareBank 1 Markets</span>, <span>ABG Sundal Collier</span>, <span>Bank of America</span>, <span>Carnegie</span>, <span>Jefferies</span>, <span>Pareto Securities</span></p>\n              <p>\n                <b>c. February 18 – Technoprobe (</b>\n                <b>Italy – </b>\n                <b>Semiconductor testing equipment) COVERED 07/02</b>\n              </p>\n              <p>€610m–€712m  Euronext Growth Milan IPO, 25m new, 88m secondary at €5.40–€6.30, 12m/10.6% secondary greenshoe, 18.8%–20.8% free-float, books February 4 to c. February 18. <span>Intesa Sanpaolo, </span><span>Mediobanca</span></p>\n              <p>\n                <b>Early February – Clean Power Hydrogen (UK – Hydrogen technology)</b>\n              </p>\n              <p>£50m AIM IPO. <span>Cenkos</span></p>\n              <p>\n                <b>Early February – LXi REIT (UK)</b>\n              </p>\n              <p>£125m placing, 3-for-25 open offer, offer for subscription and intermediaries offer, 88.62m (12%) new at 142p (2.9% premium to estimated NAV of 139.5p, 6.8% discount to 152.4p January 17 close), books open c. January 24, close early February. <span>Alvarium Securities</span>, <span>Jefferies</span>, <span>Peel Hunt</span></p>\n              <p>\n                <b>Late February – GCP Co-Living REIT (UK)</b>\n              </p>\n              <p>£300m LSE IPO, 300m new at 100p, closes before end February. <span>Stifel Nicolaus Europe</span> (<span>Akur </span>advising)</p>\n              <p>\n                <b>Early March – Fred Olsen Windcarriers (Norway – Wind turbines)</b>\n              </p>\n              <p>c. €150m-equivalent Oslo IPO, all-primary, books c. February 17–March 3. <span>Arctic Securities</span>, <span>DNB Markets</span>, <span>SpareBank 1 Markets</span></p>\n              <p>\n                <b>March – Oxford Biomedica (UK – Biotech)</b>\n              </p>\n              <p>£80m firm placing, offer for subscription, EGM mid-February. <span>Peel Hunt</span>, <span>WG Partners</span></p>\n              <h6>Contact the European ECM team at <a href=\"mailto:IFRECM.EMEA@refinitiv.com\" data-type=\"email\" translate=\"no\">IFRECM.EMEA@refinitiv.com</a></h6>\n              <p>Owen Wild: +44 (0)204 530 2517, <a href=\"mailto:owen.wild@lseg.com\" data-type=\"email\" translate=\"no\">owen.wild@lseg.com</a><br/>Robert Venes: +44 (0)204 530 2523, <a href=\"mailto:robert.venes@lseg.com\" data-type=\"email\" translate=\"no\">robert.venes@lseg.com</a></p>\n              <h3>EMEA equities: 01-Jan-2022 to 07-Feb-2022 UTC (SDC: C4cr)</h3>\n              <div class=\"story-table-container\"><table class=\"league-table-sdc-c4cr story-basic-table\">\n                <thead>\n                  <tr class=\"persist-header\">\n                    <th> </th>\n                    <th>Managing bank / group</th>\n                    <th>No of issues</th>\n                    <th>Total US$(m)</th>\n                    <th>Share (%)</th>\n                  </tr>\n                </thead>\n                <tbody>\n                  <tr>\n                    <td>1</td>\n                    <td>Goldman Sachs</td>\n                    <td>5</td>\n                    <td>946.35</td>\n                    <td>15.1</td>\n                  </tr>\n                  <tr>\n                    <td>2</td>\n                    <td>BNP Paribas</td>\n                    <td>3</td>\n                    <td>946.32</td>\n                    <td>15.1</td>\n                  </tr>\n                  <tr>\n                    <td>3</td>\n                    <td>Bank of America</td>\n                    <td>3</td>\n                    <td>765.37</td>\n                    <td>12.2</td>\n                  </tr>\n                  <tr>\n                    <td>4</td>\n                    <td>Morgan Stanley</td>\n                    <td>3</td>\n                    <td>559.57</td>\n                    <td>8.9</td>\n                  </tr>\n                  <tr>\n                    <td>5</td>\n                    <td>Barclays</td>\n                    <td>3</td>\n                    <td>271.81</td>\n                    <td>4.3</td>\n                  </tr>\n                  <tr>\n                    <td>6</td>\n                    <td>Pareto AS</td>\n                    <td>4</td>\n                    <td>223.23</td>\n                    <td>3.6</td>\n                  </tr>\n                  <tr>\n                    <td>7</td>\n                    <td>SEB</td>\n                    <td>2</td>\n                    <td>210.21</td>\n                    <td>3.4</td>\n                  </tr>\n                  <tr>\n                    <td>8</td>\n                    <td>Berenberg</td>\n                    <td>2</td>\n                    <td>166.86</td>\n                    <td>2.7</td>\n                  </tr>\n                  <tr>\n                    <td>9</td>\n                    <td>Natixis</td>\n                    <td>2</td>\n                    <td>159.36</td>\n                    <td>2.5</td>\n                  </tr>\n                  <tr>\n                    <td>10</td>\n                    <td>Carnegie</td>\n                    <td>4</td>\n                    <td>122.61</td>\n                    <td>2.0</td>\n                  </tr>\n                  <tr>\n                    <td>11</td>\n                    <td>JP Morgan</td>\n                    <td>2</td>\n                    <td>116.47</td>\n                    <td>1.9</td>\n                  </tr>\n                  <tr>\n                    <td>12</td>\n                    <td>Jefferies</td>\n                    <td>2</td>\n                    <td>100.33</td>\n                    <td>1.6</td>\n                  </tr>\n                  <tr>\n                    <td>13</td>\n                    <td>Investec</td>\n                    <td>2</td>\n                    <td>89.42</td>\n                    <td>1.4</td>\n                  </tr>\n                  <tr>\n                    <td>14</td>\n                    <td>Saudi Investment Bank SJSC</td>\n                    <td>1</td>\n                    <td>83.16</td>\n                    <td>1.3</td>\n                  </tr>\n                  <tr>\n                    <td>15</td>\n                    <td>Close Brothers Group PLC</td>\n                    <td>1</td>\n                    <td>81.42</td>\n                    <td>1.3</td>\n                  </tr>\n                  <tr>\n                    <td>16</td>\n                    <td>Societe Generale</td>\n                    <td>2</td>\n                    <td>77.97</td>\n                    <td>1.2</td>\n                  </tr>\n                  <tr>\n                    <td>17</td>\n                    <td>Erste Group</td>\n                    <td>1</td>\n                    <td>74.64</td>\n                    <td>1.2</td>\n                  </tr>\n                  <tr>\n                    <td>18</td>\n                    <td>Auerbach Grayson &amp; Co</td>\n                    <td>1</td>\n                    <td>74.64</td>\n                    <td>1.2</td>\n                  </tr>\n                  <tr>\n                    <td>19</td>\n                    <td>KBC Group</td>\n                    <td>1</td>\n                    <td>74.64</td>\n                    <td>1.2</td>\n                  </tr>\n                  <tr>\n                    <td>20</td>\n                    <td>Cenkos Securities PLC</td>\n                    <td>2</td>\n                    <td>61.01</td>\n                    <td>1.0</td>\n                  </tr>\n                  <tr>\n                    <td>21</td>\n                    <td>Danske Bank</td>\n                    <td>2</td>\n                    <td>59.56</td>\n                    <td>1.0</td>\n                  </tr>\n                  <tr>\n                    <td>22</td>\n                    <td>Stifel/KBW</td>\n                    <td>1</td>\n                    <td>59.36</td>\n                    <td>0.9</td>\n                  </tr>\n                  <tr>\n                    <td>23</td>\n                    <td>Falcom Financial Services</td>\n                    <td>2</td>\n                    <td>58.92</td>\n                    <td>0.9</td>\n                  </tr>\n                  <tr>\n                    <td>24</td>\n                    <td>UBS</td>\n                    <td>1</td>\n                    <td>57.91</td>\n                    <td>0.9</td>\n                  </tr>\n                  <tr>\n                    <td>25</td>\n                    <td>Citigroup</td>\n                    <td>1</td>\n                    <td>57.91</td>\n                    <td>0.9</td>\n                  </tr>\n                </tbody>\n                <tfoot>\n                  <tr>\n                    <td>\n                      <div>-</div>\n                    </td>\n                    <td>TOTAL</td>\n                    <td>63</td>\n                    <td>6,263.40</td>\n                    <td>100.0</td>\n                  </tr>\n                </tfoot>\n              </table></div>\n              <p>Including all domestic and international deals and rights issues</p>\n              <p>\n                <strong>Source:</strong> Refinitiv <strong>SDC code:</strong> C4cr</p>\n              <h3>Global Convertible Offerings - EMEA: 01-Jan-2022 to 07-Feb-2022 UTC (SDC: C09d)</h3>\n              <div class=\"story-table-container\"><table class=\"league-table-sdc-c09d story-basic-table\">\n                <thead>\n                  <tr class=\"persist-header\">\n                    <th> </th>\n                    <th>Managing bank / group</th>\n                    <th>No of issues</th>\n                    <th>Total</th>\n                    <th>Share (%)</th>\n                  </tr>\n                </thead>\n                <tbody>\n                  <tr>\n                    <td>1</td>\n                    <td>HSBC</td>\n                    <td>1</td>\n                    <td>94.25</td>\n                    <td>33.3</td>\n                  </tr>\n                  <tr>\n                    <td>2</td>\n                    <td>Rabobank</td>\n                    <td>1</td>\n                    <td>94.25</td>\n                    <td>33.3</td>\n                  </tr>\n                  <tr>\n                    <td>3</td>\n                    <td>BNP Paribas</td>\n                    <td>1</td>\n                    <td>94.25</td>\n                    <td>33.3</td>\n                  </tr>\n                </tbody>\n                <tfoot>\n                  <tr>\n                    <td>\n                      <div>-</div>\n                    </td>\n                    <td>TOTAL</td>\n                    <td>1</td>\n                    <td>282.75</td>\n                    <td>100.0</td>\n                  </tr>\n                </tfoot>\n              </table></div>\n              <p>Including exchangeables.</p>\n              <p>\n                <strong>Source:</strong> Refinitiv <strong>SDC code:</strong> C09d</p>\n            </span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © Refinitiv 2022. Click For Restrictions - https://www.refinitiv.com/en/policies/copyright-notice</p></div>"}