{"date": "2021-11-24 22:11:48.160000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3580.04, "close": 3504.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>The Power Play by The Market Herald Releases New Interviews with Algernon Pharmaceuticals, Better Plant Sciences, and Mednow Inc. Discussing Their Latest News</p>\n</div>\n<div class=\"tr-npp-body\">\n<pre>MEDNOW INC (\"MNOW-V;MDNWF-0\")\nALGERNON PHARMACEUTICALS INC (\"AGN-Z\")\n- The Power Play by The Market Herald Releases New Interviews\n- with Algernon Pharmaceuticals, Better Plant Sciences, and\n- Mednow Inc. Discussing Their Latest News\n\n     The Power Play by The Market Herald releases new interviews with\nAlgernon Pharmaceuticals, Better Plant Sciences and Mednow Inc. discussing\ntheir latest news.\n\n     The Power Play by The Market Herald provides investors with a quick\nsnapshot of what they need to know about the company's latest press release\nthrough exclusive insights and interviews with company executives.\n\n     Algernon Pharmaceuticals receives positive feedback from the U.S. FDA\nfor Phase 1 Ifenprodil small cell lung cancer study\n\n     Algernon Pharmaceuticals (AGN) has received positive feedback from the\nU.S. FDA for its investigation of NP-120 (Ifenprodil) to treat small cell\nlung cancer. Ifenprodil is an N-methyl-D-aspartate (NMDA) receptor\nantagonist specifically targeting the NMDA-type subunit 2B (GluN2B). CEO\nChris Moreau sat down with Dave Jackson to discuss the news.\n\n     Better Plant (CSE:PLNT) adds Nationwide Natural Foods as a distributor\nfor Jusu Bar juices in Canada\n\n     Better Plant Sciences (PLNT) has added Nationwide Natural Foods Inc.\nas a distributor for Jusu Bar juices in Canada. Nationwide has accounts\nacross Canada with major and independent grocery stores including Sobeys,\nThe Jim Pattison Group of Stores, Country Grocer, Whole Foods Market,\nNutters, and Sunterra Markets. Amber Allen, Director of Sales for Better\nPlant sat down with Dave Jackson to discuss the partnership with\nNationwide.\n\n     For the full interview with Amber Allen and to learn more about Better\nPlant Sciences' announcement, click here.\n\n     Mednow (TSXV:MNOW) announces acquisition of Infusicare Canada and a\n$500,000 investment in Doko Mednow (MNOW) has announced a $500,000\ninvestment in Doko, a virtual healthcare provider. Doko operates in more\nthan 38 states with more than 100 physicians and healthcare professionals\non its platform. Doko will use the proceeds of Mednow's investment to\nexpand its operations through hiring, digital marketing, and further\ndeveloping its technology. Karim Nassar, CEO of Mednow sat down with\nCaroline Egan to discuss the investment in Doko.\n     For the full interview with Karim Nassar and to learn more about\nMednow's announcement, click here.\n\n     Interviews for The Power Play by The Market Herald are released daily.\nTo learn more about the companies featured in The Power Play or to explore\nour other interviews visit The Power Play by The Market Herald.\n\n     About The Market Herald\n\n     The Market Herald Canada is the leading source of authoritative\nbreaking stock market news for self-directed investors. Our team of\nCanadian markets reporters, editors and technologists covers the entire\nlisted company universe in Canada. We cover over 3,985 businesses, their\npeople, their investors, and their customers. We write the stories that\nmove the Canadian capital markets.\n\n     DISCLAIMER: Report Card Canada Media Ltd. (\"Report Card\") is a\nwholly-owned subsidiary of Market Herald Limited, an Australian company\n(\"Market Herald\"). Report Card is not an advisory service, and does not\noffer, buy, sell, or provide any other rating, analysis or opinion on the\nsecurities we discuss. We are retained and compensated by the companies\nthat we provide information on to assist them with making information\navailable to the public. All information available on themarketherald.ca\nand/or this press release should be considered as commercial advertisement\nand not an endorsement, offer or recommendation to buy or sell securities.\nReport Card is not registered with any financial or securities regulatory\nauthority in any province or territory of Canada, will not be performing\nany registerable activity as defined by the applicable regulatory bodies\nand do not provide nor claim to provide investment advice or\nrecommendations to any visitor of this site or readers of any content on or\noriginating from themarketherald.ca. Market Herald and/or its affiliates\nand/or their respective officers, directors or employees may from time to\ntime acquire, hold or sell securities and/or commodities and/or commodity\nfutures contracts in certain underlying companies mentioned in this site\nand which may also be clients of Market Herald's affiliates. In such\ninstances, Market Herald and/or its affiliates and/or their respective\nofficers, directors or employees will use all reasonable efforts to avoid\nengaging in activities that would lead to conflicts of interest and Market\nHerald and/or its affiliates will use all reasonable efforts to comply with\nconflicts of interest disclosures and regulations to minimize any conflict.\nAll the information on this document and/or the website -\nthemarketherald.ca - is published in good faith and for general information\npurpose only. Report Card does not make any warranties about the\ncompleteness, reliability, and accuracy of this information. Any action you\ntake upon the information you find on this document and/or website\n(themarketherald.ca) is strictly at your own risk. Report Card will not be\nliable for any losses and/or damages in connection with the use of our\nwebsite. From our website, you can visit other websites by following\nhyperlinks to such external sites. While we strive to provide only quality\nlinks to useful and ethical websites, we have no control over the content\nand nature of these sites. These links to other websites do not imply a\nrecommendation for all the content found on these sites. Site owners and\ncontent may change without notice and may occur before we have the\nopportunity to remove a link which may have gone 'bad'. Please be also\naware that when you leave our website, other sites may have different\nprivacy policies and terms which are beyond our control. Please be sure to\ncheck the Privacy Policies of these sites as well as their \"Terms of\nService\" before engaging in any business or uploading any information.\n\nCONTACT:\nThe Market Herald\nBrianna Anthony\nbrianna.anthony@themarketherald.ca\nthemarketherald.ca\n\nTel   : 855-686-6300    MEDNOW INC\nEmail : IR@mednow.ca\nWWW   : <a href=\"https://www.mednow.ca\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.mednow.ca</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132700723.MNPRE2132702484-13372420211124</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}