{"date": "2021-03-18 18:29:59.242000+00:00", "ticker": "AAF", "mrkt_info": {"open": 84.0, "close": 87.6}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-abstract\"><p>Airtel Africa, an arm of Bharti Airtel, on Thursday said TPGâ\u0080\u0099s The Rise Fund would invest $200 million in its mobile money business at a valuation of $2.65 billion. Airtel Africa also said it would explore potential listing of mobile money business within four years. The proceeds will be used to reduce group debt and invest in network and sales infrastructure in the respective operating countries.</p></div><div class=\"tr-npp-lead\"><p>Airtel Mobile Commerce BV is the holding company for several of Airtel Africaâ\u0080\u0099s mobile money operations, and plans to own and operate the businesses across Airtel Africaâ\u0080\u0099s 14 operating countries. The Rise Fund will hold a minority stake in AMC B.V. upon completion of the transaction, with Airtel Africa continuing to hold the remaining majority stake.</p><p>â\u0080\u009cThe transaction is the latest step in the groupâ\u0080\u0099s pursuit of strategic asset monetisation and investment opportunities, and it is the aim of Airtel Africa to explore the potential listing of the mobile money business within four years,â\u0080\u009d Airtel said.</p></div><div class=\"tr-npp-body\"><p>Raghunath Mandava, chief executive of Airtel Africa, said: â\u0080\u009cOur markets afford substantial potential for mobile money services to meet the needs of the millions of users in Africa who have little or no access to banking and financial services, and this demand is driving growth.â\u0080\u009d</p><p>Airtel Africa Group is also in discussions with other potential investors to further minority investments into Airtel Money, up to a total of 25 per cent of the issued share capital of AMC BV. Operating under the Airtel Money brand, Airtel Africa's mobile money services is a leading digital mobile financial services platform catering to a market in Africa, which is characterised by limited access to formal financial institutions with limited banking infrastructure. It includes mobile wallet deposit and withdrawals, merchant and commercial payments, benefits transfers, loans and savings, virtual credit card, and international money transfers.</p><p>â\u0080\u009cWith this investment, we are excited to expand The Rise Fund's global fin-tech portfolio and continue to deepen our focus on improving financial inclusion in Africa and around the world,â\u0080\u009d said Yemi Lalude, partner at TPG who leads Africa investing for The Rise Fund.</p><p>In the third quarter, the mobile money service segment (corresponding to all the businesses that are intended to be transferred to AMC BV) generated revenue of $110 million ($440 million annualised), and underlying Ebitda of $54 million ($216 million annualised) at a margin of 48.7 per cent.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}