{"date": "2022-02-04 20:09:40+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2776.91, "close": 3158.71}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n        We work tirelessly to earn our customers' trust and have worked even harder to maintain it.\n      </div>\n                <div>\n                  <p>\n          In 2012, we launched Amazon Kids, formerly Amazon FreeTime, a dedicated service that helps parents manage the ways their kids interact with technology, including limiting screen time. Amazon Kids provides kids a safe place to enjoy age-appropriate books, movies, games, and more.\n        </p>\n                  <p>\n          Since then, over 20 million kids (and their parents) have enjoyed Amazon Kids. Parents have trusted Amazon Kids to give them the control they need to provide a safe place for their children to enjoy technology and to rigorously protect the privacy of family members using Amazon products. We continue to work tirelessly to earn our customers' trust, and we have worked even harder to maintain it over the years.\n        </p>\n                  <p>\n          When we expanded Amazon Kids to include Alexa in 2018, we applied these same rigorous standards. We introduced an all-new version of Alexa, built from the ground up for kids, and a brand-new product, Echo Dot Kids Edition, to give parents more peace of mind. But we didn't do this alone: We also work closely with the Family Online Safety Institute (FOSI) and other leading industry groups, and we follow industry best practices for securing verifiable parental consent. Today, Amazon Kids on Alexa is available on all Echo smart speaker and display devices, like the Echo Show and Echo Dot.\n        </p>\n                  <p>\n          We have a longstanding commitment at Amazon to preserve the trust of our customers and their families, and we have strict measures and protocols in place to protect their security and privacy. We also adhere to the Children's Online Privacy Protection Act (COPPA).\n        </p>\n                  <p>\n          Amazon Kids on Alexa is available on compatible Echo devices. Here's what we want you to know:\n        </p>\n                  <h4>\n          We require parental consent.\n        </h4>\n                  <p>\n          We require verifiable parental consent from all customers before enabling Amazon Kids on Alexa. Unless a parent has previously granted permission, the first time a parent attempts to set up Amazon Kids on Alexa, they will be prompted to provide verifiable parental consent on the Alexa App by entering their payment card verification code or a one-time code sent via SMS. Parents can review or change permissions by visiting the <span><a href=\"http://www.amazon.com/manageparentalconsent\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Manage Parental Consent</a></span>page or by contacting Customer Service.\n        </p>\n                  <h4>\n          Kid skills in Amazon Kids+ do not collect personal information.\n        </h4>\n                  <p>\n          None of the Alexa skills included with the Amazon Kids+ subscription service has access to or collects personal information, and we never share audio recordings with any skill developer. Our policies prohibit kid skills from collecting any personal information without separately obtaining verifiable parental consent and disclosing the collection of this information in their privacy policy. Some kid skills do not provide a privacy policy simply because they do not collect any personal information.\n        </p>\n                  <h4>\n          There are multiple ways to delete a child's profile and recordings.\n        </h4>\n                  <p>\n          Amazon Kids on Alexa voice recordings are retained to enable parents to review and listen to their children's interactions with Alexa, to improve the child's experience, and to improve our Alexa and Amazon Kids services. Parents can review and delete the voice recordings at any time in the Alexa App or on our website. Parents can also contact Customer Service to request deletion of their child's profile and personal information associated with their child's profile (including voice recordings).\n        </p>\n                  <h4>\n          There are multiple ways to access our Privacy Policy.\n        </h4>\n                  <p>\n          We provide customers multiple places to view our privacy policy. When parents set up Amazon Kids on compatible Echo devices, they must give verifiable parental consent, consistent with COPPA. In the set-up experience, we provide key information regarding how Amazon handles personal information collected from the supported Echo device, and we provide access to our Children's Privacy Disclosure. Parents can also visit our Children's Privacy Disclosure at any time in the Alexa App or on our <span><a href=\"http://www.amazon.com/help/childprivacy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">website</a></span><u>.</u> On the <span><a href=\"https://www.amazon.com/gp/help/customer/display.html?nodeId=201602230\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Alexa and Alexa Device FAQs</a></span>page, they can learn more about Amazon Kids on Alexa and how Amazon Kids on Alexa voice recordings are used, along with other information about Alexa and supported Echo devices. Parents can also ask Alexa directly, \"Alexa, what is your privacy policy?\"\n        </p>\n                  <p>\n          We are committed to inventing new experiences that parents trust and kids enjoy, and privacy will continue to serve as the cornerstone, knowing that our customers have put their trust in us.\n        </p>\n                  <p>\n          -The Amazon Kids Team<br/></p>\n                </div>\n                <div>\n                  <div>\n          Related Tags\n        </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/devices\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Devices</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/alexa\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Alexa</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/family-digital-wellness-hub\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Family Digital Well-Being</a>\n                    </span>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/devices/amazon-kids-approach-to-family-privacy-and-safety\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>04 February 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>04 February 2022 20:09:40 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}