{"date": "2022-02-04 06:00:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3012.25, "close": 3152.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By David Randall</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW YORK, Feb 4 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Diverging earnings from megacap growth stocks are fueling wild swings in equities, opening the door for more volatility on the heels of last month’s sharp drop as investors grow more discerning in the names they pick. </p><p>Many market participants hoped that earnings from the big, tech-focused stocks that have led markets for years would lend equities a modicum of support after January’s sharp declines, which saw the Nasdaq Composite <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.IXIC\" data-type=\"ric\" data-ric=\".IXIC\" translate=\"no\" dir=\"ltr\">.IXIC</a> fall 9% and the S&amp;P 500 <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.SPX\" data-type=\"ric\" data-ric=\".SPX\" translate=\"no\" dir=\"ltr\">.SPX</a> give up 5.3% after a hawkish shift from the Federal Reserve. </p><p>But this week's earnings from megacap growth stock names has whiplashed investors. </p><p>\"I'm concerned that if we continue to see major moves in widely owned stocks, investors will get turned off by markets,\" said Dennis Dick, a proprietary trader, and market structure consultant with Bright Trading LLC. “One thing is certain, volatility is here to stay.”</p><p>Wall Street's fear gauge, the Cboe Volatility Index <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.VIX\" data-type=\"ric\" data-ric=\".VIX\" translate=\"no\" dir=\"ltr\">.VIX</a>, rose on Thursday to its highest level in a week as investors punished Facebook owner Meta Platforms <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a> for disappointing their expectations, with a 26.4% plunge in Meta’s shares lopping some $200 billion from its market value -  the biggest ever one-day slide in market value for a U.S. public company. <a href=\"reuters://REALTIME/verb=Headlines/ric=L4N2UE1L9\" data-type=\"newsExpression\" data-expression=\"L4N2UE1L9\" translate=\"no\" dir=\"ltr\">L4N2UE1L9</a></p><p>After the bell, sentiment seemed to take an about-face when Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> delighted investors by hiking its Prime subscription rate and soared in after-hours trading on Thursday, lifting futures with it. Earlier in the week, Google parent Alphabet Inc's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a> shares surged after it reported record revenue. <a href=\"reuters://REALTIME/verb=Headlines/ric=L4N2UE30Z\" data-type=\"newsExpression\" data-expression=\"L4N2UE30Z\" translate=\"no\" dir=\"ltr\">L4N2UE30Z</a></p><p>The wild moves may offer a preview of what is in store for markets in coming months, as <a href=\"https://www.reuters.com/business/fed-officials-say-march-rate-hike-track-future-increases-data-dependent-2022-01-31\" data-type=\"url\" class=\"tr-link\" translate=\"no\">looming interest rate hikes</a> make investors less forgiving of bad news and dim the allure of the richly valued companies whose shares thrived over the last two years amid the COVID-19 pandemic.</p><p>\"The market is highly volatile and very choppy and if you are going to report bad earnings you need to expect that you will get taken out behind the woodshed,” said Phil Orlando, a portfolio manager at Federated Hermes. “Companies that are going to buck that trend are companies that are able to produce better numbers and more upbeat guidance.\"</p><p>Overall, the surprise factor - which shows the rate by which companies significantly exceeded analyst estimates - dropped to 8.8% in the fourth quarter of 2021 from 16% a year ago. In the communications services sector, where Meta is represented, the factor fell to 6.1% from 24.3%, according to Refinitiv data.</p><p><br/></p><p>        </p><p>PICK AND CHOOSE</p><p>The divergence in fortunes is causing investors to choose carefully. </p><p>Josh Wein, a portfolio manager for the Hennessy Technology Fund, is focusing on companies that can demonstrate pricing power – or the ability to maintain or increase margins despite rising commodity and wage costs by raising prices – in the face of rising inflation. </p><p>Wein, who does not have a position in Meta, expects to see a widening gap in performance this year between companies such as Microsoft Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MSFT.O\" data-type=\"ric\" data-ric=\"MSFT.O\" translate=\"no\" dir=\"ltr\">MSFT.O</a> and Oracle Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ORCL.N\" data-type=\"ric\" data-ric=\"ORCL.N\" translate=\"no\" dir=\"ltr\">ORCL.N</a> that primarily focus on business customers, and those like Netflix Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=NFLX.O\" data-type=\"ric\" data-ric=\"NFLX.O\" translate=\"no\" dir=\"ltr\">NFLX.O</a> and Meta that rely more on consumer preferences in an increasingly competitive landscape.</p><p>\"This is a time when companies with wider moats around their businesses are going to outperform,\" he said, citing his bullishness on companies such as Nvidia Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=NVDA.O\" data-type=\"ric\" data-ric=\"NVDA.O\" translate=\"no\" dir=\"ltr\">NVDA.O</a> and Alphabet.</p><p>Julie Biel, a portfolio manager at Kayne Anderson Rudnick, which owns shares of Meta Platforms, is focusing on software companies that sold off during the widespread declines the Nasdaq index experienced in December and January, yet are in niche business markets. </p><p>Among her holdings is Duck Creek Technologies Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=DCT.O\" data-type=\"ric\" data-ric=\"DCT.O\" translate=\"no\" dir=\"ltr\">DCT.O</a>, which provides cloud software for property and casualty insurance companies. Shares of the company are down around 17% for the year to date. </p><p>\"I really took it on the chin in January, and now I have the ability to add back into businesses that have strong pricing power,\" she said.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by David Randall; Additional reporting by John McCrank; Writing by Ira Iosebashvili; Editing by Megan Davies and Muralikumar Anantharaman)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:David.Randall@thomsonreuters.com\" data-type=\"email\" translate=\"no\">David.Randall@thomsonreuters.com</a> ; 646-223-6607; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://david.randall.thomsonreuters.com@reuters.net\">david.randall.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: META PLATFORMS-INVESTORS/ (PIX)</p></div>"}