{"date": "2021-08-17 21:41:45.199000+00:00", "ticker": "AVV", "mrkt_info": {"open": 4036.0, "close": 4053.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>AVEVA GROUP PLC (\"AVVYY,AVEVF-0\")\n- Unify Vale Mining Operations to\n- Improve Safety and Sustainability\n\n     Schneider Electric, the leader in the digital transformation of energy\nmanagement and automation, and AVEVA, a global leader in industrial\nsoftware, driving digital transformation and sustainability, are powering\nthe unification of operations for Vale, a global natural resources and\nmining company.\n\n     The combination of AVEVA and Schneider Electric software, technology\nand mining domain expertise is providing Vale with the ability to\nintegrate, centralize, and remotely monitor operations across its Mariana\nand Itabira complexes in Brazil.\n\n     Vale ranks among the top five largest mining companies in the world.\nHeadquartered in Rio de Janeiro, the world's leading producer of iron ore,\npellets and nickel employs a global workforce of over 170,000 people in 38\ncountries. The Mariana Complex and Itabira Complex are two of Vale's major\niron ore production sites, located in Minas Gerais, Brazil. Together, the\ncomplexes are responsible for more than 75% of the production data from\nVale's Minas Gerais mining operations.\n\n     While primarily implemented to improve safety through remote\noperations, digitalization is critically important to driving efficiency\nand sustainability in mining. Through the partnership, Vale can unify\noperations across multiple sites and upgrade its old system to one capable\nof remotely controlling all the diverse technologies operating across each\nmining facility. Crucially, the remote management solution enables Vale to\nhave fewer professionals onsite, increasing safety and reducing operational\nexpenditures while also vastly improving energy efficiency, and therefore,\nsustainability.\n\n     Vale chose Schneider Electric and AVEVA for the technological\nperformance and visibility offered by their solutions. These provide an\nextremely high level of flexibility due to their vendor-agnostic nature,\nmaking it easy to integrate disparate technologies across multiple sites.\n\n     \"We are constantly looking to improve safety, efficiency and\nsustainability, not just now but also for the future,\" said Paulo Henrique\nFontes Coura, Senior Automation Leader, Vale. \"Schneider Electric and AVEVA\nhave become an integral part of that journey. Rather than simply offering\nthe software, they provided a complete, bespoke end-to-end service helping\nus optimize at every turn. This included training, support, and advice\nthroughout.\"\n\n     \"The collaboration between our companies has created something much\ngreater than the sum of its parts,\" said Gilberto da Cunha Vieira,\nElectrical and Automation Engineer Leader, Vale. \"We are enormously\ngrateful to Schneider Electric and AVEVA for bringing our facilities\ntogether.\"\n\n     Schneider Electric deployed EcoStruxure(TM) Control Expert - Asset\nLink, combining AVEVA(TM) System Platform and Schneider Modicon M580, to\nprovide visibility and unify operations for Vale. The technology enables\ndata to be integrated directly into the system, so Vale's managers have\ngranular insights without having to manually transfer any intelligence. By\nbringing this data together, Vale can now create a master operations center\nand remotely manage everything. This greatly improves operational\nefficiency and means less people are onsite, providing a significant boost\nto safety.\n\n     Other results include:\n\n//st\n\n  * Cost savings with faster data to make decisions\n  * Full visibility and compatibility for all plants, providing a single\n    holistic view\n  * Better coordination in operations, and increased efficiency and\n    productivity by unifying multiple disciplines at the same place\n  * Complete standardization through one platform, with multiple device\n    manufacturers\n  * Greater sustainability through resource optimization\n\n//et\n\n     \"In today's world, information is imperative,\" said Rob Moffitt,\nPresident - Mining, Minerals and Metals, Schneider Electric. \"It drives\nsafety, sustainability, and profitability for those able to use it\nsuccessfully. Iron production is essential to all our lives, providing\nsteel for the automotive and construction industries around the world. It\nis vital that a sector upon which we rely can run efficiently, safely and\nsustainably. The system we have created for Vale alongside AVEVA is vital\nto this process. We look forward to seeing Vale unlock its potential to\nunderstand, manage and enhance its operations across Brazil.\"\n\n     \"Mining operations are data-rich environments where digital\ntransformation can drive sustainability and productivity gains for improved\nasset utilization and enhanced value optimization,\" commented Marc Ramsay,\nVice President, Global Strategic Partners, AVEVA. \"Together with Schneider\nElectric EcoStruxure, AVEVA System Platform supports Vale in realizing the\nmines of the future through contextualized operations built on a\ncollaborative, standards-based foundation that unifies people, processes,\nand assets across all of Vale's facilities for continuous operational\nimprovement and real-time decision assistance.\"\n\n     About Schneider Electric\n     Schneider's purpose is to empower all to make the most of our energy\nand resources, bridging progress and sustainability for all. We call this\nLife Is On.\n\n     Our mission is to be your digital partner for Sustainability and\nEfficiency.\n\n     We drive digital transformation by integrating world-leading process\nand energy technologies, endpoint to cloud connecting products, controls,\nsoftware and services, across the entire lifecycle, enabling integrated\ncompany management, for homes, buildings, data centers, infrastructure and\nindustries.\n\n     We are the most local of global companies. We are advocates of open\nstandards and partnership ecosystems that are passionate about our shared\nMeaningful Purpose, Inclusive and Empowered values.\n\n     <a href=\"https://www.se.com/ca/en\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.se.com/ca/en</a>/\n\n     About AVEVA\n\n     AVEVA is a global leader in industrial software, driving digital\ntransformation and sustainability. By connecting the power of information\nand artificial intelligence with human insight, AVEVA enables teams to use\ntheir data to unlock new value. We call this Performance Intelligence.\nAVEVA's comprehensive portfolio enables more than 20,000 industrial\nenterprises to engineer smarter, operate better and drive sustainable\nefficiency. AVEVA supports customers through a trusted ecosystem that\nincludes 5,500 partners and 5,700 certified developers around the world.\nThe company is headquartered in Cambridge, UK, with over 6,500 employees\nand 90 offices in over 40 countries. Learn more at www.aveva.com..\n\n     For more details visit: www.aveva.com\n\n     AVEVA, the AVEVA logos and AVEVA product names are trademarks or\nregistered trademarks of AVEVA Group plc or its subsidiaries in the United\nKingdom and other countries. Other brands and product names are the\ntrademarks of their respective companies.\n\n     (c) 2021 AVEVA and Schneider Electric. All Rights Reserved.\n\n Contact Information:\n\nSchneider Electric Media Relations - Olivia Goemans\nOlivia.Goemans@edelman.com 587 888 8821; AVEVA Media Relations -\nExternal.communications@aveva.com\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2122800602.MNPRE2122803008-14142820210817</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}