{"date": "2022-01-13 21:21:12.199000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3304.14, "close": 3242.76}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENGINE GAMING &amp; MEDIA INC (\"GAME-V\")\n- Reports First Quarter Fiscal Year 2022 Financial Results\n\n    Engine Gaming and Media, Inc. (\"Engine\" or the \"Company\"), an\nesports/sports social gaming, influencer marketing, and next-generation\nmedia solutions company, announced results for its first quarter of fiscal\nyear 2022 ended November 30, 2021. All amounts are stated in US dollars\nunless otherwise indicated.\n\n    Total revenue for FY Q1'2022 was $14.3 million, up from $7.5 million in\nFY Q1'2021, an increase of 92% YoY, and 22% higher than sequential FY\nQ4'2021 of $11.8 million.\n\n    For the 1st quarter ended November 30, 2021, Net loss was $(1.3)\nmillion, a decrease in loss of $4.7 million from FY Q1'2021 Net loss of\n$(6.0) million.\n\n    For the 1st quarter ended November 30, 2021, Adjusted EBITDA was $(5.0)\nmillion, an increase in loss of $100 thousand from FY Q1'2021 Adjusted\nEBITDA of $(4.9) million.\n\n    The Company had cash of $9.7 million and $10.1 million in receivables\nas of November 30, 2021. In addition, the Company had working capital\nsurplus of $3.2 million after excluding non-cash warrant liability and\narbitration reserve.\n\n    Key segment revenue growth that contributed to the strong revenue\nperformance:\n\n//st\n\n  * Software-as-a-Service: SaaS revenue for FY Q1'22 was $2.1 million, up\nfrom $1.4 million in FY Q1'21, an increase of 45% YoY and, 7% higher than\nsequential FY Q4'21 of $2.0 million.\n  * Advertising: Advertising revenue for FY Q1'22 was $10.0 million.\nAdvertising revenues grew 84% YoY, with FY Q1'21 revenues of $5.5 million\nand 14% quarter-over-quarter, with FY Q4'21 revenues of $8.8 million.\n  * Games Development: Game development revenues for FY Q1'22 was $2.1\nmillion. Game development revenues grew 320% YoY, with FY Q1'21 revenues\nof $0.5M and 157% quarter-over-quarter, with FY Q4'21 revenues of $0.8\nmillion.\n\n//et\n\n    Lou Schwartz, Chief Executive Officer of Engine, stated, \"We are\nextremely gratified by the very significant revenue growth we have created\nthroughout the Company. The continued significant year over year and\nquarter over quarter revenue growth, almost doubling from a year earlier,\nand almost all organic, is a real testament to the Engine teams' efforts in\ndriving the business forward on an accelerated basis\".\n\n    Tom Rogers, Executive Chairman of the Company added, \"As social\nengagement increasingly defines both video game interaction and digital\nmarketing innovation, our collection of assets continues to bring\nincreasing focus of that attribute to the fore. Winview, UMG, Eden, Stream\nHatchet and Sideqik all continue to differentiate their offerings relative\nto social gaming and marketing. With our continued, significant revenue\ngrowth, and investment in product enhancements to sustain that growth, in\nthe course of one-year we have begun to show what the Engine assets are\ncapable of representing in terms of substantially enhanced asset value. We\nbelieve with our plans for sustainable cash infusion, as the businesses\nbegin to move toward profitability, the market will recognize the\nsubstantial opportunity for appreciation as the Engine \"revs.\"\n\n    Recent highlights from the Company's operating businesses include:\n\n//st\n\n  * Frankly Media - Frankly Media renewed its digital media agreement with\nits largest radio station operator that serves hundreds of owned and\noperated stations delivering premium content to over a quarter billion\npeople each month. In addition, Frankly renewed its advertising\nrepresentation agreement with Westwood One, which offers nationally\nsyndicated sports, news and entertainment content to more than 250\nmillion monthly listeners across an audio network of over 7,000+\naffiliated broadcast radio stations and media partners. Lastly,\nadvertising CPMs and RPMs increased by 25% and 75% respectively\nyear-over-year\n  * Sideqik - Sideqik's leading influencer marketing and social commerce\nplatform continues to scale, signing a multi-year extension with leading\ngaming hardware brand HyperX, recently acquired by HP, as well as\nonboarding global apparel leader Nike and multinational computer and\nphone hardware company ASUS to its long list of partners and clients.\n  * Stream Hatchet - Stream Hatchet released its new sponsorship\nmeasurement\ntechnology, which contextualizes brand activations instream, providing\npartners tools to track, measure, and optimize activations within\nlive-streaming environments, such as logo impressions on platforms like\nYouTube and Twitch. A major esports and AAA game publisher has already\nbegun to utilize this new technology. In addition, Stream Hatchet has\ncontinued to grow its expanding client list, including StreamElements,\nthe fastest growing provider of production, monetization, audience\nengagement, sponsorship, and influencer marketing tools and services for\nlivestreams across Twitch, YouTube Live, Facebook Gaming, and Trovo.\n  * UMG Gaming - UMG Gaming's greatly enhanced production of Microsoft's\nGears Esports competition series debuted on the official Xbox Channel,\ndriving over 250,000 of hours watched within the first split. In\naddition, Thrustmaster, a leading peripheral manufacturer, has joined\nGears Esports, naming the ESWAP x PRO CONTROLLER as the official\ncontroller of Gears Esports, as well as taking title sponsorship of Play\nof the Day moments.\n  * Eden Games - Eden continues to extend its expertise in mobile gaming's\nmotorsport category, beginning development on a variety of different\nracing experiences with major game partners. In addition, Eden has\nreceived substantial interest from numerous parties since announcing its\nstrategic process.\n  * Winview - Since releasing, Pregame, a game mode that enables players to\ncompete in game-of-skill contests prior to the start of a live sporting\nevent, thus complementing its live play-along experience, player\nengagement has increased by 30%+.\n\n//et\n\n    The Company also announced the addition of highly respected private\nequity fund manager Stu Porter, CEO of Denham Capital, and one of the\nCompany's largest investors, to its board of directors.\n\n    Additionally, the Company will host a conference call on Thursday\nJanuary 13, 2022 at 4:30 p.m. Eastern Time to discuss its financial results\nin further detail. The conference call can be accessed at 877-407-0784 or\nfor international callers at +1-201-689-8560\n\n    Non-IFRS Measures\n\n    The Company reports earnings before interest, taxes, depreciation and\namortization (\"EBITDA\") and Adjusted EBITDA, which are not financial\nmeasures calculated and presented in accordance with International\nFinancial Reporting Standards (\"IFRS\") and therefore may not be comparable\nto similar measures presented by other issuers. EBITDA and Adjusted EBITDA\nshould not be considered in isolation or as a substitute to net income\n(loss) or any other financial measures of performance or liquidity\ncalculated and presented in accordance with IFRS. The Company defines\nAdjusted EBITDA as EBITDA, adjusted to exclude certain non-cash charges and\nother items that we do not believe are reflective of our ongoing operating\nresults. The Company utilizes Adjusted EBITDA internally for purposes of\nforecasting, determining compensation, and assessing the performance of our\nbusiness, therefore, we believe this measure provides useful supplemental\ninformation that may assist investors in assessing an investment in the\nCompany.\n\n    The following unaudited table presents the reconciliation of net loss\nto Adjusted EBITDA for the three months ended November 30, 2021 and 2020,\nrespectively.\n\n    This earnings release should be read in conjunction with the Company's\nInterim Condensed Consolidated Financial Statements and accompanying notes\nthat will be made available on Engine's investor relations site on January\n14, 2022 which can be found at <a href=\"https://ir.enginemediainc.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://ir.enginemediainc.com</a>/.\n\n    About Engine Gaming and Media, Inc.\n\n    Engine Gaming and Media, Inc. is traded publicly under the ticker\nsymbol (NASDAQ: GAME) (TSX-V: GAME). Engine provides premium social sports\nand esports gaming experiences, as well as unparalleled data analytics,\nmarketing, advertising, and intellectual property to support its owned and\noperated direct-to-consumer properties while also providing these services\nto enable its clients and partners. The company's subsidiaries include\nStream Hatchet, the global leader in gaming video distribution analytics;\nSideqik, a social influencer marketing discovery, analytics, and activation\nplatform; Eden Games, a premium motorsport video game developer and\npublisher across console and mobile gaming; WinView Games, a social\npredictive play-along gaming platform for viewers to play while watching\nlive events; UMG, an end-to-end competitive esports platform powering and\nbroadcasting major esports events, as well as daily community tournaments,\nmatches, and ladders; and Frankly Media, a digital publishing platform used\nto create, distribute and monetize content across all digital channels.\nEngine Media generates revenue through a combination of direct-to-consumer\nand subscription fees, streaming technology and data SaaS-based offerings,\nprogrammatic advertising, and sponsorships.\n\n    Cautionary Statement on Forward-Looking Information\n\n    This news release contains forward-looking statements. Forward-looking\nstatements involve known and unknown risks, uncertainties and other factors\nwhich may cause the actual results, performance or achievements of Engine\nto be materially different from any future results, performance or\nachievements expressed or implied by the forward-looking statements. Often,\nbut not always, forward-looking statements can be identified by the use of\nwords such as \"plans\", \"expects\" or \"does not expect\", \"is expected\",\n\"estimates\", \"intends\", \"anticipates\" or \"does not anticipate\", or\n\"believes\", or variations of such words and phrases or state that certain\nactions, events or results \"may\", \"could\", \"would\", \"might\" or \"will\" be\ntaken, occur or be achieved. In respect of the forward-looking information\ncontained herein, Engine has provided such statements and information in\nreliance on certain assumptions that management believed to be reasonable\nat the time. Forward-looking information involves known and unknown risks,\nuncertainties and other factors which may cause the actual results,\nperformance or achievements stated herein to be materially different from\nany future results, performance or achievements expressed or implied by the\nforward-looking information. Actual results could differ materially from\nthose currently anticipated due to a number of factors and risks.\nAccordingly, readers should not place undue reliance on forward-looking\ninformation contained in this news release.\n\n    The forward-looking statements contained in this news release are made\nas of the date of this release and, accordingly, are subject to change\nafter such date. Engine does not assume any obligation to update or revise\nany forward-looking statements, whether written or oral, that may be made\nfrom time to time by us or on our behalf, except as required by applicable\nlaw.\n\n    Neither the TSX Venture Exchange nor its Regulation Services Provider\n(as that term is defined in policies of the TSX Venture Exchange) accepts\nresponsibility for the adequacy or accuracy of this release.\n\nInvestors\nRyan Lawrence, ICR\nRyan.Lawrence@icrinc.com\n332-242-4321\n\nMedia\nJames Goldfarb, Sloane &amp; Company\njgoldfarb@sloanepr.com\n212-446-1869\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201200991.MNPRE2201203175-13195520220113</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}