{"date": "2021-12-06 19:46:23.689000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>New Delhi [India], December 6 (ANI/NewsVoir): Singapore's fashionable and premium shoe-label Pazzion, which came into e-commerce operations last year with its launch on Amazon, has recently launched its India website in November 2021.</p><p>New Delhi [India], December 6 (ANI/NewsVoir): Singapore's fashionable and premium shoe-label Pazzion, which came into e-commerce operations last year with its launch on Amazon, has recently launched its India website in November 2021.</p></div><div class=\"tr-npp-body\"><p>Known for its chic collection and modish yet comfy shoes for women, Pazzion enables full-fledged e-commerce operations in the country with the website launch.</p><p>Pazzion's website has been designed to offer the consumers a user-friendly experience with the best navigation and functionality while allowing customers to see the full product portfolio seamlessly. Created with the user experience in mind, the site includes features to help the shoppers quickly and easily find the products of their choice. On the occasion of the website launch, the brand is offering a 15% inaugural discount to its customers while shopping through Pazzion's site.</p><p>\"Following the success of our first Pazzion store at DLF Avenue Mall, New Delhi and after witnessing the rise in demand for our comfortable range across the country, we wanted our customers to shop for Pazzion products from the comfort of their homes. Today we are delighted to announce the launch of our new India website and to be able to offer our complete range of products to our customers. With the website launch, we are strengthening our presence in India and happy to be delivering to people across Pan-India through our delivery partner DELHIVERY,\" said Manisha Malik, Master Franchisee &amp; India Head, Pazzion.</p><p>After debuting its flagship store in India at DLF Avenue Mall, Saket in August 2020, the brand had also launched its second store at DLF Promenade, Vasant Kunj in August 2021. Pazzion, the high-end shoe brand, is currently offering 110 styles of shoes on the website and the brand is planning to introduce 50 SKUs in the upcoming days. Pazzion is known for its finest leather shoes, the brand emphasises a lot on quality, comfort mixed with great craftsmanship.</p><p>Website Link: <a href=\"https://pazzion.in/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.pazzion.in</a> </p><p>Pazzion was born in 2002 to cater to the needs of today's modern women, sophisticated trend-setter with an uncompromising standard for taste and quality. Perfect for the modern, contemporary women, Pazzion places the utmost emphasis on high-calibre craftsmanship and an unwavering attention to detail, using only the genuine leather for all of our products to ensure it fits well and remains a trusted wardrobe staple.</p><p>Pazzion's design team continually scours the globe, seeking inspiration from anything and everything - art, architecture, culture and history have all been a springboard for some of our past creations.</p><p>It is very important for the brand to consistently understand and remain at the forefront of trends. The design of each collection is carefully considered and laboriously debated to both reflect and push the boundaries of the style.</p><p>This story is provided by NewsVoir. ANI will not be responsible in any way for the content of this article. (ANI/NewsVoir)</p><p>Copyright © 2021 aninews.in All rights reserved. Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SyndiGate. All Rights Reserved.</p></div>"}