{"date": "2021-11-03 14:10:50.363000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>The Holidays are Here on Amazon Music With Exclusive New Songs and Christmas Covers From Camila Cabello, Dan + Shay, Leon Bridges, Alessia Cara, Summer Walker, and Coeur de pirate</p>\n</div>\n<div class=\"tr-npp-body\">\n<pre>AMAZON INC (\"AMZN-Q\")\n- The Holidays are Here on Amazon Music With Exclusive New Songs\n- and Christmas Covers From Camila Cabello, Dan + Shay, Leon\n- Bridges, Alessia Cara, Summer Walker, and Coeur de pirate\n\n   Amazon Music announced its biggest season of holiday programming yet,\nwith brand-new exclusive Christmas music arriving today from artists across\nthe globe--including Camila Cabello's cover of \"I'll Be Home for\nChristmas.\" Even more Amazon Original songs are available to stream now,\nincluding a fresh original song from Dan + Shay called \"Pick Out a\nChristmas Tree,\" a reimagined version of Marvin Gaye's \"Purple Snowflakes\"\nperformed by Leon Bridges, a new original song, Alessia Cara's modern take\non \"Jingle Bell Rock,\" French-Canadian singer-songwriter Coeur de pirate's\nmelodic new original, \"Parfait Noel,\" and Summer Walker's version of Marvin\nGaye's \"I Want to Come Home for Christmas,\" coming November 12. Also, out\ntoday is Norah Jones' cover of \"The Christmas Waltz,\" \"Carta Navidena,\" by\nSech, a beautiful performance of Dean Martin's \"I've Got My Love To Keep Me\nWarm\" by She &amp; Him, Chris Tomlin's new version of his song, \"Emmanuel God\nWith Us\" featuring Anne Wilson, and an all-new song from NEEDTOBREATHE,\nSwitchfoot, and JUDAH. called \"Hometown Christmas.\"\n\n   To start streaming a selection of these new holiday classics, click here\nWatch behind-the-scenes interviews with Dan + Shay, Leon Bridges,\nNEEDTOBREATHE, Switchfoot and JUDAH.  here, here and here\n\n   \"I've been traveling a lot since I was 15 and started working so I chose\nto record this song as an Amazon Original because I've always looked\nforward to being home in Miami with my family for Christmas,\" said Camila\nCabello. \"I wanted to continue the world of my album 'Familia' by having it\nbe a Mariachi rendition because I'm half Mexican and I grew up listening to\nMariachi music. I'm excited to be on people's Christmas playlists because\nit's such a magical time of the year and getting to be part of the\nsoundtrack during such an intimate family and friend holiday season is a\nreal honor. It's truly special and really sacred.\"\n\n   \"This is one of our favourite times of the year, where we're able to\nbring our customers around the world a collection of brand-new music and\nprogramming to celebrate the holiday season,\" said Ryan Redington, VP of\nmusic industry, Amazon Music. \"It's always thrilling to see a spike in the\ncharts for Christmas classics, and our Amazon Original songs for the\nholidays--from incredible artists like Camila Cabello, Summer Walker, and\nGeorge Ezra--introduce a contemporary take on the familiar favourites that\nour customers love to stream. In fact, in the last three years, the top 25\nmost popular holiday Amazon Original songs, from artists such as Katy\nPerry, John Legend, and Justin Bieber, have surpassed 750 million streams\nglobally.\"\n\n   Amazon Music is celebrating the holidays across the globe, with new\nmusic arriving from international talent to light up the season. From the\nUK, singer/songwriter George Ezra will debut \"Come on Home for Christmas,\"\nhis beautifully reworked take on Charles Brown's \"Please Come Home for\nChristmas.\" British Amazon Music Breakthrough artist Olivia Dean, Chinese\npianist Lang Lang, and German pop-singer and songwriter Sarah Connor have\neach recorded their own reimagined versions of Nat King Cole's timeless\nclassic, \"The Christmas Song.\" In addition, Latin pop-rock trio Reik will\ndebut their rendition of \"Last Christmas,\" and Marcos Witt will premiere a\nSpanglish version of \"Noche de Paz (Silent Night) / Santa la Noche (O Holy\nNight)\" with his daughter, Elena Witt-Guerra. From Mexico, singers Maria\nLeon, Paty Cantu, and Maria Jose team up for a rendition of Mariah Carey's\n\"All I Want for Christmas Is You\" out on November 19. Spanish pop band La\nOreja de Van Gogh will also delight customers with their version of \"Blanca\nNavidad.\"\n\n   \"Doing jingle bell rock was super exciting since it's such a classic\nChristmas tune,\" said Alessia Cara. \"Given the fact that there are so many\ngreat versions of it, me and Jon wanted to make sure ours was fresh and fun\nbut still true to the original. We added some very '50s-style harmonies to\nmake it feel all the more classic and nostalgic. I love the way it turned\nout.\"\n\n   \"When I first heard I was going to do an Amazon Original, I immediately\nthought of the Marvin Gaye version of 'Purple Snowflakes,'\" said Leon\nBridges. \"It's one of my favourite Christmas songs and I love the classic\nstuff... but this one has a little bit more soul to it. There aren't too\nmany renditions of this song and I wanted to kind of put my own spin on it\nas far as figuring out the arrangement and give it the Fort Worth, Texas\napproach.\"\n\n   \"Writing original Christmas songs is difficult, because there's already\nso many good songs that exist and ... you feel like everything's already\nbeen said,\" shared Dan + Shay. \"One day we sat down to write our song and\nit sort of poured out of us--it was just the soundtrack for folks going\nout, families, friends going to a Christmas tree farm, or going to a store\ndown the street and picking out a Christmas tree. We're so excited about it\nand hopefully it brings a little joy this holiday season.\"\n\n   \"Above all, it is important to give thanks! Music has given me\neverything, and I am grateful and humbled to use it to give back to my\nfans,\" said Sech. \"'Carta Navidena' is an original song inspired by the\nholiday spirit felt around the world. You can recognize the sounds often\nheard in the classics, but with my unique style and emotions. The lyrics\nexpress my fondest holiday memories and traditions. I hope it becomes a\npopular classic, too, resonating with fans and reminding them to create\nmany happy memories and give thanks always.\"\n\n   In addition to new holiday songs, Amazon Music listeners can explore\nhundreds of festive playlists and stations across artists and decades,\nincluding \"REDISCOVER Mariah Carey Christmas,\" \"Christmas Past,\" and\n\"Christmas Present,\" and a host of new programmed destinations. \"Merry Mix\"\nis a global playlist on Amazon Music featuring iconic holiday classics\nmixed with tomorrow's holiday hits.\n\n   Amazon Music is also home to millions of podcast episodes and shows for\nthe entire family to enjoy together, including Little Stories Everywhere,\nand Wow in the World available on Wondery. This holiday, Amazon Original\npodcasts Uncommon Ground with Van Jones, Country Heat Weekly, and That\nScene with Dan Patrick will feature special holiday episodes to celebrate\nthe season.\n\n   Prime members who haven't yet tried Amazon Music Unlimited can sign up\nto get four months free for a limited time - with unlimited access to\nmillions of songs in the highest quality streaming audio, ad-free, and\nmillions of podcast episodes. Non-Prime customers can get three months\nfree. Terms apply.\n\n   About Amazon MusicAmazon Music reimagines music listening by enabling\ncustomers to unlock millions of songs and thousands of curated playlists\nand stations with their voice. Amazon Music provides unlimited access to\nnew releases and classic hits across iOS and Android mobile devices, PC,\nMac, Echo, and Alexa-enabled devices including Fire TV and more. With\nAmazon Music, Prime members have access to ad-free listening of 2 million\nsongs at no additional cost to their membership. Listeners can also enjoy\nthe premium subscription service, Amazon Music Unlimited, which provides\naccess to millions of songs and the latest new releases. Amazon Music\nUnlimited customers also now have access to the highest-quality listening\nexperience available, with millions of songs available in High Definition\n(HD), more than 7 million songs in Ultra HD, and a growing catalog of\nspatial audio. Customers also have free access to an ad-supported selection\nof top playlists and stations on Amazon Music. All Amazon Music tiers now\noffer a wide selection of podcasts at no additional cost, and live\nstreaming in partnership with Twitch. Engaging with music and culture has\nnever been more natural, simple, and fun. For more information, visit\namazonmusic.com or download the Amazon Music app.\n\n   About AmazonAmazon is guided by four principles: customer obsession\nrather than competitor focus, passion for invention, commitment to\noperational excellence, and long-term thinking. Amazon strives to be\nEarth's Most Customer-Centric Company, Earth's Best Employer, and Earth's\nSafest Place to Work. Customer reviews, 1-Click shopping, personalized\nrecommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct\nPublishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo,\nAlexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are\nsome of the things pioneered by Amazon. For more information, visit\namazon.com/about and follow @AmazonNews.\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2130600262.MNPRE2130601781-06431020211103</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}