{"date": "2021-11-16 21:49:17.715000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon will step up efforts to inform warehouse workers in California about safety protocols and coronavirus outbreaks under a deal reached with the state's attorney general.</p><p>The accord announced Monday requires Amazon to notify workers within one day and local health agencies with 48 hours about new coronavirus cases in the workplace and pay $500,000 toward consumer protection enforcement in California, according to a statement from the office of Attorney General Rob Bonta.</p></div><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">LABOR</p><p class=\"tr-npp-section-title\">Amazon settles California covid case</p><p>(Amazon founder Jeff Bezos also owns The Washington Post.)</p><p>Following an investigation into the retail giant's pandemic safety policies that began last year under Bonta's predecessor, the attorney general's office filed a complaint against Amazon on Monday in state court in Sacramento alongside a request for a judge's approval of the settlement.</p><p>\"As the company enjoyed booming and historic sales with this stock price doubling, Amazon failed to adequately notify warehouse workers and local health agencies of covid -19 case numbers, often leaving them effectively unable to track the spread of the virus,\" Bonta said at a news conference.</p><p>The goal is to bring Amazon's coronavirus workplace safety policies in line with a new state law, which took effect on Jan. 1, requiring employers to tell workers about potential coronavirus workplace exposures and report outbreaks.</p><p>A spokesperson for Amazon didn't immediately respond for a request for comment.</p><p>Amazon this month dropped its requirement that vaccinated warehouse workers wear masks, unless required to do so by local rules. The company hasn't instituted a vaccine requirement.</p><p>- Bloomberg News</p><p class=\"tr-npp-section-title\">CONSUMER PROTECTION</p><p class=\"tr-npp-section-title\">Pawnshops face suit over rates for military</p><p>A consumer watchdog agency has sued Texas pawnshop operator FirstCash, alleging the company and a subsidiary gouged military families by charging annual interest rates as high as 200 percent on pawn loans.</p><p>FirstCash operates over 2,800 pawnshops in the United States and Latin America. Just last month, it struck a $1.17 billion deal to move into the \"buy now, pay later\" space with its acquisition of Dallas-based American First Finance.</p><p>The Consumer Financial Protection Bureau filed the lawsuit in federal court in Fort Worth on Friday, citing violations of the Military Lending Act, which limits the annual rate military families can be charged to 36 percent. The suit also named Cash America West, a related business unit that operates pawnstores in Arizona, Nevada, Utah and Washington.</p><p>The government agency alleged that FirstCash violated a 2013 order against its predecessor company that prohibited future military lending violations. It's seeking an injunction and a civil penalty.</p><p>In a statement, FirstCash said it considers the allegations to be \"without merit.\"</p><p>\"FirstCash deeply respects members of our military and their families,\" the company statement said. \"We will seek to engage with the CFPB and respond to the allegations appropriately.\"</p><p>According to the lawsuit, FirstCash and Cash America West made more than 3,600 pawn loans between June 2017 and May 2021 that violated the military lending law. Those loans occurred at the companies' Arizona, Nevada, Utah and Washington stores.</p><p>Those stores make up only about 10 percent of FirstCash's nationwide pawn-loan operations. The lawsuit said CFPB also believes FirstCash stores in other states made loans with excessive interest rates.</p><p>- Dallas Morning News</p><p class=\"tr-npp-section-title\">Also in Business</p><p><span><span>Members of a union</span> that represents about 60,000 behind-the-scenes workers in U.S. film and television have narrowly approved a new contract with producers, the International Alliance of Theatrical Stage Employees (IATSE) said Monday. The voting was close, with 50.3 percent of members voting yes and 49.7 percent voting against, IATSE said.</span></p><p><span>7-Eleven</span> , the convenience store chain, has been sued by a U.S. consumer who says its Wasabi Delight Flavored Snack Mix contains no wasabi. The lawsuit, filed on Sunday night in Manhattan federal court by Oscar Ithier, joins hundreds of proposed $5 million-or-larger class actions accusing food companies of overcharging consumers through false and misleading packaging.</p><p>- From news services</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 The Washington Post</p></div>"}