{"date": "2021-12-21 14:11:01.928000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>KALTURA INC (\"KLTR-Q\")\n- Astro Selects Kaltura to Power its Standalone Streaming Service\n- Offering\n\n     Highlights:\n     *  Malaysia's leading content and entertainment company Astro chose\nKaltura TV Platform to power sooka, its standalone streaming service\noffering targeted at the digital and mobile-first millennials\n     *  sooka went live in June 2021 across Malaysia on web, iOS, and\nAndroid mobile devices\n     *  sooka ranked the number one entertainment app on Google Play within\ntwo weeks of launch\n     *  sooka features a hybrid Ad-based (AVOD) and Subscription-based\n(SVOD) business model to encourage increased customer acquisition and\nconvergence\n     *  Astro is leveraging the benefits of delivering TV from the cloud,\nwith a feature rich, flexible, scalable, and resilient platform thanks to\nKaltura Cloud TV technology, along with hosting on AWS\n\n     Kaltura, the video experience cloud, announced that Astro, Malaysia's\nleading content and entertainment company, chose the Kaltura TV Platform to\npower sooka, its new streaming service targeted at millennials. Leveraging\nthe multiple benefits of Kaltura Cloud TV, sooka went live in June across\nMalaysia and is hosted on Amazon Web Services (AWS).\n\n     Astro selected the Kaltura TV Platform for sooka following a\ncompetitive Request for Proposals (RFP). Kaltura technology enables Astro\nto deliver linear channels, live events and on-demand viewing experiences\non web and iOS and Android mobile devices.\n\n     Astro chose Kaltura as its technology partner due to its multiple\nworldwide reference cloud TV deployments. Additionally, a major influencing\nfactor was the inherent flexibility of the Kaltura TV Platform. This\nallowed Astro to incorporate multiple business models and payment methods\nsuch as Google In-App Billing, and Apple In-App Purchase, with Direct\nCarrier Billing soon to follow.\n\n     Kaltura furthermore demonstrated the power of its productized approach\nto deploying cloud TV projects. It delivered the solution for sooka in\nunder six months, enabling the service to be live in time to stream UEFA\nEURO 2020. This resulted in a high-impact debut for sooka, which ranked the\nnumber one entertainment app on Google Play within two weeks of launch.\n\n     sooka offers its viewers a freemium package with a selection of\nad-based content that can be expanded into broader content bundles based on\nmultiple subscription plans. It delivers live sports events like the\nPremier League, Euro 2020,?Olympics 2020, BWF badminton, NBA, and Formula 1\nas well as over 4000 hours of Malaysia's favorite Malay and Asian dramas,\nmovies, and variety shows, with an upcoming pipeline of sooka originals and\nexclusives.\n\n     \"We created sooka as a standalone streaming service offering to\ncapture the digital and mobile-first millennials with a unique value\nproposition in the face of an increasingly crowded OTT space. The\nflexibility of Kaltura's TV Platform allows us to quickly adapt to viewer\npreferences and engagement models and it supports our business model.\nKaltura was able to smoothly integrate the solution into our existing\necosystem, and very rapidly meet our tight timeline,\" said Euan Smith,\nChief Executive Officer of Pay-TV and Group COO at Astro.\n\n     \"We are very excited to support Astro,\" said Sameer Vuyyuru, Director,\nHead of Worldwide Telecommunications Business Development at AWS. \"Being\nchosen to enable Kaltura to deliver sooka to customers is another strong\nendorsement of the cloud TV capabilities made possible through the work of\nKaltura and AWS.\"\n\n     \"Pay-TV providers everywhere are recognizing the advantages of cloud\nTV as the optimal engine for offering Over-The-Top (OTT) services as part\nof a super-aggregation strategy, and the best way to reach audiences\nwherever they are,\" said Nuno Sanches, General Manager, Media and Telecom\nat Kaltura. \"We are proud to be entrusted by Astro for the launch of sooka,\nand we look forward to continuing to support Astro as it engages more and\nmore subscribers with this exciting new cloud TV service.\"\n\n     About Astro\nAstro is Malaysia's leading content and entertainment company, serving 5.7\nmillion homes or 73% of Malaysian TV households, 6,400 enterprises, 16.8\nmillion weekly radio listeners (FM and digital), 14.3 million digital\nmonthly unique visitors and 3.0 million shoppers across its TV, radio,\ndigital and commerce platforms. www.astro.com.my\n\n     About Kaltura\nKaltura's mission is to power any video experience for any organization.\nOur Video Experience Cloud offers live, real-time, and on-demand video\nproducts for enterprises of all industries, as well as specialized industry\nsolutions, currently for educational institutions and for media and telecom\ncompanies. Underlying our products and solutions is a broad set of Media\nServices that are also used by other cloud platforms and companies to power\nvideo experiences and workflows for their own products. Kaltura's Video\nExperience Cloud is used by leading brands reaching millions of users, at\nhome, at school and at work, for communication, collaboration, training,\nmarketing, sales, customer care, teaching, learning, and entertainment\nexperiences. www.kaltura.com.\n\nFor media information, please\n\ncontact:\nCynthia Ritchie\n+44 20 3514 2525\ncynthia@whitetigercommunications.net\n\nTel   : 646-290-5445    KALTURA INC\nWWW   : <a href=\"https://www.kaltura.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.kaltura.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2135400126.MNPRE2135400861-06025620211221</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}