{"date": "2022-01-23 07:46:57+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2852.86, "close": 2799.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\"><li class=\"tr-summaryitem\">Ten-minute delivery times wow online shoppers</li><li class=\"tr-summaryitem\">Growth of quick commerce pressures rivals</li><li class=\"tr-summaryitem\">Road safety concerns rise in race for faster deliveries</li><li class=\"tr-summaryitem\">Experts say businesses could struggle for profits </li></ul><p class=\"tr-by\">By Aditya Kalra and Abhirup Roy</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW DELHI, Jan 23 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Indian grocery startups are luring tech-savvy customers with the promise of deliveries within 10 minutes, sparking a boom in \"quick commerce\", but heating up concerns about road safety as bike riders scramble to meet tight deadlines.</p><p>Competition is already intense in India's $600-billion grocery retailing industry, populated by the likes of Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, Walmart's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=WMT.N\" data-type=\"ric\" data-ric=\"WMT.N\" translate=\"no\" dir=\"ltr\">WMT.N</a> Flipkart and Indian billionaire Mukesh Ambani's Reliance.</p><p>Now SoftBank-backed Blinkit and its rival Zepto are racing to hire staff and open stores in their bid to grab a share of the market by offering the convenience of delivery in 10 minutes, far lower than the hours, or days competitors take.      </p><p>Their mission: pack groceries within a few minutes at so-called dark stores, or small warehouses in densely populated neighbourhood buildings, and send bike riders to nearby locations with about seven minutes to spare.</p><p>\"It's a threat to the larger players,\" Ashwin Mehta, a lead IT sector analyst at India's Ambit Capital, told Reuters. \"If people get used to 10 minutes, those companies offering 24-hour deliveries will be forced to reduce their timelines.\" </p><p>As activity grows, research firm RedSeer says India's quick commerce sector, worth $300 million last year, will swell 10-15 times to touch $5 billion by 2025. </p><p>Blinkit and Zepto, started by two 19-year-old dropouts from Stanford, have caught consumers' fancy, satisfying cravings for food and impulse shopping, as well as urgent needs for daily supplies.</p><p>\"This is very convenient, it has made a lifestyle change,\" said Sharmistha Lahiri, who now turns to Blinkit to fill the gap when ingredients suddenly run out in her kitchen, from tomatoes for soup to chocolate icing for a cake. </p><p>The 75-year-old, who lives in the city of Gurugram near the capital, New Delhi, was a keen user of Amazon and Indian conglomerate Tata's online grocer BigBasket, but prizes Blinkit's rapid response in such situations.</p><p>The unbeatable convenience of rapid deliveries is evident in Europe and the United States, where companies such as Turkey's Getir and Germany's Gorillas are expanding fast, but India's accident-prone roads make quick commerce a dangerous business.</p><p>\"Ten minutes is very sharp,\" said a former road secretary, Vijay Chhibber. \"If there was a (road safety) regulator, it would have said this can't be a company's unique selling point.\" </p><p>Blinkit and Zepto did not respond to queries from Reuters.</p><p><br/></p><p>RISKY ROADS, DRIVERS' WOES</p><p>Even in cities, most roads are riddled with potholes, while cattle or other animals straying into traffic present a frequent challenge for motorists, who often violate basic rules. </p><p>Last year, the World Bank said India had a death every four minutes on its roads. Crashes kill about 150,000 people each year.</p><p>All the 13 drivers for Blinkit and Zepto whom Reuters interviewed in the key cities of Mumbai, New Delhi and Gurugram said they faced pressure to meet delivery deadlines, which often led to speeding, for fear of being rebuked by store managers.</p><p>\"We get five to six minutes and I feel tense and fear for my life,\" said one Blinkit driver, who sought anonymity.</p><p>In August, Blinkit's chief executive said on Twitter that riders were not penalised and could deliver \"at their own pace and rhythm,\" as dark stores are always near destination sites. </p><p>Delivery riders disagreed. In their rush, many of them told Reuters, they mark orders as having been delivered even before they get to the destination.</p><p>And if a customer complained about the practice, they faced a penalty of 300 Indian rupees ($4.03). A Blinkit app screenshot provided by one driver showed the term, MDND, or \"Marked Delivered, Not Delivered\" used to designate such items.    </p><p>Frustration was also on display in the conversation on a WhatsApp group of Blinkit riders in Mumbai reviewed by Reuters.</p><p>\"Ban this 10-minute (delivery),\" said one user, after pictures were posted of a rider said to have been injured in a deadline rush.  </p><p>The concerns reflect the dark side of India's booming gig economy, in which workers often say they feel shortchanged or battle tough working conditions.</p><p><br/></p><p>BULLISH</p><p>Blinkit calls its service \"indistinguishable from magic\" and says it wants to become a $100-billion business.</p><p>Zepto has been valued at $570 million and has set its eyes on becoming a $20-billion company, already backed by investors such as U.S.-based Glade Brook Capital.</p><p>The instant delivery market is a $50-billion opportunity, India's largest offline retailer, Reliance, said this month, when it invested in Dunzo, another Indian startup that runs a 19-minute delivery service. </p><p>But, unlike most foreign companies that charge $2 to $3 a delivery, deliveries by Indian startups are mostly free in a nation with a population of 1.4 billion potential customers.</p><p>\"With free delivery, the business is unlikely to be viable,\" said T.N. Hari, who heads human resources at online grocery BigBasket, which delivers most orders within five hours.</p><p>\"And with a delivery fee that makes it viable, the market size is likely to be small.\"</p><p>For now, Indians are hooked.</p><p>Deliveries on New Year's Eve included more than 43,000 cans of fizzy drinks, a Blinkit investor said on Twitter, adding, \"33,440 condoms were ordered on @letsblinkit today. Someone ordered 80 condoms in one go.\" </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Aditya Kalra in New Delhi and Abhirup Roy in Mumbai; Additional reporting by Aditi Shah, Chandini Monnappa and Chris Thomas; Editing by Clarence Fernandez)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:aditya.kalra@tr.com\" data-type=\"email\" translate=\"no\">aditya.kalra@tr.com</a> ; +91-11-49548021; Twitter <a href=\"https://twitter.com/adityakalra\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/adityakalra</a>; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: INDIA-RETAIL/QUICK-COMMERCE (PIX)</p></div>"}