{"date": "2022-01-05 13:00:21.943000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">Innovative 'Callisto' payload featuring Alexa and Webex to fly onboard Lockheed Martin-built Orion spacecraft for NASA's Artemis I Mission</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">DENVER, Jan. 5, 2022</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">DENVER</span>, <span class=\"xn-chron\">Jan. 5, 2022</span> /PRNewswire/ -- Lockheed Martin (NYSE: LMT), Amazon (NASDAQ: AMZN) and Cisco (NASDAQ: CSCO) have teamed up to integrate unique human-machine interface technologies into NASA's <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3403950-1&amp;h=1440168979&amp;u=https%3A%2F%2Fwww.lockheedmartin.com%2Fen-us%2Fproducts%2Forion.html&amp;a=Orion\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Orion</a> spacecraft, providing an opportunity to learn how future astronauts could benefit from far-field voice technology, AI and tablet-based video collaboration.</p>\n\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/1720040/Lockheed_Martin_Callisto_hero_illustration.html\">\n                    <div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Callisto is an innovative technology demonstration that will fly onboard NASA’s Orion spacecraft during the Artemis I mission to the Moon.\" src=\"https://mma.prnewswire.com/media/1720040/Lockheed_Martin_Callisto_hero_illustration.jpg\" title=\"Callisto is an innovative technology demonstration that will fly onboard NASA’s Orion spacecraft during the Artemis I mission to the Moon.\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMTcyMDA0MC9Mb2NraGVlZF9NYXJ0aW5fQ2FsbGlzdG9faGVyb19pbGx1c3RyYXRpb24uanBn&amp;key=5e51cb4ab3199121fb9d8b93ec41d5e9b6fe0c15cb3bdc6c7466e6162912dbe4814cb1739053aadead91137d49b46c10f06ade9562bb1e933374e376e0d0a8bb\"/></div></div>\n                        </a>\n                </p>\n\n    </div>\n<p>The Callisto technology demonstration will be integrated into NASA's Orion spacecraft for the agency's <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3403950-1&amp;h=4053637058&amp;u=https%3A%2F%2Fwww.nasa.gov%2Fspecials%2Fartemis%2F&amp;a=Artemis\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Artemis</a> I uncrewed mission around the Moon and back to Earth. Callisto uses Amazon Alexa and Webex by Cisco to test and demonstrate commercial technology for deep space voice, video and whiteboarding communications. Lockheed Martin, which designed and built the Orion spacecraft for NASA, is leading the development and integration of the payload. </p>\n<p>\"Callisto will demonstrate a first-of-its-kind technology that could be used in the future to enable astronauts to be more self-reliant as they explore deep space,\" said <span class=\"xn-person\">Lisa Callahan</span>, vice president and general manager of Commercial Civil Space for Lockheed Martin. \"Callisto is a shining example of how new partnerships with commercial technologies can be flown on Orion to benefit future human deep space missions.\"</p>\n<p>Callisto is named after a favorite companion of the Greek goddess Artemis. The payload features a custom hardware and software integration developed by engineers from Lockheed Martin, Amazon and Cisco, and includes innovative technology that allows Alexa to work without an internet connection, and Webex to run on a tablet using NASA's Deep Space Network.</p>\n<p>\"The Star Trek computer was part of our original inspiration for Alexa, so it's exciting and humbling to see our vision for ambient intelligence come to life on board Orion,\" said <span class=\"xn-person\">Aaron Rubenson</span>, vice president of Amazon Alexa. \"We're proud to be working with Lockheed Martin to push the limits of voice technology and AI, and we hope Alexa's role in the mission helps inspire future scientists, astronauts and engineers who will define this next era of space exploration.\"</p>\n<p>Since Artemis I is an uncrewed mission, Callisto partners have worked with NASA to build a virtual crew experience at NASA's Johnson Space Center in <span class=\"xn-location\">Houston</span>, allowing operators to interact with Callisto from the Mission Control Center. These remote interactions will test and demonstrate how voice and video collaboration technologies can help astronauts improve efficiency and situational awareness during their mission, providing access to flight status and telemetry, and the ability to control connected devices onboard Orion. Video and audio of the interactions will be transmitted back to Earth many times throughout the Artemis I mission, allowing engineers to analyze the performance of the onboard systems while also sharing interactions with the public.</p>\n<p>\"The future of technology is about igniting human potential whenever and wherever that may be – which will soon extend to the depths of space,\" said <span class=\"xn-person\">Jeetu Patel</span>, executive vice president and general manager of Security and Collaboration at Cisco. \"Through Callisto, Webex is enabling boundless video communications and collaboration in deep space while helping to provide the next generation with inclusive and immersive technology. This first-of-its-kind solution could one day support future crewed missions, providing face-to-face interaction between crew, command center and loved ones.\"</p>\n<p>The Callisto technology demonstration will also allow students, families, space enthusiasts and the general public to engage with and virtually \"ride along\" with the Artemis I mission. They can follow the mission on Alexa-enabled devices by saying \"Alexa, take me to the Moon,\" and the Webex video collaboration capabilities will offer opportunities for STEM education and remote classroom teaching events.</p>\n<p>Artemis I is currently scheduled to launch in early 2022 from NASA's <span class=\"xn-location\">Kennedy Space Center</span> in <span class=\"xn-location\">Cape Canaveral, Florida</span>, for a multi-week journey around the Moon and back. Artemis I will provide the foundation for future crewed missions to the Moon and deep space and is part of NASA's goal to land the first woman and first person of color on the lunar surface.</p>\n<ul type=\"disc\" class=\"bulleted-list arrowlist\"><li>For more information on the Callisto technology demonstration payload visit <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3403950-1&amp;h=4288257962&amp;u=http%3A%2F%2Fwww.lockheedmartin.com%2Fcallisto&amp;a=http%3A%2F%2Fwww.lockheedmartin.com%2Fcallisto\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.lockheedmartin.com/callisto</a>. </li><li>To learn more about the Alexa technology onboard and other Amazon initiatives tied to Artemis I, visit the <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3403950-1&amp;h=874681689&amp;u=https%3A%2F%2Fwww.aboutamazon.com%2Fnews%2Fdevices%2Falexa-take-me-to-the-moon&amp;a=About+Amazon+blog\" data-type=\"url\" class=\"tr-link\" translate=\"no\">About Amazon blog</a>. </li><li>To learn more about Webex by Cisco solutions and Artemis I technology integrations, visit the <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3403950-1&amp;h=3622589564&amp;u=https%3A%2F%2Fblog.webex.com%2Fhybrid-work%2Fleaving-earth-without-leaving-home-behind&amp;a=Webex+Blog\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Webex Blog</a>.</li></ul><p><b>About Lockheed Martin<br/></b>Headquartered in <span class=\"xn-location\">Bethesda, Maryland</span>, Lockheed Martin Corporation is a global security and aerospace company that employs approximately 114,000 people worldwide and is principally engaged in the research, design, development, manufacture, integration and sustainment of advanced technology systems, products and services. Please follow <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3403950-1&amp;h=940427050&amp;u=https%3A%2F%2Ftwitter.com%2Flmnews&amp;a=%40LMNews\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@LMNews</a></u> on Twitter for the latest announcements and news across the corporation.</p>\n<p><b>About Amazon <br/></b>Amazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth's Most Customer-Centric Company, Earth's Best Employer, and Earth's Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3403950-1&amp;h=57811518&amp;u=https%3A%2F%2Fwww.aboutamazon.com%2F&amp;a=amazon.com%2Fabout\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.</p>\n<p><b>About Cisco <br/></b>Cisco (NASDAQ: CSCO) is the worldwide leader in technology that powers the Internet. Cisco inspires new possibilities by reimagining your applications, securing your data, transforming your infrastructure, and empowering your teams for a global and inclusive future. Discover more on <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3403950-1&amp;h=1526969605&amp;u=https%3A%2F%2Fnewsroom.cisco.com%2F&amp;a=The+Network\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Network</a> and follow us on Twitter at <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3403950-1&amp;h=4115401689&amp;u=https%3A%2F%2Ftwitter.com%2FCisco&amp;a=%40Cisco\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@Cisco</a>. </p>\n<p><b>About Webex by Cisco</b> <br/>Webex is a leading provider of cloud-based collaboration solutions which includes video meetings, calling, messaging, events, customer experience solutions like contact center and purpose-built collaboration devices. Webex's focus on delivering inclusive collaboration experiences fuels our innovation, which leverages AI and Machine Learning, to remove the barriers of geography, language, personality and familiarity with technology. Its solutions are underpinned with security and privacy by design. Webex works with the world's leading business and productivity apps – delivered through a single application and interface. Learn more at <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3403950-1&amp;h=212710061&amp;u=https%3A%2F%2Fwebex.com%2F&amp;a=webex.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">webex.com</a>. </p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n</div>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=SF21896&amp;sd=2022-01-05\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1TRjIxODk2JnNkPTIwMjItMDEtMDU=&amp;key=83f32584ed67ec2570c84a7876f30c564a727e569d12b02aacdce1bf596c61bae51e8225964081aba4ad4541ac008f6b3adf50bb92336abe7ddc7a8adfb51581\"/></div></div> View original content to download multimedia:<a href=\"https://www.prnewswire.com/news-releases/lockheed-martin-amazon-and-cisco-to-bring-voice-technology-and-video-collaboration-to-the-moon-301454380.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/lockheed-martin-amazon-and-cisco-to-bring-voice-technology-and-video-collaboration-to-the-moon-301454380.html</a><p></p>\n<p>SOURCE  Lockheed Martin</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: CO-LockheedMartin</p></div>"}