{"date": "2021-12-03 19:31:26.397000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3437.36, "close": 3427.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>XM Cyber has launched integration with the latest version of Amazon Inspector, an automated and continuous software vulnerability assessment service that helps customers improve their application security and compliance on Amazon Web Services.</p><p>XM Cyber integrated with the new Amazon Inspector to provide customers with an ability to map possible attack paths that could be used to compromise critical assets by lateral movement across on-premises, cloud, and hybrid networks. The combination proactively and continuously identifies cyber exposures as new services are deployed, illuminating potential weaknesses that represent attack paths that could be used to compromise critical assets that originate from threats in or outside of the cloud.Hybrid cloud computing architecture can present a number of cybersecurity challenges. Attackers can exploit security gaps such as misconfigurations, overly permissive identities, vulnerabilities, and human errors to obtain an initial foothold in the network and move laterally between on-premises and cloud applications.Through an attack-centric approach, XM Cyber helps customers pinpoint areas of potential risk, combining critical software vulnerabilities identified by Amazon Inspector with potential attack paths that highlight exposed resources to exploitable security risk. The attack path context provided by XM Cyber helps customers understand what changes are needed to quickly eliminate the risk of resource compromise and lateral movement to other assets. XM Cyber and Amazon Inspector both support AWS Security Hub, which helps customers aggregate security alerts, identify misconfigured resources, and operationalize remediation actions. \"The combination of Amazon Inspector and XM Cyber is a powerful security solution for our customers,\" said Michael Fuller, Director, Product Management, AWS Security Services at AWS. \"With the new Amazon Inspector, we've dramatically simplified continuous and automated vulnerability assessment for customers across their entire organization, whether they have one AWS account or five thousand. Layering on XM Cyber, attack path visibility provides actionable detail to help customers prioritize their remediation efforts and quickly respond to protect critical resources.\"      \"This relationship signals a new breed of security posture management, leveraging the benefits of attack path modeling along with Amazon Inspector continuous vulnerability assessments,\" said Boaz Gorodissky, Chief Technology Officer at XM Cyber. \"We are excited to work with AWS to deliver proactive cloud security and make accelerated digital transformation a reality. This integration is a first step of many to reinforce the great built-in security services of AWS and bring better cloud security solutions to wider audiences.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}