{"date": "2022-01-24 19:36:15.763000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Despite the heavy burden of interchange fees, Amazon is unable to break off from Visa, with its ban reversal highlighting the control such dominant card schemes have in the market.</p><p>Two days before 19 January, the proposed termination date of Amazon's acceptance of Visa cards in the UK, Amazon announced its intention to find a mutually beneficial resolution with Visa instead. In truth, Amazon may have realised that replacing Visa credit cards would be much harder than initially thought, as consumers relying on them in the UK are not all willing to change credit card providers, according to The Independent. Indeed, Amazon was reportedly facing a £1.4bn loss had its ban been carried out.The ban, initially announced in November 2021, was driven by Visa's decision to increase interchange fees for online transactions between the UK and the EU. Both Visa and Mastercard were able to do this as the Interchange Fees Regulation does not apply to these transactions following Brexit. Mastercard, being the credit card scheme used to issue Amazon credit cards, was not affected by the ban.The lack of a statement from either party, aside from an email to Amazon customers, lends some confusion to the driving factors behind the last-minute reversal, but Amazon now appears to be negotiating a better deal on interchange fees with Visa. Making the ban public back in November was likely a strategy used by Amazon to pressurise Visa into agreeing a new deal. Visa can still negotiate such a deal and also retain its position on the ecommerce platform, but it is unlikely that it would agree to lower fees solely for Amazon, as it would be forced to reduce them for all other merchants as well.Interchange fees are an ongoing issue that needs to be addressed, not only with Visa but all credit card schemes. The initial ban by Amazon was an attempted show of strength, a warning that if it could stop Visa acceptance then it would do so, but its U-turn two months on only further highlights how dominant both Visa and Mastercard are. According to GlobalData's Payment Cards Analytics, they represented 98% of credit cards issued in the UK in 2020, with Visa making up 34%. The hike in interchange fees has attracted the attention of the Payment System Regulator (PSR), the regulatory body of payment systems in the UK. According to the PSR, there is no justification for the increase in fees, and it is committed to introducing regulations that would protect both consumers and merchants from unexpected price hikes.Following the Visa ban reversal, an American coalition of US merchants called the Merchants Payments Coalition wrote a letter to the Department of Justice and the Federal Trade Commission urging them to further regulate interchange fees. In the US, interchange fees are considerably higher than in the UK: according to GlobalData's Card Profitability Analytics, Visa charged US merchants an interchange fee of 1.79% in 2020. And with Visa holding 51% of the US credit card market share as per Payment Cards Analytics, a greater number of US merchants are feeling the burden of interchange fees. If new regulations are introduced, they will force credit card schemes to reduce the fees to a more suitable level for merchants.Increasing interchange fees are an ongoing issue that will likely continue affecting merchants until they can find a more suitable alternative. Credit card schemes may have to reconsider their revenue model concerning interchange fees, otherwise they risk being challenged by disruptive technology that can better serve merchants.This was written by Chris Dinga GlobalData payments analyst</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}