{"date": "2022-01-10 14:37:06.259000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>TOUGHBUILT INDUSTRIES INC (\"TBLT-Q\")\n- $11.9 Million in Full Year 2021 Sales Through Amazon\n\n     ToughBuilt Industries, Inc. (\"ToughBuilt\") announced that gross sales\nthrough Amazon.com increased by 68.5% to approximately $11.9 million for\nthe fiscal year ended December 31, 2021, compared to approximately $7.1\nmillion for 2020.\n\n     Michael Panosian, Chief Executive Officer of ToughBuilt, commented,\n\"We closed 2021 with significant e-commerce demand driven by our sawhorses,\nknee pads, and bags. Amazon continues to positively contribute to\nToughBuilt's overall revenue growth and strengthen our brand among global\nend users. Currently, only our legacy products are available on Amazon,\nwhich have generated outstanding reviews to-date. We believe that as more\nnew products become available on Amazon, we will see increased online\ndemand.\"\n\n     ABOUT TOUGHBUILT INDUSTRIES, INC.\nToughBuilt is an advanced product design, manufacturer and distributor with\nemphasis on innovative products. Currently, we are focused on tools and\nother accessories for the professional and do-it-yourself construction\nindustries. We market and distribute various home improvement and\nconstruction product lines for both the do-it-yourself and professional\nmarkets under the TOUGHBUILT brand name, within the global multibillion\ndollar per year tool market industry. All of our products are designed by\nour in-house design team. Since launching product sales in 2013, we have\nexperienced significant annual sales growth. Our current product line\nincludes three major categories, with several additional categories in\nvarious stages of development, consisting of Soft Goods &amp; Kneepads and\nSawhorses &amp; Work Products. Our mission is to provide products to the\nbuilding and home improvement communities that are innovative, of superior\nquality derived in part from enlightened creativity for our end users while\nenhancing performance, improving well-being and building high brand\nloyalty. Additional information about the Company is available at:\n<a href=\"https://www.toughbuilt.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.toughbuilt.com</a>/.\n\n     FORWARD-LOOKING STATEMENTS\nThis press release contains \"forward-looking statements.\" Such statements\nmay be preceded by the words \"intends,\" \"may,\" \"will,\" \"plans,\" \"expects,\"\n\"anticipates,\" \"projects,\" \"predicts,\" \"estimates,\" \"aims,\" \"believes,\"\n\"hopes,\" \"potential\" or similar words. Forward-looking statements are not\nguarantees of future performance, are based on certain assumptions and are\nsubject to various known and unknown risks and uncertainties, many of which\nare beyond the Company's control, and cannot be predicted or quantified and\nconsequently, actual results may differ materially from those expressed or\nimplied by such forward-looking statements. Such risks and uncertainties\ninclude, without limitation, risks and uncertainties associated with (i)\nthe impact of the worldwide COVID-19 pandemic and government actions, on\nour business, (ii) supply chain disruptions, (iii) market acceptance of our\nexisting and new products, (iv) delays in bringing products to key markets,\n(v) an inability to secure regulatory approvals for the ability to sell our\nproducts in certain markets, (vi) intense competition in the industry from\nmuch larger, multinational companies, (v) product liability claims, (vii)\nproduct malfunctions, (viii) our limited manufacturing capabilities and\nreliance on subcontractors for assistance, (ix) our efforts to successfully\nobtain and maintain intellectual property protection covering our products,\nwhich may not be successful, (x) our reliance on single suppliers for\ncertain product components, (xi) the fact that we will need to raise\nadditional capital to meet our business requirements in the future and that\nsuch capital raising may be costly, dilutive or difficult to obtain and\n(xii) the fact that we conduct business in multiple foreign jurisdictions,\nexposing us to foreign currency exchange rate fluctuations, logistical and\ncommunications challenges, burdens and costs of compliance with foreign\nlaws and political and economic instability in each jurisdiction. More\ndetailed information about the Company and the risk factors that may affect\nthe realization of forward looking statements is set forth in the Company's\nfilings with the Securities and Exchange Commission (SEC), including the\nCompany's Annual Report on Form 10-K and its Quarterly Reports on Form\n10-Q. Investors and security holders are urged to read these documents free\nof charge on the SEC's web site at <a href=\"http://www.sec.gov\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.sec.gov</a>. The Company assumes\nno obligation to publicly update or revise its forward-looking statements\nas a result of new information, future events or otherwise.\n\nInvestor Relations\n\nContact Information:\n\nKCSA Strategic Communications\nDavid Hanover\ntoughbuilt@kcsa.com\n\nSource: ToughBuilt Industries, Inc\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200900596.MNPRE2200901847-06355420220110</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}