{"date": "2021-12-02 15:48:36+00:00", "ticker": "ABDN", "mrkt_info": {"open": 233.3, "close": 230.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The author is a Reuters Breakingviews columnist.  The opinions expressed are his own.</p><p class=\"tr-by\">By Neil Unmack</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">LONDON, Dec 2 (Reuters Breakingviews)</span><span class=\"tr-dl-sep\"> - </span>After a questionable vowel-negative rebranding, Abrdn Chief Executive Stephen Bird is giving the UK fund manager a proper M&amp;A makeover. Born of the merger of Aberdeen Asset Management and Standard Life, Abrdn <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ABDN.L\" data-type=\"ric\" data-ric=\"ABDN.L\" translate=\"no\" dir=\"ltr\">ABDN.L</a> has spent the last few years struggling to hang onto clients and their savings. Paying 1.5 billion pounds for consumer platform Interactive Investor takes the stolid Edinburgh-based group into a faster-growing and sexier area, albeit at a price.   </p><p>Bird took over Abrdn last year at a tricky time. A flurry of dealmaking under former CEOs Keith Skeoch and Martin Gilbert had failed to paper over the cracks in its core business, with clients choosing cheaper tracker funds or deserting once-star products like its Global Absolute Return Strategy. Analysts expect assets to stay flat this year at around 537 billion pounds, Refinitiv data shows. </p><p>Now Bird is choosing to hit back with a little disruption of his own. Buying Interactive Investor gives him a leading presence in the so-called platform business, which lets individuals track their investments and buy funds. The sector is growing revenue at 15% a year as more Brits take control of their savings rather than entrust them to pension providers. And Interactive Investor, the second largest player thanks to previous owner J.C. Flowers’ dealmaking, is a potential winner: it offers fixed fees, rather than a percentage-based charge, making it appealing to well-heeled savers. </p><p>Success, however, comes at a price. Interactive Investor made profits before tax of 46 million pounds last year, implying that Bird is paying around 40 times net income. Market leader Hargreaves Lansdown <a href=\"reuters://REALTIME/Verb=FullQuote/ric=HRGV.L\" data-type=\"ric\" data-ric=\"HRGV.L\" translate=\"no\" dir=\"ltr\">HRGV.L</a> is trading at just over 20 times. To bring his acquisition multiple down to a similar level, Bird will have to grow earnings 20% a year until 2023, according to Breakingviews calculations. </p><p>That’s a tall order. Bird will need to resist the urge to crank up fees or stuff Abrdn funds down the throats of Interactive Investor’s loyal customers, as doing so would be counterproductive. Another challenge is staying ahead in an increasingly complex market, especially with big fish like JPMorgan <a href=\"reuters://REALTIME/Verb=FullQuote/ric=JPM.N\" data-type=\"ric\" data-ric=\"JPM.N\" translate=\"no\" dir=\"ltr\">JPM.N</a> diving in and rivals like AJ Bell <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AJBA.L\" data-type=\"ric\" data-ric=\"AJBA.L\" translate=\"no\" dir=\"ltr\">AJBA.L</a> offering cheaper alternatives. Bird needs to show he can nurture businesses, as well as buy them.</p><p>Follow <a href=\"https://twitter.com/Unmack1\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@Unmack1</a> on Twitter</p><p><br/></p><p>CONTEXT NEWS</p><p>- UK fund manager Abrdn on Dec. 2 said it had agreed to buy retail-investing platform Interactive Investor from private equity owner J.C. Flowers for 1.5 billion pounds.</p><p>- Interactive Investor has over 400,000 customers and 55 billion pounds of assets under administration. It generated 46 million pounds of earnings in 2020 from 133 million pounds of revenue. </p><p>- Shares in Abrdn were down 1.7% as of 1116 GMT on Dec. 2, compared with the FTSE 100 Index’s 0.7% fall.</p><p><br/></p><p class=\"tr-signoff\"> (Editing by Ed Cropley and Oliver Taslic)</p><p class=\"tr-contactinfo\">((For previous columns by the author, Reuters customers can click on <a href=\"reuters://REALTIME/verb=Headlines/ric=UNMACK/\" data-type=\"newsExpression\" data-expression=\"UNMACK/\" translate=\"no\" dir=\"ltr\">UNMACK/</a> <br/> SIGN UP FOR BREAKINGVIEWS EMAIL ALERTS <a href=\"https://bit.ly/BVsubscribe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://bit.ly/BVsubscribe</a> | <a href=\"mailto:neil.unmack@thomsonreuters.com\" data-type=\"email\" translate=\"no\">neil.unmack@thomsonreuters.com</a> ; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://neil.unmack.thomsonreuters.com@reuters.net\">neil.unmack.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: INTERACTIVE INVESTOR-M&amp;A/ABRDN-BREAKINGVIEWS</p></div>"}