{"date": "2021-12-16 21:48:04.913000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3466.3, "close": 3400.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon Music Unlimited is one of the best music streaming services around—and right now new subscribers can get a 99-cent Echo Dot speaker with sign-up.</p><p>— <span>Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p></div><div class=\"tr-npp-body\"><p>If you've got a music fan on your shopping list this holiday season, it can be hard to know what exactly to gift them. Better access to a plethora of songs and albums from their favorite artists? Maybe a convenient way to play all that music throughout the house? You don't have to choose, since right now Amazon is offering a deal that covers both.</p><p><span><span>Tackle your holiday shopping with deals and expert advice delivered straight to your phone.</span> Sign up for text message alerts from the deal-hunting team at Reviewed.</span> </p><p>Through  <span>Friday, December 31</span> , the online shopping outlet is offering newcomers to its Amazon Music Unlimited service the third-generation Echo Dot smart speaker (now $19.99) for just $0.99. That means regular customers would pay $9.99 ($7.99 for Prime members) for the AMU access and get the puck-shaped speaker for a whopping 98% off the $39.99 list price. Normally this package would run you a total of $49.98 ($47.98 for Prime customers) for one month of AMU access, but through the end of the year the holiday bundle will only cost you $10.98.</p><p>The features of Amazon Music Unlimited make the service enticing on its own. We named it one of our favorite music streamers, having impressed us with its access to more than 70 million songs on demand without ad interruption—they can even be downloaded to your device for offline playback. In addition to tunes galore, the Unlimited version of the service boasts plenty of on-demand podcasts, all of which will come completely free of ads.</p><p>As for the Echo Dot, we think it's a solid entry into the world of smart speakers. Though it's smaller than its newer brethren (now at $29.99), the third-generation Dot is still one of the best Echo speakers for giving you access to all standard Alexa features at a fraction of the cost of the rest of the Echo series. Its compact design also makes it a great fit for anywhere in your home, from a tiny corner on your office desk to a bit of space between your coffee maker and your toaster on your kitchen counter. </p><p>It's tough enough to find one great gift during the holidays, so why not get two for the price of one? Shop this deal before the year ends and share sweet sounds with friends and family. </p><p class=\"tr-npp-section-title\">Get 1 month of Amazon Music Unlimited and an Echo Dot (3rd Generation) smart speaker for $10.98 (Save $39).</p><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Get an Echo Dot speaker for 99 cents with this bonkers Amazon Music deal</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}