{"date": "2022-02-11 06:32:55.681000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3223.79, "close": 3065.87}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The CMA has announced that industry rules setting out how grocery retailers should treat their suppliers will now apply to Amazon.</p><p>Amazon.com, Inc?s (Amazon) increasing activity in the UK groceries? sector in recent years has led the Competition and Markets Authority (CMA) to designate the company under the Groceries Market Investigation Order (the Order). As a result, Amazon and its relevant UK subsidiaries must now comply with the Groceries Supply Code of Practice (The Code).</p></div><div class=\"tr-npp-body\"><p>This Code, which applies to retailers with an annual turnover of more than ?1 billion from grocery sales, ensures that they treat their suppliers fairly. For example, it restricts firms from making changes to supply contracts at short notice. It also requires retailers to give an appropriate period of notice if they no longer want to use a supplier and provide reasons for ending the contract.</p><p>The CMA regularly monitors UK retailers to see if they meet the criteria to be covered by the Code, such as relevant turnover. However, once the CMA has designated a grocery retailer, compliance with the Code is managed by the independent Groceries Code Adjudicator. Any suppliers with concerns about compliance should raise these with the adjudicator directly.</p><p>Adam Land, Senior Director, Remedies, Business and Financial Analysis at the CMA, said:</p><p>?Households across the UK are increasingly using Amazon to buy food and other essential items. Today?s decision to designate Amazon helps to ensure a level playing field for companies active in the groceries sector as people?s buying habits evolve.</p><p>?These rules mean that the thousands of companies supplying Amazon with groceries are now protected from potential unfair business practices.</p><p>?We?ll continue to keep a close eye on the sector to make sure all major grocery retailers are bound by the same rules.?</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Euclid Infotech Pvt Ltd.</p></div>"}