{"date": "2021-12-24 02:55:21.359000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3420.74, "close": 3393.39}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Kaltura, the video experience cloud, announces that internet services and technology provider Watch Brazil launched its next-generation streaming TV service, Watch, powered by Kaltura hosted on Amazon Web Services (AWS).</p><p>Highlights:</p></div><div class=\"tr-npp-body\"><p>After launching its next-generation streaming TV service, Watch, powered by Kaltura and hosted on AWS, Watch Brazil has grown its user base by over 25% in the six months since launch</p><p>Watch benefits from flexible, scalable, and resilient Kaltura technology to deliver top entertainment to users via web, iOS, and Android mobile devices and connected TVs</p><p>Kaltura, the video experience cloud, announces that internet services and technology provider Watch Brazil launched its next-generation streaming TV service, Watch, powered by Kaltura hosted on Amazon Web Services (AWS). Demonstrating the appeal of the new service, in its first six months of operation, Watch?s user base has grown by over 25%.</p><p>Watch went live in Spring 2021 with 90 linear channels delivered by Kaltura on AWS transmitting the service?s wide array of engaging content. Watch offers premium international and national sports, general entertainment, TV series, comedy, drama, and news for subscribers to enjoy on the web, Android, and iOS mobile devices and connected TVs.</p><p>Watch Brazil is among the first internet providers in the country to take advantage of a new licensing regime, established in 2020, which opened up the digital entertainment market to internet service providers.</p><p>?We are extremely excited that Kaltura is our technology partner as we embark onto the dynamic Brazilian entertainment marketplace,? commented Maur?cio Almeida, Founding Partner at Watch Brazil. ?We are confident that with Kaltura?s high-quality video channels, flexibility, and scalability, we?re delivering a world-class streaming TV service which will continue to grow in popularity.?</p><p>?We are very proud that our technology is helping Watch Brazil to deliver this exciting new TV offering,? said Anil Hinduja, Global Head of Edge Compute, Content Delivery Network, Elemental Media and Security at AWS. ?It?s exciting to see how Watch Brazil can now benefit from the speed, agility and reliability of operating streaming services from the Cloud.?</p><p>?We heartily congratulate Watch Brazil for its enterprising spirit, embodied in the launch of Watch,? said Nuno Sanches, General Manager, Media and Telecom at Kaltura. ?We?re delighted to join them on their video entertainment journey, and the team at Watch Brazil can be assured that we?ll be there to support, with our technology, experience, and expertise, all along the way as they continue to grow.?</p><p>About Watch Brazil</p><p>Established in October 2018, with headquarters in Curitiba, Brazil, Watch Brazil is a video-on-demand platform that gives internet service providers the opportunity to deliver video services. Watch offers top TV series and films including Hollywood movies. The next-generation Watch platform is a content aggregating marketplace, and offers a range of applications including HBO Max and UOL Leia+ Banca. The start-up offers 8,000 hours of content from Paramount+, MTV, Comedy Central, Noggin, Universal and Warner, among others. <a href=\"https://watchbr.com.br\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://watchbr.com.br</a>/</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}