{"date": "2021-12-14 15:12:03.398000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>KOMO PLANT BASED FOODS INC (\"YUM-Z\")\n- Continues Rapid Increase of Distribution Points with 300%\n- Growth in 2 Months\n\n     Komo Plant Based Foods Inc. (\"Komo\"), a premium plant-based food\ncompany, is pleased to announce that its frozen plant-based food products\nare now being sold at more than 120 distribution locations, including 117\nbrick-and-mortar retail locations and 4 online retailers. This is\napproximately a 300% increase from two months ago.\n\n     Since mid-September 2021, Komo significantly scaled up production by\nmoving the bulk of its manufacturing to a co-manufacturing facility. In\nOctober 2021, TransCold Distribution Ltd., a leading frozen food\ndistributor, added Komo to its portfolio of products that it distributes\nacross Canada.\n\n     TransCold Distribution is a wholesale supplier of frozen foods and ice\ncream throughout Western Canada and the Western United States and\ndistributes to over 10,000 distribution points, including major grocery,\nconvenience, drug, chain retailers, food service and independent retailers.\nTransCold customers in Canada include Safeway, Save on Foods, Loblaws, Real\nCanadian Superstore, Fresh Co., Thrifty Foods, Whole Foods, Walmart,\nNesters Market, Buy-Low Foods, Walmart, Costco, 7-Eleven, Shoppers Drug\nMart, Spud.ca and Pomme Natural Market.\n\n     Komo is currently being carried by select stores in British Columbia\nat IGA, Safeway, Stong's and Fresh Market, and across full chains,\nincluding Nesters, Choices, Nature's Fare Market, Fairway Market and\nMeinhardt's, as well as specialty stores such as the Juice Truck,\nVegetarian Butcher, Vegan Supply, and Larry's Market. There are also\nseveral stores in Alberta now carrying Komo products, with many more\nexpected to be added across Canada in the near future. Komo has also\nannounced its intentions to expand into the United States in early 2022.\n\n     \"Since launching in March 2021 we have strived to create a solid\nfoundation of loyal consumers locally and expand retail rapidly,\" says Komo\nPlant Based Foods CEO William White. \"We can see the strength of our\nalliances with major distributors such as TransCold and Nationwide Natural\nFoods as we continue our rapid growth. We are honored to be included in the\nfrozen food sections of many prominent grocery stores and excited to see\nnew retail stores get added every month, allowing us to share the love of\nplant-based foods. \"\n\n     In addition to selling through a retail network, Komo sells its\nproducts directly to consumers through its e-commerce website and at local\nfarmers' markets. A full list of retail locations can be found at the\ncompany's website in addition to almost 200 reviews from verified buyers.\n\n     About Komo\n\n     Komo Plant Based Foods Inc. is a premium plant-based food company that\ndevelops, manufactures and sells a variety of plant-based frozen meals that\nare always hearty, satisfying, and made with wholesome ingredients. At\nKomo, our mission is to help make plant-based meals a staple on every\ndinner table by sharing our love for feel-good food that connects the\npeople to the planet. We believe plant-based eating is the future and -\nChange can start with a single biteTM. Our experienced plant-based\ninnovation and development team recreates vegan versions of traditionally\ncheesy and meaty classics, with 100% plants. Komo's products are sold\ndirect-to-consumer through our eCommerce website and a distribution network\nof online and brick and mortar grocery, convenience and natural retailer\nchannels. Our operating subsidiary Komo Comfort Foods launched in 2021 with\nour flagship products: plant-based Lasagna, Shepherd's Pie and Chickenless\nPot Pie and has recently launched a new line - Komo Plant-Based Meal\nHelpersTM - versatile meal starters to allow the creation of many dishes at\nhome. All of our products are 100% plant-based, made with wholesome\ningredients, free from preservatives, and frozen for freshness. Freezing\nproducts is a natural and effective way of keeping food products for longer\nwithout having to use any preservatives. Komo's meals have a 1-year frozen\nshelf life. Komo also sells hot ready-to-eat meals in Metro Vancouver\nthrough Uber Eats and Skip the Dishes.\n\n     Learn more at: www.komocomfortfoods.com and follow on Instagram:\n@komocomfortfoods\n\n     For further information, please contact:\nWilliam White, President &amp; CEO, Komo Plant Based Foods Inc.\nwill@komoeats.com\n1-866-969-0882\n\n     The Canadian Securities Exchange has not reviewed, approved or\ndisapproved the contents of this news release.\n\n     Cautionary Statement Regarding Forward-Looking Statements\n\n     Certain statements contained in this press release constitute\nforward-looking information. These statements relate to future events or\nKomo's future performance. The use of any of the words \"could\", \"expect\",\n\"believe\", \"will\", \"projected\", \"estimated\" and similar expressions and\nstatements relating to matters that are not historical facts are intended\nto identify forward-looking information and are based on Komo's current\nbelief or assumptions as to the outcome and timing of such future events.\nActual future results may differ materially. In particular, Komo's product\ndevelopment plans, its ability to launch its products on food delivery\napps, its ability to retain key personnel, its revenues, and its\nexpectation as to the acceptance of its products by retailer stores and\nconsumers constitute forward-looking information. Actual results and\ndevelopments may differ materially from those contemplated by\nforward-looking information. Readers are cautioned not to place undue\nreliance on forward-looking information. The statements made in this press\nrelease are made as of the date hereof. Komo disclaims any intention or\nobligation to publicly update or revise any forward-looking information,\nwhether as a result of new information, future events or otherwise, except\nas may be expressly required by applicable securities laws.\n\nTel   : 888-233-9432    KOMO PLANT BASED FOODS INC\nWWW   : <a href=\"https://www.komocomfortfoods.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.komocomfortfoods.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134700039.MNPRE2134700623-04552720211214</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}