{"date": "2021-11-18 17:06:55+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3549.0, "close": 3676.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        When did you realize that making the transition was the right decision?\n      </p>\n                <p>\n        We had built our first two cells and had data flowing into them. During a critical holiday period, we had an unexpected traffic spike that caused us to reach capacity in one cell. It was the first time that we shifted traffic out of an unhealthy cell to a healthy cell in production. We were then able to scale up both cells concurrently with no impact on customers. That's when we knew cell architecture was really going to work for us, and we proceeded to accelerate our migration.\n      </p>\n                <p>\n        What advice do you have for other practitioners looking to transition to the cloud?\n      </p>\n                <p>\n        Use New Relic to instrument your applications and infrastructure so you can monitor, debug, and improve your entire stack. Define your SLOs (service level objectives), validate them with your customers to align on expectations, and configure your alerts to notify you according to your needs.\n      </p>\n                <p>\n        Establish a FinOps team early on to focus on cloud cost optimization. Tag your cloud assets upfront and define clear governance and processes for capacity management and leverage autoscaling where possible.\n      </p>\n                <p>\n        When you move from data centers to the cloud, it changes your business model. You're moving from Capex (capital expenditures) to Opex (operation expenditures). If you do not understand how to manage capacity and costs, you can blow up your budget very quickly.\n      </p>\n                <p>\n        Our engineers are making decisions about costs on a daily basis. They're analyzing things like \"What's the cost of my service? How can I implement auto-scaling? How can I reduce resource usage? Where am I not as efficient as I could be in capacity management?\"\n      </p>\n                <p>\n        What best practices do you recommend for cell architecture?\n      </p>\n                <p>\n        We want our cells to have a lifespan of 90 days or less. It's a challenge to build and decommission cells that frequently, but otherwise they get stale. With a stale cell, you get drift in your configuration and deployed services, you're not picking up security patches and OS upgrades, you're not getting new functionality from your cloud provider. It's really critical to keep those cells fresh.\n      </p>\n                <p>\n        We have a team dedicated to tooling and automation of cell builds and decommissions and have made tremendous improvements in the efficiency, consistency, and quality of cell builds. We are now building new types of cells and cells in different regions. We even have a random cell name generator and have seen some really interesting and funny cell names.\n      </p>\n                <p>\n        What is one lesson learned from the transition to AWS?\n      </p>\n                <p>\n        Don't plan for the happy path. Most people tend to be overly optimistic versus planning for new technology, discoveries, unexpected work, or things going wrong. We planned for the data platform migration to take one year. By taking an iterative approach and planning in time for unknowns, we were able to overcome challenges, make adjustments, and meet our goals.\n      </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://newrelic.com/blog/nerd-life/new-relics-transition-to-cloud\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>New Relic Inc.</strong> published this content on <strong>18 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>18 November 2021 17:06:55 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - New Relic Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: New-Relic-Inc.</p></div>"}