{"date": "2022-01-21 19:08:30.749000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3033.35, "close": 2890.88}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Boardrooms and corner offices at America's largest and most powerful companies have remained predominantly white and male, while people of color – especially women of color – are clustered at the bottom levels of pay and prestige.</p><p>Those realities emerge starkly from a newly updated USA TODAY database that now captures demographics at the vast majority of Standard &amp; Poor's 100 firms.</p></div><div class=\"tr-npp-body\"><p>The database covers 83 companies in the S&amp;P stock index, up from 54 when we first shared the data in July. In addition, many of the original 54 have provided additional years of demographics.</p><p>SEARCH THE FULL DATABASE HERE</p><p>Federal regulators keep the annual reports under wraps, but USA TODAY obtained them after senior technology and economic opportunity reporter Jessica Guynn asked S&amp;P 100 firms to release the data voluntarily.</p><p>Not all of the companies provided their most recent filings, which cover calendar year 2020. Ten provided data for 2018 or 2019.</p><p><span><span>►Workplace diversity:</span> This is America: Black and Hispanic workers are still not getting a fair shake at work</span> </p><p><span><span>►'We are fundamentally a racist and sexist society:</span> How top companies in US are struggling to diversify leadership</span> </p><p>Black people comprise 11.2% of the U.S. workforce, Hispanic people 16.8%. <span> But among the 83 firms sharing demographics, only one hired executives whose makeup matched or beat those percentages in both categories. At Colgate Palmolive, 12.3% of top executives were Black and 17.5% were Hispanic.</span></p><p>Another five companies had equitable representation of Black executives but not Hispanic: UPS (20.3% Black); Lowe's (13.7%); Southern Company (12.7%); FedEx (11.8%); and Bank of New York Mellon (11.8%). Only one company in addition to Colgate Palmolive had a representative share of Hispanic people in its executive ranks: Kraft Heinz (35.0%).</p><p>None of these seven companies had equitable representation of Black or Hispanic women in the C-Suite.</p><p>Among all 83 businesses in USA TODAY's database, 4.5% of executive jobs collectively were held by Black people and 4.6% by Hispanic people. Meanwhile, the total workforce at those companies was 16.4% Black and 15.9% Hispanic – higher than the broader American labor force.</p><p class=\"tr-npp-section-title\">Pressure to disclose diversity grows</p><p>The updated database details the workforce demographics of some of America's most iconic brands, including General Motors, Home Depot and Walmart, which have never previously disclosed such data voluntarily.</p><p>Pressure on all leading companies to make their workforce profiles public is gaining momentum. Investors have successfully pressed diversity resolutions at a growing number of companies, including IBM, which said it will share its data in 2022. In October, Tesla shareholders backed a resolution for the company to do the same, but it's unclear if it will comply.</p><p>Employers with 100 or more employees and federal contractors with 50 or more employees already compile the data annually and submit it to the U.S. Equal Employment Opportunity Commission. The reports, known as EEO-1s, break down the race and gender of a company's workforce by job categories.</p><p>Federal officials have refused to release those records in response to Freedom of Information Act requests, although an ongoing lawsuit is challenging that policy.</p><p>Corporations are often reluctant to disclose EEO-1 data for fear of being cast in a negative light or putting themselves at risk for litigation. They also contend that the data they publish in annual diversity reports better reflects their workforce than the data collected by the federal government.</p><p>Seventeen <span> companies did not respond to USA TODAY or declined to supply their EEO-1 data. These included Walt Disney, Exxon, General Electric, Nike, T-Mobile and Broadcom. (See the full list at the end of this article.)</span></p><p>Charter Communications, unlike its telecommunications rival Comcast, declined repeated requests from USA TODAY for its workforce data. \"We don't make our EEO-1 public,\" the company said in a statement. It did not provide a reason.</p><p>Among companies that opened their records, <span> Black and Hispanic workers were also underrepresented in the ranks of professionals, such as lawyers and accountants. At the lower levels of organizations, Black and Hispanic employees were concentrated – and often overrepresented – in roles including administrative assistants, technicians and laborers.</span></p><p>At the extreme end of the list, Lowe's, Conoco Phillips and Bank of New York Mellon reported having zero Hispanic executives.</p><p>Only one company had equitable representation of women among executives. While female workers account for 47.3% of the U.S. workforce, they hold 47.9% of the top jobs at Target. At the other 82 companies, just 30.3% of executives are women.</p><p>Three companies – Kraft Heinz, UPS and AT&amp;T – had proportionate representation of Black women in executive roles, but no company achieved that mark for Hispanic women. Eight companies had at least an equitable share of white women: Target; Biogen; Starbucks; CVS; United Health Group; Merck &amp; Co.; Procter &amp; Gamble; and American Express.  </p><p class=\"tr-npp-section-title\">First-time insights from Walmart, Home Depot</p><p>The new disclosures from leading brands provide a unique glimpse into the gaps that remain for these companies in their efforts to hire and retain diverse workers across all job types.</p><p>Walmart, the nation's largest employer, voluntarily disclosed its worker demographics for the first time to USA TODAY. The news organization also has data from Walmart's 2005 federal filing, which was disclosed as part of an old lawsuit.</p><p>Has Walmart changed since the early years of this century?</p><p>It is difficult to know what the C-Suite looked like in 2005 because at the time, federal forms lumped executives with mid-level managers. But counting top jobs in that manner, Walmart has achieved marked improvement. Hispanic people held 7.4% of those leadership jobs in 2005 and 12.3% in 2020. The figure grew from 10.7% to 13.9% for Black people, and from 38.8% to 48.0% for women.</p><p>As with most of the nation's biggest corporations, Walmart's racial and gender composition at the top is very different from that in lower-ranking and lower-paying roles that typically offer less flexibility and fewer benefits. Last year, white men held 51.2% of Walmart's executive posts despite making up just 33.7% of the U.S. labor force and only 24.5% of all Walmart employees.</p><p>Amazon, the nation's second largest employer, recently released its diversity data for the first time since 2016. It revealed that Black and Hispanic workers, particularly women, remain underrepresented in top jobs despite being overrepresented among blue-collar workers.</p><p>Diversity among Amazon's executives has increased since 2016, but the change has been slow and falls behind other major companies – including technology giants – reviewed by USA TODAY. Hispanic people accounted for 4.2% of executives in 2020 compared to 1.0% in 2016. In those four years, Black representation went from 0% to 1.8% while women grew from 21.9% to 24.1%.</p><p>It is worth noting that Amazon reclassified some of its managers as executives between 2016 and 2020, increasing their reported executive ranks from 105 to 2,610. That's a 24-fold increase, compared to a 2.6-fold increase in its overall workforce.</p><p>Another company disclosing demographic data for the first time is Home Depot, the hardware and renovations box store.</p><p>Home Depot's executives do not fully match the diversity of the U.S. workforce – but the company came close with Black executives (10.5%). Only 9.7% of executives are Hispanic, which is 57% of the national labor rate. Home Depot's share of women executives (29.0%), meanwhile, trailed far behind their 43.7% participation in the U.S. workforce overall.</p><p>For Black mid-level managers, Home Depot achieved parity with the nation's workforce as a whole. Black workers held 14.3% of these jobs, which is 3.1 percentage points more than the U.S. rate. The home improvement company fell 2.5 percentage points short of parity with Hispanic managers (14.1%).</p><p>Women and people of color are more heavily represented in other, lower-paid job categories at Home Depot. As a result, 21.2% of all Home Depot employees were Hispanic, 17.2% were Black, and 37.7% were women. White workers comprised just 53.6% of all Home Depot hires.</p><p><span>Companies that have not provided EEO-1 reports to USA TODAY:</span> </p><p><span>Tesla</span> </p><p><span>Berkshire Hathaway</span> </p><p><span>Walt Disney</span> </p><p><span>Exxon Mobil</span> </p><p><span>Nike</span> </p><p><span>Broadcom</span> </p><p><span>Texas Instruments</span> </p><p><span>T-Mobile</span> </p><p><span>Honeywell International</span> </p><p><span>NextEra Energy</span> </p><p><span>Linde PLC</span> </p><p><span>Philip Morris International</span> </p><p><span>Charter Communications</span> </p><p><span>IBM</span> </p><p><span>General Electric</span> </p><p><span>Emerson Electric</span> </p><p><span>Simon Property Group</span> </p><p><span>This article originally appeared on USA TODAY: We asked Walmart, Amazon and others about hiring for diversity. What we found may surprise you</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}