{"date": "2022-01-16 15:00:17.269000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3242.76, "close": 3125.98}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Here are all the Prime-exclusive deals you can avail during Amazon's Great Republic Day sale 2022.</p><p>E-commerce giant Amazon kicks off its annual Great Republic Day sale, starting tomorrow. And in typical fashion, Prime members get early access to the offers a day before (January 16). The sale will be live until January 20 and see deals on various categories ranging from electronics, fashion, kitchen products, and more. <br/><br/> Here's a collection of the best deals you can avail in terms of technology. Also, owners of an SBI (State Bank of India) credit cards receive an instant 10 percent discount.</p></div><div class=\"tr-npp-body\"><p>Samsung Galaxy S21 FE 5G <br/><br/> The newly released Galaxy S21 FE is not much different from the S21, but includes all the necessary features to \"nearly\" justify its Rs 54,999 price tag. For the sale, Amazon has included a Rs 5000 coupon, taking the cost down to Rs 49,999 during checkout. The base variant comes in an 8GB RAM + 128GB internal storage configuration, while the higher option expands it to 256GB. Samsung has removed the expandable storage feature, so take your pick accordingly.</p><p>The phone features a 6.4-inch full-HD+ AMOLED display, offering an adaptive refresh rate that switches between 60Hz to 120Hz depending on what applications you are running. It is powered by a 5nm Exynos processor and sports a vertical triple-camera setup at the rear with a rather jarring bump. You get a flagship-grade 12MP main sensor, 8MP telephoto, and 12MP ultra-wide with options for Enhanced Night Mode. At the front, you have a 32MP camera that even allows for dual recording.</p><p>Lenovo Chromebook 14e</p><p>The Chromebook 14e is quite lightweight, making it ideal for students, teachers, and business professionals. Amazon is offering a 50 percent discount on the laptop, taking the cost down to Rs 19,990. At this price, you get a 14-inch full-HD screen with an anti-glare coating to tackle hard reflections. Under the hood, you get an AMD A-series chip, paired with 4GB DDR4 RAM that does not support further memory expansion. However, the lack of memory should not have a noticeable effect on daily, professional use.</p><p>For storage, the Chromebook includes 64GB eMMC storage that delivers almost similar speeds as an SSD would. It also includes a 720p front-facing camera for video calling, necessary USB ports and a microSD card reader, and G Suite web applications for students to share and sync their work seamlessly.</p><p>2020 Apple MacBook Pro</p><p>Sporting the new <a href=\"https://indianexpress.com/about/apple/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Apple</a> -designed M1 chipset, the 2020 MacBook Pro delivers performance and speed that has aged quite well. On Amazon, the professional-grade computer has a 10 percent discount and is available at Rs 1,10,900 for the base variant, housing a 256GB SSD for storage. The higher option is a 512GB variant and is priced at Rs 1,31,900.</p><p>Both 13.3-inch MacBook Pros are equipped with an 8-core processor that rips through heavy workloads with ease – such as editing on Final Cut Pro. The variant on Amazon offers 8GBs of unified memory, though you can configure a 16GB system from the official store. The Retina display sits somewhere between full HD and 4K – 2560 x 1600 resolution. For video calls and meetings, you get a 720p webcam, while the Magic Keyboard receives upgrades in terms of overall key springiness and prevents unnecessary wobbling whilst typing.</p><p>Lenovo IdeaPad Gaming 3 (Intel model)</p><p>The IdeaPad Gaming 3 comes in two options – one without an SSD and one with. We would recommend going for the latter variant, as it also offers an upgrade in terms of display – 120Hz refresh rate. Right now, Amazon is offering a 30 percent discount on this mid-range gaming laptop and is available to buy at Rs 54,990.</p><p>The 10th Gen Intel Core i5 10300H chipset offers more than enough processing power to run heavy applications, while the 8GB DDR4 memory runs quite close to 3000Mhz, letting you keep several Chrome tabs with no drops in performance. Lenovo also allows for memory expansion up to 16 GBs. The full-HD display measures 15.6-inches and comes with an anti-glare coating, that prevents distractions during gaming. The NVIDIA GTX 1650 does heat up a little during long sessions but does not show any lack in frames for the most part.</p><p>Acer Nitro 5</p><p>Although there is a shortage of NVIDIA RTX cards right now, the laptop gaming segment has not suffered that much. The Acer Nitro 5 comes with an RTX 3050 laptop GPU, paired with an 11th Gen Intel Core i5 processor. The high-end gaming laptop with 16GBs RAM is priced at Rs 75,990 on Amazon right now – a 28 percent price cut.</p><p>The 1080p display measures 15.6-inches and offers a 144Hz refresh rate, which is superb for competitive gamers. Storage-wise, you get a 256GB NVMe SSD, allowing for quick load times and a 1TB hard drive for storing larger sized games. The keyboard is fully backlit with RGB, while the Killer DoubleShot Pro feature lets you use ethernet and Wi-Fi at the same time. Under high pressure, Acer's CoolBoost technology increases fan speed by 10 percent and CPU/GPU cooling by 9, thereby increasing the thermal performance.</p><p>Sony WH-1000XM4</p><p>These industry-grade headphones feature major improvements in their noise-cancelling department. They feature similar touch controls as its predecessor, where with a series of taps and swipes, users have complete control over their music playback. The <a href=\"https://indianexpress.com/about/sony/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Sony</a> WH-1000XM4 is listed at Rs 22,990 on Amazon (23 percent off), and is a Prime-exclusive deal that runs out later tonight.</p><p>Onde connected to the Sony Headphones Connect app, you get a range of features such as the speak to chat functionality, which pauses the music whenever it detects that you are speaking. The auto-pause feature pauses the playback whenever one removes the headphones. They connect wirelessly via Bluetooth and feature a single-sided detachable cable as well. The earcups come equipped with a 40mm HD driver unit and on a single charge offers up to 30 hours of playtime.</p><p>Apple AirPods (2nd Generation)</p><p>The AirPods 2 is the same as its previous instalment, albeit with minor upgrades here and there. For starters, it comes with the option of a wireless charging case, which further features a small LED light at the front to indicate battery status. Previously, this was located inside the case. The AirPods 2 are available at Rs 8,990 today with an exclusive deal for Prime members.</p><p>Powered by Apple's H1 processor, the AirPods offer even less latency and easily switches from one device to the other. It also listens to you constantly – responding to the \"Hey Siri\" command, while cutting out any ambient noise. The device is a must-have for any Apple user and can last an entire day on a full charge.</p><p>SteelSeries Arctis 1</p><p>The SteelSeries Arctis 1 gets rid of all the gimmicks a typical gaming headphone would offer in place of decent performance and build quality. They can be used wirelessly via Bluetooth, with the USB connection allowing for charging and playback at the same time. The headphones are priced at Rs 4,499 on Amazon, at an exclusive discount for Prime members.</p><p>The SteelSeries Arctis 1 connects to any console with ease, offers ClearCast noise cancelling, and features a detachable microphone. As mentioned before, the build quality is excellent, featuring a steel-reinforced headband that offers a perfect fit and lasting durability. The ear cups are foldable as well, and feature button controls for quick access.</p><p>Acer Nitro VG240YS</p><p>At Rs 15,999, the Acer Nitro VG240YS is a great monitor, covering all spectrums of workloads – gaming, video editing, and graphic design. The 23.8-inch full-HD display offers a 165Hz refresh rate, ensuring a sharp and smooth gameplay experience. The super-slim bezels allow you to align multiple monitors next to each other without causing too much of a hindrance.</p><p>Additionally, it comes with Bluelight Shield for eye care and low dimming options. At the back, you get 2 HDMI ports, 1 display port, and integrated speakers. It also comes with AMD's FreeSync Premium technology that further minimises lag and helps with screen tearing.</p><p>LG 24UD58</p><p>In the 4K segment, LG is offering a 24-inch LED gaming monitor that offers the highest picture quality with no distortion. It is listed at Rs 25,999 in a Prime-exclusive deal on Amazon, and comes with a Black Stabiliser that senses darker areas on the screen and makes it brighter so you can find enemies in the hidden.</p><p>LG 24UD58 4K gaming monitor. (Image credit: Amazon)</p><p>The refresh rate stands at the average 60Hz and it comes with AMD's FreeSync technology, providing a lag-free experience. The monitor also provides onscreen controls for adjusting brightness and contrast levels, split-screen options, and lets you save settings as presets for easy access.</p><p>Copyright 2022 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}