{"date": "2021-12-30 01:21:34.922000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3413.22, "close": 3372.89}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>SK Telecom launched the 'Nugu Multi-Agent' service equipped with 'Alexa' from the 21st in collaboration with Amazon to support both Korean and English for the first time in Korea.</p><p>SKT installed Amazon's 'Alexa voice service' on its AI speaker 'NUGU candle' to form a multi-agent, and users can use both Korean and English AI services through one AI speaker.</p></div><div class=\"tr-npp-body\"><p>When 'Aria', the Korean AI calling word, is called, Korean services and Korean contents are used through 'nugu', and when 'Alexa', the English AI calling word is called, English services and overseas contents are used through 'Alexa'.</p><p>The basic functions of the AI ??speaker such as weather, news, emotional conversation, and calendar support both 'Nugu' and 'Alexa'. Content can be supported through 'Alexa'. (However, music-related services such as English radio including TuneIn will be opened later)</p><p>* 'TuneIn': Free Internet radio service</p><p>'Nugu Candle' equipped with 'Nugu Multi-Agent' is a single AI speaker, but since it is driven by two independent AI agents, each operation is visually separated.</p><p>Focusing on the fact that the identity color of both 'Nugu' and 'Alexa' is blue, it is a method to show the LED color when the agent is running separately. 'Who' is light blue and 'Alexa' is dark blue, so you can intuitively know which agent is running by differentiating the LED colors.</p><p>Customers using SKT's 'NUGU Candle' can use the multi-agent service by updating the 'NUGU' app and linking their accounts through the 'Amazon Alexa connection' menu of the 'NUGU' app.</p><p>SKT 'Nugu' users will be able to use various English services such as English radio, weather, and emotional conversation provided by 'Alexa' in the future. .</p><p>SKT plans to continuously install 'Alexa' on ' NUGU ' devices, such as ' NUGU candle SE ( scheduled to be released in early 2022 ) '.</p><p>In addition, through close collaboration with 'Alexa', we plan to continue adding various services that can be used by Korean users.</p><p>Lee Hyun-ah, SKT AIandCO (Company) manager, said, ?SKT ?NUGU?, who started as Korea?s first voice recognition AI speaker and met customers through various services, met with the world?s first voice recognition AI speaker ?Alexa? to select Korea?s first multi-agent \"We will continue to strive to provide convenience and pleasure to our customers with new and richer services.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}