{"date": "2022-02-14 21:24:08+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By David Randall</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW YORK, Feb 14 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Billionaire Leon Cooperman, hedge fund Lone Pine Capital, and mutual fund manager Polen Capital were among firms that greatly reduced their positions in Facebook-parent Meta Platforms Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a> in the quarter that ended Dec. 31, potentially protecting them from some losses during the company's record one-day plunge in Feb, according to securities filings released on Monday. </p><p>Meta Platforms fell 26% on Feb. 3, erasing more than $200 billion in market value, after the company after reported its first ever decline in global daily active users and cited increasing competition from TikTok and other platforms in its weaker-than-expected forecast. </p><p>Cooperman sold his entire stake of 22,000 shares in Meta Platforms, while Lone Pine Capital halved its stake in the company by selling approximately 1.9 million shares. Polen Capital sold approximately 2.8 million shares of the company,  though it remained the firm's third-largest position. </p><p>The selling came as institutional investors appeared to take steps back from high-flying technology names, which had helped the broad S&amp;P 500 reach record highs in the wake of the coronavirus pandemic. Concerns about rising inflation have prompted investors to punish companies that did not meet or exceed Wall Street expectations this earnings season, while greatly rewarding those that did. <a href=\"reuters://REALTIME/verb=Headlines/ric=L1N2UE29L\" data-type=\"newsExpression\" data-expression=\"L1N2UE29L\" translate=\"no\" dir=\"ltr\">L1N2UE29L</a></p><p>Bridgewater Associates, led by billionaire Ray Dalio, sold all of its stake in Netflix Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=NFLX.O\" data-type=\"ric\" data-ric=\"NFLX.O\" translate=\"no\" dir=\"ltr\">NFLX.O</a> in the quarter that ended in December, filings show. Capital Research Global Investors, meanwhile, sold 3,184,727 shares in the company, more than any other firm tracked by WhaleWisdom. </p><p>Shares of Netflix fell 20% on Jan. 21 after the streaming company forecasted weaker than expected subscriber growth. Shares of the company are down 34% for the year to date. </p><p>Shares of Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> gained 13.5% - pushing its market value up by a one-day record  $190 billion - after the company reported robust earnings in early February. Those gains <span class=\"tr-strong\">could have enriched</span> firms including Polen Capital, which added 320,440 shares of the company in the quarter that ended in December. </p><p>Securities fillings, known as 13-fs, are backward-looking and do not disclose whether a firm has sold or added to its position since the end of December. </p><p><br/></p><p class=\"tr-signoff\"> (Editing by David Gregorio)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:David.Randall@thomsonreuters.com\" data-type=\"email\" translate=\"no\">David.Randall@thomsonreuters.com</a> ; 646-223-6607; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://david.randall.thomsonreuters.com@reuters.net\">david.randall.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-FUNDS/TECHNOLOGY-STOCKS</p></div>"}