{"date": "2022-01-04 14:49:11+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>GOOD GAMING INC (\"GMER-0\")\n- Letter to Shareholders\n\n     Good Gaming, Inc. (the \"Company\"), an innovative brand leading the\ngaming industry across multiple segments in the space since 2008, today\nreleased a letter to shareholders from Chairman and CEO David Dorwart.\n\n     Dear Fellow Shareholders:\n\n     We are excited to enter 2022 with Good Gaming in a position of\nstrength unlike any other period in its history. The tireless work of our\ndedicated team throughout 2021 has solidified our foundation for long-term\ngrowth, and I am pleased to take this opportunity to summarize our recent\nbusiness developments, significant achievements of the last year, as well\nas provide some insight into the strategic direction of Good Gaming for\n2022 and beyond.\n\n     Executing on our vision of pioneering the NFT gaming space, we\nculminated our successes of 2021 with the much-anticipated official mainnet\nlaunch of our first-to-market collectible NFT game MicroBuddies(TM) on\nDecember 17th. Our team's ability to take MicroBuddies(TM) from concept to\nfull launch in under a year is nothing short of phenomenal and clearly\ndemonstrates our ability to capitalize on opportunities in the rapidly\nevolving gaming market.\n\n     When we pivoted to crypto gaming in early 2021, we were building upon\nan already amazing history in the gaming space. We actually got started in\ngaming back in 2008 and really began making a name for ourselves in 2014\nwhen we started creating competitive eSports tournaments for Blizzard\nEntertainment's Hearthstone, a free-to-play online digital collectible card\ngame.\n\n     After becoming the go-to for anything Hearthstone-related, we\ncapitalized on the surging popularity of Minecraft servers. Ultimately, we\ncreated some of the most popular private-server versions of Prison and\nSkyblock, two of the most popular game modes in Minecraft. We also went on\nto build huge communities in the process. And now we intend to do the same\nwith NFT gaming.\n\n     Our community building in this arena is already off to a tremendous\nstart with more than 6,000 members on our MicroBuddies(TM) Discord channel,\nmore than 22,000 followers on Twitter, and over 36,000 Instagram followers.\nAs we continue to expand partnerships with NFT and crypto influencers and\npursue targeted online ads to drive increased awareness, we believe these\nnumbers will grow significantly in 2022.\n\n     Completing the development and launch of MicroBuddies(TM) was made\npossible in part by our achievement of key milestones in 2021, including\nour listing on the OTCQB in September and the subsequent $3.1 million PIPE\nfinancing we closed in November.\n\n     Finally, we ended the year by restructuring our outstanding debt,\nconverting $2.7 million worth of debt into preferred equity. This\nconversion, which removes an expected $16.5 million of derivative\nliabilities from our balance sheet, combined with the proceeds of our PIPE\noffering, gives Good Gaming a much more robust and healthier balance sheet\nas we enter 2022, while  eliminating the potential impact of derivative\nliability losses on our financial statements moving forward.\n\n     Looking ahead, our team will continue the development of\nMicroBuddies(TM) in 2022 through code enhancements, user experience and\nuser interface upgrades, and bug fixes. Our focus on improving gameplay\nincludes plans to add functionality and visual enhancements, remove the\noccasional error messages, and address suggestions and requests from our\npassionate and rapidly growing Discord community.\n\n     We also plan to incorporate the ability to browse OpenSea listings\ndirectly from within MicroBuddies(TM), empowering players with robust\nsorting tools and other relevant features to support the best possible user\nexperience for our community.\n\n     Another exciting area with tremendous potential that we are exploring\nis the incorporation of PFP and other community-based projects that will\nallow us to increase our exposure to the booming NFT industry and bridge\nthe gaps between additional game releases.. PFPs, or profile pictures\ndesigned to be used as social media avatars, were some of the first NFTs\never made. During the NFT boom in the first half of 2021, many PFPs went on\nto command multi-million-dollar prices, including Sotheby's sale of\nCryptoPunk #7423 in June for more than $11.7 million.\n\n     In the bigger picture, our five-year strategic plan includes the\nrelease of multiple games with increasing complexity. These games will be\ninterwoven with a comprehensive and engaging community where members feel\nthey are part of an exclusive club, and we will support the growth of this\ncommunity through proven tactics we have employed in past endeavors,\nincluding competitions, exclusive perks, and attractive giveaways.\n\n     One of the things we have learned through experience is that success\nin this arena is about more than just game development. NFTs and crypto\ngaming really bolt onto the larger idea of creating a lifestyle and\ncommunity. This is the secret sauce that fosters highly engaged, die-hard\nbrand loyalists.\n\n     Our ultimate vision leverages the interoperability of the blockchain\nto create opportunities for our players to utilize GOO, our in-game\ncurrency, in various ways, across different projects and games. This vision\nis about providing our gamers with the opportunity to participate in an\nentire lifestyle to keep them engaged, much like the idea of the metaverse,\nor in our case, a \"microverse.\"\n\n     An outgrowth of this lifestyle approach and a demonstration of the\nstrength of our rapidly growing community can be found in the upcoming\nlaunch of our merchandise store for MicroBuddies(TM), a feature our\ndedicated community members practically demanded, where they can go to\npurchase shirts, hats, mugs, bags, and more. Going forward, we will have a\nlot more opportunities to generate various revenue streams within this\ncommunity as it continues to grow.\n\n     With so much potential on the near-term horizon, we are moving ahead\non plans to expand our executive management team with the addition of key\nhires with proven track records of success in the gaming industry and\nsocial media platforms. Our expanding executive team will give us the\nadditional contacts and technical expertise needed by having the right\npeople in the right place at  the right time!\n\n     We wholeheartedly believe that crypto gaming and NFTs will absolutely\nrevolutionize all aspects of gaming in the future. Players want to truly\nown their assets and blockchain smart contracts now ensure that game\ndevelopment companies like Good Gaming can continue to earn revenue even\nafter the asset transfers to players outside of its game. This monumental\ntrend is irrefutable, and it is coming in a big way!\n\n     I couldn't be more thrilled with the position of Good Gaming as we\nenter 2022 and believe this will be a breakout year for the Company as we\ntake advantage of lucrative opportunities in the fast-moving and exciting\nworld of NFT gaming that we are pioneering.\n\n     Thank you to all our shareholders for your support on this exciting\njourney. The best is yet to come!\n\n     Sincerely,\n\n     David Dorwart\nChairman &amp; CEO\nGood Gaming, Inc.\n\n     About Good Gaming:\n\n     Good Gaming is an innovative brand leading the gaming industry across\nmultiple segments in the space since 2008. Beginning with our roots as a\ncollaborative space for gamers to share their knowledge, we went on to\nestablish ourselves as one of the leaders in hosting Hearthstone\ntournaments. In 2016, we expanded our reach to include establishing\nmultiple Minecraft servers with some of the most popular versions of Prison\nand SkyBlock, then developing our completely custom-developed NFT\nblockchain game, MicroBuddies(TM), in 2021. The Good Gaming advantage comes\nfrom our development team's close relationship with the player communities\nof all of our games. The constant communication and resulting feedback\nfurther expand our proprietary content, and we continue to be influencers\nin the realm. Good Gaming continues to find exciting and innovative ways to\nbranch across the gaming industry. As a staff and community, our goal is to\ncement our place as a fun and collaborative place for ALL gamers to enjoy.\n\n     For more information about Good Gaming, please visit our website:\n\n     <a href=\"https://www.good-gaming.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.good-gaming.com</a>\n\n     Visit us on our social media platforms:\n\n     Discord: <a href=\"https://discord.gg/MicroBuddies\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://discord.gg/MicroBuddies</a>\n\n     Telegram Group: <a href=\"https://t.me/microbuddiesio\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://t.me/microbuddiesio</a>\n\n     Twitter: <a href=\"https://twitter.com/microbuddies\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/microbuddies</a>,\n<a href=\"https://twitter.com/GOODGMER\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/GOODGMER</a>\n\n     Reddit: <a href=\"https://www.reddit.com/r/MicroBuddies\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.reddit.com/r/MicroBuddies</a>/\n\n     Instagram: <a href=\"https://www.instagram.com/goodgmer\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.instagram.com/goodgmer</a>/\n\n     Facebook: <a href=\"https://www.facebook.com/microbuddiesofficial\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.facebook.com/microbuddiesofficial</a>/,\n<a href=\"https://www.facebook.com/GoodGMER\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.facebook.com/GoodGMER</a>, <a href=\"https://www.facebook.com/GoodGamingMC\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.facebook.com/GoodGamingMC</a>\n\n     Twitch: <a href=\"https://www.twitch.tv/goodgaminginc\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.twitch.tv/goodgaminginc</a>\n\n     YouTube Channel:\n<a href=\"https://www.youtube.com/channel/UC3YyoK_Xdo7sfPmse898Nog\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.youtube.com/channel/UC3YyoK_Xdo7sfPmse898Nog</a>/\n\n     Safe Harbor: This release contains statements that constitute\nforward-looking statements within the meaning of Section 27A of the\nSecurities Act of 1933, as amended, and Section 21E of the Securities\nExchange Act of 1934, as amended. These statements appear in a number of\nplaces in this release and include all statements that are not statements\nof historical fact regarding the intent, belief or current expectations of\nGood Gaming Inc., its directors or its officers with respect to, among\nother things: (i) financing plans; (ii) trends affecting its financial\ncondition or results of operations; (iii) growth strategy and operating\nstrategy. The words \"may,\" \"would,\" \"will,\" \"expect,\" \"estimate,\" \"can,\"\n\"believe,\" \"potential,\" and similar expressions and variations thereof are\nintended to identify forward-looking statements. Investors are cautioned\nthat any such forward-looking statements are not guarantees of future\nperformance and involve risks and uncertainties, many of which are beyond\nGood Gaming Inc.'s ability to control, and that actual results may differ\nmaterially from those projected in the forward-looking statements as a\nresult of various factors. More information about the potential factors\nthat could affect the business and financial results is and will be\nincluded in Good Gaming, Inc.'s filings with the Securities and Exchange\nCommission, including those set forth as \"Risk Factors\" in such filings.\n\n Contact Information:\n\nContact:\n\n     Dave Gentry, CEO\nRedChip Companies Inc.\n407-491-4498\nDave@redchip.com\n\nTel   : 888-295-7279    GOOD GAMING INC\nWWW   : <a href=\"https://www.good-gaming.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.good-gaming.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200300479.MNPRE2200301850-06470720220104</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}