{"date": "2022-02-22 16:10:52.944000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>VERIZON COMMUINICATIONS INC (\"VZ-N\")\n- Verizon, Bloomberg Media, Zixi &amp; AWS test how 5G &amp; mobile edge\n- computing can transform broadcast &amp; content delivery\n\n     Verizon, Bloomberg Media, Zixi and Amazon Web Services (AWS) are\nworking together to test how 5G and mobile edge computing can transform how\nglobal business news is produced, delivered and consumed. Using Verizon 5G\nEdge with AWS Wavelength, Bloomberg Media will be able to package and\ndeliver live 4K Ultra High Definition (UHD) content without the need for\nsatellites, allowing for fast and efficient content delivery.\n\n     Verizon 5G Edge with AWS Wavelength, a real-time cloud computing\nplatform, brings AWS compute and storage services to the edge of Verizon's\nwireless network. This, coupled with Zixi's SDVP and ZEN Master control\nplane, shows that it is possible to change the way broadcast content is\npackaged and delivered. This combination of Zixi software minimizes the\nlatency and simplifies the networking required to connect from hosted\nsoftware services on 5G Edge with AWS Wavelength to the end user's device\nwhile ensuring a high quality broadcast signal is maintained.\n\n     Media consumption has its challenges for content providers.\nBroadcasters are looking to simplify their distribution workflows being\ndriven by a ubiquitous content economy and consumers who want more live\nstreamed 4K content, with quick start times and minimal buffering. To\naccomplish this, Bloomberg Media sends UHD video using Verizon 5G Edge with\nAWS Wavelength coupled with Zixi's software to quickly process the video\ninto multiple streams for broadcast across various platforms.\n\n     The companies also plan to test streaming Bloomberg TV+ 4K UHD content\ndirect to consumers' 5G-connected devices, via Verizon 5G Edge with AWS\nWavelength, allowing users to access data rich content on market news and\nbusiness insights on the go. This will be followed by another trial that\nwill involve near real-time native translation of Bloomberg TV+ content for\ntranscripts, captioning and subtitles distributed globally.\n\n     \"5G and edge compute have the potential to revolutionize the media and\nentertainment space and reinvent how global business news is produced and\nconsumed,\" said Tami Erwin, CEO of Verizon Business. \"By leveraging Verizon\n5G Edge with AWS Wavelength and Bloomberg Media's premium 4K UHD service,\nwe're testing how we can potentially reimagine the future of media delivery\nand the viewer experience.\"\n\n     \"Bloomberg Media is committed to continuous innovation and\nexperimentation of technologies to better reach our global audience of\nbusiness leaders with the insights, information and solutions they need,\"\nsaid Roman Mackiewicz, Chief Information Officer at Bloomberg Media. \"This\nproof of concept trial combines Verizon's 5G and mobile edge computing\ncapabilities with Bloomberg TV+ premium 4K UHD content to create a modern\nstreaming news experience with the potential for true industry disruption.\"\n\n     \"It has been fantastic working with Verizon, Bloomberg Media and AWS\nto deliver pristine 4K UHD quality content over 5G while leveraging edge\ncompute,\" said Gordon Brooks, Executive Chairman and CEO of Zixi. \"Verizon\n5G Edge with AWS Wavelength and Zixi can potentially transform the M&amp;E\nindustry.\"\n\n     Launched in August 2020, Verizon 5G Edge with AWS Wavelength is\ncurrently available in 17 metropolitan areas in the U.S. Learn more\ninformation about Verizon 5G Edge and Verizon's 5G technology.\n\n     About Verizon\n\n     Verizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30,\n2000 and is one of the world's leading providers of technology and\ncommunications services. Headquartered in New York City and with a presence\naround the world, Verizon generated revenues of $133.6 billion in 2021. The\ncompany offers data, video and voice services and solutions on its\naward-winning networks and platforms, delivering on customers' demand for\nmobility, reliable network connectivity, security and control.\n\n     About Bloomberg Media\nBloomberg Media is a leading, global, multi-platform brand that provides\ndecision-makers with timely news, analysis and intelligence on business,\nfinance, technology, climate change, politics and more. Powered by a\nnewsroom of over 2,700 journalists and analysts, it reaches influential\naudiences worldwide across every platform including digital, social, TV,\nradio, print, and live events. Bloomberg Media is a division of Bloomberg\nLP. Visit BloombergMedia.com for more information.\n\n     VERIZON'S ONLINE MEDIA CENTER: News releases, stories, media contacts\nand other resources are available at verizon.com/news. News releases are\nalso available through an RSS feed. To subscribe, visit\nwww.verizon.com/about/rss-feeds/.\n\n Contact Information:\n\nContact:\n     Chris Ashraf, Verizon\nchristina.moon.ashraf@verizon.com\n201.320.4259\nTwitter: @ChrisMoonPR\n\n     JaShel Jones, Bloomberg Media\njjones594@bloomberg.net\n347.331.2391\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2205200486.MNPRE2205202310-07435120220222</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}