{"date": "2022-02-08 22:18:48+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds details on CEO compensation, severance</p><p class=\"tr-by\">By Subrat Patnaik and Aishwarya Nair</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Feb 8 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Peloton Interactive Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=PTON.O\" data-type=\"ric\" data-ric=\"PTON.O\" translate=\"no\" dir=\"ltr\">PTON.O</a> will replace its chief executive and cut about 2,800 jobs, the company said on Tuesday, as the exercise bike maker looks to revitalize sagging sales and win back investor confidence.</p><p>John Foley, Peloton's co-founder who has led the company for nearly a decade, will step down to become the executive chair. Barry McCarthy, the former chief financial officer of Spotify Technology SA <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SPOT.N\" data-type=\"ric\" data-ric=\"SPOT.N\" translate=\"no\" dir=\"ltr\">SPOT.N</a> and Netflix Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=NFLX.O\" data-type=\"ric\" data-ric=\"NFLX.O\" translate=\"no\" dir=\"ltr\">NFLX.O</a>, will take the helm from Wednesday. He will be paid a base salary of $1 million and a stock option award to buy 8 million shares of the company's Class A common stock, according to a regulatory filing. </p><p>Foley has drawn the ire of activist investor Blackwells Capital in recent weeks as the company struggled to maintain the breakneck growth that propelled its valuation to $52 billion in early 2021. Shares have since tumbled nearly 80%. </p><p>The investment firm called for his removal and even urged the company to sell itself, blaming the stock's underperformance to \"gross mismanagement\", Foley's poor decision making and a lack of credibility.</p><p>In response to Tuesday's announcement, Blackwells said the moves, which included the appointment of two directors to the board, did not address investors' concerns.<a href=\"reuters://REALTIME/verb=Headlines/ric=L1N2UJ17Z\" data-type=\"newsExpression\" data-expression=\"L1N2UJ17Z\" translate=\"no\" dir=\"ltr\">L1N2UJ17Z</a></p><p>\"Foley has proven he is not suited to lead Peloton, whether as CEO or Executive Chair, and he should not be hand-picking directors, as he appears to have done (on Tuesday),\" Jason Aintabi, Blackwells' chief investment officer, said.</p><p>While Peloton has attracted interest from potential buyers including e-commerce giant Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and Nike Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=NKE.N\" data-type=\"ric\" data-ric=\"NKE.N\" translate=\"no\" dir=\"ltr\">NKE.N</a>, according to media reports, analysts have said the company might be a difficult takeover target as it has two classes of stock, effectively allowing insiders to control it.</p><p>Shares surged 28% in midday trading on Tuesday as the company reassured investors on a call that the benefits of the restructuring and pricing changes will be visible in the second half of fiscal 2022.</p><p>\"Wall Street likes the new Peloton CEO... so the stock is up again today anticipating that the new CEO will streamline the company and cut any waste,\" said Louis Navellier, chief investment officer for Navellier &amp; Associates.</p><p>\"As Peloton cleans up its balance sheet and cuts costs, it is definitely making itself a more attractive acquisition candidate.\"</p><p>As part of its costcutting effort, Peloton plans to lay off roughly 20% of its corporate workforce. The company plans to offer \"meaningful cash severance\", health care, career services and 12 months of free Peloton membership, Foley wrote in a letter to staff. All-access membership current costs $39 a month. The company's instructors will get to stay. </p><p><br/></p><p>DOWNHILL </p><p>Peloton's sales boomed during COVID-19 lockdowns, with many people snapping up home fitness equipment. But fortunes began to fade as vaccinations increased, gyms reopened and rivals offered competitive products.</p><p>The company responded by slashing prices to make its bikes more affordable but that did little to stem the slide.  </p><p>Peloton will also cut jobs, affecting 20% of its corporate positions, after announcing last month it was reviewing the size of its workforce. </p><p>The reductions will not affect its storied roster of fitness instructors and interactive online content. </p><p>The company on Tuesday reported a bigger-than-expected quarterly loss and slashed its forecast for full-year revenue, saying the lowered outlook was to adjust to changes in demand brought on by the reopening of economies.</p><p>Peloton will wind down the development of its planned factory in Ohio, where it was set to invest about $400 million and add more than 2,000 jobs over the next few years.</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Akriti Sharma, Subrat Patnaik, Bansari Mayur Kamdar, Devik Jain and Aishwarya Nair in Bengaluru and Svea Herbst-Bayliss in Boston; Writing by Sweta Singh; Editing by Devika Syamnath, Sriraj Kalluvila and Richard Pullin)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Akriti.Sharma@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Akriti.Sharma@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: PELOTON-CEO/ (UPDATE 7,PIX)</p></div>"}