{"date": "2021-11-29 21:39:18.460000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>POPREACH CORP (\"POPR-V;POPRF-0\")\n- Third Quarter 2021 Financial Results\n\n   PopReach Corporation (\"PopReach\" or the \"Company\"), a free-to-play game\npublisher focused on acquiring and optimizing proven game franchises, today\nannounced financial results for the three and nine months ended September\n30, 2021.\n\n   (All figures in US dollars, unless otherwise indicated)\n\n   Q3 2021 Financial Highlights\n\n//st\n\n* Revenue from mobile platforms (Apple, Google and Amazon) was $3.4 million\n  (80.1% of total revenue), compared to $3.5 million in Q2 2021 (78.3%),\n  and an increase from $2.7 million in Q3 2020 (63.8%)\n* Revenue of $4.2 million, compared to $4.4 million in Q2 2021, and $4.3\n  million in Q3 2020; overall revenue was impacted by an industry wide\n  decline in Facebook Canvas platform game activity\n* Gross profit margin decreased to 64.6%, from 65.3% in Q2 2021, and\n  improved from 61.8% in Q3 2020, driven by the ongoing execution of\n  operating cost reductions\n* Operating expenses of $3.5 million, compared to $3.1 million in Q2 2021,\n  and $2.7 million in Q3 2020; the increase in operating expenses is due to\n  increased user acquisition spend, and professional fees associated with\n  the proposed business combination with 2810735 Ontario Inc. d/b/a\n  Federated Foundry (\"Federated\")\n* EBITDA1 of $(0.1) million (-1.9% of revenue), compared to $0.4 million\n  (9.4%) in Q2 2021, and $0.9 million (20.8%) in Q3 2020\n* Adjusted EBITDA1 of $0.4 million (9.9% of revenue), compared to $0.6\n  million (13.3%) in Q2 2021, and $0.8 million (18.7%) in Q3 2020\n* Net loss of $1.1 million (($0.01) per basic and diluted share), compared\n  to a net income of $1.1 million ($0.01 per basic and diluted share) in Q2\n  2021, and a net loss of $0.5 million (($0.01) per basic and diluted\n  share) in Q3 2020\n* Cash used in operating activities in Q3 2021, net of working capital\n  changes, was $0.1 million, compared to cash generated from operating\n  activities of $0.5 million in Q2 2021, and $1.0 million in Q3 2020\n* Cash at September 30, 2021 was $11.6 million, compared to $18.1 million\n  at the end of 2020, and debt outstanding on the bank credit facility was\n  $5.4 million, compared to $6.0 million at the end of 2020; the decrease\n  in cash is due to payments relating to the Company's 2021 M&amp;A activities,\n  including professional fees associated with the proposed business\n  combination with Federated\n\n//et\n\n//st\n\n    1 Please refer to \"Non-GAAP Measures\" section of this press release\n\n//et\n\n   Q2 2021 and Subsequent Highlights\n\n//st\n\n* On August 16, 2021, the Company entered into a letter of intent (\"LOI\")\n  with Federated, an acquirer and operator of digital technology companies,\n  for a proposed business combination, pursuant to which the Company and\n  Federated will combine to form a leading, publicly-listed technology and\n  media enterprise through a reverse takeover of the Company by Federated\n  and its shareholders\n* On October 18, 2021, the Company entered into a definitive agreement in\n  relation to its proposed business combination with Federated, and\n  announced that it had voting support agreements in place with\n  shareholders holding in the aggregate approximately 50.5% of the issued\n  and outstanding PopReach Shares\n* On November 12, 2021, the Company soft launched the significant rebuild\n  of Smurfs Magic Match, with the game to be updated and improved in the\n  coming months\n* Also on November 12, 2021, the Company announced a closed beta for PAYDAY\n  Crime War which is on track to go live in December 2021; the Company is\n  pleased that it has more than doubled the expected number of sign-ups for\n  the closed beta, representing an important milestone for the game\n  expected to launch globally in 2022\n\n//et\n\n   Management Commentary\n\n   \"The 22% year over year growth we generated in mobile platform revenue\nduring the third quarter did not entirely offset the decline in revenue\nfrom Facebook Canvas games, but as we head into 2022 with our primary\nmobile growth initiatives well underway, these Facebook games that are in\nmaintenance mode will become less significant,\" said Jon Walsh, Co-founder\nand CEO of PopReach. \"We are making good progress on key mobile growth\ninitiatives, with the rebuilt version of Smurfs Magic Match now in soft\nlaunch, and our planned release of the PAYDAY Crime War closed beta coming\nin December. For PAYDAY, the initial response and pre-registrations to date\nhave far exceeded our expectations, and we are excited about the potential\nfor these products to generate outsized returns.\"\n\n   Added Christopher Locke, Co-founder and President of PopReach \"In\naddition, the proposed transaction with Federated Foundry is progressing\nwell, with the business combination expected to close in late January/early\nFebruary of 2022. Combining Federated's strong EBITDA and cash flow\ngeneration with PopReach's solid financial foundation will allow us to\ninvest in multiple growth catalysts across the combined businesses, and we\nare excited to move forward on opportunities that lie ahead, which include\na broadened M&amp;A purview.\"\n\n   Selected Quarterly Information\n\n   Below is selected quarterly information from the Company's consolidated\nfinancial statements for each of the quarterly periods indicated. The\nCompany's functional and presentation currency is US Dollars. Except where\nindicated, the following financial data is reported in accordance with\nIFRS.\n\n//st\n\n       Three months     Three      Three\n       ended    months     months\n       September 30     ended June     ended\n       2021     30 2021    September\n               30 2020\n\nIn-app purchases   $   3,978,677    $   4,177,682  $   4,185,045\n\nAdvertising    235,764      263,109    150,936\n\nOther      6,453    295    248\n\nTotal revenue  $   4,220,894    $   4,441,086  $   4,336,229\n\nNet Income     (1,069,782)  1,080,290  (518,459)\n(Loss)\n\nComprehensive  (1,060,310)  1,084,270  (485,231)\nIncome (Loss)\n\nEarnings (loss)    (0.01)   0.01   (0.01)\nper share\n(basic and\ndiluted)\n\nNon-GAAP1:\n\nBookings   4,414,894    4,667,189  4,156,652\n\nEBITDA     (79,102)     419,453    902,669\n\nAdjusted EBITDA    416,440      589,587    810,899\n\n//et\n\n//st\n\n    1 Please refer to \"Non-GAAP Measures\" section of this press release\n\n//et\n\n//st\n\n         September 30 2021   December 31 2020\n\n Cash and cash equivalents   $   11,582,698  $   18,097,649\n\n Current assets      14,130,470      20,079,201\n\n Total assets    27,788,275      25,934,531\n\n Current liabilities     6,471,296   7,879,809\n\n Non-current liabilities     6,314,665   5,534,564\n\n//et\n\n//st\n\n     Three months    Three months    Three months\n     ended   ended June  ended\n     September 30    30 2021     September 30\n     2021        2020\n\nApple    $   2,168,829   $   2,240,569   $   1,726,046\n\nFacebook     841,434     961,767     1,571,540\n\nGoogle   870,704     864,454     846,861\n\nAmazon   54,135      53,498      40,598\n\nOther mobile     43,575      57,394      --\n\nTotal in-app     3,978,677   4,177,682   4,185,045\npurchases\n\n//et\n\n   Financial Statements and MD&amp;A\n\n   PopReach's Financial Statements for the three and nine months ended\nSeptember 30, 2021, and Management's Discussion and Analysis (the \"MD&amp;A\")\nfor the three and nine months ended September 30, 2021, are posted on the\ncorporate website at <a href=\"https://www.popreach.com/financial-information\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.popreach.com/financial-information</a>/ and\navailable on the company's profile on SEDAR at www.sedar.com.\n\n   Non-GAAP Measures\n\n   The Company prepares its financial statements in accordance with IFRS.\nHowever, the Company considers certain non-GAAP financial measures as\nuseful additional information to assess its financial performance. These\nmeasures, which it believes are widely used by investors, securities\nanalysts and other interested parties to evaluate its performance, do not\nhave a standardized meaning prescribed by GAAP and therefore may not be\ncomparable to similarly titled measures presented by other publicly traded\ncompanies, nor should they be construed as an alternative to financial\nmeasures determined in accordance with IFRS. Non-GAAP measures include\n\"Bookings\", \"EBITDA\" and \"Adjusted EBITDA\".\n\n   EBITDA and adjusted EBITDA\n\n   Earnings before interest, taxes, depreciation and amortization\n(\"EBITDA\") and consolidated adjusted earnings before interest, taxes,\ndepreciation and amortization (\"Adjusted EBITDA\") are non-IFRS measures of\nfinancial performance. The presentation of these non-IFRS financial\nmeasures is not intended to be considered in isolation from, as a\nsubstitute for, or superior to, the financial information prepared and\npresented in accordance with IFRS, and may be different from non-IFRS\nfinancial measures used by other companies. Company management defines\nEBITDA as follows: IFRS Net income (loss) adding back accretion and\ninterest expenses (including amortization of deferred financing fees),\nincome taxes, amortization, gain/loss on disposal of assets, and fair value\ngain/loss on financial liabilities. Adjusted EBITDA is calculated as EBITDA\nand excludes discontinued operations and the effects of significant items\nof income and expenditure which may have an impact on the quality of\nearnings, such as restructuring costs and impairments where the impairment\nis the result of an isolated, non-recurring event. It also excludes the\neffects of equity-settled share-based payments, changes in deferred\nrevenues, and other extraordinary one-time expenses.\n\n   Management believes EBITDA and Adjusted EBITDA are useful financial\nmetrics to assess its operating performance on a cash basis before the\nimpact of non-cash items.\n\n   The following table presents the Company's calculation of EBITDA and\nAdjusted EBITDA for each period:\n\n//st\n\n       Three months    Three months    Three\n       ended   ended June  months\n       September 30    30 2021     ended\n       2021        September\n               30 2020\n\nNet loss   $   (1,069,782) $   1,080,290   $   (518,459)\n\nAdd:\n\nInterest and   213,749     145,734     207,941\naccretion\nexpenses\n\nLoss (gain) on     -       (4,212)     6,750\ndisposal of\nassets\n\nCurrent taxes  24,000      21,936      (13,058)\n(recovery)\n\nDeferred tax   (7,687)     (4,495)     (37,846)\nrecovery\n\nAmortization   474,220     491,663     743,314\n\nFair value loss    286,398     (1,311,463)     514,027\n(gain) on\nfinancial\nliabilities\n\nEBITDA     (79,102)    419,453     902,669\n\nAdd:\n\nShare-based    60,144      73,469      59,692\ncompensation\nexpense\n\nChange in      194,000     226,103     (179,577)\ndeferred revenue\n\nChange in      (81,075)    (139,560)   -\ndeferred cost\nof sales\n\nExtraordinary  322,473     10,122      28,115\none-time\nexpenses\n\nAdjusted EBITDA    416,440     589,587     810,899\n\nAdjusted   10%     13%     19%\nEBITDA/Revenue %\n\n//et\n\n    Adjusted EBITDA was $416,440 for the three months ended September 30,\n2021 compared to $810,899 for the three months ended September 30, 2020,\nwhich represents a decrease of $394,459 or 49%.\n\n   Non-operating items\n\n   Fair value loss on financial liabilities was $286,398 for the three\nmonths ended September 30, 2021 compared to a fair value loss of $514,027\nfor the three months ended September 30, 2020, and a fair value gain of\n$3,314,998 for the nine months ended September 30, 2021 compared to a fair\nvalue loss of $2,154,081 for the nine months ended September 30, 2020.\n\n   The full amount of the fair value gain of $3,314,998 nine months ended\nSeptember 30, 2021 related to the change in fair value of the warrant\nliability. As the share price of the Company increases, the fair value of\nthe warrant liability increases. Conversely, if the share price of the\nCompany decreases, the fair value of the warrant liability decreases.\n\n   Of the $2,154,081 loss for the nine months ended September 30, 2020, a\ngain of $16,993 was related to the change in fair value of contingent\nconsideration for certain game acquisitions, with the remaining loss also\nrelated to the fair value loss of the conversion feature and warrant\nliability. As the probability of the completion of the Qualifying\nTransaction increased, along with the valuation of the Company, the fair\nvalue of the conversion feature and warrants also increased.\n\n   Bookings\n\n   Bookings is a non-GAAP financial measure that is equal to revenue\nrecognized plus or minus the change in deferred revenue during the period.\nThe following table is the reconciliation from revenue to bookings for each\nperiod:\n\n//st\n\n     Three months    Three months    Three months\n     ended   ended June  ended\n     September 30    30 2021     September 30\n     2021        2020\n\nRevenue  $   4,220,894   $   4,441,086   $   4,336,229\n\nAdd: Increase    194,000     226,103     (179,577)\n(decrease) in\ndeferred\nrevenue\n\nTotal bookings   4,414,894   4,667,189   4,156,652\n\n//et\n\n   The decrease in bookings for the three months ended September 30, 2021\ncompared to the three months ended September 30, 2020 was due to the\nindustry wide decline of the Facebook Canvas platform, which the Company\ndoes not view as a driver of growth, as discussed in the Growth Platforms\nsection of \"Summary of Significant Developments\" of the MD&amp;A. The company\nalso continues to experience uncertainties around the impact of COVID-19 in\ngeneral but particularly in India, which has resulted in delayed content\nupdates and bug fixes relating to the live operations of the Company's\nentire portfolio of games, and the ongoing uncertainty around paid user\nacquisition costs resulting from Apple's IDFA policy change. Additionally,\nmanagement now believes that Q2 2020 was subject to an industry wide \"COVID\nlift\", as discussed in \"Seasonality\" section in the MD&amp;A.\n\n   About PopReach Corporation\n\n   PopReach, a Tier 1 Issuer on the TSX Venture Exchange, with shares also\ntrading on OTCQX(r) Best Market, is a free-to-play game publisher focused\non acquiring and optimizing proven franchises. The Company has to date\nacquired successful game franchises enjoyed by over 1.9 million unique\nplayers a month, including Smurfs' Village (IP under license), PAYDAY Crime\nWar (IP under license), Peak - Brain Training, Kitchen Scramble, Gardens of\nTime, City Girl Life, War of Nations and Kingdoms of Camelot. PopReach,\nheadquartered in Toronto, employs a team of over 130 experts in Toronto,\nVancouver, London, UK, and Bangalore, India.\n\n   Additional information about the Company is available at www.sedar.com\n\n   Forward-looking Information\n\n   Certain information in this news release constitutes forward-looking\nstatements and forward-looking information under applicable Canadian\nsecurities legislation (collectively, \"forward-looking information\").\nForward-looking information include, but are not limited to, statements\nwith respect to and the business, financials and operations of the Company.\nStatements containing forward-looking information are not historical facts\nbut instead represent management's expectations, estimates and projections\nregarding future events. Forward looking information is necessarily based\non a number of opinions, assumptions and estimates that, while considered\nreasonable by the Company as of the date of this news release, are subject\nto known and unknown risks, uncertainties, assumptions and other factors\nthat may cause the actual results, level of activity, performance or\nachievements and future events to be materially different from those\nexpressed or implied by such forward-looking information, including but not\nlimited to the factors described in greater detail in the public documents\nof the Company available at www.sedar.com. Although the Company has\nattempted to identify important risks, uncertainties and factors which\ncould cause actual results to differ materially, there may be others that\ncause results not to be as anticipated, estimated or intended. Investors\nare cautioned undue reliance should not be placed on any such information,\nas unknown or unpredictable factors could have material adverse effects on\nfuture results, performance or achievements of the Company. The Company\ndoes not intend, and does not assume any obligation, to update this\nforward-looking information except as otherwise required by applicable law.\n\n   Neither the TSX Venture Exchange nor its Regulation Services Provider\n(as that term is defined in the policies of the TSX Venture Exchange)\naccepts responsibility for the adequacy or accuracy of this release.\n\nDennis Fong, Investor Relations, (416) 283-9930,\ndennis.fong@loderockadvisors.com; PopReach Corporation, www.popreach.com,\nChristopher Locke, invest@popreach.com\n\nTel   : 416-583-5918    POPREACH CORP\nWWW   : <a href=\"https://www.popreach.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.popreach.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133200300.MNPRE2133201497-07051320211129</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}