{"date": "2021-11-25 19:37:12.734000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3580.41, "close": 3561.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Nov. 25 -- Amazon, Tata Tea and Asian Paints emerged as the most purposeful brands in India across technology, fast moving consumer goods (FMCG) and in non-FMCG categories respectively, according to findings of the Kantar's BrandZ India 2021 report released Thursday.</p><p>It is for the first time that research firm Kantar has focused on \"purpose\" as a key metric for brand salience in its rankings study. Kantar defines purpose as a combination of functional benefits but said that increasingly brands need to offer reassurance, safety, connection, and hope for the future. Such attributes make brands meaningful and different.</p></div><div class=\"tr-npp-body\"><p>The covid-19 pandemic has magnified the need for brands to do more than focus on profits alone, according to findings of the report. As India opens up, business and consumers are once again looking toward the future. Brands will need to articulate more unique visions of how exactly they plan to shape this future for the better, it said. This is especially true as brands are being judged by consumers on the political and social stands they take-though these can also draw criticism.</p><p>Kantar conducted an analysis of 418 brands across 30 categories in India in its eighth annual report and found that in India, especially, perceptions of a brand's purpose is crucial to establishing a brand's salience among consumers and \" boosting\" prospects for growth.</p><p>In a post-pandemic world, consumers in India expect to continue to look to brands to provide practical solutions in their everyday life-from promoting nutrition and hygiene, to saving time and managing stress. Consumers are also \"highly aware\" of issues --- from pandemics to climate change, prompting brands to be more engaged with the society and consumers at large.</p><p>Purpose as a contributor to brand equity is 10 times more important in India when compared to other markets globally, said Deepender Rana, executive managing director, South Asia, Insights Division, Kantar.</p><p>The rankings-split into three categories-rated technology, fast moving consumer goods as well as non-tech FMCG brands. It surveyed over 12,000 respondents. The database includes 28 attributes that makes a brand favourable to shoppers. For the first time, however, it spotlighted the most purposeful Indian brands across these business segments.</p><p>Within the technology ranking Amazon leads the index followed by Zomato, YouTube, and Google and Swiggy jointly in fourth place, followed by Flipkart. The non-FMCG ranking is dominated by telecom brands, with Samsung and Jio jointly ranked number two, followed by MRF, Tata Housing and Airtel. Tata Tea leads the FMCG category followed by Hindustan Unilever's detergent brand Surf Excel, tea brand Taj Mahal, Marico's Parachute and Nestle India's Maggi both in fourth position and Britannia completing the list.</p><p>According to Kantar BrandZ data, consumers believe that these brands lead with a clear sense of purpose to make their everyday lives better. \"It also exhibits those (brands) that have taken a bolder social stance, as covid-19 magnified the need for brands to do more than focus on profits alone. The findings tie in with longer-term trends in India and abroad to value brands on ESG criteria (environmental, social and governance) alongside traditional factors, such as valuations and earnings growth,\" it added.</p><p>The pandemic has prompted consumers re-examine their purpose in life. Similarly, brands also had to re-examine, what do they stand for and what do they deliver to consumers, beyond the idea of making profit for their shareholders, Rana said.</p><p>Soumya Mohanty, managing director -- Client and Quantitative, Insights Division, Kantarsaid that one route to purpose is through corporate social responsibility-which includes how brands behave towards the employees; their stakeholders, societal responsibility and environmental responsibility. The second route is through having well designed products and services that fit consumer needs and life.</p><p>However, Rana said purpose translating into one-off 'corporate charity' is insufficient to build long-term credibility. \"Instead, real purpose flows from, and builds on, a brand's existing core values and DNA. This reinforces the need to understand and measure if a brand's purpose is perceived as adding real meaning to consumers lives,\" he said.</p><p>For consumers in India to deem a brand purposeful-amplifying or communicating their \"purpose\" is critical. Meanwhile, for technology brands their ability to showcase and deliver on convenience helps.\"These brands have been able to scale-up and showcase a wide range of products plus enter new categories at a time when consumers were desperate for at-home and delivery solutions. Everyday convenience in turn made lives easier and fuelled saliency for brands,\" it said. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}