{"date": "2022-01-25 13:11:07.639000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Equitable Bank expands their Insurance Lending product offering with the addition of an Immediate Financing Arrangement (IFA) that requires no additional collateral</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">Equitable Bank expands their Insurance Lending product offering with the addition of an Immediate Financing Arrangement (IFA) that requires no additional collateral</p>\n<p>Canada NewsWire</p>\n<p>TORONTO, Jan. 28, 2022</p>\n<p>\n<span>TORONTO</span> , <span>Jan. 28, 2022</span> /CNW/ - Equitable Bank, <span>Canada's</span> Challenger Bank™, has introduced another Insurance Lending product for Canadians looking to borrow money while still preserving cash flow. The Equitable Bank Immediate Financing Arrangement (IFA) is the latest addition to the bank's Insurance Lending Solutions portfolio.</p>\n<p>\n\n</p>\n<p>Customers who hold or are in the process of obtaining a whole life policy with one of Equitable Bank's insurance partners can set up an IFA to access 100% of the total annual premium of their policy with no additional collateral requirements. This new lending option is a tax-free* way to maximize financial planning goals without interrupting cash flow or liquidity.</p>\n<p>\"Expanding our Insurance Lending Solutions suite, with the addition of the new Equitable Bank Immediate Financing Arrangement, continues our commitment to offer Canadians innovative products that help enrich their lives,\" said <span>Damon Knights</span> , Vice President of Sales and Distribution for Personal Banking at Equitable Bank. \"This most recent addition allows people to establish life insurance to protect their loved ones while still maintaining cash flow for their other investment or business opportunities. We know the needs and specific life scenarios of Canadians are varied and we continue to create smart borrowing solutions that meet those wide-ranging needs.\"</p>\n<p>Canadian residents** who are age of majority and hold a whole life policy with one of Equitable Bank's insurance partners are eligible to apply for an Immediate Financing Arrangement.</p>\n<p>Equitable Bank's Insurance Lending Solutions portfolio also includes CSV FLEX and CSV MAX Line of Credit products, which complement this most recent Immediate Financing Arrangement (IFA) offering. The full suite of Insurance Lending products provides access to innovative solutions that give policyholders of all stages of life tax-free cash flow opportunities. An Equitable Bank Insurance Lending Solution can provide whole life policyholders with an alternative source of liquidity rather than selling investments or other liquid assets.</p>\n<p>Visit <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3426940-1&amp;h=2734348167&amp;u=http%3A%2F%2Fwww.equitablebank.ca%2Flines-of-credit%2Fcsv&amp;a=www.equitablebank.ca%2Flines-of-credit%2Fcsv\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.equitablebank.ca/lines-of-credit/csv</a> to learn more and connect with your financial or insurance advisor to decide if the Equitable Bank Insurance Lending Suite is the right solution for you. A full list of partner insurers can be found on the Equitable Bank <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3426940-1&amp;h=886036157&amp;u=https%3A%2F%2Fwww.equitablebank.ca%2Flines-of-credit%2Fcsv%2Four-partnered-insurers&amp;a=website\" data-type=\"url\" class=\"tr-link\" translate=\"no\">website</a> .</p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td colspan=\"1\">\n<p>\n<span>\n<span>\n<span>*Consult with your financial advisor to discuss your unique tax situation and the tax-free benefits of an Equitable Bank IFA.</span>\n</span>\n<span>\n<span>**Not available to residents of Quebec.</span>\n</span>\n</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>About Equitable Bank Wealth Solutions</span> Equitable Bank offers a suite of solutions tailored to individual clients' financial needs, for every stage in life. From a wide range of Canadian and U.S. dollar deposit products, including short- and long-term GICs, one-year cashable GICs, and high interest savings accounts, to asset decumulation through reverse mortgages and insurance lending solutions, Equitable helps investor clients reduce portfolio volatility, grow savings, and find solutions that work for them.</p>\n<p>\n<span>About Equitable</span> Equitable Group Inc. (\"Equitable\") trades on the Toronto Stock Exchange (TSX: EQB and EQB.PR.C) and serves over three hundred thousand Canadians through its wholly owned subsidiary Equitable Bank, <span>Canada's</span> Challenger Bank™. Equitable Bank (the \"Bank\") has grown to become the country's eighth largest independent Schedule I bank with a clear mandate to drive real change in Canadian banking to enrich people's lives. Founded over 50 years ago, Equitable Bank provides diversified personal and commercial banking and through its EQ Bank platform (eqbank.ca) has been named #1 Bank in <span>Canada</span> on the Forbes World's Best Banks 2021 list. Please visit equitablebank.ca for details.</p>\n<p>SOURCE Equitable Bank</p>\n<p>View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/January2022/28/c1352.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/January2022/28/c1352.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}