{"date": "2022-01-17 23:53:47.114000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>SPRINGFIELD, Ill. (AP) — The family of a delivery driver who died last month when a tornado collapsed the central Illinois Amazon facility where he worked filed a wrongful death lawsuit Monday in Madison County.</p><p>The action on behalf of Austin McEwen, 26, claims that Amazon failed to warn employees of dangerous weather or provide safe shelter before a tornado slammed the Edwardsville facility Dec. 10, killing McEwen and five others.</p></div><div class=\"tr-npp-body\"><p>It is believed to be the first legal action taken in response to the deaths. The Occupational Safety and Health Administration has opened an investigation.</p><p>McEwen's parents, Randy and Alice McEwen, allege that Amazon administrators knew severe weather was imminent but had no emergency plan nor evacuated employees from the fulfillment center.</p><p>\"Sadly, it appears that Amazon placed profits first during this holiday season instead of the safety of our son and the other five,\" Alice McEwen said at a news conference Monday.</p><p>Amazon \"carelessly required individuals ... to continue working up until the moments before the tornado struck,\" the lawsuit says, and \"improperly directed\" McEwen and colleagues to shelter in a rest room, which it says the company knew or should have known wasn't safe.</p><p>\"They had people working up to the point of no return,\" said Jack Casciato, the McEwens' lawyer who is a partner of Clifford Law Offices.</p><p>Amazon spokeswoman Kelly Nantel released a statement that countered that the lawsuit \"misunderstands key facts\" including the differences among severe weather alerts and the condition and safety of the building.</p><p>\"This was a new building less than four years old, built in compliance with all applicable building codes, and the local teams were following the weather conditions closely,\" Nantel said. \"Severe weather watches are common in this part of the country and, while precautions are taken, are not cause for most businesses to close down. We believe our team did the right thing as soon as a warning was issued.\"</p><p>The lawsuit seeks more than $50,000 from each of the four defendants named in the suit, which includes <a href=\"http://Amazon.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com</a> , the construction company that built the facility and the project's developer.</p><p>Nantel said the company would defend itself against the lawsuit but would continue to focus on \"supporting our employees and partners, the families who lost loved ones, the surrounding community, and all those affected by the tornadoes.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.</p></div>"}