{"date": "2022-01-04 11:40:11.519000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p> <br/>   By Ujjwal Narayan<br/>NewsRise<br/>   NEW DELHI (Jan 4) -- The Delhi High Court today dismissed Future Group’s plea seeking directions to terminate ongoing arbitration proceedings with Amazon at Singapore court, after the competition watchdog last month suspended approval for a 2019 deal between the two companies, a lawyer said.<br/><br/>The order deals a blow to debt-laden Future Group, which last year agreed to sell its retail, wholesale, warehousing, and logistics businesses to billionaire Mukesh Ambani’s Reliance Industries in a $3.4 billion deal. However, the deal has been dragging due to a long-drawn legal dispute with Amazon. The deal with Reliance is crucial for Future Group that is in danger of liquidation.<br/><br/>Amazon had bought a 49% stake in Future Coupons that owns 7.3% shareholding in Future Retail.  Amazon challenged Future’s proposed sale in Singapore arbitration court, citing alleged violation of contractual agreements.<br/><br/>Last month, the Competition Commission of India (CCI) kept its approval for the 2019 deal on hold, accusing the U.S. e-commerce company of hiding information while filing for regulatory approval.<br/><br/>The antitrust body accused Amazon of concealing its strategic interest over the company, saying the U.S. company \"suppressed the actual scope\" of deal and made \"false and incorrect statements.\"<br/><br/>Late last month, Future Group urged the Singapore tribunal to terminate proceedings after the CCI order suspended the deal. The tribunal agreed to hear Future Group’s plea only after the main hearing in the arbitration case between Jan. 5 and 7, following which the Indian company approached the Delhi High Court.<br/>   - By Ujjwal Narayan; Ujjwal.Narayan@newsrise.org; 01166767700<br/>- Edited by Dhanya Ann Thoppil<br/>- Send Feedback to feedback@NewsRise.org<br/>- Copyright (c) 2022 NewsRise Financial Research &amp; Information Services Pvt. Ltd.<br/>    </p></div>"}