{"date": "2020-12-10 07:00:07+00:00", "ticker": "AVV", "mrkt_info": {"open": 3249.0, "close": 3256.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent h1{margin-top:12.0pt;margin-right:0cm;margin-bottom:0cm;margin-left:0cm;margin-bottom:.0001pt;font-size:16.0pt;font-weight:normal;}.storyContent h2{margin-top:2.0pt;margin-right:0cm;margin-bottom:0cm;margin-left:0cm;margin-bottom:.0001pt;font-size:13.0pt;font-weight:normal;}.storyContent h3{margin-top:2.0pt;margin-right:0cm;margin-bottom:0cm;margin-left:0cm;margin-bottom:.0001pt;font-size:12.0pt;font-weight:normal;}.storyContent h4{margin-top:12.0pt;margin-right:0cm;margin-bottom:3.0pt;margin-left:43.2pt;text-indent:-7.2pt;font-size:14.0pt;font-weight:bold;}.storyContent h5{margin-top:12.0pt;margin-right:0cm;margin-bottom:3.0pt;margin-left:50.4pt;text-indent:-21.6pt;font-size:13.0pt;font-weight:bold;}.storyContent h6{margin-top:12.0pt;margin-right:0cm;margin-bottom:3.0pt;margin-left:57.6pt;text-indent:-21.6pt;font-size:11.0pt;font-weight:bold;}.storyContent p{margin:0cm;margin-bottom:.0001pt;font-size:12.0pt;}.storyContent address{margin:0cm;margin-bottom:.0001pt;font-size:10.0pt;}.storyContent ol{margin-bottom:0cm;}.storyContent ul{margin-bottom:0cm;}.storyContent .lc{margin:72.0pt 90.0pt 72.0pt 90.0pt;}.storyContent p.mg{margin:0cm;margin-bottom:.0001pt;text-autospace:none;font-size:12.0pt;text-align:justify;}.storyContent span.me{font-size:10.0pt;}.storyContent p.mh{margin:0cm;margin-bottom:.0001pt;font-size:12.0pt;text-align:justify;}.storyContent p.mi{margin:0cm;margin-bottom:.0001pt;font-size:10.5pt;text-align:justify;}.storyContent span.mc{font-size:10.0pt;}.storyContent p.mj{margin:0cm;margin-bottom:.0001pt;font-size:9.0pt;text-align:justify;}.storyContent span.mk{font-weight:bold;}.storyContent span.mb{font-size:10.0pt;}.storyContent p.ml{margin:0cm;margin-bottom:.0001pt;font-size:9.0pt;text-align:center;}.storyContent span.lw{font-size:10.0pt;}.storyContent span.lt{font-size:10.0pt;}.storyContent span.ls{font-size:10.0pt;}.storyContent p.mm{margin-right:0cm;margin-left:0cm;font-size:12.0pt;margin-top:.2pt;margin-right:5.1pt;margin-bottom:6.0pt;margin-left:0cm;text-align:justify;line-height:12.0pt;}.storyContent span.mn{font-size:10.0pt;}.storyContent p.mo{margin-right:0cm;margin-left:0cm;font-size:12.0pt;margin-top:12.0pt;margin-right:5.0pt;margin-bottom:6.0pt;margin-left:0cm;text-align:justify;line-height:12.0pt;}.storyContent p.mp{margin-right:0cm;margin-left:0cm;font-size:12.0pt;margin-top:.05pt;margin-right:5.25pt;margin-bottom:6.0pt;margin-left:0cm;text-align:justify;line-height:11.8pt;}.storyContent p.mq{margin-right:0cm;margin-left:0cm;font-size:12.0pt;margin-top:12.0pt;margin-right:5.1pt;margin-bottom:6.0pt;margin-left:0cm;text-align:justify;line-height:12.0pt;}.storyContent span.li{font-size:10.0pt;}.storyContent span.mr{letter-spacing:-.35pt;}.storyContent span.ms{letter-spacing:-.2pt;}.storyContent span.mt{letter-spacing:-.3pt;}.storyContent span.mu{letter-spacing:-.1pt;}.storyContent span.mv{letter-spacing:-.2pt;}.storyContent span.mw{font-size:10.0pt;}.storyContent p.mx{margin-right:0cm;margin-left:0cm;font-size:12.0pt;margin-top:12.0pt;margin-right:5.25pt;margin-bottom:6.0pt;margin-left:0cm;text-align:justify;line-height:12.0pt;}.storyContent span.lf{font-size:10.0pt;}.storyContent p.my{margin:0cm;margin-bottom:.0001pt;font-size:12.0pt;font-weight:bold;text-align:justify;}.storyContent p.mz{margin:0cm;margin-bottom:.0001pt;font-size:12.0pt;text-align:justify;}</style><div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><div style=\"text-align:left;font-size:10pt\"><div>RNS Number : 1460I</div>  <div>AVEVA Group PLC</div>  <div>10 December 2020</div>  <div> </div></div>\n<div class=\"lc\">\n<p class=\"mg\"><span class=\"me\">NOT FOR RELEASE, PUBLICATION OR DISTRIBUTION IN WHOLE OR IN PART IN OR INTO THE UNITED STATES, AUSTRALIA, CANADA, NEW ZEALAND, JAPAN, SINGAPORE, SOUTH AFRICA OR ANY OTHER JURISDICTION WHERE TO DO SO WOULD BE UNLAWFUL. THIS ANNOUNCEMENT IS FOR INFORMATION PURPOSES ONLY AND IS NOT AN OFFER OF SECURITIES IN ANY JURISDICTION.</span></p>\n<p class=\"mh\"><span class=\"me\"> </span></p>\n<p class=\"mg\"><span class=\"me\">THIS ANNOUNCEMENT IS AN ADVERTISEMENT AND DOES NOT CONSTITUTE A PROSPECTUS OR PROSPECTUS EQUIVALENT DOCUMENT. NOTHING IN THIS ANNOUNCEMENT SHOULD BE INTERPRETED AS A TERM OR CONDITION OF THE RIGHTS ISSUE. ANY DECISION TO PURCHASE, SUBSCRIBE FOR, OTHERWISE ACQUIRE, SELL OR OTHERWISE DISPOSE OF ANY RIGHTS ISSUE SHARES MUST BE MADE ONLY ON THE BASIS OF THE INFORMATION CONTAINED IN THE PROSPECTUS. COPIES OF THE PROSPECTUS ARE AVAILABLE AT <a href=\"HTTPS://INVESTORS.AVEVA.COM\" data-type=\"url\" class=\"tr-link\" translate=\"no\">HTTPS://INVESTORS.AVEVA.COM</a>.</span></p>\n<p class=\"mh\"><span class=\"me\"> </span></p>\n<p class=\"mi\"><span class=\"mc\">10 December 2020</span></p>\n<p class=\"mi\"><span class=\"mc\"> </span></p>\n<p class=\"mj\"><span class=\"mk\"><span class=\"mb\"> </span></span></p>\n<p class=\"ml\"><span class=\"mk\"><span class=\"lw\">AVEVA GROUP PLC</span></span></p>\n<p class=\"ml\"><span class=\"mk\"><span class=\"lw\"> </span></span></p>\n<p class=\"ml\"><span class=\"mk\"><span class=\"mc\">RESULTS OF RIGHTS ISSUE</span></span></p>\n<p class=\"mh\"><span class=\"mk\"><span class=\"lt\"> </span></span></p>\n<p class=\"mh\"><span class=\"ls\"> </span></p>\n<p class=\"mm\"><span class=\"mn\">AVEVA Group plc (\"AVEVA\" or the \"Company\") announces that the 7 for 9 rights issue of 125,739,796 Rights Issue Shares at 2,255 pence per Rights Issue Share announced on 6 November 2020 (the \"Rights Issue\") closed for acceptances at 11.00 a.m. on 9 December 2020. The Company received valid acceptances in respect of 124,614,787 Rights Issue Shares, representing approximately 99.1 per cent. of the total number of Rights Issue Shares to be issued pursuant to the fully committed and underwritten Rights Issue.</span></p>\n<p class=\"mo\"><span class=\"mn\">It is expected that the Rights Issue Shares in uncertificated form will be credited to CREST accounts by no later than today and that definitive share certificates in respect of Rights Issue Shares held in certificated form will be despatched by no later than 23 December 2020.</span></p>\n<p class=\"mp\"><span class=\"mn\">It is expected that the Rights Issue Shares will commence trading, fully paid, on the London Stock Exchange plc's main market for listed securities at 8.00 a.m. (London time) today.</span></p>\n<p class=\"mq\"><span class=\"li\">In<span class=\"mr\"> </span>accordance<span class=\"ms\"> </span>with<span class=\"ms\"> </span>their<span class=\"ms\"> </span>obligations<span class=\"mt\"> </span>as<span class=\"mt\"> </span>underwriters in respect of the Rights Issue as set out in the combined prospectus and circular dated 6 November 2020 (the \"Prospectus\"),<span class=\"mu\"> </span>J.P. Morgan Securities plc, Numis Securities Limited, Barclays Bank PLC, BNP PARIBAS, and Banco Santander S.A. (the \"Underwriters\")<span class=\"mv\"> </span>will<span class=\"mt\"> </span>use reasonable endeavours to procure, on behalf of the Company, subscribers for the remaining 1,125,009 </span><span class=\"mw\">Rights Issue Shares not taken up by Qualifying Shareholders (including the Rights Issue Shares in respect of certain Shareholders with registered addresses, or who are resident or located, in the United States or any of the Excluded Territories and the Rights Issue Shares representing the aggregate of fractions as a result of the Rights Issue), failing which the Underwriters have agreed to subscribe themselves for (in the agreed proportions), on a several basis, or procure that sub-underwriters acquire,  any remaining Rights Issue Shares at the Rights Issue Price.</span></p>\n<p class=\"mq\"><span class=\"mn\">The net proceeds from the placing of such Rights Issue Shares (after the deduction of the Rights Issue Price of 2,255 pence per Rights Issue Share and the expenses of procuring subscribers) will be paid to the relevant Qualifying Shareholders pro-rated, except that individual amounts of less than £5.00 per holding will not be paid to such persons but will ultimately accrue for the benefit of the Company.</span></p>\n<p class=\"mx\"><span class=\"mn\">A further announcement as to the number of Rights Issue Shares for which subscribers have been procured will be made in due course.</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">Unless the context otherwise requires, words and expressions defined in the Prospectus shall have the same meanings in this announcement.</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"my\"><span class=\"lf\">Enquiries:</span></p>\n<p class=\"my\"><span class=\"lf\"> </span></p>\n<p class=\"my\"><span class=\"lf\">AVEVA Group plc</span></p>\n<p class=\"mh\"><span class=\"lf\">Matt Springett (Head of Investor Relations)</span></p>\n<p class=\"mh\"><span class=\"lf\">Tel: +44 7789 818 684</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"my\"><span class=\"lf\">Lazard</span></p>\n<p class=\"mz\"><span class=\"lf\">Financial Adviser to AVEVA</span></p>\n<p class=\"mh\"><span class=\"lt\">Cyrus Kapadia</span></p>\n<p class=\"mh\"><span class=\"lt\">Keiran Wilson</span></p>\n<p class=\"mh\"><span class=\"lt\">Tel: +44 20 7187 2000</span></p>\n<p class=\"mh\"><span class=\"lt\"> </span></p>\n<p class=\"my\"><span class=\"lf\">Numis Securities</span></p>\n<p class=\"mz\"><span class=\"lf\">Joint Corporate Broker and Sponsor to AVEVA, Joint Global Co-ordinator and Joint Bookrunner</span></p>\n<p class=\"mh\"><span class=\"lf\">Simon Willis</span></p>\n<p class=\"mh\"><span class=\"lf\">Jamie Loughborough</span></p>\n<p class=\"mh\"><span class=\"lf\">Jonny Abbott</span></p>\n<p class=\"mh\"><span class=\"lf\">Jono Mawson</span></p>\n<p class=\"mh\"><span class=\"lf\">Tel: +44 20 7260 1000</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"my\"><span class=\"lf\">J.P. Morgan Cazenove</span></p>\n<p class=\"mz\"><span class=\"lf\">Joint Corporate Broker to AVEVA, Joint Global Co-ordinator and Joint Bookrunner</span></p>\n<p class=\"mh\"><span class=\"lf\">Bill Hutchings</span></p>\n<p class=\"mh\"><span class=\"lf\">Ed Digby</span></p>\n<p class=\"mh\"><span class=\"lf\">Tel: +44 20 7742 4000</span></p>\n<p class=\"my\"><span class=\"lf\"> </span></p>\n<p class=\"my\"><span class=\"lf\">FTI Consulting LLP</span></p>\n<p class=\"mz\"><span class=\"lf\">PR Adviser to AVEVA</span></p>\n<p class=\"mh\"><span class=\"lf\">Edward Bridges</span></p>\n<p class=\"mh\"><span class=\"lf\">Dwight Burden</span></p>\n<p class=\"mh\"><span class=\"lf\">Tel: +44 20 3727 1017</span></p>\n<p class=\"my\"><span class=\"lf\"> </span></p>\n<p class=\"my\"><span class=\"lf\">Important Notices</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">This announcement has been issued by and is the sole responsibility of the Company. The information contained in this announcement is for background purposes only and does not purport to be full or complete. No reliance may or should be placed by any person for any purpose whatsoever on the information contained in this announcement or on its accuracy or completeness. The information in this announcement is subject to change.</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">This announcement is not a prospectus but an advertisement. Neither this announcement nor anything contained in it shall form the basis of, or be relied upon in conjunction with, any offer or commitment whatsoever in any jurisdiction. Investors should not acquire any Rights Issue Shares referred to in this announcement except on the basis of the information contained in the Prospectus published by the Company in connection with the Rights Issue and the Acquisition.</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">A copy of the Prospectus is available on the Company's website at <span>https://investors.aveva.com</span>. Neither the content of the Company's website nor any website accessible by hyperlinks on the Company's website is incorporated in, or forms part of, this announcement. The Prospectus provides further details of the Rights Issue Shares, the Nil Paid Rights and the Fully Paid Rights offered pursuant to the Rights Issue.</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">This announcement (and the information contained herein) is not for release, publication or distribution, directly or indirectly, in whole or in part, in, into or within the United States of America, its territories and possessions, any State of the United States or the District of Columbia (collectively, the \"United States\"). This announcement is for informational purposes only and is not an offer of securities for sale in the United States. Securities may not be offered or sold in the United States absent registration under the US Securities Act of 1933, as amended (the \"US Securities Act\"), or an exemption therefrom. The Nil Paid Rights, Fully Paid Rights and Rights Issue Shares referred to herein have not been and will not be registered under the US Securities Act or under the securities laws of any state or other jurisdiction of the United States, and may not be offered or sold, taken up, resold, transferred or delivered in the United States except pursuant to an exemption from, or in a transaction not subject to, the registration requirements of the US Securities Act and in accordance with any applicable securities laws of any state or other jurisdiction of the United States. There will be no public offer of the Nil Paid Rights, Fully Paid Rights and Rights Issue Shares in the United States.</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">This announcement (and the information contained herein) and the Prospectus do not constitute a prospectus pursuant to the Swiss Financial Services Act (\"FinSA\"), and neither this announcement nor the Prospectus may be distributed or otherwise made available in Switzerland in a manner which would require the publication of a prospectus pursuant to the FinSA in Switzerland. The Rights Issue Shares may not be publicly offered directly or indirectly in or into Switzerland within the meaning of the FinSA, except: (a) to any investor that qualifies as a professional client within the meaning of the FinSA; (b) to fewer than 500 investors (other than professional clients within the meaning of the FinSA); or (c) in any other circumstances falling within article 36 of the FinSA, provided, in each case, that no such offer referred to in (a) through (c) above shall require the publication of a prospectus pursuant to the FinSA. The Rights Issue Shares will not be listed or admitted to trading on any trading venue in Switzerland.</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">No prospectus has been or will be filed with any securities commission or similar regulatory authority in Canada in connection with the offer and sale of securities. Any offer and sale of securities in Canada will be made on a private placement basis only in accordance with the terms and conditions set out in the Prospectus, is exempt from the requirement that the issuer prepares and files a prospectus under applicable Canadian securities laws and is available only to investors that: (a) purchase as principal, or are deemed to be purchasing as principal in accordance with applicable Canadian securities laws, for investment only and not with a view to resale or redistribution; (b) are \"accredited investors\" as such term is defined in section 1.1 of National Instrument 45-106 Prospectus Exemptions  or, in Ontario, as such term is defined in section 73.3(1) of the Securities Act (Ontario); and (c) are \"permitted clients\" as such term is defined in section 1.1 of National Instrument 31-103 Registration Requirements, Exemptions and Ongoing Registrant Obligations.</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">The information contained in this announcement and the Prospectus is not for release, publication or distribution to persons in the United States, Australia, Canada, New Zealand, Japan, Singapore, South Africa or any other jurisdiction where the extension or availability of the Rights Issue (and any other transaction contemplated thereby) would breach any applicable law or regulation, and, subject to certain exceptions, should not be distributed, forwarded to or transmitted in or into any jurisdiction, where to do so might constitute a violation of local securities laws or regulations.</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">The distribution of this announcement, the Prospectus and the offering or transfer of Rights Issue Shares into jurisdictions other than the United Kingdom may be restricted by law, and, therefore, persons into whose possession this announcement, the Prospectus and/or any accompanying documents comes should inform themselves about and observe any such restrictions. Any failure to comply with any such restrictions may constitute a violation of the securities laws of such jurisdiction. In particular, subject to certain exceptions, this announcement, the Prospectus should not be distributed, forwarded to or transmitted in or into the United States, Australia, Canada, New Zealand, Japan, Singapore, South Africa or any other jurisdiction where the extension or availability of the Rights Issue (and any other transaction contemplated thereby) would breach any applicable law or regulation. Recipients of this announcement and/or the Prospectus should conduct their own investigation, evaluation and analysis of the business, data and property described in this announcement and/or the Prospectus.</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">This announcement does not constitute a recommendation concerning any investor's options with respect to the Rights Issue. The price and value of securities can go down as well as up. Past performance is not a guide to future performance. The contents of this announcement are not to be construed as legal, business, financial or tax advice. Each shareholder or prospective investor should consult his, her or its own legal adviser, business adviser, financial adviser or tax adviser for legal, financial, business or tax advice. </span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"my\"><span class=\"lf\">Notice to all investors</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">Lazard &amp; Co., Limited (\"Lazard\"), which is authorised and regulated in the United Kingdom by the Financial Conduct Authority (the \"FCA\"), is acting exclusively as financial adviser to AVEVA and no one else in connection with the Rights Issue and the Acquisition and will not regard any other person (whether or not a recipient of this announcement) as a client in relation to the Rights Issue or the Acquisition and will not be responsible to anyone other than AVEVA for providing the protections afforded to the clients of Lazard nor for giving advice in relation to the Rights Issue, the Acquisition or any transaction, arrangement or any other matters referred to in this announcement. </span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">Numis Securities Limited (\"Numis\"), which is authorised and regulated in the United Kingdom by the FCA, is acting exclusively as sponsor, joint broker, joint global co-ordinator and joint bookrunner to AVEVA and no one else in connection with the Rights Issue and the Acquisition and will not regard any other person (whether or not a recipient of this announcement) as a client in relation to the Rights Issue or the Acquisition and will not be responsible to anyone other than AVEVA for providing the protections afforded to the clients of Numis nor for giving advice in relation to the Rights Issue or the Acquisition or any transaction, arrangement or any other matter referred to in this announcement.</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">J.P. Morgan Securities plc (which conducts its UK investment banking business as J.P. Morgan Cazenove), which is authorised in the United Kingdom by the Prudential Regulation Authority (the \"PRA\") and regulated in the United Kingdom by the FCA and the PRA, is acting exclusively as joint broker, joint global co-ordinator and joint bookrunner to AVEVA and no one else in connection with the Rights Issue and will not regard any other person (whether or not a recipient of this announcement) as a client in relation to the Rights Issue and will not be responsible to anyone other than AVEVA for providing the protections afforded to the clients of J.P. Morgan Cazenove nor for giving advice in relation to the Rights Issue or any transaction, arrangement or any other matter referred to in this announcement.</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">Barclays Bank PLC (\"Barclays\"), which is authorised in the United Kingdom by the PRA and regulated in the United Kingdom by the FCA and the PRA, is acting exclusively for AVEVA and no one else in connection with the Rights Issue and will not regard any other person (whether or not a recipient of this announcement) as a client in relation to the Rights Issue and will not be responsible to anyone other than AVEVA for providing the protections afforded to the clients of Barclays nor for giving advice in relation to the Rights Issue or any transaction, arrangement or any other matter referred to in this announcement.</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">BNP PARIBAS, which is lead supervised by the European Central Bank (\"ECB\") and the Autorité de Contrôle Prudentiel et de Résolution (\"ACPR\") (and its London Branch is authorised by the ECB, the ACPR and the PRA and subject to limited regulation by the FCA and the PRA), is acting exclusively for AVEVA and no one else in connection with the Rights Issue and will not regard any other person (whether or not a recipient of this announcement) as a client in relation to the Rights Issue and will not be responsible to anyone other than AVEVA for providing the protections afforded to the clients of BNP PARIBAS nor for giving advice in relation to the Rights Issue or any transaction, arrangement or any other matter referred to in this announcement.</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">Banco Santander S.A. (\"Santander\"), which is authorised by the Bank of Spain and is enrolled in the Administrative Register of the Bank of Spain with number 0049, and is subject to supervision by the ECB and by the Bank of Spain, and subject to limited regulation in the United Kingdom by the FCA and the PRA, is acting exclusively for AVEVA and no one else in connection with the Rights Issue and will not regard any other person (whether or not a recipient of this announcement) as a client in relation to the Rights Issue and will not be responsible to anyone other than AVEVA for providing the protections afforded to the clients of Santander nor for giving advice in relation to the Rights Issue or any transaction, arrangement or any other matter referred to in this announcement. </span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">Apart from the responsibilities and liabilities, if any, which may be imposed on Lazard and the Underwriters by the Financial Services and Markets Act 2000, as amended (\"FSMA\") or the regulatory regime established thereunder or under the regulatory regime of any jurisdiction where the exclusion of liability under the relevant regulatory regime would be illegal, void or unenforceable, none of Lazard, the Underwriters, nor any of their respective affiliates, directors, officers, employees or advisers, accepts any responsibility or liability whatsoever nor makes any representation or warranty, express or implied concerning the contents of this announcement, including its accuracy, completeness or verification, or regarding the legality of any investment in the Rights Issue Shares, the Nil Paid Rights or the Fully Paid Rights by any person under the laws applicable to such person, or concerning any other statement made or purported to be made by AVEVA, or on AVEVA's behalf, or by any of Lazard or the Underwriters, or on behalf of any of Lazard or the Underwriters in connection with AVEVA, the Rights Issue Shares, the Nil Paid Rights, the Fully Paid Rights, the Rights Issue or the Acquisition and nothing in this announcement is or shall be relied upon as a promise or representation in this respect, whether as to the past, present or future. To the fullest extent permitted by law, each of Lazard, the Underwriters and their respective affiliates, directors, officers, employees and advisers accordingly disclaim all and any duty, liability or responsibility whatsoever (whether direct or indirect, whether in contract, in tort, under statute or otherwise) which they might otherwise have in respect of this announcement or any such statement.</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">In connection with the Rights Issue, the Underwriters and any of their respective affiliates may, in accordance with applicable legal and regulatory provisions, take up a portion of the Rights Issue Shares as a principal position and in that capacity may retain, purchase, sell, offer to sell or otherwise deal for their own account in the securities of AVEVA and related or other securities and instruments (including Rights Issue Shares) and may offer or sell such securities other than in connection with the Rights Issue. Accordingly, references in this document to Rights Issue Shares being offered should be read as including any offering of Rights Issue Shares to any of the Underwriters or any of their respective affiliates acting in such capacity. In addition, certain Underwriters or their affiliates may enter into financing arrangements (including margin loans) with investors in connection with which such Underwriters (or their affiliates) may from time to time acquire, hold or dispose of Rights Issue Shares. Except as required by applicable law or regulation, none of the Underwriters or their respective affiliates propose to make any public disclosure in relation to such transactions. </span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">In the event that the Underwriters acquire Rights Issue Shares which are not taken up by Qualifying Shareholders, the Underwriters may co-ordinate disposals of such shares in accordance with applicable law and regulation. Except as required by applicable law or regulation, the Underwriters and their respective affiliates do not propose to make any public disclosure in relation to such transactions.</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">Ashurst LLP is acting as legal adviser to AVEVA in connection with the Rights Issue.</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"my\"><span class=\"lf\">Information to Distributors</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">Solely for the purposes of the product governance requirements contained within: (a) EU Directive 2014/65/EU on markets in financial instruments, as amended (\"MiFID II\"); (b) Articles 9 and 10 of Commission Delegated Directive (EU) 2017/593 supplementing MiFID II; and (c) local implementing measures (together, the \"MiFID II Product Governance Requirements\"), and disclaiming all and any liability, whether arising in tort, contract or otherwise, which any \"manufacturer\" (for the purposes of the MiFID II Product Governance Requirements) may otherwise have with respect thereto, the Rights Issue Shares, the Nil Paid Rights and the Fully Paid Rights have been subject to a product approval process, which has determined that such securities are: (x) compatible with an end target market of investors who meet the criteria of retail and professional clients and eligible counterparties, each as defined in MiFID II; and (y) eligible for distribution through all distribution channels as are permitted by MiFID II (the \"Target Market Assessment\").</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">Notwithstanding the Target Market Assessment, distributors should note that: the price of the Rights Issue Shares may decline and investors could lose all or part of their investment, the Rights Issue Shares offer no guaranteed income and no capital protection; and an investment in the Rights Issue Shares is compatible only with investors who do not need a guaranteed income or capital protection, who (either alone or in conjunction with an appropriate financial or other adviser) are capable of evaluation the merits and risks of such an investment and who have sufficient resources to be able to bear any losses that may result therefrom. The Target Market Assessment is without prejudice to the requirements of any contractual, legal or regulatory selling restrictions in relation to the Rights Issue. Furthermore, it is noted that, notwithstanding the Target Market Assessment, the Underwriters will only procure investors who meet the selling restrictions including the criteria of professional clients and eligible counterparties. </span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">For the avoidance of doubt, the Target Market Assessment does not constitute: (a) an assessment of suitability or appropriateness for the purposes of MiFID II; or (b) a recommendation to any investor or group of investors to invest in, or purchase, or take any other action whatsoever with respect to the Rights Issue Shares, the Nil Paid Rights and the Fully Paid Rights.</span></p>\n<p class=\"mh\"><span class=\"lf\"> </span></p>\n<p class=\"mh\"><span class=\"lf\">Each distributor is responsible for undertaking its own Target Market Assessment in respect of the Rights Issue Shares and determining appropriate distribution channels.</span></p>\n</div>\n<div style=\"text-align:left;font-size:10pt\"><div>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a>.<br/><br/>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a>.</div><div> </div>  END</div><div> </div><div> </div>ROIUPGACPUPUPGB</div>"}