{"date": "2022-01-05 18:48:00.207000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3350.44, "close": 3265.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Every day, we scour Amazon to find the best deals available. Whether it's something for your kitchen or top-rated tech to give your smart home an upgrade, the online shopping giant offers some of the best prices on a  <span>very</span> wide range of items. Whatever you need, Amazon has you covered.</p></div><div class=\"tr-npp-body\"><p><span><span>Make 2022 the year of good decisions.</span> Start by signing up for our newsletter for twice-weekly tips, reviews and more from our experts.</span> </p><p>Below, you'll find our top 10 Amazon deals right now, including a multi-function juicer, some compact air fresheners and our favorite TV, all of which have been vetted by our team of deals experts to make sure they're \"best of web\" prices. </p><p>► <span>Should you be wearing an N95 mask?:</span> What to know and where to buy them online</p><p>► <span>Want to eat healthier?</span><span>:</span>  Here are 20 meal delivery services on sale for the new year</p><p>If you're not already an Amazon Prime subscriber, you can sign up for a 30-day membership for free. An Amazon Prime subscription gets you free two-day shipping and tons of other benefits for $12.99 a month ($6.49 for students and $5.99 for those receiving qualifying government assistance).</p><p class=\"tr-npp-section-title\">The 10 best Amazon deals you can get today</p><p><big>1. Save $90: One of our favorite electric toothbrushes</big> </p><p>Keep your teeth pearly white with the Philips Sonicare DiamondClean electric toothbrush. Typically listed for $249.95, this smart rechargeable tooth tool is now selling for $159.95 thanks to a $90 price cut. The DiamondClean is one of the best electric toothbrushes we've ever tried, having impressed us with its five brush modes and ability to provide real-time feedback on your brushing to your smartphone. It also has a sleek design and has a drive that our tester described as \"like a BMW 7 Series.\"</p><p><span>Get the Philips Sonicare DiamondClean Smart 9500 Electric Toothbrush for $159.95 (Save $90)</span> </p><p><big>2. 13% off: This multi-function juicer</big> </p><p>If you love to be hands-on with your food and drinks at home, add the Omega Juicer Extractor and Nutrition System to your kitchen tools today. Normally priced at $380.13, this 150-watt appliance is on sale today for $329.99, or for 13% off. Omega says the device uses a low speed (80 RPMs) to extract the maximum amount of nutrients, vitamins, taste and juice from fruits, vegetables, leafy greens and wheatgrass. Not only that, its quiet but powerful motor can also grind coffee, mince herbs and make baby food with its adjustable end cap.</p><p><span>Get the Omega Juicer Extractor and Nutrition System for $329.99 (Save $50.14)</span> </p><p><big>3. Less than $2,000: Our favorite TV</big> </p><p>Those looking to invest in a truly eye-catching TV will marvel at the LG OLED C1 Smart TV. Typically listed from $2,499.99, you can get a 65-inch model for $1,896.99, a 24% price cut (smaller sizes are cheaper, but not on sale). We adore the C1, and named it the best TV on the market for its incredible brightness and the rich colors it displayed, no matter the movie or TV show. Its four HDMI 2.1 ports and customizable picture enhancements also make it a great screen for gamers playing on the latest consoles. </p><p><span>Get the LG OLED C1 Series Alexa Built-In 4K Smart TV from $1,296.99 (Save $603 to $803)</span> </p><p><big>4. 42% off: These compact air fresheners</big> </p><p>Whether your kitchen or your bathroom needs freshening, these Febreeze Unstopables Fresh air fresheners are essentials for your home. Typically listed for $14.99, you can get a three-pack of this compact odor eliminator with Amazon's delivery membership for just $8.37, or 42% off, thanks to a $2.53 price cut and a $3 coupon you can check off on the product page. With Subscribe and Save, you can get 5% off the delivery of your first order and up to 15% off repeat deliveries that you can schedule to arrive anywhere every two weeks to every six months. Febreeze says these tiny devices can eliminate odors in even the smallest home spaces for 45 days. </p><p><span>Get the Febreeze Unstopables Fresh Small Spaces Air Freshener for $8.37 with coupon code (Save $6.13)</span> </p><p><big>5. Less than $25: One of our favorite foam rollers</big> </p><p>Add more tools to your workout routine with the TriggerPoint GRID foam roller. Normally priced at $39.99, you can get this 13-inch muscle tool for as low as $22.72 with a 43% discount. The GRID is our favorite compact foam roller due to the lasting durability from its hard plastic and dense foam material. Its varied rolling surface allows for different levels of deep tissue massage while being both firm and cushioned enough for comfort.</p><p><span>Get the TriggerPoint GRID Original Foam Roller from $22.72 (Save $5 to $17.27)</span> </p><p><big>6. 25% off: Our favorite adjustable dumbbell</big> </p><p>Toughen up this year with the Bowflex SelectTech 552 adjustable dumbbell. Typically listed for $199, this 52.5-pound fitness tool can be yours for 25% off at $149. The SelectTech 552 can be set for weights from 5 to 52.5 pounds, with the ability to increase the load by 2.5-pound increments, and it's the best adjustable dumbbell we've ever tried, mainly for how easy it was to re-rack thanks to a tray that separates the weight plates from each other.</p><p><span>Get the Bowflex SelectTech 552 Adjustable Dumbbell for $149 (Save $50)</span> </p><p><big>7. Save $179: This durable gaming chair</big> </p><p>The AKRacing Nitro gaming chair promises a build and comfort meant to last for the longest PC gaming sessions. The developer says its chair features a 180-degree recline and tilt lock function so you can find the right angle for your next speedrun with cushions meant for head and lumbar support. It's supported by a durable steel frame with high-density foam to ensure this as a long-term investment. Though normally listed for $479, the Nitro is currently on sale for $299.99.</p><p><span>Get the AKRacing Nitro Gaming Chair for $299.99 (Save $179.01)</span> </p><p><big>8. 20% off: Our favorite treadmill</big> </p><p>Skip the gym this winter with the NordicTrack Commercial Series 1750 treadmill. Typically priced at $1,999, this corded electric runner can be yours at $400 off for $1,599 with a 30-day iFit membership allowing you to stream live and on-demand workouts to the treadmill included free. The 1750 is the best treadmill we've ever tried, wowing us with its incredible range of speed (between 0.5 miles per hour to 12 mph) and incline (-3% to 15%, which lets it even simulate going downhill). Our tester said it was a \"joy\" to run on the 1750, with an \"ideal springiness-to-firmness ratio\" that she felt protected her joints without making her feel like she would run off the machine itself.</p><p><span>Get the NordicTrack Commercial Series 1750 Treadmill with 30-Day iFit Membership for $1,599 (Save $400)</span> </p><p><big>9. Less than $165: This combo tool kit</big> </p><p>Upgrade the essentials in your home workshop with this DeWalt 20-Volt Max cordless drill combo kit. Typically listed for $199, this set featuring a cordless drill and an impact driver with two battery packs can be yours for $160.65 thanks to a 19% discount. DeWalt says both tools have a lightweight design and can fit into tighter areas, with the drill having a comfortable ergonomic handle and the driver featuring an LED light ring at its front end to help users see.</p><p><span>Get the DeWalt 20-Volt Max Cordless Drill 2-Tool Combo Kit for $160.65 (Save $38.35)</span> </p><p><big>10. Save $31: Our favorite stand mixer</big> </p><p>Nothing does it better than the KitchenAid Artisan Series stand mixer. Normally priced at $459.99, you can get this five-quart appliance at a $30.99 price cut for $429. The Artisan Series mixer is the best one we've ever tried for its durable, reliable build and quiet motor. Its wire whisk and wire whip attachments are easy to put on, remove and clean, while its splash guard fits the bowl and can be slid on at a moment's notice without having to take apart the mixer.</p><p><span>Get the KitchenAid Artisan Series 5-Quart Stand Mixer from $429 (Save $30.04 to $30.99)</span> </p><p class=\"tr-npp-section-title\">Amazon deals you may have missed</p><p><big>1. Amazon Fire HD 10 Tablet</big> </p><p>The best tablets available don't come cheap, but right now you can get one of our favorites for less than $100. Amazon's 64-gigabyte Fire HD 10 usually starts from $189.99, but you can get one for 50% off right now, bringing the price down to $94.99. We ranked the Fire HD 10 as one of the best tablets we've ever tested thanks to its large display, which is capable of playing 1080p-resolution videos with reasonably true colors and black levels, and the relatively quick charging time. Though it doesn't have the strongest app collection compared with the competition from Apple and Google, it's hard to beat its current discounted price.</p><p><span>Get the Amazon Fire HD 10 64 GB Tablet for $94.99 (Save $95)</span> </p><p><big>2. Beauty Products</big> </p><p>If you're looking to update your beauty routine, now's the time to experiment, with a buy two, get one 50% deal on beauty essentials. You can help eliminate any dark circles with the Maybelline New York Instant Age Rewind Eraser, typically listed for $9.99 but now available for as low as $4.33. The brand says the medium coverage foundation stick can be easily applied to not only dark circles but also fine lines, blemishes and spots of redness. If you want to end the day with a fresh face, there's a 25-pack of Cetaphil Gentle Makeup Removing Wipes normally priced at $8.49 but now selling for $5.99. The brand says its wipes remove dirt, excess oil, makeup and more thanks to the aloe vera, chamomile and green tea-infused formula.</p><p><span>Buy Two, Get One for Half Off Beauty Essentials</span> </p><p><big>3. Philips One By Sonicare Electric Toothbrush</big> </p><p>If you want to give your teeth a better daily cleaning, the Philips One is ready to meet your dental needs for a super-affordable price. Typically listed for as low as $24.95, you can get the portable battery-powered toothbrush in Miami Coral today for $12.49 with the coupon on the product page. Philips says the One can run for three months on just one AAA battery and offers micro-vibrations in addition to manual brush motions to give your teeth a better polish. It also features a two-minute timer and comes with a sleek travel case so you can take your clean routine on the road.</p><p><span>Get the Philips One by Sonicare Battery Toothbrush from $12.49 with coupon (Save $2.46 to $10.04)</span> </p><p><big>4. Apple Watch Series 7</big> </p><p>When it comes to smartwatches, we found the Apple Watch Series 7 to be the best tech of its kind. When we tested it, we were impressed with how fast its battery charged and its many fitness tracking abilities, including being able to automatically detect cycling workouts. The Series 7 also has a larger display than its predecessors, making more room for a new watch-friendly keyboard and for an easier time reading text messages or GPS directions. Normally listed from $399, you can get Apple's latest smartwatch for as low as $369 in its 41-millimeter size with GPS capabilities.</p><p><span>Get the Apple Watch Series 7 from $369 (Save $30)</span> </p><p><big>5. House Cleaning Products</big> </p><p>Whether you need to freshen up after cooking or keep creepy crawlers away from your floors, you can get $10 back on home cleaning purchases of $40 or more. This deal applies to products that both are and aren't discounted. That means you can get a three-pack of Mrs. Meyer's Clean Day liquid hand soap ($12.84), a box of Combat Max 12-Month roach killing bait ($11.59) and a 110-count package of Glad ForceFlex Protection Series tall trash bags ($18.63)—normally $42.49 for all three—for just $32.49. </p><p><span>Save $10 on purchases of $40 or more home cleaning products</span> </p><p class=\"tr-npp-section-title\">Other noteworthy Amazon deals we found </p><ul class=\"bulleted-list arrowlist\"><li>Save up to 20% on Fitness Equipment from Bowflex and Schwinn</li><li>Save up to 38% on Medify Air Purifiers</li><li>Save up to 50% on Amazon fitness trackers</li><li>BalanceFrom GoYoga All-Purpose Exercise Yoga Mat with Carrying Strap from $17.02 (Save $25.90 to $32.93)</li><li>1-Year subscription to Amazon Kids+ for $19.99 (Save $79.01)</li><li>Lifewit Large Capacity Clothes Storage Bag Organizer, 3-Pack for $19.99 (Save $10)</li><li>Hilife HL7 Clothes Steamer for $21.66 (Save $14.33)</li><li>Renpho ES-CS20M Smart Bluetooth Body Fat Scale for $23.91 with coupon (Save $13.08)</li><li>Pure Enrichment PureRelief XL Heating Pad for $27.99 with coupon (Save $7)</li><li>Geryon Vacuum Sealer Machine for $39.09 with coupon (Save $6.90)</li><li>Amazon Echo Show 5 (2nd Generation) for $44.99 (Save $40)</li><li>TurboTax Deluxe 2021 Download Card with Amazon Gift Card for $49.99 (Save $20)</li><li>All-Clad 12-Inch D3 Stainless Steel Frying Pan for $99.99 (Save $120.01)</li><li>Eufy Security Wi-Fi Video Doorbell for $109.99 with coupon (Save $50)</li><li>Eufy BoostIQ RoboVac 11S Max for $179.99 with coupon (Save $70)</li><li>Le Creuset 3.5-Quart Enameled Cast Iron Signature Sauteuse Oven from $179.95 (Save $120.05)</li><li>Apple AirPods Pro for $197 (Save $52)</li><li>Cricut Maker for $240 (Save $129)</li><li>Samsung 2 TB T7 Portable SSD for $259.99 (Save $70)</li><li>Echelon EX-5 Exercise Bike for $848 (Save $351.99)</li> </ul><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Updated daily: Here are the 10 best Amazon deals today in January 2022</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}