{"date": "2021-12-01 04:48:15.040000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New delhi</p></div><div class=\"tr-npp-lead\"><p>New delhi, Nov. 30 -- The Supreme Court on Monday extended the deadline for Amazon to file its final submissions before the Competition Commission of India (CCI) by two weeks on a petition filed by the Confederation of All India Traders questioning the validity of the November 2019 deal between the American retail giant and Future Coupons Pvt. Ltd.</p><p>An apex court bench headed by Chief Justice N.V. Ramana said it will not comment on the merits of the case, but would extend the time for Amazon to file its final arguments before the CCI. The bench, also comprising justices Surya Kant and Hima Kohli, told Amazon's counsel Gopal Subramanium that the parties are at liberty to raise objections before CCI.</p></div><div class=\"tr-npp-body\"><p>Amazon had challenged a 16 November Delhi High Court order, expediting the proceedings before the CCI, which had in June issued a notice to Amazon asking it why it should not revoke the approval to invest in Future Coupons.</p><p>Subsequently, the CCI had said that it would proceed with the final arguments in the matter in view of the HC order.</p><p>Subramanium argued that the HC should not have entertained the petition by the traders' body, as it was not aware of the proceedings before the antitrust watchdog. He further argued that there was no reason for the HC to speed up the proceedings when the CCI had already listed the matter for hearing on 4 January.</p><p>However, appearing for Future Group, Mukul Rohatgi contended that an appeal cannot be filed against an order for expediting a case because a party does not have the right to delay the proceedings.</p><p>In response, the SC bench questioned Rohatgi about the \"tearing hurry\" of the CCI in deciding a matter when the main case was pending before the apex court. Rohatgi replied that Future Coupons did not have a problem if Amazon was given more time to file its submissions before the CCI.</p><p>On his part, Krishna Venugopal, who appeared on behalf of the traders' body, said his client was compelled to go to the HC owing to inordinate delays at the CCI. He alleged that a \"backdoor\" investment by Amazon into the unlisted Future Group company must be investigated as it was in breach of various regulations.</p><p>However, the bench clarified that it would not examine the merits of the case. \"Your main point in the petition is about the inadequacy of time. So, we will give you two weeks more and will leave all contentions open to be argued before the commission,\" it said.</p><p>Last week, the SC had asked Amazon to append all related cases pending before other courts and tribunals with the main petition before the apex court on the sale of Future Group's $3.4 billion retail assets to Reliance Industries. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}