{"date": "2021-11-15 12:41:44+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Saurabh Sharma and Abhirup Roy</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">LUCKNOW, India Nov 15 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Police in India's Madhya Pradesh state have summoned Amazon.com Inc's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> local executives as it investigates a case where the e-commerce platform was allegedly used for smuggling marijuana, a police official said on Monday.</p><p>The police on Sunday arrested two men in the state with 20 kg of marijuana and found they were using Amazon's India shopping website to order and smuggle the substance further to various states.</p><p>Smugglers used the Amazon India platform to order and deliver the drug, which was listed under the guise of dry stevia leaves, a natural food sweetener. The Amazon platform was allegedly used for 1,000 kilograms of such marijuana sales so far, worth $148,000, police alleged in its statement. </p><p>On Monday, Manoj Singh, a senior police official in the district, said Amazon executives have been asked to explain how their platform could be used for the sale of banned substances. </p><p>\"The international company has the power of artificial intelligence, so it's a big thing happening on their platform,\" Singh said. \"There is involvement of Amazon at many levels in this marijuana delivery - from providing logistical support to delivery.\" </p><p>\"The lawyers from Amazon will probably visit us tomorrow.\"</p><p><span class=\"tr-strong\">An Amazon spokesperson said in a statement it was investigating whether there was any non-compliance by a seller. </span></p><p><span class=\"tr-strong\">“We do not allow the listing and sale of products which are prohibited under law to be sold in India,” the statement said, adding the company would cooperate with the authorities.</span></p><p>The U.S. company in India operates a marketplace website where sellers can list their products and Amazon also provides logistics and warehouse servicing to them.</p><p>Police officer Singh said his team also visited one of Amazon's delivery hubs in Gwalior city in Madhya Pradesh as part of the investigation to get details of alleged marijuana delivery consignments.</p><p>Indian authorities have in recent years intensified their efforts to crack down on illicit drugs. Many high-profile Indian actors and TV personalities have been under scrutiny from narcotics officials since last year.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Saurabh Sharma and Abhirup Roy; Writing by Aditya Kalra; Editing by Angus MacSwan and Bernadette Baum)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:aditya.kalra@tr.com\" data-type=\"email\" translate=\"no\">aditya.kalra@tr.com</a> ; +91-11-49548021; Twitter <a href=\"https://twitter.com/adityakalra\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/adityakalra</a>; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON-INDIA/ (PIX)</p></div>"}