{"date": "2021-12-02 13:00:00.904000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>\n<b>Softchoice Wins 2021 AWS US Rising Star of the Year Partner Award</b>\n</p><p>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.softchoice.com%2F&amp;esheet=52543692&amp;newsitemid=20211202005186&amp;lan=en-US&amp;anchor=Softchoice&amp;index=1&amp;md5=213b2da3c092f6a05ebfaaed71d5e847\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Softchoice</a> (TSX: SFTC) today announced that it has been honored with the Rising Star Partner of the Year Award by Amazon Web Services (AWS). The award recognizes how Softchoice is helping organizations innovate and win with AWS.\n</p><p>\nAnnounced during the AWS re:Invent 2021 event, AWS Partner Awards recognize a wide range of born-in-the-cloud and traditional consulting and Independent Software Vendor partners whose business models have embraced specialization and collaboration. AWS Partners are dedicated to helping customers build, market, and sell their offerings so they can grow successful cloud businesses.\n</p><p>\n“Together, Softchoice and AWS are helping our customers fully realize the value of the cloud through innovative and customized solutions,” said Christopher Woodin, Vice President, Cloud, Softchoice. “We have scaled our AWS solutions and team of experts over the last year, giving our customers the ability to quickly adopt the AWS platform and transform through application development and modernization.”\n</p><p>\nIn October, Softchoice and AWS announced a strategic collaboration to create solutions for customers to help launch, migrate, modernize, and scale workloads on AWS even faster. Customers will also benefit from Softchoice’s dedicated team of AWS solutions architects, which will help them design and optimize their AWS environments with speed and agility.\n</p><p>\nSoftchoice is a multi-cloud certified managed service provider and one of the first AWS managed service partners, holding the following AWS Competencies and designations: AWS Non-Profit Competency, AWS Microsoft Workloads Competency, AWS Storage Competency, Amazon EC2 for Windows Server Delivery and AWS CloudFormation Service Delivery designations. Thousands of organizations across North America trust Softchoice to help them succeed with cloud and win in their markets.\n</p><p>\nLearn more about our Amazon Web Services solutions <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.softchoice.com%2Ftechnology-partners%2Faws&amp;esheet=52543692&amp;newsitemid=20211202005186&amp;lan=en-US&amp;anchor=here&amp;index=2&amp;md5=b6730bb5ebb384731f4a83cb8c75021a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a>.\n</p><p>\n<b>About Softchoice</b>\n</p><p>\nSoftchoice (TSX: SFTC) is a software-focused IT solutions provider that equips organizations to be agile and innovative, and for their people to be engaged, connected and creative at work. That means moving them to the cloud, helping them build the workplace of tomorrow, and enabling them to make smarter decisions about their technology. For more information, please visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.softchoice.com%2F&amp;esheet=52543692&amp;newsitemid=20211202005186&amp;lan=en-US&amp;anchor=www.softchoice.com&amp;index=3&amp;md5=ffc852847858219e46d31bcd7e241124\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.softchoice.com</a>.\n</p><p>\n<b>Forward-Looking Statements</b>\n</p><p>\nThis news release may contain forward-looking information within the meaning of applicable securities laws, which reflects the Company’s current expectations regarding future events, including the Company’s plans to create customer solutions and expectations regarding its cloud-based services. Forward-looking information is based on a number of assumptions and is subject to a number of risks and uncertainties, many of which are beyond the Company’s control. Actual results could differ materially from those projected herein. Unless otherwise noted or the context otherwise indicates, the forward-looking information contained in this news release is provided as of the date of this news release and Softchoice does not undertake any obligation to update such forward-looking information, whether as a result of new information, future events or otherwise, except as expressly required under applicable securities laws.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211202005186r1&amp;sid=ucdp4&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMjAyMDA1MTg2cjEmc2lkPXVjZHA0JmRpc3Rybz1ueCZsYW5nPWVu&amp;key=3bc91c7fb4f0ab046eb1012b3f1c1c9a29e1b89dbc68d45d6d3811c320e28e60991647c14922ac1c62f9f9373af053955061515197483c71806a35454c28dda1\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211202005186/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211202005186/en/</a></span></p><p>\n<b>Media\n<br/></b>Oindrila Hazra\n<br/>Manager, Communications\n<br/><a href=\"mailto:oindrila.hazra@softchoice.com\" data-type=\"email\" translate=\"no\">oindrila.hazra@softchoice.com</a>\n</p><p>\n<b>Press\n<br/></b>For all press inquiries\n<br/><a href=\"mailto:media@softchoice.com\" data-type=\"email\" translate=\"no\">media@softchoice.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SOFTCHOICE</p></div>"}