{"date": "2021-12-03 19:49:24.150000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3437.36, "close": 3427.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Siemens Digital Industries Software and Amazon Web Services have expanded their collaboration, which combines Siemens' deep industry expertise with cloud services from AWS to help industrial companies accelerate digital transformation in the cloud.</p><p>Together, AWS and Siemens plan to drive adoption of Siemens' Xcelerator as a Service and make Siemens' Xcelerator portfolio of integrated software, services, and application development platform more accessible, scalable, and flexible. Xcelerator as a Service acts as a catalyst for fast and predictable digital transformation--including by gaining new manufacturing insights, automating processes, and deploying connected services--and offers customizable solutions for any starting point on the digital journey. \"Siemens and AWS are coming together to help companies speed engineering efforts, optimize factory operations, and enhance customer experiences from chip to edge to cloud,\" said Tony Hemmelgarn, President and Chief Executive Officer at Siemens Digital Industries Software. \"We're excited to combine our proven cloud and industrial experience in this expanded partnership and simplify the journey for our mutual customers to become digital enterprises.\" The strategic collaboration agreement between AWS and Siemens will see the companies cooperate to support customers; expand cloud capabilities in Siemens' Xcelerator as a Service portfolio; explore opportunities for innovation; and develop and take to market new solutions. One area of collaboration is digital twin technology, where Siemens and AWS will accelerate adoption and democratize new digital twin solutions using AWS IoT TwinMaker, a newly launched AWS service that makes it faster and easier to create digital twins that incorporate multiple data sources. Siemens' Xcelerator portfolio is already integrated with over 60 AWS services, and with the addition of AWS IoT TwinMaker, customers can apply AWS IoTTwinMaker to develop increasingly powerful digital twin solutions that are compatible with Siemens' design, simulation and manufacturing software.\"Working together, Siemens and AWS will make it easier for industrial customers to use Siemens' comprehensive digital twin technology and AWS's cloud services to deliver new manufacturing insights, automation, and connected services,\" said Bill Vass, Vice President of Engineering at AWS. \"Together, we'll bring new cloud-based digital transformation solutions to market that will help companies of any size address industrial complexity and turn it into competitive advantage\".  </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}