{"date": "2022-02-25 21:20:12.172000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3027.16, "close": 3071.26}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>PLUG POWER INC (\"PLUG-Q\")\n- To Announce 2021 Fourth Quarter Results\n\n     Plug Power Inc., a leading provider of turnkey hydrogen solutions for\nthe global green hydrogen economy, will announce its 2021 fourth quarter\nresults on March 1, 2022.\n\n     Join the call:\n\n     *  Date: March 1, 2022\n     *  Time: 4:30 pm ET\n     *  Toll-free: 877-405-1239; 201-389-0851\n     *  Direct webcast:\n<a href=\"https://event.webcasts.com/starthere.jsp?ei=1531115&amp;&quot;\" class=\"tr-link\">https://event.webcasts.com/starthere.jsp?ei=1531115&amp;</a>;tp_key=cd5b4b33b7\n\n     The webcast can also be accessed directly from the Plug Power homepage\n(www.plugpower.com). A playback of the call will be available online for a\nperiod of time following the call.\n\n     About Plug Power\n\n     Plug Power is building the hydrogen economy as the leading provider of\ncomprehensive hydrogen fuel cell (HFC) turnkey solutions. The Company's\ninnovative technology powers electric motors with hydrogen fuel cells amid\nan ongoing paradigm shift in the power, energy, and transportation\nindustries to address climate change and energy security, while providing\nefficiency gains and meeting sustainability goals. Plug Power created the\nfirst commercially viable market for hydrogen fuel cell (HFC) technology.\nAs a result, the Company has deployed over 50,000 fuel cell systems for\ne-mobility, more than anyone else in the world, and has become the largest\nbuyer of liquid hydrogen, having built and operated a hydrogen highway\nacross North America. Plug Power delivers a significant value proposition\nto end-customers, including meaningful environmental benefits, efficiency\ngains, fast fueling, and lower operational costs. Plug Power's vertically\nintegrated GenKey solution ties together all critical elements to power,\nfuel, and provide service to customers such as Amazon, BMW, The Southern\nCompany, Carrefour, and Walmart. The Company is now leveraging its\nknow-how, modular product architecture and foundational customers to\nrapidly expand into other key markets including zero-emission on-road\nvehicles, robotics, and data centers.\n\nContact:\nCaitlin Coffee\nAllison+Partners\n(312) 635-8204\nPlugPR@allisonpr.com\ninvestors@plugpower.com\n<a href=\"https://www.plugpower.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.plugpower.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2205500346.MNPRE2205501465-13174320220225</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}