{"date": "2022-02-22 21:11:41.180000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ELEMENT NUTRITIONAL SCIENCES INC (\"ELMT-Z;ELNSF-0\")\n- Element Nutritional Sciences Announces Strategic Partnership with\n- Leading E-Commerce Business Accelerator, Pattern\n\n    Element Nutritional Sciences Inc. (the \"Company\" or \"Element\"), is\npleased to announce that it has entered into an agreement with leading\ne-commerce business accelerator Pattern Inc. (\"Pattern\") to accelerate\nglobal online sales over the Amazon platform. Effective February 2, 2022,\nthe agreement captures both the Company's flagship Rejuvenate(TM) muscle\nhealth brand as well as its recently announced line of sports nutrition\nproducts, Promino(TM), under the JAKTRX(TM) Performance Supplement line of\nproducts.\n\n    Pattern is an international brand accelerating platform focused on the\nAmazon marketplace, managing revenue of over US$800 million in 2021.\nPattern has created proprietary predictive software using artificial\nintelligence to drive e-commerce strategy and offers a full suite of growth\nservices for retailers and consumer brands. Through this partnership,\nPattern will oversee and help distinguish the full Element product\nportfolio on Amazon.com, as well as its international markets in Europe,\nAsia, Latin America and Australia.\n\n    Stuart Lowther, Chief Executive Officer, \"We are at an exciting stage\nin our growth having recently announced our exclusive North America rights\nfor the sports nutrition market and plans to develop a line of sports\nnutrition products called Promino(TM). As one of the top three private\nsellers on Amazon in the US1, Pattern has an established presence in the\ne-commerce space and we believe that this partnership will be a significant\ncatalyst to accelerating our growth of merchant partners and bringing our\nclinically-proven, innovative products in front of more customers,\nglobally.\"\n\n    About Element\n\n    Element is an innovative and research driven Canadian nutraceutical\ncompany specializing in the development of science-based products for the\nglobal consumer packaged goods market, with a portfolio focused\nspecifically on men and women over the age of 50. Element's lead product,\nRejuvenate(TM), is a proprietary formulation that is clinically proven to\nassist in the rebuilding, restoration and rejuvenation of natural loss of\nmuscle mass due to aging or other medical conditions. Element also offers\nJAKTRX(TM), an elite brand of performance supplements. Element was founded\nin 2015 and is located in Burlington, Ontario.\n\n    To learn more about Element, visit elmtinc.com.\n\n    More information about Rejuvenate(TM) can be found at:\nwww.rejuvenatemuscle.com\n\n    About Pattern\n\n    Pattern is the premier partner for global ecommerce acceleration --\nhelping brands command their maximum share of the exploding $6 trillion\nglobal ecommerce market. Pattern's ecommerce acceleration platform\nleverages proprietary technology and industry experts to help brands attain\nprofitable ecommerce growth on their websites and on hundreds of global\nmarketplaces -- including Amazon, Walmart, eBay, Google, Tmall, JD, and\nMercadoLibre. To learn more, visit pattern.com or email press@pattern.com.\n\n    For more information, visit www.pattern.com.\n\n    Forward Looking Statements\n\n    This news release contains \"forward-looking information\" and\n\"forward-looking statements\" (collectively, \"forward looking statements\")\nwithin the meaning of the applicable Canadian securities legislation. All\nstatements, other than statements of historical fact, are forward-looking\nstatements and are based on expectations, estimates and projections as at\nthe date of this news release. Any statement that involves discussions with\nrespect to predictions, expectations, beliefs, plans, projections,\nobjectives, assumptions, future events or performance (often but not always\nusing phrases such as \"expects\", or \"does not expect\", \"is expected\",\n\"anticipates\" or \"does not anticipate\", \"plans\", \"budget\", \"scheduled\",\n\"forecasts\", \"estimates\", \"believes\" or \"intends\" or variations of such\nwords and phrases or stating that certain actions, events or results \"may\"\nor \"could\", \"would\", \"might\" or \"will\" be taken to occur or be achieved)\nare not statements of historical fact and may be forward-looking\nstatements. In this news release, forward looking statements relate, among\nother things, to: Pattern's ability to accelerate revenue growth for the\nCompany's products.\n\n    These forward-looking statements are based on reasonable assumptions\nand estimates of management of the Company at the time such statements were\nmade. Actual future results may differ materially as forward-looking\nstatements involve known and unknown risks, uncertainties and other factors\nwhich may cause the actual results, performance or achievements of the\nCompany to materially differ from any future results, performance or\nachievements expressed or implied by such forward-looking statements. Such\nfactors, among other things, include: fluctuations in general macroeconomic\nconditions; expectations regarding the size of the United States and\nCanadian health, nutraceutical and wellness markets and changing consumer\nhabits; the viability of the Company's products; availability of\ndistribution channels for the Company's product offerings; the ability of\nthe Company to successfully achieve its business objectives; plans for\nexpansion; successful development of the Company's proposed products; the\npresence of laws and regulations that may impose restrictions or recalls on\nthe sale of the Company's products in the United States and Canada;\ncustomer and distributor relations; fluctuations in securities markets; and\nthe inability of the Company to obtain adequate insurance to cover risks\nand hazards. Although the forward-looking statements contained in this news\nrelease are based upon what management of the Company believes, or believed\nat the time, to be reasonable assumptions, the Company cannot assure\nshareholders that actual results will be consistent with such\nforward-looking statements, as there may be other factors that cause\nresults not to be as anticipated, estimated or intended. Readers should not\nplace undue reliance on the forward-looking statements and information\ncontained in this news release. The Company assumes no obligation to update\nthe forward-looking statements of beliefs, opinions, projections, or other\nfactors, should they change, except as required by law.\n\n    No stock exchange, securities commission or other regulatory authority\nhas approved or disapproved the information contained herein.\n\n    1 <a href=\"https://pattern.com/region/north-america\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://pattern.com/region/north-america</a>/\n\nContact Information:\n\nStuart Lowther\nChairman, CEO and President\nir@elementnutrition.com\n416-467-5229\nMarc Charbin\nInvestor Relations\nir@elementnutrition.com\n416-467-5229\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2205200065.MNPRE2205200986-05311120220222</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}