{"date": "2022-02-10 14:00:26.996000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3228.27, "close": 3180.07}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">Lomotif to Stream \"Shaq's Fun House Presented by FTX\" Live on LoMoTV, Utilizing Blended Media Cross Platform Distribution Strategy to Stream on TikTok, Instagram, YouTube, Twitch and other top Video Platforms</h2>\n<h2 class=\"xn-hedline\">LoMoTV Live Stream to be Featured on YouTube and Twitch Through its Exclusive Distribution with Insomniac</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">FAIRPORT, N.Y., Feb. 10, 2022</p></div>\n\n<div class=\"xn-content\">\n\n<p><span><span class=\"xn-location\">FAIRPORT, N.Y.</span></span>, <span><span class=\"xn-chron\">Feb. 10, 2022</span></span> /PRNewswire/ -- Vinco Ventures (NASDAQ: BBIG) and ZASH Global Media and Entertainment through their Joint Venture, ZVV Media Partners, announced today that Lomotif's digital entertainment network LoMoTV has joined with <span class=\"xn-person\">Shaquille O'Neal</span> to produce his over-the-top Big Game Weekend Party \"Shaq's Fun House\" which is presented by FTX, and produced by Medium Rare and ABG Entertainment. The festival is scheduled to take place on <span class=\"xn-chron\">Friday, February 11, 2022</span> in <span class=\"xn-location\">Los Angeles</span> and is expected to feature top performances by <span class=\"xn-person\">Lil Wayne</span>, Zedd, Diplo and DJ Diesel, along with appearances from iconic athletes and other talent.</p>\n\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/1743925/ZASH_Global_Media_and_Entertainment_Big_Game_Weekend.html\">\n                    <div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Shaquille O'Neal’s Big Game Weekend Party Joins with Lomotif for Worldwide Exclusive Live Stream\" src=\"https://mma.prnewswire.com/media/1743925/ZASH_Global_Media_and_Entertainment_Big_Game_Weekend.jpg\" title=\"Shaquille O'Neal’s Big Game Weekend Party Joins with Lomotif for Worldwide Exclusive Live Stream\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMTc0MzkyNS9aQVNIX0dsb2JhbF9NZWRpYV9hbmRfRW50ZXJ0YWlubWVudF9CaWdfR2FtZV9XZWVrZW5kLmpwZw==&amp;key=eb02cbdfb169e0d51d803a3eba2ec22ddad2d87f6be3924cac3283cab27384a8ece41897b9cd6fa23a10f5e527754670e9a1df4e86d28294e86ef4a48f6ac341\"/></div></div>\n                        </a>\n                </p>\n\n    </div>\n<p>Through its exclusive distribution with Insomniac, a producer of top music festivals and events in the world, LoMoTV plans to live stream \"Shaq's Fun House\" on YouTube's home page throughout the event.  Lomotif expects to generate a large audience for the event, deploying its blended media, cross-platform distribution strategy to stream on additional platforms including TikTok, Instagram, YouTube and Twitch.</p>\n<p>Powered by Bulldog DM the live stream of \"Shaq's Fun House\" follows the momentum LoMoTV received from its launch at the 2021 Electronic Daisy Carnival where it featured exclusive backstage content and interviews, as well as an exclusive performance from Lil Nas X and The Kid Laroi. LoMoTV's EDC stream was viewed by hundreds of millions of people.</p>\n<p>Fans will be able to live stream \"Shaq's Fun House\" from the short-form video platform Lomotif on LoMoTV, in addition to TikTok, Instagram, YouTube and Twitch.</p>\n<p>Magnifi U, an immersive, online personal and professional development platform that helps people align with their purpose and nurture their unique superpowers, will join as a sponsor of \"Shaq's Fun House.\" Magnifi U will provide guests information to download the Magnifi U app to develop their own skills.</p>\n<p>\"We are excited to be doing this again after our successful live stream of EDC which was viewed by hundreds of millions of people,\" said <span class=\"xn-person\">Ted Farnsworth</span> of ZVV Media Partners.  \"We are deploying our blended media, cross-platform distribution strategy to increase our audience by utilizing the streams of other video platforms, raising our own visibility and awareness.\"</p>\n<p>This is the fourth year running that <span class=\"xn-person\">Shaquille O'Neal</span> will host the ultimate Friday night event leading into football's biggest game of the year. Unlike other VIP experiences during Big Game Weekend, Shaq has created a signature event that is open to the public, allowing fans to partake in the fun. \"Shaq's Fun House\" has attracted the biggest names in sports and entertainment, solidifying itself as a \"must-attend\" event of Big Game Weekend.</p>\n<p>Headliners this year are expected to include: <span class=\"xn-person\">Lil Wayne</span>, Zedd, and Special Guest Diplo with a special Halftime Show Featuring DJ Diesel presented by Pepsi Stronger Together. <span class=\"xn-person\">Lil Wayne</span>, an award-winning and game-changing icon, has sold over 120 million records worldwide, making him one of the world's best-selling artists. He has won five GRAMMY® Awards, 11 BET Awards, four Billboard Music Awards, two MTV Video Music Awards, and eight NAACP Image Awards. Multi-platinum, GRAMMY® Award-winning artist, DJ, and producer Zedd is known for chart-topping collaborations and headlining major music festivals around the world.</p>\n<p><b><u>About Lomotif<br/></u></b>Lomotif is a video-sharing social networking platform that is democratizing video creation. Since the company was co-founded by video enthusiast <span class=\"xn-person\">Paul Yang</span> in 2014, Lomotif has been granted three technology patents focused on empowering creators to share and watch short videos through remix and collaboration. Yang's vision is to build the world's largest video vocabulary to accelerate the world's transition to video-first expression. Lomotif, available in the Apple and Google stores, is a downloadable app that has grown worldwide as a grassroots social community with dedicated users spanning from <span class=\"xn-location\">Asia</span> to <span class=\"xn-location\">South America</span> to the U.S. For additional information about Lomotif, please visit Lomotif's website at <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3440068-1&amp;h=4076281954&amp;u=https%3A%2F%2Fwww.globenewswire.com%2FTracker%3Fdata%3D2lJDiAIIrTJ_Zn1H-BTjBUZfWTYWzfW8Rn2jb4u3q1bO8BjQ7HXWcjpoOLY1mjgKAcu7yvD1Dk5PNVxfOAQtkw%3D%3D&amp;a=www.lomotif.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.lomotif.com</a></u>.</p>\n<p><b><u>About LomoTV<br/></u></b>LoMoTV is a digital entertainment and lifestyle content network offering original programming within the Lomotif app.  </p>\n<p><b><u>About Vinco Ventures, Inc.<br/></u></b>Vinco Ventures, Inc. (Nasdaq:  BBIG) is focused on the development of digital media and content technologies. Vinco Ventures' consolidated subsidiary, ZVV Media Partners, LLC, a joint venture of Vinco Ventures and ZASH Global Media and Entertainment Corporation, has an 80% ownership interest in Lomotif Private Limited. For more information visit <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3440068-1&amp;h=863279352&amp;u=https%3A%2F%2Finvestors.vincoventures.com%2F&amp;a=Investors.vincoventures.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Investors.vincoventures.com</a>. </p>\n<p><b><u>About Insomniac<br/></u></b>Insomniac produces some of the most innovative, immersive music festivals and events in the world. Enhanced by state-of-the-art lighting, pyrotechnics and sound design, large-scale art installations, theatrical performers and next-generation special effects, these events captivate the senses and inspire a unique level of fan interaction. The quality of the experience is the company's top priority.</p>\n<p>For over 28 years, Insomniac has produced more than 2,000 festivals, concerts and club nights for nearly seven million attendees across the globe. The company's premier annual event, Electric Daisy Carnival Las Vegas, is the world's largest dance music festival and attracts more than 525,000 fans over three days.</p>\n<p>The company was founded by <span class=\"xn-person\">Pasquale Rotella</span> and has been based in <span class=\"xn-location\">Los Angeles</span> since it was formed in 1993. In 2013, Insomniac entered into a partnership with global entertainment company Live Nation.</p>\n<p><b><u>About Medium Rare</u></b> <br/>Focused at the intersection of Sports &amp; Entertainment, Medium Rare partners with athletes, celebrities, and brands to build iconic media properties. Medium Rare is the creator and producer of Webby Award-winning brands including The Shaq Bowl, Shaq's Fun House, <span class=\"xn-person\">Daymond John's</span> Black Entrepreneurs Day, <span class=\"xn-person\">Guy Fieri's</span> Restaurant Reboot, The Sports Illustrated Awards, <span class=\"xn-person\">Rob Gronkowski's</span> Gronk Beach, Shaq vs Gronk, and more. Medium Rare was founded by <span class=\"xn-person\">Joe Silberzweig</span> and <span class=\"xn-person\">Adam Richman</span>, who were recently honored with 4X Webby Awards, Variety Hollywood's New Leaders, Forbes 30 Under 30, and Pollstar's Next Gen Impact. Learn more at <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3440068-1&amp;h=3260447909&amp;u=https%3A%2F%2Furldefense.com%2Fv3%2F__http%3A%2Fwww.Medium-Rare.com__%3B!!N96JrnIq8IfO5w!2YldvTHHlEMrk7G1gC6-pZuEvKDO90IOSPQGl8eUFcf8URWUlfIrLUC_VbCoPSG0NUIWaLuwb1Y%24&amp;a=www.Medium-Rare.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.Medium-Rare.com</a>.</p>\n<p><b><u>About ABG Entertainment</u></b><br/>ABG Entertainment offers unparalleled storytelling through long-form and short-form content, live event production, hospitality, and immersive experiences in collaboration with the world's most influential creators, distributors, brands, and artists. ABG Entertainment is a division of Authentic Brands Group, a global brand development, marketing, and entertainment company, and owner of a portfolio of iconic and renowned brands that generate more than <span class=\"xn-money\">$14 billion</span> in retail sales worldwide. For more information, visit <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3440068-1&amp;h=3113877283&amp;u=https%3A%2F%2Furldefense.com%2Fv3%2F__http%3A%2Fauthenticbrandsgroup.com__%3B!!N96JrnIq8IfO5w!2YldvTHHlEMrk7G1gC6-pZuEvKDO90IOSPQGl8eUFcf8URWUlfIrLUC_VbCoPSG0NUIWEbroI_I%24&amp;a=authenticbrandsgroup.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">authenticbrandsgroup.com</a>.</p>\n<p><b>Forward-Looking Statements and Disclaimers <br/></b>This press release contains \"forward-looking statements\" as defined in the safe harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995, which are based upon beliefs of, and information currently available to, Vinco Ventures' management as well as estimates and assumptions made by Vinco Ventures' management. These statements can be identified by the fact that they do not relate strictly to historic or current facts. When used in this presentation the words \"estimate,\" \"expect,\" \"intend,\" \"believe,\" \"plan,\" \"anticipate,\" \"projected,\" and other words or the negative of these terms and similar expressions as they relate to the applicable company or its management identify forward-looking statements. Such statements reflect the current view of Vinco Ventures with respect to future events and are subject to risks, uncertainties, assumptions and other factors relating to Vinco Ventures and its consolidated subsidiaries including ZVV Media Partners and Lomotif, their industry, financial condition, operations and results of operations. Such factors include, but are not limited to, the expected benefits from Vinco Ventures' investments in Lomotif and production of \"Shaq's Fun House\" and related growth initiatives involving LomoTV, the expected benefits of Lomotif's participation in and partnership with live entertainment events such as EDC, and such other risks and uncertainties described more fully in documents filed by Vinco Ventures with or furnished to the Securities and Exchange Commission, including the risk factors discussed in Vinco Ventures' Annual Report on Form 10-K for the period ended <span class=\"xn-chron\">December 31, 2020</span> filed on <span class=\"xn-chron\">April 15, 2021</span>, and Vinco Ventures' Quarterly Reports on Form 10-Q filed thereafter including the Quarterly Report on Form 10-Q for the quarter ended <span class=\"xn-chron\">September 30, 2021</span> filed on <span class=\"xn-chron\">November 22, 2021</span>, which are available at <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3440068-1&amp;h=1953021518&amp;u=https%3A%2F%2Fwww.globenewswire.com%2FTracker%3Fdata%3DorGPiIQViIfLixSMjJL9R9_4lLhras_-7A8RCln4Fsui1ZG3qQ2x4HWMtyQRfBgBQKwaJDANQFQQ7luNA6m3Vg%3D%3D&amp;a=www.sec.gov\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.sec.gov</a>. Should one or more of these risks or uncertainties materialize, or the underlying assumptions prove incorrect, actual results may differ significantly from those anticipated, believed, estimated, expected, intended, or planned. Although we believe that the expectations reflected in the forward-looking statements are reasonable, we cannot guarantee future results, performance, or achievements. Except as required by applicable law, including the securities laws of <span class=\"xn-location\">the United States</span>, we do not intend to update any of the forward-looking statements to conform these statements to actual results.</p>\n<p> </p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n</div>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=LA58423&amp;sd=2022-02-10\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1MQTU4NDIzJnNkPTIwMjItMDItMTA=&amp;key=041f0888c0775b111618b5d7c96b8a1e04cfd925373972e86257b9819301c036317117a394b289b03fec5f57e978bb9eb7b71558be459eb7ea54b22465c1c9a6\"/></div></div> View original content to download multimedia:<a href=\"https://www.prnewswire.com/news-releases/shaquille-oneals-big-game-weekend-party-joins-with-lomotif-for-worldwide-exclusive-live-stream-301479609.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/shaquille-oneals-big-game-weekend-party-joins-with-lomotif-for-worldwide-exclusive-live-stream-301479609.html</a><p></p>\n<p>SOURCE  ZASH Global Media and Entertainment</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: ZASHGLOBALMEDIA-Shaq</p></div>"}