{"date": "2021-11-04 02:19:05.254000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Wipro Limited, a leading global information technology, consulting and business process services company, today announced that it has been recognized as the ?AWS Migration Success Partner of the Year 2021 - India? at the Amazon Web Services (AWS) Partner Summit Online in India.</p><p>The AWS Partner Network (APN) awards recognises technology leaders that play a key role in helping organisations build solutions on AWS and accelerating innovation. The ?AWS Migration Success Partner of the Year 2021 Award? is given to an AWS Partner who has scaled customer engagement, cloud adoption and migration to AWS during the qualifying period.</p></div><div class=\"tr-npp-body\"><p>Wipro, an AWS Premier Consulting Partner, focuses on enabling enterprises navigate their transformation journey across the entire cloud lifecycle, helping customers make the most of AWS?s unmatched portfolio of cloud capabilities across strategy, migration, innovation and operations. Wipro won the ?AWS Migration Success Partner of the year 2021 ? India? award for originating multiple large migration customer wins on AWS, and for supporting global customers in financial services and telecom domains in 2020. Wipro has also achieved eight AWS Competencies and continues to participate in several AWS partner programs. Wipro?s AWS LaunchPad, a co-innovation center in India and other geographies, has helped customers gain from the ?as-a-Service? economy through its vast industry domain expertise and proven approach.</p><p>Anshul Sarin, Vice President and Head of Asia Pacific-Middle East-Africa (APMEA), Cloud and Infrastructure Services, Wipro Limited said, ?We are delighted to win this prestigious award from AWS. This recognition highlights our synergies stemming from our collaboration with AWS, and deep expertise in enabling cloud led transformation for large and complex migrations. Wipro?s ?business-first? strategy supported by strong industry solutions, uniquely positions us to support today?s modern enterprises, enhance the customer experience, drive business acceleration and increase connected insights. We look forward to building on our productive partnership with AWS, while continuing to deliver innovative services to our customers in India.?</p><p>Wipro also recently announced the launch of Wipro FullStride Cloud Services and its commitment to invest $1 billion in cloud technologies, capabilities, acquisitions and partnerships over the next three years.</p><p>India is one of the six focus regions that comprise Wipro?s APMEA Strategic Market Unit. With several decades of a strong presence in the Indian market, long standing customer and partner relationships, Wipro is widely recognized for its technology leadership, innovation and contribution towards social good.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}