{"date": "2021-11-11 14:29:11.307000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3576.23, "close": 3472.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>BLENDER BITES LTD (\"BITE-Z\")\nVEJII HOLDINGS LTD (\"VEJI-Z\")\n- Blender Signs Distribution Agreement with Largest Online Vegan\n- Marketplace, Vejii Holdings Ltd.\n\n     Blender Bites Ltd. (the \"Company\", \"Blender\" or \"Blender Bites\"), a\nCanadian company that develops and markets premium frozen organic and\nplant-based pre-portioned smoothie products, is pleased to announce that\nthe Company has signed a distribution agreement with Vejii Holdings Ltd.\n(\"Vejii\"). Blender Bites' full product line will be available through\nVejii's e-commerce marketplace in Canada, ca.shopvejii.com, an online\nmarketplace for vegan and plant-based products.\n\n    Headquartered in Kelowna B.C., and with a mission \"To move the world\nforward, one purchase at a time\", Vejii Holdings Ltd., through its wholly\nowned subsidiary Vejii Inc., is committed to making plant-based food more\naccessible, providing consumers with easy access to thousands of vegan and\nplant-based products in one place, while also supporting plant-based food\nproducers, especially small businesses.\n\n     Vejii's innovative e-commerce platform incorporates machine learning,\nartificial intelligence, smart lists, targeted product recommendations, and\nproprietary technology to provide an enhanced shopping experience to its\ncustomers. In late 2020 Vejii launched an online marketplace in the US and\nquickly established itself as the largest online vegan marketplace in the\nU.S. In April 2021, Vejii launched its Canadian platform, offering its\nthoughtfully curated selection of plant-based meat, dairy and seafood\nproducts to Canadian consumers.\n\n     It is estimated that in Canada there are close to 2.3 million\nvegetarians and 850,000 vegans, with the majority of these populations\nlocated in British Columbia. It is also estimated that 36.53% of Canadians\nare considering changes to their daily diets in an effort to reduce their\nmeat consumption.\n\n     As of August 16, 2021, Vejii, through its Canadian e-commerce\nmarketplace platform, launched delivery services across British Columbia's\nLower Mainland, offering its online customers in Coquitlam, Langley, Maple\nRidge, New Westminster, Surrey, Abbotsford, Burnaby, Chilliwack, Delta,\nNorth Vancouver, Richmond, Vancouver, and West Vancouver with same day\ndirect-to-door delivery.\n\n     \"We are thrilled to be partnering with Vejii and making our full line\nof plant-based vegan smoothie products available to all Canadians through\ntheir innovative e-commerce platform,\" stated Chelsie Hodge, CEO of Blender\nBites.\n\n     \"Online grocery shopping is one of the fastest growing e-commerce\nsegments and placing our products with Vejii, the largest online vegan\nmarketplace, just makes sense. Sharing 'online shelf space' with leading\nvegan CPG companies such as Beyond Meat, Gardein, Daiya and So Delicious,\nis a tremendous accomplishment, and we look forward to having our products\nin many more Canadian households.\"\n\n     Following a successful launch on Vejii's e-commerce marketplace in\nCanada, the Company anticipates exploring a launch on Vejii's US-based\ne-commerce marketplace.\n\n     About Blender Bites\n\n     Blender Bites is a Canadian company involved in the development and\nmarketing of a line of premium frozen food products with a focus on\nfunctionality. Blender Bites was founded in 2016 and was first to market in\nWestern Canada with a pre-portioned \"easy smoothie\" product that is free of\nany unnecessary inner plastic packaging. Blender Bites products are\ncertified organic, vegan, non-GMO, gluten free, dairy free and soy free.\nThey contain no added sugars and are made in Canada. Blender Bites products\nare distributed internationally across Canada and the US, and are currently\nsold in over 900 stores, including Loblaws, Real Canadian Superstore,\nSobeys, Safeway, Save on Foods, Thrifty Foods, Whole Foods Market, and\nselect Ontario club stores.\n\n     On behalf of the Board of Directors,\n\n     Blender Bites Limited\nChelsie Hodge, Chief Executive Officer\nFor further information, contact Blender IR Team at:\nEmail - investors@blenderbites.com\nTelephone - 1-888-997-2055\n\n     CAUTIONARY DISCLAIMER STATEMENT\n\n     This news release includes certain \"forward-looking statements\" under\napplicable Canadian securities legislation. Forward-looking statements are\nnecessarily based upon a number of estimates and assumptions that, while\nconsidered reasonable, are subject to known and unknown risks,\nuncertainties, and other factors which may cause the actual results and\nfuture events to differ materially from those expressed or implied by such\nforward looking statements. Such factors include, but are not limited to\ngeneral business, economic, competitive, political and social\nuncertainties, and uncertain capital markets. Readers are cautioned that\nactual results and future events could differ materially from those\nanticipated in such statements. Accordingly, readers should not place undue\nreliance on forward-looking statements. The Company disclaims any intention\nor obligation to update or revise any forward-looking statements, whether\nas a result of new information, future events or otherwise, except as\nrequired by law.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2131400169.MNPRE2131401336-06281120211111</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}