{"date": "2022-02-03 18:13:26.870000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3012.25, "close": 3152.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-abstract\"><p>Kishore Biyani's Future Retail (FRL) has sought two weeks from the Supreme Court (SC) to hammer out a solution with lenders on the issue of clearing dues and avoid being tagged a non-performing asset (NPA).</p></div><div class=\"tr-npp-lead\"><p>The council to the lenders of Future Group suggested an open bid between Amazon and Reliance Industries to settle the dispute and ensure recovery for banks.</p><p>It also argued that the lenders\u0092 contract with Future Group is the only one involving depositors\u0092 money and has public interest, given that its exposure is ~17,000 crore.</p></div><div class=\"tr-npp-body\"><p>It said if the loan repayment is pushed by a year, the outstanding could balloon to ~25,000 crore.</p><p>This comes on the back of FRL approaching the SC to direct its lenders to extend the timeline under the framework agreement for monetisation and extend the cure/review period (of 30 days) under the agreement, to avoid the</p><p>NPA label.</p><p>The council to lenders also said that the entire assets of FRL, which are entitled to be sold, may be subject to an open bid.</p><p>The banks' council argued in court that both Amazon and RIL are flush with funds and should agree to an open bid.</p><p>FRL had missed the first deadline to repay ~3,494 crore. A 30-day grace period for clearing the dues expired on January 29, which prompted the independent directors of the company to write to Amazon, seeking a bailout.</p><p>In its previous hearing on Tuesday, the SC said no party should benefit from consequential punitive action against FRL in loan repayment.</p><p>FRL\u0092s council had argued in court that it needed some time, and should its merger deal with Reliance Group come through, it could service all debt.</p><p>On Tuesday, the SC also delivered a verdict setting aside three Delhi High Court orders, including refusal to grant stay on the final arbitral award restraining FRL from going ahead with its merger with Reliance Group and ordering fresh</p><p>adjudication.</p><p>A senior executive of a public sector bank told Business Standard that FRL is now an NPA . That being a restructured loan, lenders have been making regulatory and additional provisions since the first quarter of 2021-22.</p><p>On January 25, FRL\u0092s independent directors had accepted the transaction with Mukesh Ambani-led Reliance Group and had then rejected the proposal of US e-commerce major Amazon\u0092s investment in FRL. \u0093It helps FRL to meet almost all its liabilities and in the process helps protect the investment of small shareholders and jobs of over 25,000 employees,\u0094 said a letter by FRL\u0092s independent directors.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Business Standard Ltd.</p></div>"}