{"date": "2021-12-14 10:48:11+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds Lloyds bank, lawyer reaction</p><p class=\"tr-by\">By Huw Jones</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">LONDON, Dec 14 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Google, Facebook and other online services should be held legally accountable for advertisements on their platforms in order to prevent fraudsters scamming millions of consumers, a cross-party group of British lawmakers has said.</p><p>Britain has proposed a landmark online safety law to punish abuses such as child pornography, racism and violence against women, but a joint committee of lawmakers drawn from both houses of parliament said on Tuesday it should go a step further to cover paid-for adverts.</p><p>\"Excluding paid-for advertising will leave service providers with little incentive to remove harmful adverts, and risks encouraging further proliferation of such content,\" the joint committee report said.</p><p>The Financial Conduct Authority also wants adverts on social media and search engines, currently excluded from the draft law, to be included after 754 million pounds ($999.65 million) <a href=\"https://nL8N2QU29V\" data-type=\"url\" class=\"tr-link\" translate=\"no\">was stolen</a> from consumers in the first six months of this year.</p><p>The report also backed a Law Commission recommendation to make cyberflashing, or the unsolicited sending of obscene images or video recordings, which are often a feature of sexual harassment, illegal.</p><p>The draft law is due to be approved in 2022 and government has two months to say if it will back the recommendation, along with several others which lawmakers say are needed to \"call time on the Wild West online\".</p><p>\"The era of self-regulation for big tech has come to an end. The companies are clearly responsible for services they have designed and profit from, and need to be held to account for the decisions they make,\" said Damian Collins, who chairs the joint committee.</p><p>Britain's communications regulator Ofcom should have powers to police mandatory codes of practice for the internet service providers and punish breaches, the report said. There must, however, be \"robust protections\" for freedom of expression, including an automatic exemption for recognised news publishers, it added.</p><p>Britain's financial services minister John Glen said last month he was \"very sympathetic\" to introducing online adverts into the bill or similar action. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2SK4XT\" data-type=\"storyId\" data-story-id=\"nL8N2SK4XT\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> </p><p>Vim Maru, group director of retail banking at Lloyds <a href=\"reuters://REALTIME/Verb=FullQuote/ric=LLOY.L\" data-type=\"ric\" data-ric=\"LLOY.L\" translate=\"no\" dir=\"ltr\">LLOY.L</a> said fraud is now Britain's most common crime and supported including paid-for online adverts in the bill.</p><p>\"The proposed legislation is a golden opportunity to take on the fraudsters together,\" Maru said.</p><p>The FCA spent 600,000 pounds on Google to warn about scam adverts, though the online giant has since said it will only take adverts from firms regulated by the FCA, and offered a $3 million credit to the regulator.</p><p>\"Without a decisive response from the government and the tech giants, many more individuals will sadly fall victim to these scammers,\" said Mel Stride, chair of parliament's treasury committee, which backs the recommendation to help remove fraudulent online adverts.</p><p>Geraint Lloyd-Taylor, a partner at the Lewis Silkin law firm, said the draft law leaves many unanswered questions and clearly poses a threat to democratic freedoms by introducing a new form of censorship without clear boundaries and safeguards. </p><p><br/></p><p><br/></p><p>($1 = 0.7543 pounds)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Huw Jones;<br/>Editing by Bernadette Baum and Louise Heavens)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:huw.jones@thomsonreuters.com\" data-type=\"email\" translate=\"no\">huw.jones@thomsonreuters.com</a> ; +44 207 542 3326; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://huw.jones.thomsonreuters.com@reuters.net\">huw.jones.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: BRITAIN-INTERNET/FRAUD (UPDATE 1)</p></div>"}