{"date": "2021-11-18 14:58:17.984000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>LEAF MOBILE INC (\"LEAF-T;LEMLF-0\")\n- Intention To Float\n\n     LEAF Mobile Inc.\n\n     This announcement is an advertisement for the purposes of the\nProspectus Regulation Rules of the Financial Conduct Authority (\"FCA\") and\nnot a prospectus and not an offer to sell, or a solicitation of an offer to\nsubscribe for or to acquire securities. Neither this announcement nor\nanything contained herein shall form the basis of, or be relied upon in\nconnection with, any offer or commitment whatsoever in any jurisdiction.\nInvestors should not purchase or subscribe for any transferable securities\nreferred to in this announcement except on the basis of information\ncontained in the prospectus (the \"Prospectus\") in its final form expected\nto be published by LEAF Mobile Inc. in due course in connection with the\nproposed admission of its ordinary shares to the standard listing segment\nof the Official List maintained by the FCA and to trading on the London\nStock Exchange plc's Main Market for listed securities. Copies of the\nProspectus will, following publication, be available for inspection from\n<a href=\"https://leafmobile.io\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://leafmobile.io</a>/\n\n     LEAF Mobile Inc.\n\n     Intention to Float on the Main Market of the London Stock Exchange\n\n     (\"LEAF Mobile\" or \"the Company\")\n\n     LEAF Mobile Inc. (TSX:LEAF)(OTCQB:LEMLF), a leading Canadian\nfree-to-play mobile game group, is pleased to announce its intention to\njoin the Main Market of the London Stock Exchange (\"LSE\") this winter.\n\n     The Company, which started trading its common shares on the Toronto\nStock Exchange (\"TSX\") on February 10th, 2021, will assume a dual-listed\nstructure. The Company's common shares will continue to be listed and trade\non the TSX in Canada under the symbol \"LEAF\", as well as trade on the OTC\nMarkets Group's OTCQB Marketplace in the United States under the symbol\n\"LEMLF\".\n\n     The Company intends to raise gross proceeds of approximately CAD$10\nmillion and the flotation is expected to value LEAF Mobile at approximately\n130m.\n\n     This secondary London listing is part of LEAF's growth strategy and\nbrings Canada's largest free-to-play mobile game group to the LSE. The net\nproceeds of the capital raising will be used to further scale the business.\n     LEAF is operating within a fast-growing sector with a rapidly\nincreasing total addressable market. Mobile Games are the world's most\npopular form of gaming. Mobile games are expected to reach 2.6 billion\nplayers and generate revenues of USD$90 billion in 2021, representing more\nthan half of the global games market in terms of revenue, according to\nNewzoo data. Games are also the most dominant category within the mobile\napplications ecosystem with gaming accounting for more revenue on iOS than\nevery other category combined. Games accounted for 66% of all ?App Store?\nrevenue in 2020, according to Sensor Tower data which also found that\napproximately USD$47.6 billion was spent on iOS games in 2020, up 25% from\n2019.\n\n     Darcy Taylor, Founder and CEO of LEAF Mobile, said: \"The mobile games\nmarket will gain increasing popularity in the next ten years, with\nfree-to-play games acting as the industry's foremost segment. London is a\nglobal hub for video gaming, creative industries and technological\ninnovation and a London Stock Exchange listing will help LEAF Mobile to\nposition itself at the forefront of the sector's growth. Moreover, the dual\nlisting will provide us with a springboard to achieve our ambitious growth\nobjectives in Europe and enhance our access to London's deep and advanced\ncapital markets.\"\n\n     Reasons for LSE listing\n\n     LEAF considers that admission to trading on the Main Market of the LSE\nwill:\n\n*  Allow the Company to access a wider range of potential investors and\nbroaden its investor base;\n*  Enable the Company to reach institutional investors in the U.K. and\nEurope;\n*  Increase share trading liquidity;\n*  Assist the Company in establishing a European base of operations in\nLondon as it expands through M&amp;A activities and the hiring of additional\nstaff; and\n*  Boost the profile of the Company as the U.K. capital markets are\nrecognised by both U.K. and international gaming companies and the U.K.\nenjoys a sophisticated investor base familiar with the sector.\n\n     Company highlights\n\n     LEAF was incorporated in 2018 with the objective to lead the\nfree-to-play mobile game space through a distributed development &amp;\npublishing studio structure and proprietary Game Kit software that can\nchange the framework of mobile game companies. LEAF is the parent company\nof a group comprising operating subsidiaries LDRLY, a developer and\npublisher of 'casual or idle mobile games'* for mobile that was acquired on\nApril 17th 2020, and East Side Games (\"ESG\"), a mobile game developer and\npublisher specialising in free-to-play casual mobile games that was\nacquired on 5 February 2021.\n\n     The Company is a developer and publisher of casual mobile games that\nare suitable for play on a wide range of devices, including mobile phones\nand tablets. The Company's revenues are primarily generated through in-app\npurchases or in-game advertising sold to third parties. Additionally, the\nCompany derives income from the licensing of proprietary software\ntechnology \"Game Kit\" to third party developers. The Company pursues a\ngrowth strategy based on broadening the game portfolio, growing the\naudience, increasing revenue from proprietary technology and acquiring\naccretive M&amp;A targets.\n\n     LEAF Mobile revenue year to date as of Sept 30, 2021's as reported was\nCAD$64.6 million, a 32.1% rise compared to the same period last year.\n\n     The Company is best known for famous franchise game titles and\ncurrently publishes and operates an 11-game portfolio. Among these, some of\nESG's successful franchise titles include Trailer Park Boys: Grea$y Money,\ncurrently streaming on Netflix; RuPaul's Drag Race Superstar, based on the\naward-winning reality TV show; Archer: Danger Phone; and It's Always Sunny:\nThe Gang Goes Mobile.\n\n     RuPaul's Drag Race Superstar is the newest addition to the ESG stable\nof games. Following its worldwide launch last month, the game has been\ndownloaded over one million times and has averaged over 150,000 Daily\nActive Users. The game has also ranked in the top 100 grossing iOS games in\n40 countries according to AppAnnie data, which also found that the game\nreached the #1 ranked role playing iOS game in 44 countries.\n\n     Similarly, LDRLY's leading counterculture game portfolio includes hit\ntitles such as Cheech and Chong Bud Farm and Bud Farm - Idle Tycoon which\nare part of the popular mobile game franchise, Bud Farm, that has been\nplayed by over 40 million people around the world since launch. LEAF's\nupcoming pipeline includes The Office: Somehow We Manage, inspired by the\nU.S. version of NBC's The Office.\n\n     The Company is pleased to provide retail investors the opportunity to\nparticipate in the raise exclusively through the PrimaryBid mobile app\navailable on the Apple App Store and Google Play. PrimaryBid does not\ncharge investors any commission for this service.\n\n     Tennyson Securities is acting as Bookrunner and Corporate Broker for\nthe Company.\n\n     For further information please contact:\n\n(figure style=\"width:100.0%;\")\n//st\n\n  LEAF Mobile Inc.\n\n  Darcy Taylor, Chief Executive            via Tancredi +44 207 887 7633\n\n  Tennyson Securities\n\n  Corporate Broker Peter Krens             +44 7960 934 405\n\n  PrimaryBid\n\n  Retail Broker James Deal / Fahim         enquiries@primarybid.com\n  Chowdhury\n\n  Tancredi Intelligent Communication\n  Media Relations\n\n  Salamander Davoudi Helen Humphrey        +44 7957 549 906 +44 7449 226\n  Benedetta Negri da Oleggio Fabio         720 +44 7838 029 970\n  Galloni Roversi Monaco\n  leafmobile@tancredigroup.com\n\n//et\n\n(/figure)     Notes to Editors\n\n     Sector Overview\n\n     Casual and idle games* are a segment within the mobile games market\ntypified by evolving narratives and strategies, easy to learn gameplay, and\ngames that can be played in a few minutes or run by themselves for long\nperiods of time. They are targeted at a mass market audience and are\ntypically suitable for play on a wide range of devices, including mobile\nphones and tablets. A casual or idle game is one by which step-by-step\nprogression is a prominent feature of the gameplay.\n\n     The mobile games market is expected to grow by 4% year-on-year in 2021\nand will continue to grow faster than the total games market up to 2023,\naccording to Newzoo.\n\n     In-game advertising provides an additional growth tenet. As mobile\ngames become increasingly popular, advertisers have become more interested\nin utilising the medium to reach consumers. Based on data from App Annie,\n74% of advertising on mobile apps is delivered through games, which the\nCompany believes reflects the realisation by advertisers that gamers no\nlonger skew younger and can be a method of reaching a wide variety of\ndemographics. According to TechCrunch3, the average age of a gamer in 2019\nwas 36.3 versus 27.7 in 2014, and the gender mix is now 51% female.\n\n     Game Kit\n\n     The Company's key proprietary technology is owned and developed by\nESG. ESG's core software technology, known as \"Game Kit\", is an internally\ndeveloped proprietary game framework for reducing the development time to\nmarket for mobile games, thereby reducing cost and de-risking by increasing\neach game's likelihood of success with its proven monetisation framework.\nThe average time to build and launch a mobile game is twelve to eighteen\nmonths. With Game Kit's Idle genre framework, development teams can cut\nproduction time decreasing the cost and time-to-market. LEAF also licences\nGame Kit-Idle to third party developers via a SaaS business and revenue\nshare model. The Company pursues revenue diversification from developers\nusing the Game Kit-Idle platform, allowing the Company to lower risk but\nmaintain upside. LEAF has also developed other kits, such as Game Kit-NFT,\nwhich allows for NFTs in mobile games.\n\n     Leadership\n\n     The Company benefits from an experienced team with a proven track\nrecord in IP management and marketing, game development and publishing,\nincluding over 60 years of combined experience on mobile games with:\nHothead Games, Magellan Interactive, ESG, Nexon and over 50 years of\ncombined experience in IP management &amp; marketing with: CAA, Creative Labs,\nIMG (Now Endeavor), 20th Century Fox. The Board currently comprises five\nDirectors, who collectively have extensive experience in investment,\ncorporate finance and business acquisition, operation and development in\nthe casual gaming sector and are well placed to implement the Company's\nstrategy.\n\n     Senior Management\n\n     Darcy Taylor, Chief Executive Officer\n\n     Darcy has over 20 years of senior experience building companies and\nbrands in Asia, Europe and North America. He has a proven track record in\nC-suite and senior leadership roles at IMG Canada (now Endeavor LLC), Logic\nTechnologies Inc, JT International S.A. and MASEV Communications Inc. His\nexperience spans corporate, agency, and entrepreneurial environments.\nCurrently Darcy is a non-executive director of Cellular Goods plc, a\npublicly listed company on the Main Market of the London Stock Exchange\n(LSE: CBX).\n\n     Jim MacCallum, CFO\n\n     Mr. MacCallum has over 20 years of international financial and\noperational executive experience with multinational public companies and\n\"Big 4\" accounting firms. He has extensive capital markets, acquisitions,\nand financial reporting experience, and has worked in Canada, the US and\nEurope. For the past six years, Mr. MacCallum has served in various finance\nroles, most recently as SVP, Finance and Treasurer, and previous CFO, at\nWestport Fuel Systems (NASDAQ: WPRT, TSX: WPRT). Prior to Westport, he was\nVice President, Finance at Absolute Software (TSX: ABST) and served in\nseveral increasingly senior financial roles at Cisco Systems, Inc. Mr.\nMacCallum is a Chartered Professional Accountant (CPA, CA) in addition to\nbeing a Chartered Financial Analyst (CFA) and holds a B.A. Economics degree\nfrom the University of British Columbia and a graduate of the Advanced\nManagement Program at Harvard Business School.\n\n     Josh Nilson, Studio Head, East Side Games\n\n     With over 20 years in games and tech, the East Side Games (ESG)\nco-founder and ex-CEO is continuing to drive the business and culture at\nESG. Under his leadership, ESG's awards in 2020 included Pocket Gamers Top\n50 Mobile Game Makers, Globe and Mail Top 400 Canada's Top Growing\nCompanies, the winner in the first ever BC Business \"Business of Good\nAwards\" in the Indigenous Prosperity category.\n\n     Board of Directors\n\n     Michael Scott (\"Mike\") Edwards, Chairperson, Corporate Secretary and\nDirector\n\n     Mr. Edwards has a wealth of experience in building and scaling\nconsumer technology companies in private and public markets, including as\nan investor in Punch'd (acquired by Google), Wander (later acquired by\nYahoo), Summify (acquired by Twitter), BlueBat Games (acquired by Novomatic\nGroup, Retsly (acquired by Zillow) and Password Box (acquired by Intel). He\nco-founded LX Ventures, a publicly listed consumer internet foundry that\nacquired and scaled Mobio Technologies. Mr. Edwards co-founded Wyley\nInteractive, a mobile game engagement platform, which was acquired by\nZynga, and he co-founded Creative Labs, a venture capital backed startup\nfoundry that builds consumer technology companies by leveraging the\nCreative Artist Agency's access to talent and audience.\n\n     Gilbert Jason Walter (\"Jason\") Bailey, Chief Revenue Officer and\nDirector\n\n     Mr. Bailey is a founder of ESG. He is considered one of Canada's most\nexperienced gaming entrepreneurs. Prior to ESG, Mr. Bailey was a founder of\nSuper Rewards, which he sold in 2009. Super Rewards was a social game\nmonetisation platform which helped pioneer the free to play game model that\nis ubiquitous today. Over the last twenty years, he has been mentor to and\ninvestor in a variety of Canadian startups and technology companies.\n\n     Jonathan Franklin Bixby, Director\n\n     Mr. Bixby is a seasoned technology entrepreneur in both the private\nand public sector. He is the co-founder of a number of significant\ncompanies including Koho Financial, Canada's largest challenger bank, Guild\nEsports PLC (a listed Esports company on the LSE with David Beckham) and\nBlue Mesa Health (acquired by the Virgin Pulse). Mr. Bixby is a board\nmember of CTO.AI and a former Chairman of the Board of Argo Blockchain PLC\n(LSE Listed) and Darkvision Technologies (acquired by Koch Industries). He\nis a strategic adviser to Fastly (NASDAQ).\n\n     Franklin Derek (\"Derek\") Lew, Director\n\n     Mr. Lew is the President, Chief Executive Officer and a director of\nGrowthWorks Capital Ltd. (\"GWC\"), and the President and Chief Executive\nOfficer and/or a director of certain managed funds and operating\nsubsidiaries of GWC, all of which are active venture capital investors. Mr.\nLew is also a Partner with Initio Group Inc. (\"Initio\"), a Vancouver-based\nearly-stage angel investment firm, and is a lawyer with experience in the\nareas of corporate, commercial and real estate law. As CEO of GWC, and at\nInitio, Mr Lew is involved in overseeing these firms' venture capital and\nangel investments, respectively. Mr. Lew was Chair of the British Columbia\nInnovation Council (now \"Innovate BC\") (2013 - 2018), the Crown agency of\nthe Province of British Columbia responsible for the advancement of\ninnovative businesses and entrepreneurs in the province. Active in his\ncommunity, Mr. Lew is a director of the Frank and Joan Lew Charitable Trust\nand the FJL Housing Society, which focuses on matters related to social\nhousing in Vancouver's Downtown Eastside. Mr. Lew holds a Bachelor of Arts\nfrom the University of British Columbia and a Bachelor of Laws from the\nUniversity of Alberta and is a member of the Law Society of British\nColumbia.\n\n     Birgit Troy, Director\n\n     Ms. Troy currently serves as the COO / CFO of Canalyst. Prior to\njoining Canalyst, Ms. Troy was a Portfolio CFO at Volaris Group, the\nlargest operating group under Constellation Software (\"CSU\"), one of\nCanada's leading technology companies. Over the last 5 years, she has led\nM&amp;A efforts to acquire and integrate 15 operating companies into\nConstellation Software. Prior to Volaris, Ms. Troy was the CFO of Incognito\nSoftware Systems (acquired by Volaris) and VP Finance of TSO Logic\n(acquired by Amazon) and Strangeloop Networks (acquired by Radware).\n\n     This information is provided by RNS, the news service of the London\nStock Exchange. RNS is approved by the Financial Conduct Authority to act\nas a Primary Information Provider in the United Kingdom. Terms and\nconditions relating to the use and distribution of this information may\napply. For further information, please contact rns@lseg.com or visit\nwww.rns.com.\n\nTel   : 604-288-4418    LEAF MOBILE INC\nEmail : IR@leafmobile.io\nWWW   : <a href=\"https://www.leafmobile.io\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.leafmobile.io</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132100269.MNPRE2132101913-06562320211118</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}