{"date": "2021-11-19 22:12:02.354000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3696.06, "close": 3572.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>YUMY BEAR GOODS INC (\"YUMY-Z;FVGCF-0\")\n- Receives Initial Purchase Order from Purity Life Health\n- Products LP\n\n     Yumy Bear Goods Inc., (\"Yumy Bear Candy\" or the \"Company\") has\nreceived its initial order from Canada's Leading distributor of health\nproducts and confectionary specialist Purity Life Distributor.\n\n     Purity Life established in 1984 has been proud to supply Canada with\nthe highest quality natural healthy living products. With over 7,000 vendor\nlocations it has become the leading supplier for many health foods and\nconfectionery companies. Purity Life has been a main factor in establishing\nand distributing many great brands and companies in the confectionery\nspace, such as Smart Sweets, which was recently acquired for $360 million.\nPurity is one of Smart Sweets main distributors in Canada, where Yumy Bear\nGoods will make its initial target market.\n\n     Purity Life supplies almost all major retailers in Canada such as\nWhole Foods, Loblaws, Shoppers Drug Mart, and many more. Many of these\nchains are the most significant chains in the country with retail sales and\nrevenues in the billions.\n\n     \"We are very excited to be working with Purity Life, an established\nleader in the \"Good For You\" confectionary space. After many talks with\nmanagement, we are happy to find a group just as passionate about our\nproduct as we are. Furthermore, we are very excited about the potential\ngrowth between us as we expect to be in thousands of retail locations in\nthe next 12 months through their distribution channel. Between Purity Life\nand our existing retail distribution we are aiming to be the leading\nconfectionery company in the space\" states CEO, Erica Williams.\n\n     Yumy Bear is an affordable health-conscious low-sugar plant-based\nconfectionery company based in Vancouver, British Columbia and it has\ndeveloped a portfolio of healthier gelatine-free candies made from non-GMO\ningredients with proprietary recipes. All of its products are free of\ngelatin, soy, gluten, nuts, dairy, eggs, sugar alcohols, artificial\nsweeteners and genetically modified organisms.\n\n     Cautionary Statement Regarding Forward-Looking Information\n\n     Except for the statements of historical fact, this news release\ncontains \"forward-looking information\" within the meaning of the applicable\nsecurities legislation. The information in this news release about future\nplans and objectives of the Company, are forward-looking information. This\nforward-looking information is based on reasonable assumptions and\nestimates of management of the Company at the time it was made, and\ninvolves known and unknown risks, uncertainties and other factors which may\ncause the actual results, performance or achievements of the Company to be\nmaterially different from any future results, performance or achievements\nexpressed or implied by such forward-looking information. Such factors\ninclude, among others: general business, economic and social uncertainties;\nlocal and global market and economic uncertainties arising in respect of\nthe COVID-19 pandemic; litigation, availability of key product ingredients,\nlegislative, environmental and other judicial, regulatory, political and\ncompetitive developments; the ability to effectively expand manufacturing\nand production capacity; the ability to obtain retail partners to\ndistribute Company products, the success of market initiatives and the\nability to grow brand awareness; the ability to attract, maintain and\nexpand relationships with key strategic vendors; our ability to predict\nconsumer taste preferences; delay or failure to receive regulatory\napprovals; the sufficiency of our cash to meet liquidity needs; those\nadditional risks set out in the Company's public documents filed on SEDAR\nat www.sedar.com; and other matters discussed in this news release.\nAccordingly, the forward-looking statements discussed in this release may\nnot occur and could differ materially as a result of these known and\nunknown risk factors and uncertainties affecting the Company. Although the\nCompany believes that the assumptions and factors used in preparing the\nforward-looking statements are reasonable, undue reliance should not be\nplaced on these statements, which only apply as of the date of this news\nrelease, and no assurance can be given that such events will occur in the\ndisclosed time frames or at all. Except where required by law, the Company\ndisclaims any intention or obligation to update or revise any forward-\nlooking statement, whether as a result of new information, future events,\nor otherwise.\n\nContact Information:\n\nErica Williams, CEO, Telephone: (604) 449-2026\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132200428.MNPRE2132201880-13254020211119</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}