{"date": "2021-11-27 00:19:08.981000+00:00", "ticker": "III", "mrkt_info": {"open": 1444.5, "close": 1388.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENBRIDGE INC (\"ENB-TN\")\n- Canada Energy Regulator Issues Mainline Contracting Regulatory\n- Decision\n\n     Enbridge Inc. (Enbridge or the Company) received a decision from the\nCanada Energy Regulator (CER) on the Company's commercial proposal to offer\ntransportation contracting on its Mainline pipeline system, which moves\napproximately 3 million barrels a day of liquids from Edmonton, AB to\nessential U.S. demand centers.\n\n     Enbridge submitted a regulatory application to the CER in December\n2019 to offer contracted transportation service on the Mainline pipeline\nsystem and participated in a rigorous regulatory process in 2020 and 2021.\nThroughout the regulatory review, the offering has been supported by over\n75% of Mainline shippers, by volume, reflecting its competitive toll and\noverall shipper benefits.\n\n     Enbridge is currently reviewing the CER's decision. We will provide\nfurther comment after completing that review.\n\n     About Enbridge Inc.\n\n     Enbridge Inc. is a leading North American energy infrastructure\ncompany. We safely and reliably deliver the energy people need and want to\nfuel quality of life. Our core businesses include Liquids Pipelines, which\ntransports approximately 25 percent of the crude oil produced in North\nAmerica; Gas Transmission and Midstream, which transports approximately 20\npercent of the natural gas consumed in the U.S.; Gas Distribution and\nStorage, which serves approximately 3.8 million retail customers in Ontario\nand Quebec; and Renewable Power Generation, which owns approximately 1,766\nmegawatts (net) in renewable power generation capacity in North America and\nEurope. The Company's common shares trade on the Toronto and New York stock\nexchanges under the symbol ENB. For more information, visit\nwww.enbridge.com.\n\n     FOR FURTHER INFORMATION PLEASE CONTACT:\n\n     Media Toll Free: (888) 992-0997\n     Email: media@enbridge.com\n\n     Investment Community Toll Free: (800) 481-2804\n     Email: investor.relations@enbridge.com\n\nWWW   : <a href=\"https://www.enbridge.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.enbridge.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132900265.MNPRE2132901164-16165520211126</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}