{"date": "2021-07-30 07:22:45.404000+00:00", "ticker": "AAF", "mrkt_info": {"open": 82.5, "close": 89.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 0499HAirtel Africa PLC30 July 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>30 July 2021</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>THIS ANNOUNCEMENT CONTAINS INSIDE INFORMATION</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Airtel Africa plc</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>(\"Airtel Africa\", or the \"Group\")</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>QIA to invest $200 million in Airtel Africa's mobile money business, at $2.65 billion valuation.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>London and Lagos: 30 July 2021:</span>\n</span>\n<span>Airtel Africa, a leading provider of telecommunications</span>\n<span>and mobile money services, with a presence in 14 countries across Africa, today announces the signing of an agreement under which Qatar Holding LLC, an affiliate of the Qatar Investment Authority (\"QIA\"), will invest $200 million in Airtel Mobile Commerce BV (\"AMC BV\"), a subsidiary of Airtel Africa plc (the \"Transaction\")</span>\n<span>.</span>\n<span>AMC BV is the holding company for several of Airtel Africa's mobile money operations; and ultimately is intended to own and operate the mobile money businesses across all of Airtel Africa's fourteen operating countries.</span>\n</p>\n<p>\n<span>The Transaction values Airtel Africa's mobile money business at $2.65 billion on a cash and debt free basis. QIA will hold a minority stake in AMC BV upon completion of the Transaction (alongside other minority investors), with Airtel Africa continuing to hold the majority stake. The Transaction is subject to customary closing conditions.</span>\n</p>\n<p>\n<span>Following the announcement on 18 March 2021 of a $200m investment in AMC BV by TPG's The Rise Fund, on 1 April 2021 of a $100m investment in AMC BV by MasterCard and the sale of the Group's telecommunication towers companies in Madagascar and Malawi on 23 March 2021, the Transaction is a continuation of</span>\n<span>\n<span>the Group's pursuit of strategic asset monetization and investment opportunities, and i</span>\n<span>t is the aim of Airtel Africa to explore the potential listing of the mobile money business within four years.</span>\n</span></p>\n<p>\n<span>The proceeds from the Transaction will be used to reduce Group debt and invest in network and sales infrastructure in the respective operating countries.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Airtel Africa mobile money services</span>\n</p>\n<p>\n<span>Operating under the Airtel Money brand, Airtel Africa's mobile money services is a leading digital mobile financial services platform catering to a large addressable market in Africa (characterised by limited access to formal financial institutions with limited banking infrastructure) and includes mobile wallet deposit and withdrawals, merchant and commercial payments, benefits transfers, loans and savings, virtual card and international money transfers.</span>\n</p>\n<p>\n<span>Mobile money services are available across the Group's 14 countries of operation, however in Nigeria the Group offers Airtel Money services through a partnership with a local bank and has applied for its own mobile banking licence. It is the intention that all mobile money operations will be owned and operated by AMC BV.</span>\n</p>\n<p>\n<span>In our most recent reported results for Q1'22, the mobile money services (corresponding to all the businesses that are intended to be transferred to AMC BV) delivered a strong operational performance:</span>\n</p>\n<p>\n<span>·</span>\n<span>Generated revenue of $124m ($496m annualised), and underlying EBITDA of $60m ($240m annualised) at a margin of 48.8%.</span>\n</p>\n<p>\n<span>·</span>\n<span>Year on year revenue growth for the quarter was 53.7% in constant currency, largely driven by 24.6% growth in the customer base to 23.1 million, and 25.4% ARPU growth.</span>\n</p>\n<p>\n<span>·</span>\n<span>Growth in transaction value was 64.4% (constant currency) to $14.7bn ($59bn annualised).</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Our mobile money business benefits from strong network presence with our core telecom business through the extensive distribution platform of kiosks and mini shops as well as dedicated Airtel Money branches supplementing our extensive agent network, to facilitate customers' access to assured wallet and cash.</span>\n</p>\n<p>\n<span>We have a clear strategy to continue to drive sustainable long-term growth in Airtel Money with a focus on assured float availability, distribution expansion and increased usage cases for our customers.</span>\n</p>\n<p>\n<span>Last year we added partnerships with Mastercard, Samsung, Asante, Standard Chartered Bank, MoneyGram, Mukuru and WorldRemit to expand both the range and depth of the Airtel Money offerings and to further drive customer growth and penetration.</span>\n</p>\n<p>\n<span>The profits before tax in the full year ending 31 March 2021 and the value of gross assets as of that date, attributable to the mobile money businesses were $185m and $668m, respectively.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Key elements of the Transaction</span>\n</p>\n<p>\n<span>·</span>\n<span>Agreement values Airtel Africa's mobile money business at $2.65bn on a cash and debt free basis.</span>\n</p>\n<p>\n<span>·</span>\n<span>AMC BV, a subsidiary of Airtel Africa,</span>\n<span>is the holding company for several of Airtel Africa's mobile money operations; and it is intended that ultimately it shall own and operate the mobile money businesses across all of Airtel Africa's fourteen operating countries once the inclusion of the</span>\n<span>remaining mobile money operations under AMC BV perimeter is completed.</span>\n</p>\n<p>\n<span>·</span>\n<span>QIA will invest $200m through a secondary purchase of shares in AMC BV from Airtel Africa.</span>\n<span>The transaction will close in two stages.</span>\n<span>$150m will be invested at first close,</span>\n<span>subject to customary closing conditions including necessary regulatory filings,</span>\n<span>with $50m to be invested at second close once further transfers of certain mobile money operations and contracts into the AMC BV perimeter have been completed.</span>\n</p>\n<p>\n<span>The Transaction first close is expected in August. From first close, QIA will be entitled to appoint a director to the board of AMC BV and to certain customary information and minority protection rights.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Raghunath Mandava, CEO of Airtel Africa, commented:</span>\n</p>\n<p>\n<span>\"</span>\n<span>With today's announcement we are pleased to welcome QIA as a prospective investor in our mobile money business, joining both Mastercard and TPG's The Rise Fund as a further partner to help us realise the full potential from the substantial opportunity to bank the unbanked across Africa</span>\n<span>.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Mansoor bin Ebrahim Al-Mahmoud, CEO of QIA, commented:</span>\n</p>\n<p>\n<span>\"We are delighted to build on our support of Airtel Africa in promoting financial inclusion to the large and growing population of Sub-Saharan Africa. Airtel Money plays a critical role in facilitating economic activity, including for customers without access to traditional financial services. We firmly believe in its mission to expand these efforts over the coming years.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>-ENDS-</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Enquiries</span>\n</p>\n<p>\n<span>\n</span></p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>Airtel Africa - Investor Relations</span>\n</p>\n<p>\n<span>Pier Falcione</span>\n</p>\n<p>\n<span>Morten Singleton</span>\n</p>\n<p>\n<span>\n<span>\n<a href=\"mailto:Investor.relations@africa.airtel.com\" data-type=\"email\" translate=\"no\">Investor.relations@africa.airtel.com</a>\n</span>\n</span>\n</p>\n</td>\n<td>\n<p>\n<span>+44 207 493 9315</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Hudson Sandler</span>\n</p>\n<p>\n<span>Nick Lyon</span>\n</p>\n<p>\n<span>Bertie Berger</span>\n</p>\n<p>\n<span>\n<span>\n<a href=\"mailto:airtelafrica@hudsonsandler.com\" data-type=\"email\" translate=\"no\">airtelafrica@hudsonsandler.com</a>\n</span>\n</span>\n</p>\n</td>\n<td>\n<p>\n<span>+44 207 796 4133</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<p>\n<span>The person responsible for making this announcement is Simon O'Hara, Group Company Secretary.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>About Airtel Africa</span>\n</p>\n<p>\n<span>Airtel Africa is a leading provider of telecommunications and mobile money services, with a presence in 14 countries in Africa, primarily in East Africa and Central and West Africa.</span>\n</p>\n<p>\n<span>Airtel Africa offers an integrated suite of telecommunications solutions to its subscribers, including mobile voice and data services as well as mobile money services, both nationally and internationally.</span>\n</p>\n<p>\n<span>The Group aims to continue providing a simple and intuitive customer experience through streamlined customer journeys.</span>\n</p>\n<p>\n<span>For more information visit</span>\n<span>\n<span>\n<a href=\"https://www.airtel.africa/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.airtel.africa/</a>\n</span>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>About QIA</span>\n</p>\n<p>\n<span>Qatar Investment Authority (\"QIA\") is the sovereign wealth fund of the State of Qatar. QIA was founded in 2005 to invest and manage the state reserve funds. QIA is among the largest and most active sovereign wealth funds globally. QIA invests across a wide range of asset classes and regions as well as in partnership with leading institutions around the world to build a global and diversified investment portfolio with a long-term perspective that can deliver sustainable returns and contribute to the prosperity of the State of Qatar.</span>\n</p>\n<p>\n<span>For more information visit</span>\n<span>\n<a href=\"https://www.qia.qa/Default.aspx\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.qia.qa</a>\n</span>\n</p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>MSCGLGDRUSXDGBG</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}