{"date": "2021-11-01 22:21:11+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds context on fund raise; industry background</p><p class=\"tr-by\">By Noor Zainab Hussain</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Nov 1 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Rivian Automotive Inc, which is backed by Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, is targeting a valuation of more than $53 billion for its U.S. debut, making the electric vehicle manufacturer potentially almost as valuable as rival Honda Motor <a href=\"reuters://REALTIME/Verb=FullQuote/ric=7267.T\" data-type=\"ric\" data-ric=\"7267.T\" translate=\"no\" dir=\"ltr\">7267.T</a>. </p><p>The startup is looking to raise up to $8.4 billion, setting it up to be the third-largest initial public offering (IPO) by funds raised in the past decade in the United States.</p><p>Only three other companies have raised more than $8 billion while going public since 2011, according to data from Dealogic.</p><p>Alibaba <a href=\"reuters://REALTIME/Verb=FullQuote/ric=9988.HK\" data-type=\"ric\" data-ric=\"9988.HK\" translate=\"no\" dir=\"ltr\">9988.HK</a> raised a record $25 billion in 2014, Meta Platforms Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a> garnered $16 billion in 2012, while Uber <a href=\"reuters://REALTIME/Verb=FullQuote/ric=UBER.N\" data-type=\"ric\" data-ric=\"UBER.N\" translate=\"no\" dir=\"ltr\">UBER.N</a> made $8.1 billion in 2019.</p><p>Since last year, companies in the EV space have emerged as some of the hottest investments, especially among SPAC investors on the hunt for the next Tesla Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TSLA.O\" data-type=\"ric\" data-ric=\"TSLA.O\" translate=\"no\" dir=\"ltr\">TSLA.O</a>. </p><p>     While Rivian has yet to sell any significant volume of its electric vans or trucks, it could likely be valued higher than Ferrari <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RACE.MI\" data-type=\"ric\" data-ric=\"RACE.MI\" translate=\"no\" dir=\"ltr\">RACE.MI</a>, although less than Honda, General Motors <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GM.N\" data-type=\"ric\" data-ric=\"GM.N\" translate=\"no\" dir=\"ltr\">GM.N</a> or its backer Ford Motor Co <a href=\"reuters://REALTIME/Verb=FullQuote/ric=F.N\" data-type=\"ric\" data-ric=\"F.N\" translate=\"no\" dir=\"ltr\">F.N</a>.</p><p>Founded in 2009 as Mainstream Motors by R. J. Scaringe, the company changed to Rivian in 2011, a name that is derived from \"Indian River\" in Florida, a place Scaringe frequented in a rowboat as a youth.</p><p>The startup has been investing heavily to ramp up production, including for its upscale all-electric R1T pickup truck, which was launched in September, beating out competition from established rivals such as Tesla, General Motors and Ford.</p><p>Rivian, which disclosed nearly $1 billion in losses for the first half of this year, had about 48,390 pre-orders for its pickup trucks and R1S SUVs in the United States and Canada as of September.</p><p>It is currently pursuing a two-track strategy: building electric delivery vans for Amazon and developing an electric pickup and SUV brand aimed at affluent individuals.</p><p>Amazon, which disclosed a 20% stake in Rivian at the end of October, has ordered 100,000 of its electric delivery vans as part of the e-commerce giant's effort to cut carbon footprint.</p><p>Ford holds a more than 5% share in the EV startup, according to a filing with the U.S. Securities and Exchange Commission. </p><p><br/></p><p>STIFF COMPETITION</p><p>Rivian, which confidentially filed paperwork for an IPO in August, will, however, face tough competition from automakers in both the consumer and commercial van markets. </p><p>Ford said last week it has more than 160,000 orders for its F-150 Lightning electric pickup truck and that an electric version of its Transit commercial van is \"completely sold out.\" </p><p>General Motors is gearing up production of electric delivery vans, SUVs and pickup trucks.</p><p>Rivian said it would sell 135 million shares at a price range of between $57 and $62 each. Reuters reported in September that it could seek a valuation of nearly $80 billion and raise up to $8 billion in its U.S. listing. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2QX30O\" data-type=\"storyId\" data-story-id=\"nL4N2QX30O\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> </p><p>Morgan Stanley, Goldman Sachs and J.P. Morgan are the lead underwriters. Rivian will list on the Nasdaq under the symbol \"RIVN\".</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Noor Zainab Hussain and Niket Nishant in Bengaluru; Additional reporting by Sanjana Shivdas; Editing by Arun Koyyur)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Niket.Nishant@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Niket.Nishant@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: RIVIAN-IPO/ (UPDATE 4, PIX)</p></div>"}