{"date": "2021-12-01 14:15:00.086000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>SUNNYVALE, Calif., Dec.  01, 2021  (GLOBE NEWSWIRE) -- Matterport, Inc. (“Matterport”) (Nasdaq: MTTR), the leading spatial data company driving the digital transformation of the built world, today announced the availability of its platform in <a href=\"https://www.globenewswire.com/Tracker?data=2YMq_w8N5ooYLATPaGxhiiug7AB2N4QW57WtSJcCc3oSY4MygLVwOOz8LoHNoITZCKBnVg2PRvgEDgzpI-VvUOr-xJi3vCs94YrO1FuKO9w_7oO2b6mNPpHh6as_jB0YtWZncnsOSBYUYss1ZhvQPA==\"><u>AWS Marketplace</u></a>, an online software store that helps customers find, buy, and immediately start using the software and services that run on Amazon Web Services (AWS). As a result, AWS customers will be able to access the power and capabilities of Matterport’s digital twin technology with AWS add-ons that supercharge the value of digitization. In addition, they will benefit from the joint offerings that the companies take to market. Matterport and AWS will collaborate amongst technical teams to build deep technology integrations, as well as their sales and marketing teams to serve new enterprise customers.<br/></p><p>“With the hundreds of fully featured AWS services, we’re excited that our customers can now easily capture their spaces and incorporate the Matterport spatial data platform into a wide range of solutions,” said Prabal Acharyya, Global Head of IoT Partners for Energy and Process Industries at AWS. “Matterport is uniquely positioned to help customers of all types take full advantage of integrating their AWS cloud provider services with their digital twins, accelerating the digitization of their spaces, while harnessing the power of their data assets.”</p><p>Hundreds of thousands of companies in over 170 countries use Matterport’s spatial data platform to turn any space into a photorealistic, dimensionally accurate digital twin. As an official AWS Independent Software Vendor (ISV) Partner and member of the AWS Partner Network (APN), Matterport will reach companies across the world that need a simple and cost-effective way to digitize their buildings and spaces. And, they can access a free trial to instantly capture digital twins on their iOS or Android devices. </p><p>“Although our digital twin vision was designed to enhance the operator and mechanic experience, we quickly expanded our use cases to include training, employee orientation, and office space optimization. Moving forward, I anticipate identifying even more opportunities to use Matterport throughout our organization,” says Dane Laughlin, Innovation Engineer at INVISTA, a world leader in supplying nylon 6,6 chemical intermediates, polymers and fibers used in the automotive, electronics, carpet and clothing industries.</p><p><strong>Matterport Delivers Groundbreaking Enterprise IoT Solution</strong><br/>With over six million spaces captured to date, Matterport is building the largest library of spatial data and information and it’s open for innovation through its developer tools. Matterport’s Application Programming Interfaces (APIs) and Software Development Kits (SDKs) allow its partners to build new solutions and custom add-ons on top of its platform to address multiple use cases across an array of industries.</p><p>Matterport will work with AWS to develop and deliver best-in-class enterprise solutions that leverage Matterport digital twins. The first offering launched today by AWS is AWS IoT TwinMaker, a new service that makes it easier for developers to create digital twins for the IoT (Internet of Things), smart buildings, industrial, and manufacturing industries. With Matterport as a launch partner, AWS IoT TwinMaker allows customers to contextualize their digital twin data, gather insights and analytics, as well as virtually access real-time and time-series replicas of their spaces. Groundbreaking capabilities include:</p><ul type=\"disc\" class=\"bulleted-list arrowlist\"><li>The ability to create 3D scenes with spatial anchors linked to real-world data. Customers can take a Matterport digital twin, overlay equipment within it, then tag the space with anchors to connect those models with a knowledge graph created and managed by AWS IoT TwinMaker. This knowledge graph enables the integration of data, such as heat mapping or temperature control, into the Matterport digital twin. </li><li>Better facilities management by establishing real-time remote monitoring, process optimization and historical root cause analysis. Customers can connect to disparate data sources to optimize site visits and assess issues immediately. </li><li>The option to build user-centric web apps on top of digital twins, whether it's an app for training employees, or an app to trigger notifications if there is an abnormal change in the device data.<br/></li></ul><p>“AWS IoT TwinMaker is a perfect example of how companies like AWS can work with Matterport to create unique and valuable experiences for our mutual enterprise customers. This demonstrates Matterport’s unique ability to serve as the primary visualization layer of any space that enables a contextual view of the data and analytics associated with that space, as well as real-time and time-series access to them,\" said Conway Chen, Vice President of Business Development and Alliances at Matterport. “We’re seeing Matterport being used as the fabric of the built world, supercharging use cases across the board from smart buildings, smart homes, and more, ultimately unlocking digital twin technology with unmatched AI and deep learning analytics.”</p><p>For more information about how Matterport is working with AWS, please visit the <a href=\"https://www.globenewswire.com/Tracker?data=EjVCQmFSHtkLRImkEW73U_-G5IQjxkPA4-R32alUzBtr4z1qybNJQLMBit-1cvhCEvvE6wlSoay7klxYKadifubxbKGG5vevjvgaowlW9nQUGfIwjX1lRIKhN6_Z8KtW\"><u>AWS IoT TwinMaker webpage</u></a>.</p><p><strong>About Matterport</strong><br/>Matterport, Inc. (Nasdaq: MTTR) is leading the digital transformation of the built world. Our groundbreaking spatial data platform turns buildings into data to make nearly every space more valuable and accessible. Millions of buildings in more than 170 countries have been transformed into immersive Matterport digital twins to improve every part of the building lifecycle from planning, construction, and operations to documentation, appraisal and marketing. Learn more at <a href=\"https://www.globenewswire.com/Tracker?data=tEyfLaoqQbo2dwJU2J6yOdOVvCntq4aqUl4gDd0cYKtxotG4S2pgnZA1WWaXrmSpYrl3gP9nkSkq2-mI9aKKMQ==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">matterport.com</a> and browse a <a href=\"https://www.globenewswire.com/Tracker?data=QLX0gXxqol5jgw1hX4vK-Tukb71dxQjCnEWrEBhAAd2d8BoUB5nDQOzJCqP6v90Hkpf29qJE9OPS6iNGcn80Ivh6Q2cYwmyf-huzywyWbZajn3w6oOplZg6hDpqhIDG5\" data-type=\"url\" class=\"tr-link\" translate=\"no\">gallery of digital twins</a>.</p><p>©2021 Matterport, Inc. All rights reserved. Matterport is a registered trademark and the Matterport logo is a trademark of Matterport, Inc. All other marks are the property of their respective owners.</p><p>Media Contact:<br/>Tim McDowd<br/>Director, Communications<br/><u><a href=\"https://www.globenewswire.com/Tracker?data=ce77AxOGVaRmx2veiEhHMLXJnvBNb1aPfkPQb6TR-xMDY_PyYF86fFTg1FHLXDUFH2hybpIHs85c5__vUIWY1tafl3rgsuMrQdX2i8U7IEo=\">press@matterport.com<br/></a></u>+1 (650) 273-6999</p><p>Investor Contact: <br/>Soohwan Kim, CFA<br/>VP, Investor Relations<br/><a href=\"https://www.globenewswire.com/Tracker?data=OKyHW_KMNJ-8pXBT0CljL6WJBuxz17acXzHTpIZV3EsAulqY5vRQArxY9vzxUIzpide-CN9AYh7eA1M9vW2pQw==\"><u>ir@matterport.com</u></a></p><p>Forward-Looking Statements<br/>This document contains certain forward-looking statements within the meaning of the federal securities laws, including statements regarding the benefits of the business combination, the services offered by Matterport, Inc. (“Matterport”) and the markets in which Matterport operates, business strategies, debt levels, industry environment, potential growth opportunities, the effects of regulations and Matterport’s projected future results. These forward-looking statements generally are identified by the words “believe,” “project,” “expect,” “anticipate,” “estimate,” “intend,” “strategy,” “future,” “forecast,” “opportunity,” “plan,” “may,” “should,” “will,” “would,” “will be,” “will continue,” “will likely result,” and similar expressions (including the negative versions of such words or expressions).<br/>Forward-looking statements are predictions, projections and other statements about future events that are based on current expectations and assumptions and, as a result, are subject to risks and uncertainties. Many factors could cause actual future events to differ materially from the forward-looking statements in this document, including the expected benefits of Matterport’s partnership with Amazon Web Services, Matterport’s ability to implement business plans, forecasts, and other expectations in the industry in which Matterport competes, and identify and realize additional opportunities. The foregoing list of factors is not exhaustive. You should carefully consider the foregoing factors and the other risks and uncertainties described in documents filed by Matterport from time to time with the U.S. Securities and Exchange Commission (the “SEC”). These filings identify and address other important risks and uncertainties that could cause actual events and results to differ materially from those contained in the forward looking statements. Forward-looking statements speak only as of the date they are made. Readers are cautioned not to put undue reliance on forward-looking statements, and Matterport assumes no obligation and, except as required by law, does not intend to update or revise these forward-looking statements, whether as a result of new information, future events, or otherwise. Matterport does not give any assurance that it will achieve its expectations.</p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODQwMzU5OSM0NTkwNTkyIzIxOTQ5OTc=\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RRd016VTVPU00wTlRrd05Ua3lJekl4T1RRNU9UYz0=&amp;key=48fda62884df2a84375f4dc25f416a41c607ee53968ccc46d3791b8811f2769fa39c94fd7e6baaeaea521ef9b4f8bf8aa376fb0d0b513f22e81e9f7f991f5ed1\"/></div></div><br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/OTA1MTM2MGItZjVjZi00NjQ2LTlkNzItZTdlOGI0NTI2MmUwLTEyMDY1NTA=/tiny/Matterport-Inc.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9PVEExTVRNMk1HSXRaalZqWmkwME5qUTJMVGxrTnpJdFpUZGxPR0kwTlRJMk1tVXdMVEV5TURZMU5UQT0vdGlueS9NYXR0ZXJwb3J0LUluYy5wbmc=&amp;key=98813dcdc07c4bdc83c43df8a8fda0a091c09217bcbd98ea77d1c1eedb5e0c0b7ed4468149453aaa6713c78723a808c670129608eecf8063556fed60572de144\"/></div></div><p><a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/3927ac58-02cc-4cf6-85b8-ccf04a60e5f3\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Primary Logo\" border=\"0\" src=\"https://ml.globenewswire.com/media/3927ac58-02cc-4cf6-85b8-ccf04a60e5f3/small/matterport-logo-to-go-with-all-press-releases-high-res-png.png\" style=\"max-height:84px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS8zOTI3YWM1OC0wMmNjLTRjZjYtODViOC1jY2YwNGE2MGU1ZjMvc21hbGwvbWF0dGVycG9ydC1sb2dvLXRvLWdvLXdpdGgtYWxsLXByZXNzLXJlbGVhc2VzLWhpZ2gtcmVzLXBuZy5wbmc=&amp;key=4ea1d5064d4e67348d0e93c23d52a66242163972e8d1f74f46b07e48294874ffa7a1b46224206cef8ef30dfa81c435832748e705befb5dc8eb570f5dbf55a112\"/></div></div></a></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">GlobeNewswire, Inc. 2021</p></div>"}