{"date": "2022-01-04 14:05:02+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">MORE THAN HALF OF QUEBEC COMPANIES LACK SUSTAINABLE BUSINESS POLICIES: SURVEY</p>\n<p>MONTRÉAL, Jan. 18, 2022</p>\n<p>\n<span>KPMG in <span>QUEBEC</span> announces the results of the \"Focus Quebec 2025\" study</span>\n</p>\n<p>MONTRÉAL, <span>Jan. 18, 2022</span> /CNW Telbec/ - Having sustainable development strategies and strong supply chains are key to support the growth and prosperity of <span>Quebec</span> entrepreneurs, according to findings from the KPMG in <span>Quebec</span> - Focus Quebec 2025 study conducted among companies across the province.</p>\n<p>\n\n</p>\n<p>\n<span>\"The results of our study show how <span>Quebec</span> entrepreneurs are ready to think big, both from an organizational and operational perspective. <span>Quebec</span> businesses, no matter their sizes, are essential to the province's growth and we believe it is vital to support them in addressing these critical issues. We will work together to help ensure the prosperity of our economy,\"</span> adds <span>Benoit Lacoste Bienvenue</span> , Regional Managing Partner, KPMG Canada, Quebec Region.</p>\n<p>More than half of companies surveyed say they do not have a sustainable development objective or policy in place. However, 68 percent of respondents, as consumers, say they are influenced by environmental, social and governance factors (ESG) in their consumption choices. In addition, 67 percent of respondents say ESG factors are an important consideration in their choice of employers.</p>\n<p>\n<span>\"The awareness of entrepreneurs to ESG criteria, revealed by KPMG's Focus Québec 2025 survey, offers many opportunities for <span>Quebec</span> companies to grow and develop their workforce. It is important to build on our strengths in research and innovation, as well as to encourage our entrepreneurs to collaborate and exchange, to help us stand out in national and international markets,\"</span> says <span>Pierre Fitzgibbon</span> , Minister of Economy and Innovation and Minister Responsible for Regional Economic Development.</p>\n<p>Nearly half of respondents say they must rethink their distribution network due to changes in consumer behaviour. Seventy-three percent of respondents, who are themselves consumers, say they now prefer to buy online and want fast, free delivery.</p>\n<p>To ensure organizations are able to meet the needs of their customers, solutions include positioning distribution centres closer to consumers, identifying the best-selling and most delivered products, or keeping a larger inventory of a limited number of best-selling products. Distribution network optimization can lead to a 5 to 10 percent reduction in operational costs.</p>\n<p>In-depth analyses of the survey results by region will continue throughout 2022 and will be announced to entrepreneurs across the province. A series of events will be organized in collaboration with companies established in the region, educational institutions and other business partners to promote the sharing of best practices. These events will be held in <span>Sherbrooke</span> , <span>Quebec City</span> , <span>Drummondville</span> , <span>Montreal</span> , as well as in the regions of Chaudière-Appalaches, Saguenay-Lac-Saint-Jean and Montérégie.</p>\n<p>\n<span>\"</span> Solutions are emerging and allow us to transition from awareness to action. These major challenges provide important elements of differentiation that companies must take advantage of. As a growth accelerator, we want to contribute to the emergence of these new leaders, <span>\"</span> adds <span>Pierre Marcouiller</span> , president of NEXCAP.</p>\n<p>\n<span>Survey Highlights</span>\n</p>\n<ul class=\"bulleted-list arrowlist\">\n<li>More than half of companies that responded to the survey said they do not have a sustainability goal or policy.</li>\n<li>68 percent of respondents say they are influenced as consumers by environmental, social and governance factors (ESG).</li>\n<li>The ESG factors that influence most respondents include supporting the local economy and local jobs and choosing recyclable and/or compostable materials.</li>\n<li>72 percent of respondents consider an organization to be an employer of choice when it takes a stand on a social issue that is consistent with their values.</li>\n<li>76 percent of respondents said sustainability is an important factor in the development of new products.</li>\n<li>Nearly half of respondents said they need to review their distribution network to reduce total supply chain costs (an important benefit for 72 percent of respondents) and meet changing consumer needs.</li>\n<li>73 percent of respondents said they buy online as soon as possible and want fast and free delivery.</li>\n</ul>\n<p>\n<span>About the Focus Quebec 2025 study</span>\n</p>\n<p>Of the 767 survey respondents, 64 percent hold an executive position and 200 hold a president position. The data collected <span>between September 29 and November 1, 2021</span> , throughout <span>Quebec</span> comes from companies of all sizes and from various sectors.</p>\n<p>For more information, visit the <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3415509-1&amp;h=589698658&amp;u=https%3A%2F%2Fkpmgclientsite.kpmg.ca%2Ffocus-quebec-en%2F&amp;a=Projet+Focus+Quebec%C2%A02025\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Projet Focus Quebec 2025</a> website.</p>\n<p>\n<span>KPMG in Quebec</span>\n</p>\n<p>KPMG LLP, an Audit, Tax and Advisory firm, is a limited liability partnership. KPMG in <span>Quebec</span> has more than 1,400 professionals and employees in six locations across the province serving private- and public-sector clients. KPMG is recognized as an employer of choice and one of the best places to work in the country. To learn about employment opportunities and submit your application, go to KPMG's careers website.</p>\n<p>The firm is established under the laws of <span>Ontario</span> and is a member of KPMG's global organization of independent member firms affiliated with KPMG International Limited, a private English company limited by guarantee.</p>\n<p>Each KPMG firm is a legally distinct and separate entity and describes itself as such. For more information, go to home.kpmg/ca/en.</p>\n<p>\n<span>Collaborators</span>\n</p>\n<p>The Focus Quebec 2025 study can count on the following collaborators who will be involved in the various upcoming events ( <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3415509-1&amp;h=3233651031&amp;u=https%3A%2F%2Fkpmgclientsite.kpmg.ca%2Ffocus-quebec-en%2F&amp;a=calendar+of+events\" data-type=\"url\" class=\"tr-link\" translate=\"no\">calendar of events</a> ): <span>Steve Girardin</span> , President and CEO of Micro Bird, <span>Marc Dutil</span> , President and CEO of Canam, <span>Luc Boivin</span> , President and General Manager of Fromagerie Boivin, Stéphane Turbide, Vice President, Innovation and Business Solutions at Harnois Énergies as well as <span>Jean Guilbault</span> , Vice President, Sales and Marketing at Kinova and Frédéric Verrault, Executive Director – Corporate Development, Chantiers Chibougamau.</p>\n<p>SOURCE KPMG au Québec</p>\n<p>View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/January2022/18/c8398.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/January2022/18/c8398.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}