{"date": "2021-09-17 12:20:09.550000+00:00", "ticker": "ABDN", "mrkt_info": {"open": 260.4, "close": 256.7}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 1871MStandard Life Private Eqty Trst PLC17 September 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>Standard Life Private Equity Trust - Proving its mettle</span>\n</p>\n<p>\n<span>16 <span>th</span> September 2021</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Proving its mettle</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>We held the view throughout 2020 that private equity funds like Standard Life Private Equity (SLPE) were being unfairly penalised by the market with wide discounts to net asset value (NAV). This was especially true once it became clearer, from the middle of 2020 onwards, that distributions were likely to be good, and relatively few underlying companies required liquidity support.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Since November, European-listed private equity has been outperforming broader global listed equities. However, until recently, this had limited impact on the discounts of funds such as SLPE, whose discount is broadly in line with the wider peer group average of 12.8%. We think this discount narrowing was justified and should continue. Over 40% of SLPE's underlying exposure is to healthcare and technology, where rampant exit activity has been fuelling much-better-than-expected distributions. SLPE expects a busy rest of 2021, with the pipeline looking particularly good in primary investments in new funds and co-investments.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Full research:</span>\n</p>\n<p>\n<a href=\"https://quoteddata.com/research/standard-life-private-equity-trust-proving-mettle-qd/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://quoteddata.com/research/standard-life-private-equity-trust-proving-mettle-qd/</a>\n</p>\n<p>\n<span>This research is also available free on our website</span>\n<span>\n<a href=\"http://www.quoteddata.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.quoteddata.com</a>\n</span>\n<span>where you will also find news, performance data and factsheets on every London listed Investment Company. QuotedData writes and distributes research on a number of quoted companies, facilitates meetings between those companies and existing and potential investors and assists in raising additional capital where required.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>NB: Marten &amp; Co was paid to produce this note on Standard Life Private Equity Trust Plc and it is for information purposes only. It is not intended to encourage the reader to deal in the security or securities mentioned in this report. Please read the important information at the back of this note. QuotedData is a trading name of Marten &amp; Co Limited which is authorised and regulated by the FCA. Marten &amp; Co is not permitted to provide investment advice to individual investors. <span>\n</span>\n</span></p>\n<p>\n<span>QUOTEDDATA 123a Kings Road | London SW3 4PL Tel: +44 (0) 20 3691 9430</span>\n</p>\n<p>\n<span>\n<a href=\"http://www.quoteddata.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.quoteddata.com</a>\n</span>\n<span>|</span>\n<span>\n<a href=\"mailto:research@quoteddata.com\" data-type=\"email\" translate=\"no\">research@quoteddata.com</a>\n</span>\n<span>|</span>\n<span>\n<a href=\"http://www.martenandco.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.martenandco.com</a>\n</span>\n<span>\n</span></p>\n<p>This information is provided by Reach, the non-regulatory press release distribution service of RNS, part of the London Stock Exchange. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .Reach is a non-regulatory news service. By using this service an issuer is confirming that the information contained within this announcement is of a non-regulatory nature. Reach announcements are identified with an orange label and the word \"Reach\" in the source column of the News Explorer pages of London Stock Exchange's website so that they are distinguished from the RNS UK regulatory service. Other vendors subscribing for Reach press releases may use a different method to distinguish Reach announcements from UK regulatory news.RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>NRAEAANXFEXFEFA</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}