{"date": "2021-07-07 05:20:40+00:00", "ticker": "AVV", "mrkt_info": {"open": 3835.0, "close": 3944.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Dubai, UAE:</strong> AVEVA, a global leader in industrial software, driving digital transformation and sustainability, announced today that it has signed a partnership agreement with RIB Software (RIB), a global leader in digital technologies for construction, to enhance AVEVA’s Project Execution portfolio offering for process and plant industries. The integration will extend the AVEVA Unified Project Execution solution to include new capabilities from the RIB MTWO platform such as enhanced estimation and project cost controls, more powerful dashboards and KPI monitoring, and optimized construction management with full Connected Worker capabilities in the Cloud.</p>\n<p>Together with RIB, AVEVA will connect project teams and allow them to collaborate more effectively by bringing together the engineering, procurement and construction functions to deliver a true design to delivery solution. AVEVA and RIB have committed to further integration and expansion of the new platform that will bring together AVEVA Enterprise Resource Management and AVEVA Contract Risk Management with RIB’s iTWO and MTWO solutions that create a world leading end-to-end integrated, platform solution for multi-dimensional digital construction.</p>\n<p>Benefits include advanced estimation and cost controls for more accurate bidding, enhanced project monitoring through 4D and 5D simulations, tighter project management, improved cash flow control, as well as a reduction of waste and optimized use of scarce resources for enhanced sustainability. The joint offering will help the industry further align to emerging best practices that rely on collaboration, such as advanced work packaging (AWP), integrated project delivery, strategic procurement and collaborative contracting.</p>\n<p>Peter Herweck, CEO, AVEVA, said, “Data-led project intelligence drives real-time transparency and elevates enterprise-wide business performance by connecting teams with data and boosting collaboration. We are excited about the potential of incorporating RIB Software’s and AVEVA’s portfolio capabilities into a leading-edge digital project execution solution.”</p>\n<p>The enhanced AVEVA Unified Project Execution platform will help capital project customers to connect teams, visualize data and reduce project execution risk by using artificial intelligence (AI) and the Cloud to boost safety, efficiency, and sustainability.</p>\n<p>Tom Wolf, Global Chairman and CEO, RIB Software, said, “We are excited to be working with AVEVA and helping them to extend their leadership in capital project execution for the process plant industries.”</p>\n<p>Amish Sabharwal, Executive Vice President, Engineering Business, AVEVA, added, “AVEVA and RIB Software are building on our successes in our respective domains to come together and offer a joint solution that will digitally transform how capital projects are executed. The next stage of our platform approach will accelerate existing gains from digital transformation to drive sustainable results for our customers.”</p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}