{"date": "2021-11-29 18:33:00.394000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Mumbai</p></div><div class=\"tr-npp-lead\"><p>Mumbai, Nov. 30 -- Amazon.com Inc. and a lobby of at least 15,000 small businesses have written to the markets regulator, demanding revocation of the conditional approval it has granted to the Rs.24,713 crore deal for the Future Group to sell its retail assets to Reliance Industries Ltd.</p><p>The US e-commerce giant and the Confederation of Indian Micro Small and Medium Enterprises have written two separate letters to the Securities and Exchange Board of India (Sebi) on the matter. Mint has reviewed a copy of both letters, dated 24 November.</p></div><div class=\"tr-npp-body\"><p>The Singapore International Arbitration Centre, or SIAC, passed an injunction on Future Group in October from taking any steps to transfer or dispose of any Future Retail Ltd (FRL) assets or shares held in FRL by the promoters without Amazon's written consent.</p><p>Amazon, in its letter, urged Sebi to act in favour of the binding injunction against FRL, Future Coupons Pvt. Ltd and group promoter Kishore Biyani.</p><p>On 21 October, the Singapore arbitral tribunal dismissed an ad-interim relief application filed by FRL to advance the transaction with RIL before the National Company Law Tribunal by convening meetings of its shareholders and creditors.</p><p>Amazon argued, in the letter, that in light of the SIAC ruling, which has been upheld by India's Supreme Court, Sebi's observation letters-the conditional approval given to the deal-stand in \"violation of EA (emergency arbitrator) order, have no legal basis and constitute a nullity.\"</p><p>Last August, FRL entered into a deal with billionaire Mukesh Ambani's two retail companies, agreeing to sell the entire retail, wholesale and logistics business for Rs.24,713 crore. Amazon challenged this in Singapore on the grounds that Future Group could not enter into any deal with any company of Ambani in the retail space without Amazon's prior consent under agreements between Future Group and the Jeff Bezos-led e-commerce giant.</p><p>The RIL-Future deal will give Ambani access to the products and services of Future Group that owns the country's largest offline retail network with more than 1,500 Big Bazaar and fbb stores.</p><p>The Amazon plea was buttressed by the lobby representing small retail businesses and startups, which said it is concerned that Ambani's retail venture Jio Mart has already made the retail business tough for small traders and that any deal with Future Retail will only make RIL even stronger, which may create unfair competition.</p><p>The small businesses told Sebi that stopping the deal can support hundreds of thousands of salespeople and their staff. With 'kiranas' (neighbourhood grocery stores) now able to order goods on JioMart Partner, avail credit facilities and free product samples, hundreds of thousands of salesmen and other kirana stores are facing an existential crisis as they cannot compete with the aggressive pricing of Reliance, they said.</p><p>\"The aggressive pricing model has sabotaged businesses, which has made them reduce their workforce because of the drop in their sales,\" says the letter, representing the group of owners of small businesses and kirana stores.</p><p>This is the first time that the RIL-Future deal has faced opposition from any trade body. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}