{"date": "2021-11-11 08:45:30.328000+00:00", "ticker": "III", "mrkt_info": {"open": 1349.0, "close": 1429.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 0181S3i Group PLC11 November 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">Press release</p>\n<p class=\"tr-npp-section-title\">\n<span>11 November 2021</span>\n</p>\n<p>\n<span>Group Finance Director succession</span>\n</p>\n<p>3i Group PLC (\"3i Group\" or the \"Company\") announces that Julia Wilson, Group Finance Director, has informed the Board that, after 15 years with the Group and 13 years in her current role, she intends to retire after the AGM in June 2022. Julia will be succeeded by James Hatchley, who is currently the 3i Group Strategy Director. James will join the Group Board and the Executive Committee effective May 2022.</p>\n<p>Julia joined 3i Group as Deputy Finance Director in 2006 and was made Group Finance Director and a member of the Executive Committee in 2008. She became a member of the Investment Committee in 2012.</p>\n<p>James Hatchley joined 3i in 2017 as the Group's Strategy Director and has been a member of the Investment Committee since 2019. Prior to joining 3i, James was Chief Operating Officer of KKR in Europe and, before that, Co-CEO of Avoca Capital. Earlier in his career, James was a corporate finance professional for 20 years, principally with Greenhill &amp; Co. and Schroders, and is a Chartered Accountant.</p>\n<p>David Hutchison, Chairman of 3i Group, said:</p>\n<p>\"I would like to thank Julia on behalf of the Board for her outstanding contribution over many years to the Company and the Board. We are delighted that we have a deep pool of talent within the Company and that James will succeed Julia as Group Finance Director. We very much look forward to his contribution to the Board over the coming years.\"</p>\n<p>Simon Borrows, CEO of 3i Group, said:</p>\n<p>\"Julia joined 3i in 2006 when 3i was a very different Company. She has helped to steer 3i through both the great financial crisis of 2007-9 and the Covid pandemic. Her part in the transformation of the Group since I was appointed as CEO in 2012 has been significant. She will remain with us until the next AGM which will allow for a smooth handover of responsibilities. Julia has been an outstanding Finance Director and colleague and her experience, judgement and common sense will be missed by us all when she does leave. After a thorough consideration of internal and external candidates, I am pleased that James has agreed to succeed Julia. He has already added significant value to the Group in his current Strategy role, in his contribution to the Investment Committee and to specific assets within the Group portfolio including Action and Scandlines. He will bring considerable internal and external experience to his new role.\"</p>\n<p>-Ends-</p>\n<p>\n<span>For further information, contact:</span>\n</p>\n<p>\n<span>\n</span></p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>Kathryn van der Kroft Communications Director</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>020 7975 3021</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Silvia Santoro Group Investor Relations Director</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>020 7975 3258</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Notes to Editors</span>\n</p>\n<p>About 3i Group</p>\n<p>3i is a leading international investment manager focused on mid-market Private Equity and Infrastructure. Its core investment markets are northern Europe and North America. For further information, please visit: <span>\n<a href=\"http://www.3i.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.3i.com</a>\n</span>\n</p>\n<p>Additional information - James Hatchley</p>\n<p>James Hatchley (54) is also the Senior Independent Director of Great Ormond Street Hospital NHS Foundation Trust and is the Chair of the Great Ormond Street Hospital NHS Foundation Trust Remuneration and Finance and Investment Committees and a member of its Audit and People and Education Assurance Committees. James is a member of the Scandlines Infrastructure ApS Board (a 3i portfolio investment) and Chair of its Audit and Risk Committee. He qualified as a Chartered Accountant in 1992. He holds a First Class Joint Honours degree in Mathematics and Economics from the University of Surrey.</p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>BOADGBDBUXBDGBG</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}