{"date": "2022-02-09 08:37:16.256000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The price of <a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> Prime is increasing, the company has announced.</p><p>The annual membership will go from $119 per year to $139 per year, Amazon said. It did not announce changes in other countries, but the price does tend to be roughly similar across locations.</p></div><div class=\"tr-npp-body\"><p>It said the price increase was required because of extra costs over the last year.</p><p>\"As expected over the holidays, we saw higher costs driven by labour supply shortages and inflationary pressures, and these issues persisted into the first quarter due to Omicron,\" Amazon's new chief executive said in a release.</p><p>The announcement was made alongside the release of Amazon's latest results. They showed that profitability had increased dramatically, with revenues up 22 per cent over the year.</p><p>Those results came at a difficult time for some other technology stocks. Notably, Facebook had dropped by 25 per cent the day before, after disappointing results that showed it had lost users for the first time ever.</p><p>During a call, Amazon chief financial officer Brian Olsavsky said that it was difficult to predict exactly how many people would unsubscribe because of the increased price of <a href=\"https://www.independent.co.uk/topic/amazon-prime\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Prime</a> .</p><p>He said the company expected \"some potential loss\" but that it had not been significant in the past.</p><p>Amazon most recently increased the cost of Prime membership in 2018, when it went from $99 per year to $119. Four years earlier, in 2014, the price went from $79 to $99.</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/tech/meta-personal-boundaries-metaverse-sexual-harass-b2007878.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Meta adds 'personal boundaries' feature to metaverse after harassment</a> </p><p><a href=\"https://www.independent.co.uk/space/asteroid-earth-nasa-date-march-hazardous-b2007102.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Large, potentially hazardous asteroid to pass near Earth in early March</a> </p><p><a href=\"https://www.independent.co.uk/tech/mark-zuckerberg-facebook-net-worth-b2007512.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Mark Zuckerberg loses $29bn overnight as people abandon Facebook</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 Independent, The (UK) (Online). All rights reserved.</p></div>"}