{"date": "2022-02-08 14:45:42.865000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The Animal Welfare Society (AWS) of South Africa has issued a warning to pet owners to never put their pet in a boot, as they can suffocate to death.</p><p>CAPE TOWN - The Animal Welfare Society (AWS) of South Africa has issued a warning to pet owners to never put their pet in a boot, as they can suffocate to death.</p></div><div class=\"tr-npp-body\"><p>An adult female Husky cross and her seven puppies were rescued after being found confined in the sweltering hot boot of their owner's car on Monday.</p><p>AWS spokesperson Allan Perrins said they took possession of the Husky Cross and her six-week-old puppies.</p><p>\"How they survived the suffocating almost hour-long trip from Rocklands in Mitchells Plain to our headquarters in Philippi is nothing short of miraculous.</p><p>\"When we opened the boot we noticed that the puppies were quite tightly squashed together without any ventilation – another 15 minutes in the boot and they would almost certainly have suffocated to death.</p><p>\"Thankfully, we managed to get all of the dogs out in good time and the owner agreed to surrender them to us.\"</p><p>Despite their ordeal, the dogs are doing well and are ready to be adopted.</p><p>The Animal Welfare Society of South Africa offers the following advice to pet owners who enjoy the company of a Canine Cruising Companion:</p><ul class=\"bulleted-list arrowlist\"><li>Never place your pet in the boot as they can suffocate to death.</li> </ul><ul class=\"bulleted-list arrowlist\"><li>Never allow your pet to ride shotgun.</li> </ul><ul class=\"bulleted-list arrowlist\"><li>Always \"buckle up\" your pet.</li> </ul><ul class=\"bulleted-list arrowlist\"><li>If possible, install a barrier.</li> </ul><ul class=\"bulleted-list arrowlist\"><li>If your pet is restless, consider putting them in a travel crate for the journey.</li> </ul><ul class=\"bulleted-list arrowlist\"><li>Never leave your pet in the car, even with the windows cracked open, as they can die in a hot car.</li> </ul><ul class=\"bulleted-list arrowlist\"><li>On long trips, stop frequently for water and potty breaks.</li> </ul><p>Dog owners have also been encouraged to invest in a canine seat belt or dog harness to keep their dogs safely restrained while in the car.</p><p><span>Cape Times</span> </p><p>Cape Times © 1999 - 2022 Independent Newspapers (Pty) Limited. All rights strictly reserved. Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 SyndiGate. All Rights Reserved.</p></div>"}