{"date": "2021-12-01 18:34:00.149000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>AWS Announces Two New Initiatives That Make Machine Learning More Accessible</b>\n</p><p class=\"bwalignc\">\n<span>New $10 million AWS Artificial Intelligence and Machine Learning Scholarship (AWS AI &amp; ML Scholarship) program is designed to prepare underrepresented and underserved students globally for careers in machine learning</span>\n</p><p class=\"bwalignc\">\n<span>Amazon SageMaker Studio Lab makes it easy for anyone to quickly set up a machine learning development environment for learning and experimentation at no cost</span>\n</p><p>\nToday, at AWS re:Invent, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), announced two new initiatives designed to make machine learning more accessible for anyone interested in learning and experimenting with the technology. The AWS AI &amp; ML Scholarship<span> </span>is a new education and scholarship program aimed at preparing underrepresented and underserved students globally for careers in machine learning. The program uses AWS DeepRacer and the new AWS DeepRacer Student League to teach students foundational machine learning concepts by giving them hands-on experience training machine learning models for autonomous race cars, while providing educational content centered on machine learning fundamentals. AWS is further increasing access to machine learning through Amazon SageMaker Studio Lab, which gives everyone access to a no-cost version of Amazon SageMaker—an AWS service that helps customers build, train, and deploy machine learning models.\n</p><p>\n“The two initiatives we are announcing today are designed to open up educational opportunities in machine learning to make it more widely accessible to anyone who is interested in the technology,” said Swami Sivasubramanian, Vice President of Amazon Machine Learning at AWS. “Machine learning will be one of the most transformational technologies of this generation. If we are going to unlock the full potential of this technology to tackle some of the world’s most challenging problems, we need the best minds entering the field from all backgrounds and walks of life. We want to inspire and excite a diverse future workforce through this new scholarship program and break down the cost barriers that prevent many from getting started with machine learning.”\n</p><p>\n<b><span>New $10 million education and scholarship program is designed to prepare underrepresented and underserved students globally for careers in machine learning</span></b>\n</p><p>\nThe World Economic Forum estimates that technological advances and automation will create 97 million new technology jobs by 2025, including in the field of artificial intelligence and machine learning. While the job opportunities in technology are growing, diversity is lagging behind in science and technology careers. Making educational resources available to anyone interested in technology is critical to encouraging a more robust, diverse pipeline of people in artificial intelligence and machine learning careers. The new AWS AI &amp; ML Scholarship aims to help underrepresented and underserved high school and college students learn foundational machine learning concepts and prepare them for careers in artificial intelligence and machine learning. In addition to no-cost access to dozens of hours of free machine learning model training and educational materials, 2,000 qualifying students from underrepresented and underserved communities will win a scholarship for the AI Programming with Python Udacity Nanodegree program, designed to give scholarship recipients the programming tools and techniques fundamental to machine learning. Graduates from the first Nanodegree program will be invited to take a technical assessment. Five hundred students who receive the highest scores in this assessment will earn a second Udacity Nanodegree program scholarship on deep learning and machine learning engineering to help further prepare them for a career in artificial intelligence and machine learning. These top 500 students will also have access to mentorship opportunities from tenured Amazon and Intel technology experts for career insights and advice.\n</p><p>\nDelivered in collaboration with Intel and supported by the talent transformation platform Udacity, the AWS AI &amp; ML Scholarship program allows students from around the world to access dozens of hours of free training modules and tutorials on the basics of machine learning and its real-world applications. Students can use AWS DeepRacer to turn theory into hands-on action by learning how to train machine learning models to power a virtual race car. Students who successfully complete educational modules by passing knowledge-check quizzes, meet certain AWS DeepRacer lap time performance targets, and submit an essay will be considered for Udacity Nanodegree program scholarships. Students can also put their virtual race cars to the test in the new AWS DeepRacer Student League. The AWS DeepRacer Student League helps people of all skill levels learn how to build machine learning models with a fully autonomous 1/18<sup>th</sup> scale race car driven by machine learning, a 3D racing simulator, and a global competition. AWS DeepRacer has been used by enterprises like Capital One, BMW, Deloitte, JP Morgan Chase, Accenture, and Liberty Mutual to teach their employees to build, train, and deploy machine learning models in a hands-on way. To get started with the AWS AI &amp; ML Scholarship, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fawsaimlscholarship.com%2F&amp;esheet=52543513&amp;newsitemid=20211201005992&amp;lan=en-US&amp;anchor=awsaimlscholarship.com&amp;index=1&amp;md5=9bf9f71ac069fa430d53c2c0d19cce32\" data-type=\"url\" class=\"tr-link\" translate=\"no\">awsaimlscholarship.com</a>.\n</p><p>\n<b><span>Amazon SageMaker Studio Lab provides no-cost access to a machine learning development environment to put machine learning in the hands of everyone</span></b>\n</p><p>\nAmazon SageMaker Studio Lab offers a free version of Amazon SageMaker, which is used by researchers and data scientists worldwide to build, train, and deploy machine learning models quickly. Amazon SageMaker Studio Lab removes the need to have an AWS account or provide billing details to get up and running with machine learning on AWS. Users simply sign up with an email address through a web browser, and Amazon SageMaker Studio Lab provides access to a machine learning development environment. Amazon SageMaker Studio Lab provides unlimited user sessions that include 15 gigabytes of persistent storage to store projects and up to 12 hours of CPU and four hours of GPU compute for training machine learning models at no cost. There are no cloud resources to build, scale, or manage with Amazon SageMaker Studio Lab, so users can start, stop, and restart working on machine learning projects as easily as closing and opening a laptop. When users are done experimenting and want to take their ideas to production, they can easily export their machine learning projects to Amazon SageMaker Studio to deploy and scale their models on AWS. Amazon SageMaker Studio Lab can be used as a no-cost learning environment for students or a no-cost prototyping environment for data scientists where everyone can quickly and easily start building and training machine learning models with no financial obligation or long-term commitments. To learn more about Amazon SageMaker Studio Lab, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fsagemaker%2Fstudio-lab&amp;esheet=52543513&amp;newsitemid=20211201005992&amp;lan=en-US&amp;anchor=aws.amazon.com%2Fsagemaker%2Fstudio-lab&amp;index=2&amp;md5=f2d2ba7efc074498b3c9acfff85d9749\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com/sagemaker/studio-lab</a>.\n</p><p>\nEarlier this year, Amazon announced a new Leadership Principle: Success and Scale Bring Broad Responsibility. AWS is scaling and investing in initiatives to live up to this new Leadership Principle, including Amazon's commitment to provide 29 million people with access to free cloud computing skills training by 2025, science, technology, engineering, and math (STEM) education programs for young learners including Amazon Future Engineer, AWS Girls’ Tech Day, and AWS GetIT, as well as collaborations with colleges and universities. Now, AWS is making it easier for more people from underrepresented groups and underserved populations to get started with machine learning—with free education, scholarships, and access to the same machine learning technology used by the world’s leading startups, research institutions, and enterprises. The two initiatives announced today further advance Amazon’s efforts to make education and training opportunities widely accessible.\n</p><p>\nAWS and Intel have a 15-year relationship dedicated to developing, building, and supporting cloud services that are designed to manage cost and complexity, accelerate business outcomes, and scale to meet current and future computing requirements. “As an industry, we must do more to create a diverse and inclusive tech workforce,” said Michelle Johnston Holthaus, Executive Vice President and GM of the Sales, Marketing, and Communications Group at Intel. “Intel is proud to support initiatives like the AWS AI &amp; ML Scholarship program, which aligns with our commitment to provide more access to STEM opportunities for underrepresented groups and helps diversify the future generation of machine learning practitioners. What makes this education and scholarship program unique is that students are given access to a rich set of learning materials at the outset. This is critical to really move the needle. Learning isn’t contingent on winning but instead part of the process.”\n</p><p>\nGirls in Tech is a global nonprofit organization dedicated to eliminating the gender gap in tech. “Driving diversity in machine learning requires intentional programs that create opportunities and break down barriers like the new AWS AI &amp; ML Scholarship program,” said Adriana Gascoigne, Founder and CEO of Girls in Tech. “Progress in bringing more women and underrepresented communities into the field of machine learning will only be achieved if everyone works together to close the diversity gap. Girls in Tech is glad to see multi-faceted programs like the AWS AI &amp; ML Scholarship to help close the gap in machine learning education and open career potential among these groups.”\n</p><p>\nHugging Face is an AI community for building, training, and deploying state of the art models powered by the reference open source in machine learning. “At Hugging Face, our mission is to democratize state of the art machine learning,” said Jeff Boudier, Director of Product Marketing at Hugging Face. “With Amazon SageMaker Studio Lab, AWS is doing just that by enabling anyone to learn and experiment with ML through a web browser, without the need for a high-powered PC or a credit card to get started. This makes ML more accessible and easier to share with the community. We are excited to be part of this launch and contribute Hugging Face transformers examples and resources to make ML even more accessible!”\n</p><p>\nSanta Clara University’s mission with the Department of Finance is to educate students, at the undergraduate and graduate levels, to serve their organizations and society in the Jesuit tradition. “Amazon SageMaker Studio Lab will help my students learn the building blocks of machine learning by removing the cloud configuration steps required to get started. Now, in my natural language processing classes, students have more time to enhance their skills,” said Sanjiv Das, Professor of Finance and Data Science at Santa Clara University. “Amazon SageMaker Studio Lab enables students to onboard to AWS quickly, work and experiment for a few hours, and easily pick up where they left off. Amazon SageMaker Studio Lab brings the ease of use of Jupyter notebooks in the cloud to both beginner and advanced students studying machine learning.”\n</p><p>\nUniversity of Pennsylvania Engineering is the birthplace of the modern computer. It was there that ENIAC, the world’s first electronic, large-scale, general-purpose digital computer, was developed in 1946. For over 70 years, the field of computer science at Penn has been marked by exciting innovations. “One of the hardest parts about programming with machine learning is configuring the environment to build. Students usually have to choose the compute instances, security polices, and provide a credit card,” said Dan Roth, Professor of Computer and Information Science at University of Pennsylvania. “My students needed Amazon SageMaker Studio Lab to abstract away all of the complexity of setup and provide a free powerful sandbox to experiment. This lets them write code immediately without needing to spend time configuring the ML environment.”\n</p><p>\n<strong>About Amazon Web Services</strong>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones (AZs) within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, and Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2F&amp;esheet=52543513&amp;newsitemid=20211201005992&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=3&amp;md5=157f97d984c97cd029d0eed4b602919b\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<strong>About Amazon</strong>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit amazon.com/about and follow @AmazonNews.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211201005992r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMjAxMDA1OTkycjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=dbcd2070b76c0ea63ea7ee31e4721d190db30b760258af7e687d333b4ebe297185555fab7cd83b9ddccf478d57e47e258a908ba3b35c724bb7d0b93142fe8103\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211201005992/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211201005992/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52543513&amp;newsitemid=20211201005992&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=4&amp;md5=52a8f45b14529d7f6eae582fd34a5fc8\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NV-AMAZON-WEB-SERVICES</p></div>"}