{"date": "2022-02-01 08:06:20+00:00", "ticker": "ABDN", "mrkt_info": {"open": 240.9, "close": 245.7}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds background, context</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">LONDON, Feb 1 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>One of the biggest shareholders in Vodafone <a href=\"reuters://REALTIME/Verb=FullQuote/ric=VOD.L\" data-type=\"ric\" data-ric=\"VOD.L\" translate=\"no\" dir=\"ltr\">VOD.L</a> said it backed management efforts to pursue deals to build greater value after activist investor Cevian Capital built an undisclosed stake in the British company. </p><p>     Andrew Millington, head of UK equities at Abrdn Plc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ABDN.L\" data-type=\"ric\" data-ric=\"ABDN.L\" translate=\"no\" dir=\"ltr\">ABDN.L</a>, said Vodafone management had been explicit in recent months that they intended to explore ways to create value through in-market consolidation with its operating assets and towers infrastructure. </p><p>\"While I've no insight into Cevian's plans I think this approach has widespread support from shareholders,\" Millington said in a statement. Abrdn is a top-10 Vodafone shareholder.  </p><p>The British mobile operator has declined to comment. </p><p>The arrival of Cevian on the shareholder register follows a lacklustre few years at Vodafone when the shares have languished during the pandemic. </p><p>Over the last five years, Vodafone has delivered a total return including dividends of negative 4.7%, compared with a 28% return for the benchmark FTSE 100 Index, according to Breakingviews. Over the same period, Vodafone's Johannesburg-listed African subsidiary, Vodacom, has managed 7.2% in hard-currency terms. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2UB2G2\" data-type=\"storyId\" data-story-id=\"nL8N2UB2G2\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Vodafone, like its rivals, has in recent years had to invest heavily to build first 4G and then 5G mobile networks and fibre-optic broadband at a time when European regulators have prioritised the needs of consumers by keeping mobile bills low. </p><p>The bet of Cevian and other supportive investors is that Brussels will ease that position, by allowing mergers to reduce the number of operators in each market, leading to a drop in competition and a rise in prices, and greater investment in networks. </p><p>Vodafone Chief Executive Nick Read, previously the CFO, last year spun out the group's towers business, and the company has said it is looking for industrial mergers. </p><p>Read has also called for consolidation to be allowed in some of its key markets - Spain, Italy, Portugal and the UK. Reuters reported earlier this month that Vodafone and Iliad were in talks to combine their businesses in Italy. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2U15BB\" data-type=\"storyId\" data-story-id=\"nL8N2U15BB\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Peter Schoenfeld, founder of New York-based hedge fund PSAM, told the Financial Times that he welcomed the arrival of Cevian. </p><p>\"It's long overdue that a shareholder holds the board accountable for its past actions and inaction,\" he said. </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Kate Holton in London and Jaiveer Singh Shekhawat and Aby Jose Koilparambil in Bengaluru; Editing by Krishna Chandra Eluri and Louise Heavens)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:abyjose.koilparambil@thomsonreuters.com\" data-type=\"email\" translate=\"no\">abyjose.koilparambil@thomsonreuters.com</a> ; +919986528692) )</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: VODAFONE-SHAREHOLDER ACTIVISM/ (UPDATE 2, PIX)</p></div>"}