{"date": "2022-02-25 05:26:48.213000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2896.54, "close": 3075.77}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_6sui58t0&amp;referenceId=6298635814001_B35&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_6sui58t0&amp;referenceId=6298635814001_B35&amp;pageId=RefinitivNewscasts</a></pre>Source: Real Vision<br/><br/>Description: Everyrealm is already an active developer in the metaverse ecosystem, with holdings in 25 platform portfolios, ownership of more than 3,000 NFTs, and management of more than 100 metaverse real estate projects. It began life as Republic Realm, alternative asset crowdfunding platform Republic’s metaverse real estate arm. Co-founder and CEO Janine Yorio led a spin off and rebrand that now has Everyrealm positioned to build an NFT and gaming production studio, in addition to its metaverse real estate development activity. It recently closed a $60 million Series A funding round led by high-profile and seasoned players such as Andreessen Horowitz, Lightspeed Venture Partners, Dapper Labs, Coinbase Ventures, The Sandbox, Nas, Paris Hilton, and Randi Zuckerberg, among others. Yorio explains Everyrealm’s strategy to become the “Netflix of the metaverse” in conversation with Metros Capital founder Nick Halaris. As Yorio notes, the core of that mission means connecting the Web3 audience with metaverse technology to make it easier for users to access content. Recorded on February 15, 2022.<br/>Short Link: <a href=\"https://refini.tv/3p7UnlB\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3p7UnlB</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; Hey, Real Vision, great to be back with you. I am sitting down today with an amazing woman at the forefront of the Metaverse space. Janine Yorio comes back to Real Vision after six or so months to give us an update on some incredible developments at her company every realm. Janine, welcome back to Real Vision. &gt;&gt; Thanks for having me, Nick. It's great to be here. &gt;&gt; I thought, to kick off this conversation, there'll be no better place to start than the recent news about a big series A investment in Everyrealm. The New River Company was formulated Republican Realm and as a result of this investment, sounds like you've rebranded to Everyrealm, so tell us about that. &gt;&gt; Sure. We started as part of a company called Republic. I had built a real estate investment app called Compound that I built and sold to Republic in June of 2020. We launched the Republic Realm Investment Vehicle while inside Republic in April of 2021. In July of 2021, we began the process of becoming a separate company, dramatically expanding our mandate in August to be close to Seed Round and then just recently last week in February of 2022, we announced the closing of a $60 million Series A round, which was led by Andreessen Horowitz. As part of that round, we also did a broader recapitalization and fully spun out of Republic and today, we're a standalone company, Republic is still a large shareholder in our company but we are much more like a traditional startup and never stops with the work now in that we have control of our own destiny and we are separate from the mothership. As part of that, we also renamed the company Everyrealm as a signal to the market that we are holistically looking at the entire Metaverse sector, we looking at all the different Metaverse players and we're trying to insert ourselves the layer that connects web three audiences with Metaverse technology so that it becomes more easy for the mainstream audience to access Metaverse content. &gt;&gt; That's great. Well, congratulations. &gt;&gt; Thank you. &gt;&gt; With successful raise with some very high profile and season players in this space, was it difficult to raise money around this concept? How was it? &gt;&gt; This isn't my first startups, so I've definitely had some interesting experiences in VC world. This was a very different experience for me. We have four terms sheets, unsolicited. We're doing something that's very current, that has obviously received a lot of attention. We got started a bit earlier than most people, having started in April of last year, so we're just at about 10 months old now, which is pretty incredible considering all that we've done and I think the success we had capital raising is obviously a testament to our team and how quickly we've been able to execute, how big of a footprint we've been able to create even though we're still technically a very early stage company. So this round was privileged to have access to capital the way we have had and we obviously take that very seriously as stewards of investor capital but it has been a bit of a whirlwind. We took investment capital from literally the best names on the planet, from Andreessen, to Coinbase, to Lifestage, to Hashed, which is a big Korean crypto and gaming venture capital firm to a host of very connected celebrities from Paris Hilton, to Gunna, to Nas, to Gene Simmons, so it's really been exciting to be doing these things and feel so validated by the investment community, it's been tremendous. &gt;&gt; In the investments that you all raised, the $60 million, is this separate from the fund because if I remember right, back in April, you were raising a fund to invest in Metaverse type projects and NFT, is the fund still open or is that concept gone by the wayside? &gt;&gt; We started as a fund, that was our legacy business. We were a fund inside Republic which is an investment company that raises money from individual investors for all sorts of different high-growth concepts, from startups to late stage growth companies, to crypto, to Metaverse, to real estate. We started as a fund, we started as an investment vehicle but we've since dramatically expanded our mandating, today we're really a full-stack studio. We still have our investment business, we are still taking in capitals sporadically into those vehicles but we've dramatically expanded our capabilities as we both our own gaming, Metaverse, and NFT production studio. We filtered out an intellectual property library through licensing deals and building our own content internally and what we're really building today is what I like to refer to as Netflix of the Metaverse where we are both creating, licensing the content but also building distribution channels with a large and enormous global potential mainstream audience that today is waking up and trying to find the Metaverse, trying to find the content and that's where we come in and help them to find it in a very familiar, easy way. &gt;&gt; Yes, and it seems just from the research I've been doing that there's not very many players positioned like you all. There's very few that I could find that are producing these experiences, so it seems that was a really smart, strategic decision by you guys. &gt;&gt; A lot of the things we did, we were experimenting. This phase is so nascent than it has been a function of trial and error and luckily, I think our team has made some really smart decisions very early on which has given us a lot of momentum and traction in a space where it's difficult to measure traction and that early reception, obviously, the NFT records that we've broken, the growth in our online community, the interests from corporate brand partners has been tremendous, and all of those things are very validating to all these experiments we've drawn. &gt;&gt; I read that in your most recent report, which is amazing and everybody on Real Vision, if they can get a copy of it, they should definitely take the time to read through it but I read that you all estimate that there's something like 25,000 holders of Metaverse, NFTs, or Metaverse real estate, let's call it, what percentage of those are building like Everyrealm versus just holding to in the hopes for price appreciation? &gt;&gt; That's a really good question Nick, so let me clarify that statistic. We did a deep dive into four of the largest Metaverses that do have real estate for sale and we found, in those Metaverses, there were about 25,000 individuals who had addresses that own Metaverse real estate. It's hard to say whether that's 25,000 individuals because sometimes, big crypto collectors open multiple wallets, so it's likely that it's actually fewer than 25,000 individual holders. Measuring the number that are actively building is even more complicated because many of the Metaverse platforms haven't actually launched yet. While you can look at the Sandbox and see all of the buyers who have put Lowe's onto the map, it's much harder to assess whether they're actually building in the background because the platform itself hasn't launched. &gt;&gt; I honestly don't know the answer to that question. If I had to estimate, I would say probably one in five. And that's strictly based on me shooting from the hip, being in the space, and understanding how much of this is people planning a flag early on versus true commitment to building in the space. A lot of brands, a lot of events, a lot of individuals are trying to figure out what to do in the Metaverse. So they're buying land in anticipation of doing something, but they don't know exactly what they're going to build yet. &gt;&gt; Yeah, I've noticed that in the press too. Every company in the world is essentially interested in establishing some Metaverse presence, but they barely understand what's happening in the Metaverse. Let alone have a coherent strategy for what that means. So it's an interesting time. &gt;&gt; It's so interesting. We get so many advantage score inquiries, and they're almost always the same. Everybody thinks so different. The advice C suite wants to do something in the Metaverse. They want to be patted on the back, meanwhile, every C suite on the planet is coming to the same conclusion. And they never really know what to do. So they look at what everybody else has done, they're like,\" Well, we want to do something like this guy did or that girl did. \" And the fact is, I don't think very many groups have hit the nail on the head yet. Most of the companies that have tried to do things in the Metaverse, they do something where there's a very short burst of publicity surrounding their activation, but no real longevity or online community that has resulted from that activation. I think one of the things that's worth noting is that a lot of the Metaverse brands that are Metaverse native are more important to Metaverse than the real world brands are. And that's a realization that's very uncomfortable for the companies. They think that when they come to the Metaverse will be real. I find this particularly with real estate owners and developers. They're like \" Now we're hearing the Metaverse real estate is real.\" The fact is Metaverse is real and the brands that started there are much more important there than real world brands. The best example of that is that Nike, which is an enormous real world brand, rather than build their own Metaverse brand decided to buy artefact, which is a brand probably 99% of the world has never heard of. Which Nike was smart enough to realize that they could try to build something that was not Metaverse native, or they can partner with a group that already had traction, already had legitimacy in the space, which I think was really smart on the part of Nike. I think that was a really smart buy for them. Another anecdotal example is looking at Bored Ape Yacht Club. Which is a brand that a year ago almost nobody had ever heard of. And today, the rumor is there raising money at a $5 billion evaluation for a company that's barely a year old, that's insane. But it's because the amount of traction and affinity that they've been able to create for this brand is through the roof. They took this idea of an NFT project and gave it so much more. They made it so robust, and they made being part of the Bored Ape Yacht Club such a source of social currency that people get tattoos, that people are wearing them merge. There was an NFT event in New York City where obviously a lot of Bored Ape Yacht Club collectors would converge because it is a crypto native group. And everybody was wearing their Bored Ape sweatshirts, and I'm pretty sure nobody washed them. The event was three or four days long, and I kept seeing the same people wearing the same sweatshirt. These people are so proud to be brand ambassadors of these brands that they're wearing dirty clothes just to keep that logo in everybody else's face. There aren't that many brands on the planet like that, let alone brands that started less than a year ago. So what corporate America needs to realize is that they need to think long and hard about how they enter this space, lest they just be seen as somebody that's coming in without a depth of understanding, without the real intent to add to the community, as opposed to do a quick marketing ploy or do a quick money graph. Because the crypto community, the Metaverse community is really strong and talks a lot. And therefore every entry needs to be incredibly thoughtful otherwise they will unleash the wrath of Crypto Twitter, which can be very toxic very quickly. So I think it's important for our CMO, CIOs, and CEOs everywhere, who are contemplating a move into the managers to study the Nike example, to study the Board Ape example, to try to wrap their hands around what it means to enter the Metaverse and do it the right way. &gt;&gt; Those are great examples. I got interested in this topic right around the time, I think when you launched the fund. I've written several pieces about it, but I wrote one recently after the Facebook rebranding. About how the Metaverse is an idea that went from cool fringe to full blown corporate takeover. The fastest in history. The corporations, I don't know if they're just petrified, or if they're looking for a way to get their investors excited, but they've glammed onto the mat averse concept more than anything that I've remembered in history. And I wanted to get you take on this. This corporate stuff, Facebook for example, do you think that the Facebook move is a quiet act of desperation? Or is it a smart strategic move? Or is it somewhere in the middle? &gt;&gt; Very loaded question. First of all, I would never bet against Facebook. I think that they certainly have a lot of baggage, we're all aware of what that is, but they also have a tremendous user base, they have a lot of talon. I think Mark Zuckerberg is a brilliant individual. We can critique nuances of how they've handled certain issues that have been very thorny, but ultimately, it's an app that people use way more than they ought to. Its probably the most popular form of procrastination on the planet today. I think it's going to take a lot to unseat Facebook long term. That being said, the younger demographic that is not the Instagram or face of generation that is probably even younger than the TikTok generation has. Facebook is irrelevant, irrelevant to them as television is network television is to them. There is an entire generation of young people that are looking for a completely different technology experience. And Mark Zuckerberg, to his credit, has the foresight to understand that if Facebook doesn't evolve its business model, it will die with its user base as the user base ages. And even Instagram's become largely a millennial platform which even millenials are getting older today. Today's young people expect something that's even more interactive than TikTok. TikTok is great. It's short form video, it's vertical, it's novel, but it's not that interactive. You currently do much more than chat or like. And young people today want their technology experiences to be immersive, interactive and social. So you walk into something, people are there, you can interact with them real time, generally with audio, sometimes with video. It's not just like and click, it's walk into and interact. And that's a complete departure from where most technology is today. So I think Facebook was very smart to focus on that, to ensure that their company has reached into that younger demographic. I don't think it's an easy battle for Facebook, but their war chest is so big that I think competing with them head on is going be a challenge for anybody. That being said, the Metaverse is as big as the Internet. And as we know, even the Internet wasn't winner take all. There are obviously certain winners that were tremendously large, there were a lot of others that did very well despite not having turned into the next Google or Facebook. So I think we're going to see a lot of the same thing shake out Metaverse where there are going to be these category killers where the Coinbase is the killer app of crypto, but there will also be a ton of new opportunities for technology companies, for infrastructure companies, to come into Metaverse and create extremely valuable companies. Of which Facebook might be one, again, I wouldn't bet against Facebook. &gt;&gt; Yeah, I think it's hard to. When you look at the numbers Facebook is announcing, if I remember, a10 billion a year indefinitely to invest in Metaverse. And what was the total crypto VC last year? Was 30 billion. &gt;&gt; I don't even know. &gt;&gt; Yes, so Facebook is betting huge on this particular market opportunity. So it's hard to know what you do with $10 billion besides maybe investing in startups. Don't know how you would organize an R&amp;D department with that kind of a financial commitment. But there's ways around it like they could buy a company is buy innovation and things which other companies like Microsoft have done a really good job doing that. When you think of in a similar fashion like the video game one-hit wonder type companies that are massive, that have established metaverse position, like for example, Roblox or Minecraft. In a way, they're like metaverse or precursor to metaverse. How do you see them positioning in this market versus the crypto native stuff like Sandbox, Decentraland, Somnium, etc? &gt;&gt; Well, first of all, I definitely don't think I would consider Minecraft or Roblox for a one hit wonders. They have transformed the technology landscape and shaped how an entire generation of young people think about technology where their platforms are a one-stop-shop for social experiences, entertainment, product discovery, everything. I think it's going to be important for a company like ours, that sees ourselves as holistically metaverse and agnostic to any one outcome to look to these platforms even though they may not be crypto today as the place that first of all, their metaverses that are actually functional. They have massive user numbers that are trending upward, which is something that's hard to find in the crypto base metaverse just because that category is so nascent. I think those platforms are very important for companies that are targeting adult users to understand as their users age out of those platforms. I don't think they are irrelevant. I definitely don't think they're one hit wonders, I think they are the crux of this industry and they're shaping how that next generation consumes technology and basically consumes everything. And any intelligent company that's trying to enter this category needs to study how they work, needs to study how their users interact with those platforms to understand where this metaverse industry is headed in the future. &gt;&gt; I hear your point about not necessarily being one-hit wonders. The reason I use that phrases is there's a sense in which they could go to zero quickly, like a MySpace or like a Facebook. If their game no longer is relevant and their experience is no longer relevant for the people who want to have that experience, what they've created while incredible could be worthless relatively quickly. And maybe there's a better way of saying it. There seems to be this pattern in gaming. It's like Hollywood in a sense where companies spend an enormous amount of money trying to develop what turns out to be incredible games like Minecraft, for example, my kids play Minecraft. I've heard in your other interviews that your kids play Minecraft. These are incredible things and what they do is they stick with them. So like Call of Duty just keeps doing another Call of Duty. They just keep iterating on it because it costs so much money to build it and so many of these things just fail outright. And I wonder if the metaverse is going to look like that in the sense that at least in its early phase where there's this techno-utopian view of like we're going to have this interoperable vast metaverse that you could just jump around it and it's all going to be one thing or there's this gaming world where it just iterates. It's Minecraft one time in Roblox, in this World Warcraft and Second Life, and then it's something else and it just keeps going. So how are you thinking about that? &gt;&gt; So I think it's important to make sure that we all understand, at least what I think the metaverse is. So I don't think Minecraft or Fonight or Roblox are the metaverse. They are a metaverse-like experience that is certainly warmed up this younger generation toward using things that are metaverse activations. But I do not believe that there's going to be one platform that is going to be the metaverse. I think there's an opportunity for somebody like Minecraft or Roblox to try to figure out how to position their accompany to attract older users. I'm not sure that their leadership is actually thinking about things that way. But I think that these metaverses are showing us what the technology needs to look like. But the concept of the metaverse is what happens when the entire Internet starts behaving like a video game. And what I mean by that is, today, the Internet is a network of millions, if not billions of websites that are connected through search engines. You can find them on Google, but they are generally 2D. The metaverse is what happens when all of those web experiences start behaving like video games that are 3D, that are interactive and social. So that if you and I are on the same website, for lack of a better word at the same time, I can see that you're there, you can see that I'm there and we can actually interact with each other and that's not typical of most web experiences today. So it's not to say that Minecraft is the metaverse, but the way that Minecraft works is what the metaverse will look like and I think that's an important distinction. So when you mentioned Call of Duty, I think again, Call of Duty shows us what the metaverse could look like but it is not the metaverse. Just like Google is not the Internet, it is a portal to the Internet. It shows us how people mind map the Internet and it's absolutely been transformative in a way that the Internet and SEO and all of the tangental industries have unfolded. But it is not the Internet and the same is true of the metaverse. It's easiest for people to understand, I think when you talk about the metaverse and you're having a hard time conceiving on what that means to replace that word with the word Internet. So that you get the sense that it is this very obtuse hard to wrap your arms around concept of a network, an enormous network of what happens when the Internet starts behaving like a video game as opposed to it is a video game, it is one video game that is the dominant video game. I don't believe that that's how this unfolds. &gt;&gt; And so in your vision, the idea would be that there'll be lots of places for you to engage with the Internet. &gt;&gt; And some will have a lot more traffic than others. Like your hair salon probably has a website which is important to you at various points and time, but it's not as important to as many people as google.com is. So there will be websites metaverses that have millions and millions of users and foot traffic and those are the places where we want to be. We want to own metaverse real estate, we want to have prominent locations because they are getting tens of footfall. But there will also be metaverse activations that are highly specific, that are regional, that are narrowly focused but are useful to a smaller number of people for less, they still spend as much time on those activations, but they're still very important to the user who's looking for that experience at that point in time. &gt;&gt; This is maybe a good point to talk about or switch gears and talk about some of the microeconomic side of this. I'm curious what your experience has been on a place like Decentraland, for example. In your first interview on Real Vision six or seven months ago, I think the jury was still out because this was just also new about are these metaverse real estate parcels going to trade and act like real-world real estate? And I'm curious now that you've experimented with this Metajuku site and Decentraland and Decentraland has a casinos. Are you seeing scenarios like where stuff that's centralized traits for higher valuations than parcels that are not centralized? Am curious, just what stuff you're seeing. &gt;&gt; I think let's be clear. In crypto, the word centralized means, I think that's different. You mean central, locations that are central whereas centralized in crypto means there's like a corporation or a group of people that's controlling. And so we're talking about central. Yes. &gt;&gt; Decentraland essentially and there are central seemed to trade at a slight premium I saw a parcel and portfolio that was in Genesis Plaza, which is the starting point of Decentraland that was trading and I think 10 times premium to other parcels whether that actually pans out and makes those plots more valuable over time still remains to be seen. It's important to note that the user numbers of Decentraland are still very low. And again I think part of the problem is that there are so many people looking for the metaverse today and they can only find Decentraland because it's one of the first funds that has actually launched it's one of the first ones that was selling land or there's legitimate traction. But the fact is the metaverse category is still in the equivalent of AOL and Prodigy days, dial-up days. We're just getting started and the real metaverse is still unfolding. And so I believe Decentraland will continue to evolve, but so will hundreds of other metaverse entrance, and it will be interesting to watch that unfold over the next 18-36 months. Building a metaverse is very complicated and it takes a long time it takes a lot of engineers, it takes a lot of money. So even though we're all very excited to enter the metaverse and start today, the fact is a lot of these platforms will take years before they're really usable and fulfill the visual imagery we have of the universe that we saw in Ready Player One. So we have to be patient with this industry as it matures and understand that the technology we're seeing today is early stage and not necessarily indicative of what the metaverse is going to look like as the category matures. &gt;&gt; What do you think of the potential for so regular Internet commerce inside a place like Decentraland. So if you all launched this mall, let's call it this metaverse mall, they did really well selling digital assets NFTs did phenomenally well. How far away are we from Amazon opening in Decentraland and people being able to come and shop buy real stuff that gets delivered to their house. &gt;&gt; So let me correct some of that I don't actually know that we've sold anything out of Metajuku. It has been very successful in the fact that the press and the popular imagination has latched onto it as being indicative of how e-commerce will look in the metaverse. Again, the user numbers in Decentraland are very low they're seeing hundreds of thousands of users a day relative to the total amount of Internet traffic it's really a drop in the bucket. But a manager who didn't was explained to consumers and also companies that are selling products. What the metaverse could look like when e-commerce becomes social and interactive. And so while I don't think yet Metajuku in Decentraland has been an enormous success in the way that it's been able to explain the possibilities of the metaverse. I do believe that in the near future, e-commerce will happen in stores like Metajuku, whether they happen in Decentraland, or other metaverse platforms, or in individual web applications built by individual companies the same way they all build their own websites remains to be seen. And so we take a very diversified approach when we think about investing in building we're not assuming the Decentraland is a winner. We're assuming it might be a winner, but we've invested in 25 other platforms. We're tracking hundreds of other companies we're building our own e-commerce activations. We assume that the metaverse would be as nuanced as the Internet is. And just because the Decentraland is the first doesn't mean it will be the only or that it even as necessarily indicative of our best practices will be in the future. &gt;&gt; Yeah, I read an article that said something like 10,000 NFTs sold in an hour or something out of Metajuku. &gt;&gt; That was through actually a retail concept we built called the GFT shop, which is not part of Metajuku. There is a Decentraland store , but it's not Metajuku. We designed this retail store concept again, to show corporate America, global companies. What can be done in the metaverse where people want to buy and we made what I think of as the equivalent of greeting cards. So if it's somebody's birthday or it's her anniversary, you might buy a greeting card, but you can also buy an NFT. So we built a store called the GFT shop where you can go and buy a gift box. It looks like a gift box and it unwraps on a certain date. And there's a surprise inside. Humans love surprises and we did sell 10,000 of those in an hour. So that is also another activation that we built the demonstrated the commercial possibilities of e-commerce in metaverse, but it was outside of Metajuku. So that's what I'm clarifying. &gt;&gt; Another project that you guys did that was really cool is this educational project in some new space. Tell us about that. &gt;&gt; So the genesis of that project is actually interesting. What happened was back in July when we really started getting a lot of press for what we were doing. I would get asked by a dozen or so different companies and universities and conferences for me to come speak and explain the metaverse every week and I used to say yes. And then I quickly realized that if I've said yes to all of them, I was going to shark my day job and I wouldn't actually be able to do it. So I said let's do a weekly Zoom. I will just charge for it. And then as the idea evolved, I thought if we a metaverse company, we should actually do it in the metaverse and there's an opportunity to actually lead the online educational opportunity about the metaverse and do it in the metaverse. So I happened to go to Yale, but I also think people love Harry Potter. So we built this campus that looks like a mix of Yale and Hogwarts. And we started selling admission to what we called Realm Academy. The first semester, the fabulous semester started on February 1st. We have 500 students all have paid to matriculate tuition as an NFT. Classes take place in the metaverse. Courses are led by a mix of industry leaders and university professors. Last week they did a tour which I put on my Twitter that was led by almost like a comic book monster who taught the class, which again, that's what the metaverse was about. It's about being playful. It's about things that act like video games doesn't have to take itself seriously because it doesn't have to. So it's really been a fun experiment. And clearly, the desire for people to learn about the metaverse is people are thirsty for it. And we see this as a business that we're looking to build where we teach people about the business side of the metaverse, the engineering side of the metaverse, the design side of the metaverse, the legal side of the metaverse. And we will be launching new course offerings in the future to take advantage of all of the people and their interest in learning and really becoming an academic hub in the metaverse about the metaverse. So we're really excited about that program it has been amazing so far. And the outpouring of support and interest we've gotten has really been tremendous. &gt;&gt; Yes, it's such a cool project. Did you get people from all over the world? &gt;&gt; All over the world. In fact, we air the courses on the East Coast of the US. So we air the courses at 7:30 PM Eastern time with them. We air them again the next day for a European audience. Then have a live Q&amp;A after that was meant to respond to the number of international students. And we're looking to expand our foreign language offerings in the future to offer things in languages other than English, metaverse is global. Essentially started in Argentina, the sandbox started in France. Apps infinity started in Southeast Asia. So this is not an American phenomenon and it's important for us as a company to make sure that we maintain that global perspective. Otherwise, I'm positive, we won't be the market leader. This is not a geography-specific topic. And we want to be very thoughtful and non-Western-centric in how we think about users and audience and where the new ideas are going to come from. &gt;&gt; I think that's smart. That's the whole point of the universe in some sense is that-. &gt;&gt; Yeah. You can shorten the distance between, I don't know where you are right now, but if Zoom taught us anything during the pandemic, it's that you can maintain friendships and work relationships and do projects across vast distances and metaverse is really there to be the next evolution of that same phenomenon where online communities that may never all be able to meet in person because they're just too spread out, can have a place in the metaverse, that is the home for their community. And that's where the metaverse, I think it starts becoming really powerful when you think about it as being this place where humans can slice their groups up in different ways than we have in the past. Whether it's based on mutual interests or sports teams or being part of a diaspora that's been spread all over the globe. You can meet in the metaverse and do so without having to book flights or travel that it's inconvenient. You can do it without leaving your sofa which is so compelling, especially as we've all become couch potatoes over the last two years. &gt;&gt; As the experience gets better and better as this underlying hardware, it's only going to get more compelling. &gt;&gt; Yeah. Unearthed a big evolution is going to be the audio quality too. One of the things I think you probably see as well that's difficult about Zoom is you can't have crosstalk. You can easily whisper in somebody's ear, have a sidebar conversation. As the audio infrastructure becomes more layered and more realistic, I think that the Metaverse applications will be even more compelling. &gt;&gt; Yeah, agreed. Thinking about the idea of developing, one of the things that every realm is doing that I think is really cool is taking this active role. That seems like that was something that you guys came up with at the very beginning, which I think is super smart. My question is, Metaverse development, if we were using analogy to solve real-world real estate development. Is it difficult or is it something that can be done in the economics, will make sense, or is it just like an engineering thing, like really difficult to say, okay, I'm going to build something out in, I'm going to build an NFT experience in a Sandbox and it's going to cost millions that I need an A16z in order to do that? Or is it achievable for smaller amounts of money? &gt;&gt; I don't think it's about money necessarily. There is a certain amount of technical know-how that's required. But the hard part isn't only building a successful project, it's really thinking cleverly about what it is people want. And we get a lot of real estate companies that want to build a digital twin in the Metaverse, which I think is possibly one of the least exciting things you can do in the Metaverse. We'll get a lot of office building owners that want to build an office building in the Metaverse. Meanwhile, people don't even want to come to the office in the real world, why would they want to go in the Metaverse? When people want to go to the Metaverse, there's two things you can't do in the real world. To have experiences that are more risque, more hallucinogenic, more adrenaline inducer. They don't want to do boring things they can already do in the real world. Why would they choose to do that or they're just like veggie out and are so fun watching Netflix or go out with their friends. And so I think Metaverse development is as much about the technical know-how, which requires definitely in depth of expertise but also understanding the landscape and what works and what people want. And how do you attract users and get them to come back over and over and over again. It's not enough to build something that people visit once, who cares, too expensive to justify the costs. It's how do you take whatever you build and use that as an anchor, a focal point for an online community that becomes a new channel for whatever it is you built, whether it's an adventure, product or you're an individual with a brand. It's thinking very critically about what will bring users back over and over again and for that reason, it's incredibly complicated. It's not as simple as just a higher-end developer. They can rebuild your real-world thing in the Metaverse because quite frankly, that is likely to fail. It needs to be something much more new once, much more like a video game, much more social, much more interactive and all of those things are difficult to weave in and also difficult to build. &gt;&gt; This question of getting people to come back over and over again like the Web 2 companies that figured that out, did really well. &gt;&gt; That's Facebook. That's why when you asked me earlier, is Facebook going to be the winner here? And the one thing Facebook figured out is how to get people to come back. They figured out through likes and newsfeed and all the different messenger, payments, different bells and things they tried that haven't worked, things they tried that have worked. They make people spend an awful lot of time on their platform and that's what's made it so valuable. It wasn't just you went there once, it's that you go there for hours a day inadvertently without even realizing it and just checking to see what's changed and what your friends are up to, and what pictures they've posted. And that addiction, which we can debate whether it's healthy or not, it's certainly valuable from a company standpoint, thinking about what's going to build online communities in the Metaverse, it's going to make people want to return, is where this starts becoming really interesting and where I think the ultimate value creation is going to live. &gt;&gt; Yeah, it seems that way. Because if you think about the potentials for the Internet, this new version of the Internet. There's commerce, there's social, and there's gaming, and they all have a place. The latter two are probably more interesting because of what we've learned in Web 2. Which is, if you design these things correctly, you can create this every five seconds. Pick up your phone and look at something effect. &gt;&gt; Yeah, I going to check it. I'm having a panic attack because I haven't been able to check my phone, right? Exactly. &gt;&gt; In my preparation for this conversation, I came across a bunch of articles about basically people debating back and forth about whether the Metaverse is crypto or is it separate from crypto. How are you thinking about the relationship between all of these really cool things that are happening in the Metaverse or the Internet and crypto? &gt;&gt; I think the future is crypto. I think the ease of payments that we've all learned to take for granted from crypto is here to stay. Therefore, given that the Metaverse is something that we're building for the future, which takes a while to build, is inevitably going to be an encrypted-based ecosystem. The users today that are populating the Metaverse in those platforms we discussed earlier, like Minecraft and [inaudible 00:37:56], they're not necessarily crypto native. But my thesis is that they will be because we all will be. And then the evolution of our economy is towards solutions that are built on watching. And therefore Gaming and Gamify are going to be inherently crypto-centric and therefore so too will the Metaverse be. I don't think that because it's crypto, it's better or that the Metaverse had to be crypto-based, but because crypto is the future and the Metaverse is the future. They are going to converge and the Metaverse that do not embrace crypto are likely not to have the same size user-based because they just won't be as easy to use, they won't be as global, and they won't be as well-received as the ones that are crypto-based. &gt;&gt; Interesting. A platform like Sandbox. Could Sandbox run without crypto, like technology? &gt;&gt; Sandbox without crypto is Minecraft. Sandbox without crypto, it is part of what the crypto economy has done. It has catalyzed their land sales, which has brought in all these users to really catalyze user-generated content, which is the crux of Web 3 where you have creator-generated economies where the creator is close to the consumer and a creator gets paid directly and not through a middleman. And all of those transactions are facilitated through crypto. Could it exist without crypto? Possibly. Is it as likely to have had the adoption and reception that it has without crypto? I do not believe that it would have. &gt;&gt; Yeah. You could build it without cryptography but you wouldn't get the crazy user base that exists in the crypto world. &gt;&gt; I'm sure there have been hundreds of Minecraft competitors [inaudible 00:39:41] genre research to find out how many there have been. But there's only one sandbox. And why is that? It's because I think they had the foresight to build this crypto native economy, to incorporate a token to incentivize people to buy land and to speculate early through a crypto based marketplace. So it is a bit circular, the crypto needs the metaverse and the metaverse needs crypto to be relevant. But I do think that the platforms that are successful will be crypto based and the ones that already exists today are exploring ways to integrate crypto without denigrating the user experience, but also to be forward-looking and making sure that they don't alienate the next-generation of consumers who are going to require crypto integration in order to fit in with their tech stack. &gt;&gt; Is Everyrealm investing in the underlying tokens of the metaverse? &gt;&gt; Yes. &gt;&gt; As well as the NFTs and the digital real estate NFTs? &gt;&gt; Yes. We have holdings that range from equity investments to metaverse platforms, to metaverse real estate to NFTs. We own over 3,000 NFTs today, we've invested in 25 different platforms, we're tracking 300 different metaverse platforms. We look at all of the infrastructure in the space because I think we know it better than almost anybody because we both invest and build. So we know where there's whitespace, we know where there's a need, we're very close to the players, so we know the ecosystem and know who's building things that are interesting. So I think we're at a very unique vantage point in the metaverse ecosystem. &gt;&gt; In that same report that I mentioned earlier, I was reading, you'd listed maybe 15 or 20 of the investments, I think they were investments or maybe they were just projects that you thought were really interesting. And what struck me about it was two things. One, there's some really cool ideas in that list, and I can't wait for these projects to come out. And two, they seem to be gaming focused. Is that how you see things playing out in this next evolution versus the virtual world decentralized experience where you walk around and engage? Is gaming more exciting, or did that just happen because? &gt;&gt; Two things, first of all, our first investment vehicle is meant to invest specifically in metaverse real estate, which is very narrowly defined category, first of all, there aren't that many companies in the planet that are building things that have a metaverse real state component. And the ones that do have it are generally built by gamers and they probably started before metaverse was really a thing. And so their gaming companies that are trying to figure out how to fit the mold of being metaverse company. We have invested in other platforms that we haven't announced yet that are much more of what I would consider to be using more traditional, it's probably raw, but it's traditional metaverse, so more like what you and I are alluding to. And as we expand our own investment mandate and invest in a much broader array of things we will be investing in things that look more like what you're saying, which are companies that are building infrastructure, companies that are building portals, companies that are much more open-ended, creator based economies like to Decentraland and others that don't have a stated objective. &gt;&gt; Okay, that makes sense. So just a few more question then we'll wrap up. What advice do you have for someone who is excited about the metaverse and wants to invest and wants to participate? What kind of recommendations do you have today? &gt;&gt; Buy an NFT, join the discord community, immerse yourself and try to understand what really drives uptake and interest in the space, so that when you go to make investments, you have a clear sense of what makes bigger numbers of users excited. Because ultimately that's going to dictate where the winners are, the companies and the teams that are best able to build things that are addictive and market them appropriately are going to be the most successful. And you will start to get a sense to participate in an online NFT community on their Discord channel. &gt;&gt; And do you have a point of view on Solana, Ethereum, these bigger cryptocurrency projects? &gt;&gt; We actually put out a research piece, it's just one page on all the pros and cons of different protocols that are defining the NFT and metaverse ecosystem, I'll actually post them on my Twitter after this goes live so that people can have a look at that, but it's fairly detailed and it goes through all of the different competitive advantages of the different layers and protocols. And I think it does a good job of doing so in a visual way. &gt;&gt; Great, I think that'd be really interesting for folks. Is Everyrealm still open for investments? &gt;&gt; Or an asset manager, so we manage LP capital and so that's an ongoing business line. As a company, no, we're not actively raising right now, we just closed our Series A. But our asset management business is something that we are constantly building out and we'll be raising new investment vehicles for and taking a new LP capital into, primarily institutional capital, but also ultra high net worth individuals. &gt;&gt; With the same kind of intent that was at the very beginning, which is to invest in broader metaverse publicly traded, for lack of a better phrase, vehicles, or will it be everything? &gt;&gt; Definitely private, not publicly traded. Different investment mandates for different vehicles. So we have a host of different asset manager and products already, and we can talk to interested in investors about what we can do for them specifically, if we have a one-to-one conversation. &gt;&gt; Last question, is there anything about what's happening in crypto or metaverse that concerns you right now? &gt;&gt; I'd like to see more diversity in the sector. I think that there is an opportunity to really shape this ecosystem, is still fairly male-dominated, it comes from both crypto and gaming, which are industries that tend to be overwhelmingly male. And I would love to see more representation generally from women and people of color, people from different geographies. I think it's important as people listen to this, even if they come from neither a crypto nor a gaming background to consider a career change because there's so many job opportunities in this space. Even when we post jobs, the applicants are overwhelmingly falling into a few categories, you can probably guess what they are. We'd love to see more representation generally encourage people to think big and consider that they might be qualified for a job, even though they don't think they are because this is such a new category. &gt;&gt; That's perfect, it's a great place to end this, Janine. Thank you very much for your time. &gt;&gt; Thank you. &gt;&gt; This is super fascinating. Good luck with all of these really cool initiatives that you're undertaking, I can't wait to see how things develop over the next six months to a year. &gt;&gt; Thank you so much. Bye Nick. &gt;&gt; Thank you. &gt;&gt; Hey there. Since you got to the end, I'm guessing you like the video. And that's probably because we don't just turn on a camera and film, we work really hard on getting the narrative flow just right. And that's why many finance companies are actually now hiring RealVision to make videos for them. One of our recent client videos just hit 100,000 organic views on YouTube and there were no kittens in sight. So if you want to find out how RealVision can make a video for your company, just email us at customvideo@realvision.com.<br/></span></div></div></div></div>"}