{"date": "2022-02-22 10:00:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Anirban Sen, Svea Herbst-Bayliss and David French</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Feb 22 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> has become the poster child of technology giants bucking the trend of major conglomerates break<span class=\"tr-strong\">ing </span>up, thanks to bright growth prospects shielding it from pressure to follow suit, investors and dealmakers sa<span class=\"tr-strong\">id</span>. </p><p>Investors have in recent years fallen out of love with conglomerates holding disparate businesses. Many companies have <span class=\"tr-strong\">taken note</span>, with General Electric Co <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GE.N\" data-type=\"ric\" data-ric=\"GE.N\" translate=\"no\" dir=\"ltr\">GE.N</a>, Johnson &amp; Johnson <a href=\"reuters://REALTIME/Verb=FullQuote/ric=JNJ.N\" data-type=\"ric\" data-ric=\"JNJ.N\" translate=\"no\" dir=\"ltr\">JNJ.N</a> and Toshiba Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=6502.T\" data-type=\"ric\" data-ric=\"6502.T\" translate=\"no\" dir=\"ltr\">6502.T</a> announcing plans to break up in recent months.</p><p>Some hedge funds have been arguing that Amazon's $1.6 trillion market capitalization masks the true value of <span class=\"tr-strong\">Amazon Web Services, </span>its cloud business which could be worth almost as much <span class=\"tr-strong\">as a separate entity.</span></p><p>They found ammunition in a letter sent last week by Daniel Loeb's hedge fund Third Point to investors, arguing the company is undervalued <span class=\"tr-strong\">with </span>\"significant sum-of-the-parts value\" hidden <span class=\"tr-strong\">away</span>. Third Point has not <span class=\"tr-strong\">urged </span>Amazon to break up.</p><p><span class=\"tr-strong\">Investment bankers said Amazon was unlikely to part with its cloud business, </span>a big cash cow. <span class=\"tr-strong\">It</span> helps fund Amazon's expansion into new areas and compensates for less lucrative divisions <span class=\"tr-strong\">that</span> are showing strong revenue growth, such as its third-party merchant and advertising businesses.</p><p><span class=\"tr-strong\">\"In contrast to industries where companies may have businesses that are either clearly unconnected or with very different financial profiles and capital needs, large tech companies have ample access to capital and businesses that have not hit maturity,\" said Michael Kagan, Citigroup Inc's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=C.N\" data-type=\"ric\" data-ric=\"C.N\" translate=\"no\" dir=\"ltr\">C.N</a> North America head of shareholder advisory and structured solutions.</span></p><p><span class=\"tr-strong\">\"As a result, opportunities to drive long-term shareholder value by separating into 'pure plays' may be less obvious, both financially and operationally.\"</span></p><p>An Amazon spokesperson declined to comment. </p><p>Amazon has thrived largely on the back of its e-commerce business and highly profitably Amazon Web Services, even as it made inroads in<span class=\"tr-strong\">to</span> new areas, building them or bulking up through large acquisitions in industries ranging from big-budget film-making to online groceries.</p><p>Its rapid <span class=\"tr-strong\">growth</span> has alarmed many U.S. lawmakers, who have in recent years <span class=\"tr-strong\">unsuccessfully</span> pushed for Amazon and big technology peers to be broken up over antitrust and data privacy concerns.</p><p>Those companies<span class=\"tr-strong\">' founders, </span>including Amazon's Jeff Bezos, have pushed back, arguing technology is the glue that keeps their disparate businesses together.</p><p><span class=\"tr-strong\">\"In the world of tech, there typically is an underlying technology that permeates the various segments of a conglomerate entity,\" said Richard Grossman, an M&amp;A partner at Skadden, Arps, Slate, Meagher &amp; Flom LLP.</span></p><p><span class=\"tr-strong\">\"By contrast, in a classic sort of conglomerate you often will see less overlap between a company's various businesses.\" </span></p><p>Amazon's stock price surged at the onset of the COVID-19 pandemic in 2020, as people avoided shopping in stores and doubled down on online orders. <span class=\"tr-strong\">In 2021, the shares barely rose despite bumper gains for the S&amp;P 500 index and other big-tech names, </span>as global lockdowns started easing and consumers relied less on online shopping. </p><p>Analysts have become more bullish on <span class=\"tr-strong\">Amazon. I</span>ts shares <span class=\"tr-strong\">rallied after </span>its fourth-quarter earnings report this month show<span class=\"tr-strong\">ed</span> strong growth in many <span class=\"tr-strong\">non-ecommerce businesses.</span></p><p><br/></p><p>BREAK-UP MANIA</p><p><span class=\"tr-strong\">Some 56 companies announced break-ups last year, up from 41 in 2020 and 47 in 2019, according to Dealogic. </span></p><p><span class=\"tr-strong\">GE said last year it would split into three public companies to reduce debt and simplify its business. Days later, Johnson &amp; Johnson said it would split off its consumer business to focus on its core pharmaceutical business.</span></p><p><span class=\"tr-strong\">Shares of both companies got a boost after the news. That same week, Japan's Toshiba said it would split into three companies as part of a broader push to improve shareholder value, following pressure for change from activists, including Elliott Management Corp.</span></p><p><span class=\"tr-strong\">T</span>he technology sector is a different story. Sprawling empires such as Amazon, Apple and Alphabet are expanding, often through dozens of acquisitions, and are venturing into new areas ranging from autonomous vehicles to groceries. </p><p><span class=\"tr-strong\">Citi's Kagan said the fact that many tech giants are still controlled by their founders also made it less likely that they would yield to pressure to break up anytime soon. </span></p><p><span class=\"tr-strong\">\"Ongoing founder voting control also insulates many tech company boards and management teams from significant outside shareholder influence and activism, which have continued to be a key driver of separation activity,\" Kagan said. </span></p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Anirban Sen in Bengaluru and Svea Herbst-Bayliss and David French in New York; Editing by Greg Roumeliotis and Richard Chang)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Anirban.Sen@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Anirban.Sen@thomsonreuters.com</a> ; (within U.S. +1 646 223 8780; outside U.S. +91 80 6182 3583) Twitter: <a href=\"https://twitter.com/asenjourno\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/asenjourno</a>; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-SPLIT/ (ANALYSIS, PIX)</p></div>"}