{"date": "2022-02-01 15:46:59.999000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>PLANTING HOPE CO INC (\"MYLK-V;MYLKF-0\")\n- Launches Hope and Sesame(R) Barista Blend\n\n     The Planting Hope Company Inc. (\"Planting Hope\" or the \"Company\"), a\nplant-based food and beverage company focused on producing the world's most\nnutritious and planet-friendly products, has partnered with expert baristas\nto create Hope and Sesame(R) Barista Blend, a barista-friendly sesamemilk\nthat tastes great, froths beautifully and performs like a dream in both hot\nand iced beverages.\n\n     \"After many months of formulation and performance trials, we are\nthrilled to debut our brand-new Hope and Sesame(R) Barista Blend, a\nbarista-friendly sesamemilk that steams and foams beautifully without\nsacrificing taste or quality,\" said Julia Stamberger, CEO and Co-Founder of\nPlanting Hope. \"Developed in collaboration with professional baristas, our\nBarista Blend Sesamemilk meets the market demand for a plant-based,\nplanet-friendly milk option that truly performs (deliciously!) in\ncafe-inspired drinks, both at home and at your favorite coffee shop.\"\n\n     \"Our breakthrough Barista Blend supports Planting Hope's growth\nstrategy to reach independent and chain coffee, tea and smoothie shops with\na truly sustainable and functional value-added product, ultimately\nincreasing consumer awareness of sesamemilk,\" Ms. Stamberger added.\n\n     In the United States, Hope and Sesame(R) Barista Blend is available to\nconsumers to purchase online at the brand's website, HopeandSesame.com, as\nwell as Amazon.com and Deliciousness.com, and is available to wholesale\ncustomers at Faire.com and Tundra.com. In Canada, the Barista Blend\nSesamemilk is currently available for wholesale purchase through EcoIdeas\nand will be available to consumers later this week at EcoIdeas.ca.\n\n     Hope and Sesame(R) Barista Blend\n\n*  4g complete plant-based protein per serving (provides all 9 essential\namino acids)\n*  Excellent source of Calcium and a good source of Vitamin D and\nPhosphorus\n*  Vegan/ Soy-Free / Dairy-Free / Gluten-Free Certified / Kosher Certified\n*  Froths, foams and steams like a dream, great for latte art!\n*  Delicious in any hot or iced drink\n\n     Sesame - One of the Most Sustainable Crops on the Planet\n\n*  Requires little water to cultivate, thrives in drought conditions\n*  Bee-friendly, self-pollinating\n*  An excellent cover crop, contributing positively to sustainable\nagriculture\n*  Sesamemilk upcycles the protein remaining after sesame seeds are pressed\nfor oil (traditionally considered a by-product used primarily for animal\nfeed)\n\n(figure class=\"image image_resized\" style=\"width:611px;\")(/figure)     The\nnew Hope and Sesame(R) Barista Blend joins Planting Hope's award-winning\nshelf stable and refrigerated sesamemilk line-up, continuing the brand's\nmission to \"Do Better\". Currently Hope and Sesame(R) offers Organic\nsesamemilk in shelf-stable cartons in five different flavors: Original,\nUnsweetened, Vanilla, Chocolate and signature Chocolate Hazelnut. The\nrecently launched Hope and Sesame(R) Refrigerated Non-GMO Verified\nsesamemilk is available in Unsweetened Original, Unsweetened Vanilla and\nChocolate Hazelnut in 48 oz refrigerated bottles.\n\n     The Hope and Sesame(R) Barista Blend will be sampled at The Specialty\nFood Association's (SFA) 2022 Winter Fancy Food Show, February 6-8, 2022 at\nthe Las Vegas Convention Center booth #4126. Attendees of the Show will\nhave the opportunity to see the new product in action for the first time as\nthe booth will feature a professional barista serving espresso drinks.\n     About Hope and Sesame(R)\n\n     Hope and Sesame(R) has cracked the code on unlocking the dense\nnutrition in tiny sesame seeds, creating an important new trend in plant\nmilk: sesamemilk, both ultra-nutritious and highly planet-friendly. Sesame\nis sustainable, requiring very little water to cultivate, is naturally\ndrought- and pest-resistant, and can self-pollinate. Sesamemilk is\nnutritionally comparable to dairy milk, delivering 8g of complete protein\nper serving (including all 9 essential amino acids) - that's 8x the protein\nin most nut milks and 3x the protein in most oat milks! Hope and Sesame(R)\nsesamemilk is vegan, a good source of protein, an excellent source of\nvitamin D and calcium, is Certified Gluten-Free and Certified Kosher, and\nis free from soy and dairy. All Hope and Sesame(R) products are Non-GMO\nProject Verified and Certified by the Plant Based Foods Association. Hope\nand Sesame(R) was awarded Best Milk Alternative and Best Plant-Based\nSustainability in FoodBev's 2021 World Plant-Based Food Awards and\nsignature Chocolate Hazelnut flavor received the 2020 Sofi Award for Best\nNew Product, Plant-Based Milk from the Specialty Food Association.\n\n     About The Planting Hope Company Inc.\n\n     Planting Hope develops, launches and scales uniquely innovative\nplant-based and planet-friendly food and beverage brands. Planting Hope's\naward-winning and cutting-edge products fill key unmet needs in the\nskyrocketing plant-based food and beverage space. The Planting Hope brand\nfamily includes Hope and Sesame(R) Sesamemilk, RightRice(R) Veggie Rice,\nMozaics(TM) Real Veggie Chips and Veggicopia(R) Veggie Snacks. Founded by\nexperienced food industry entrepreneurs, Planting Hope is a women-managed\nand woman-led company with a focus on nutrition, sustainability and\ndiversity. For more information visit: www.plantinghopecompany.com.\n\nContact:\n\nJulia Stamberger\nCEO and Co-founder\n(773) 492-2243\njulia@plantinghopecompany.com\n\nContact:\n\nRachel Kay Public Relations\nBecca Stonebraker\n(818) 383-3929\nbecca@rkpr.net\n\nInvestor Relations Contact:\n\nCaroline Sawamoto\nInvestor Relations\n(773) 492-2243\nir@plantinghopecompany.com\n\n     Neither the TSX Venture Exchange nor its Regulation Services Provider\n(as that term is defined in the policies of the TSX Venture Exchange)\naccepts responsibility for the adequacy or accuracy of this release.\n\n     Forward-Looking Statement\n\n     This news release contains \"forward-looking statements\" or\n\"forward-looking information\" (collectively referred to hereafter as\n\"forward-looking statements\") within the meaning of applicable Canadian\nsecurities legislation. All statements that address activities, events, or\ndevelopments that the Company expects or anticipates will, or may, occur in\nthe future, including statements about the Company's ability to execute on\nits goals, the timing pertaining to these goals the potential demand for\nthe Company's products, the timing and success of anticipated product\nlaunches and distribution of the Company's products, and the Company's\nbusiness prospects, future trends, plans and strategies. In some cases,\nforward looking statements are preceded by, followed by, or include words\nsuch as \"may\", \"will,\" \"would\", \"could\", \"should\", \"believes\", \"estimates\",\n\"projects\", \"potential\", \"expects\", \"plans\", \"anticipates\", \"continues\", or\nthe negative of those words or other similar or comparable words. In\npreparing the forward-looking statements in this news release, the Company\nhas applied several material assumptions, including, but not limited to,\nthe assumption that demand for the Company's product will be sustained or\nincrease in accordance with management's projections, that the Company's\ncurrent business objectives can be achieved and that its other corporate\nactivities will proceed as expected, and that general business and economic\nconditions will not change in a materially adverse manner. Although the\nmanagement of the Company believes that the assumptions made and the\nexpectations represented by such statements are reasonable, there can be no\nassurance that a forward-looking statement herein will prove to be\naccurate. Forward-looking statements involve known and unknown risks,\nuncertainties, and other factors which may cause the actual results,\nperformance, or achievements of the Company to be materially different from\nany future results, performance, or achievements expressed or implied by\nsuch forward-looking statements. Although management of the Company has\nattempted to identify important factors that could cause actual results to\ndiffer materially from those contained in forward-looking information,\nthere may be other factors that cause results not to be as anticipated,\nestimated, or intended. Risks and uncertainties applicable to the Company,\nas well as trends identified by the Company affecting its industry can be\nfound in the Company's annual information form dated January 6, 2022 and\nthe Company's continuous disclosure record available on SEDAR at\nwww.sedar.com. Such cautionary statements qualify all forward-looking\nstatements made in this news release. The Company undertakes no obligation\nto update or revise any forward-looking statements, whether as a result of\nnew information, future events, or otherwise, except as required by\napplicable law.\n\nWebsite: www.plantinghopecompany.com.\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203100247.MNPRE2203101987-07053520220201</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}