{"date": "2022-01-21 22:31:54+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3033.35, "close": 2890.88}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Jane Lanhee Lee and Timothy Aeppel</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">OAKLAND, Calif./NEW YORK, Jan 21 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Intel Corp’s <a href=\"reuters://REALTIME/Verb=FullQuote/ric=INTC.O\" data-type=\"ric\" data-ric=\"INTC.O\" translate=\"no\" dir=\"ltr\">INTC.O</a> plan to build a $20 billion chip-making complex on the outskirts of Columbus, Ohio is the clearest sign of a burgeoning tech sector in the U.S. Midwest, a development that is sure to raise corporate competition for workers and resources.</p><p>The Intel investment is the state's largest ever, but the Columbus suburb of New Albany, where Intel will build two chip factories, already has seen an influx of data centers, including from Amazon.com Inc<a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, Facebook parent Meta <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a> and Alphabet Inc's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a> Google.</p><p>Just last August, Google raised its investment in New Albany by $1 billion.</p><p>\"Facilities like (the Intel factories), all of these jobs are high skilled jobs,\" said Commerce Secretary Gina Raimondo speaking at the announcement in Ohio. \"All of this manufacturing at every level, not just the PhDs, require some amount of training,\" she added, calling for more apprenticeship programs.</p><p>The first two Intel chip factories will create 3,000 jobs, and the company plans as many as eight factories over time. It has committed $100 million to work with Ohio universities and community colleges for building up a workforce in the chip industry.</p><p>While other rust belt centers have suffered over the decades, Ohio’s state capital Columbus with Ohio State University and six Fortune 500 companies, including Nationwide Mutual Insurance Co. [RIC:RIC:MNUIC.UL] and Cardinal Health Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=CAH.N\" data-type=\"ric\" data-ric=\"CAH.N\" translate=\"no\" dir=\"ltr\">CAH.N</a>, has fared well. </p><p>In addition, it has been an early winner in the build up of the logistics and warehousing industry thanks to its location near the important interstate highway 70 that cuts across the U.S.</p><p>Ample water and stable power resources were also key to winning the deal as Intel needs enormous natural resources, though it has said it aims to be powered 100% by renewable energy and achieve net positive water.</p><p>\"Ohio for years has been saying we have an abundance of water and that would be a strength for industry in this country. And it came in as an advantage here for us,\" said JP Nauseef, president of JobsOhio, which was instrumental in bringing the Intel investment to the state.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting By Jane Lanhee Lee and Tim Aeppel; Editing by Peter Henderson and Alistair Bell)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:jane.lee@thomsonreuters.com\" data-type=\"email\" translate=\"no\">jane.lee@thomsonreuters.com</a> ; +1-415-344-3912; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://jane.lee.thomsonreuters@reuters.net\">jane.lee.thomsonreuters@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: INTEL-OHIO/MANUFACTURING-TALENT</p></div>"}