{"date": "2022-01-07 18:32:53.706000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3265.08, "close": 3229.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Every day, we scour Amazon to find the best deals available. Whether it's something for your kitchen or top-rated tech to give your smart home an upgrade, the online shopping giant offers some of the best prices on a  <span>very</span> wide range of items. Whatever you need, Amazon has you covered.</p></div><div class=\"tr-npp-body\"><p><span><span>Make 2022 the year of good decisions.</span> Start by signing up for our newsletter for twice-weekly tips, reviews and more from our experts.</span> </p><p>Below, you'll find our top 10 Amazon deals right now, including one of our favorite beard trimmers, some stylish planners and a far-reaching snow brush, all of which have been vetted by our team of deals experts to make sure they're \"best of web\" prices. </p><p>► <span>Should you be wearing an N95 mask?:</span> What to know and where to buy them online</p><p>► <span>Home Chef is the best meal kit delivery service</span><span>:</span>  Here's how to save $90.</p><p>If you're not already an Amazon Prime subscriber, you can sign up for a 30-day membership for free. An Amazon Prime subscription gets you free two-day shipping and tons of other benefits for $12.99 a month ($6.49 for students and $5.99 for those receiving qualifying government assistance).</p><p class=\"tr-npp-section-title\">The 10 best Amazon deals you can get today</p><p><big>1. 12% off: These KN95 face masks</big> </p><p>Stay protected this winter with these SupplyAid KN95 face masks on sale at Amazon today. Typically listed for $15.99, you can get a five-pack of the masks for 12% off, or $14.01. SupplyAid says the masks come with an exhalation valve to offer better airflow and less humidity inside the facial cover. The developer recommends users store the masks in a dry and ventilated location.</p><p><span>Get the SupplyAid KN95 Face Mask with Exhalation Valve 5-Pack for $14.01 (Save $1.98)</span> </p><p><big>2. Up to 40% off: These colorful planners</big> </p><p>Keep an eye on your most important appointments this year by shopping these colorful 2022 planners on sale at Amazon today. There's the Global Printed Products 2022 pocket planner on sale in four different colors for $8.97, down from a list price of $14.95. Measuring about 4 by 7 inches, the planner uses two pages to show each week. There's also the brand's Large Hardcover planner, on sale for $13.77 from its list price of $22.95. Global Printed Products says the planner measures at 8.5 by 11 inches, with monthly calendar spreads every two pages, along with a hardcover front and a pocket folder on its back inside cover.</p><p><span>Save up to 40% on 2022 planners</span> </p><p><big>3. Save $20: This user-friendly tax software</big> </p><p>Get a head start on tax season by grabbing a TurboTax Deluxe download card for PC. Not only is the card marked down to $49.99, 28% off its list price of $69.99, but purchases come with a $10 Amazon gift card for free. TurboTax says the card lets you make five electronic filings of federal tax returns and one filing for state tax returns, and suggests that this specified package is best for homeowners who have made charitable donations and have high medical expenses.</p><p><span>Get the TurboTax Deluxe 2021 Download Card with Amazon Gift Card for $49.99 (Save $20)</span> </p><p><big>4. 17% off: One of our favorite beard trimmers</big> </p><p>Skip the barbershop this winter and keep your beard in line with Philips' Norelco MG3750/60, which is on sale at Amazon for just $17.50. (That's 17% off of its listing price of $20.99.) The MG3750/60 is one of our favorite beard trimmers for its sharp blades, which didn't catch on even the coarsest hair testing. (They were easy to clean, too!) We also appreciated the multiple accessories that come with this kit—think multiple trimmers for the nose and ear hairs, along with guards for beards and stubble.</p><p><span>Get the Philips Norelco MG3750/60 Multigroomer for $17.50 (Save $3.49)</span> </p><p><big>5. Save $50: These soothing earbuds</big> </p><p>If you use relaxing sounds to help you fall asleep, you'll be wowed by the technology of the Bose Sleepbuds II. Normally listed for $249, you can get these wireless headphones for $199 right now thanks to a 20% discount. When we tested the Sleepbuds II, we were impressed with how well the buds stayed put in our tester's ears overnight, and the battery life of around nine hours. While we wished we could access other forms of relaxing audio like sleep stories and guided meditations, users can find 39 white noise sounds through the Bose mobile app </p><p><span>Get the Bose Sleepbuds II for $199 (Save $50)</span> </p><p><big>6. 25% off: This compact pull-up bar</big> </p><p>Keep your fitness routine going wherever there's a door frame with the Perfect Fitness Sport Multi-Gym pull-up bar. Typically listed for $34.99, this compact workout system is marked down 25% to 26.24. Perfect Fitness says the bar isn't just for pull-ups, as it can be turned over and placed on the floor to help you do sit-ups, push-ups and dips. The brand says the bar fits door frames 27 to 35 inches wide and has a 300-pound weight limit. </p><p><span>Get the Perfect Fitness Sport Multi-Gym Pull-Up Bar for $26.24 (Save $8.75)</span> </p><p><big>7. Less than $25: One of our favorite foam rollers</big> </p><p>Add more tools to your workout routine with the TriggerPoint GRID foam roller. Normally priced at $39.99, you can get this 13-inch muscle tool for as low as $22.72 with a 43% discount. The GRID is our favorite compact foam roller due to the lasting durability from its hard plastic and dense foam material. Its varied rolling surface allows for different levels of deep tissue massage while being both firm and cushioned enough for comfort.</p><p><span>Get the TriggerPoint GRID Original Foam Roller from $22.72 (Save $5 to $17.27)</span> </p><p><big>8. 25% off: Our favorite adjustable dumbbell</big> </p><p>Toughen up this year with the Bowflex SelectTech 552 adjustable dumbbell. Typically listed for $199, this 52.5-pound fitness tool can be yours for 25% off at $149. The SelectTech 552 can be set for weights from 5 to 52.5 pounds, with the ability to increase the load by 2.5-pound increments, and it's the best adjustable dumbbell we've ever tried, mainly for how easy it was to re-rack thanks to a tray that separates the weight plates from each other.</p><p><span>Get the Bowflex SelectTech 552 Adjustable Dumbbell for $149 (Save $50)</span> </p><p><big>9. Less than $900: This color-rich TV</big> </p><p>Enhance the looks of your favorite shows and movies by picking up the LG NanoCell 90 Series 4K Smart TV. Typically listed from $1,099.99, you can get this Alexa-friendly screen in its smallest, 55-inch size for $203 off at $896.99. LG says its NanoCell technology offers a technological advantage by employing \"uniformly-sized particles approximately one nanometer in diameter to create more subtle, accurate colors\" in the TV's picture. On top of that is the TV's Dolby Atmos sound and built-in access to Prime Video, Disney+ and other popular streaming services.</p><p><span>Get the LG NANO90UPA NanoCell 90 Series 4K Smart UHD TV from $896.99 (Save $203)</span> </p><p><big>10. 12% off This extra-long snow brush</big> </p><p>Clear up your vision before your morning drive to work with the Mallory 532 Cool-Force snow brush. Normally priced at $12.45, Amazon is offering the 26-inch accessory for $10.99. The two-foot-plus length of the brush offers a long reach while still being small enough to be stored in your car. It also features a foam grip for comfort and a four-inch-wide scraper blade to chip away shards of ice. </p><p><span>Get the Mallory 26-Inch 532 Cool-Force Snowbrush with Ice Scraper for $10.99 (Save $1.46)</span> </p><p class=\"tr-npp-section-title\">Amazon deals you may have missed</p><p><big>1. Vicseed Car Phone Mount</big> </p><p>Keep even the biggest smartphones secure while you're on the road with this Vicseed car phone mount. Usually listed for $24.95, this hands-free device is now available at a 15% discount for $21.20. The brand says the universal mount can fit a variety of smartphones, including the iPhone 13 Pro Max, the Samsung Galaxy Note S21 Ultra 5G and more. It also features a telescopic arm that can extend out to nine inches and a highly flexible ball joint that can move 360 degrees.</p><p><span>Get the Vicseed Universal Car Mount for $21.20 (Save $3.75)</span> </p><p><big>2. Renpho ES-CS20M Smart Body Fat Scale</big> </p><p>Keep a close eye on your fitness progress from the comfort of your bathroom with the Renpho Bluetooth Smart Scale, on sale for just $23.91, $13.08 off its list price of $36.99. The Renpho is our favorite bathroom scale thanks to its fast-acting technology, which provides accurate measurements to the Renpho mobile app. The scale can also calculate bone mass, body fat percentage, metabolic age and other statistics in a speedy fashion on the app and on the scale.</p><p><span>Get the Renpho ES-CS20M Smart Bluetooth Body Fat Scale for $23.91 with coupon (Save $13.08)</span> </p><p><big>3. Blue Yeti Nano USB Microphone</big> </p><p>Get grade-A audio on your next podcast or game stream with the Blue Yeti Nano USB microphone. Typically listed for $99.99, this wired device is on sale for $79.99 thanks to a 20% discount. Blue says the Yeti Nano features two built-in custom mic capsules to capture the presence and detail of any voice, along with onboard controls to find the right volume. At only 8.3 inches tall and 3.78 inches wide, it's also sized to fit on any desktop. </p><p><span>Get the Blue Yeti Nano Premium Condenser USB Microphone for $79.99 (Save $20)</span> </p><p><big>4. Renpho RF-FM059 Foot Massager</big> </p><p>Skip spending money at the masseuse and try this Renpho RF-FM059 foot massager. Normally priced at $139.99, you can get this relaxation accessory for $100.49 with its current $29.50 price cut and an additional $10 coupon on the product page. The FM059 is an alternate version of our favorite foot massager, the Renpho RF-FM059R ($124.99), the only difference being the FM059 comes without the remote. You'll still get the massager's easy-to-use control panel and customizable knead level for just the right feeling on your feet.</p><p><span>Get the Renpho RF-FM059 Foot Massager for $100.49 with coupon (Save $39.50)</span> </p><p><big>5. Breville Juicers</big> </p><p>If you prefer your fruits and veggies mixed into a tasty smoothie, Amazon is offering a collection of Breville juicers on sale today. There's the brand's Juice Fountain Compact, typically listed for $89.89 but now on sale for $79.95. This particular model is one of the best juicers we've ever tested thanks to its ability to collect pulp around the exterior edge of the strainer basket and speedy juicing ability. There's also the Breville Juice Fountain Plus, available at a 20% discount from $159.95 down to $127.95. The brand says its stainless steel juicer features an extra-wide three-inch chute so it can handle entire vegetables and fruits, plus an integrated froth separator in its juice jug to get the most juice out of whatever you're making. </p><p><span>Save up to 20% on Breville juicers</span> </p><p class=\"tr-npp-section-title\">Other noteworthy Amazon deals we found </p><ul class=\"bulleted-list arrowlist\"><li>Save up to 20% on Fitness Equipment from Bowflex and Schwinn</li><li>Save up to 50% on Amazon fitness trackers</li><li>Buy Two, Get One for Half Off Beauty Essentials</li><li>Save $10 on purchases of $40 or more home cleaning products</li><li>Febreeze Unstopables Fresh Small Spaces Air Freshener for $8.37 with coupon code (Save $6.13)</li><li>KT Thermo 3-Inch Dial Oven Thermometer for $13.35 with coupon (Save $2.25)</li><li>Philips One by Sonicare Battery Toothbrush from $14.95 (Save $10 to $10.04)</li><li>1-Year subscription to Amazon Kids+ for $19.99 (Save $79.01)</li><li>Hilife HL7 Clothes Steamer for $21.66 (Save $14.33)</li><li>On/Go at-Home COVID-19 Rapid Antigen Self-Test 2-Pack for $24.88 (Save $15.11)</li><li>Pure Enrichment PureRelief XL Heating Pad for $27.99 with coupon (Save $7)</li><li>Revlon One-Step Hair Dryer And Volumizer Hot Air Brush from $34.88 (Save $16.90 to $25.11)</li><li>Amazon Fire HD 10 64 GB Tablet for $94.99 (Save $95)</li><li>Noco Boost Plus GB40 1000 Amp 12-Volt Jump Starter Box for $99.95 (Save $26)</li><li>DeWalt 20-Volt Max Cordless Drill 2-Tool Combo Kit for $160.65 (Save $38.35)</li><li>AKRacing Nitro Gaming Chair for $299.99 (Save $179.01)</li><li>Omega Juicer Extractor and Nutrition System for $329.99 (Save $50.12)</li><li>Apple Watch Series 7 from $369 (Save $30)</li><li>KitchenAid Artisan Series 5-Quart Stand Mixer from $429 (Save $30.04 to $30.99)</li><li>LG 65-Inch OLED C1 Series Alexa Built-In 4K Smart TV for $1,296.99 (Save $603)</li><li>NordicTrack Commercial Series 1750 Treadmill with 30-Day iFit Membership for $1,599 (Save $400)</li> </ul><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Updated daily: Here are the 10 best Amazon deals today in January 2022</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}