{"date": "2021-11-02 00:02:28+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><span>\n              <p>NEW YORK, Nov 1 (IFR) - Amazon-backed EV pickup maker <strong>Rivian Automotive</strong> reignited the US new issue market by moving ahead late Monday with its blockbuster US$8.4bn Nasdaq IPO, a deal already largely spoken for with orders from a who’s who of heavy-hitting investors.</p>\n              <p>Rivian, the biggest of six US IPO launches on Monday, plans to sell 135m primary shares or 15%-16% of the company at US$57-$62 for pricing Tuesday, November 9.</p>\n              <p>The offering will likely rank as the biggest US IPO of the year, outstripping Korean e-commerce company <strong>Coupang</strong>'s US$4.6bn NYSE offering priced in March.</p>\n              <p>Rivian’s IPO will also likely top <strong>Uber Technologies</strong>’ US$8.1bn NYSE debut in 2019, the biggest since <strong>Alibaba</strong>’s US$22bn US IPO in 2014.</p>\n              <p>A powerhouse group of backers have already agreed to invest a combined US$5bn or nearly 60% of the sum Rivian is seeking. </p>\n              <p>The cornerstone investors include Amazon, T. Rowe Price, Coatue Management, Franklin Templeton, Capital Research Global Investors, Third Point, Blackstone Alternative Asset Management, Dragoneer Investment and Soros Fund Management  Amazon, which already has a 20% stake after leading a US$2.5bn funding round in July, is putting in US$200m of that sum.</p>\n              <p>Rivian is also setting aside another 7% of the offering for eligible US customers with a standing pre-order.</p>\n              <p>The company, founded by MIT-trained mechanical engineer Robert Scaringe in 2009, has preorders for 55,400 of its R1T model and R1S model in the US and Canada from customers that have paid a US$1,000 deposit.</p>\n              <p>The R1T is a two-row five-passenger pickup truck and the R1S a three-row seven-passenger SUV. But essentially underwriting Rivian’s near-term revenues, Amazon has ordered 100,000 electric delivery vans in the largest EV order ever.</p>\n              <p>Rivian began deliveries of the R1Ts in September (and has now delivered 156 of them), and expects to have produced 1,200 of the former and 25 R1Ss by the end of this year.</p>\n              <p>The offering leads an already overflowing November IPO calendar that includes at least 17 live US IPOs seeking to raise nearly US$12bn.</p>\n              <p>The IPO also looks well-timed alongside the renewed surge in the shares of Elon Musk's Tesla, which is taking orders for its cybertruck (ahead of production next year) and has taken legal action against Rivian in a dispute over trade secrets.</p>\n              <p>(Anthony Hughes; Editing by Stephen Lacey)</p>\n              <p>((anthony.hughes@refinitiv.com; (646) 552-4852))</p>\n            </span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © Refinitiv 2021. Click For Restrictions - https://www.refinitiv.com/en/policies/copyright-notice</p></div>"}