{"date": "2021-11-15 21:00:00.149000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Qualtrics and AWS Expand Relationship to Transform Customer Feedback into Enhanced Experiences</b>\n</p><p class=\"bwalignc\">\n<span>Leading experience management software provider selects AWS as its preferred cloud provider to support accelerated innovation, scale globally, and deliver actionable stakeholder insights faster</span>\n</p><p class=\"bwalignc\">\n<span>Amazon will rely on Qualtrics’ experience management technology to listen, understand, and act on customer and employee feedback</span>\n</p><p>\nToday, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), and Qualtrics (NASDAQ: XM) announced they are expanding their relationship, with Qualtrics migrating its internal IT systems and customer-facing workloads to the world’s leading cloud. The migration includes Qualtrics’ complete portfolio of experience management (XM) applications and its xFlow automated workflow system. Qualtrics selected AWS as its preferred cloud provider to enhance operational performance, expand globally, and develop new features that help uncover deeper insights for its customers. Qualtrics will be able to provide customers with actionable insights faster and more efficiently using AWS’s proven infrastructure and broad capabilities, including machine learning, analytics, databases, security, and compute.\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: <a href=\"https://www.businesswire.com/news/home/20211115005024/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211115005024/en/</a></p><p>\nQualtrics’ cloud-native technology aggregates customer and employee feedback and enables companies to analyze it and take action. Qualtrics is now moving its customer-facing workloads to AWS. For example, Qualtrics uses Amazon DynamoDB, AWS’s key-value and document database service, as the underlying infrastructure for its XM Directory, the largest human sentiment database in the world with more than 4 billion customer and employee profiles. Qualtrics also uses Amazon SageMaker, a service that helps data scientists build, train, and deploy machine learning models quickly, as the backbone for Qualtrics iQ, its machine learning-powered analytics suite that enables Qualtrics to develop its natural language processing models more efficiently and deliver actionable customer and employee insights faster.\n</p><p>\nAmazon’s customer and employee feedback programs will also be able to rely on Qualtrics to gather and analyze stakeholder feedback. Through Qualtrics’ experience management technology, Amazon will be able to quickly understand customer and employee feedback to make data-driven decisions across multiple departments.\n</p><p>\n“Qualtrics and Amazon share the same guiding principle of customer obsession, and our mutual strengths are helping both companies operate better. Using AWS’s global infrastructure and breadth of machine learning and cloud capabilities will help us surface actionable insights at the speed that our customers, including Amazon, know and expect,” said Qualtrics Chief Technology Officer John Thimsen. “More than 13,500 organizations rely on Qualtrics to deliver incredible customer and employee experiences, and we are continuously innovating on our technology to help customers unlock new growth opportunities in the experience transformation era.”\n</p><p>\n“Data is foundational to helping enterprises understand their operating landscape and improve the overall experience for their customers,” said Matt Garman, Senior Vice President of Sales and Marketing at Amazon Web Services, Inc. “AWS’s industry-leading cloud capabilities and our proven global infrastructure give Qualtrics the ability to deliver timely, in-depth insights to customers with the utmost security and reliability. The strength and scale of this relationship will also help global companies such as ours use Qualtrics to deliver insights that can lead to improved outcomes around the world.”\n</p><p>\n<b>About Amazon Web Services</b>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com&amp;esheet=52528110&amp;newsitemid=20211115005024&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=1&amp;md5=404630c455d20415b560328fda300d5f\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<b>About Amazon</b>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Famazon.com%2Fabout&amp;esheet=52528110&amp;newsitemid=20211115005024&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=2&amp;md5=af421768c0db665dc5c4c9046a1584d5\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p>\n<b>About Qualtrics</b>\n</p><p>\nQualtrics, the leader and creator of the Experience Management (XM) category, is changing the way organizations manage and improve the four core experiences of business—customer, employee, product and brand. Over 13,500 organizations around the world use Qualtrics to listen, understand and take action on experience data (X-data™)—the beliefs, emotions and intentions that tell you why things are happening, and what to do about it. The Qualtrics XM Platform™ is a system of action that helps businesses attract customers who stay longer and buy more, engage employees who build a positive culture, develop breakthrough products people love and build a brand people are passionate about. To learn more, please visit qualtrics.com.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211115005024r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTE1MDA1MDI0cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=a070c08d403b3babd0b3117b794c26cf096e11f43cd0ff2f7190ce7dc62afadda14e230618728c5cee713756e4cd993a350e7833115e35639ff78b5f50dd58af\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211115005024/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211115005024/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52528110&amp;newsitemid=20211115005024&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=3&amp;md5=df396601806019c784b6af2167581cf3\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON-WEB-SERVICES</p></div>"}