{"date": "2021-11-12 13:24:27.384000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3482.05, "close": 3525.15}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Nov 12, 2021</p></div><div class=\"tr-npp-lead\"><p>Chicago, IL – November 12, 2021 – Today, Zacks Equity Research discusses Retail - Drug Store, including CVS Health Corporation <a href=\"https://www.zacks.com/stock/quote/CVS\" data-type=\"url\" class=\"tr-link\" translate=\"no\">CVS</a> , Rite Aid Corporation <a href=\"https://www.zacks.com/stock/quote/RAD\" data-type=\"url\" class=\"tr-link\" translate=\"no\">RAD</a> and Amazon.com, Inc. <a href=\"https://www.zacks.com/stock/quote/AMZN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AMZN</a> .</p><p>Link: <a href=\"https://www.zacks.com/commentary/1826977/2-retail-pharmacy-and-drugstore-stocks-to-watch-amid-industry-headwinds\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.zacks.com/commentary/1826977/2-retail-pharmacy-and-drugstore-stocks-to-watch-amid-industry-headwinds</a> </p></div><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">For Immediate Release</p><p>Through the months of the pandemic, the pharmaceutical and drugstore industry witnessed a sea change in the nature of the business. In the initial phase of COVID-19, the brick-and-mortar pharmacy retailers gained enormous prominence as a result of panic-buying of all kinds of immunity-boosting drugs. Later, with the advancement in terms of COVID-19 testing, medication, and vaccination, the pharmacy networks of these drug retailers played a crucial role, serving as COVID-19 testing and vaccination centers. Currently, these networks are collaborating with the government and playing a pivotal role in launching vaccination drives across the nation.</p><p>Further, mail-order pharmacies are registering growth on account of telehealth and remote monitoring services, creating unique opportunities for stalwarts within the industry like<span>CVS Health</span>and<span>Rite Aid</span>, which invested strategically in easy patient access to prescription and maintenance medications during this period. However, majority of the retail drug store heavyweights have been southbound on the ongoing pharmacy reimbursement pressure including issues surrounding vaccination reimbursement. Further,<span>Amazon</span>'s plan to enter the brick-and-mortar pharmacy space has created an uproar among the industry players.</p><p class=\"tr-npp-section-title\">Industry Description</p><p>The Zacks <a href=\"https://www.zacks.com/stocks/industry-rank/industry/retail-pharmacies-and-drug-stores-159\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Retail - Pharmacies and Drug Stores</a> industry includes retailing of a range of prescription and over-the-counter medications. The broad retail network of companies within the retail pharmacy industry delivers advanced health solutions to patients, customers and caregivers. Over the past few years, the scope of the retail pharmacy and drugstore market has expanded exponentially.</p><p>In North America, some of these entities evolved to add wellness products and groceries to their traditional portfolio of prescription and over-the-counter medications. Going by a small business chronicle report, CVS Health and Rite Aid are among the \"big three\" in the drugstore space. However, non-healthcare leaders like Amazon in 2018, acquired pharmacy delivery startup PillPack to enter the U.S. healthcare space.</p><p class=\"tr-npp-section-title\">4 Trends Shaping the Future of the Retail - Pharmacies and Drug Stores Industry</p><p><span><span>Industry Trend Remains Dismal Amid Reimbursement Pressur</span> </span><span>e</span> : Brand name drugs, which hold wide profit margins, are protected with a reliable supply chain. However, the low-margin generic drugs, which have a fragile supply chain network, have been bearing the brunt of the pandemic-induced economic slump.</p><p>Drug retailers are also suffering from an incessant rise in medicine prices, stemming from the rising cost of raw materials of drugs. The industry players are currently grappling with continued pressure from non-reimbursable pharmacy expenses, which are significantly pulling down the mass demand for prescription as well as over-the-counter drugs, and vaccinations. It has been widely observed that patients are replacing prescription medicines with low-cost generic drugs.</p><p><span><span>Threat of Amazon Entering Brick-And-Mortar</span> </span>: <a href=\"https://www.businessinsider.com/exclusive-amazon-pharmacy-considering-physical-stores-2021-5?IR=T\" data-type=\"url\" class=\"tr-link\" translate=\"no\">A Business Insider report</a> on May 26 came up with the speculation that there have been discussions about Amazon setting up stand-alone stores in a few locations, including Boston and Phoenix. Further, per the report, which cites insider sources, Amazon is exploring plans of placing the pharmacies inside Amazon-owned Whole Foods locations.</p><p>Through 2020, the brick-and-mortar pharmacy retailers gained enormous prominence with their vast pharmacy networks serving as COVID-19 testing centers. Following its entry, the e-commerce giant grabbed a significant chunk of the online pharmacy market from the legacy retail drug store space. Needless to say, this latest speculation has come as a major blow to the industry, putting the retail pharmacy and drugstore stocks in a tighter spot.</p><p><span><span>Major Role in COVID Support Drives Growth</span> </span>: A number of retail pharmacy players are currently playing a pivotal role in administering COVID-19 vaccination shots. The center has launched Federal-Retail Pharmacy Program for COVID-19 vaccination to increase access to vaccines across the United States. This line of opportunity is contributing significantly to these industry players' top line.</p><p><span><span>Online Pharmacy and Mail Order Boom</span> </span>: The widespread shelter-in-place regulations since the beginning of the pandemic have created a significant shift in demand toward mail order and online pharmacy from traditional brick-and-mortar pharmacies. However, experts say that this transition is expected to last even after the pandemic is over. Data claims that COVID-19 has only accelerated the already-growing demand for e-pharmacy and mail-ordered home delivery systems.</p><p>Going by a Patch report, \"Two years ago, 11% of U.S. adult pharmacy customers got their prescription from an online pharmacy, based on a survey conducted by market research firm CivicScience, [.] That figure has been steadily rising over the years, according to Statista.com, an online statistics portal.\" With Amazon's big move into the healthcare space, the retail pharmacy industry entered a new phase of fierce competition. To counter this rivalry, the companies operating in the space are strategically attempting to gain in size and scale, both organically and inorganically.</p><p class=\"tr-npp-section-title\">Zacks Industry Rank Indicates Dull Near-Term Prospects</p><p>The industry's <a href=\"https://www.zacks.com/stocks/industry-rank/industries/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Zacks Industry Rank</a> , which is basically the average of the Zacks Rank of all the member stocks, indicates bleak near-term prospects. The Zacks Retail - Pharmacies and Drug Stores industry, housed within the broader Zacks Retail and Wholesale sector, currently carries a Zacks Industry Rank #246, placing it in the bottom 2% of more than 250 Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperforms the bottom 50% by a factor of more than 2 to 1.</p><p>We will present a few stocks that have the potential to outperform the market based on a strong earnings outlook. But it's worth taking a look at the industry's shareholder returns and current valuation first.</p><p class=\"tr-npp-section-title\">Industry Underperforms S&amp;P 500 but Outperforms Sector</p><p>The Zacks Retail - Pharmacies and Drug Stores industry has underperformed the Zacks S&amp;P 500 composite but exceeded its own sector over the past six months. The stocks in this industry have collectively gained 5.1% over this period while the Retail-Wholesale Sector has moved up 1.6%. The Zacks S&amp;P 500 composite has increased 15.9% over the said time frame.</p><p class=\"tr-npp-section-title\">Industry's Current Valuation</p><p>On the basis of forward 12-month price-to-earnings (P/E), which is commonly used for valuing medical stocks, the industry is currently trading at 10.71X compared with the S&amp;P 500's 22.08X and the sector's 29.24X.</p><p>Over the last five years, the sector has traded as high as 14.95X, as low as 7.42X, and at the median of 9.98X.</p><p class=\"tr-npp-section-title\">2 Retail - Pharmacies and Drug Stores Stocks in Focus</p><p><span>Rite Aid</span>: Continued strength in its underlying business, accelerated COVID-19 vaccine program, solid performance at Elixir, and enhanced retail and digital experiences are driving Rite Aid's revenues in the recent quarters. The company remains committed to providing lower healthcare costs, better customer engagement and personalized services.</p><p>The Zacks Consensus Estimate for fiscal 2022 (ending Feb 2022) revenues of Rite Aid indicates an increase of 3.9% over fiscal 2021. Rite Aid, a Zacks Rank #3 (Hold) stock, has risen 14.2% in the past year.</p><p>You can see<span><a href=\"https://www.zacks.com/stocks/buy-list/?ADID=zp_1link&amp;ICID=zpi%20_1link\" data-type=\"url\" class=\"tr-link\" translate=\"no\">the complete list of today's Zacks #1 Rank stocks here</a> </span>.</p><p><span>CVS Health</span>: CVS Health is currently seeing greater engagement in an expanded set of digital health services such as antibody and PCR testing, vaccinations and omni-channel pharmacy. In the third quarter, the company witnessed strong demand for the integrated solutions across the healthcare continuum, including health management programs for chronic conditions, mental health support, pharmacy services, and health and wellness products.</p><p>Within pharmacy services, growth outperformed CVs Health's expectations. Specialty pharmacy revenues too are gaining momentum. However, reimbursement headwinds are building pressure on the stock's bottom line.</p><p>The Zacks Consensus Estimate for 2021 earnings indicates a year-over-year increase of 7%. CVS Health, a Zacks Rank #3 (Hold) stock, has risen 33.7% in the past year.</p><p>Join us on Facebook: <a href=\"https://www.facebook.com/home.php#/pages/Zacks-Investment-Research/57553657748?ref=ts\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.facebook.com/home.php#/pages/Zacks-Investment-Research/57553657748?ref=ts</a> </p><p>Zacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates.</p><p>Media Contact</p><p>Zacks Investment Research</p><p>800-767-3771 ext. 9339</p><p><a href=\"mailto:support@zacks.com\" data-type=\"email\" translate=\"no\">support@zacks.com</a> </p><p><a href=\"https://www.zacks.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.zacks.com</a> </p><p>Past performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&amp;P 500 is an unmanaged index. Visit <a href=\"https://www.zacks.com/performance\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.zacks.com/performance</a> for information about the performance numbers displayed in this press release.</p><p><span>Tech IPOs With Massive Profit Potential</span></p><p>In the past few years, many popular platforms and like Uber and Airbnb finally made their way to the public markets. But the biggest paydays came from lesser-known names.</p><p>For example, electric carmaker X Peng shot up +299.4% in just 2 months. Think of it this way...</p><p>If you had put $5,000 into XPEV at its IPO in September 2020, you could have cashed out with $19,970 in November.</p><p>With record amounts of cash flooding into IPOs and a record-setting stock market, this year's lineup could be even more lucrative.</p><p><a href=\"https://www.zacks.com/registration/ultimatetrader/welcome/eoffer/4e87?add=2116&amp;adid=NEWSTEX_CONTENT_ZU_IPOREPORT_2B_PRESSRELEASES_11122021&amp;cid=CS-NEWSTEX-FT-press_releases-1827281\" data-type=\"url\" class=\"tr-link\" translate=\"no\">See Zacks Hottest Tech IPOs Now &gt;&gt;</a></p><p>Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.</p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=RPT_7BST_LP194&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_PRESSRELEASES&amp;cid=CS-NEWSTEX-FT-press_releases-1827281\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Click to get this free report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=RAD&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_PRESSRELEASES&amp;cid=CS-NEWSTEX-FT-press_releases-1827281\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Rite Aid Corporation (RAD): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=AMZN&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_PRESSRELEASES&amp;cid=CS-NEWSTEX-FT-press_releases-1827281\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. (AMZN): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=CVS&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_PRESSRELEASES&amp;cid=CS-NEWSTEX-FT-press_releases-1827281\" data-type=\"url\" class=\"tr-link\" translate=\"no\">CVS Health Corporation (CVS): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/stock/news/1827281/zacks-industry-outlook-highlights-cvs-health-rite-aid-and-amazon?cid=CS-NEWSTEX-FT-press_releases-1827281\" data-type=\"url\" class=\"tr-link\" translate=\"no\">To read this article on Zacks.com click here.</a></p><p><a href=\"http://www.zacks.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Zacks Investment Research</a></p><p>The views expressed in any and all content distributed by Newstex and its re-distributors (collectively, the \"Newstex Authoritative Content\") are solely those of the respective author(s) and not necessarily the views of Newstex or its re-distributors. Stories from such authors are provided \"AS IS,\" with no warranties, and confer no rights. The material and information provided in Newstex Authoritative Content are for general information only and should not, in any respect, be relied on as professional advice. Newstex Authoritative Content is not \"read and approved\" before it is posted. Accordingly, neither Newstex nor its re-distributors make any claims, promises or guarantees about the accuracy, completeness, or adequacy of the information contained therein or linked to from such content, nor do they take responsibility for any aspect of such content. The Newstex Authoritative Content shall be construed as author-based content and commentary. Accordingly, no warranties or other guarantees are offered as to the quality of the opinions, commentary or anything else appearing in such Newstex Authoritative Content. Newstex and its re-distributors expressly reserve the right to delete stories at its and their sole discretion.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Zacks Investment Research</p></div>"}