{"date": "2022-02-12 14:49:33.131000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3180.07, "close": 3103.34}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Ridley Scott is set to team with Amazon to create a new live-action sequel series to Blade Runner.</p><p>Blade Runner 2099 will follow on from Denis Villeneuve's 2017 sequel Blade Runner 2049 to further expand the world originally created by Philip K Dick in his 1968 novel Do Androids Dream of Electric Sheep?</p></div><div class=\"tr-npp-body\"><p>Scott directed the much-loved 1982 adaptation Blade Runner and is set to executive-produce the new series with the potential for him to also direct. In November, Scott <a href=\"https://variety.com/2021/tv/global/blade-runner-alien-tv-series-ridley-scott-1235117198/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">confirmed</a> that the show was in development and a pilot had been written.</p><p>The series was reportedly brought to market last fall with Amazon pouncing and developing it further as a priority. It will mark the second Blade Runner television show after last year's anime series Blade Runner: Black Lotus which is set in 2032. Reviews have been mixed, with the AV Club's Sam Barsanti <a href=\"https://www.avclub.com/blade-runner-black-lotus-is-a-fine-replication-of-blad-1847959933\" data-type=\"url\" class=\"tr-link\" translate=\"no\">writing</a> that \"there isn't really a compelling hook here aside from the Blade Runner bit in the title\".</p><p>Blade Runner 2049 received strong reviews but was a box office disappointment making $259m globally from a budget that was estimated to be between $150-185m. The Guardian's Peter Bradshaw called it \"visually staggering\" in <a href=\"https://www.theguardian.com/film/2017/sep/29/blade-runner-2049-review-ryan-gosling-harrison-ford-denis-villeneuve\" data-type=\"url\" class=\"tr-link\" translate=\"no\">a five-star review</a> .</p><p>Scott is coming off the back of a busy year with the release of both The Last Duel and House of Gucci. The director is also helping to develop FX's Alien series with the Fargo showrunner Noah Hawley. It has been described as \"the first Alien on Earth\". He is also starting production on Kitbag, a historical drama for Apple TV+ starring Joaquin Phoenix as Napoleon.</p><p>Blade Runner 2099 is the latest big bet for Amazon, with the streamer set to release The Lord of the Rings: The Rings of Power in September. The season has cost a reported $465m.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 theguardian.com-NonSyndicated</p></div>"}