{"date": "2022-01-27 17:43:34.337000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2777.45, "close": 2879.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>US e-commerce giant Amazon has again written to independent directors of Future Retail (FRL), including Gagan Singh, Ravindra Dhariwal, and Jacob Mathew, alleging that now it is clear that their actions are only for the benefit of the Promoters and others involved in the transaction (\u0093Impugned Transaction\u0094) with the Mukesh Dhirubhai Ambani (Reliance Industries Limited) group (\u0093MDA Group\u0094).</p><p>\u0093It is not for the benefit of FRL\u0092s shareholders, creditors, vendors and employees,\u0094 alleged Amazon\u0092s letter to FRL\u0092s independent directors (dated January 27) which Business Standard has reviewed. \u0093We are surprised at the stance taken in Your Letter (FRL). We had hoped that you would seriously consider the offer that has been set out in our letter dated January 22, 2022, which is in the best interests of all stakeholders of FRL, including its creditors, vendors and employees.\u0094</p></div><div class=\"tr-npp-body\"><p>The independent directors of Kishore Biyani-led Future Retail Limited (FRL) have accepted the transaction with billionaire Mukesh Ambani-led energy-to-telecom conglomerate Reliance and turned down the proposal of Amazon for investment in FRL.The independent directors wrote to Amazon on Tuesday saying that they have accepted the transaction with Reliance as it addressed the needs of funds to pay off public sector bank lenders and suppliers of goods. It had said Reliance's offer helps FRL to meet almost all FRL\u0092s liabilities and in the process helps protect the investment of small shareholders and jobs of over 25,000 employees,</p><p>\u0093Regrettably, it is evident that you had issued the letter dated January 21, 2022, with a pre-determined mind with no intention whatsoever of seriously considering any offer of assistance from us,\u0094 said Amazon\u0092s letter.</p><p>Amazon has also sent the letter to Kishore Biyani, Rakesh Biyani,</p><p>Rahul Garg, who are the directors of Future Retail Limited. It has also sent the letter to Ajay Tyagi, chairman, Securities and Exchange Board of India (SEBI), Ashok Gupta, chairman, Competition Commission of India (CCI), Sanjay Kumar Mishra, director, Enforcement Directorate and Anand Baiwar, executive director, investigations department, SEBI. The letter has also been sent to to top executives at Union Bank of India, Bank of India, State Bank of India, Bank of Baroda, Central Bank of India, Punjab National Bank, UCO Bank, and Indian Bank.</p><p>Amazon said it finds it inconceivable that FRL\u0092s Independent Directors are refusing to confirm in principle that FRL would not pursue the Impugned Transaction pending consideration of any offer of financial assistance from \u0093Samara Capital (Samara), supported by Amazon\u0094. It said this demonstrates lack of bona fides and also detracts from your status as independent directors. It is unfortunate that you are acting at the behest of the Promoters and others who have sought to breach Amazon\u0092s rights under the agreements and to circumvent binding injunctions issued by the Arbitral Tribunal and Indian Courts (\u0093Binding Injunctions\u0094).</p><p>According to sources, as early as June 2020, Amazon-supported private equity firm Samara Capital had signed a non-binding term sheet with FRL that entailed a Rs 7,000 crore investment. This was two months before Kishore Biyani-led Future Group announced its Rs 24,713 crore (or $3.4 billion) merger deal with Mukesh Ambani-led Reliance Industries (RIL) at the end of August 2020.</p><p>Amazon said in FRL\u0092s letter dated January 21, 2022, the firm asked Amazon to confirm, within 24 hours, i.e., by January 22, 2022, that Amazon would support a transaction between FRL and Samara, without offering any due diligence to Samara. It stated that FRL needed immediate financial assistance of Rs 3,500 crore to repay Banks.</p><p>By the letter dated January 22, 2022, Amazon confirmed to FRL that Samara had reiterated its willingness and interest in taking forward the term sheet dated June 30, 2020, signed amongst Samara, FRL and the Promoters (\u0093Samara Term Sheet\u0094).</p><p>The transactions proposed in the Samara Term Sheet contemplated an acquisition of FRL\u0092s retail assets for a consideration of Rs 7,000 crores. Amazon said this would take care of FRL\u0092s immediate funding requirement of Rs 3,500 crore; and included an equity infusion and would have been a direct antidote to FRL\u0092s indebtedness.</p><p>To take forward the Samara Term Sheet, Amazon had also requested FRL to share all existing due diligence report(s) prepared by or on behalf of FRL. It had also requested to complete data provided to MDA for due diligence, with Samara by January 23, 2022.</p><p>\u0093Yet, you have summarily rejected our assistance,\u0094 said Amazon\u0092s letter. \u0093This demonstrates your mala fide actions, which are entirely contrary to the role and functions of independent directors under Indian law. It is unfortunate that you continue to reject Amazon\u0092s offer of assistance and facilitation of the transaction with Samara which, if implemented at the outset, would have ensured infusion of funds as early as September 2020.\u0094</p><p>Amazon said it is curious that FRL now seeks to challenge the very Samara Term Sheet which was signed not only by the Promoters but also by FRL (through Mr. Rakesh Biyani, Managing Director) after months of negotiations and discussions with Samara, which were supported by Amazon.</p><p>Amazon alleged that FRL intentionally disregards the fact that FRL\u0092s Managing Director, Rakesh Biyani, reached out to</p><p>Abhijeet Muzumdar (head of Amazon Smbhav Venture Fund and Corporate Development at Amazon) to seek a no-objection for concluding the Samara Term Sheet. It said this no-objection was sought on June 24, 2020, and communicated to Mr. Biyani shortly thereafter, pursuant to which the Samara Term Sheet was executed on June 30, 2020. The Samara Term Sheet was executed by Samara and has not been withdrawn till date.</p><p>In any event, Amazon told FRL that any transaction with Samara and supported by Amazon would be compliant with Indian law as any investment will be made through an Indian owned and controlled company. It reiterated that the structure of the transaction with Samara (as well as the structure of the transaction in which Amazon invested in FCPL--Future Coupons Pvt Ltd ) is similar to the Impugned Transaction involving the constituents of the MDA Group, being Reliance Retail Ventures Limited (\u0093RRVL\u0094) and Reliance Retail and Lifestyle Fashions Limited (\u0093RRVL WOS\u0094). Amazon said RRVL has received significant sums from foreign investors, which are proposed to fund the acquisition of FRL\u0092s retail, wholesale and logistics assets.</p><p>Amazon said FRL\u0092s stated reason for rejecting Amazon\u0092s request of taking forward the Samara Term Sheet is that the transactions contemplated therein would not discharge FRL\u0092s total liabilities of Rs 12,027.31 crore which are allegedly owed to Banks and vendors. \u0093This reason does not appear to make any commercial sense,\u0094 said Amazon.</p><p>The Samara Term Sheet provides for two transactions (comprising an asset sale as well as an equity infusion) for an aggregate purchase consideration of Rs 7,000 crore. The purchase consideration was based on Rakesh Biyani\u0092s request for Rs 7,000 crore, as communicated to Amazon through the presentation titled \u0093Putting FRL Back on Track\u0094 dated May 17, 2020, and again on June 24, 2020. Thus, Amazon said the Samara Term Sheet, which was based on the request made by Rakesh Biyani, the Managing Director of FRL, was executed to address FRL\u0092s financial concerns and also ensure that FRL would continue to survive and service its debts.</p><p>\u0093You are well aware that the Impugned Transaction is a Scheme of Arrangement (\u0093Scheme\u0094) for 19 companies of the Future Group (including 6 listed companies), and is entirely different from the Samara Term Sheet, as signed by Mr. Rakesh Biyani for the Promoters and FRL. Therefore, your assertion that Samara is trying to buy out retail assets of FRL \u0093on the cheap\u0094 is unfounded and baseless,\u0094 said Amazon.</p><p>In addition, Amazon said if FRL immediately unwinds the transactions relating to advances and security deposits which aggregate to Rs 4,303 crore and are lying unadjusted for the last 2 years, it would be able to take care of any short-term funding requirement as well as have liquidity to service its debts immediately without any external dependency. The details of these transactions are set out in Amazon\u0092s letter dated November 24, 2020.</p><p>\u0093Yet, you choose to summarily dismiss the suggestion, once again at the behest of the Promoters, and in clear disregard of your duties as independent directors of a public listed company,\u0094 said Amazon. \u0093Once again, in the interest of creditors, shareholders, employees and other stakeholders of FRL, we request you to consider unwinding these transactions immediately which are solely under your control and pay off the debts. \u0093</p><p>Amazon told FRL that if it take this decision in the interest of all stakeholders and work with Samara on the Samara Term Sheet, FRL would have access to funds aggregating to approximately Rs. 11,303 crores which would be more than sufficient to take care of all stakeholders and enable FRL to continue as a company.</p><p>Amazon said it appears FRL has been erroneously advised on the legality of the Impugned Transaction and FRL\u0092s ability to sell its \u0093small format stores\u0094. It said that the Impugned Transaction is wholly illegal and all approvals including the approval of the Competition Commission of India and Securities and Exchange Board of India obtained in violation of the directions passed by the emergency arbitrator in the EA Order. This is an order of an Indian Court under Section 17(2) of the Arbitration and Conciliation Act, 1996 (\u0093A&amp;C Act\u0094), constitute a nullity and are void ab initio. Thus, these approvals cannot be acted upon in any manner.</p><p>Amazon reiterated that any proposal given by FRL, either through the one-time resolution plan or otherwise, to alienate/transfer/encumber/dispose of its retail assets is in direct violation of Amazon\u0092s rights under the agreements as well as the Binding Injunctions. Any attempt by any person, including FRL, Promoters or Banks, to circumvent such Binding Injunctions would invite appropriate consequences under law.</p><p>\u0093We once again call upon you to consider our offer of assistance and provide access to FRL\u0092s records for conducting the due diligence exercise as expeditiously as possible,\u0094 said Amazon. \u0093We call upon you once again to share any such report(s) by tomorrow, i.e., January 28, 2022, for Samara to commence the due diligence exercise at the earliest.\u0094</p><p>Amazon said it sincerely hopes that, for once, FRL will cease to act as for the benefit of the Promoters and others involved in the Impugned Transaction. It hopes FRL would engage with Samara and Amazon in the best interests of FRL and its creditors, vendors and employees. \u0093We remain available to facilitate discussions between Samara and the independent directors of FRL to take forward the engagement,\u0094 said Amazon.</p><p>Queries to Amazon and Future Group remained unanswered until the time of publication.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Business Standard Ltd.</p></div>"}