{"date": "2022-02-25 14:22:08.236000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2896.54, "close": 3075.77}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MACE SECURITY INTERNATIONAL INC (\"MACE-0\")\n- Teams Up with Local College to Promote Personal Safety\n- Awareness\n\n     Mace Security International, Inc. announced that it has teamed up with\nJohn Carroll University, a private university in Northeast Ohio, to promote\neducation and awareness of the importance of personal safety among local\ncollege students.\n\n     Sanjay Singh, Chairman and CEO of Mace said, \"Mace is a mission driven\ncompany and committed to providing family and community safety through\nindividual empowerment, especially in our own neighborhoods here in\nNortheast Ohio.\"\n\n     The company is providing sponsorship and participation in the\ncommunity through messaging during the men's and women's basketball games\nover a one-week period. It is supporting a contest giveaway of its\nnon-lethal personal safety products.\n\n     About Mace Security International, Inc.\nMace(R) Security International, Inc. (MACE) is a globally recognized leader\nin personal safety and security. Based in Cleveland, Ohio, the company has\nspent more than 40 years designing and manufacturing consumer and tactical\nproducts for personal defense and security under its world-renowned Mace(R)\nBrand - the original trusted brand of defense spray products. The company\nalso offers aerosol defense sprays and tactical products for law\nenforcement and security professionals worldwide through its Mace(R) Take\nDown(R) brand, KUROS!(R) Brand personal safety products, Vigilant(R) Brand\nalarms, and Tornado(R) Brand pepper spray and stun guns. MACE(R)\ndistributes and supports Mace(R) Brand products through mass market\nretailers, wholesale distributors, independent dealers, Amazon.com,\nMace.com, and other channels. For more information, visit www.mace.com.\n\n     Mace Security International distributes and supports its products and\nservices through mass-market retailers, wholesale distributors, independent\ndealers, e-commerce channels and through its website, www.Mace.com. For\nmore information, please visit www.mace.com.\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2205500184.MNPRE2205500794-06203020220225</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}