{"date": "2021-12-08 10:25:24+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The authors are Reuters Breakingviews columnists.  The opinions expressed are their own.</p><p class=\"tr-by\">By Liam Proud and Karen Kwok</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">LONDON, Dec 8 (Reuters Breakingviews)</span><span class=\"tr-dl-sep\"> - </span>Fears of Visa <a href=\"reuters://REALTIME/Verb=FullQuote/ric=V.N\" data-type=\"ric\" data-ric=\"V.N\" translate=\"no\" dir=\"ltr\">V.N</a> and Mastercard’s <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MA.N\" data-type=\"ric\" data-ric=\"MA.N\" translate=\"no\" dir=\"ltr\">MA.N</a> decline are exaggerated. The $770 billion payments duo’s shares have fallen 5% in 2021, compared with a 25% rise for the S&amp;P 500 Index. Investors worry that Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and banks are exerting downward pressure on fees, and that new financial technologies may consign plastic to the trash. Yet the duopoly is stronger than it appears.</p><p>Visa and Mastercard’s core business links together the parties in card transactions. Imagine a customer uses a Chase credit card at a store whose bank is Wells Fargo <a href=\"reuters://REALTIME/Verb=FullQuote/ric=WFC.N\" data-type=\"ric\" data-ric=\"WFC.N\" translate=\"no\" dir=\"ltr\">WFC.N</a>. </p><p>Visa would check, on behalf of Wells Fargo, that the Chase customer has enough credit. Later, the card network helps move money between the accounts after deducting an “interchange” fee of 1.5% or more for Chase and a much smaller one for itself. Visa’s gross revenue, which also includes add-on services, is typically 0.3% of total processed payments. The whole process would be similar for a debit card but with lower charges. </p><p>It’s a great business. Merchants must accept the duo’s plastic given their near-total dominance of the card market. And costs are low. Visa’s 66% operating margin over the past 12 months was the highest in the S&amp;P 500, Refinitiv data shows, while Mastercard placed a similarly exalted ninth.</p><p>     </p><p><br/></p><p>              </p><p>CHARGEBACK PUSHBACK</p><p>The question for Visa Chief Executive Al Kelly and Mastercard Executive Chair Ajay Banga is whether the model is sustainable. The first danger is a fee pushback.</p><p>Amazon recently said it would stop accepting Visa’s UK credit cards, in what looks like an attempt to negotiate lower charges <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2S84NP\" data-type=\"storyId\" data-story-id=\"nL8N2S84NP\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span>. Angry merchants are nothing new. Walmart <a href=\"reuters://REALTIME/Verb=FullQuote/ric=WMT.N\" data-type=\"ric\" data-ric=\"WMT.N\" translate=\"no\" dir=\"ltr\">WMT.N</a>, Costco Wholesale <a href=\"reuters://REALTIME/Verb=FullQuote/ric=COST.O\" data-type=\"ric\" data-ric=\"COST.O\" translate=\"no\" dir=\"ltr\">COST.O</a> and others have long agitated, sometimes successfully, for concessions.</p><p>But Amazon is a different beast. The $1.8 trillion group accounts for 40% of U.S. e-commerce sales, <a href=\"https://www.emarketer.com/content/amazon-dominates-us-ecommerce-though-its-market-share-varies-by-category\" data-type=\"url\" class=\"tr-link\" translate=\"no\">according</a> to eMarketer, giving it unprecedented leverage over the networks. It’s also global. That puts Visa and Mastercard in a tricky spot. If they cut charges to please Amazon, they’ll anger bank customers like Chase, who receive the biggest share of the fees and need them to fund credit-card rewards. </p><p>Kelly and Banga could keep everyone happy by handing back some of their own revenue in the form of client incentives and rebates. But such payments are getting increasingly painful. Visa’s client incentives, which help to keep merchants and banks sweet, have risen to a hefty one-quarter of gross revenue, while Mastercard’s roughly equivalent ratio is over one-third.</p><p><div class=\"tr-resource-ref\" id=\"g138a74d8-44b7-4bf6-b409-f8cc7d3ce915\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://graphics.reuters.com/BRV-BRV/jnpweaxkrpw/chart.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9ncmFwaGljcy5yZXV0ZXJzLmNvbS9CUlYtQlJWL2pucHdlYXhrcnB3L2NoYXJ0LnBuZw==&amp;storyId=urn:newsml:reuters.com:20211208:nL8N2SS216:6&amp;key=29e2cc37a4ac8a00a318f454a8bb1714d9a89fd31af2daf38a71ce981d96887f68d650b8e98dbaece86a98e137da188ae75fa0a1df3e7b0af588279a9344f62f\"/></div></div></div></p><p>Those numbers have been skewed by the pandemic, which hit the networks’ lucrative cross-border transactions. But they’ve been rising for years. The risk for shareholders is that they keep going up as powerful merchants fight back <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2S91RP\" data-type=\"storyId\" data-story-id=\"nL1N2S91RP\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span>, leaving Visa and Mastercard with a shrinking slice of the payments pie.</p><p>Another threat is that new fintech players bypass the networks altogether. So-called digital wallets from PayPal <a href=\"reuters://REALTIME/Verb=FullQuote/ric=PYPL.O\" data-type=\"ric\" data-ric=\"PYPL.O\" translate=\"no\" dir=\"ltr\">PYPL.O</a> and Block <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SQ.N\" data-type=\"ric\" data-ric=\"SQ.N\" translate=\"no\" dir=\"ltr\">SQ.N</a>, formerly Square, allow consumers to pay merchants directly through bank transfers. These wallets, which also include Apple Pay, accounted for 28% of e-commerce on average across North America and Europe, <a href=\"https://worldpay.globalpaymentsreport.com/en\" data-type=\"url\" class=\"tr-link\" translate=\"no\">according</a> to Worldpay.</p><p>Admittedly, consumers often load cards into their digital wallets rather than using direct bank transfers, meaning Visa and Mastercard still process the purchases. But that may change over time: in China, dominant players like Alipay and WeChat Pay hook up merchants and consumers directly.</p><p>Meanwhile, fast-growing buy-now-pay-later upstarts like $46 billion Klarna and $34 billion Affirm <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AFRM.O\" data-type=\"ric\" data-ric=\"AFRM.O\" translate=\"no\" dir=\"ltr\">AFRM.O</a> give shoppers the option of breaking up their purchases into monthly instalments <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2R94RM\" data-type=\"storyId\" data-story-id=\"nL8N2R94RM\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span>. That threatens credit cards, the traditional mainstay of Visa and Mastercard’s business. </p><p><br/></p><p>     </p><p>EFFECTIVE NETWORKS</p><p>None of those risks are as terrifying as they seem. Start with buy-now-pay-later. On average, about 80% of transactions at providers such as Klarna and Affirm are repaid using debit cards. Since Visa and Mastercard take a small fixed fee per transaction, paying multiple times through instalments actually benefits the networks. </p><p>In theory, the pay-later players could nudge their customers towards cheaper bank transfers rather than card payments. But the fear of irritating customers by restricting their payment methods should discourage Klarna and Affirm from doing so. In any case, Visa and Mastercard have built their own instalment-payment services as a hedge.</p><p>Nor are digital wallets like Apple Pay, Square and PayPal likely to push consumers away from cards in a hurry. It’s no accident that Apple Pay’s display mimics a physical wallet containing cards. The $2.8 trillion iPhone maker also launched its own Mastercard credit card. </p><p>Since plastic is already ubiquitous in America and Europe, it’s easier for tech groups to go with the flow. PayPal used to encourage users to input their bank account details rather than credit or debit cards, but changed course and signed deals with Visa and Mastercard in 2016 in a bid to get more users. Another problem with bank transfers, particularly in America, is that users miss out on credit-card rewards. </p><p>In areas where direct account payments catch on, the networks could still take a slice. They’ve both launched bank-to-bank processing services of their own, saving fintechs the hassle of bothersome tasks like spotting fraud. Visa’s product is used by Square’s Cash App. The lesson is that fintechs are often building on top of the networks rather than around them.</p><p>Even Amazon-like fee spats may inflict only moderate pain, since retailers ultimately need Visa and Mastercard more than they need retailers. The majority of Amazon’s $576 billion of 2021 global e-commerce sales, as forecast by Autonomous, probably flows through the networks. That’s equivalent to just 4% of Visa and Mastercard’s combined payments volumes last year.</p><p>In any case, the current share prices factor in a lot of the bad news. On average, the networks trade at 31 times forward earnings, according to Refinitiv data, compared with a multiple of 40 at the beginning of 2021. They’re now more lowly valued than in mid-February 2020, just before the pandemic, when the pair traded at 35 times earnings on average. That’s despite the coronavirus pushing more consumers to use cards over cash, a habit which should stick. Add it all up, and the duopoly’s investors are underplaying their strengths.</p><p>Follow <a href=\"https://twitter.com/liamwardproud\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@liamwardproud</a>, <a href=\"https://twitter.com/karenkkwok\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@karenkkwok</a> on Twitter</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Editing by George Hay and Oliver Taslic.  Graphic by Vincent Flasseur.)</p><p class=\"tr-contactinfo\">((For previous columns by the authors, Reuters customers can click on <a href=\"reuters://REALTIME/verb=Headlines/ric=PROUD/\" data-type=\"newsExpression\" data-expression=\"PROUD/\" translate=\"no\" dir=\"ltr\">PROUD/</a> , <a href=\"reuters://REALTIME/verb=Headlines/ric=KWOK/\" data-type=\"newsExpression\" data-expression=\"KWOK/\" translate=\"no\" dir=\"ltr\">KWOK/</a> <br/> SIGN UP FOR BREAKINGVIEWS EMAIL ALERTS <a href=\"https://bit.ly/BVsubscribe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://bit.ly/BVsubscribe</a> | <a href=\"mailto:liam.proud@thomsonreuters.com\" data-type=\"email\" translate=\"no\">liam.proud@thomsonreuters.com</a> ; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://liam.ward-proud.thomsonreuters.com@reuters.net\">liam.ward-proud.thomsonreuters.com@reuters.net</a> <br/> <a href=\"mailto:karen.kwok@thomsonreuters.com\" data-type=\"email\" translate=\"no\">karen.kwok@thomsonreuters.com</a> ; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://karen.kwok.thomsonreuters.com@reuters.net\">karen.kwok.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: VISA-MASTERCARD/BREAKINGVIEWS</p></div>"}