{"date": "2021-11-23 09:28:38+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds Amazon statement</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">MILAN, Nov 23 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Italy's antitrust authority has fined U.S. tech giants Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and Apple Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a> a total of more than 200 million euros ($225 million) for alleged anti-competitive cooperation in the sale of Apple and Beats products.</p><p>Contractual provisions of a 2018 agreement between the companies meant only selected resellers were allowed to sell Apple and Beats products on Amazon.it, the watchdog said, adding that this was in violation of European Union rules and affected competition on prices.</p><p>Both Apple and Amazon said they plan to appeal against the fines.</p><p>The authority imposed a fine of 68.7 million euros on Amazon and 134.5 million euros on Apple, ordering the companies to end the restrictions to give retailers of genuine Apple and Beats products access to Amazon.it in a non-discriminatory manner.</p><p>\"To ensure our customers purchase genuine products, we work closely with our reseller partners and have dedicated teams of experts around the world who work with law enforcement, customs and merchants to ensure only genuine Apple products are being sold,\" Apple said, denying any wrongdoing.</p><p>In a separate statement Amazon said it strongly disagreed with the decision of the Italian authority and that the proposed fine was \"disproportionate and unjustified\". </p><p>\"We reject the suggestion that Amazon benefits by excluding sellers from our store, since our business model relies on their success. As a result of the agreement, Italian customers can find the latest Apple and Beats products on our store, benefiting from a catalogue that more than doubled, with better deals and faster shipping,\" Amazon said.   </p><p>      </p><p>($1 = 0.8885 euros)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Gianluca Semeraro and Elvira Pollina<br/>Editing by David Goodman)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:gianluca.semeraro@tr.com\" data-type=\"email\" translate=\"no\">gianluca.semeraro@tr.com</a> ; +39 06 80 307 741; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: ITALY-ANTITRUST/AMAZON-APPLE (UPDATE 2, PIX)</p></div>"}