{"date": "2021-12-13 16:00:52.819000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>At least six Amazon employees died on Friday after a warehouse in Edwardsville, Illinois, was struck by a tornado. The deaths have put the company under new scrutiny for its history of sometimes preventing workers from keeping their mobile phones with them on the job.</p><p>The Illinois facility, not far from St Louis, Missouri, suffered immense damage during this weekend's multi-state cluster of tornadoes. Roughly 150 yards of the building collapsed in on itself.</p></div><div class=\"tr-npp-body\"><p>An Amazon worker at a nearby facility told Bloomberg the collapse had raised doubts over whether Amazon's policies, which have sometimes required workers to keep their phones in their cars or lockers while on the job, did enough to ensure their safety.</p><p>\"After these deaths, there is no way in hell I am relying on Amazon to keep me safe,\" the anonymous worker said. \"If they institute the no cell phone policy, I am resigning.\"</p><p>Not having access to a cell phone could prevent workers from seeing localised National Weather Service updates that warn of impending severe weather. The NWS sent out one such alert less than an hour before the warehouse caved in.</p><p>\"We're deeply saddened by the news that members of our Amazon family passed away as a result of the storm in Edwardsville, IL,\" Amazon told <span>The Independent</span> in a statement. \"Our thoughts and prayers are with the victims, their loved ones, and everyone impacted by the tornado. We also want to thank all the first responders for their ongoing efforts on scene. We're continuing to provide support to our employees and partners in the area.\"</p><p>Employees and drivers were allowed to have their cell phones at the time of the tornado, and were warned in advance of the incoming weather, allowing some Amazon employees to reach a designated shelter location.</p><p>Amazon founder Jeff Bezos said on Saturday he was \"heartbroken\" by the deaths in Illinois.</p><p>\"The news from Edwardsville is tragic,\" he said. \"We're heartbroken over the loss of our teammates there, and our thoughts and prayers are with their families and loved ones.\"It seems at least some of those inside the warehouse were <a href=\"https://www.independent.co.uk/news/world/americas/amazon-warehouse-illinois-deaths-name-b1974404.html\"><span>able to contact the outside</span> </a> .</p><p>Clayton Cope, 29, a maintenance worker, was among the six dead, and his mother Carla recounted a final conversation with him before the tornadoes struck.</p><p>She told <span>The Daily Beast</span> on Saturday that she had warned her son to \"get to shelter,\" but that he wanted to warn his colleagues of what was coming first.</p><p>\"He just said he needed to tell someone that [the tornado] was coming,\" she said. \"He had a big heart and he was a very sweet man.\"</p><p>It's not the first time workers at the retail giant have died during inclement weather. In 2018, two workers at an Amazon facility in Baltimore died during a severe storm.</p><p>Amazon facilities are reportedly designed to account for local weather conditions.</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/news/illinois-arkansas-andy-beshear-tennessee-missouri-b1974787.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Tornado toll in dozens, yet not as high as initially feared</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/amazon-warehouse-worker-tornado-illinois-b1974778.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Woman claims Amazon told boyfriend to stay for tornado that took his life</a> </p><p><a href=\"https://www.independent.co.uk/news/andy-beshear-illinois-tennessee-missouri-midwest-b1974738.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Judge, grandma, outdoorsman among those killed by twisters</a> </p><p><a href=\"https://www.independent.co.uk/news/world/europe/tornadoes-explainer-bosnia-naftali-bennett-anne-rice-b1974474.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AP News Digest 6 a.m.</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/arkansas-illinois-andy-beshear-amazon-missouri-b1974435.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Crews search for the missing after devastating tornadoes</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/jeff-bezos-amazon-illinois-space-b1974423.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Bezos slammed for posting about space mission amid Amazon workers' deaths</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Independent, The (UK) (Online). All rights reserved.</p></div>"}