{"date": "2022-02-18 11:54:45.150000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3162.01, "close": 3052.03}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>India</p></div><div class=\"tr-npp-lead\"><p>India, Feb. 18 -- It is safe to say that saree is one of the eternal favourites of Indian women. Its been the go-to statement wear when one is in the mood to make a bold style statement and turn heads around. The grace and elegance of this apparel is unmatched. Over the years, there have been many worthwhile variations in the design of sarees and the way one can drape them around. Among them, saree with ruffles on borders is a popular pick.</p><p>On Thursday, VJ and actor Anusha Dandekar gave everyone major style inspiration looking stunning in a yellow saree with ruffles on its border. She looked pretty and glamorous and rounded off the look with a dainty maang tikka.Amazon has a variety of such lovely sarees on its platform. To save you time and make selection easy for you, we have rounded off some of the sarees in our list below. All of them make great picks to wear on festive occasions and are supremely easy and comfortable to wear. So, scroll down and take a look at our top picks.1. JAY AMBEY FABRICS Ready To Wear Lycra Saree With Ruffle Border And Unstitched Blouse</p></div><div class=\"tr-npp-body\"><p>This saree with ruffle borders is one great pick to look one's best when attending a social gathering or festive function. Its fabric is lycra and it is comfortable to wear. It is available in many vibrant and classic hues and comes with an unstitched blouse piece. It is recommended you get the saree dry cleaned only.2. KAILANI Women's Soft Lycra Readymate Saree With Sequence Blouse Piece and Ruffle Border</p><p>This saree comes with a sequined blouse piece and is made of lycra fabric. It is available in many flattering colours and makes for an ideal wear when going to wedding functions or other such festive events. It is recommended to hand wash this apparel.3. SHUBHKARi womens lycra sequence detailed semi ready to wear saree with ruffle border and unstitched blouse piece</p><p>This stunning yellow saree has ruffles on its borders and features beautiful sequin work as well. It comes with an unstitched blouse which again has sequin work to best complement with the saree. The fabric it is made from is lycra and it feels comfortable against skin. It is best recommended to hand wash this apparel.4. Market Magic World Women's Lycra Ruffled Ready to Wear Saree Trending Festive Season Party Design Stylish Sequence Fancy Patch Lace Border with Blouse Piece</p><p>Thisgorgeous saree is made of lycra silk fabric and has ruffles on its borders. It comes with a matching blouse piece with sequin work on it. A lovely pick to wear on a festive occasion and family events, this saree helps one look effortlessly stylish and beautiful. It is a comfortable to wear and it is recommended to get it dry cleaned.You must also check out the range of vibrant colours this saree is available in.At Hindustan Times, we help you stay up-to-date with latest trends and products. Hindustan Times has affiliate partnership, so we may get a part of the revenue when you make a purchase. Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}