{"date": "2021-12-20 13:11:49.562000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>RELEVIUM TECHNOLOGIES INC (\"RLV-V;RLLVF-0\")\n- Provides Bi-Weekly Update to Management Cease Trade Order\n- and Shares for Debt Settlement\n\n     Relevium Technologies Inc. (the \"Company\" or \"Relevium\") is providing\nan update to its previously disclosed management cease trade order\n(\"MCTO\"), announced on November 1, 2021, in respect of the audited annual\nfinancial statements and corresponding management's discussion and analysis\nfor the year ended June 30, 2021, including the CEO and CFO certifications\n(collectively, the \"Annual Financial Filings\") that were not filed by the\nrequired filing deadline of October 28, 2021 (the \"Filing Deadline\").\n\n     BI-WEEKLY MCTO UPDATE\nAs previously disclosed, the Annual Financial Filings were not filed on or\nbefore the Filing Deadline due to audit resource scheduling and\navailability required to complete the financial statements and disclosures.\n\n     The Company is working expeditiously on the steps required to complete\nthe Annual Financial Filings and expects to be able to file the Annual\nFinancial Filings by January 31, 2022. The Company will provide updates as\nfurther information relating to the Annual Financial Filings becomes\navailable.\n\n     The MCTO will be in effect until the Annual Financial Filings are\nfiled and requires that the Annual Financial Filings be filed on or before\nJanuary 31, 2022.\n\n     Until the Annual Financial Filings are filed, the Company will issue\nbi-weekly default status reports in accordance with National Policy 12-203\n- Management Cease Trade Orders. The Company intends to satisfy the\nprovisions of the Alternative Information Guidelines during the period it\nremains in default of the filing requirements. The Company confirms that\nthere have been no material business developments or other material\ninformation relating to its affairs as of the date of this news release\nthat have not been generally disclosed.\n\n     Yesterday, on December 16, 2021, the Company announced that in the\nmonth of December it secured two PPE contracts valued at CAD$11million and\nCAD$5 million respectively to supply a total a total of 180 million medical\ngrade nitrile gloves. The Company also announced that on December 15, 2021,\nthe Company delivered 127.5 million medical grade nitrile gloves,\nrepresenting 100% of the first contract for a total value of CAD$11M. The\nCompany expects to deliver the second contract in the month of January\n2022.\n\n     SHARES FOR DEBT SETTLEMENT\n\n     Relevium is pleased to announce the out of court settlement between\nthe Company and Weedsense Inc. On October 16, 2019, the Company signed an\nSPA which was not a final contract between the parties but rather the\nframework of a contract to be completed once the suspensive condition\nconsisting of a regulatory approval of the transaction was fulfilled.\n\n     The Company and Weedsense have agreed to settle their dispute\nconcerning the proceedings out of court in shares for a total amount of\n$75,000 payable in common shares of the Company with a deemed price of the\nhigher of either a 10-day VWAP prior to issuance of the shares or $0.02.\n\n     This transaction is subject to the approval of the TSX Venture\nExchange, which was submitted and is pending review.\n\n     About Relevium Technologies Inc.\nRelevium is a publicly traded Company that operates in the health and\nwellness industry, including legal cannabis, with a primary focus on online\ndistribution. The principal business of the Company is the identification,\nevaluation, acquisition and operation of brands and businesses in the\nhealth and wellness markets and medical cannabis. The Company pursues its\nbusiness strategy through an acquisition and partnership model in a\nholistic approach to encompass a wide range of health and wellness consumer\nproducts. Relevium operates through two wholly owned subsidiaries:\n\n     BGX E-Health LLC (BGX), based in Orlando, Florida, markets dietary\nsupplements, nutraceuticals, sports nutrition, and cosmeceuticals primarily\nthrough its Bioganix(R) brand portfolio in the US and Europe. Relevium's\npremium brands are sold at some of the world's largest retailers including\nWalmart.com and Amazon.com.\n\n     Biocannabix Health Corporation (BCX), based in Montreal, Quebec, is a\nbiopharma nutraceutical Company focused on delivering pediatric\nendo-medicinal nutraceuticals for cannabinoid therapy.\n\n     Cautionary Note Regarding Forward-Looking Statements\n\n     This release includes certain statements and information that may\nconstitute forward-looking information within the meaning of applicable\nCanadian and United States securities laws. All statements in this news\nrelease, other than statements of historical facts, including statements\nregarding future estimates, plans, objectives, assumptions, or expectations\nof future performance, are forward-looking statements and contain\nforward-looking information. Generally, forward- looking statements and\ninformation can be identified by the use of forward-looking terminology\nsuch as \"intends\" or \"anticipates\", or variations of such words and phrases\nor statements that certain actions, events or results \"may\", \"could\",\n\"should\", or \"would\" occur. Forward-looking statements are based on certain\nmaterial assumptions and analysis made by the Company and the opinions and\nestimates of management as of the date of this press release. These\nforward-looking statements are subject to known and unknown risks,\nuncertainties and other factors that may cause the actual results, level of\nactivity, performance or achievements of the Company to be materially\ndifferent from those expressed or implied by such forward-looking\nstatements or forward-looking information.\n\n     Although management of the Company has attempted to identify important\nfactors that could cause actual results to differ materially from those\ncontained in forward-looking statements or forward-looking information,\nthere may be other factors that cause results not to be as anticipated,\nestimated or intended. There can be no assurance that such statements will\nprove to be accurate, as actual results and future events could differ\nmaterially from those anticipated in such statements. Accordingly, readers\nshould not place undue reliance on forward- looking statements and\nforward-looking information. Readers are cautioned that reliance on such\ninformation may not be appropriate for other purposes. The Company does not\nundertake to update any forward-looking statement, forward-looking\ninformation or financial outlook that are incorporated by reference herein,\nexcept in accordance with applicable securities laws. We seek to rely on\nthe applicable safe harbour.\n\n     On Behalf of the Board of Directors\nRELEVIUM TECHNOLOGIES INC.\nAurelio Useche\nPresident and CEO\n\n     For more information about this press release: Tel: +1.888.528.8687\nRELEVIUM TECHNOLOGIES INC\nEmail: investors@releviumcorp.com\nWebsite: www.releviumtechnologies.com\nLike us on Facebook\nFollow us on Twitter\nFollow us on LinkedIn\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2135200009.MNPRE2135200032-11454320211219</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}