{"date": "2021-12-16 19:12:24.970000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3466.3, "close": 3400.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>INFINERA CORP (\"INFN-Q\")\n- Telia Carrier Selects Infinera's ICE6 800G Coherent\n- Technology as Part of Its Global Expansion\n\n   Infinera and Telia Carrier announced today the selection of Infinera's\nICE6 800G solution for Telia Carrier's global network after completing a\nsuccessful trial of the technology on Telia Carrier's live\nnumber-one-ranked global network, AS1299. The decision to deploy Infinera's\nICE6 comes after a field validation trial on the 2,396-km link in the U.S.\nbetween Denver and Chicago. The trial was performed using Infinera's\ninnovative ICE6 technology over an existing third-party line system and\ndemonstrated superior performance and improved network capacity.\n\n   The trial demonstrated that by leveraging Infinera's ICE6\nfifth-generation coherent technology, Telia Carrier was able to achieve\ntransmission speeds of 600G and spectral efficiency of 5.33 bits/s/Hz,\nresulting in a fiber capacity increase of at least 50 percent compared to\nthe previous generation of transponders. The success of the ICE6 trial\nhighlights the tremendous value provided by Infinera's innovative 800G\nsolution, which integrates and performs seamlessly and effectively across\nthird-party line systems in an open environment.\n\n   \"As a pioneer in deployment of open optical line technologies across the\nglobe, deploying ICE6 on our network will be yet another example of how\nopen and disaggregated networking works and allows for greater efficiency\nand agility,\" said Andrew Haynes, COO at Telia Carrier. \"Innovative\nsolutions like Infinera's ICE6 demonstrate the ability to achieve vast\nimprovement across our optical network, from high-performance, high-speed\ntransmission capacity to increased cost-efficiencies. Deploying ICE6 will\nenable us to introduce best-in-class technologies and infrastructure\ncapabilities for our customers.\"\n\n   \"Telia Carrier's embracing of open optical networking enables them to\nalways be able to take advantage of the best technologies to create\ndifferentiated value for their customers,\" said Nick Walden, Senior Vice\nPresident, Worldwide Sales, Infinera. \"In this case, they were able to\nleverage the industry-leading performance of Infinera's ICE6 technology\nover their existing third-party line system to quickly and cost-effectively\nincrease capacity and deliver new services to meet the ever-increasing\nconnectivity needs of their global customers.\"\n\n Contact Information:\n\nContact:\n\n   Infinera Media:\nAnna Vue\nTel. +1 (916) 595-8157\navue@infinera.com\n\n   Infinera Investors:\nAmitabh Passi\nTel. +1 (669) 295-1489\napassi@infinera.com\n\nTelia Carrier Media:\nMargaret Carpo, Engage PR for Telia Carrier\nTel. +1 (510) 295-4972\nmcarpo@engagepr.com\n\n   About Telia Carrier\nTelia Carrier solves global connectivity challenges for multinational\nenterprises whose businesses rely on digital infrastructure. On top of the\nworld's #1 ranked IP backbone and a unique ecosystem of cloud and network\nservice providers, we provide an award-winning customer experience to\ncustomers in more than 125 countries worldwide. Our global Internet\nservices connect more than 700 cloud, security and content providers with\nlow latency. For further resilience, our private Cloud Connect service\nconnects directly to Amazon Web Services, Microsoft Azure, Google Cloud,\nIBM Cloud and Oracle cloud across North America, Europe and Asia. Discover\nmore at teliacarrier.com, and follow us on LinkedIn and Twitter.\n\n   About Infinera\nInfinera is a global supplier of innovative open optical networking\nsolutions that enable carriers, cloud operators, governments, and\nenterprises to scale network bandwidth, accelerate service innovation, and\nautomate network operations. Infinera solutions deliver industry-leading\neconomics and performance in long-haul, submarine, data center\ninterconnect, and metro transport applications. To learn more about\nInfinera, visit www.infinera.com, follow us on Twitter and LinkedIn, and\nsubscribe for updates.\n\n   Infinera and the Infinera logo are registered trademarks of Infinera\nCorporation.\n\n   This press release contains forward-looking statements, including but\nnot limited to Infinera's ICE6 800G solution. These statements are not\nguarantees of results and should not be considered as an indication of\nfuture activity or future performance. Actual results may vary materially\nfrom these expectations as a result of various risks and uncertainties.\nInformation about these risks and uncertainties, and other risks and\nuncertainties that affect Infinera's business, is contained in the risk\nfactors section and other sections of Infinera's Quarterly Report on Form\n10-Q for the Fiscal Quarter ended September 25, 2021 as filed with the SEC\non November 3, 2021, as well as any subsequent reports filed with or\nfurnished to the SEC. These reports are available on Infinera's website at\nwww.infinera.com and the SEC's website at www.sec.gov. Forward-looking\nstatements include statements regarding our expectations, beliefs,\nintentions or strategies and can be identified by words such as\n\"anticipate,\" \"believe,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\"\n\"should,\" \"will,\" and \"would\" or similar words. Infinera assumes no\nobligation to, and does not currently intend to, update any such\nforward-looking statements.\n\nTel   : 408-572-5200    INFINERA CORP\nFax   : 408-572-5454\nEmail : Ir@Infinera.com\nWWW   : <a href=\"http://www.infinera.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.infinera.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134900611.MNPRE2134902819-11070220211216</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}