{"date": "2022-01-31 09:53:34+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n                  <strong>Potential triggers for sentiment this week<sup>1</sup> :</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          US: Jobs report, manufacturing and services PMI, earnings reports from Alphabet, Amazon, Ford Motors, GM, and Meta.\n        </li>\n                  <li>\n          Europe: Eurozone GDP and inflation data, ECB monetary policy meeting.\n        </li>\n                  <li>\n          APAC: Australia monetary policy meeting; most other markets closed for Chinese New Year.\n        </li>\n                  <li>\n          \"&gt;\n        </li>\n                  <li>\n          US: Jobs report, manufacturing and services PMI, earnings reports from Alphabet, Amazon, Ford Motors, GM, and Meta.\n        </li>\n                  <li>\n          Europe: Eurozone GDP and inflation data, ECB monetary policy meeting.\n        </li>\n                  <li>\n          APAC: Australia monetary policy meeting; most other markets closed for Chinese New Year.\n        </li>\n                </ul>\n                <p>\n                  <sub>\n                    <sup>1</sup> If sentiment is bearish/bullish, a negative/positive surprise on these data releases could trigger an overreaction.</sub>\n                </p>\n                <p>\n                  <strong>\n                    <strong>Summary of changes in investor sentiment from the previous week:</strong>\n                  </strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          Sentiment remains bearish among US, Europe, Asia ex-Japan and global developed market investors. In Japan, sentiment had recovered slightly the previous week but ended last week back in bearish territory. Sentiment in global emerging markets and China (domestic) remains negative but not strongly enough to be called bearish.\n        </li>\n                  <li>\n          At these levels, investors have become over-sensitive to negative news, and therefore prone to overreactions. The absence of negative headlines last week prevented such a reaction, but anything could still trigger investors' bearish sentiment (i.e., in a bearish state, negative news rouses the will, and the will looks around for something to sell.)\n        </li>\n                  <li>\n          Since the Fed's inflation pivot last November, inflation data has taken over from unemployment as the main driver of US investor sentiment. The jobs report this coming Friday is expected to confirm the ongoing employment recovery in the US, but as with the better-than-expected GDP figures last week, bearish investors will underreact to positive news and overreact to negative ones.\n        </li>\n                  <li>\n          The opaque situation in Ukraine is the noise that fills the void created by an increasingly uncertain macro picture. As tensions there continue to rise, and diplomacy has yet to deescalate the situation, investors will remain vigilant to the next move from an ever-assertive Putin.\n        </li>\n                  <li>\n          On the positive side, the impact of armed conflicts on markets and investor sentiment tends to be a distanced one. Unless investors believe that a military conflict in Ukraine can jump from their television screens onto the streets of New York, London, or Tokyo, it is unlikely to have a lasting impact on either sentiment or markets.\n        </li>\n                  <li>\n          Also simmering in the background is the threat of further civil unrest and racial tensions in the US in the run-up to this year's mid-term elections (and beyond). At a rally in Texas over the weekend, former President Trump called New York prosecutors investigating his business practices \"<span>racist and mentally sick</span>\" - those remarks show the tone of the debate in the campaign may only be more hostile and divisive than it was last time around.\n        </li>\n                  <li>\n          \"&gt;\n        </li>\n                  <li>\n          Sentiment remains bearish among US, Europe, Asia ex-Japan and global developed market investors. In Japan, sentiment had recovered slightly the previous week but ended last week back in bearish territory. Sentiment in global emerging markets and China (domestic) remains negative but not strongly enough to be called bearish.\n        </li>\n                  <li>\n          At these levels, investors have become over-sensitive to negative news, and therefore prone to overreactions. The absence of negative headlines last week prevented such a reaction, but anything could still trigger investors' bearish sentiment (i.e., in a bearish state, negative news rouses the will, and the will looks around for something to sell.)\n        </li>\n                  <li>\n          Since the Fed's inflation pivot last November, inflation data has taken over from unemployment as the main driver of US investor sentiment. The jobs report this coming Friday is expected to confirm the ongoing employment recovery in the US, but as with the better-than-expected GDP figures last week, bearish investors will underreact to positive news and overreact to negative ones.\n        </li>\n                  <li>\n          The opaque situation in Ukraine is the noise that fills the void created by an increasingly uncertain macro picture. As tensions there continue to rise, and diplomacy has yet to deescalate the situation, investors will remain vigilant to the next move from an ever-assertive Putin.\n        </li>\n                  <li>\n          On the positive side, the impact of armed conflicts on markets and investor sentiment tends to be a distanced one. Unless investors believe that a military conflict in Ukraine can jump from their television screens onto the streets of New York, London, or Tokyo, it is unlikely to have a lasting impact on either sentiment or markets.\n        </li>\n                  <li>\n          Also simmering in the background is the threat of further civil unrest and racial tensions in the US in the run-up to this year's mid-term elections (and beyond). At a rally in Texas over the weekend, former President Trump called New York prosecutors investigating his business practices \"<span>racist and mentally sick</span>\" - those remarks show the tone of the debate in the campaign may only be more hostile and divisive than it was last time around.\n        </li>\n                </ul>\n                <h4>\n                  <strong>US investor sentiment:</strong>\n                </h4>\n                <p>\n        US investor sentiment (green line) recovered slightly last week in a knee-jerk response to the previous week's overreaction, but remains bearish. The macro picture is still uncertain and, potentially, negative. Political relations, both domestic and global, are increasingly adversarial and continue to weigh on sentiment. And, moving from a pandemic to an endemic response to COVID-19 isn't proving to be the catalyst for the economy that many had hoped. The increased virulency of the latest variants outweighs the health benefits of its decreased potency in disrupting the global supply chain. This is especially true in labor-intensive sectors like transportation and services (i.e., great that hospitals are not being overwhelmed, but thousands of flights, are being canceled and the parts I ordered three weeks ago still haven't arrived).\n      </p>\n                <p>\n        Risk aversion (red line) and risk tolerance (green line) remained flat last week, maintaining the large imbalance between them. At this level there is more than two potential sellers for each potential buyer in the market should a negative news trigger sellers into action. What this translates into for institutional investors with a month-end rebalancing schedule, is to execute your sell order first and your buy orders second.\n      </p>\n                <h4>\n                  <strong>\n                    <strong>\n                      <strong>\n                        <strong>\n                          <strong>\n                            <strong>\n                              <strong>\n                                <strong>\n                                  <strong>European investor sentiment:</strong>\n                                </strong>\n                              </strong>\n                            </strong>\n                          </strong>\n                        </strong>\n                      </strong>\n                    </strong>\n                  </strong>\n                </h4>\n                <p>\n        Caught between rising tensions on the continent's eastern front and the ECB's promise of continued support, European investor sentiment (green line) remained bearish last week even after recovering from the sharp drop earlier this month. This week's macro-economic data release on inflation and GDP, together with the ECB's monetary policy meeting, will shape sentiment for the coming weeks. At these levels, investors seem to be betting on negative news on the inflation and GDP fronts. The sharp decline in sentiment in early January hinted at a growing consensus of a third negative factor for markets in the form of an ECB inflation pivot, but the recent recoveryindicates a downgrading of this scenario by investors. If the situation in Ukraine reaches a diplomatic solution and economic growth remains intact, the ECB may have some leeway to focus on fighting inflation and start communicating details of its removal of stimulus measures. The question in investors' mind now is whether markets can live without stimulus.\n      </p>\n                <p>\n        Risk aversion (red line) rose slightly last week, while risk tolerance (green line) remained mostly flat. Risk-averse investors outnumber risk-tolerant ones almost two to one, and risk appetite continues to be very negative. In this state, investors will underreact to positive news and overreact to negative ones. The net negative risk appetite is indicative of a consensus view that in the short term, the potential for negative news is greater than the potential for positive ones.\n      </p>\n                <h4>\n                  <strong>\n                    <strong>\n                      <strong>\n                        <strong>\n                          <strong>\n                            <strong>\n                              <strong>\n                                <strong>\n                                  <strong>\n                                    <strong>\n                                      <strong>\n                                        <strong>\n                                          <strong>Global developed markets investors sentiment:</strong>\n                                        </strong>\n                                      </strong>\n                                    </strong>\n                                  </strong>\n                                </strong>\n                              </strong>\n                            </strong>\n                          </strong>\n                        </strong>\n                      </strong>\n                    </strong>\n                  </strong>\n                </h4>\n                <p>\n        Sentiment among global developed-markets investors (green line) recovered briefly last week but still ended bearish. There were signs of some bargain hunting (red dotted line) as contrarian investors braved higher volatility levels to rotate out of risk-averse sectors, whose valuations reached above-trend levels recently, and into risk-tolerant ones, whose valuations had fallen after this month's market rout. Sentiment has been continuously bearish since early October 2021, capping any market rally during that time, but the factors driving negative sentiment are known and are being addressed. Perhaps last week's rally in risk-tolerant sectors presage a kind of bearish fatigue on the part of investors and any positive developments on the inflation, US interest rates, or Ukraine fronts could be the start of a relief rally.\n      </p>\n                <p>\n        Risk tolerance (green line) remained flat last week while risk aversion (red line) declined sharply. Risk appetite remains net negative, but signs are increasing that risk aversion is not as resolute as it was at the start of the year. The absence of a clear negative impact on global growth from either inflation or geopolitical tensions may be making risk-averse investors gradually more resilient to bad news, or at the very least, less expectant of it. Still, in the absence of genuine positive news, confident risk tolerance remains elusive.\n      </p>\n                <h4>\n                  <strong>\n                    <strong>\n                      <strong>\n                        <strong>\n                          <strong>\n                            <strong>\n                              <strong>\n                                <strong>\n                                  <strong>\n                                    <strong>\n                                      <strong>\n                                        <strong>\n                                          <strong>\n                                            <strong>\n                                              <strong>\n                                                <strong>Asia ex-Japan markets investor sentiment:</strong>\n                                              </strong>\n                                            </strong>\n                                          </strong>\n                                        </strong>\n                                      </strong>\n                                    </strong>\n                                  </strong>\n                                </strong>\n                              </strong>\n                            </strong>\n                          </strong>\n                        </strong>\n                      </strong>\n                    </strong>\n                  </strong>\n                </h4>\n                <p>\n        Sentiment (green line) among Asia ex-Japan investors continued to slowly recover last week but remained within the bearish camp. The prospect of more and more economies moving from a pandemic response to the COVID-19 crisis into an endemic one is fueling some bargain hunting among regional investors who have implemented more risk-tolerant strategies for two consecutive weeks now (red dotted line), ahead of this week's Chinese New Year market holidays.\n      </p>\n                <p>\n        Risk tolerance (green line) remained flat last week while risk aversion (red line) continued to drop, signaling that investors feel that a lot of the bad news potentially affecting markets may now be fully priced in. If inflation starts to recede on its own, if consumers are accepting of higher prices and continue to spend, and if profit margins remain unaffected, then perhaps the risk-averse-induced selling of the last few weeks may have been overdone. Yet, risk tolerance remains near its lows, indicating that while investors may feel more confident about a limited downside risk from these levels, they see no reason to rush back in and load on risk at this time.\n      </p>\n                <h4>\n                  <strong>\n                    <strong>\n                      <strong>\n                        <strong>\n                          <strong>\n                            <strong>\n                              <strong>\n                                <strong>\n                                  <strong>\n                                    <strong>\n                                      <strong>\n                                        <strong>\n                                          <strong>\n                                            <strong>\n                                              <strong>\n                                                <strong>\n                                                  <strong>Global emerging markets investor sentiment:</strong>\n                                                </strong>\n                                              </strong>\n                                            </strong>\n                                          </strong>\n                                        </strong>\n                                      </strong>\n                                    </strong>\n                                  </strong>\n                                </strong>\n                              </strong>\n                            </strong>\n                          </strong>\n                        </strong>\n                      </strong>\n                    </strong>\n                  </strong>\n                </h4>\n                <p>\n        Sentiment among global emerging-markets investors (green line) continued to recover last week, ending only slightly negative but well out of bearish territory. Investors continued to rotate out of risk-averse sectors and into more risk-tolerant ones, but this may well be just a valuation story rather than the start of a bull market. A sustainable rally will require positive fund flows into emerging markets from developed markets, and with risk aversion still high in many markets, the safe-haven status of developed markets may keep most liquidity there in the short term.\n      </p>\n                <p>\n        Risk aversion (red line) declined to its lowest level since the start of December 2021, and risk tolerance (green line) held on to the gains it made in the previous week. At the present time, sellers and buyers seem evenly matched, limiting the potential for large market swings in the near term. It seems clear, however, that after a whole year of underperformance, emerging markets are becoming more attractive from a valuation point of view. In this light, the recent rise in risk tolerance could just be bargain hunting at low prices. If prices are attracting buyers at these levels, then the feeling is that downside risk is limited, and so risk aversion is declining as well.\n      </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://qontigo.com/qontigo-roof-score-highlights-week-of-january-31-2022/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Qontigo GmbH</strong> published this content on <strong>31 January 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>31 January 2022 09:53:34 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - Qontigo GmbH</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Qontigo-GmbH</p></div>"}