{"date": "2022-01-20 05:57:42+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n                  <p>\n                    <span>Tata Consultancy Services' Holistic and Innovative Cloud Strategy, IoT Services, and Consulting, Security and Advanced SAP on AWS Offerings, Cited as Key Strength</span>\n                  </p>\n                  <p>\n                    <strong>SYDNEY | MUMBAI, January 20, 2022:</strong> Tata Consultancy Services (TCS) (BSE: 532540, NSE: TCS) has been recognised as a Leader in the ISG Provider Lens™ AWS Ecosystem Partners Report for Australia<sup>1</sup>. TCS was named a Leader across all quadrants - SAP Workloads, Internet of Things, Managed Services, Data Analytics and Machine Learning, Consulting Services, and Migration Services.\n        </p>\n                  <p>\n          According to the report, TCS' strength lies in its holistic and innovative cloud strategy and consulting offering as well as advanced and comprehensive compliance and security offerings. The report said that TCS has strong data analytics consulting and advisory capabilities including highly advanced SAP on AWS offerings. It goes on to say that TCS provides a full spectrum of IoT services and an advanced cloud platform for managed services which makes it a highly suitable provider of AWS services to Australian organisations.\n        </p>\n                  <p>\n                    <span>\"Progressive organisations are partnering with TCS to drive their multi-horizon cloud transformation journeys on AWS to become more resilient and agile, and to accelerate their innovation and growth,\" said</span>\n                    <strong>Krishna Mohan, Global Head, AWS Business Unit, TCS.</strong>\n                    <span>\"This Leadership recognition is a validation of our business-centric transformational approach, comprehensive portfolio of services and solution, and our market success in Australia.\"</span>\n                  </p>\n                  <p>\n          TCS' <a href=\"https://www.tcs.com/tcs-aws\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Business Unit</a> is a full-stack, multidisciplinary business unit that offers global enterprise customers customised end-to-end services and solutions around cloud migration, application and data modernisation, managed services, and industry-specific innovation leveraging the AWS cloud. TCS is an AWS Premier Consulting Partner, AWS Public Sector Partner, AWS Solution Provider Partner and AWS Public Sector Solution Provider.\n        </p>\n                  <p>\n          TCS' large pool of AWS cloud-ready professionals leverage their domain knowledge and AWS technology building blocks to create transformational solutions contextualised to specific industry sub-verticals. Furthermore, TCS' rich portfolio of leading-edge, industry-centric products like the TCS BaNCS™ suite in financial services, TCS Optumera™ in retail, TCS HOBS™ in telecom, TCS ADD™ in life sciences, TCS Aviana in airlines and Water Cloud in utilities is available on AWS, driving synergies across the enterprise value chain and impacting every stakeholder.\n        </p>\n                  <p>\n          At the recently concluded AWS re:Invent, TCS launched its <a href=\"https://www.tcs.com/tcs-launches-assessment-migration-factory-aws-mainframe-modernization\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Assessment and Migration Factory</a>, a set of proprietary tools, accelerators, and services that enable customers to accelerate the migration of their on-premise mainframe workloads to the new AWS Mainframe Modernization platform.\n        </p>\n                  <p>\n                    <span>\"TCS has achieved an outstanding level of leadership in ISG's Provider Lens for AWS Ecosystem Partners Australia 2021 report. TCS' capability to support Australian organisations across the whole spectrum of AWS services, from initial design and consulting, migration and ongoing management is impressive. In addition, TCS can also provide a high level of service in the areas of Data Analytics/Machine learning, SAP workloads and IoT services,\"</span>\n                    <strong>Craig Baty, Distinguished Analyst, ISG Research<span>.</span></strong>\n                  </p>\n                  <p>\n          TCS recently won the AWS Application Transformation and Migration Partner of the Year award in Australia and New Zealand, recognising its leadership in helping customers drive cloud modernisation and innovation on AWS.\n        </p>\n                  <h4>\n          About Tata Consultancy Services\n        </h4>\n                  <p>\n          Tata Consultancy Services is an IT services, consulting and business solutions organization that has been partnering with many of the world's largest businesses in their transformation journeys for over 50 years. TCS offers a consulting-led, cognitive powered, integrated portfolio of business, technology and engineering services and solutions. This is delivered through its unique Location Independent Agile™ delivery model, recognized as a benchmark of excellence in software development.\n        </p>\n                  <p>\n          A part of the Tata group, India's largest multinational business group, TCS has over 556,000 of the world's best-trained consultants in 46 countries. The company generated consolidated revenues of US $22.2 billion in the fiscal year ended March 31, 2021 and is listed on the BSE (formerly Bombay Stock Exchange) and the NSE (National Stock Exchange) in India. TCS' proactive stance on climate change and award-winning work with communities across the world have earned it a place in leading sustainability indices such as the MSCI Global Sustainability Index and the FTSE4Good Emerging Index. For more information, visit <strong><a href=\"https://www.tcs.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.tcs.com</a></strong>.\n        </p>\n                  <p>\n                    <sup>1</sup> AWS - Ecosystem Partners: Australia 2021, ISG Inc, December 2021\n        </p>\n                </div>\n                <h4>\n        TCS Media Contacts\n      </h4>\n                <h4>\n        Asia Pacific\n      </h4>\n                <p>\n        Email: <a href=\"mailto:wenjian.lin@tcs.com\" data-type=\"email\" translate=\"no\">wenjian.lin@tcs.com</a></p>\n                <p>\n        Phone: +65 9695 9948\n      </p>\n                <h4>\n        Australia and New Zealand\n      </h4>\n                <p>\n        Email: <a href=\"mailto:kelly.ryan@tcs.com\" data-type=\"email\" translate=\"no\">kelly.ryan@tcs.com</a></p>\n                <p>\n        Phone: +61 422 989 682\n      </p>\n                <h4>\n        Canada\n      </h4>\n                <p>\n        Email: <a href=\"mailto:Tiffany.fisher@tcs.com\" data-type=\"email\" translate=\"no\">Tiffany.fisher@tcs.com</a></p>\n                <p>\n        Phone: +1 416-456-7650\n      </p>\n                <h4>\n        Europe\n      </h4>\n                <p>\n        Email: <a href=\"mailto:joost.galema@tcs.com\" data-type=\"email\" translate=\"no\">joost.galema@tcs.com</a></p>\n                <p>\n        Phone: +31 615 903387\n      </p>\n                <h4>\n        India\n      </h4>\n                <p>\n        Email: <a href=\"mailto:saxena.kritika@tcs.com\" data-type=\"email\" translate=\"no\">saxena.kritika@tcs.com</a></p>\n                <p>\n        Phone: +91 22 6778 9999\n      </p>\n                <p>\n        Email: <a href=\"mailto:vanshika.sood@tcs.com\" data-type=\"email\" translate=\"no\">vanshika.sood@tcs.com</a></p>\n                <p>\n        Phone: +91 22 67789098\n      </p>\n                <h4>\n        Middle East &amp; Africa\n      </h4>\n                <p>\n        Email: <a href=\"mailto:s.hasneen@tcs.com\" data-type=\"email\" translate=\"no\">s.hasneen@tcs.com</a></p>\n                <p>\n        Phone: +00971567471988\n      </p>\n                <h4>\n        Japan\n      </h4>\n                <p>\n        Email: <a href=\"mailto:douglas.foote@tcs.com\" data-type=\"email\" translate=\"no\">douglas.foote@tcs.com</a></p>\n                <p>\n        Phone: +81 80 2115 0989\n      </p>\n                <h4>\n        Latin America\n      </h4>\n                <p>\n        Email: <a href=\"mailto:martin.karich@tcs.com\" data-type=\"email\" translate=\"no\">martin.karich@tcs.com</a></p>\n                <p>\n        Phone: +569 6170 9013\n      </p>\n                <h4>\n        UK\n      </h4>\n                <p>\n        Email: <a href=\"mailto:peter.devery@tcs.com\" data-type=\"email\" translate=\"no\">peter.devery@tcs.com</a></p>\n                <p>\n        Phone: +44 20 3155 2421\n      </p>\n                <h4>\n        USA\n      </h4>\n                <p>\n        Email: <a href=\"mailto:william.thomas@tcs.com\" data-type=\"email\" translate=\"no\">william.thomas@tcs.com</a></p>\n                <p>\n        Phone: +1 203 984 3978\n      </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.tcs.com/tcs-leader-aws-services-australia\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>TCS - Tata Consultancy Services Ltd.</strong> published this content on <strong>20 January 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>20 January 2022 05:57:42 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - TCS - Tata Consultancy Services Ltd.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: TCS---Tata-Consultancy-Services-Ltd.</p></div>"}