{"date": "2022-01-12 14:41:48.022000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ADVANCED MICRO DEVICES INC (\"AMD-Q\")\n- Highlights Growing Cloud Momentum With New Amazon EC2 Instances\n- for High Performance Computing\n\n     AMD announced Amazon Web Services, Inc. (AWS) has expanded its AMD\nEPYC(TM) processor-based offerings with the general availability of the new\nAmazon EC2 Hpc6a instances, which are purpose-built for high performance\ncomputing (HPC) workloads in the cloud.\n\n     According to AWS, Amazon EC2 Hpc6a instances deliver up to 65 percent\nbetter price-performance compared to similar Amazon EC2 instances. Hpc6a\nwill help customers run their most compute-intensive HPC workloads like,\ngenomics, computational fluid dynamics, weather forecasting, financial risk\nmodeling, EDA for semiconductor design, computer-aided engineering, and\nseismic imaging.\n\n     Throughout the HPC industry, there has been a growing preference for\nAMD as showcased by AMD EPYC processors powering 73 supercomputers on the\nlatest Top500 list and holding 70 HPC world records1. The new Hpc6a\ninstances bring the leadership performance and capabilities of 3rd Gen AMD\nEPYC processors to compute-optimized Amazon EC2 instances used for highly\ncomplex HPC workloads.\n\n     \"Our processors power all levels of HPC, from exascale systems in\nresearch laboratories to flexible HPC cloud computing instances like the\nnew Amazon EC2 Hpc6a instances. AMD EPYC processors provide a powerful\nsolution for Amazon EC2 customers that need access to impressive HPC\nperformance and cloud scalability for their workloads,\" said Dan McNamara,\nsenior vice president and general manager, Server Business, AMD. \"Our work\nwith AWS exemplifies our commitment to powering cutting edge technology in\nthe HPC industry and helping customers find answers to the world's most\npressing questions.\"\n\n     \"Amazon EC2 Hpc6a instances, powered by 3rd Gen AMD EPYC processors,\nallow organizations the flexibility to run HPC workloads requiring an\nabundance of compute power, fast memory and storage, and high levels of\ninter-instance communication without the upfront cost of building and\nmaintaining HPC infrastructure on-premises,\" said David Brown, vice\npresident, Amazon EC2, AWS. \"We're excited to continue our collaboration\nwith AMD and add another crucial AMD EPYC instance to the Amazon EC2\nportfolio.\"\n\n     The instances powered by 3rd Gen AMD EPYC processors are available in\nUS East (Ohio) and AWS GovCloud (US-West), with availability in additional\nAWS Regions planned soon. AWS customers can visit the Amazon EC2 Hpc6a\ninstances page to get started.\n\n     Supporting Resources\n\n     *  Read the Amazon EC2 blog on Hpc6a instances\n     *  Learn more about AMD EPYC Processors\n     *  Visit the Amazon EC2 Hpc6a instances product detail page\n     *  Follow AMD on Twitter\n     *  Connect with AMD on LinkedIn\n\n     About AMD\nFor more than 50 years AMD has driven innovation in high-performance\ncomputing, graphics and visualization technologies ? the building blocks\nfor gaming, immersive platforms and the datacenter. Hundreds of millions of\nconsumers, leading Fortune 500 businesses and cutting-edge scientific\nresearch facilities around the world rely on AMD technology daily to\nimprove how they live, work and play. AMD employees around the world are\nfocused on building great products that push the boundaries of what is\npossible. For more information about how AMD is enabling today and\ninspiring tomorrow, visit the AMD (NASDAQ: AMD) website, blog, Facebook and\nTwitter pages.\n\n     AMD, the AMD Arrow logo, EPYC, and combinations thereof are trademarks\nof Advanced Micro Devices, Inc. Other names are for informational purposes\nonly and may be trademarks of their respective owners.\n\n1 EPYC-22A: AMD EPYC Family of Processors set 250+ World Records as of\n10/26/2021\n\nTel   : 905-882-2600    ADVANCED MICRO DEVICES INC\nFax   : 905-709-6950\nEmail : linda.lam@amd.com\nWWW   : <a href=\"http://www.amd.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.amd.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201100264.MNPRE2201101374-06232220220112</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}