{"date": "2022-01-13 14:11:45.098000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3307.24, "close": 3224.28}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>PLANET BASED FOODS GLOBAL INC (\"PBF-Z\")\n- Former Senior VP of Sales of FIJI Water James Harris as Vice\n- President of Business Development &amp; Operations\n\n     Planet Based Foods Global Inc. (\"PBFG\", \"Planet Based Foods\" or the\n\"Company\"), through its San Diego-based wholly-owned subsidiary producer of\nsustainable plant-based meat substitutes, Planet Based Foods Inc. (\"Planet\nBased Foods\"), is pleased to announce former Senior VP of Sales of FIJI\nWater, Mr. James Harris as Vice President of Business Development &amp;\nOperations.\n\n     Mr. Harris is President of JLH Consulting, LLC and an accomplished\nexpert in the Consumer Packaged Goods (CPG) industry. During his 10-year\ntenure of progressive leadership roles at FIJI Water, he secured over 50\ndistributors and oversaw a network that included Dr. Pepper/7UP Bottling\nGroup, Admiral Beverage, Young's Market and many others. Mr. Harris managed\na 55-person sales team and established distribution in every major retailer\nin the Western US including Safeway, Whole Foods and Trader Joe's, helping\nFIJI Water become America's top-selling premium water brand.\n\n     In addition to his contributions at FIJI Water, Mr. Harris has\nsuccessfully launched a number of high-profile brands in the food and\nbeverage space including leading distribution and sales for Monster Energy\nDrink, TCHO Chocolate, Rumble Supershake, Dave's Gourmet, Groundwork Coffee\nand Diedrich Coffee.\n\n     At TCHO Chocolate, Mr. Harris helped build national distribution while\nsignificantly improving margin and profit. He spearheaded the launch of\nRumble Supershake in the US, and quickly established distribution in retail\ngrocery channels. While at Dave's Gourmet, Mr. Harris not only developed\nthe Sam's Club program that increased sales by 50%, but also implemented a\nSKU guideline that secured new authorization in 250 Kroger stores.\n\n     With his oversight at Groundwork Coffee, grocery sales in Los Angeles\ndoubled while sales in the Pacific Northwest increased by 500%. Mr. Harris\nrestructured and revived Diedrich Coffee by implementing SKU\nrationalization, price increases and dissolving the unprofitable Food\nService division. He also doubled the sales team to lead Diedrich Coffee's\nintroduction in Grocery and Club. Diedrich became profitable within two\nyears and was sold for US$290 million.\n\n     Mr. Harris has managed sales, marketing, pricing and promotional\nstrategy for multi-million-dollar companies. He has trained and headed\nhigh-performance sales teams to introduce new products and has worked with\nall channels of trade from Grocery, Mass, Club, Drug, C-store, Specialty\nand Food Service on a local, regional, national and International level. He\nis an expert in developing and managing all models of distribution from DSD\nto broadline and DTA.\n\n     \"I am thrilled to be joining Planet Based Foods at such an exciting\ntime in the company's growth,\" said Mr. Harris. \"In an industry that is\nbecoming increasingly sustainability-focused, Planet Based Foods is doing\nimportant and impactful work in making healthy, plant-based products more\naccessible to consumers. I am looking forward to helping the company\nadvance this mission in my new role through the development and\nimplementation of growth opportunities.\"\n\n     \"Mr. Harris is a proven leader in the CPG industry and has been\ninstrumental in successfully bringing a number of innovative, notable\nbrands to the market,\" said Planet Based Foods President and CEO Braelyn\nDavis. \"His expertise, strategic input and vast experience in food and\nbeverage will be incredibly beneficial to Planet Based Foods as we continue\nto focus on growing our business and improving shareholder value. We are\nvery excited to welcome him to the team.\"\n\n     To view information about the Company and subscribe to automated email\nalerts for future news and public filings, visit the Planet Based Foods\nwebsite at www.planetbasedfoods.com.\n\n     About Planet Based Foods\n\n     PBFG, through its wholly-owned subsidiary in San Diego, California,\nPlanet Based Foods, is a producer of sustainable plant-based meat\nsubstitutes. Planet Based Foods was founded in 2018 in San Diego,\nCalifornia. With a mission to build a better food system by providing\nhemp-formulated superfood products to people today that support our planet\ntomorrow, all Planet Based Foods products are 100% vegan.\n\n     ON BEHALF OF THE BOARD\n\n     \"Braelyn Davis\"\n\n     Braelyn Davis\n\n     President, Chief Executive Officer and Director\n\n     FORWARD-LOOKING STATEMENTS:\n\n     Certain statements included in this news release constitute\nforward-looking information or statements (collectively, \"forward-looking\nstatements\"), including those identified by the expressions \"anticipate\",\n\"assume\" \"believe\", \"plan\", \"estimate\", \"expect\", \"intend\", \"may\", \"should\"\nand similar expressions to the extent they relate to the Company or its\nmanagement. The forward-looking statements are not historical facts but\nreflect current expectations regarding future results or events. This news\nrelease contains forward looking statements. These forward-looking\nstatements are not guarantees of future performance and involve risks,\nuncertainties and assumptions which are difficult to predict. Such\nstatements are based on current expectations and various estimates, factors\nand assumptions and involve known and unknown risks, uncertainties and\nother factors. Such statements and information are based on numerous\nassumptions regarding present and future business strategies and the\nenvironment in which the Company will operate in the future. The Company\nassumes no responsibility to update or revise forward-looking information\nto reflect new events or circumstances unless required by law. Readers\nshould not place undue reliance on the Company's forward-looking\nstatements.\n\n     The Canadian Securities Exchange does not accept responsibility for\nthe adequacy or accuracy of this news release.\n\n     For more information, please visit:  www.planetbasedfoods.com\n\nFor further information: For investor enquiries, please contact: Daniel\nSouthan-Dwyer, Corporate Development, Planet Based Foods, Tel: +1 604 366\n6277; For media enquiries, please contact: Adrienne Arieff, Managing\nDirector, Beck Media &amp; Marketing, Tel: +1 310 270 2214\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201200542.MNPRE2201201471-06051320220113</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}