{"date": "2022-01-31 16:11:30.946000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>WAY OF WILL INC. (\"WAY-Z\")\n- Begins Trading on the Canadian Securities Exchange and Provides\n- Outlook for 2022\n\n     Way of Will Inc. (\"Way of Will\" or the \"Company\"), an alternative\nwellness company, announces that it has commenced trading on the Canadian\nSecurities Exchange (the \"CSE\") today under the ticker symbol \"WAY\". The\nCompany is also providing an update on its operations and upcoming roadmap\nfor growth.\n     Way of Will is a Canadian wellness brand known for its plant-based\nproducts with a focus on aromatherapy and active lifestyles. Spearheaded by\nfounder and CEO Willie Tsang, the Company has worked with numerous retail\ngiants to expand its brand presence across North America both online and in\nbrick-and-mortar stores.\n     \"We are extremely pleased to make our debut on the Canadian Securities\nExchange,\" commented Willie Tsang, who founded the Company in 2016. \"This\nis one of many critical steps that we're taking to ensure continued growth\nas a leading brand in the natural wellness sphere.\"\n     Product Extension and Marketplace Expansion\n     In the upcoming year, Way of Will is setting its sights on creating\nnew revenue streams to further diversify its position in the market.\nUtilizing an established strategy with demonstrated success, the Company\nhas assembled an experienced and accomplished team to lead product launches\nbeginning in Q1 2022, leveraging its brand authority in the wellness sphere\nto grow its two sub-brands, Nude &amp; Crude and G Society. In addition to\nintroducing new product variants in the brand's existing collections, the\nCompany has plans to expand beyond body care products and into supplements\nand functional home products, as well as launching its own marketplace\nplatform.\n     Key Performance Indicators\n     Way of Will is pleased to announce that it has successfully met and\nsurpassed several Key Performance Indicators in 2021:\n     * Increased revenue from $1.9M in 2020 to $3.7M in 2021 with an\naverage CAGR of 22% over the last 3 years.\n     * Increased gross margins from 31% in 2020 to 46% in 2021, in large\npart due to sales coming from the Company's own e-commerce platform.\n     * Launched Way of Will products at leading supermarket chain Whole\nFoods Market across 450 stores across the U.S.\n     * Increased Amazon and Walmart marketplace sales by 3-8%.\n     Operational Improvements\n     In anticipation of its continued growth, the Company will focus on\nstreamlining and enhancing current operations in the upcoming year, further\nhoning efficiencies, improving performance while reducing costs, and\nfortifying its marketing and production efforts to bolster sales. In\naddition, the Company intends to:\n     * Assemble a team of digital marketing experts to bolster sales and\nmarketing efforts.\n     * Launch its sub-brand, G Society, to expand beyond essential oils and\ninto the supplements category.\n     * Introduce a home product line, starting with natural essential\noil-based room sprays, to expand beyond skin care and body care products.\n     * Continue developing its own marketplace platform, where consumers\nand wellness experts can also connect to build and foster a strong brand\ncommunity.\n     2022 Forecast\n     Way of Will is anticipating exponential growth in 2022 as the Company\ncontinues to fortify its marketing and product development strategies,\nbacked by its strong team of established Officers and Directors with\ndecades of proven experience managing multimillion-dollar companies. The\nCompany will leverage its expertise and brand authority in the wellness\nsector to continue offering consumers a growing and in-demand assortment of\nnatural products and wellness services, bringing them closer to becoming\nthe leading brand in wellness products in North America.\n     Stock Options\n     The Company also announces that it has granted 4,190,000 incentive\nstock options to directors, officers, employees and consultants. The\nincentive stock options have an exercise price of $0.10 per share, are\nvalid for a 5-year period from the date of grant and are subject to\nregulatory approval.\n     About Way of Will Inc.\n     Way of Will is a Canadian CPG manufacturer and retailer offering a\nfull range of natural, plant-based wellness products. Way of Will currently\noffers a total of 191 SKUs of natural skin care and wellness products\nthrough its main brand and sub-brands, Nude &amp; Crude and G Society. To learn\nmore, please visit: www.wayofwill.com\n\nON BEHALF OF THE BOARD OF DIRECTORS\nWay of Will Inc.\nWillie Tsang\nCEO and Director\n\nFor further information please contact:\nWillie Tsang at business@wayofwill.com\n\nThe CSE does not accept responsibility for the adequacy or accuracy of this\nrelease.\n\nCautionary Statement Regarding Forward-Looking Information\nThis news release contains certain statements that may constitute\nforward-looking information under applicable securities laws. All\nstatements, other than those of historical fact, which address activities,\nevents, outcomes, results, developments, performance or achievements that\nthe Company anticipates or expects may or will occur in the future (in\nwhole or in part) should be considered forward-looking information. Such\ninformation may involve, but is not limited to, statements with respect to:\nthe Company's business and business plans; the Company's strategy and\ncurrent focus on developing brands and new products, including in respect\nof anticipated growth. Often, but not always, forward-looking information\ncan be identified by the use of words such as \"plans\", \"expects\", \"is\nexpected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\",\n\"anticipates\", or \"believes\" or variations (including negative variations)\nof such words and phrases, or statements formed in the future tense or\nindicating that certain actions, events or results \"may\", \"could\", \"would\",\n\"might\" or \"will\" (or other variations of the forgoing) be taken, occur, be\nachieved, or come to pass. Forward-looking information is based on\ncurrently available competitive, financial and economic data and operating\nplans, strategies or beliefs as of the date of this news release, but\ninvolve known and unknown risks, uncertainties, assumptions and other\nfactors that may cause the actual results, performance or achievements of\nthe Company to be materially different from any future results, performance\nor achievements expressed or implied by the forward-looking information.\nSuch factors may be based on information currently available to the\nCompany, including information obtained from third-party industry analysts\nand other third-party sources, and are based on management's current\nexpectations or beliefs regarding future growth, results of operations,\nfuture capital (including the amount, nature and sources of funding\nthereof) and expenditures. Any and all forward-looking information\ncontained in this press release is expressly qualified by this cautionary\nstatement and the Company expressly disclaims any intention or obligation\nto update or revise any forward-looking statements whether as a result of\nnew information, future events or otherwise, except as required by\napplicable law.\n\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203000616.MNPRE2203001926-08012220220131</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}