{"date": "2021-12-13 14:43:07.876000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SPI ENERGY CO LTD (\"SPI-Q\")\n- EdisonFuture to Show Upcoming EVs at Consumer\n- Electronics Show\n\n   SPI Energy Co. Ltd. (\"SPI Energy\" or the \"Company\"), a global renewable\nenergy company and provider of solar storage and electric vehicle (EV)\nsolutions for business, residential, government, logistics and utility\ncustomers, today announced its wholly owned EdisonFuture Motor Inc.\nsubsidiary plans to showcase two EdisonFuture light-duty electric vehicles\nat the Consumer Electronics Show (CES) in Las Vegas Nevada, January 5-8,\n2022. EdisonFuture will showcase in West Hall, Booth 6942 under the\ntransportation/vehicle technology category.\n\n(figure class=\"image image_resized\" style=\"width:391px;\")(/figure)\nFollowing its global brand and future product reveal at Los Angeles Auto\nShow on November 17th, EdisonFuture announced its plan to attend CES and\ncontinue highlighting its light-duty EVs, the EF1-T and EF1-V. The vehicles\noffer unique styling and design, innovation such as advanced solar\ntechnology on the vehicle roofs, a retractable solar bed cover on the\ntruck, and offer a variety of battery pack/motor configurations with\nadequate electric range. EF1-T pickup truck is built for work or leisure,\nplans to accommodate up to six passengers, and comes with towing and\nall-wheel drive options allowing for a variety of uses, from working to\noff-roading. The EF1-V all-electric delivery van, is built on the same\nchassis as the pickup truck, and offers significant cargo volume, serving\nas a cleaner option for cargo and delivery needs as many companies expand\ntheir sustainability objectives.\n\n(figure class=\"image image_resized\" style=\"width:500px;\")(/figure)     CES\nis hosted annually by the Consumer Technology Association and is the\npremier U.S. tech trade show. Due to the pandemic, the 2021 show moved to a\nvirtual format, but the upcoming 2022 event will be physically attended at\nthe Las Vegas Convention Center. With over 1,800 companies planning to\nattend including Google, Amazon, GM and Bosch, visitors from over 159\ncounties, and hundreds of media outlets, the show is coming back with\nstrong interest and participation.\n\n   \"We've enjoyed a great level of interest in our new brand and products,\nin EdisonFuture. We look to continue that momentum and increase awareness\nat CES, which is one of the world's largest consumer electronic events. We\nlook forward to a warm reception of our new products, showcasing to the\nworld how exciting and innovative these new products are\" stated Mr. Denton\nXiaofeng Peng, Chairman &amp; Chief Executive Officer of SPI Energy.\n\n   About SPI Energy\n\n   SPI Energy Co., Ltd. (NASDAQ: SPI) is a global renewable energy company\nand provider of solar storage and electric vehicle (EV) solutions that was\nfounded in 2006 in Roseville, California and is headquartered in Santa\nClara, California.\n\n   The company has three core divisions: SolarJuice residential solar, the\ncommercial &amp; utility solar division comprised of SPI Solar and Orange\nPower, and the EdisonFuture/Phoenix Motorcars EV division. SolarJuice is\nthe leader in renewable energy system solutions for residential and small\ncommercial markets and has extensive operations in the Asia Pacific and\nNorth American markets. The commercial &amp; utility solar division provides a\nfull spectrum of EPC services to third party project developers, and\ndevelops, owns and operates solar projects that sell electricity to the\ngrid in multiple regions, including the U.S., U.K., and Europe. Phoenix\nMotorcars is a leader in medium-duty commercial electric vehicles, and is\ndeveloping EV charger solutions, electric pickup trucks, electric\nforklifts, and other EV products.\n\n   SPI maintains global operations in North America, Australia, Asia and\nEurope and is also targeting strategic investment opportunities in fast\ngrowing green industries such as battery storage, charging stations, and\nother EVs which leverage the Company's expertise and substantial solar cash\nflow.\n\n   For more information on SPI Energy and its subsidiaries, the Company\nrecommends that stockholders, investors and any other interested parties\nread the Company's public filings and press releases available under the\nInvestor Relations section at www.SPIgroups.com or www.sec.gov.\n\n   Forward-Looking Statements\n\n   This press release contains forward-looking statements, as that term is\ndefined in the Private Litigation Reform Act of 1995, that involve\nsignificant risks and uncertainties. Forward-looking statements can be\nidentified through the use of words such as \"may,\" \"might,\" \"will,\"\n\"intend,\" \"should,\" \"could,\" \"can,\" \"would,\" \"continue,\" \"expect,\"\n\"believe,\" \"anticipate,\" \"estimate,\" \"predict,\" \"outlook,\" \"potential,\"\n\"plan,\" \"seek,\" and similar expressions and variations or the negatives of\nthese terms or other comparable terminology. Readers are cautioned not to\nplace undue reliance on these forward-looking statements, which reflect the\nCompany's current expectations and speak only as of the date of this\nrelease. Actual results may differ materially from the Company's current\nexpectations depending upon a number of factors. These factors include,\namong others, the coronavirus and actions taken in connection therewith,\nadverse changes in general economic and market conditions, competitive\nfactors including but not limited to pricing pressures and new product\nintroductions, uncertainty of customer acceptance of new product offerings\nand market changes, risks associated with managing the growth of the\nbusiness, and those other risks and uncertainties that are described in the\n\"Risk Factors\" section of the Company's Form 20-F filed with the Securities\nand Exchange Commission. Except as required by law, the Company does not\nundertake any responsibility to revise or update any forward-looking\nstatements.\n\nIR Department\nir@spigroups.com\n\nDave Gentry\nRedChip Companies, Inc.\nPhone: (407) 491-4498\ndave@redchip.com\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134600183.MNPRE2134601380-06420120211213</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}