{"date": "2021-11-17 19:44:16.160000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>KORNIT DIGITAL LTD (\"KRNT-Q\")\n- Launch of Public Offering of Ordinary Shares\n\n     Kornit Digital Ltd. (\"Kornit\"), a company that develops, designs and\nmarkets innovative, sustainable, on-demand, digital fashion and textile\nproduction technologies, today announced the launch of an underwritten\npublic offering of 2,205,701 ordinary shares, 1,500,000 of which are being\noffered by Kornit and 705,701 of which are being offered by an affiliate of\nAmazon.com, Inc. (\"Amazon\").  Kornit will not receive any of the proceeds\nfrom the sale of shares being offered by an affiliate of Amazon.  The\nshares being sold by an affiliate of Amazon are being issued pursuant to\nthe exercise of a warrant granted to Amazon by Kornit.  Kornit intends to\ngrant the underwriters a 30-day option to purchase up to an additional\n330,855 ordinary shares.\n\n     Kornit intends to use the proceeds from the offering for future\npotential acquisitions, including complementary businesses, technologies or\nassets, and for general corporate purposes, including working capital and\ncapital expenditures.\n\n     Citigroup, Barclays, Goldman Sachs &amp; Co. LLC and Morgan Stanley are\nacting as bookrunners and as representatives of the underwriters for this\noffering. Needham &amp; Company, Stifel, William Blair, Berenberg, CJS\nSecurities and Craig-Hallum are acting as co-managers in the offering.\n\n     Kornit is filing a preliminary prospectus supplement to its shelf\nregistration statement on Form F-3 with the U.S. Securities and Exchange\nCommission (the \"SEC\") for the proposed offering of its ordinary shares.\nThe offering will be made only by means of a prospectus supplement and the\naccompanying prospectus. When available, a copy of the preliminary\nprospectus supplement relating to the offering and accompanying prospectus\nmay be obtained from Citigroup, c/o Broadridge Financial Solutions, 1155\nLong Island Avenue, Edgewood, NY 11717 (Tel: 800-831-9146 or email to:\nProspectus@citi.com); Barclays, c/o Broadridge Financial Solutions, 1155\nLong Island Avenue, Edgewood, NY 11717, or by telephone at 888-603-5847, or\nby emailing barclaysprospectus@broadridge.com; or Goldman Sachs &amp; Co. LLC,\nAttention: Prospectus Department, 200 West Street, New York, NY 10282, or\nby telephone at 866-471-2526, or by email at prospectus-ny@ny.email.gs.com;\nMorgan Stanley &amp; Co. LLC, Attention: Prospectus Department, 180 Varick\nStreet, 2nd Floor, New York, New York 10014, or by telephone:\n1-866-718-1649.\n\n     The offering of these securities is being made under an effective\nshelf registration statement on file with the SEC. The registration\nstatement can be accessed through the SEC's website at www.sec.gov. This\npress release shall not constitute an offer to sell or the solicitation of\nan offer to buy nor may there be any sale of these securities in any state\nor jurisdiction in which such an offer, solicitation or sale would be\nunlawful prior to registration or qualification under the securities laws\nof any such state or jurisdiction.\n\n     About Kornit Digital\n\n     Kornit Digital Ltd. (NASDAQ: KRNT) develops, designs and markets\ninnovative, sustainable, on-demand, digital fashion and textile production\ntechnologies. The company is writing the operating system for fashion with\nend-to-end solutions including digital printing systems, inks, consumables,\nand an entire global ecosystem that manages workflows and fulfillment.\nHeadquartered in Israel with offices in the USA, Europe, and Asia Pacific,\nKornit Digital serves customers in more than 100 countries and states\nworldwide.\n\n     Investor Contact\nAndrew G. Backman\nGlobal Head of Investor Relations\nandrew.backman@kornit.com\n\nEmail : Michael.callahan@icrinc.com    KORNIT DIGITAL LTD\nWWW   : <a href=\"https://www.kornit.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.kornit.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132000125.MNPRE2132000661-05464220211117</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}