{"date": "2021-11-21 23:51:55.406000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>More schools and medical posts in various remote areas of the Amazon today access satellite Internet thanks to Conecta Selva, an initiative of the National Telecommunications Program (PRONATEL) that, to date, has benefited more than 100,000 citizens of Loreto, Mother of God and Ucayali.</p><p>Taking stock of the execution of the initiative, PRONATEL reported that currently the implementation progress of Conecta Selva reaches 29.94%, allowing 348 schools and 46 health establishments to access the satellite Internet service.</p></div><div class=\"tr-npp-body\"><p>Likewise, through the contractor company, teams have been deployed to complete the Internet service installations in 592 public institutions, corresponding to the second advance of facilities, which includes schools and medical posts in the three aforementioned regions and Amazonas.</p><p>It should be noted that, in August, PRONATEL approved the first advance of facilities, benefiting 66 public institutions, including schools and medical posts in the Ucayali and Loreto regions.</p><p>It is expected that in the first quarter of 2022 the third progress of the works will be completed, bringing the Internet to 100% of public institutions contemplated in the initiative, with a total budget of S / 90,888,750.00, so that 263,655 citizens of the Amazon can have access to telehealth, tele-education and develop digital skills.</p><p>The initiative, which is part of the Todos Conectados Plan, contemplates bringing the Internet to communities in Peru that for a long time telecommunications projects did not reach.</p><p>PRONATEL, an entity attached to the Ministry of Transport and Communications, reaffirms its commitment to continue joining efforts to accelerate the expansion of coverage, access and use of the internet, in order to generate more opportunities for all.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}