{"date": "2021-12-01 19:54:04.595000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>AIG Selects AWS as Its Preferred Public Cloud Provider</b>\n</p><p class=\"bwalignc\">\n<span>Global insurance giant taps the world’s leading cloud to drive business transformation, increase operational efficiency, and accelerate innovation in the cloud</span>\n</p><p>\nToday, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company, (NASDAQ: AMZN), announced that American International Group, Inc. (NYSE: AIG), a leading global insurance company, has selected AWS as its preferred public cloud provider. The global insurance provider chose AWS for its proven reliability, security, and comprehensive set of cloud capabilities. AIG is undergoing a large-scale digital transformation with AWS as part of its “AIG 200” strategy that aims to improve core business processes, modernize technology infrastructure and services, and create a culture of innovation. The enterprise-wide initiative will use AWS technologies to deliver underwriting excellence, product portfolio optimization, and enhanced customer experiences for AIG’s 90 million policyholders worldwide.\n</p><p>\n“AWS provides us with the deep portfolio of services we need to streamline our global operations and continuously innovate for our customers,” said Peter Zaffino, President and Chief Executive Officer, AIG. “AIG’s work with AWS is integral to our business transformation that will help us become a more nimble, efficient, and unified company. Moving the majority of our workloads off legacy platforms to the cloud enables us to seize new market opportunities quickly, enhance security, and become even more responsive to our customers’ needs.”\n</p><p>\nAIG began its digital transformation journey with AWS in 2017. AIG’s adoption of AWS’s broad portfolio of cloud services will accelerate in 2021 and 2022 with the expanded relationship and AIG’s engagement of AWS Professional Services.\n</p><p>\n“AIG is a forward-thinking and client-centric business, and AWS is excited to help them innovate with the next 100 years in mind,” said Frank Fallon, Vice President of Financial Services at Amazon Web Services, Inc. “AIG has embarked on a transformation and growth strategy using AWS to help the company deliver better service for its customers, create long-term value for its shareholders, and quickly innovate secure, compliant new services. Leveraging AWS’s global infrastructure, unparalleled portfolio of cloud services, and financial services expertise, leading insurance companies like AIG can become more agile and efficient to deliver industry-leading products and customer experiences.”\n</p><p>\n<b>About Amazon Web Services</b>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com&amp;esheet=52541768&amp;newsitemid=20211130005257&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=1&amp;md5=f8097132cf8eb5b02bbfec15a7acd24a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<b>About Amazon</b>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Famazon.com%2Fabout&amp;esheet=52541768&amp;newsitemid=20211130005257&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=2&amp;md5=689ab4b7d93eccf6ae18310da94aa0d9\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> amazon.com/about</a> and follow @AmazonNews.\n</p><p>\n<b>About AIG</b>\n</p><p>\nAmerican International Group, Inc. (AIG) is a leading global insurance organization. AIG member companies provide a wide range of property casualty insurance, life insurance, retirement solutions, and other financial services to customers in approximately 80 countries and jurisdictions. These diverse offerings include products and services that help businesses and individuals protect their assets, manage risks and provide for retirement security. AIG common stock is listed on the New York Stock Exchange.\n</p><p><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211130005257/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211130005257/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52541768&amp;newsitemid=20211130005257&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=3&amp;md5=42894fa175c5da5948a748a71e62fa6f\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON-WEB-SERVICES</p></div>"}