{"date": "2021-09-01 11:41:57.689000+00:00", "ticker": "III", "mrkt_info": {"open": 1337.5, "close": 1338.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENBRIDGE INC (\"ENB-T\")\n- Executive Leadership Changes\n\n     Enbridge Inc. (Enbridge or the Company) announced the following\nexecutive leadership changes, effective October 1, 2021.\n\n     Vern Yu is appointed Executive Vice President &amp; Chief Financial\nOfficer taking over from Colin Gruending. Vern will be accountable for all\nthe Company's financial affairs including Budgeting, Financial Planning &amp;\nReporting, Treasury, Investor Relations, Tax, Risk, Insurance and Audit\nmanagement functions as well as Sustained Business Optimization. Prior to\nthis role, Vern was Executive Vice President &amp; President, Liquids\nPipelines. During his 25+ year tenure with Enbridge, Vern has held\nexecutive roles in finance, strategic planning, corporate development, and\nrenewable power as well as leading the business and market development\nactivities for Liquids Pipelines during a period of substantive growth.\nVern has a Master of Business Administration, Bachelor of Applied Science\n(Engineering) and is a Professional Engineer.\n\n     Colin Gruending is appointed Executive Vice President &amp; President\nLiquids Pipelines taking over from Vern Yu. Colin will be accountable for\nall of Liquids Pipelines operations and business development. Prior to this\nrole, Colin was Executive Vice President &amp; Chief Financial Officer. During\nhis 22+ years with Enbridge, Colin has a developed a deep understanding of\nthe business and operations having held several executive leadership roles\nin finance, investor relations, accounting, pension management, strategic\nplanning, corporate development, and M&amp;A. Colin has a Bachelor of Commerce\nand holds Chartered Professional Accountant and Chartered Financial Analyst\ndesignations.\n\n     \"These executive appointments once again illustrate our ongoing\nemphasis on developing our people and further strengthening our executive\nteam for the future,\" said Al Monaco, President &amp; Chief Executive Officer\nof Enbridge.\n\n     About Enbridge Inc.\n\n     Enbridge Inc. is a leading North American energy infrastructure\ncompany. We safely and reliably deliver the energy people need and want to\nfuel quality of life. Our core businesses include Liquids Pipelines, which\ntransports approximately 25 percent of the crude oil produced in North\nAmerica; Gas Transmission and Midstream, which transports approximately 20\npercent of the natural gas consumed in the U.S.; Gas Distribution and\nStorage, which serves approximately 3.8 million retail customers in Ontario\nand Quebec; and Renewable Power Generation, which generates approximately\n1,766 MW of net renewable power in North America and Europe. The Company's\ncommon shares trade on the Toronto and New York stock exchanges under the\nsymbol ENB. For more information, visit www.enbridge.com.\n\n     FOR FURTHER INFORMATION PLEASE CONTACT:\n\n     Media Toll Free: (888) 992-0997 Email: media@enbridge.com\n\n     Investment Community Toll Free: (800) 481-2804 Email:\ninvestor.relations@enbridge.com\n\n     View original\ncontent:https://www.prnewswire.com/news-releases/enbridge-announces-executi\nve-leadership-changes-301366694.html\n\nTel   : 403-231-3900    ENBRIDGE INC CUM REDEEMABLE PR SHARES SERIES L\nFax   : 403-231-5929\nEmail : CorporateSecretary@enbridge.com\nWWW   : <a href=\"https://www.enbridge.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.enbridge.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2124300015.MNPRE2124300424-04140520210901</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}