{"date": "2021-12-07 01:09:27.411000+00:00", "ticker": "III", "mrkt_info": {"open": 1400.0, "close": 1405.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>3i Infrastructure plc (?3i Infrastructure? or the ?Company?) has agreed to invest c.?191 million to acquire a 92% stake in SRL Traffic Systems (?SRL?), the market leading traffic management equipment rental company in the UK. Management has re-invested to acquire the remaining 8% stake. 3i Infrastructure has provided a further ?83 million of debt financing to SRL with the intention of replacing this with third party debt in due course.</p><p>SRL, which is headquartered in Cheshire, owns a fleet of almost 13,000 items of traffic management equipment, which it rents to local authorities, utilities, contractors and traffic management companies from a nationwide network of depots. SRL?s product range includes temporary traffic lights, adaptive detection systems, pedestrian and cyclist systems, variable messaging systems, barriers and CCTV. SRL offers its customers a full service rental solution, which includes the planning and design of complex traffic management systems, installation, maintenance and integration with existing systems, as well as direct sales of equipment assembled by SRL.</p></div><div class=\"tr-npp-body\"><p>SRL is experiencing strong growth in customer demand driven by an increasing number of roadworks projects, resulting from greater spending on highway maintenance, utilities works and major infrastructure projects. Hire of traffic management equipment is increasingly favoured over other methods of traffic control because it contributes to improved safety whilst roadworks take place, protecting both road workers and the general public whilst effectively managing traffic congestion.</p><p>SRL?s market-leading reputation is supported by its network of 30 depots nationwide, providing a 24/7 365 day a year service on which customers rely for quick deployment and reactive maintenance work.</p><p>Richard Laing, Chair of 3i Infrastructure, commented: ?SRL is an attractive core-plus infrastructure business and is well-suited to 3i Infrastructure?s strategy of investing in asset-intensive companies. The business has a strong position through its extensive depot network and market-leading reputation.?</p><p>Phil White, Managing Partner and Head of Infrastructure, 3i Investments plc, Investment Manager of the Company, added: ?SRL has defensive characteristics in a sector with attractive underlying market trends. We are excited to be backing a best-in-class management team, and we see opportunities to use our longstanding experience of investing in UK infrastructure to support SRL?s continued growth.?</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}