{"date": "2021-09-02 14:10:58.049000+00:00", "ticker": "III", "mrkt_info": {"open": 1337.5, "close": 1338.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>COWEN INC (\"COWN-Q\")\n- John Patrick Miller Joins Cowen Research's Washington Research\n- Group to Cover ESG and Sustainability Policy\n\n     Cowen Inc. (\"Cowen\" or the \"Company\") today announced that John\nPatrick Miller has joined Cowen Research's Washington Research Group\n(\"WRG\") to cover ESG and sustainability policy. He will be based in\nWashington, D.C. and will report to Robert Fagin, Cowen's Director of\nResearch.\n\n     \"We are excited to expand our renowned Washington Research Group to\ninclude coverage of ESG and sustainability, an area of increasing focus for\ninstitutional investors and corporations alike. John's hire speaks to\nCowen's company-wide commitment to ESG and sustainability. His\nextraordinary experience and perspective will be valuable in our continued\ncommitment to these issues. We are thrilled to have him on board,\" said Mr.\nFagin.\n\n     Cowen's research department consists of 56 senior analysts (including\nseven analysts in its Washington Research Group) and covers over 875\nsecurities across a range of industries. WRG has consistently ranked as one\nof the leading providers of policy analysis to institutional investors by\nthird-party polls.\n\n     About Cowen's ESG and Sustainability Research\n\n     *  In March, Cowen became the first major Wall Street firm to place\ncompany-specific ESG Scores on the cover of its research reports. More\ninformation about this initiative may be found at\n<a href=\"https://www.cowen.com/about/esg-scores\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.cowen.com/about/esg-scores</a>/.\n     *  Cowen Research analysts cover a full spectrum of ESG &amp;\nsustainability stocks, including alternative energy (such as solar and\nwind), battery technology, biofuels and renewable fuels, electric vehicles\nand mobility technology, electric vehicle charging, industrial gases and\nequipment, lithium and rare earth materials, smart grid, sustainable food\nand farming, and Washington policy.\n     *  Through the Ahead Of The Curve(R) Series, Cowen's flagship research\noffering, Cowen analysts have authored numerous reports that focus on ESG\nand sustainability, including the Future of Mobility Primer, Sustainable\nEnergy &amp; Industrial Technology Primer, and a landmark, seven-report series\non energy transition.\n     *  Cowen hosts numerous sector events that serve as the center of\ndiscussion between investors and innovative companies, including its\nMobility Disruption conference, Industrial Technology, Robotics &amp;\nSustainability conference, and its annual Energy Conference. Cowen is also\nhosting an ongoing conference call series focused on energy transition.\n\n     About John Miller\nPrior to joining Cowen, Mr. Miller was a vice president and senior ESG\nresearch analyst at Calvert Research and Management, part of Morgan Stanley\nInvestment Management, where he developed and built a quantitative,\ncompany-level ESG risk/reward assessment framework targeted towards the\nglobal energy and utility sectors. He also worked on securities selection\nfor the firm's thematic energy (Calvert Energy Solutions) and water\n(Calvert Global Water) funds. Before joining Calvert, Mr. Miller worked at\nthe U.S. Federal Energy Regulatory Commission (FERC), most recently as\nbranch chief in the Office of Enforcement, Division of Analytics and\nSurveillance. Earlier, he served as Technical and Policy Advisor to one of\nthe FERC commissioners, and as an energy analyst in FERC's Office of\nEnforcement.\n\n     Mr. Miller holds a B.A. in economic history and political science from\nThe George Washington University, and a Master's in global history from The\nLondon School of Economics and Political Science, where he focused on\ndevelopmental economics. John also holds the Fundamentals of Sustainability\nAccounting certification, which is granted by the Sustainability Accounting\nStandards Board (SASB).\n\n     About Cowen Inc.\nCowen Inc. (\"Cowen\" or the \"Company\") is a diversified financial services\nfirm that operates through two business segments: a broker dealer and an\ninvestment management division. The Company's broker dealer division offers\ninvestment banking services, equity and credit research, sales and trading,\nprime brokerage, global clearing and commission management services.\nCowen's investment management segment offers actively managed alternative\ninvestment products. Cowen Inc. focuses on delivering value-added\ncapabilities to our clients in order to help them outperform. Founded in\n1918, the firm is headquartered in New York and has offices worldwide.\nLearn more at Cowen.com.\n\n     (c) 2021, COWEN INC., ALL RIGHTS RESERVED. COWEN AND COMPANY, LLC:\nMEMBER FINRA, NYSE AND SIPC\n\n     MEDIA CONTACT\nGagnier Communications\nDan Gagnier\ndg@gagnierfc.com\n646 569 5897\n\nTel   : 1-212-845-7900    COWEN GROUP INC\nEmail : james.farley@cowen.com\nWWW   : <a href=\"https://www.cowen.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.cowen.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2124400534.MNPRE2124401560-06465520210902</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}