{"date": "2021-12-20 19:50:48.939000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Indian antitrust body Competition Commission of India (CCI) has suspended its approval for Amazon's investment in Indian retailer Future Group.</p><p>In 2019, CCI approved the deal that will allow the US company to purchase retail assets of Future Group.The regulatory body ruled that Amazon suppressed \"the actual scope and purpose of the combination\".In its 57-page order, CCI said that Amazon \"misled the commission to believe, through false statements and material omissions, that the combination and its purpose were the interest of Amazon in the business of Future Coupons Private Limited (FCPL)\" and suppressed \"the purpose of establishing strategic alignment and partnership between Amazon Group and Future Retail Ltd (FRL) as well as have a 'foot-in-the-door' in the India retail sector\".The commission said that it \"considers it necessary to examine the combination afresh\" and noted that the approval granted in November 2019 \"shall remain in abeyance\".In addition to suspending the approval, the competition watchdog also imposed a $26.3m (INR2bn) fine on Amazon.Amazon has been given 60 days to file information regarding the investment, which will be examined by CCI.Meanwhile, the ruling is expected to impact Amazon's legal battle against Reliance Industries' (RIL) acquisition of Future Group's assets.Reliance Retail Ventures Limited (RRVL), a subsidiary of RIL, agreed last year to buy certain businesses of Future Group in a deal valued at $3.38bn (?247.13bn).In August this year, a two-judge bench of the Indian Supreme Court upheld the Singapore International Arbitration Centre's (SIAC) decision to hold off Future Retail Limited's (FRL) deal with RIL.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}