{"date": "2021-12-24 03:59:14.716000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3420.74, "close": 3393.39}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_wh3rc3vp&amp;referenceId=tag:reuters.com,2021:newsml_OVF9EJGIZ_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_wh3rc3vp&amp;referenceId=tag:reuters.com,2021:newsml_OVF9EJGIZ_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: U.S. automaker General Motors Co, Alphabet Inc.'s Google and its self-driving auto-technology company Waymo on Thursday joined the companies no longer attending the Consumer Electronics Show (CES) in person early next month due to rising COVID-19 infections. Dhruv Tikekar reports.<br/>Short Link: <a href=\"https://refini.tv/33IB4Yj\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/33IB4Yj</a><br/><br/>Video Transcript:<br/><br/>More big names have joined the list of companies that won't attend next month's Big Tech showcase, the Consumer Electronics Show in Winchester, Nevada. They include US automaker GM and Alphabet's Google, as well as its self-driving company, Waymo. It's all due to concerns over rising COVID-19 infections. All three firms, however, have said they're eyeing a virtual presence with GM committed to unveiling its latest electric vehicle at the show. The annual tech event typically features presentations from some of the biggest names in the industry and attracts around a 180,000 people from around the world to discuss emerging technologies and trends. Earlier this week, Amazon, Meta, Twitter and Pinterest all announced that they wouldn't be sending people to the event. Organizers, however, still plan to hold the show in person with \"strong safety measures in place,\" including vaccination requirements, masking and availability of COVID-19 tests.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}