{"date": "2022-01-23 23:59:16.615000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> is opening its first ever clothing store where <a href=\"https://www.independent.co.uk/topic/algorithms\" data-type=\"url\" class=\"tr-link\" translate=\"no\">algorithms</a> will suggest items for shoppers to try on.</p><p>The online retailing giant's 30,000 sq ft Amazon Style store is set to open near <a href=\"https://www.independent.co.uk/topic/los-angeles\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Los Angeles</a> later this year as the company pushes its fashion business.</p></div><div class=\"tr-npp-body\"><p>All of the items for sale appear on racks and customers scan a code using the Amazon app to chose the colour and size they would like to try on.</p><p>The customer then enters a virtual line for a fitting room that they unlock with their phone when it becomes available.</p><p>Each fitting room has a touchscreen that shoppers can use to choose more items to try on, with staff depositing them in a two-sided secure locker \"within minutes\", Amazon said.</p><p>\"We wouldn't do anything in physical retail unless we felt we could significantly improve the customer experience,\" said Simoina Vasen, a managing director.</p><p>She described the experience as being \"like a magic closet with seemingly endless selection.\"</p><p>The company said the fitting room will be \"a personal space for you to continue shopping without ever having to leave.\"</p><p>Amazon will keep a record of every good scanned by each customer, with its algorithms then making clothing recommendations.</p><p>Customers can also fill out a style survey and when they arrive in the fitting room, Amazon staff will have deposited the clothes they have selected and others that their computers have picked out.</p><p>Shoppers will be able to pay for their purchases using the company's Amazon One biometric system that simply requires them to swipe the palm of their hand.</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/life-style/gadgets-and-tech/nft-cryptocurrency-selfie-crypto-b1996276.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Student accidentally becomes a millionaire after turning selfie into an NFT as a joke</a> </p><p><a href=\"https://www.independent.co.uk/life-style/gadgets-and-tech/elon-musk-neuralink-human-trials-b1997334.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Elon Musk appears close to beginning the first ever human trials of his brain chip</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 Independent, The (UK) (Online). All rights reserved.</p></div>"}