{"date": "2022-02-17 21:29:15.451000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3162.01, "close": 3052.03}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>KIDOZ INC (\"KIDZ-V\")\n- Record 2021 Revenue And Second Annual Profitable Year\n\n     Kidoz Inc. (the \"Company\"), mobile AdTech developer and owner of the\nmarket leading Kidoz Contextual Ad Network (www.kidoz.net); the safe\nprogrammatic ad sourcing solution \"Kidoz Connect\"; and the Kidoz Publisher\nSDK, announced that as a result of the powerful advertiser and user growth\non the Company's market leading mobile platform, its unaudited financial\nresults for the fourth quarter ended December 31, 2021, show record revenue\nand profits for the Company. All amounts are presented in United States\ndollars and are in accordance with United States Generally Accepted\nAccounting Principles.\n\n     Financial highlights from the fourth quarter of 2021 include:\n\n*  Total Revenue of $5,883,484 - growth of 109% over Total Revenue of\n$2,814,642 in Q3 2021\n*  Profit of $990,302, an increase of $1,065,342 over a loss of ($75,040)\nin Q3 2021\n*  Adjusted EBITDA of $1,353,442 - growth of 409% over Adjusted EBITDA of\n$265,984 in Q3 2021.\n\n     Financial highlights from fiscal 2021 include:\n\n*  Fiscal 2021 Total Revenue of $12,433,573 - growth of 74% over fiscal\n2020 Total Revenue of $7,148,029\n*  Fiscal 2021 GAAP Profit of $23,141, compared to a GAAP Profit of\n$103,971 in fiscal 2020\n*  Fiscal 2021 Adjusted EBITDA of $1,507,720 compared to Adjusted EBITDA of\n$771,236 in fiscal 2020\n*  Cash of $2,078,607 and working capital of $4,539,842 as at December 31,\n2021\n*  Non Capitalized R&amp;D expenditures of $1,678,848 up from $1,149,902 in\nfiscal 2020.\n\n     \"Kidoz occupies the perfect position as the leader in safe contextual\nmobile advertising,\" stated Jason Williams, Kidoz Co-CEO. \"As broadcast\ntelevision continues to decline and mobile apps continue to rise, the\ndemand for safe advertising opportunities on mobile has never been higher.\nAdvertisers are looking for brand-safe media with the widest reach and\nKidoz is the solution. Kidoz is able to work to the specific requirements\nof leading family brands to build awareness and create engagement with\nevery campaign and feature product.\"\n\n     \"The Kidoz technology platform is advancing quickly and we continue to\nopen new opportunities to increase revenues and advance the monetization of\nour global network. Kidoz operates its core, child-directed, media business\nalong with newly launched products that service teens, parents, performance\nmarketing advertisers, and safe-programmatic advertising via the Kidoz\nConnect solution. As our software continues to be refined and expands\nfurther into the global advertising technology market we are able to\nincrease our rate of growth and build new revenue streams from within the\nenormous $400 billion digital advertising market.\"\n\n     \"In 2021 Kidoz launched campaigns for brands in 58 different\ncountries,\" stated Eldad Ben Tora, Kidoz Co-CEO. \"Kidoz has built a global\nsolution and is represented by a global network of sales agents who know\nthe local representatives and brands looking to reach kids and families in\na safe and compliant way. While Kidoz's growth was outstanding in 2021,\nmanagement believes that we are only beginning to realize the potential of\nour technology and the strength of our market position.\n\n     \"2022 has started on a record pace and management is confident that we\nwill be able to continue to increase our growth. Kidoz continues to expand\nthe number of markets in which we operate and the number of products we can\nmonetize. It's with great pleasure to the entire Kidoz team, now 32 strong,\nthat we can work together to achieve such exciting results.\"\n\n     Fourth Quarter Financial Results\n\n     Total Current Assets as at December 31, 2021 were $8,770,032, compared\nto $5,249,555 as at December 31, 2020, and Total Current Liabilities as at\nDecember 31, 2021, were $4,230,190, compared to $2,178,010 as at December\n31, 2020.\n\n     Total revenue, net of platform fees (to Apple, Google and Amazon) and\nwithholding taxes, for the fourth quarter ended December 31, 2021,\nincreased to $5,883,484, an increase of 68% from revenue of $3,507,250 for\nthe fourth quarter of 2020 and an increase of 109% from revenue of\n$2,814,642 for the third quarter of 2021. The increase in total revenue\ncompared to the fourth quarter of fiscal 2020 and the third quarter of\nfiscal 2021 is due to the growth of our publisher reach and our advertising\ncustomers increasing their advertising budgets with the Kidoz safe mobile\nnetwork.\n\n     Selling and marketing expenses were $175,440 for the fourth quarter\nended December 31, 2021, an increase of 46% over expenses of $120,342 in\nthe fourth quarter of fiscal 2020 and an increase of 12% over expenses of\n$156,122 in the third quarter of fiscal 2021. This increase in sales and\nmarketing expenses in the fourth quarter ended December 31, 2021, compared\nto the fourth quarter of fiscal 2020 and over the third quarter of fiscal\n2021 is due to an increase in the sales and marketing team to serve our\nclients better.\n\n     Additionally, the Company commenced a Stock Awareness Program in the\nsecond quarter of 2021 to increase the visibility of the Company to the\ngeneral investment community at a total cost of $402,845 in fiscal 2021.\nThe total number of shares traded on the TSXV over the period increased\n500% to 4,232,681 shares from 844,921shares in the comparable 9 month\nperiod in 2020. The program expenses were $51,596 for the fourth quarter\nended December 31, 2021, a decrease of 21% over expenses of $65,392 in the\nthird quarter of fiscal 2021.\n\n     General and administrative expenses consist primarily of premises\ncosts for our offices, legal and professional fees, and other general\ncorporate and office expenses. General and administrative expenses\ndecreased to $135,061 for the fourth quarter ended December 31, 2021, a\ndecrease of 13% from costs of $154,640 for the fourth quarter of fiscal\n2020 and a decrease of 7% from costs of $145,765 in the third quarter of\nfiscal 2021. The decrease in general and administrative expenses compared\nto the fourth quarter of fiscal 2020 and the third quarter of fiscal 2021,\nis due a decrease in fees paid to our professional advisors. The Company\ncontinues to maintain its current office space despite the large majority\nof our staff working from home since early March 2020.\n\n     Salaries, wages, consultants, and benefits of $182,005 for the fourth\nquarter ended December 31, 2021, an increase of 21% compared to salaries,\nwages, consultants, and benefits of $149,803 in the fourth quarter of 2020\nand an increase of 48% compared to salaries, wages, consultants, and\nbenefits of $123,381 in the third quarter of 2021. This increase compared\nto the fourth quarter of fiscal 2020 and the third quarter of fiscal 2021\nis due to an increase in the overall headcount of staff employed by the\nCompany to service its rapid growth.\n\n     The Company does not capitalize its development costs. The Company\nexpensed $497,950 in software development costs during the fourth quarter\nended December 31, 2021, an increase of 44% compared to software\ndevelopment costs of $344,685 expensed during the fourth quarter of fiscal\n2020 and an increase of 4% in software development costs of $477,559 in the\nthird quarter of fiscal 2021. The increase compared to the fourth quarter\nof fiscal 2020 and the third quarter of fiscal 2021, is due to an increased\nfocus in development of our base technology and the development of our safe\nprogrammatic ad sourcing solution Kidoz Connect.\n\n     Throughout the year the Company hired additional development and sales\nand marketing staff to facilitate our continued growth. This hiring has\ncontinued into the first quarter of fiscal 2022 to our present total\ncomplement of 32 staff worldwide.\n\n     The net income after taxation for the fourth quarter ended December\n31, 2021, amounted to $990,302, an increase of $237,642 over a net income\nof $752,660, for the fourth quarter of fiscal 2020 and an increase of\n$1,065,342 over a loss of ($75,040), in the previous quarter ended\nSeptember 30, 2021. This increase in total income for the fourth quarter\ncompared to the fourth quarter of fiscal 2020 and the third quarter of\nfiscal 2021 is due to the increase in the number of advertising campaigns\nreaching a larger number of users.\n\n     The net income after taxation for the year ended December 31, 2021,\namounted to $23,141, compared to a net income of $103,971 in the year ended\nDecember 31, 2020. This decrease in total income for the fiscal year 2021\ncompared to fiscal 2019 is due to the increased expenses incurred by\ncommencing the Stock Awareness Program.\n\n     Adjusted earnings before interest; depreciation and amortization;\nstock awareness program; stock-based compensation and impairment of\ngoodwill (\"Adjusted EBITDA\") for the fourth quarter ended December 31,\n2021, amounted to $1,353,443, compared to Adjusted EBITDA of $913,355 for\nthe fourth quarter of fiscal 2020 and $265,984 in third quarter ended\nSeptember 30, 2021.\n\n     Adjusted EBITDA for the year ended December 31, 2021 amounted to\n$1,507,720 compared to EBITDA of $771,236 in fiscal 2020.\n\n     During the quarter ended December 31, 2021, we provided cash of\n$896,743 in operating activities compared to cash provided by operating\nactivities of $85,366 in the same period in the prior year and provided\ncash of $851,399 in operating activities for the year ended December 31,\n2021, compared to cash provided by operating activities of $256,978 for the\nyear ended December 31, 2020.\n\n     During the quarter ended December 31, 2021, we used cash in investing\nactivities of ($313) compared to cash used by investing activities of\n($3,532) in the same period in the prior year and used cash in investing\nactivities of ($409) for the year ended December 31, 2021, compared to cash\nused by investing activities of ($21,537) for the year ended December 31,\n2020.\n\n     Net cash used in financing activities was ($7,831) in the quarter\nended December 31, 2021. This compares to cash provided by financing\nactivity of $7,212 in the same period in the prior year and cash generated\nby financing activities of $1,572 for the year ended December 31, 2021,\ncompared to cash generated by financing activities of $23,392 for the year\nended December 31, 2020.\n\n     We had cash of $2,078,607 and working capital of $4,539,842 as at\nDecember 31, 2021. This compares to cash of $1,226,045 and working capital\nof $3,071,545 as at December 31, 2020.\n\n     For full details of the Company's operations and financial results,\nplease refer to the Securities and Exchange Commission website at\nwww.sec.gov or the Kidoz Inc. corporate website at\n<a href=\"https://investor.kidoz.net\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://investor.kidoz.net</a> or on the www.sedar.com website.\n\n     About Kidoz Inc.\n\n     Kidoz Inc. (www.kidoz.net) owns the leading COPPA &amp; GDPR compliant\ncontextual mobile advertising network that safely reaches hundreds of\nmillions of kids, teens, and families every month. Google certified and\nApple approved, Kidoz provides an essential suite of advertising technology\nthat unites brands, content publishers and families. Trusted by Disney,\nHasbro, Lego and more, the Kidoz Contextual Ad Network helps the world's\nlargest brands to safely reach and engage kids across thousands of mobile\napps, websites and video channels. The Kidoz network does not use location\nor PII data tracking commonly used in digital advertising. Instead, Kidoz\nhas developed advanced contextual targeting tools to enable brands to reach\ntheir ideal customers with complete brand safety. A focused AdTech solution\nprovider, the Kidoz SDK and Kidoz Contextual Ad Network have become\nessential products in the digital advertising ecosystem.\n\n     The Private Securities Litigation Reform Act of 1995 provides a \"safe\nharbor\" for forward-looking statements. Certain information included in\nthis press release (as well as information included in oral statements or\nother written statements made or to be made by the company) contains\nstatements that are forward-looking, such as statements relating to\nanticipated future success of the company. Such forward-looking information\ninvolves important risks and uncertainties that could significantly affect\nanticipated results in the future and, accordingly, such results may differ\nmaterially from those expressed in any forward-looking statements made by\nor on behalf of the company. For a description of additional risks and\nuncertainties, please refer to the company's filings with the Securities\nand Exchange Commission. Specifically, readers should read the Company's\nAnnual Report on Form 10-K, filed with the SEC on March 31, 2021, and the\nprospectus filed under Rule 424(b) of the Securities Act on March 9, 2005\nand the SB2 filed July 17, 2007, and the TSX Venture Exchange Listing\nApplication for Common Shares filed on June 29, 2015 on SEDAR, for a more\nthorough discussion of the Company's financial position and results of\noperations, together with a detailed discussion of the risk factors\ninvolved in an investment in Kidoz Inc.\n\n     For more information contact:\n\n     Henry Bromley\n     CFO\n     ir@kidoz.net\n     (888) 374-2163\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204700634.MNPRE2204702923-13273820220217</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}