{"date": "2021-12-01 15:57:46.434000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Dec 01, 2021</p></div><div class=\"tr-npp-lead\"><p><span>Amazon</span>'s <a href=\"https://www.zacks.com/stock/quote/AMZN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AMZN</a> cloud computing platform, Amazon Web Services (\"AWS\"), introduced a managed service named AWS Private 5G.</p><p>AWS Private 5G helps companies in seamless deployment and scaling up of private 5G mobile networks in their facilities.</p></div><div class=\"tr-npp-body\"><p>With the help of the service, customers can mention their mobile network coverage area and required capacity for their devices in the AWS console. Accordingly, AWS will provide the small cell radio units, servers, 5G core and RAN software, and SIM cards to deploy private 5G network and connect devices.</p><p>The service automates the setting up process so that additional devices can be supported.</p><p>Thus, customers can enjoy 5G networks with more reliability, coverage, lower latency, and higher bandwidth, while scaling their networks with the addition of more devices seamlessly.</p><p> </p><p class=\"tr-npp-section-title\">Amazon.com, Inc. Price and Consensus</p><p><a href=\"https://www.zacks.com/stock/chart/AMZN/price-consensus-chart?icid=chart-AMZN-price-consensus-chart\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. price-consensus-chart</a> | <a href=\"https://www.zacks.com/stock/quote/AMZN?icid=chart-AMZN-price-consensus-chart\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. Quote</a> </p><p class=\"tr-npp-section-title\">AWS Portfolio Strength</p><p>The latest move by Amazon mark its effort to expand its portfolio of offerings to provide better services to customers.</p><p>Apart from AWS Private 5G, the company introduced AWS Mainframe Modernization to help customers seamlessly shift mainframe and legacy workloads to the cloud at minimal charges.</p><p>It also introduced AWS IoT FleetWise so that automakers can easily collect and organize vehicle data and transfer it to the cloud in near real-time.</p><p>Additionally, AMZN introduced AWS IoT TwinMaker, which provides a solution for developers to seamlessly integrate data from various sources and combine it for creating a graph that relates to a real-world environment.</p><p>Amazon also unveiled three serverless options for its suite of analytics services for analyzing data without any need for configuration and management of the underlying infrastructure.</p><p class=\"tr-npp-section-title\">Growing Customer Base</p><p>With the launch of AWS Private 5G, the company expects to gain strong traction among various customers. Customers and partners, including DISH, Amazon Fulfillment, and Koch Global Services, have already shown interest in the service.</p><p>Apart from companies choosing the latest service, companies like<span>American International Group</span><a href=\"https://www.zacks.com/stock/quote/AIG\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AIG</a> ,<span>United Airlines</span><a href=\"https://www.zacks.com/stock/quote/UAL\" data-type=\"url\" class=\"tr-link\" translate=\"no\">UAL</a> and<span>Qualtrics International</span><a href=\"https://www.zacks.com/stock/quote/XM\" data-type=\"url\" class=\"tr-link\" translate=\"no\">XM</a> have selected AWS as their official cloud provider.</p><p>American International Group picked AWS to leverage its complete cloud capabilities for improving business procedure, digital transformation and modernizing services.</p><p>Along with cloud services, AIG selected AWS's financial service expertise to enhance customers' experience.</p><p>United Airlines has chosen AWS to use its machine learning, Internet of Things, analytics, databases, computing, storage, and security capabilities to advance its travel services to provide a better traveling experience to customers.</p><p>By leveraging AWS, UAL has already introduced the latest features in its app and digital channels so that customers can understand and follow COVID-related travel restrictions.</p><p>Qualtrics has been shifting its complete portfolio of experience management applications and customer-facing workloads to AWS.</p><p>AWS's infrastructure and broad capabilities like machine learning, analytics, databases, security, and compute are helping Qualtrics to gain operational efficiency and provide customers with deeper insights with the help of new features.</p><p>However, increasing expenses for research and development for product introductions remain headwinds for Amazon. The company currently carries a Zacks Rank #5 (Strong Sell).</p><p>You can see <a href=\"https://www.zacks.com/registration/premium/login/?continue_to=%2Fstocks%2Fbuy-list%2F%3FADID%3Dzp_1link%26ICID%3Dzpi_1link\"><span>the complete list of today's Zacks #1 Rank (Strong Buy) stocks here</span></a> .</p><p><span>Zacks Names \"Single Best Pick to Double\"</span></p><p>From thousands of stocks, 5 Zacks experts each have chosen their favorite to skyrocket +100% or more in months to come. From those 5, Director of Research Sheraz Mian hand-picks one to have the most explosive upside of all.</p><p>You know this company from its past glory days, but few would expect that it's poised for a monster turnaround. Fresh from a successful repositioning and flush with A-list celeb endorsements, it could rival or surpass other recent Zacks' Stocks Set to Double like Boston Beer Company which shot up +143.0% in a little more than 9 months and Nvidia which boomed +175.9% in one year.</p><p><a href=\"https://www.zacks.com/registration/ultimatetrader/welcome/eoffer/4e87?add=1590&amp;adid=NEWSTEX_CONTENT_ZU_1S2DREPORT_ANALYSTBLOG_257_12012021&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_corporate_actions-1833862\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Free: See Our Top Stock and 4 Runners Up &gt;&gt;</a></p><p>Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.</p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=RPT_7BST_LP194&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_257&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_corporate_actions-1833862\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Click to get this free report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=AMZN&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_257&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_corporate_actions-1833862\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. (AMZN): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=UAL&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_257&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_corporate_actions-1833862\" data-type=\"url\" class=\"tr-link\" translate=\"no\">United Airlines Holdings Inc (UAL): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=AIG&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_257&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_corporate_actions-1833862\" data-type=\"url\" class=\"tr-link\" translate=\"no\">American International Group, Inc. (AIG): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZR_LINK&amp;d_alert=rd_final_rank&amp;t=XM&amp;ADID=NEWSTEX_CONTENT_ZR_ARTCAT_ANALYSTBLOG_257&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_corporate_actions-1833862\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Qualtrics International Inc. (XM): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/stock/news/1833862/amazon-amzn-expands-customer-base-with-aws-private-5g-launch?cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_corporate_actions-1833862\" data-type=\"url\" class=\"tr-link\" translate=\"no\">To read this article on Zacks.com click here.</a></p><p><a href=\"http://www.zacks.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Zacks Investment Research</a></p><p>The views expressed in any and all content distributed by Newstex and its re-distributors (collectively, the \"Newstex Authoritative Content\") are solely those of the respective author(s) and not necessarily the views of Newstex or its re-distributors. Stories from such authors are provided \"AS IS,\" with no warranties, and confer no rights. The material and information provided in Newstex Authoritative Content are for general information only and should not, in any respect, be relied on as professional advice. Newstex Authoritative Content is not \"read and approved\" before it is posted. Accordingly, neither Newstex nor its re-distributors make any claims, promises or guarantees about the accuracy, completeness, or adequacy of the information contained therein or linked to from such content, nor do they take responsibility for any aspect of such content. The Newstex Authoritative Content shall be construed as author-based content and commentary. Accordingly, no warranties or other guarantees are offered as to the quality of the opinions, commentary or anything else appearing in such Newstex Authoritative Content. Newstex and its re-distributors expressly reserve the right to delete stories at its and their sole discretion.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Zacks Investment Research</p></div>"}