{"date": "2022-02-23 12:03:50.773000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>A North Carolina motorcyclist is suing Amazon for $100m after his collision with a delivery driver resulted in the amputation of his left leg, claiming the company's pressure on its employees rendered the driver distracted and caused the crash.</p><p>The accident took place in October when motorcyclist Justin Hartley was hit by a Hertz truck with an Amazon logo in Virginia Beach, Virginia.</p></div><div class=\"tr-npp-body\"><p>According to the lawsuit, the driver Christopher Gill <a href=\"https://www.pilotonline.com/news/vp-nw-amazon-hartley-lawsuit-20220221-dydfnj77bvedrgrrjally63wom-story.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">admitted</a> after the crash that he had his eyes on directions on his GPS, provided by Amazon, the Virginian-Pilot reported.</p><p>The accident left Hartley gravely injured: it fractured his left wrist and he had to have his left knee amputated.</p><p>\"The unrealistic expectations that are put on the drivers are fueling these negligence cases,\" said Kevin Biniazan, the attorney representing Hartley.</p><p>\"The driver was so entranced in making his delivery that he did not see our client,\" he added.</p><p>Biniazan has said this accident was \"preventable\", and the lawsuit places the blame on the e-commerce giant itself, deepening allegations of harsh working conditions for Amazon workers that have dogged the company for years.</p><p>Amazon delivery drivers have shared horror stories, including working <a href=\"https://www.theguardian.com/technology/2021/mar/11/amazon-delivery-drivers-bathroom-breaks-unions\" data-type=\"url\" class=\"tr-link\" translate=\"no\">14-hour shifts</a> and having to urinate in plastic bottles instead of going to the bathroom due to the intense demands of the job.</p><p>Recently, Amazon workers at an Alabama warehouse won the chance to vote for a <a href=\"https://www.theguardian.com/technology/2022/jan/12/amazon-union-warehouse-workers-alabama\" data-type=\"url\" class=\"tr-link\" translate=\"no\">union a second time</a> , after Amazon was found guilty of violating labor law during the first election.</p><p>According to Hartley's lawsuit, drivers are made to use a \"Flex App\" which dictates which directions the drivers should take and when to take bathroom or lunch breaks.</p><p>If the driver is running behind, they are given reminders that they are \"behind the rabbit\" and have to be \"rescued\". If a driver is \"behind the rabbit\" or requires \"rescue\" often enough, it can negatively affect their pay.</p><p>The nature of this app can create \"foreseeable risk that Amazon drivers will be distracted while operating their vehicles, resulting in a hazardous condition,\" the lawsuit claimed, according to the Virginian-Pilot.</p><p>Amazon has denied all allegations, saying in a statement to the Associated Press that the lawsuit failed to \"implicate a legal or contractual responsibility owed on behalf of Amazon\".</p><p>The company also denied Gill had committed \"any act of negligence\".</p><p>Gill responded to the lawsuit by denying that he initially admitted to authorities that he had been looking at the GPS, according to the <a href=\"https://www.pilotonline.com/news/vp-nw-amazon-hartley-lawsuit-20220221-dydfnj77bvedrgrrjally63wom-story.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Virginian Pilot</a> . The paper also reported his lawyers plan to argue that the accident was the result of Hartley being \"contributorily negligent\" and \"assum[ing] the risk of his actions and fail[ing] to mitigate his damages\".</p><p>Amazon did not immediately respond to a Guardian request for further.</p><p><span>The Associated Press contributed reporting</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 theguardian.com-NonSyndicated</p></div>"}