{"date": "2021-11-28 05:35:33+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3504.56, "close": 3507.07}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW DELHI, Nov 28 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>India's economic crime-fighting agency summoned officials of Amazon.com Inc &lt;AMZN.O &gt; and its warring partner Future Group in a case related to alleged violation of foreign investment rules, according to sources with direct knowledge of the matter.</p><p>Amazon received a summons issued by India's Enforcement Directorate in connection with the Future Group, an Amazon spokesperson told Reuters on Sunday.</p><p>\"As we have just received the summons, we are examining it and will respond within the given time frame,\" the spokesperson said. </p><p>The Enforcement Directorate <a href=\"https://www.reuters.com/world/india/exclusive-indian-agency-seeks-documents-future-disputed-amazon-deal-2021-11-08\" data-type=\"url\" class=\"tr-link\" translate=\"no\">has been investigating</a> whether there were any violations of foreign investment laws when Amazon made a $200 million investment in Future's gift voucher unit, Future Coupons, in 2019. The deal is at the heart of ongoing legal disputes between the two firms. </p><p>At least <span class=\"tr-strong\">two </span>senior Future Group executives have been summoned to appear before the Enforcement Directorate in the week of Dec. 6, a source with direct knowledge of the matter told Reuters, declining to be named as the matter was not public.</p><p>At least two Amazon India executives, including its legal head, have also been summoned, another source with knowledge of the matter said. </p><p>Spokespersons for the Future Group and the Enforcement Directorate did not immediately respond to requests for comment. </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Aditya Kalra and Zeba Siddiqui in NEW DELHI; Editing by Simon Cameron-Moore)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:zeba.siddiqui@thomsonreuters.com\" data-type=\"email\" translate=\"no\">zeba.siddiqui@thomsonreuters.com</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-INDIA/FUTURE-INVESTIGATION</p></div>"}