{"date": "2021-12-10 19:12:18.049000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3483.42, "close": 3391.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>GPO PLUS INC (\"GPOX-0\")\n- CEO Outlines Growth Plan and Provides Update to Investment\n- Community in MoneyTV Interview\n\n     GPO Plus, Inc. a publicly traded company of diversified\nindustry-specific Group Purchasing Organizations (GPOs), announced the\nairing of CEO, Brett H. Pojunis's, interview on MoneyTV hosted by Executive\nProducer and anchor, Donald Baillargeon.\n\n     MoneyTV is accessible in over 200 million households in more than 75\ncountries. For a complete list of the global TV Listings, syndication, and\ncontent partners, please visit; <a href=\"http://moneytv.net/global-tv-listing\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://moneytv.net/global-tv-listing</a>.\n\n     Brett's interview can also be viewed online immediately on GPOPlus+'s\nwebsite, <a href=\"https://gpox.cc/3ydppMv\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://gpox.cc/3ydppMv</a>, or GPOX's YouTube channel,\n<a href=\"https://youtu.be/wie1vkKeGwA\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://youtu.be/wie1vkKeGwA</a>.\n\n     During the interview, Brett and Mr. Baillargeon discussed the\nfollowing topics:\n\n     *  the GPOX business model of creating industry-specific GPOs compared\nto business models of traditional Group Purchasing Organizations and/or\nBuying Groups\n     *  leadership's focus on HealthGPO and further developing its business\nmodel\n     *  the Company's exiting stealth mode with a new sustainable and\ndisruptive business model\n     *  how GPOX achieved a significant milestone generating over $1\nMillion in revenue\n     *  the expansion of its Leadership team to include a new Chief\nFinancial Officer (CFO), Laurence Ruhe, and new President, Ron McCormick\n     *  the Company's $5 Million Equity Crowdfunding Offering is open for\nthe public and viewable at invest.gpoplus.com\n     *  why it's a good time for investors to look at GPOPlus+, ticker:\nGPOX\n\n     SPOILER ALERT! If you haven't watched Brett's interview yet, stop\nreading and watch it now!\n\n     The interview started with a description by Brett explaining the\ntypical business model of established GPOs and why he feels the GPOX\nbusiness model of creating industry-specific GPOs is better for our\ncompany. Brett said, \"Costco is to Consumers, what we (GPOX) is to\nbusinesses,\" providing an analogy that MoneyTV viewers could easily\nunderstand.\n\n     According to Brett, GPOX has been focusing on developing HealthGPO and\nhe explained the business model and how HealthGPO generates revenue. He\ncontinued by explaining how cbdGPO got started by initially aggregating the\npurchases of raw materials such as CBD isolate and distillate, expanding\nits product offering to white label and private label services.\n\n     He discussed launching future industry-based GPOs, using the analogy\nand similarity of how Amazon changed the buying habits of Consumers, GPOX's\nvision is to change the buying habits of businesses and save them more\nmoney.\n\n     Brett stated that GPOX exited from stealth mode with a \"fantastic\nbusiness model that's highly scalable across multiple GPOs in multiple\nindustries.\" Brett continued, \"we wanted to stay in stealth mode, develop\nthe business model, and go out and generate revenue.\" Also mentioning GPOX\nachieved a milestone of generating over $1 million in revenue.\n\n     He addressed questions about the expansion of the GPOX's new\nleadership team and provided a brief background, accomplishments, and\nachievements of the Company's new CFO, Laurence Ruhe, and new President and\nBoard Member, Ron McCormick.\n\n     in addition, Brett discussed GPOX's $5 Million Equity Crowdfunding\nOffering that's available to the public now. He went over the structure of\nthe Units in the offering and explained that each Unit is $1,500.00 and\nconsists of 1,000 common shares of GPOX stock valued at $1.50 per share and\na $2.00 bonus Warrant. To explain what a Warrant is in layman's terms, he\ncompared it to a \"coupon\" for investors to buy stock directly from the\ncompany at a fixed price of $2.00 per share, even if the stock is trading\nhigher.\n\n     He closed by encouraging viewers to visit the GPOX Crowdfunding page\non invest.gpoplus.com. The crowdfunding page has a lot of information on\nthe company, videos, and links to information on the offering.\n\n     Sign up for your FREE account on the GPOX Investor Relations Portal:\nOnce you Activate your GPOX Investor Account you will have immediate access\nto real time information available on GPOX. Sign up for alerts (email and\nSMS) to be the first to know about news, SEC Filings, Investor Events,\nupdated Investor Presentations, and more: www.GPOPlus.com/ir.\n\n     About MoneyTV + Donald Baillargeon\nThe MoneyTV Network was established in 1996 and now 25 years later and with\nover 1,000 original episodes, MoneyTV is the longest-running business\ntelevision program of its kind. MoneyTV is the internationally syndicated\ntelevision program all about money and what makes it happen, featuring\ninformative interviews with company CEOs and executives, providing insights\ninto their operations and outlooks for their futures. For more information\non MoneyTV, and Executive Producer and Anchor, Donald Baillargeon, please\nvisit the Company's website at <a href=\"http://moneytv.net\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://moneytv.net</a>. For a complete list of\ncontent partners and the global TV Listings,\n<a href=\"http://moneytv.net/global-tv-listing\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://moneytv.net/global-tv-listing</a>/.\n\n     Donald Baillargeon is a broadcast industry veteran of more than 30\nyears and is also the host of MoneyRap Radio, <a href=\"http://www.moneyrap.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.moneyrap.com</a>, and\nthe television program Crowdfund Television,\n<a href=\"http://www.crowdfundtelevision.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.crowdfundtelevision.com</a>.\n\n     About GPO Plus, Inc. (GPOX)\nHeadquartered in Las Vegas, Nevada, GPOPlus+ (OTCQB: GPOX) is a publicly\ntraded company of diversified industry-specific Group Purchasing\nOrganizations (GPOs).\n\n     Our Purpose is to create efficient GPOs and our Mission is to create\nvalue for our GPO Members, partners, and suppliers while creating long term\nshareholder value.\n\n     Our Mantra:\nWe Aggregate, Negotiate + Share!\n\n     *  Aggregate - We aggregate the purchasing power of our Members.\n     *  Negotiate - We leverage buying power to negotiate discounts.\n     *  Share - We share the discounts with our Members and save them\nmoney.\n\n     For more information, please visit www.GPOPlus.com. To activate your\nfree GPOX Investor Account at www.GPOPlus.com/ir.\n\n     Information about Forward-Looking Statements\nThis press release contains \"forward-looking statements\" that include\nstatements regarding expected financial performance and growth information\nrelating to future events. Forward-looking statements include statements\nwith respect to beliefs, plans, objectives, goals, expectations,\nanticipations, assumptions, estimates, intentions, and future performance,\nand involve known and unknown risks, uncertainties and other factors, which\nmay be beyond the control of the Company and its officers and managers, and\nwhich may cause actual results, performance or achievements to be\nmaterially different from future results, performance or achievements\nexpressed or implied by such forward-looking statements. Forward-looking\nstatements should not be read as a guarantee of future performance or\nresults and will not necessarily be accurate indications of the times at,\nor by which, that performance or those results will be achieved.\nForward-looking statements are based on information available at the time\nthey are made and/or management's good faith belief as of that time with\nrespect to future events and are subject to risks and uncertainties that\ncould cause actual performance or results to differ materially from those\nexpressed in, or suggested by, the forward-looking statements. Important\nfactors that could cause these differences include, but are not limited to;\ninability to gain or maintain licenses, reliance on unaudited statements,\nthe Company's need for additional funding, governmental regulation of the\ncannabis industry, the impact of competitive products and pricing, the\ndemand for the Company's products, and other risks that are detailed from\ntime-to-time in the Company's filings with the United States Securities and\nExchange Commission.  All statements other than statements of historical\nfact are statements that could be forward-looking statements. You can\ntypically identify these forward-looking statements through use of words\nsuch as \"may,\" \"will,\" \"can\" \"anticipate,\" \"assume,\" \"should,\" \"indicate,\"\n\"would,\" \"believe,\" \"contemplate,\" \"expect,\" \"seek,\" \"estimate,\"\n\"continue,\" \"plan,\" \"point to,\" \"project,\" \"predict,\" \"could,\" \"intend,\"\n\"target,\" \"potential,\" and other similar words and expressions of the\nfuture. The Company expresses its expectations, beliefs and projections in\ngood faith and believes that its expectations reflected in these\nforward-looking statements are based on reasonable assumptions. However,\nthere is no assurance that these expectations, beliefs and projections will\nprove to have been correct. Such statements reflect the current views of\nthe Company with respect to its operations and future events, and are\nsubject to certain risks, uncertainties and assumptions relating to its\nproposed operations, including the risk factors set forth herein. Should\none or more of these risks or uncertainties materialize or should the\nunderlying assumptions prove incorrect, the Company's actual results may\nvary significantly from those intended, anticipated, believed, estimated,\nexpected or planned. In light of these risks, uncertainties and\nassumptions, any favorable forward-looking events discussed herein might\nnot be realized and occur. The Company has no obligation to update or\nrevise its forward-looking statements, whether as a result of new\ninformation, future events or otherwise. For a more detailed description of\nthe risk factors and uncertainties affecting GPO Plus, Inc. GPOX, please\nrefer to the Company's recent Securities and Exchange Commission filings,\nwhich are available at www.sec.gov. The Company undertakes no obligation to\npublicly update or revise any forward-looking statements, whether as a\nresult of new information, future events, or otherwise.\n\n GPOPlus+'s\n\n Contact Information:\n\n Contact:\n\n Investor Inquiries:\n Brett H. Pojunis, CEO\n Email: ir@gpoplus.com\n Shareholder's Line: 855.935.GPOX (4769)\n\n MoneyTV Contact:\n\n Investor Inquiries:\n Donald Baillargeon, Executive Producer\n Email: info@moneytv.net\n Shareholder's Line: 949.388.5267\n\nWWW   : <a href=\"https://www.gpoplus.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.gpoplus.com</a>    GPO PLUS INC\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134300281.MNPRE2134301150-10474420211210</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}