{"date": "2021-11-24 23:30:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3580.04, "close": 3504.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Repeats story. No change to text</p><p class=\"tr-by\">By Aditya Kalra</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW DELHI, Nov 24 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> has asked India's Supreme Court to pause an expedited review of allegations that the U.S. firm concealed information while seeking antitrust clearance for a 2019 deal with India's Future Group, legal papers seen by Reuters showed.</p><p>The Competition Commission of India (CCI) in June <a href=\"https://reut.rs/3I1MJ4r\" data-type=\"url\" class=\"tr-link\" translate=\"no\">accused Amazon of concealing facts</a> and making false submissions when it sought approval for the $200 million investment into a Future unit in 2019, a deal that is now at the heart of protracted legal <a href=\"https://reut.rs/3BV0tJG\" data-type=\"url\" class=\"tr-link\" translate=\"no\">disputes between the two sides</a>.</p><p>Amazon told Reuters at the time that it was confident of addressing the watchdog's concerns.</p><p>The Supreme Court approach by Amazon comes as the CCI on Wednesday held a closed-door hearing where the U.S. firm's lawyers declined to argue and explain their position on the matter, saying they had asked the top court to pause the process.</p><p>The watchdog noted in an internal document - seen by Reuters - that it had decided to give no extensions to the company to explain its position and will now issue an order in due course.</p><p>Amazon and the CCI did not immediately respond to a request for comment.</p><p>The CCI decision is critical to Amazon's legal challenges. If the CCI rules against Amazon and revokes the 2019 approval, it could have wide-ranging ramifications on the U.S. firm's ongoing legal battle with Future, people familiar with the case say.</p><p>That's because Amazon has so far successfully used the 2019 Future unit deal to argue breach of certain contracts when the Indian company announced plans to sell its retail assets to rival Reliance Industries <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RELI.NS\" data-type=\"ric\" data-ric=\"RELI.NS\" translate=\"no\" dir=\"ltr\">RELI.NS</a> for $3.4 billion last year.</p><p>Future, which denies any wrongdoing, accuses Amazon of illegally interfering in its business decisions and derailing a potential deal without which it says it will face liquidation.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Aditya Kalra in New Delhi; Editing by Emelia Sithole-Matarise)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:aditya.kalra@tr.com\" data-type=\"email\" translate=\"no\">aditya.kalra@tr.com</a> ; +91-11-49548021; Twitter <a href=\"https://twitter.com/adityakalra\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/adityakalra</a>; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON-INDIA/FUTURE-RELIANCE (REPEAT, PIX)</p></div>"}