{"date": "2021-12-15 00:09:08+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Updates to add five families sheltering together</p><p class=\"tr-by\">By Julio-Cesar Chavez and Richa Naidu</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">MAYFIELD, Ky., Dec 14 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Clean-up crews in western Kentucky's devastated communities on Tuesday ramped up their Herculean task of carting away mountains of debris left by last week's killer tornadoes as survivors huddled together for warmth and support.</p><p>In the hard-hit city of Mayfield, five families bunked together at the home of Reina Guerra Perez, swaddled in donated blankets and cooking on a fire built with scavenged wood. </p><p>\"We're cooking out back using the wood from fallen trees and keeping food warm as best we can,\" she said. Her house survived, but the 26 people seeking shelter there on Tuesday had no access to running water or electricity.</p><p>   The search for bodies beyond the 74 known fatalities came up empty on Tuesday. The tornadoes' victims included more than a dozen children, Beshear said, among them a 2-month-old infant. The oldest to die was 98 years old, he said. </p><p>\"I still expect that we will find some more bodies. There is just so much destruction,\" Governor Andy Beshear said at a briefing, adding that more than 100 people were missing and eight victims were unidentified.</p><p>Another 14 people died in four other states: six at an Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> warehouse in Illinois, four in Tennessee, two in Missouri and two in Arkansas. </p><p>More than 100 people were working at a candle factory in Mayfield, Kentucky, when the storm, which Beshear said \"will probably be one of the most devastating tornado events in U.S. history,\" reduced the plant to rubble. Eight people were killed, far less than initially feared.  </p><p>\"If you saw it in person, you would believe that's a miracle,\" Beshear said of the fact that more people were not killed.</p><p>Hundreds National Guard service members were searching for victims and survivors, clearing roads and providing police services, Beshear said.</p><p>As work crews removed the remains of leveled cities and towns one truckload at a time, the governor said the cleanup would help communities begin to heal. </p><p>\"There is something therapeutic about taking that chaos and destruction and death and getting it out of some of those areas,\" said Beshear. </p><p>President Joe Biden plans to visit on Wednesday. He declared a major federal disaster in Kentucky on Sunday.</p><p>Many of the victims' relatives started the emotionally trying ordeal of making funeral arrangements.</p><p>Carla Cope, whose 29-year-old son Clayton, a U.S. Navy veteran, was among the six Amazon workers, said the company has offered to pay for the arrangements. </p><p>An Amazon spokesman declined to confirm that the company was picking up the funeral expenses but said it was sending workers an array of supplies and services, including food and water.</p><p>U.S. workplace safety regulators are investigating the circumstances around the <a href=\"https://www.reuters.com/world/us/investigation-into-amazoncom-illinois-building-collapse-opened-labor-official-2021-12-13\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon warehouse collapse</a>.</p><p><br/></p><p>'HE HAD A HUGE HEART'</p><p>Clayton Cope loved his dog, video games and hunting and fishing with his father, his mother said.</p><p>\"He was a really quirky kid with a great sense of humor and he had a lot of friends,\" she said. \"He drew people to him and he had a huge heart.\" </p><p>The disaster has also produced an <a href=\"https://www.reuters.com/markets/commodities/help-arrives-kentucky-with-stew-chain-saws-place-stay-2021-12-14\" data-type=\"url\" class=\"tr-link\" translate=\"no\">outpouring of volunteers</a>.</p><p>At lunchtime on Tuesday, hundreds of people converged on Mayfield-Graves County Fairgrounds, where a loosely organized group of volunteers with food trucks came from hundreds of miles away to provide free meals. The area has become a magnet for a range of relief efforts.</p><p>Coordinating the lunch rush was Daniel Oxnard, 42, a student, who started things off on Saturday when he drove his van packed with food and cooking gear more than 200 miles (320 km) and served 1,000 meals. Since then, others joined in, including Amish volunteers from Tennessee, he said. </p><p>“They come here every day with a trailer-load of food and two full griddles and they just cook their hearts out,” he said.</p><p>By Tuesday afternoon, 18,000 Kentucky homes and businesses still lacked power, according to PowerOutages.us, more than four days after the tornadoes surprised people by striking unusually late in the year. Insured losses from the swarm of tornadoes could total <a href=\"https://www.reuters.com/markets/commodities/deadly-us-tornadoes-cost-insurers-about-3-bln-kcc-2021-12-14\" data-type=\"url\" class=\"tr-link\" translate=\"no\">up to $5 billion</a><span class=\"tr-strong\">, </span>industry experts said on Tuesday.</p><p>More than 300 people in Kentucky, as well as in Arkansas and Tennessee, were being housed in Red Cross shelters, and that number is expected to grow. Hundreds more have been placed temporarily in resorts at area state parks, Kentucky Red Cross Chief Executive Steve Cunanan said.</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Cheney Orr and Julio Cesar-Chavez in Mayfield, Kentucky, and Brendan O'Brien and Richa Naidu in Chicago; Writing by Peter Szekely in New York and Sharon Bernstein in Sacramento, California; Editing by Lisa Shumaker, David Gregorio and Cynthia Osterman)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Peter.Szekely@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Peter.Szekely@thomsonreuters.com</a> ; (646) 223-5302; Reuters Messaging: @peszeke))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-WEATHER/TORNADOES (UPDATE 4, PIX, TV)</p></div>"}