{"date": "2021-12-25 08:46:48.678000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3421.37, "close": 3413.22}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Four months after launching his Amazon delivery franchise, former Baltimore Raven Jason Murphy realized a significant obstacle to hiring drivers for his 50-van fleet called Delivery 101. Many potential recruits - he estimates a third - could not be hired because they failed a required background check and a drug screen.</p><p>That's when he decided to find new ways to make them eligible, including working to get their records expunged.</p></div><div class=\"tr-npp-body\"><p>\"Obviously, we can't hire someone who's had multiple DUI convictions or serious theft charges, because the nature of the job is driving and handling merchandise, but there's no reason why we can't be a place to open as many doors as possible for returning citizens because we know that stable employment is a big part of breaking the cycle of poverty,\" said Murphy, a Baltimore native and retired offensive lineman who finished his playing career with the Ravens in 2011.</p><p>Murphy, 39, used the same resilience and grit that made him a workhorse on the playing field to solve the problem. The Owings Mills resident now staffs the table at employment fairs that also offer to expunge the records of potential employees. For potential hires who still cannot pass Amazon's background check, Murphy tries to bring them on for jobs at one of his other businesses. (Amazon founder Jeff Bezos owns The Washington Post.)</p><p>\"We're finding a way to remove a barrier. We're making sure we're staying compliant,\" he said. \"There's always a side door. Or there is a fence.\"</p><p>Murphy believes in giving people a second chance. He remembers a high school English teacher allowing him to retake a failed test as a turning point in his life.</p><p>\"That changed my life and helped me,\" he said. \"I turned my grades around and I was able to go to college and receive a [football] scholarship to Virginia Tech.\"</p><p>Murphy also believes helping the formerly incarcerated is good business. More than 10 percent of his delivery business's 87 employees have had their records expunged. None of those employees have been terminated, Murphy said.</p><p>Alicia Wilson, the vice president for economic development at Johns Hopkins University and Johns Hopkins Health System, has known Murphy for five years and has worked with him for the past year at various expungement fairs.</p><p>At these fairs, individuals with criminal records meet with attorneys to prepare petitions for the court to permanently remove criminal charges or convictions from their record.</p><p>Wilson said she was struck by the fact that Murphy personally attends these fairs.</p><p>\"He talks to individuals who moments ago had a weight lifted off their lives. He embraces them in a way of welcoming them back to work in our society in a meaningful way,\" Wilson said.</p><p>During the most recent expungement fair held in September at Johns Hopkins at Eastern, Murphy hired 10 attendees to work at his Amazon franchise.</p><p>Amazon appears to be moving in the direction of loosening its background requirements, which include a criminal-background check, motor vehicle record check, and a four-panel drug test. The company announced in June that it would exclude marijuana from some of its preemployment drug screening.</p><p>\"Preemployment marijuana testing has disproportionately affected communities of color by stalling job placement and, by extension, economic growth,\" Amazon spokeswoman Emily Hawkins said in an email.</p><p>Medical marijuana use is legal in Maryland, but full legalization is several steps away. Maryland's General Assembly will consider a bill in its next session early next year to put the matter to voters in a referendum next fall.</p><p>One of the people Murphy has hired is Craig Smoot, who was convicted of armed robbery in the late 1980s when he was in his 20s. He served 2 1/2 years in prison and is no longer on probation.</p><p>\"That was a spot on me. People look at that,\" said Smoot, 55. \"You're still going to judge me for that. I can still be questioned about my past. We are people, too.\"</p><p>The Edmondson Village resident credits Murphy with making him financially sound this holiday season. He plans to use the money he's making to purchase gifts for his three daughters and eight grandchildren.</p><p>\"It's knowing that I can celebrate Christmas. It's about giving back,\" he said as he loaded up the back of his van for his day's deliveries. \"My family has helped me so much.\"</p><p>With an attendance incentive, new employees at Murphy's delivery franchise make $20.50 an hour, well above Maryland's minimum wage of $11.75 an hour.</p><p>Troy Taylor, a 23-year-old Rosedale resident, spent two years working temporary jobs and delivering food to make ends meet. A past drug distribution conviction made him essentially unemployable. That was until he met Murphy, who hired him after meeting him at an expungement fair.</p><p>\"It makes a big difference,\" Taylor said about the job with Murphy's company. \"I'm beginning to enjoy life. It was frustrating, but I got through it. Everybody deserves a second chance.\"</p><p>Taylor said he enjoys the work and drives \"hundreds\" of miles a day, delivering as many as 70 to 100 packages along the way. Murphy's franchise delivers packages throughout Maryland, primarily from Ellicott City and Woodbine in Howard County to parts of Carroll County and Gaithersburg in Montgomery County.</p><p>Murphy, who was born the youngest of five children and raised in Southwest Baltimore's Uplands neighborhood, played six years in the NFL - including three years with the Tennessee Titans and one with the Ravens - before retiring and switching his attention to business endeavors. He owns five businesses - including the delivery franchise - that range from a construction company and a sports gaming technology company to hosting football camps.</p><p>He graduated from Edmondson High School, where he now works with the school's automotive mechanic program to help service some of his delivery vans. His mother worked for a glass manufacturer, and his father worked as a diesel mechanic for Baltimore City. His current office is in City Garage, the same building where his father worked in Port Covington.</p><p>Murphy, a first-generation college student, has a bachelor's degree in real estate and property management. He attributes his entrepreneurial spirit to knowing that his football career would not last forever.</p><p>\"The whole time I was playing, I knew it was temporary. My goal was to reinvent myself,\" said Murphy, who spent family vacations during his professional playing career reading autobiographies and books written by successful Black entrepreneurs such as the late Baltimore businessman Reginald F. Lewis, music mogul Jay-Z and Robert Johnson, the founder of Black Entertainment Television. \"I always understood that football was going to be a springboard.\"</p><p>Nick Mosby, president of the Baltimore City Council, has known Murphy for five years. He said that having business leaders like Murphy is essential to Baltimore's success.</p><p>\"His story is fascinating,\" Mosby said. \"He's a kid who grew up in Baltimore and did well. He played in college and became drafted in the NFL and returned to this hometown to give back.\"</p><p>Following Murphy's example of working to expand the hiring pool is important for the city, Mosby said.</p><p>\"How do we change the negative outcomes that we see on a regular basis in Baltimore? It is through a paradigm shift,\" Mosby said. \"Hopefully it will lead to employment with these types of jobs. As we continue to empower, it provides an overall better outcome for the city.\"</p><p>Murphy is not limited to assisting others when it comes to employment.</p><p>Murphy, who is the former president of the Maryland chapter of the NFL Players Association, also has championed the Amazon Delivery Service Partner Program to other retired players. Murphy has mentored and helped former players navigate the process of buying a franchise.</p><p>Bart Scott, a former Ravens linebacker and current ESPN host, has owned an Amazon delivery franchise in New Jersey for a year. He credits Murphy with helping him navigate the process of owning his own fleet of delivery vans.</p><p>\"I respect the hustle. He was always resourceful. You feel better when you talk to each other. He's a wholehearted person,\" Scott said. \"Him coming to me - and he vetted it - means a lot.\"</p><p>Scott said he applauds Murphy for helping those with records, which is something he is exploring with his franchise.</p><p>\"These things shouldn't stop people from getting a job,\" Scott said.</p><p>Murphy said he has helped four other retired players apply for and receive Amazon franchises and advised three others on the process.</p><p>\"It's a long process. It's coaching them up,\" he said. \"I've seen people getting skipped over and having a missed opportunity. It's about giving someone a chance that can change their life.\"</p><p>- Baltimore Sun</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 The Washington Post</p></div>"}