{"date": "2022-01-20 15:41:30.307000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>GLOBEX DATA LTD (\"SWIS-Z;SWISF-0\")\n- Extends Sponsorship of The Epoch Times YouTube Programs\n- theeopchtimes.com - Reaching Over 1.35 million Followers\n- of Roman Balmakov, and Joshua Philipp\n\n     GlobeX Data Ltd. (\"GlobeX\" or the \"Company\"), the leader in Swiss\nhosted secure communications and secure data management, is pleased to\nannounce that, as part of its US mass marketing strategy to bring awareness\nto GlobeX Data's Sekur solution, it is sponsoring over 160 YouTube episodes\nof The Epoch Times with hosts Roman Balmakov, and Joshua Philipp, in\naddition to sponsorships of the Spanish language episodes of \"China En\nFoco\" hosted by Julian Bertone. The sponsorship is part of a blended\nbranding and marketing budget of US$2,200,000 (CA$2,750,000) for the fiscal\nyear 2022.\n\n     The sponsored ads describe Sekur's attributes as the leading Swiss\nhosted Privacy and Security communications application, such as encrypted\nemail and secure messaging, without any data mining, including Sekur's\nunique proprietary feature called Chats-by-invites, letting a Sekur user\nmessage a non-Sekur user, without the recipient having to download Sekur,\nand Sekur's SekurSend and SekurReply technology, letting a Sekur user email\na non Sekur users round trip without the recipient having to register for\nSekur, and without the recipient's ISP being able to read the email\nreceived.\n\n     The sponsored programs continuing are, Facts Matter with Roman\nBalmakov, Crossroads with Joshua Philipp and China En Foco with Julian\nBertone. Additionally, followers will benefit from a 25% discount Promo\ncode for the first 5 years of subscription to Sekur at the time of signup.\n\n     About the programs, according to The Epoch Times:\n\n     Facts Matter with Roman Balmakov\n\n     As America moves into uncharted waters, it's incredibly important for\npeople to have an honest source of news because right now, what this\nrepublic needs more than anything else, are informed citizens who are\ngrounded in facts. Facts Matter investigates complex issues, and then\npresents the findings in a way that is easy to understand. Facts Matter has\n737K subscribers and has gained over 26,143,192 video views since the\nchannel being established on YouTube Nov 2020.\n\n     Crossroads with Joshua Philipp\n\n     Crossroads is a channel from The Epoch Times. Joshua Philipp is an\naward-winning investigative reporter, and an expert on issues including\nideological subversion, front operations, disinformation, unrestricted\nwarfare, cyber security and the historical roots of issues seen on the\nsurface of today's politics and culture. Crossroads has 616K subscribers\nand has gained over 74,716,420 video views since the channel being\nestablished on YouTube in Mar 2019.\n\n     According to The Epoch Times, The Epoch Times has received numerous\nawards for our reporting and design, including from the New York Press\nAssociation, the Society of Professional Journalists, and the Society for\nNews Design. The Epoch Times national print readership is over 1 million,\nand theepochtimes.com website monthly pageviews is 110 million. The Epoch\nTimes' media network currently covers 21 languages and 33 countries.\n\n     Alain Ghiai, CEO of GlobeX Data said: \"We are excited to continue the\nsponsored YouTube episodes on The Epoch Times as we continue our marketing\nawareness program in the United States. The Epoch Times' target audience is\na perfect match for Sekur and we look forward to gaining traction in\nsubscribers from this media push. The results received in 2021 were very\nsatisfactory, and we have decided to continue and increase the sponsorship\nprogram, as we believe that once we launch our new SekurMail application in\nlate March, we anticipate a higher retention rate than what we have today.\nThe Epoch Times' audience will come to know the many unique and critical\nfeatures provided by Sekur, such as, Swiss hosted data privacy and\nsecurity, and the right for consumers and businesses not to have their data\nmined by third party service providers or Big Tech companies. As we are not\nconnected, and never have been connected, to AWS, Microsoft Azure or Google\nCloud platforms, commonly referred to as \"Big Tech\", we can offer a truly\nindependent, private and secure means of communications such as secure and\nprivate emails and instant messaging. We are looking forward to offer true\ndata privacy and no data mining to all Americans and we look forward to\ntell our story on The Epoch Times network.\"\n\n     Sekur, which includes SekurMessenger as part of a bundle of email,\nmessaging and file transfer into one app solutions, includes the Company's\nlatest SekurMail technology, which includes proprietary anti-phishing and\nprivacy feature called SekurSend(R). SekurSend(R) lets a user send an email\nto any other recipient, whether they have Sekur or not, in full privacy and\nsecurity as the email never leaves Sekur's encrypted email servers based in\nSwitzerland. The recipient can then click on the notification and reply in\nthe same manner using SekurReply(R), without the recipient having to\nregister for a Sekur account. The sender can also decide to protect any\nemail sent by adding a password to open it, a read-limit and a\nself-destruct timer as well. Sending an email with the SekurSend(R) feature\nallows the senders and recipients to add limitless size attachments to the\nemails without crowding the recipients' email box. This also eliminates BEC\nattacks for businesses and email phishing attacks. Additionally, SekurMail\nincludes full control of email delivery, automatic data export for large\nEnterprises and an automatic Data Loss Prevention technology (\"DLP\") with\nreal time continuous archiving.\n\n     Recent data breaches in messaging applications and in particular in\nthe WhatsApp application have created a certain urgency for businesses and\ndata privacy advocates to protect their communications form cyber-attacks\nand identity theft via mobile and desktop devices.\n\n     SekurMessenger eliminates many of the privacy and security risks by\nnot only not requiring a phone number, which would divulge a user's phone\ndevice ID, but also by not social engineering a user's phone or computer\ncontact list and infecting the contacts by default as well, eliminating a\nhuge loophole in security and privacy. SekurMessenger issues each user a\nusername and a SM number. The SM number is the contact ID a user would\ndisclose in order for other SM users to be added. The service comes with a\nself-destruct timer and other features as well, including GlobeX's\nproprietary VirtualVaults and HeliX technologies with all data stored in\nSwiss hosted encrypted servers.\n\n     Additionally, SekurMessenger now comes with a proprietary feature and\ntechnology called Chat by Invites. This feature allows a SekurMessenger\nuser (\"SM user\") invite a non-SM user, or a group of non-SM users, to chat\nin a fully private and secure way, without the recipient ever having to\nregister to SekurMessenger or download the app. At the end of the chat, the\ninitiator of the conversation can remotely terminate the conversation and\nall traces of the conversation are deleted from all users, including the\nrecipient. This unique feature is now fully deployed and functional on all\niOS and Android devices and web platforms. The target sectors are numerous,\nincluding but not limited to real estate, legal, financial, government,\nenergy, mining, manufacturing, trade and medical sectors.\n\n     GlobeX's Data privacy solutions are all hosted in Switzerland,\nprotecting users' data from any outside data intrusion requests. In\nSwitzerland, the right to privacy is guaranteed in article 13 of the Swiss\nFederal Constitution. The Federal Act on Data Protection (\"FADP\") of 19\nJune 1992 (in force since 1993) has set up a strict protection of privacy\nby prohibiting virtually any processing of personal data which is not\nexpressly authorized by the data subjects. The protection is subject to the\nauthority of the Federal Data Protection and Information Commissioner.\n\n     Under Swiss federal law, it is a crime to publish information based on\nleaked \"secret official discussions.\" In 2010 the Federal Supreme Court of\nSwitzerland found that IP addresses are personal information and that under\nSwiss privacy laws they may not be used to track Internet usage without the\nknowledge of the individuals involved.\n\n     About GlobeX Data Ltd.\n\n     GlobeX Data Ltd. is a Cybersecurity and Internet privacy provider of\nSwiss hosted solutions for secure communications and secure data\nmanagement. The Company distributes a suite of encrypted e-mails, secure\nmessengers, secure communication tools, and secure cloud-based storage,\ndisaster recovery, document management, . GlobeX Data Ltd. sells its\nproducts through its approved wholesalers and distributors, and\ntelecommunications companies worldwide. GlobeX Data Ltd. serves consumers,\nbusinesses and governments worldwide.\n\n     On behalf of Management\nGLOBEX DATA LTD.\nAlain Ghiai\nPresident and Chief Executive Officer\n+1.416.644.8690\ncorporate@globexdatagroup.com\n\n     For more information, please contact GlobeX Data at\ncorporate@globexdatagroup.com or visit us at <a href=\"https://globexdata.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://globexdata.com</a>.\nFor more information on Sekur visit us at: <a href=\"https://www.sekur.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.sekur.com</a>.\n\n     Forward Looking Information\n\n     This news release contains certain forward-looking information within\nthe meaning of applicable Canadian securities laws (\"forward-looking\nstatements\"). All statements other than statements of present or historical\nfact are forward-looking statements. Forward-looking statements are often,\nbut not always, identified by the use of words such as \"anticipate\",\n\"achieve\", \"could\", \"believe\", \"plan\", \"intend\", \"objective\", \"continuous\",\n\"ongoing\", \"estimate\", \"outlook\", \"expect\", \"project\" and similar words,\nincluding negatives thereof, suggesting future outcomes or that certain\nevents or conditions \"may\" or \"will\" occur. These statements are only\npredictions. These statements reflect management's current estimates,\nbeliefs, intentions and expectations; they are not guaranteeing future\nperformance. GlobeX cautions that all forward-looking statements are\ninherently uncertain and that actual performance may be affected by a\nnumber of material factors, many of which are beyond GlobeX's control. Such\nfactors include, among other things: risks and uncertainties relating to\nthe future of the Company's business; the success of marketing and sales\nefforts of the Company; the projections prepared in house and projections\ndelivered by channel partners; the Company's ability to complete the\nnecessary software updates; increases in sales as a result of investments\nsoftware development technology; consumer interest in the Products; future\nsales plans and strategies; reliance on large channel partners and\nexpectations of renewals to ongoing agreements with these partners;\nanticipated events and trends; the economy and other future conditions; and\nother risks and uncertainties, including those described in GlobeX's\nprospectus dated May 8, 2019 filed with the Canadian Securities\nAdministrators and available on www.sedar.com. Accordingly, actual and\nfuture events, conditions and results may differ materially from the\nestimates, beliefs, intentions and expectations expressed or implied in the\nforward-looking information. Except as required under applicable securities\nlegislation, GlobeX undertakes no obligation to publicly update or revise\nforward-looking information.\n\nTel   : 416-644-8690    GLOBEX DATA LTD\nWWW   : <a href=\"https://www.globexdatagroup.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.globexdatagroup.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201900513.MNPRE2201901949-07102720220120</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}