{"date": "2022-01-01 22:35:41.521000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3334.34, "close": 3350.44}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>We reported the story of an Amazon Alexa advising a 10-year-old to touch the exposed prongs of a plug with a coin as a \"challenge\", saying the smart speaker had told the child to \"electrocute\" herself. People do use \"electrocute\" to mean \"give someone an electric shock\", but as Richard Thomas wrote to remind us, its primary meaning is \"kill by electric shock\". The word is derived from \"execute\". Bad though the device's advice was, it is not clear that it was suggesting the child kill herself.</p><p><span>Three strikes:</span> In our report of comments made by John Major that have just been made public, we said the prime minister was speaking in a meeting in February 1992 with \"the newly-elected Taoiseach Albert Reynolds and other senior Irish ministers\". First, there is no need for a hyphen after a word ending in \"–ly\": that ending acts as a link, joining itself to the next word. Second, our style is to give the name first and then the description, although this isn't a strict rule. Third, we call the taoiseach (who would have a lower-case \"t\" anyway) the Irish prime minister. So that meeting should have been with \"Albert Reynolds, the newly elected Irish prime minister, and other senior Irish ministers\".</p></div><div class=\"tr-npp-body\"><p><span>Cee facts:</span> In a round-up of some of the best music of 2021, we wrote: \"Having experienced one of the fastest ascensions of any UK rapper in recent years, Central Cee now has his eyes fixed firmly on the global stage.\" Thanks to Philip Nalpanis for pointing out that \"ascension\" is the form of the word \"ascent\" that is usually reserved for Jesus. Even allowing for the hyperbole of music journalism, or for John Lennon's description of the Beatles as \"bigger than Jesus\", I don't think that we meant to rank Mr Cee that highly.</p><p><span>Far side:</span> Philip also pointed out that in \"home news in brief\" we reported a murder in east London, and said that the story then moved to \"the other side of the country in ... Tyne and Wear\". He said that is \"the other end of the country\", not the other side, which would be on the west. I cannot disagree.</p><p><span>Not not not:</span> We tripped up on a triple negative in an article about the UK's economic recovery from the pandemic: \"That does not mean that it is untrue, as the government often states, that the UK is not going to experience fast growth in the next couple of years.\" Thanks to Paul Edwards for pointing out that this is easier to understand if we take out the second and third negatives, substituting \"true\" for \"untrue\" and deleting the second \"not\".</p><p><span>Ever onward:</span> We used \"going forward\" a couple of times last week. In a commentary on cricket we complained that the England Cricket Board failed to value first class cricket sufficiently, and added: \"That will only worsen going forward.\" Thanks to Mick O'Hare for reporting that one to the authorities.</p><p>And in a report of the comments of Daisy Cooper, who you may have forgotten is the deputy leader of the Liberal Democrats, we said her description of a formal pact with the Labour Party as \"counterproductive\" offered \"a glimpse of the Liberal Democrats' electoral strategy going forward\".</p><p>Delete. Get rid. Expunge. There is never any need for those two words in that order.</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/independentpremium/voices/new-year-resolution-2022-b1985301.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Opinion: How to help achieve your new year resolutions</a> </p><p><a href=\"https://www.independent.co.uk/independentpremium/voices/labour-keir-starmer-jeremy-corbyn-b1985277.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Opinion: Labour's had a good few months and now supporters must put differences aside</a> </p><p><a href=\"https://www.independent.co.uk/independentpremium/voices/how-did-jeffrey-epstein-make-money-rich-b1984865.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">How exactly did Jeffrey Epstein make his money?</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 Independent, The (UK) (Online). All rights reserved.</p></div>"}