{"date": "2021-12-01 19:51:02.531000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Fannie Mae Uses AWS to Keep Families in their Homes and Expand Homeownership for First-Time Homebuyers</b>\n</p><p class=\"bwalignc\">\n<span>Leading source of financing for U.S. mortgages uses AWS technology to enhance IT security and develop new ways to serve America’s homeowners and renters for decades to come</span>\n</p><p>\nToday, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), announced that Fannie Mae, a leading source of financing for mortgages in the U.S., is using AWS to help solve the biggest challenges in housing. Fannie Mae uses the breadth and depth of AWS capabilities, including machine learning, analytics, and high performance and serverless computing to automate processes, enhance IT security, and innovate new services that facilitate equitable and sustainable access to homeownership and quality affordable rental housing across America.\n</p><p>\nFannie Mae is migrating IT workloads from on-premises data centers to AWS to increase IT agility and resiliency, and accelerate the introduction of new services for lenders and homeowners. By moving internal systems and customer-facing workloads to the cloud, Fannie Mae has the flexibility to quickly respond to external challenges like the COVID-19 pandemic and roll out new programs to help keep millions of borrowers and renters in their homes. For instance, Fannie Mae was able to deploy its forbearance program into production faster using AWS, initiating 1.4 million single-family forbearance plans since March 2020. With Amazon Kinesis (AWS’s real-time, fully managed, and scalable platform for streaming data) and Amazon Aurora (AWS’s relational database built for the cloud) Fannie Mae can ingest, process, and analyze a greater volume of data faster to accelerate the introduction of new services and scale to meet the unprecedented increase in borrower demand.\n</p><p>\nFannie Mae uses AWS analytics services to process structured and unstructured data, including Amazon EMR (AWS’s industry-leading cloud big data service for processing vast amounts of data using open-source tools), to deliver insights from data and take steps to responsibly expand access to mortgage credit. Based on these insights, Fannie Mae launched a new feature in Desktop Underwriter®, an industry-leading, automated underwriting engine that helps lenders efficiently complete credit risk assessments to establish home loan eligibility, to incorporate consumers’ timely rent payments in the mortgage underwriting process, which is helping more first-time homebuyers qualify for a mortgage. Fannie Mae also built its enterprise data lake on Amazon Simple Storage Service (Amazon S3) to support more than 3,000 datasets and 100 applications, achieving faster time to market with innovative automated products. Now, using Amazon Redshift (AWS’s cloud data warehouse), Fannie Mae can quickly analyze external data from a variety of sources to understand key housing market indicators and trends, and scale insights across its operations.\n</p><p>\n“Fannie Mae is working to solve the biggest challenges in housing. We are accelerating the digital transformation of our business to make it safer, simpler, and less expensive for lenders to originate a mortgage. Our ability to innovate directly improves our ability to meet our housing mission by making it more equitable and affordable to buy or rent a home,” said Kimberly H. Johnson, Executive Vice President and Chief Operating Officer, Fannie Mae. “AWS enables Fannie Mae’s ongoing digital transformation, and we rely on their innovative technology and cloud services to drive positive change in our industry.”\n</p><p>\n“Fannie Mae’s digital transformation with AWS is reinventing housing finance and lowering the barriers to affordable home rental and ownership for people and families across the U.S.,” said Matt Garman, Senior Vice President of Sales and Marketing at Amazon Web Services, Inc. “With AWS as a strategic cloud provider, Fannie Mae can drive resiliency in their operations, respond quickly to housing market dynamics, and innovate new services to make the mortgage process easier.”\n</p><p>\n<strong>About Amazon Web Services</strong>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com&amp;esheet=52542669&amp;newsitemid=20211201005137&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=1&amp;md5=0f0a577e30c135c16c3518c932e1a94c\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<strong>About Amazon</strong>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Famazon.com%2Fabout&amp;esheet=52542669&amp;newsitemid=20211201005137&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=2&amp;md5=383d65b22098e0fd696407b37307559d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p>\n<strong>About Fannie Mae</strong>\n</p><p>\nFannie Mae helps make the 30-year fixed-rate mortgage and affordable rental housing possible for millions of people in America. We partner with lenders to create housing opportunities for people across the country. We are driving positive changes in housing finance to make the home buying process easier, while reducing costs and risk. To learn more, visit:\n</p><p>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.fanniemae.com%2F&amp;esheet=52542669&amp;newsitemid=20211201005137&amp;lan=en-US&amp;anchor=fanniemae.com&amp;index=3&amp;md5=3f411b33b7128256ca168dcdb63d5791\" data-type=\"url\" class=\"tr-link\" translate=\"no\">fanniemae.com</a> | <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Ftwitter.com%2Ffanniemae&amp;esheet=52542669&amp;newsitemid=20211201005137&amp;lan=en-US&amp;anchor=Twitter&amp;index=4&amp;md5=7c914ed925f4f379c7d0fb90bc6ddcc1\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Twitter</a> | <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.facebook.com%2Ffanniemae&amp;esheet=52542669&amp;newsitemid=20211201005137&amp;lan=en-US&amp;anchor=Facebook&amp;index=5&amp;md5=a1bfc7d1e4725276d01ea66c96981618\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Facebook</a> | <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Ffannie-mae-corporation_19722%2F&amp;esheet=52542669&amp;newsitemid=20211201005137&amp;lan=en-US&amp;anchor=LinkedIn&amp;index=6&amp;md5=40776a68acc9dabf481639efa0ad9b15\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LinkedIn</a> | <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.instagram.com%2Fofficialfanniemae%2F&amp;esheet=52542669&amp;newsitemid=20211201005137&amp;lan=en-US&amp;anchor=Instagram&amp;index=7&amp;md5=37c040937e88992b355b4e7772019501\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Instagram</a> | <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.youtube.com%2Fuser%2FFannieMaeWeb&amp;esheet=52542669&amp;newsitemid=20211201005137&amp;lan=en-US&amp;anchor=YouTube&amp;index=8&amp;md5=83b99b2a87655eefb51d580056f887de\" data-type=\"url\" class=\"tr-link\" translate=\"no\">YouTube</a> | <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.fanniemae.com%2Fresearch-insights%2Fperspectives&amp;esheet=52542669&amp;newsitemid=20211201005137&amp;lan=en-US&amp;anchor=Blog&amp;index=9&amp;md5=c42fb73372cf3ecfc34dff17311ee208\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Blog</a>\n</p><p><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211201005137/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211201005137/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52542669&amp;newsitemid=20211201005137&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=10&amp;md5=326770d533b5dabc2a8dbf7b198d1027\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON-WEB-SERVICES</p></div>"}