{"date": "2021-11-30 14:42:08.324000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>FLOW BEVERAGE CORP (\"FLOW-T;FLWBF-0\")\n- Alkaline Spring Water Becomes the Official Water of New York Road\n- Runners and the New York City Marathon\n\n    Flow Beverage Corp. (\"Flow\") announced that Flow Alkaline Spring Water\nis now the Official Water of the TCS New York City Marathon, United\nAirlines NYC Half, and other related events, through a four-year agreement\nwith New York Road Runners (\"NYRR\"), a non-profit organization with a\nmission to inspire people through running.\n    Flow's CEO, Maurizio Patarnello, said, \"The New York City Marathon is\none of the foremost sporting events in the world, with 50,000+ runners per\nyear historically, and millions of spectators watching in-person and\nworldwide. We are thrilled that NYRR chose Flow as the Marathon's Official\nWater. Flow Alkaline Spring Water will provide healthy hydration to runners\nat these events thanks to its optimum balance of minerals and electrolytes.\nMoreover, Flow's renewable mostly plant-based pack will provide\nparticipants and spectators with a more sustainable alternative to\nsingle-use plastic. We expect this partnership to help build brand\nawareness and encourage trial in the New York area and across the US. We\nlook forward to hitting the ground running together.\"\n\n    Flow and NYRR aim to inspire runners and spectators alike to make more\nsustainable and healthy choices for themselves and the planet and will\ncollaborate to make the upcoming events among the greenest yet.\n\n    \"We are excited to partner with Flow as the Official Water of NYRR,\nincluding for the United Airlines NYC Half, the TCS New York City Marathon\nand a year-round portfolio of events,\" said Christine Burke, NYRR Senior\nVice President of Strategic Partnerships and Runner Products. \"This\nmulti-year partnership will be of utmost significance to our running\ncommunity, keeping our runners hydrated, while simultaneously aligning New\nYork Road Runners with a brand that also puts health, wellness, and\nsustainability at the forefront.\"\n\n    The United Airlines NYC Half takes runners on a 13.1-mile journey\nthrough New York City each spring. The race begins in Brooklyn near\nProspect Park before taking runners across the East River via the Manhattan\nBridge. Once in Manhattan, runners race along the Lower East Side, up to\nMidtown, and through Times Square before finishing in Central Park. Next\nyear's Half Marathon will take place on Sunday, March 20.\n\n    About New York Road Runners (NYRR)\n\n    NYRR's mission is to help and inspire people through running. Since\n1958, New York Road Runners has grown from a local running club to the\nworld's premier community running organization. NYRR's commitment to New\nYork City's five boroughs features races, virtual races, community events,\nfree youth running initiatives and school programs, the NYRR RUNCENTER\nfeaturing the New Balance Run Hub, and training resources that provide\nhundreds of thousands of people each year with the motivation, know-how,\nand opportunity to Run for Life. NYRR's premier event is the TCS New York\nCity Marathon. Held annually on the first Sunday in November, the race\nfeatures a wide population of runners, from the world's top professional\nathletes to a vast range of competitive, recreational, and charity runners.\nTo learn more, visit www.nyrr.org.\n\n    About Flow\n\n    Flow is a premium alkaline spring water company with a diversified line\nof health and wellness-oriented beverage products sold online and at\nretailers throughout North America. Flow's premium alkaline spring water is\noffered in original unflavored and a range of award-winning organic\nflavors, in sizes ranging from 330-ml to 1-liter.\n\n    Due to its unique artesian spring sources, Flow products contain\nnaturally occurring electrolytes and essential minerals, and its original\nand flavored water products have an alkaline pH. As part of its ongoing\ninnovation into functional \"better-for-you\" beverages, Flow recently\nintroduced a new line of collagen-infused waters with natural flavors.\n\n    Founded in 2014 by serial, mission-driven entrepreneur Nicholas\nReichenbach, Flow is highly dedicated to sustainability and is a B-Corp\nCertified company with a purpose to \"bring wellness to the world through\nthe positive power of water.\" Flow set out to be a sustainable brand,\npackaging its products in up to 75% renewable-resource-based Tetra Pak(TM)\ncartons utilizing sustainable operations.\n\n    Flow beverage products are available online at flowhydration.com, and\nare sold at over 20,000 stores across the United States and Canada,\nincluding Target, Publix, Walmart, Costco, Whole Foods Market, Loblaws,\nSobeys, Metro, Shoppers Drug Mart, Farm Boy, Sprouts Farmers Market,\nSafeway, Wegmans, Harris Teeter, Giant Eagle, Bristol Farms, Raley's, and\nDuane Reade, among others.\n\n    Follow Flow on social media: Instagram\n(https://www.instagram.com/flow/); Twitter\n(https://twitter.com/FlowHydration); and Facebook\n(facebook.com/FlowHydration).\n\n    For more information on Flow, please visit Flow's investor relations\nsite at:investors.flowhydration.com\n\n    Cautionary Statement\n\n    This press release may contain \"forward-looking statements\" within the\nmeaning of applicable Canadian securities legislation. Such forward-looking\nstatements include, but are not limited to, information with respect to our\nobjectives and the strategies for achieving those objectives, as well as\ninformation with respect to our beliefs, plans, expectations,\nanticipations, estimates and intentions. Forward-looking statements are\ntypically identified by the use of words such as \"may\", \"would\", \"should\",\n\"could\", \"expect\", \"intend\", \"estimate\", \"anticipate\", \"plan\", \"foresee\",\n\"believe\", or \"continue\", although not all forward-looking statements\ncontain these words. Forward-looking statements are provided for the\npurposes of assisting the reader in understanding Flow and its business,\noperations, prospects, and risks at a point in time in the context of\nhistorical and possible future developments, and the reader is therefore\ncautioned that such information may not be appropriate for other purposes.\nForward-looking statements are based on assumptions and are subject to a\nnumber of risks and uncertainties, many of which are beyond our control,\nwhich could cause actual results to differ materially from those that are\ndisclosed in or implied by such forward-looking statements. Those risks and\nuncertainties include the following: impact and spread of COVID-19; ability\nto achieve and manage growth; failure to expand sales capabilities; changes\nin consumer preferences; criticism of packaged water; maintain brand image\nand product quality; constrained or unavailable spring water sources;\ninability to package products; increased competition; accurately estimating\ndemand; maintaining relationships with distributors and vendors; changing\nretail landscape; incorrect product design or development; product\ninformation misrepresentation; revenues derived entirely from packaged\nbeverages; increases in costs or shortages of materials; fluctuation of\nquarterly operating results; no assurance of profitability; fluctuations in\nforeign currency; changes in government regulation; contamination or\nrecalls of ingredients or end products; loss of intellectual property\nrights; litigation; future tax rates; catastrophic events; climate change;\nseasonal business; dependence on key information systems and third-party\nservice providers; ability to securely maintain confidential information;\nmaintaining and upgrading information technology systems; conflict of\ninterest; dual class share structure; potential volatility of share price;\nno assurance of active market for shares; lack of dividends; global\nfinancial condition; publication of inaccurate or unfavourable research and\nreports; operating history; and management and conflict of interests.\nConsequently, all of the forward-looking statements contained herein are\nqualified by the foregoing cautionary statements, and there can be no\nguarantee that the results or developments that we anticipate will be\nrealized or, even if substantially realized, that they will have the\nexpected consequences or effects on our business, financial condition or\nresults of operation. Unless otherwise noted or the context otherwise\nindicates, the forward-looking statements contained herein are provided as\nof the date hereof, and we do not undertake to update or amend such\nforward-looking statements whether as a result of new information, future\nevents or otherwise, except as may be required by applicable law.\n\nContact Information:\n\nDevan Pennell, Chief Financial Officer\n1-844-356-9426\ninvestors@flowhydration.com\n\nUS Investors:\nAshley DeSimone\nAshley.DeSimone@icrinc.com\n\nCanadian investors:\nMarc Charbin\ninvestors@flowhydration.com\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133300126.MNPRE2133301609-06171220211130</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}