{"date": "2022-02-24 16:40:42.673000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2896.54, "close": 3075.77}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>RACKSPACE TECHNOLOGY INC (\"RXT-Q\")\n- Expands Strategic Relationship with AWS\n\n     Rackspace Technology(R) a leading end-to-end, multicloud technology\nsolutions company is extending its Strategic Collaboration Agreement (SCA)\nwith Amazon Web Services (AWS) with an additional multi-year joint\ninvestment to drive customer value and innovation. The expanded agreement\ncomes after Rackspace Technology's AWS business has grown by 250% over the\npast 3 years and was named 2021 AWS Migration Partner of the Year (US &amp;\nCanada).\n\n     \"AWS and Rackspace Technology have jointly launched over 1,000 cloud\nprojects enabling clients to fundamentally change how their businesses\nwork,\" said Neil Emerson, Chief Commercial Officer at Rackspace Technology.\n\"This agreement continues the commitment of both companies together to\nprovide a full stack of cloud services to assist customers with becoming\ncloud-first businesses to accelerate their digital transformation, innovate\nfaster, and create value. With AWS's renowned customer obsession and the\nRackspace Fanatical Experience(TM), we share a common culture of delivering\nthe right outcomes for our clients.\"\n\n     The SCA includes investment to help customers accelerate their\napplications and data modernization initiatives through the global\nexpansion of Rackspace Technology's Modernization Center of Excellence,\nwhich builds on their years of expertise working with the AWS Migration\nAcceleration Program (MAP). The two companies also will collaborate to help\ncustomers embrace a cloud-built approach by expanding Rackspace\nTechnology's Elastic Engineering, a service designed to help customers\nbuild and operate modern cloud environments while delivering ongoing\ninnovation and transformation, in addition to world-class 24x7x365\noperations.\n\n     In addition, AWS and Rackspace Technology also have established\ndedicated teams across both companies to support customers with\nAWS-specific strategy, cloud-built development, containers, application\nmodernization, data, and workload management.\n\n     Rackspace Technology has over 2,000 AWS customers and 1,000+ dedicated\nAWS professionals. Their commitment to customer success is demonstrated by\n81 published AWS case studies, and 15 AWS Competencies and 13 AWS Service\nDelivery designations elevate the company's ability to provide expertise\nacross the full spectrum of cloud services on AWS. In addition, Rackspace\nTechnology holds 2,500+ AWS accreditations.\n\n     Now more than ever, customers need to accelerate their journey to the\ncloud. Rackspace Technology helps customers realize the power of the cloud\nfaster by delivering end-to-end services including advisory, design,\nmigration, management, and optimization across applications, data, and\nsecurity.\n\n     To learn more about the AWS and Rackspace Technology collaboration,\nclick here.\n\n     About Rackspace Technology\nRackspace Technology is a leading end-to-end multicloud technology services\ncompany. We can design, build, and operate our customers' cloud\nenvironments across all major technology platforms, irrespective of\ntechnology stack or deployment model. We partner with our customers at\nevery stage of their cloud journey, enabling them to modernize\napplications, build new products and adopt innovative technologies.\n\nContact Information:\n\nContact:Natalie Silva\nRackspace Technology Corporate Communications\npublicrelations@rackspace.com\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2205400593.MNPRE2205402407-08120020220224</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}