{"date": "2021-12-01 19:55:21.856000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Validere Achieves AWS Energy Competency Status</b>\n</p><p>\nValidere, a leader in bringing commodity data transparency to the energy industry, announced today that it has achieved Amazon Web Services (AWS) Energy Competency status. This designation recognizes that Validere has demonstrated deep expertise helping customers leverage AWS cloud technology to transform complex systems and accelerate the transition to a sustainable energy future.\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: <a href=\"https://www.businesswire.com/news/home/20211130005363/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211130005363/en/</a></p><div id=\"bwbodyimg\" style=\"width:480px;float:left;padding-left:0px;padding-right:20px;padding-top:0px;padding-bottom:0px\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"(Graphic: Business Wire)\" src=\"https://mms.businesswire.com/media/20211130005363/en/931234/4/2021_reInvent_Partner_Network_Social_1200x600_Energy_01_copy.jpg\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbXMuYnVzaW5lc3N3aXJlLmNvbS9tZWRpYS8yMDIxMTEzMDAwNTM2My9lbi85MzEyMzQvNC8yMDIxX3JlSW52ZW50X1BhcnRuZXJfTmV0d29ya19Tb2NpYWxfMTIwMHg2MDBfRW5lcmd5XzAxX2NvcHkuanBn&amp;key=266adbc8c256cedc0bc9ac751539abc5bd602976f4724301ea6eee3b2180984b18a370c80429d4694e2dfe76e7116e36d5d13f1834919d18ba99ace2d4097bf5\"/></div></div><p style=\"font-size:85%\">(Graphic: Business Wire)</p></div><p>\nAchieving the AWS Energy Competency differentiates Validere as an AWS Partner with deep expertise and technical proficiency within this unique industry, including proven customer success developing solutions across the value chain, from production operations and optimization to commodities trading, new energy solutions, and more. To receive the designation, AWS Partners undergo a rigorous technical validation process, including a customer reference audit. The AWS Energy Competency provides energy customers the ability to more easily select skilled partners to help accelerate their digital transformations with confidence.\n</p><p>\n“Validere is proud to achieve the AWS Energy Competency designation,” said Nouman Ahmad, co-founder and CEO, Validere. “Our team is dedicated to helping companies get the most out of their data by leveraging the agility, breadth of services, and pace of innovation that AWS provides so they can be more commercially and environmentally efficient.”\n</p><p>\nAWS is enabling scalable, flexible, and cost-effective solutions from startups to global enterprises. To support the seamless integration and deployment of these solutions, AWS established the <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fpartners%2Fcompetencies%2F&amp;esheet=52541976&amp;newsitemid=20211130005363&amp;lan=en-US&amp;anchor=AWS+Competency+Program&amp;index=1&amp;md5=f37ea4b626493d1f4afdc50ff1b0a0b9\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Competency Program</a> to help customers identify AWS Partners with deep industry experience and expertise.\n</p><p>\nValidere helps more than 40 producers, midstream, and downstream energy companies consolidate their commodity inventory data into a single repository, so they have a detailed “genealogy” of every molecule as it progresses through the energy supply chain. This includes more than thirty ESG attributes such as methane intensity, carbon intensity, and recycled water use. Validere’s SaaS platform, which touches over $250MM of oil and gas each day, enables energy professionals to easily access and use inventory data to improve commercial margins and reduced operational costs and risks while also tapping into new ESG opportunities.\n</p><p>\n“Vermilion has a strong commitment to ESG leadership, as evidenced by the recent Equitable Origin certification for three of our Canadian natural gas production sites,” said Curtis Hicks, president, Vermilion. “Validere has been an important partner in helping us establish an automated means to provide the data necessary for certification in a way that ensures trust through data transparency.”\n</p><p>\n“We are seeing strong demand for carbon offset credits that are generated from carbon sequestration projects,” said James Graham, CEO, GuildOne, a Calgary based software company that leverages the power of advanced blockchain infrastructure and applications to build innovative digital assets and ESG solutions. “Critical to our ability to list credits for purchase on our Blockchain platform is the primary data audit trail that Validere provides on sequestered carbon volumes for the purposes of validation. Validere is a key partner in enabling this new source of carbon credits.”\n</p><p>\n<b>About Validere</b>\n</p><p>\nValidere is a leading data and analytics SaaS provider that is digitally transforming the world’s largest supply chain to be more sustainable and efficient. Our Product Data Cloud enables energy companies to aggregate all commodity inventory data into a complete, accurate, and auditable repository that allows them to create a real-time digital fingerprint of the molecule. Using this single-source-of-trust and our digital infrastructure models, energy professionals across operations, commercial, and ESG functions can now quickly make data-driven decisions daily. By partnering with us, business leaders leverage our unique datasets as well as our experts in data science, physical science, and oil and gas to create a company-wide value engine.\n</p><p><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211130005363/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211130005363/en/</a></span></p><p>\nMedia:\n</p><p>\nErin Farrell Talbot\n<br/>Farrell Talbot Consulting\n<br/><a href=\"mailto:erin@farrelltalbot.com\" data-type=\"email\" translate=\"no\">erin@farrelltalbot.com</a>\n</p><p>\nBen Tao\n<br/>Validere\n<br/><a href=\"mailto:ben.tao@validere.com\" data-type=\"email\" translate=\"no\">ben.tao@validere.com</a>\n</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: TX-VALIDERE</p></div>"}