{"date": "2022-02-01 14:41:31.746000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NEXTECH AR SOLUTIONS CORP (\"NTAR-Z;NEXCF-0\")\n- Signs 3D Model Deal With Major B2B Design Industry Technology\n- Platform and Marketplace DesignerInc\n\n    Nextech AR Solutions Corp. (\"Nextech\" or the \"Company\"), a Metaverse\nCompany and leading provider of augmented reality (\"AR\") experience\ntechnologies and services is pleased to announce it has received an initial\norder and signed a partnership agreement with B2B technology platform and\nmarketplace DesignerInc. The deal will leverage Nextech's ARitize CAD 3D\nmodeling solution for furniture manufacturers, creating 3D models at scale\nfrom CAD files. This B2B partnership represents a substantial MRR (monthly\nrecurring revenue) opportunity for Nextech as it leverages its\nground-breaking ARitize CAD solution and virtual showroom ARitize Decorator\nto DesignerInc's network of over 1,500 furniture manufacturers,\nrepresenting a potential demand for hundreds of thousands of 3D models.\n\n    DesignerInc serves the B2B interior design industry, offering a single\ndestination where designers source custom and stock trade furniture and\ndecor, obtain quotes and purchase from over 1,500 trade-only manufacturers.\nThrough this partnership, Nextech reaches DesignerInc's broad network of\n1,500 trade furniture manufacturers, offering 3D models, AR visualizations\nand Nextech's innovative ARitize Decorator for use across the design\nindustry landscape.\n\n    Beyond 3D models, Nextech's innovative ARitize Decorator technology\nshowcases 3D models in a virtual showroom created by Nextech for\nDesignerInc's top vendors. This virtual showroom technology optimizes the\nsale of furniture products and offers DesignerInc's vendor partners the\nopportunity to work directly with Nextech for 3D/AR models and online\ncommerce studio products including; configurator, virtual staging\nenvironments, and even 3D swirl ads on Facebook and SNAP offering a true\nend-to-end partnership solution for everything 3D in online commerce.\n\n    Marisa Terrizzi, DesignerInc's Chief Strategy Officer comments, \"In\npartnership with Nextech, DesignerInc continues to innovate by creating\ntechnology solutions that drive the interior design industry forward. Our\nalliance with Nextech complements DesignerInc's future-ready approach,\nsupporting the long-term strategies of our Gilded Circle Vendor Partners by\ndelivering 3D AR models and virtual showroom environments, at scale.\nTogether, we bring our industry into Web 3.0 through AI-driven, rapid\nexecution of models and virtual and metaversal environments - elevating\ninterior design processes and refining execution paths. With the launch of\nDI Pro Project Management in Q2, we are offering our Gilded Circle\ncommunity of designers a suite of much-needed tools to close the sales loop\nquickly through realtime, visual interaction with their clientele.\"\n\n    Evan Gappelberg, Nextech AR CEO commented, \"We are very excited about\nthe opportunity to work with DesignerInc, a B2B company who recognizes the\nbenefits of 3D/AR models for both the supply and demand side of the design\nindustry. We believe this deal has potential to substantially grow our 3D\nmodelling business and impact our MRR revenue, as it will provide direct\naccess to DesignerInc's network of over 1,500 manufacturers.\" He continues,\n\"We are experiencing a rapidly growing global demand for 3D/AR models, and\nwith partnership deals like this we are solidifying our company as we\nstrive towards our ambitious goal of becoming the world's leading 3D\nmodelling factory.\"\n\n    Nextech has been seeing strong, growing demand from multiple market\nsectors including e-commerce businesses looking to create 3D models at\nscale, and manufacturers requiring the same by turning CAD files into POLY\nfiles. The company has reported that demand has been rapidly increasing and\nannounced that it has been signing multiple ARitize CAD deals since the\nstart of 2022. The Company believes that with both its AI powered ARitize\n3D for e-commerce and ARitize CAD its 3D solution for manufacturers, that\nit has a major competitive advantage and is rapidly winning market share.\n\n    About Nextech CAD Technology\n\n    Nextech's ARitize CAD solution is a game changer for the manufacturing\nindustry, providing a viable solution to convert large CAD files into\nlightweight, optimized 3D meshes that are suitable for 3D and AR\napplications. Through this technology, manufacturers can produce high\nquality 3D/AR models at affordable prices and at scale. CAD is a function\nof product engineering. Industrial designers, working for product\nmanufacturers, use CAD software like AutoCAD, and SolidWorks to design many\nof the products in the modern world. CAD is a great use case for furniture\nmanufacturers, and by using Nextech's ARitize CAD solution, CAD files of\nfurniture designs can be converted to 3D/AR models that are high quality,\nphoto realistic, and fully textured.\n\n    In addition to creating 3D models from CAD files using ARitize CAD,\nmanufacturers will also have the option to enhance their 3D models with\nNextech's market-leading suite of solutions. These enhancements incorporate\ncolor and texture changing, animating parts of the 3D model to include\nmovement, exploded views of the model to showcase all of its individual\nparts, and more. These enhancements offer a unique advantage to businesses\nusing this technology to showcase their products over their competitors,\ndriving the rapid adoption of this technology.\n\n    About DesignerInc\n\n    DesignerInc's vertical technology platform enables US &amp; Canadian\ninterior designers, architects and design firms to work efficiently,\nsourcing materials and furnishings from vendors across the globe. As the\nleading B2B platform powering the interior design industry, DesignerInc\nserves as an exclusive trade tool - including a marketplace, instant\nshipping quotes and a virtual market every Spring and Fall showcasing new\nintroductions and special events. Vetted designers source 24/7, optimizing\nproductivity with quick and efficient quote turn, instant access to over\n1,500 manufacturers and the support of an acclaimed Concierge Team who work\nclosely with designers on project management - from sourcing to logistics\nand claims. DesignerInc's Gilded Circle(TM) VIP members, its community of\ndesigners and manufacturers, supercharge their workflow by utilizing DI's\npowerful technology suite, generous loyalty program benefits and DI Pro,\nDesignerInc's robust project management suite launching in Q2 2022. To\nlearn more, visit <a href=\"https://www.designerinc.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.designerinc.com</a>/\n\n    To learn more, please follow us on Twitter, YouTube, Instagram,\nLinkedIn, and Facebook, or visit our website: <a href=\"https://www.Nextechar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.Nextechar.com</a>.\n\n    About Nextech AR\n\n    Nextech AR Solutions is a Metaverse company that develops and operates\naugmented reality (\"AR\") platforms, transporting three-dimensional (\"3D\")\nproduct visualizations, human holograms and 360 portals to its audiences\naltering e-commerce, digital advertising, hybrid virtual events (events\nheld in a digital format blended with in-person attendance) and learning\nand training experiences.\n\n    Nextech focuses on developing AR solutions for the Metaverse, however\nmost of the Company's revenues are derived from three e-Commerce platforms:\nvacuumcleanermarket.com (\"VCM\"), infinitepetlife.com (\"IPL\") and\nTrulyfesupplements.com (\"TruLyfe\"). VCM and product sales of residential\nvacuums, supplies and parts, and small home appliances sold on Amazon.\n\n    Forward-looking Statements\n\n    The CSE and the NEO have not reviewed and do not accept responsibility\nfor the adequacy or accuracy of this release.\n\n    Certain information contained herein may constitute \"forward-looking\ninformation\" under Canadian securities legislation. Generally,\nforward-looking information can be identified by the use of forward-looking\nterminology such as, \"will be\" or variations of such words and phrases or\nstatements that certain actions, events or results \"will\" occur.\nForward-looking statements regarding the completion of the transaction are\nsubject to known and unknown risks, uncertainties and other factors. There\ncan be no assurance that such statements will prove to be accurate, as\nfuture events could differ materially from those anticipated in such\nstatements. Accordingly, readers should not place undue reliance on\nforward-looking statements and forward-looking information. Nextech will\nnot update any forward-looking statements or forward-looking information\nthat are incorporated by reference herein, except as required by applicable\nsecurities laws.\n\n     Contact Information:\n\n     Investor Relations\n     Lindsay Betts\n     investor.relations@Nextechar.com\n     866-ARITIZE (274-8493) Ext 7201\n\n                            ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203100154.MNPRE2203101735-06330820220201</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}