{"date": "2022-01-06 18:10:39.601000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3287.14, "close": 3251.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Inside Jeff Bezos and Lauren Sánchez's modern family: the Amazon billionaire celebrated New Year's Eve with his girlfriend and her ex, Tony Gonzalez - but their bond runs much deeper</p><p>After<a href=\"https://www.scmp.com/magazines/style/celebrity/article/3151475/who-are-stingiest-billionaires-2021-mackenzie-scotts\" data-type=\"url\" class=\"tr-link\" translate=\"no\">multi-billionaire Amazon founder Jeff Bezos</a>shocked the world with his sudden divorce from his former wife of 25 years, MacKenzie Scott, the global spotlight is now focused squarely on his relationship with television anchor-turned-entrepreneur,<a href=\"https://www.scmp.com/magazines/style/celebrity/article/3158358/jeff-bezos-and-lauren-sanchez-how-it-started-vs-how-its\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Lauren Sánchez</a>.</p></div><div class=\"tr-npp-body\"><ul class=\"bulleted-list arrowlist\"><li>Former NFL player Gonzalez is often spotted with his ex and Bezos, from welcoming Bezos back from his historic Blue Origins space flight to New Year's Eve parties</li><li>While Bezos has spent time with Sánchez's children, Nikko, Evan and Eleanor, what about Sánchez's relationship with Bezos and Scott's kids?</li></ul><p>While their relationship had a rocky start when it was first revealed – plagued with a<a href=\"https://www.scmp.com/magazines/style/celebrity/article/3116417/jeff-bezos-and-lauren-sanchezs-roller-coaster-romance\" data-type=\"url\" class=\"tr-link\" translate=\"no\">saga of blackmail and infidelity</a>accusation dramas – the couple has weathered the storm together and are still going strong.</p><p>So just how has Bezos opened his heart and his home not only to his beautiful girlfriend, but also her ex and children?</p><p>Do you have questions about the biggest topics and trends from around the world? Get the answers with<a href=\"https://www.scmp.com/knowledge\" data-type=\"url\" class=\"tr-link\" translate=\"no\">SCMP Knowledge</a>, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team.</p><p>Not much has been shared publicly about the relationship between the Pro Football Hall of Fame tight-end Tony Gonzalez and Sánchez. However, the two, who now seperated had a son together, Nikko, who is now in his 20s.</p><p>Despite their history, they remained on good terms and Gonzalez has shared numerous important moments with Bezos and Sánchez. For example, Gonzalez was present alongside Sánchez to welcome Bezos back to Earth after<a href=\"https://www.scmp.com/magazines/style/celebrity/article/3141912/jeff-bezos-blue-origins-space-trip-was-out-world\" data-type=\"url\" class=\"tr-link\" translate=\"no\">his historic trip to space</a>through his company Blue Origin. They even had double-dates together as the power couple Bezos-Sánchez was spotted having lunch with Gonzalez and his wife, October.</p><p>Besides Nikko, helicopter pilot Sánchez also had two other children – son Evan born in 2006 and daughter Eleanor born in 2008 – with her ex-husband Patrick Whitesell, co-CEO at William Morris Endeavor, during their marriage from 2005 to 2019. Whitesell was also rumoured to have been the one to introduce Bezos to his ex-wife.</p><p>Only a short time after the bombshell news of Bezos' divorce and the shocking announcement of his affair with Sánchez, Bezos was already meeting her children, sharing lunches and dinners numerous times throughout their now two-year relationship, according to NDTV.</p><p>Regardless, little is known about the relationship between Sánchez and Bezos' four children, including three sons and one adopted daughter, from his marriage to Scott – who is now<a href=\"https://www.scmp.com/magazines/style/celebrity/article/3137516/jeff-bezos-ex-mackenzie-scott-just-gave-away-another-us27\" data-type=\"url\" class=\"tr-link\" translate=\"no\">one of the richest women in the world</a>and is happily remarried to Dan Jewett, a private school science teacher, according to <span>The Wall Street Journal</span> .</p><p>With their special bond, it came as no surprise that the gang had a blast at their lavish New Year's Eve celebration to finish out 2021. For the special occasion, Bezos, one of the world's richest men, rented the US$38,000-a-week chartered yacht to cruise in St. Barts together with his beau, her son, her ex Gonzalez and his wife. While the union might seem impossible to some people, the gang appeared to have plenty of fun as they joined the disco party and took to social media to share their joy and their new year resolutions.</p><p><span>Want more stories like this? Follow STYLE on</span><a href=\"https://www.facebook.com/scmpstyle\"><span>Facebook</span> </a><span>,</span><a href=\"https://www.instagram.com/scmp_style/?hl=en\"><span>Instagram</span> </a><span>,</span><a href=\"https://www.youtube.com/channel/UCtYYXR3QV_1mKdJNksfCRtQ?view_as=subscriber\"><span>YouTube</span> </a><span>and</span><a href=\"https://twitter.com/scmp_style\"><span>Twitter</span> </a><span>.</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 South China Morning Post Publishers Ltd. All rights reserved.</p></div>"}