{"date": "2021-03-23 13:15:35.866000+00:00", "ticker": "AAF", "mrkt_info": {"open": 84.2, "close": 81.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>NEW DELHI</p></div><div class=\"tr-npp-lead\"><p>NEW DELHI, March 23 -- Bharti Airtel Ltd's Africa unit has signed a pact with Helios Towers Plc to sell 1,229 towers in Madagascar and Malawi for $108 million, the company said in a stock exchange filing on Tuesday.</p><p>Airtel Africa Plc will also build 195 sites across the two regions over the next three years for $11 million, which will be handed over to Helios Towers upon completion.</p></div><div class=\"tr-npp-body\"><p>Also Read | Six wrong calls onpost-covid economy</p><p>\"The transactions, comprising two separate agreements, one in respect of each jurisdiction, are subject to customary closing conditions including required regulatory approvals, and are not inter-conditional on each other. The transactions are expected to close in or around calendar Q4 2021,\" the company said.</p><p>Under the tower sale deal, Airtel Africa's subsidiaries will continue to develop, maintain and operate their equipment on the towers in separate lease agreements, largely in local currencies, with Helios Towers.</p><p>Airtel Africa has also entered into memorandums of understanding (MoUs) for potential sale of its tower assets in Chad and Gabon to Helios Towers. The proposed deals are subject to signing of definitive legal agreements, including customary closing conditions such as regulatory approvals.</p><p>The proposed transactions will include lease agreements and expansion of tower sites in Chad and Gabon. They are not inter-conditional and are expected to close before the end of the next financial year. The details of the proposed transactions will be shared following the signing of the pact.</p><p>The company has proposed selling 1,000 towers in Chad and Gabon.</p><p>All transactions are part of Bharti Airtel's strategic divestment of its tower portfolio as the company increases focus on asset-light business model and core subscriber-facing operations.</p><p>\"With these transactions, we continue to demonstrate strong execution of our asset monetisation programme. These transactions will also help to improve the mix of our debt and increase its tenor through long-term leases, which are largely payable in local currency by our operating entities, while reducing foreign currency debt of the group (Bharti Airtel),\" said Raghunath Mandava, chief executive, Airtel Africa.</p><p>Last week, Bharti Airtel announced that TPG-owned The Rise Fund will invest $200 million in the mobile money business of its Africa unit. The transaction is part of Airtel's strategic asset monetisation plan.</p><p>The proceeds from the stake sale will be used to slash Airtel's debt, and invest in network and infrastructure in the operating countries in Africa, the company had said.</p><p>Airtel Africa is the holding firm for Bharti Airtel's operations in 14 countries in the region. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}