{"date": "2021-11-09 14:30:03+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Nov 9 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>India's content-to-commerce conglomerate The Good Glamm Group said on Tuesday it had achieved the coveted \"unicorn\" status, after raising $150 million in its latest funding round co-led by Warburg Pincus and Naspers.</p><p>The Good Glamm Group is now valued at $1.2 billion, people familiar with the matter said.</p><p>The company's Series D round also saw participation from Alteria Capital and existing investors L'Occitane, Bessemer Venture Partners, Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and the Mankekar Family Office. Accel, Trifecta Leaders Fund and Bollywood actress Shraddha Kapoor had also earlier invested in the company.</p><p>\"With Prosus Ventures (Naspers) and Warburg Pincus as our investors and partners we are perfectly positioned to scale even faster,\" co-founder Priyanka Gill said.</p><p>The Mumbai-based company, which owns beauty products retailer MyGlamm, joins India's growing ranks of unicorns, a name given to startups valued at $1 billion or more. High-profile domestic startups in India include fintech giant CRED and education platform Byju's.</p><p>Indian startups have been on a tear in 2021, with several companies entering the unicorn or $1 billion club, while other big names including food delivery app Zomato <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ZOMT.NS\" data-type=\"ric\" data-ric=\"ZOMT.NS\" translate=\"no\" dir=\"ltr\">ZOMT.NS</a> and fintech firm Paytm listing or pursuing a debut on domestic stock exchanges.</p><p>The Good Glamm says it provides the brands under its umbrella access to a large digital customer base, and an opportunity to scale offline through more than 30,000 retail points of sale.</p><p>The company expects to go public by 2024, and has a current revenue run rate of $120 million. The Good Glamm Group has been on a buying spree this year, adding media platform ScoopWhoop and personal care products retailer MomsCo to its portfolio last month. </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Karina Dsouza in Bengaluru; Editing by Krishna Chandra Eluri)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Karina.Dsouza@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Karina.Dsouza@thomsonreuters.com</a> ; within U.S. +1 646 223 8780, outside U.S. +91 80 61822645; Reuters Messaging: Reuters Messaging: <a href=\"mailto:karina.dsouza@thomsonreuters.com\" data-type=\"email\" translate=\"no\">karina.dsouza@thomsonreuters.com</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: THE GOOD GLAM GROUP-FUNDING/</p></div>"}