{"date": "2021-11-04 08:07:20+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><br/>\nBy Staff Writer<br/>\n<div>\n<div>\n<div> </div>\n<div>\n<div>\n<div>Mubasher: GFH Financial Group has acquired a portfolio of Amazon-designated logistics assets in the US at a value of more than $2 billion.</div>\n</div>\n</div>\n</div>\n<div>\n<p>Spanning over 11 million square feet, the portfolio comprises 14 mission-critical logistics warehouses, located across eleven states, and is fully leased on a long-term basis to Amazon, according to a recent press release.</p>\n<p>The transaction was made by GFH in partnership with Los Angeles-based Preylock Holdings and a number of multi-national institutional investment firms.</p>\n<p>The Co-Chief Investment Officer – Real Estate at GFH, Nael Mustafa, said: \"The 14 assets are strategically located, purpose-built and state-of-the-art, enabling Amazon to effectively streamline the flow and delivery of goods to its massive and ever-expanding customer base across the US.\"</p>\n<p>Mustafa added: \"The investment is supported by the ongoing growth in e-commerce, with Amazon an undisputed leader, and the resulting demand for high quality industrial and warehousing space required for storage and distribution.\"</p>\n</div>\n</div>\n<div>Source: Mubasher</div>\n<p class=\"syndigate_disclaimer\">All Rights Reserved - Mubasher Info © 2005 - 2021 Provided by SyndiGate Media Inc. (<a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a>).</p>\n<div class=\"footnote-disclaimer\">Disclaimer: The content of this article is syndicated or provided to this website from an external third party provider. We are not responsible for, and do not control, such external websites, entities, applications or media publishers. The body of the text is provided on an “as is” and “as available” basis and has not been edited in any way. Neither we nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this article. <a href=\"https://d3a0oa8cittb3t.cloudfront.net/researchreports/Disclaimers/TR%20Disclaimer.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read our full disclaimer policy here</a>.</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Mubasher</p></div>"}