{"date": "2022-02-04 01:26:34.536000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3012.25, "close": 3152.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_77296tdt&amp;referenceId=tag:reuters.com,2022:newsml_OVFX4LCWB_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_77296tdt&amp;referenceId=tag:reuters.com,2022:newsml_OVFX4LCWB_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: Wall Street snapped a four-session winning streak on Thursday, with all three benchmarks closing lower after Facebook-owner Meta Platforms' dour forecast sent its stock plummeting and halted a nascent recovery. This report produced by Chris Dignam.<br/>Short Link: <a href=\"https://refini.tv/34hcm1Z\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/34hcm1Z</a><br/><br/>Video Transcript:<br/><br/>Stocks plummeted on Thursday after a dismal outlook from Facebook-owner Meta Platforms not only took down its own shares but also rattled the entire stock market, abruptly ending a short-lived recovery built on upbeat earnings from big tech companies. The Dow fell nearly 1.50% and the S&amp;P dropped almost 2.50%, while the tech-laden NASDAQ lost a monster 3.74%, the index's worst day since September 2020. Palumbo Wealth Management's chief investment officer Philip Palumbo said investors were already unnerved by the Federal Reserve and its plans to raise interest rates.<br/><br/>The market is very fragile right now, so any type of full forward earnings or any type of negative earnings with some of the bigger companies or quality technology companies, you're going to see volatility continue to ramp up. The volatility we are experiencing is all due to the uncertainty around the Federal Reserve. And all of a sudden, when you have a major company like Meta and also PayPal yesterday produce poor earnings, that just creates another level of uncertainty for the market. So until we get some clarity on what the Federal Reserve is going to do in 2022 to tame inflation, this volatility will continue to persist.<br/><br/>Meta shares sank more than 26% by Thursday's close, a loss of $238 billion, the worst single-day wipeout in market value for a US company in history. Other social media companies took a beating, including Twitter, which fell 5.56%. And no FAANG stock was spared in Thursday's rout. Despite posting stellar results on Tuesday, Google-parent Alphabet fell more than 3.50%. Apple fell more than 1.50% and Netflix lost 5.50%. But shares of Amazon reversed course in after-hours trading, following the release of its results, which beat profit expectations. Same story for Pinterest and Snap, both of which plunged in regular trading only to soar after hours on strong â\u0080\u008bquarterly results.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}