{"date": "2021-10-24 09:41:27.462000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3676.0, "close": 3640.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Dubai, United Arab Emirates:</strong> AVEVA, a global leader in industrial software, driving digital transformation and sustainability, has announced the expansion of its executive leadership team with the appointments of Caspar Herzberg as the company’s new Chief Revenue Officer, and Helen Lamprell, OBE as General Counsel and Company Secretary. The new appointments, in London and Dubai, strengthen AVEVA’s international footprint and digital transformation capabilities at a time when business relies on interconnected solutions for global workforces. Both leaders bring a wealth of global expertise to AVEVA when they join on November 1.</p>\n<p>Herzberg has over two decades of international experience within the technology sector. After seven years at Accenture, where he specialized in supply chain optimization and outsourcing, Herzberg spent ten years at Cisco, where he led sales for mega projects in Saudi Arabia, developed the company’s global smart city strategy, and was global managing director for the emerging solutions advisory business before taking on the position of Vice-President Cisco Consulting Services for Asia Pacific, China, and Japan. For the past five years, he has led Schneider Electric’s business across over 80 countries in the Middle East and Africa.</p>\n<p>Raised in Egypt, Herzberg has a degree in Arabic and Modern Middle Eastern Studies from the University of Oxford, and an MSc in International Politics from SOAS University of London. He is a Board member of RES4Africa, a non-profit foundation committed to a green energy transition across Africa and is a member of the Advisory Council of the Dubai International Chamber of Commerce.</p>\n<p>AVEVA will leverage his deep expertise to lead the global sales organization and to strengthen the capabilities of partners around the world. Herzberg, who is fluent in English, Arabic, French and German, will be based in Dubai.</p>\n<p>Lamprell studied law at Cambridge University and has over twenty years’ experience in the fields of legal and external affairs. Over seven years at Linklaters, she advised on a broad range of matters ranging from emerging markets equities to hybrid capital. She then enjoyed an action-packed 18-year stint at the Vodafone Group and Vodafone UK, where she was most recently General Counsel &amp; External Affairs Director and member of the UK Board. She led many of Vodafone’s biggest deals in the UK and globally, including the landmark Verizon Wireless transaction, before switching to fixing the UK operations in Vodafone’s historic home where Helen had a broad remit ranging from security to communications. </p>\n<p>Lamprell was awarded an Order of the British Empire (OBE) in the 2020 New Year’s Honours list for services to business and equality. An advocate for sustainability and diversity, she is currently a non-executive director at the Low Carbon Contracts Company and the Electricity Settlements Company, sister organizations jointly owned by the UK Department for Business Energy &amp; Industrial Strategy. She remains a director of the not-for profit Employer’s Initiative on Domestic Abuse, and a member of the UK government’s Women’s Business Council.</p>\n<p>Lamprell will be based in London and will lead AVEVA’s legal and company secretarial function globally as the organization builds on synergies from the recent acquisition of OSIsoft.</p>\n<p>“AVEVA is at a transformative moment on its trajectory, and I look forward to the dynamic energy Helen and Caspar will bring to the executive leadership team,” said Peter Herweck, CEO, AVEVA. “As a well-known leader in compliance and purpose-driven initiatives, Helen’s work on tackling issues related to digital poverty has widespread recognition. For his part, Caspar is acknowledged for his expertise in concepts such as smart cities, digital transformation, and the Internet of Things. I am confident both Helen and Caspar will strengthen AVEVA as we expand our relationships globally and deliver digital transformation and sustainability for our customers worldwide.”</p>\n<p>Herzberg said: “For decades, AVEVA has pioneered innovations that empower industry to optimize value, efficiency and sustainability, and I’m delighted to be joining an organization with this track record. I’m excited to be working with Peter and the entire team to further how we work with our customers, address their most pressing issues, and deliver value through technology.”</p>\n<p>Lamprell said: “I’m looking forward to joining AVEVA at a moment when advanced digital technologies are delivering widespread economic and ESG* benefits for industrial organizations and their customers. </p>\n<p>Now more than ever, technology companies must be agents for positive change, and I am pleased to be able to focus my energies at AVEVA on driving best practice and enhancing sustainable equitable impact alongside Peter and the executive team.”</p>\n<p><span>* ESG = environmental, social, and corporate governance</span></p>\n<p><strong>About AVEVA</strong></p>\n<p>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence.  AVEVA’s comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries.</p>\n<p>Learn more at <a href=\"http://www.aveva.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.aveva.com</a> </p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Â© Press Release</p></div>"}