{"date": "2022-01-27 13:11:18.128000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2799.72, "close": 2792.75}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Patrick McGah, a mechanical engineering PHD who lives in Seattle, had heard the stories about Amazon's cut throat corporate culture, but wasn't that worried when he took a job in their drone division in October of 2019.</p><p>Sure, he'd seen that <a href=\"http://go.redirectingat.com/?id=44681X1458326&amp;url=https%3A%2F%2Fwww.nytimes.com%2F2015%2F08%2F16%2Ftechnology%2Finside-amazon-wrestling-big-ideas-in-a-bruising-workplace.html&amp;sref=https://www.independent.co.uk/news/world/americas/amazon-law-washington-personnel-file-b1995720.html\"><span>widely</span><span><span>New York Times</span> </span><span>article</span> </a> a few years before, where former employees described workers regularly weeping at their desks, where managers said they sought to create \"purposeful Darwinism\" among the ranks. But Mr McGah had already worked with Amazon's drone team when he was with a software company that business with them, so he thought he knew what he was in for. Plus, they were offering to double his salary, and with a family, two kids, and a mortgage in one of the most expensive housing markets in the country, it was a tough offer to turn down.</p></div><div class=\"tr-npp-body\"><p><span>\"</span> It was one the back of my mind for sure that it could be a hellish work environment,\" he said. \"I was sort of like, there's a spectrum of experiences, good and bad, positive and negative. These stories, I don't doubt that they're true. These may just be at one end of the spectrum.\"</p><p>He'd soon find out, and the experience would be so dispiriting that it would inspire him to try and change Washington state law itself. In February 2021, his managers put him on a performance improvement plan, but offered little the way of specific things he could change or do. Mr McGah, who already had a doctorate in the field and had been published regularly in top journals, thought he was already operating at a high standard, so he pushed with his managers and Amazon HR to understand what discussions or evaluations had put his job in jeopardy.</p><p>But no matter how many conversations he had with higher-ups, he still couldn't get access to the materials that were being used to grade his performance that sat somewhere in a personnel file.</p><p>\"Why the dodge? Why the smokescreen?\" he said. \"You can't give me any information? There's a lot of gaslighting going on.\"</p><p>Amazon told <span>The Independent</span> it complies with all state law and gave Mr McGah all the information he was legally entitled to.</p><p>\"As we do in response to any employee request, we provided this employee with their personnel file along with other documents, as required by applicable law,\" said an Amazon spokesperson.</p><p>\"At Amazon, we work hard to ensure that all employees have the support they need to be successful in their roles and to develop themselves and their careers.\"</p><p>Unable to know what exactly it was he was supposed to be doing differently, the engineer quit at the beginning of April 2021, costing him the stock options that he had hoped would be his children's college fund.</p><p>The whole experience didn't sit right with him.</p><p>\"Getting screwed by Amazon really radicalised me in a way,\" he said. \"Amazon was not acting in good faith toward their employees. It was just really concerning. You have one of the largest companies in the state, one of the largest companies in the world, treating its employees like garbage, and skirting labour law.\"</p><p>His time at the company inspired him to get in touch with his state representatives, who are working on a bill that could change parts of the company culture at Amazon and every other employer in the state.</p><p>Last year, state senator and employment lawyer Patty Kuderer, a Democrat from Bellevue, introduced legislation that would clarify the legal haze surrounding what records company owe their employees.</p><p>Advocates say the change is long overdue, and will help get workers better protection in matters ranging from unemployment insurance, to medical care, to workplace lawsuits.</p><p>\"This is ultimately a fairness issue,\" Senator Patty Kuderer <a href=\"https://www.jpost.com/international/article-692267\"><span>told</span><span><span>Bloomberg</span> </span> </a> . \"What goes into a personnel file needs to be accurate, and employees need to be able to check them.\"</p><p>Currently, companies have all manner of ways of getting around sharing personnel records with their employees, which they are required to do under law. There's no precise definition of what they need to share. They can decide records are only available in person, or only possible to see after a lengthy wait. Or, in many cases, companies simply ignore the law because they're unlikely to face any penalties for doing so.</p><p>\"Employers are simply ignoring the request. It's like of like, 'I understand you want your file, make me,'\" Jesse Wing of the Washington Employment Lawyers Association told <span>The Independent</span> . \"Some of the big companies don't screw around with this and they'll just send a copy. Lots of other fight back and don't respond. I can't say this is just a problem with tech or the medical field. It's all over the place.\"</p><p>Far from a minor bureaucratic issue, personnel files are involved in all kinds of vitally important moments, according to Mr Wing. The materials contained inside – job descriptions, performance evaluations and awards, disciplinary notes – may be needed to file for unemployment, worker's compensation, immigration visas, or for a wrongful termination or discrimination lawsuit.</p><p>The proposed law would require companies to disclose and produce the files electronically or in print within 14 days of a request, and open companies up to fines and legal action if they refuse. It would also define what is in a personnel file, meaning companies couldn't avoid disclosing certain materials just by labeling them under some other name.</p><p>The bill, for which Mr McGah and other workers plan to testify in legislative hearings, is the latest to put a spotlight on what insiders describe as an aggressive internal culture at Amazon.</p><p>In management circles, General Electric helped popularise a concept it called \"differentiation,\" or its less diplomatic nickname, \"rank and yank\", where employees are graded against each other and low performers are systematically eliminated.</p><p>Amazon has taken this system to heart. Despite promises to be \"Earth's Best Employer,\" the company reportedly seeks to cull at least 6 per cent of workforce each year through what it calls \" <a href=\"https://www.seattletimes.com/business/amazon/amazon-tells-bosses-to-conceal-when-employees-are-on-a-performance-management-plan/\"><span>unregretted attrition</span> </a> ,\" according to internal documents uncovered by the <span>Seattle Times</span> last year.</p><p>Amazon said it does not explicitly \"stank rank employees from top to bottom,\" according to the spokesperson.</p><p>\"We try to understand who our best performers are and to find ways to recognize those people. We also understand that there are people who aren't meeting performance expectations,\" the spokesperson added. \"Like most companies, we offer coaching and other support to employees who are not meeting the bar to help them improve their performance.\"</p><p>The sorts of protections under the proposed law could be even more meaningful to Amazon's lower-wage warehouse workers, who are subject to a battery of omnipresent <a href=\"https://www.theverge.com/2021/9/6/22659681/california-law-productivity-algorithms-warehouse-fulfillment-center-labor\"><span>surveillance and productivity monitoring tools</span> </a> .</p><p>\"Who wants to be surveilled all day?\" Chris Smalls, a former process assistant at an Amazon facility in Staten Island, New York, <a href=\"https://www.washingtonpost.com/technology/2021/12/02/amazon-workplace-monitoring-unions/\"><span>told</span><span><span>The Washington Post</span> </span><span>in December</span> </a> . \"It's not prison. It's work.\"</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/news/world/americas/amazon-worker-tiktok-video-conditions-b1998798.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon worker hurries to eat and sleep during 90-minute break before next shift in viral video</a> </p><p><a href=\"https://www.independent.co.uk/news/uk/charities-gordon-brown-fife-communities-kirkcaldy-b1997862.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Charities and Amazon get together to support needy families</a> </p><p><a href=\"https://www.independent.co.uk/life-style/gadgets-and-tech/amazon-clothing-store-algorithms-b1997655.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon to open clothing store where algorithms suggest items to try on</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/amazon-worker-tiktok-video-conditions-b1998798.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon worker hurries to eat and sleep during 90-minute break before next shift</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/us-politics/senate-google-amazon-apple-congress-b1998143.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">New step to curb tech giants' power advanced by Senate panel</a> </p><p><a href=\"https://www.independent.co.uk/news/world/europe/intel-ohio-honda-columbus-malaysia-b1997908.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Intel building $20B Ohio chip facility amid global shortage</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 Independent, The (UK) (Online). All rights reserved.</p></div>"}