{"date": "2022-01-27 22:46:35.380000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2777.45, "close": 2879.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Federal labor regulators on Thursday accused Amazon of illegally surveilling and threatening workers who are trying to unionize a Staten Island, N.Y., warehouse.</p><p>The complaint, first reported by Bloomberg News, marks the National Labor Relations Board's latest brush with the e-commerce giant over questions about its tactics. The NLRB wants to compel Amazon to take certain actions to inform workers of their right to organize, according to Kathy Drew King, a regional director for the agency.</p></div><div class=\"tr-npp-body\"><p>Amazon \"repeatedly broke the law by threatening, surveilling, and interrogating their Staten Island warehouse workers who are engaged in a union organizing campaign,\" King said in a statement.</p><p>Amazon spokeswoman Kelly Nantel said the allegations were false, adding without elaboration that \"we look forward to showing that through this process.\"</p><p>(Amazon founder Jeff Bezos owns The Washington Post.)</p><p>The complaint comes as a separate, high-stakes unionization effort is playing out in Alabama, where Amazon workers in Bessemer are poised to vote. Workers there overwhelmingly rejected a union last year, but the NLRB called for a revote after finding that Amazon improperly interfered in that election. An NLRB official specifically cited Amazon's efforts to place an unmarked U.S. Postal Service mailbox in front of the warehouse just after voting started, writing that Amazon \"essentially [hijacked] the process and gave a strong impression that it controlled the process.\"</p><p>It also coincides with a surge in labor activism across the country; dozens of strikes and strike authorizations have flared up in recent months — including at Kellogg's and John Deere.</p><p>The Amazon Labor Union, an independent group of workers that isn't connected to a major national union, recently collected the required signatures to hold a vote on Staten Island, an NLRB spokesperson said Wednesday. A hearing on the vote is scheduled for Feb. 16.</p><p>The NLRB complaint stems from four recent cases, the earliest of which was filed in May 2021, according to a legal document obtained by The Washington Post. It alleges the company threatened workers against unionizing, surveilled them in their activities and tried to solicit grievances in exchange for voting against the union. It names two human resources managers, one operations manager, two security guards and a consultant of acting on Amazon's behalf to violate workers' rights.</p><p>According to the complaint, the consultant \"interrogated\" employees about their organizing activities, called union organizers \"thugs\" and allegedly threatened employees by telling them it would be futile to select the union as their bargaining representative. The consultant also is accused of soliciting unspecified grievances from employees with the promise to remedy them if they reject the union.</p><p>Regulators also describe attempts to confiscate \"union literature\" and prevent employees from distributing it in break rooms. One of the security guards is alleged to have taken union literature and told employees not to distribute it, while a human resource assistant is accused of ordering employees to remove it from the break room.</p><p>The complaint contends Amazon has been \"interfering with, restraining and coercing employees\" who are exercising their rights under the law.</p><p>It seeks to require Amazon supervisors to undergo mandatory training describing employees' rights under the National Labor Relations Act. It also seeks to require the company to post notices describing workers rights on social media, in its electronic applications for workers, and in all employee bathrooms including in the stalls.</p><p>The NLRB has set a hearing on the matter for April 5 and has given Amazon until Feb. 10 to respond to the complaint.</p><p>Rachel Lerman contributed to this report.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 The Washington Post</p></div>"}