{"date": "2021-11-22 21:59:15+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n                  <span>Amazon ignored laws regarding the sale of agricultural and industrial-use pesticides that risk harm to human health and the environment</span>\n                </p>\n                <p>\n                  <strong>SEATTLE -</strong> Attorney General Bob Ferguson announced today Seattle-based online retailer Amazon will pay $2.5 million for selling highly regulated pesticides on its online platform without a license and without collecting information about their use as required by law.\n      </p>\n                <p>\n        Washington law regulates the sale of agricultural and industrial-use pesticides because they pose higher risks to human health and the environment. Businesses that sell these pesticides are required by law to hold specific licenses and maintain records about their sales and use. Amazon failed to inform Washingtonians on the product pages, checkout pages or anywhere else that these regulated agricultural and industrial-use pesticides were different from regular home and garden products. Amazon's conduct created the impression that anyone could lawfully buy and use the pesticides without restriction.\n      </p>\n                <p>\n        In addition to paying $2.5 million, Amazon is required to obtain a license in the future if it restarts sales of these regulated pesticides. The <a href=\"https://agportal-s3bucket.s3.amazonaws.com/uploadedfiles/Another/News/Amazon-AsFiled.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">consent decree</a>, filed today in King County Superior Court, requires Amazon to enact specific and legally enforceable corporate reforms, including putting safeguards in place on its site to block illegal sales of these pesticides. It must not allow third-party sellers on its site to sell these dangerous pesticides to customers in Washington unless it provides a way for those sellers to comply with Washington's record-keeping requirements. The consent decree is pending final approval by the court.\n      </p>\n                <p>\n        The Attorney General's Consumer Protection and Environmental Protection divisions conducted the investigation.\n      </p>\n                <p>\n        \"Amazon is a powerful corporation - but it's not above the law,\" Ferguson said. \"I will continue to serve as an independent watchdog to protect consumers and our environment, and ensure this major Washington company complies with the law.\"\n      </p>\n                <p>\n        Some regulated agricultural and industrial-use pesticides may contain active ingredients that could pose a risk to people or the environment, which is why regulation of these products is important. Depending on the pesticide, they could cause anything from skin irritation to breathing issues to neurological damage if the application or handling is done incorrectly. Improper use of others could harm food sources important to juvenile salmon or impact threatened and endangered species, including Chinook salmon and orcas. Others can damage sensitive crops if not used properly. Amazon made thousands of sales of regulated agricultural and industrial-use pesticides between 2013 and 2020.\n      </p>\n                <p>\n        The regulated pesticides Amazon sold are not available at regular home and garden stores. Sellers must be specifically licensed to sell them, and state law requires sellers to record specific information at the time of sale. For more dangerous Restricted Use Pesticides, the buyer must also be licensed as an applicator, and more detailed recordkeeping is required at the time of purchase, including verifying the buyer's license, and what the pesticide will be used for and where.\n      </p>\n                <p>\n        Restricted Use Pesticides include insecticides or fungicides used in production farming that can severely contaminate groundwater or nearby streams if used improperly.\n      </p>\n                <p>\n        Amazon sold these regulated pesticides on its site without a license, and without verifying the licenses of Restricted Use Pesticide purchasers, or collecting other legally required information, like the intended use of the pesticide. Because of Amazon's actions, there is no record of how or where the dangerous pesticides were used.\n      </p>\n                <p>\n        As a result of Ferguson's investigation, Amazon suspended all sales of these pesticides on its site.\n      </p>\n                <p>\n        Washingtonians who believe they may have unintentionally purchased these regulated pesticides from the online retailer should contact Amazon.\n      </p>\n                <p>\n                  <strong>Resolution details</strong>\n                </p>\n                <p>\n        Amazon will pay $2.5 million for selling the pesticides on its online platform without a license and without requiring buyers to provide information about the pesticides' use as required by law. The money will be used for future enforcement of the Consumer Protection Act and Washington's environmental laws, as well as attorney costs and fees.\n      </p>\n                <p>\n        In addition, Amazon is required to:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          Obtain a license and follow reporting requirements if the online retailer wishes to sell regulated pesticides in the future\n        </li>\n                  <li>\n          Update its automated systems to identify and block sales of the pesticides on its site by third-party sellers, and keep those systems up-to-date to ensure sales do not occur\n        </li>\n                  <li>\n          Work with consumers to ensure safe disposal of Restricted Use Pesticides purchased from its site, including offering to reimburse the customer, both when the sale of these pesticides is inadvertently allowed on its site going forward, and when an unlicensed consumer reaches out to Amazon about any Restricted Use Pesticides they purchased from its site before the consent decree was signed\n        </li>\n                </ul>\n                <p>\n        If Amazon wants to allow third-party sellers to sell regulated pesticides in the future, it must:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          Collect the third-party seller's dealer license number to sell regulated pesticides\n        </li>\n                  <li>\n          Provide a mechanism for the sellers to collect information about the pesticide's use as required by Washington law\n        </li>\n                  <li>\n          Maintain records of all sales of regulated pesticides on its site, including those by third-party sellers\n        </li>\n                </ul>\n                <p>\n        Assistant Attorneys General Andrea Alegrett, Joseph Kanada, Aileen Tsao and Junine So, as well as investigator Rebecca Hartsock, paralegals Ashleigh Palmer, Renae Smith, Tricia Kealy and Allison Cleveland, and legal assistants Chris Kiefer and Bryan Abejon, handled the case for Washington.\n      </p>\n                <p>\n        The Attorney General's Consumer Protection Division enforces the Consumer Protection Act and other statutes to help keep the Washington marketplace free of unfair and deceptive practices. The division investigates and files legal actions to stop unfair and deceptive practices, recovers refunds for consumers, seeks penalties and recovers costs and fees to ensure that wrongdoers pay for their actions.\n      </p>\n                <p>\n        In 2016, Ferguson established the Environmental Protection Division to protect our environment and the safety and health of all Washingtonians.\n      </p>\n                <p>\n        Both divisions receive minimal General Fund support from the Legislature, instead funding their work largely from recoveries in other cases.\n      </p>\n                <p>\n        The Legislature earlier this year passed the <a href=\"https://www.atg.wa.gov/news/news-releases/ag-request-legislation-increasing-consumer-protection-penalties-first-time-half\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Consumer Protection Improvement Act</a>, an attorney general-request bill that increases the maximum civil penalties for Consumer Protection Act violations from $2,000 to $7,500. Consumer Protection Act penalties had not increased since they were adopted in 1970.\n      </p>\n                <p>\n        -30-\n      </p>\n                <p>\n                  <span>Washington's Attorney General serves the people and the state of Washington. As the state's largest law firm, the Attorney General's Office provides legal representation to every state agency, board, and commission in Washington. Additionally, the Office serves the people directly by enforcing consumer protection, civil rights, and environmental protection laws. The Office also prosecutes elder abuse, Medicaid fraud, and handles sexually violent predator cases in 38 of Washington's 39 counties. Visit</span>\n                  <a href=\"https://gcc02.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.atg.wa.gov%2F&amp;data=04%7C01%7Cbrionna.aho%40atg.wa.gov%7Cca1de901495e4dbe44e808d938325a7e%7C2cc5baaf3b9742c9bcb8392cad34af3f%7C0%7C0%7C637602611180753821%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C1000&amp;sdata=Xu5yFqRu8B6xTgDGdqci%2Fx3uFHro3GJohJUEEKF%2B9yA%3D&amp;reserved=0\">\n                    <span>www.atg.wa.gov</span>\n                  </a>\n                  <span>to learn more.</span>\n                </p>\n                <p>\n        Media Contact:\n      </p>\n                <p>\n        Brionna Aho, Communications Director, (360) 753-2727; <a href=\"mailto:Brionna.aho@atg.wa.gov\" data-type=\"email\" translate=\"no\">Brionna.aho@atg.wa.gov</a></p>\n                <p>\n        General contacts: <a href=\"https://gcc02.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.atg.wa.gov%2Fcontact-us&amp;data=02%7C01%7Cask4isd%40atg.wa.gov%7C0bf096ab891d45ee964608d812417366%7C2cc5baaf3b9742c9bcb8392cad34af3f%7C0%7C0%7C637279419610422508&amp;sdata=PzhwyIXAt%2BkDcboe1WdQ8KJzywjGLcKK%2F3KydRC3vgQ%3D&amp;reserved=0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Click here</a></p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"http://www.atg.wa.gov/news/news-releases/ag-ferguson-amazon-will-pay-25-million-over-illegal-sales-regulated-pesticides\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Washington State Office of Attorney General</strong> published this content on <strong>22 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>22 November 2021 21:59:15 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Washington State Office of Attorney General</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Washington-State-Office-of-Attorney-General</p></div>"}