{"date": "2021-12-17 22:35:06.142000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3377.42, "close": 3341.58}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>NEW DELHI</p></div><div class=\"tr-npp-lead\"><p>NEW DELHI, Dec. 18 -- India's antitrust agency suspended Amazon.com's 2019 deal with Future Group on Friday, potentially denting the U.S. e-commerce giant's attempts to block the sale of Future's retail assets to an Indian market leader.</p><p>The regulator ruled that the U.S. company had suppressed information while seeking regulatory approval on an investment into Indian retailer Future Group two years ago.</p></div><div class=\"tr-npp-body\"><p>The ruling by the Competition Commission of India (CCI) could have far-reaching consequences for Amazon's legal battles with now estranged partner Future.</p><p>Amazon has for months successfully used the terms of its toehold $200 million investment in Future in 2019 to block the Indian retailer's attempt to sell retail assets to Reliance Industries for $3.4 billion.</p><p>The regulator's 57-page order said it considers \"it necessary to examine the combination (deal) afresh\", adding its approval from 2019 \"shall remain in abeyance\" until then. The CCI's order said Amazon had \"suppressed the actual scope\" of the deal and had made \"false and incorrect statements\" while seeking approvals.</p><p>The CCI also imposed a penalty of around Rs.202 crore on the U.S. company, adding that Amazon will be given time to submit information again to seek approvals, it added. P19 Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}