{"date": "2021-11-18 12:06:46+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <h4>\n                  <strong>TWITCH AND AT&amp;T SCOUT THE NEXT GENERATION OF STREAMERS FOR THE FIRST AT&amp;T \"CLASS OF\" PROGRAM</strong>\n                </h4>\n                <p>\n                  <span>Follow 12 Streamers on Their Journey to Become Career Creators on Twitch</span>\n                </p>\n                <p>\n        Introducing the AT&amp;T Class of 2021, a collaboration between <a href=\"https://twitch.tv/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Twitch</a>, the interactive livestreaming service, and AT&amp;T to provide 12 promising Twitch streamerswith a unique opportunity to elevate their careers to the next level.\n      </p>\n                <p>\n        As part of the Class of 2021, each streamer will receive:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <u>Mentorship</u>: An established Twitch creator will be connected with a cohort of six to provide on- and off-camera guidance on how to turn their passion for streaming into a sustainable career, grow their community and reach new heights on Twitch. Additionally, these established streamers will co-stream their cohorts' broadcasts and direct their viewers to mentees'channels. Mentors for the AT&amp;T Class of 2021 are Alexandra and Andrea Botez, of <a href=\"https://www.twitch.tv/botezlive\" data-type=\"url\" class=\"tr-link\" translate=\"no\">BotezLive</a>, and <a href=\"https://www.twitch.tv/sypherpk\" data-type=\"url\" class=\"tr-link\" translate=\"no\">SypherPK</a>.\n        </li>\n                  <li>\n                    <u>Equipment</u>: An AT&amp;T expert will help explore upgrades to the up-and-coming streaming equipment and studio setups, which may include AT&amp;T Fiber or 5G wireless services with AT&amp;T's <u>Right to You<sup>SM</sup></u> where available. Each streamer will be paired with an AT&amp;T expert to hand deliver and set up their wireless devices at home or the office at no additional cost - as early as the same day the order is placed<sup>9</sup>, where available. That way, each creator can stay connected to their audience anywhere they go.\n        </li>\n                  <li>\n                    <u>Sponsored Stream by AT&amp;T</u>: AT&amp;T will support sponsored streams for each emerging creator -unlocking additional pathways for creators to financially support themselves as streamers.\n        </li>\n                  <li>\n                    <u>Career Amplifications</u>: Each creator will be featured on Twitch's homepage and periodically featured on <a href=\"http://www.twitch.tv/att\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AT&amp;T's Twitch channel</a>. In addition, Twitch and AT&amp;T will feature a select number of Class of 2021 emerging creators in custom AT&amp;T commercials on Twitch that will further build their presence across the service.\n        </li>\n                </ul>\n                <p>\n        \"This custom sponsorship program is about finding the next generation of up-and-coming streamers, celebrating them, and providing the resources and guidance to grow their communities,\" said Lou Garate, Head of Global Sponsorship Sales at Twitch. \"Creators are the heart of Twitch, and we're proud to build a program with AT&amp;T that directly connects with our community's values around creator support.\"\n      </p>\n                <p>\n        On November 19 at 9:30am PT, tune in to <a href=\"http://www.twitch.tv/att\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.twitch.tv/att</a> for the live Class of 2021 selection show, featuring appearances from all participating creators.\n      </p>\n                <p>\n        \"Collaborating with Twitch on the AT&amp;T Class of 2021 is a unique opportunity for us to elevate up-and-coming voices in the content creation space,\" said Sabina Ahmed, assistant vice president of sponsorships and experiential marketing at AT&amp;T. \"So many compelling and innovative streamers are just beginning their journey as creator, and it's an honor for us to help connect them with new audiences, build a community, and provide the right resources to grow their careers.\"\n      </p>\n                <p>\n                  <strong>About AT&amp;T's Gaming &amp; Esports Sponsorships:</strong>\n                </p>\n                <p>\n        AT&amp;T has built powerful connections with key gaming organizations since entering the space and is committed to keeping the gaming fan at the center. Most recently, AT&amp;T and top-tier streamer and content creator Tim \"TimTheTatman\" Betar entered a strategic agreement collaborating on content, events and innovation to showcase AT&amp;T's 5G capabilities.\n      </p>\n                <p>\n        Earlier this year, AT&amp;T became the Official 5G and Fiber Innovation Sponsor of 100 Thieves with a multi-year, organization-wide, esports team sponsorship. AT&amp;T has also launched and crowned winners for competition programs <a href=\"https://about.att.com/story/2021/annihilator_cup.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AT&amp;T Annihilator Cup</a>, its first-ever livestreamed gaming competition, and <a href=\"https://attunlockedgames.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AT&amp;T Unlocked Games</a>, an all-women's game developer competition.\n      </p>\n                <p>\n        In addition, AT&amp;T plans to keep optimizing our 5G and Fiber networks for gaming with technologies like edge compute and network slicing, to help deliver gaming at the lowest possible latency. This has the potential to enable game publishers to create new experiences powered by the cloud and AT&amp;T networks, for next-gen gaming at home and on the move.\n      </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://about.att.com/newsroom/2021/twitch-2021-streamers.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>AT&amp;T Inc.</strong> published this content on <strong>18 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>18 November 2021 12:06:46 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - AT&T Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AT&amp;T-Inc.</p></div>"}