{"date": "2022-01-11 12:11:24.655000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">Kinaxis Announced as a Founding Member of Zero100</p>\n<p>OTTAWA, ON, Jan. 11, 2022</p>\n<p>Launching new supply chain innovators community to pioneer a transformative vision for digitization, sustainability and people development</p>\n<p>\n<span>OTTAWA, ON</span> , <span>Jan. 11, 2022</span> /CNW/ - <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3408716-1&amp;h=85373096&amp;u=http%3A%2F%2Fwww.kinaxis.com%2Fen%2F&amp;a=Kinaxis\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Kinaxis</a>\n<span>®</span> Inc. (TSX: KXS), the authority in driving agility for fast, <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3408716-1&amp;h=448207013&amp;u=https%3A%2F%2Fc212.net%2Fc%2Flink%2F%3Ft%3D0%26l%3Den%26o%3D2465681-1%26h%3D4044876296%26u%3Dhttps%253A%252F%252Fwww.kinaxis.com%252Fen%252Fwhy-rapid-response%26a%3Dconfident%2Bsupply%2Bchain%2Bdecisions&amp;a=confident+decision-making\" data-type=\"url\" class=\"tr-link\" translate=\"no\">confident decision-making</a> in an unpredictable world, announced today it is a founding member of <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3408716-1&amp;h=2308087288&amp;u=https%3A%2F%2Fzero100.com%2F&amp;a=Zero100\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Zero100</a> . Zero100 is launching a new, community-based education and research platform to connect, inform, and inspire the new generation of leaders to invent supply chains that are zero carbon and 100% digital.</p>\n<p>Zero100 is co-founded by ex-Amazon, SCM World, Bill &amp; Melinda Gates Foundation, and Deloitte leaders. Kinaxis joins founding members from other leading consumer, industrial and tech brands, including Google, Unilever, Schneider Electric and more who are re-imagining the production, distribution and consumption of physical goods around the world.</p>\n<p>\"The importance of global sustainability and supply chains have never been more apparent. As a leader within the supply chain ecosystem, we have a responsibly to ensure that we are shaping the future of supply chains to constantly be improving,\" said <span>John Sicard</span> , CEO of Kinaxis. \"As a founding member of Zero100, we are investing in the future of supply chains to meet the evolving challenges of digital transformation, environmental sustainability and the development of the next generation of supply chain practitioners. We continue to believe the craft of supply chain is at an inflection point and look forward to sharing our expertise from the global Kinaxis community.\"</p>\n<p>Kinaxis continues to make commitments to creating a better future, as reflected by the company's core values and its core ESG commitments: protecting our planet, taking care of people, giving back and building trust. See the company's <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3408716-1&amp;h=2147086188&amp;u=https%3A%2F%2Fwww.kinaxis.com%2Fen%2Fenvironmental-and-social-governance&amp;a=2021+Global+Impact+Report\" data-type=\"url\" class=\"tr-link\" translate=\"no\">2021 Global Impact Report</a> for more information.</p>\n<p>\n<span>About Kinaxis Inc.</span>\n</p>\n<p>Everyday volatility and uncertainty demand quick action. Kinaxis® delivers the agility to make fast, confident decisions across integrated business planning and the digital supply chain. People can plan better, live better and change the world. Trusted by innovative brands, we combine human intelligence with AI and concurrent planning to help companies plan for any future, monitor risks and opportunities and respond at the pace of change. Powered by an extensible, cloud-based platform, Kinaxis delivers industry-proven applications so everyone can know sooner, act faster and remove waste. For more Kinaxis news, visit <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3408716-1&amp;h=936354698&amp;u=https%3A%2F%2Fwww.kinaxis.com%2Fen%2Fnews&amp;a=Kinaxis.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Kinaxis.com</a> or follow us on <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3408716-1&amp;h=1652507801&amp;u=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fkinaxis%2F&amp;a=LinkedIn\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LinkedIn</a> or <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3408716-1&amp;h=1229750608&amp;u=https%3A%2F%2Ftwitter.com%2Fkinaxis&amp;a=Twitter\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Twitter</a> .</p>\n<p>\n<span>Forward-Looking Statements</span>\n</p>\n<p>Certain statements in this release constitute forward-looking statements within the meaning of applicable securities laws. Forward-looking statements include statements as to Kinaxis' growth opportunities and the potential benefits of, and demand for, Kinaxis' products and services. These statements are subject to certain assumptions, risks and uncertainties, including our view of the relative position of Kinaxis' products and services compared to competitive offerings in the industry. Readers are cautioned not to place undue reliance on such statements. Kinaxis' actual results, performance, achievements and developments may differ materially from the results, performance, achievements or developments expressed or implied by such statements. Risk factors that may cause the actual results, performance, achievements or developments of Kinaxis to differ materially from the results, performance, achievements or developments expressed or implied by such statements can be found in the public documents filed by Kinaxis with Canadian securities regulatory authorities. Kinaxis assumes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as expressly required by law.</p>\n<p>SOURCE Kinaxis Inc.</p>\n<p>View original content: <a href=\"http://www.newswire.ca/en/releases/archive/January2022/11/c9327.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/January2022/11/c9327.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}