{"date": "2022-01-05 02:00:33.638000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>the Delhi High Court on Tuesday dismissed the plea by Future group companies seeking to quash the ongoing arbitration proceedings in Singapore with Amazon relating to the Rs 24,500-crore merger deal with Reliance Retail. With this order, the arbitration proceedings initiated by Amazon against Future Retail (FRL) over the merger deal will go as per schedule on January 5.</p><p>Dismissing the plea filed by FRL and Future Coupons (FCPL) the court said that mere fixation of tight timelines or denial of requests for adjournment or deciding the order in which the pleas filed by the parties will be taken up cannot be reason enough to contend that the orders of the tribunal are perverse or lacking in inherent jurisdiction.</p></div><div class=\"tr-npp-body\"><p>Justice Amit Bansal in his order said \"no grounds are made out for interference in the present petitions\" and the arbitrators have far greater flexibility in adopting procedure to conduct the arbitration proceedings as compared to a civil court.</p><p>Stating that it's not for the court to interfere with the scheduling of the arbitration proceedings as sought by Future, the HC said the arbitral tribunal has the sole discretion to decide whether the termination applications should be heard before or after the hearings of the expert witnesses. It also noted that the tribunal had been accommodating towards all parties as it had cut short the scheduled four days' hearing of expert witnesses to three and the fourth day, i.e. January 8 has been fixed for hearing the termination applications filed by FRL.</p><p>Copyright 2022 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}