{"date": "2022-01-19 11:46:25.569000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> has postponed its plan to stop customers using Visa credit cards at the last minute.</p><p>The company had said that it would refuse to accept the cards from 19 January, blaming the \"high fees Visa charges for processing credit card transactions\". The plan caused confusion and difficulties for those customers with the cards, who were set to be locked out of purchasing at Amazon.</p></div><div class=\"tr-npp-body\"><p>But it has now said that change will not take place on Wednesday, and that Amazon and Visa are working on a \"potential solution\" to allow people to keep using their credit cards. It announced the postponement in a letter to customers as well as a press statement, and gave no information about what that solution might be.</p><p>Visa confirmed the news. \"Amazon customers can continue to use Visa cards on Amazon.co.uk after January 19 while we work closely together to reach an agreement,\" it said in a statement.</p><p>Amazon did not rule out bringing the changes back in the future. But it said that it would give \"advance notice\" of any changes, and customers could continue using Visa credit and debit cards as normal until then.</p><p>When Amazon announced the change, in November, it said that it no longer wished to pay what it said were overly high processing fees required when its customers use their Visa credit cards.</p><p>But Visa accused Amazon of \"threatening to restrict consumer choice in the future\". \"When consumer choice is limited, nobody wins,\" it said then.</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/life-style/gadgets-and-tech/tesla-battery-electric-car-b1994523.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Tesla travels 1,200km on a single charge with breakthrough battery</a> </p><p><a href=\"https://www.independent.co.uk/life-style/gadgets-and-tech/safari-bug-browsing-history-google-b1994490.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Safari bug has revealed people's browsing history and personal information for months</a> </p><p><a href=\"https://www.independent.co.uk/life-style/gadgets-and-tech/bitcoin-price-news-live-crypto-btc-b1994430.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Bitcoin set for 'interesting week' as major test approaches – follow live</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 Independent, The (UK) (Online). All rights reserved.</p></div>"}