{"date": "2021-11-05 03:02:25.813000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3384.0, "close": 3518.99}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Nov. 5 -- A man from Kerala's Wayanad district placed an order on Amazon for a passport pouch and received a passport inside it, according to a report.</p><p>The News Minute reported that Mithun Babu, a resident of Kaniyambetta village in Wayanad, placed the order for the passport pouch on October 30 and received it two days later. Babu found a passport inside one of the pockets of the passport pouch when he opened it. \"At first, I mistook it for a dummy passport. However, upon closer inspection, I realised I had received an original passport, belonging to a Thrissur native,\" Babu was quoted as saying by the website.</p></div><div class=\"tr-npp-body\"><p>He said he immediately contacted Amazon customer care but they responded saying they will be careful in the future. So he contacted the owner of the passport, Muhammed Salih, based on the address on the travel document.</p><p>According to Babu, Salih ordered the same pouch from Amazon and but later decided to return it. However, he forgot to take out his passport before returning the order.</p><p>\"This was a mistake from the seller on Amazon. They did not check the returned product, and sent it again by repackaging it,\" Babu said.</p><p>He added that he was surprised by the reaction of the customer care service, which he said neither took responsibility for the oversight nor guided him on what to do next.</p><p>Last month, a man from Aluva in Ernakulam district ordered an iPhone from Amazon and received a soap bar and a Rs.5 coin instead. The police launched an investigation and found that the iPhone was being used by someone in Jharkhand since September 25. Noorul Ameen later told Mathrubhumi.com that his account has been credited with the amount he paid to buy the phone. Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}