{"date": "2021-12-07 13:35:10.905000+00:00", "ticker": "III", "mrkt_info": {"open": 1400.0, "close": 1405.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENBRIDGE INC (\"ENB-TN\")\n- 2022 Financial Guidance, Increases Dividend, and Provides Update\n- On Strategic Priorities\n\n     Enbridge Inc. (Enbridge or the Company) announced its 2022 financial\nguidance and dividend, and provided an update on its strategic priorities,\nwhich will be further discussed at the Company's investor conference today\nin Toronto. A virtual broadcast of the event is also available for\nregistered participants.\n\n     Highlights\n\n//st\n\n  * Reaffirmed 2021 full year guidance range for adjusted earnings before\n    interest, income taxes and depreciation (EBITDA) of $13.9 billion to\n    $14.3 billion and distributable cash flow (DCF) per share of $4.70 to\n    $5.00\n  * Announced 2022 financial guidance for EBITDA of $15.0 to $15.6 billion\n    and DCF per share of $5.20 to $5.50, reflecting midpoint growth of 9%\nand\n    10% respectively, relative to 2021 guidance\n  * 5-7% average annual DCF per share growth outlook extended through 2024\n  * The Company declared its 27th consecutive annual common share dividend\n    increase, raising it by 3% to $0.86/quarter ($3.44 annually), effective\n    March 1, 2022\n  * Announced its intent to establish a normal course issuer bid program,\n    allowing for the repurchase of up to $1.5 billion of its outstanding\nits\n    common shares\n  * Sanctioned $1.1 billion of new capital projects adding to its organic\n    growth capital backlog, which is expected to drive significant EBITDA\n    generation through 2024\n  * Up to $6 billion per year of highly visible conventional and low-carbon\n    organic growth opportunities support post-2024 cashflow growth\n  * Entered into a Memorandum of Understanding with Capital Power to\ndevelop\n    a carbon capture and sequestration hub in Alberta\n\n//et\n\n     CEO Comment\n\n     Commenting on the Company's outlook, Al Monaco, President and CEO of\nEnbridge, noted the following:\n\n     \"Strong execution of our strategic priorities in 2021 provides a solid\nfoundation for next year and our 3-year outlook. Our assets have been\nhighly utilized, reflecting strong end-user demand and the critical role\nthey play in delivering reliable and affordable energy. Recent global\nenergy shortages have confirmed again that our assets will remain\nessential, while our early low-carbon energy investments illustrate how our\nassets will be a bridge to a cleaner energy future.\n\n     \"Last year, we set new ESG goals to reduce emissions to Net Zero and\nimprove diversity. This year, we've lowered emissions, increased workforce\nand Board diversity, and integrated our ESG goals into enterprise-wide\nbusiness plans and compensation to drive future performance.\n\n     \"This year, we've placed $10 billion of growth capital into service,\nwhich will generate significant cash flow growth in 2022. This is also\nexpected to drive our leverage metric to the lower end of our 4.5-5.0x\ndebt-to-EBITDA target range, providing us with additional financial\ncapacity to grow the business. Going forward, our value proposition will\ncontinue to emphasize a strong balance sheet and return of capital to\nshareholders.\n\n     \"We are pleased to be growing our 2022 dividend by 3%, marking our\n27th straight year of increases. This is consistent with our objective to\ngrow dividends ratably up to the level of our medium-term average annual\nDCF per share growth outlook of 5 to 7% (through 2024), while targeting the\nmidpoint of our payout range of 60-70%.\n\n     \"We've also announced our intent to file a notice of intention to make\na normal course issuer bid before year end. Implementing a normal course\nissuer bid will provide flexibility to repurchase up to $1.5 billion of our\ncommon shares and create an additional avenue to supplement the return of\ncapital to shareholders, while increasing per share earnings and\ndistributable cash flow.\n\n     \"One of our mantra's at Enbridge is the disciplined deployment and\nallocation of capital. Looking forward to our 3-year planning horizon, we\nexpect to have $5-6 billion of annual investment capacity, of which $3-4\nbillion is prioritized to core low capital intensity and utility-like\ninvestments. The remaining $2 billion will be deployed to the next best\nalternatives and benchmarked against share repurchases.\n\n     \"Our organic growth will be focused on enhancing existing asset\nreturns, modernizing our assets, and low capital intensity opportunities\nwithin our conventional businesses to serve growing domestic and export\nmarket demand. We also plan to continue to invest in low-carbon\nopportunities that leverage our existing assets and provide a platform for\nfuture growth.\n\n     \"Today's announcement of $1.1 billion of newly sanctioned growth\nprojects, along with the $1 billion announced earlier this year,\ndemonstrates the size and quality of our opportunity set, and how we're\nadvancing our growth strategies across the business.\n\n     \"We're confident that our assets will be an integral source of energy\nsupply for decades to come and are excited by the future low-carbon\ninvestment opportunities that we see. Through 2024, our secured capital\nprogram along with embedded revenue escalators and continued focus on\nproductivity improvements provide us with confidence that we can grow DCF\nper share by 5-7% per year on average.\n\n     \"We believe that our strategic plan continues to provide investors\nwith a compelling total shareholder return value proposition, which\ncombines highly predictable cash flows, an attractive organic growth\noutlook and a ratable return of capital to shareholders.\"\n\n     Strategic Priorities and Three-Year Financial Outlook\n\n     The Company's 2022 Strategic Plan priorities continue to reinforce the\nresilience, longevity and organic growth potential of its cash flows over\nthe long-term. Enbridge's 3-year plan priorities include:\n\n//st\n\n  * Ensure safe and reliable operations while providing cost-efficient\n    transportation solutions for Enbridge's customers;\n  * Execute on ESG goals to lower emissions and increase workforce\ndiversity;\n  * Maintain sector leading balance sheet strength and financial\nflexibility\n  * Maximize asset returns and deliver on the secured capital program, to\n    drive cash flow growth through 2024;\n  * Disciplined investment of $5-6 billion of investment capacity to\nmaximize\n    shareholder value, prioritizing low-capital intensity and utility\n    investments.\n\n//et\n\n     2022 Financial Outlook\n\n     Enbridge is providing 2022 guidance for EBITDA of $15.0 billion to\n$15.6 billion and DCF per share of between $5.20 to $5.50 per share.\n\n     Performance drivers in 2022 include: continued volume recovery on the\nLiquids' Mainline System; a full year of the full Line 3 Replacement\nsurcharge; a full year contribution from the Ingleside Energy Center\nacquisition; contributions from Gas Transmission projects brought into\nservice in 2021; customer additions in the gas utility; and continued but\nmoderating losses in Energy Services.\n\n     Separately, Enbridge announced that the quarterly dividend for 2022\nwill be increased from $0.835 to $0.86 per share, commencing with the\ndividend payable on March 1, 2022, to shareholders of record on February\n15, 2022.\n\n     Business Updates\n\n     New Sanctioned Growth\n\n     Today, the Company announced that it has sanctioned $1.1 billion of\nnew capital projects adding to its organic growth capital backlog, which is\nexpected to drive EBITDA generation through 2024, consistent with its\nlow-risk commercial model. The announcement includes:\n\n//st\n\n  * $0.5 billion expansion to the Valley Crossing Pipeline to serve\n0.72bcf/d\n    of natural gas supply to the proposed Texas LNG export facility in\n    Brownsville, Texas, subject to a final investment decision on the\nexport\n    facility;\n  * $0.3 billion Dawn-to-Corunna expansion of the Dawn to Parkway system,\n    ensuring reliable regional natural gas supply;\n  * $0.2 billion investment in six new solar self-powering facilities\nacross\n    the liquids and natural gas pipelines, which will generate strong\nequity\n    returns and lower emissions, and\n  * $0.1 billion floating offshore wind project off the southern coast of\n    France, reflecting the Company's commitment to renewable leadership and\n    innovation.\n\n//et\n\n     Memorandum of Understanding with Capital Power\n\n     Last week, Enbridge and Capital Power agreed to jointly evaluate and\nadvance a carbon capture and sequestration (CCS) project, with Enbridge as\nthe transportation and storage service provider and Capital Power as the\nCO2 provider, subject to the Government of Alberta's competitive carbon hub\nselection process and a future final investment decision.\n\n     The proposed project would serve Capital Power's Genesee Generating\nStation near Warburg, Alberta which currently provides over 1,200 megawatts\nof baseload electricity generation to Albertans. Capital Power is currently\nrepowering the Genesee 1 and 2 units, to create North America's most\nefficient natural gas combined cycle power generation units, positioning it\nto deliver reliable and affordable electricity for generations to come. The\nGenesee CCS Project is expected to capture up to 3 million tonnes of CO2\nannually from the repowered units, which would be transported and stored\nthrough Enbridge's Open Access Carbon Hub that could also serve several\nother local industrial companies. Subject to the award of carbon\nsequestration rights and regulatory approvals, the proposed project could\nbe in service by late 2026 or early 2027.\n\n     Normal Course Issuer Bid\n\n     The Company intends to file a notice of intention to make a normal\ncourse issuer bid by the end of the year to repurchase up to $1.5 billion\nof its common shares.\n\n     The establishment of a normal course issuer bid is intended to\nsupplement the Company's dividend program. Repurchases made pursuant to the\nCompany's normal course issuer bid are expected to be opportunistic and\nwill be predicated upon maintaining a strong balance sheet and the\navailability and attractiveness of alternative capital investment\nopportunities.\n\n     Details of Enbridge's Investor Conference\n\n     Enbridge's investor conference will be held today at 6:30 a.m. MT\n(8:30 a.m. ET). The conference will be webcast live at Link.\n\n     Details of the webcast:\n\n//st\n\n    When:      Tuesday Dec. 7, 2021\n\n               6:30 a.m. MT (8:30 a.m. ET) to 10:00 a.m. MT (12:00 p.m. ET)\n\n    Webcast:   Sign-up\n\n//et\n\n     Presentations and supporting materials are posted on Enbridge's\nwebsite in 'Events and Presentations'.\n\n     A webcast replay will be available by 4:00 pm ET on Tuesday, December\n7th and a transcript will be posted to Enbridge's website approximately 48\nhours after the event.\n\n     About Enbridge Inc.\n\n     Enbridge Inc. is a leading North American energy infrastructure\ncompany. We safely and reliably deliver the energy people need and want to\nfuel quality of life. Our core businesses include Liquids Pipelines, which\ntransports approximately 25 percent of the crude oil produced in North\nAmerica; Gas Transmission and Midstream, which transports approximately 20\npercent of the natural gas consumed in the U.S.; Gas Distribution and\nStorage, which serves approximately 3.8 million retail customers in Ontario\nand Quebec; and Renewable Power Generation, which owns approximately 1,766\nmegawatts (net) in renewable power generation capacity in North America and\nEurope. The Company's common shares trade on the Toronto and New York stock\nexchanges under the symbol ENB. For more information, visit\nwww.enbridge.com.\n\n     Forward-Looking Information\n\n     Forward-looking information, or forward-looking statements, have been\nincluded in this news release to provide information about Enbridge and its\nsubsidiaries and affiliates, including management's assessment of Enbridge\nand its subsidiaries' future plans and operations. This information may not\nbe appropriate for other purposes. Forward-looking statements are typically\nidentified by words such as \"anticipate\", \"expect\", \"project\", \"estimate\",\n\"forecast\", \"plan\", \"intend\", \"target\", \"believe\", \"likely\" and similar\nwords suggesting future outcomes or statements regarding an outlook.\nForward-looking information or statements included or incorporated by\nreference in this document include, but are not limited to, statements with\nrespect to the following: Enbridge's strategic plan, priorities and\noutlook; 2021 and 2022 financial guidance, including projected DCF per\nshare and adjusted EBITDA and expected growth thereof; expected dividends,\ndividend growth and dividend policy; intended normal course issuer bid and\nrelated filing of notice of intent to make a normal course issuer bid;\nsupply of, demand for and prices of crude oil, natural gas, natural gas\nliquids, (NGL) liquefied natural gas (LNG) and renewable energy; expected\nenergy transition; environmental, social and governance (ESG) goals and\ntargets, including greenhouse gas (GHG) emissions intensity and reduction\ntargets and diversity and inclusion goals, and our plans to achieve such\ngoals and targets; anticipated utilization of our existing assets,\nincluding throughput on the Mainline; expected future cash flows; expected\nshareholder returns; expected performance of the Company's businesses,\nincluding customer growth; financial strength and flexibility and\ninvestment capacity; expectations on sources of liquidity and sufficiency\nof financial resources; expected in-service dates and costs related to\nannounced projects and projects under construction and for maintenance;\nexpected capital expenditures and capital allocation priorities;\nanticipated cost savings; expected future growth and investment\nopportunities, including secured growth program; expected use of new\ntechnologies and the benefits thereof; expected future actions of\nregulators and courts and the timing and anticipated impact thereof; and\ntoll and rate case filings, and the anticipated impact therefrom.\n\n     Although Enbridge believes these forward-looking statements are\nreasonable based on the information available on the date such statements\nare made and processes used to prepare the information, such statements are\nnot guarantees of future performance and readers are cautioned against\nplacing undue reliance on forward-looking statements. By their nature,\nthese statements involve a variety of assumptions, known and unknown risks\nand uncertainties and other factors, which may cause actual results, levels\nof activity and achievements to differ materially from those expressed or\nimplied by such statements. Material assumptions include assumptions about\nthe following: the COVID-19 pandemic and the duration and impact thereof;\nthe expected supply of, demand for and prices of crude oil, natural gas,\nNGL, LNG and renewable energy; expected energy transition; anticipated\nutilization of our existing assets; anticipated cost savings; exchange\nrates; inflation; interest rates; availability and price of labour and\nconstruction materials; operational reliability; customer and regulatory\napprovals; maintenance of support and regulatory approvals for the\nCompany's projects; anticipated in-service dates; weather; the timing and\nclosing of acquisitions and dispositions; the realization of anticipated\nbenefits and synergies of transactions and projects; governmental\nlegislation; litigation; impact of the Company's dividend policy on its\nfuture cash flows; credit ratings; capital project funding; hedging\nprogram; expected EBITDA and expected adjusted EBITDA; expected\nearnings/(loss) and adjusted earnings/(loss); expected earnings/ (loss) or\nadjusted earnings/(loss) per share; expected future cash flows and expected\nfuture DCF and DCF per share; and estimated future dividends. Assumptions\nregarding the expected supply of and demand for crude oil, natural gas,\nNGL, LNG and renewable energy, and the prices of these commodities, are\nmaterial to and underlie all forward-looking statements, as they may impact\ncurrent and future levels of demand for the Company's services. Similarly,\nexchange rates, inflation, interest rates and the COVID-19 pandemic impact\nthe economies and business environments in which the Company operates and\nmay impact levels of demand for the Company's services and cost of inputs,\nand are therefore inherent in all forward-looking statements. Due to the\ninterdependencies and correlation of these macroeconomic factors, the\nimpact of any one assumption on a forward-looking statement cannot be\ndetermined with certainty, particularly with respect to expected EBITDA,\nexpected adjusted EBITDA, expected earnings/(loss), expected adjusted\nearnings/(loss), expected DCF and associated per share amounts, and\nestimated future dividends. The most relevant assumptions associated with\nforward-looking statements regarding announced projects and projects under\nconstruction, including estimated completion dates and expected capital\nexpenditures, include the following: the availability and price of labour\nand construction materials; the effects of inflation and foreign exchange\nrates on labour and material costs; the effects of interest rates on\nborrowing costs; the impact of weather; customer, government and regulatory\napprovals on construction and in-service schedules and cost recovery\nregimes; and the COVID-19 pandemic and the duration and impact thereof.\n\n     Enbridge's forward-looking statements are subject to risks and\nuncertainties pertaining to the realization of anticipated benefits and\nsynergies of projects and transactions, successful execution of our\nstrategic plan and priorities, operating performance, the Company's\ndividend policy, regulatory parameters, changes in regulations applicable\nto the Company's business, litigation, acquisitions and dispositions and\nother transactions, project approval and support, renewals of\nrights-of-way, weather, economic and competitive conditions, public\nopinion, changes in tax laws and tax rates, changes in trade agreements,\npolitical decisions, exchange rates, interest rates, commodity prices,\nsupply of and demand for commodities, and the COVID-19 pandemic, including\nbut not limited to those risks and uncertainties discussed in this and in\nthe Company's other filings with Canadian and United States securities\nregulators. The impact of any one risk, uncertainty or factor on a\nparticular forward-looking statement is not determinable with certainty as\nthese are interdependent and Enbridge's future course of action depends on\nmanagement's assessment of all information available at the relevant time.\nExcept to the extent required by applicable law, Enbridge assumes no\nobligation to publicly update or revise any forward-looking statements made\nin this news release or otherwise, whether as a result of new information,\nfuture events or otherwise. All forward-looking statements, whether written\nor oral, attributable to Enbridge or persons acting on the Company's\nbehalf, are expressly qualified in their entirety by these cautionary\nstatements.\n\n     Non-GAAP Measures\n\n     This news release makes reference to non-GAAP, including adjusted\nearnings before interest, income taxes, depreciation and amortization\n(Adjusted EBITDA), distributable cash flow (DCF) and DCF per share.\nAdjusted EBITDA represents EBITDA adjusted for unusual, non-recurring or\nnon-operating factors on both a consolidated and segmented basis.\nManagement uses Adjusted EBITDA to set targets and to assess performance.\nDCF is defined as cash flow provided by operating activities before the\nimpact of changes in operating assets and liabilities (including changes in\nenvironmental liabilities) less distributions to non-controlling interests\nand redeemable non-controlling interests, preference share dividends and\nmaintenance capital expenditures, and further adjusted for unusual,\nnon-recurring or non-operating factors. Management uses DCF to assess\nperformance of the Company and to set its dividend payout target.\nManagement believes the presentation of these measures gives useful\ninformation to investors and shareholders as they provide increased\ntransparency and insight into the performance of the Company.\n\n     Reconciliations of forward-looking non-GAAP measures to comparable\nGAAP measures are not available due to the challenges and impracticability\nwith estimating some of the items, particularly certain contingent\nliabilities and non-cash unrealized derivative fair value losses and gains\nwhich are subject to market variability. Because of those challenges, a\nreconciliation of forward-looking non-GAAP measures is not available\nwithout unreasonable effort.\n\n     The non-GAAP described above are not measures that have a standardized\nmeaning prescribed by generally accepted accounting principles in the\nUnited States of America (U.S. GAAP) and are not U.S. GAAP measures.\nTherefore, these measures may not be comparable with similar measures\npresented by other issuers. A reconciliation of historical non-GAAP\nmeasures to the most directly comparable GAAP measures is available on the\nCompany's website. Additional information on non-GAAP measures may be found\non the Company's website, www.sedar.com or www.sec.gov.\n\n     FOR FURTHER INFORMATION PLEASE CONTACT:\n\n//st\n\n      Media                       Investment Community\n\n      Jesse Semko                 Jonathan Morgan\n\n      Toll Free: (888) 992-0997   Toll Free: (800) 481-2804\n\n      Email: media@enbridge.com   Email: investor.relations@enbridge.com\n\n//et\n\nTel   : 403-231-3900    ENBRIDGE INC\nFax   : 403-231-5929\nWWW   : <a href=\"https://www.enbridge.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.enbridge.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134000049.MNPRE2134001006-05335520211207</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}