{"date": "2021-12-08 07:52:31.137000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p> <br/>   By Ujjwal Narayan<br/>NewsRise<br/>   NEW DELHI (Dec 8) -- India’s Supreme Court today adjourned a hearing in Future Group’s plea against a lower court order to put on hold the group’s proposed $3.4 billion sale of retail assets to Reliance Industries, amid a dispute with partner Amazon, a lawyer said.<br/><br/>A bench led by Chief Justice NV Ramana set Jan.11 deadline for the next hearing, said the lawyer, who did not wish to be named. <br/><br/>Billionaire Mukesh Ambani’s Reliance Industries had, last year, agreed to buy the retail, wholesale, warehousing, and logistics businesses of the debt-ridden Future Group. However, the deal has been delayed due to a long-drawn dispute with Amazon.<br/><br/>The dispute started after Amazon sought to block the Reliance deal by getting a freeze order from Singapore arbitration court. <br/><br/>Amazon, which had bought a 49% stake in Future Coupons that owns a 7.3% stake in Future Retail, challenged the proposed sale, citing alleged violation of contractual agreements.<br/><br/>Future Coupons moved the Supreme Court, after the Delhi High Court in October rejected its plea seeking a stay on Singapore arbitrator’s ruling.<br/><br/>The deal with Reliance is crucial for Future Group that is on the brink of liquidation. <br/><br/>Future Group and Reliance had, earlier this year, agreed to extend the deadline to complete the merger to Mar. 31, 2022 from September-end.<br/><br/>The Supreme Court had, in September, stayed all proceedings in the case, directing authorities such as National Company Law Tribunal, Securities and Exchange Board of India and Competition Commission Of India to not pass any final order related to the deal.<br/><br/>The bench, led by Justice Ramana, is also hearing a plea by Amazon challenging the Delhi High Court’s order directing India’s competition watchdog to expedite a decision on the validity of U.S. company’s investment in Future Coupons.<br/><br/>Shares of Future Enterprises rose 0.9% to 8.95 rupees, while those of Future Retail gained 0.5% to 49.10 rupees in Mumbai trading today. The S&amp;P BSE Sensex advanced 1.4%. <br/>   - By Ujjwal Narayan; Ujjwal.Narayan@newsrise.org; 01166767700<br/>- Edited by Dhanya Ann Thoppil<br/>- Send Feedback to feedback@NewsRise.org<br/>- Copyright (c) 2021 NewsRise Financial Research &amp; Information Services Pvt. Ltd.<br/>    </p></div>"}