{"date": "2021-11-11 19:51:13+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3482.05, "close": 3525.15}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By David Randall</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW YORK, Nov 11 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>If trading in the shares of Amazon, Microsoft, Facebook and other billionaire-owned companies is any indication, Tesla co-founder Elon Musk <span class=\"tr-strong\">unloading part of his stake </span>in the company may not be bad for the electric carmaker’s shares over the long term.</p><p><span class=\"tr-strong\">Musk, who sold roughly $5 billion worth Tesla shares over the last few days, will remain by far the largest single shareholder in Tesla, with approximately 15.5% of the company's outstanding shares after the full sale is completed</span>. Amazon founder Jeff Bezos, by comparison, owns about 14% of the online retailer, while Mark Zuckerberg owns about 14% of Facebook parent Meta Platforms Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a> and controls a majority of its Class B stock. </p><p>Bezos, Zuckerberg and Microsoft’s Bill Gates have all sold billions of dollars worth of stock this year, with little discernible impact on their companies’ share price, analysts and investors said. </p><p>Tesla, of course, is not easily comparable to those companies, nor Musk to their billionaire founders. Shares of Tesla are up more than 1,400% over the last two years and trade at a whopping 346 times earnings, and the company tends to elicit extreme opinions from institutional and retail investors. </p><p>Musk, for his part, is notoriously active on Twitter -- where he asked polled users on whether he should sell 10% of his stake -- and is at least as divisive as the company he co-founded. His recent activity raised questions about a potential <a href=\"https://www.reuters.com/business/tesla-shares-fall-after-musks-twitter-poll-backs-stake-sale-2021-11-08\" data-type=\"url\" class=\"tr-link\" translate=\"no\">violation</a> of a 2018 settlement with the <span class=\"tr-strong\">Securities and Exchange Commission requiring him to have material tweets vetted by a lawyer</span>.</p><p>Still, many on Wall Street believe the impact of Musk's potential stock sale may be overblown. <span class=\"tr-strong\">Tesla shares are down nearly 15% from their Nov. 4 peak, falling following the Twitter poll and rebounding later in recent sessions. They were down 0.5% in choppy trading on Thursday. </span></p><p>     Tesla did not respond to a request for comment.</p><p>    </p><p><span class=\"tr-strong\">'SMART MOVE'</span></p><p>Musk selling 10% of his stake in the company is sensible given the surge in the company's shares, which <span class=\"tr-strong\">are </span>up more than 50% year-to-date, said Ross Gerber, president of wealth management firm Gerber Kawasaki <span class=\"tr-strong\">and </span>a long-standing shareholder in Tesla.</p><p>“Every major tech entrepreneur and bitcoin owner is cashing out huge amounts of capital right now for huge profit so for Musk to take some money off the table is a smart move and he just announced it in a very Muskian way,” Gerber said. </p><p>Meanwhile, “Bezos sells $2 billion and nobody blinks,\" he added, referring to Bezos's sale of approximately $2 billion worth of Amazon stock in early November. </p><p>Bezos has sold approximately $8.8 billion worth of Amazon stock this year, and sold roughly $10 billion worth of Amazon stock last year, the proceeds of which he has used in part to fund his space tourism company known as Blue Origin. </p><p>Those sales have likely had a \"negligible\" impact on the stock price of Amazon.com, said Anthony Chukumba, an analyst at Loop Capital. <span class=\"tr-strong\">Amazon’s shares are up 7.8% this year, underperforming the S&amp;P 500’s 23.8% gain as investors have moved into cyclical stocks and rotated out of last year's strong performers. </span></p><p>\"No one really … thinks Bezos has less confidence in the company’s prospects. Amazon is so big and so liquid it doesn’t really move the needle,\" he said. </p><p>Zuckerberg, meanwhile, has sold shares nearly every day this year through a periodic sale agreement. Those sales have had no \"discernable\" impact on the company's share price, said Joe Bonner, an analyst at Argus Research. Shares of the company are up 20.7% this year.</p><p>The closest comparison to Musk's decision to sell part of his stake may be Bill Gates, who divested his ownership in Microsoft by selling more than 20 million shares each quarter for more than a dozen years, analysts said. </p><p>Microsoft's shares continued to rise despite that consistent selling in part because investors saw the sales as part of Gates' plan to give to charity and not an indication of his faith in the company, said Dan Ives, an analyst at Wedbush Securities who has an outperform rating on Tesla shares.</p><p>Musk's selling aside, investors who have a bone to pick with Tesla have found plenty of targets.</p><p><span class=\"tr-strong\">George Schultze, head of Schultze Asset Management, said the share sales, together with Tesla's high valuation at a time when automakers such as General Motors <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GM.N\" data-type=\"ric\" data-ric=\"GM.N\" translate=\"no\" dir=\"ltr\">GM.N</a> are expanding into the electric vehicle market, suggest Tesla's rally may cool.</span></p><p><span class=\"tr-strong\">\"If you put it all together it’s a sign of potential market top in Tesla stock,\" he said.</span></p><p>    </p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by David Randall; Editing by Ira Iosebashvili and Nick Zieminski)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:David.Randall@thomsonreuters.com\" data-type=\"email\" translate=\"no\">David.Randall@thomsonreuters.com</a> ; 646-223-6607; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://david.randall.thomsonreuters.com@reuters.net\">david.randall.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: TESLA-MUSK/STAKE-BILLIONAIRES (ANALYSIS, PIX)</p></div>"}