{"date": "2021-12-20 21:30:59+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds more details from letter</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Dec 20 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>U.S. Senators Marco Rubio and Sherrod Brown on Monday asked the Labor Department for a full investigation into Amazon.com Inc's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> labor practices.</p><p>Rubio, a Republican, and Brown, a Democrat who chairs the Banking Committee, wrote <span class=\"tr-strong\">in a letter that </span>about \"one out of every 170 U.S. workers is an Amazon employee, underscoring our particular interest in ensuring that the company's employment practices are fair, and in accordance with the law. We urge you to use every mechanism at your disposal to investigate Amazon's labor and employment practices immediately.\"</p><p>T<span class=\"tr-strong\">he lawmakers noted that the National Labor Relations Board had found that Amazon wrongfully terminated a worker who complained about unsafe working conditions during the coronavirus pandemic as well as two others who criticized Amazon's practices. </span></p><p><span class=\"tr-strong\">The board also ordered a re-run of an election by workers who voted not to unionize because Amazon's actions \"made a free and fair election impossible.\"</span></p><p><span class=\"tr-strong\">This month, the lawmakers said, the Occupational Safety and Health Administration said it would investigate the deaths of six people which occurred when an Amazon warehouse in Illinois collapsed during a tornado. </span></p><p><span class=\"tr-strong\">\"Amazon workers have voiced concerns regarding the company’s alleged lack of emergency response training, stringent cellphone policies, and expectations that workers continue to work during tornado warnings,\" the lawmakers said in the letter.</span></p><p><span class=\"tr-strong\">Amazon.com and the Labor Department did not immediately respond to requests for comment on the letter.</span></p><p><br/></p><p class=\"tr-signoff\"> (Reporting by David Shepardson and Diane Bartz<br/>Editing by Sonya Hepinstall)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:David.Shepardson@thomsonreuters.com\" data-type=\"email\" translate=\"no\">David.Shepardson@thomsonreuters.com</a> ; 2028988324; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-AMAZON.COM/CONGRESS (UPDATE 1)</p></div>"}