{"date": "2022-01-16 02:50:15.618000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3242.76, "close": 3125.98}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Jan. 16 -- Amazon India's much awaited 'Great Republic Day Sale' will start from January 17 with great deals and offers until 11:59 pm on January 20. Prime members will get 24 hours early access starting 12:00 AM on January 16, today, which is live. With sellers offering deals across smartphones, consumer electronics, fashion and Beauty, home and kitchen, appliances, TVs, daily essentials and more, customers can shop for products across many categories on Amazon.</p><p>Customers shopping during the Great Republic Day Sale can save more by getting an extra 10% instant discount with SBI Credit Cards and EMI transactions; No-cost EMI using Bajaj Finserv EMI card, and savings using Amazon Pay ICICI Credit card, Amazon Pay Later and select Debit &amp; Credit Cards.</p></div><div class=\"tr-npp-body\"><p>Customers can also get attractive exchange offers- up to Rs.16,000 off on exchange. Customers can save up to Rs.4,500 on shopping during the Pay and Shop Rewards Festival by making daily payments like sending money, paying bills and more to unlock exciting shopping rewards that can be redeemed during the Great Republic Day Sale.</p><p>In addition to this, customers can get instant credit up to Rs.60,000 with Amazon Pay Later along with Rs.150 flat cashback on activation. Customers can also save up to 5% on shopping using their Amazon Pay ICICI Bank Credit Card. Eligible customers who do not have the card can get Rewards up to Rs.1,500 on applying. Eligible customers can further save 10% up to Rs.100 by signing up and shopping with Amazon Pay UPI.</p><p>Here is the list of offers on smartphones:</p><p>1: Smartphone launches such as OnePlus 9RT 5G, Tecno Spark 8 Pro, Tecno Pop 5 LTE, Samsung Galaxy S21 FE 5G, Redmi Note 11T 5G and Xiaomi 11T Pro will be available with exciting bank offers.</p><p>2: New launches for accessories and audio products including OnePlus Buds Z2, Oppo Enco M32 and GOVO will also be on offer.</p><p>3: The iPhone 12 will be available at a starting price of Rs.56,999.</p><p>4: The newly launched OnePlus 9RT 5G will be available with exciting launch offers including Rs.4,000 instant bank discount, exchange offers and No Cost EMI. OnePlus 9 Series 5G will be available starting at Rs.36,999 with extra off with bank discounts, exchange offers and coupons. The OnePlus Nord 2 and OnePlus Nord CE will also see exciting offers during the Great Republic Day sale.</p><p>5: The Redmi Note 11T 5G and Xiaomi 11T Pro 5G will be available with additional bank offers to make the deals even sweeter this Amazon Great Republic Day Sale. The Redmi 9 Series will be available starting Rs.6,999 and the Redmi Note 10 Series which includes Redmi Note 10S, Redmi Note 10 Pro, Redmi Note 10 Pro Max and Redmi Note 10 Lite, will be available starting at Rs.12,999. Also, Xiaomi 11 lite NE 5G will be available at at attractive price of Rs.21,999.</p><p>6: Customers can get Tecno smartphones starting at Rs.6,299.</p><p>7: Customers can get flat Rs.7,000 off on the recently launched Samsung Galaxy M52 5G and on Samsung Galaxy M32 5G.</p><p>8: The Samsung S20 FE 5G will be available from Rs.36,990 with Rs.1500 off on select bank cards.</p><p>9: The iQOO Z3 5G will be available starting at Rs.17,990 and the recently launched iQOO Z5 5G will be available with Rs.7,000 off at a starting price of Rs.22,990.</p><p>10: Customers can get up to Rs.5,000 off on Realme and Vivo smartphones during the Amazon Great Republic Day Sale. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}