{"date": "2021-12-06 02:42:51.091000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>At AWS re:Invent, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company, announced two new initiatives designed to make machine learning more accessible for anyone interested in learning and experimenting with the technology. The AWS AI and ML Scholarship is a new education and scholarship program aimed at preparing underrepresented and underserved students globally for careers in machine learning. The program uses AWS DeepRacer and the new AWS DeepRacer Student League to teach students foundational machine learning concepts by giving them hands-on experience training machine learning models for autonomous race cars, while providing educational content centered on machine learning fundamentals. AWS is further increasing access to machine learning through Amazon SageMaker Studio Lab, which gives everyone access to a no-cost version of Amazon SageMaker?an AWS service that helps customers build, train, and deploy machine learning models.</p><p>?The two initiatives we are announcing today are designed to open up educational opportunities in machine learning to make it more widely accessible to anyone who is interested in the technology,? said Swami Sivasubramanian, Vice President of Amazon Machine Learning at AWS. ?Machine learning will be one of the most transformational technologies of this generation. If we are going to unlock the full potential of this technology to tackle some of the world?s most challenging problems, we need the best minds entering the field from all backgrounds and walks of life. We want to inspire and excite a diverse future workforce through this new scholarship program and break down the cost barriers that prevent many from getting started with machine learning.?</p></div><div class=\"tr-npp-body\"><p>New $10 million education and scholarship program is designed to prepare underrepresented and underserved students globally for careers in machine learning</p><p>The World Economic Forum estimates that technological advances and automation will create 97 million new technology jobs by 2025, including in the field of artificial intelligence and machine learning. While the job opportunities in technology are growing, diversity is lagging behind in science and technology careers. Making educational resources available to anyone interested in technology is critical to encouraging a more robust, diverse pipeline of people in artificial intelligence and machine learning careers. The new AWS AI and ML Scholarship aims to help underrepresented and underserved high school and college students learn foundational machine learning concepts and prepare them for careers in artificial intelligence and machine learning. In addition to no-cost access to dozens of hours of free machine learning model training and educational materials, 2,000 qualifying students from underrepresented and underserved communities will win a scholarship for the AI Programming with Python Udacity Nanodegree program, designed to give scholarship recipients the programming tools and techniques fundamental to machine learning. Graduates from the first Nanodegree program will be invited to take a technical assessment. Five hundred students who receive the highest scores in this assessment will earn a second Udacity Nanodegree program scholarship on deep learning and machine learning engineering to help further prepare them for a career in artificial intelligence and machine learning. These top 500 students will also have access to mentorship opportunities from tenured Amazon and Intel technology experts for career insights and advice.</p><p>Delivered in collaboration with Intel and supported by the talent transformation platform Udacity, the AWS AI and ML Scholarship program allows students from around the world to access dozens of hours of free training modules and tutorials on the basics of machine learning and its real-world applications. Students can use AWS DeepRacer to turn theory into hands-on action by learning how to train machine learning models to power a virtual race car. Students who successfully complete educational modules by passing knowledge-check quizzes, meet certain AWS DeepRacer lap time performance targets, and submit an essay will be considered for Udacity Nanodegree program scholarships. Students can also put their virtual race cars to the test in the new AWS DeepRacer Student League. The AWS DeepRacer Student League helps people of all skill levels learn how to build machine learning models with a fully autonomous 1/18th scale race car driven by machine learning, a 3D racing simulator, and a global competition. AWS DeepRacer has been used by enterprises like Capital One, BMW, Deloitte, JP Morgan Chase, Accenture, and Liberty Mutual to teach their employees to build, train, and deploy machine learning models in a hands-on way.</p><p>Amazon SageMaker Studio Lab provides no-cost access to a machine learning development environment to put machine learning in the hands of everyone</p><p>Amazon SageMaker Studio Lab offers a free version of Amazon SageMaker, which is used by researchers and data scientists worldwide to build, train, and deploy machine learning models quickly. Amazon SageMaker Studio Lab removes the need to have an AWS account or provide billing details to get up and running with machine learning on AWS. Users simply sign up with an email address through a web browser, and Amazon SageMaker Studio Lab provides access to a machine learning development environment. Amazon SageMaker Studio Lab provides unlimited user sessions that include 15 gigabytes of persistent storage to store projects and up to 12 hours of CPU and four hours of GPU compute for training machine learning models at no cost. There are no cloud resources to build, scale, or manage with Amazon SageMaker Studio Lab, so users can start, stop, and restart working on machine learning projects as easily as closing and opening a laptop.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}