{"date": "2021-12-13 22:14:36+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds background on tornadoes, comment by Amazon worker, other details</p><p class=\"tr-by\">By Richa Naidu</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">EDWARDSVILLE, Ill., Dec 13 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>The U.S. workplace safety watchdog is investigating the circumstances around the collapse during <a href=\"https://www.reuters.com/markets/commodities/least-64-people-confirmed-dead-kentucky-after-barrage-tornadoes-2021-12-13\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Friday night's storm</a> of an Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> building in Illinois in which six workers died, an official at the U.S. Department of Labor said on Monday.</p><p>The U.S. Occupational Safety and Health Administration (OSHA) has six months to complete its investigation, issue citations, and propose monetary penalties if violations of workplace safety and/or health regulations are found, Scott Allen, a U.S. Department of Labor regional director for public affairs, said via email. He added that compliance officers have been on site since Saturday.</p><p>Six workers were killed when the Amazon warehouse in Edwardsville, Illinois, <a href=\"https://www.reuters.com/world/us/injuries-reported-after-roof-collapse-amazon-warehouse-illinois-ap-2021-12-11\" data-type=\"url\" class=\"tr-link\" translate=\"no\">buckled</a> under the force of a devastating storm, police said. A barrage <a href=\"https://www.reuters.com/markets/commodities/devastated-kentucky-tornado-survivors-pick-through-debris-shelter-with-relatives-2021-12-12\" data-type=\"url\" class=\"tr-link\" translate=\"no\">of tornadoes</a> ripped through six U.S. states, leaving a trail of death and destruction at homes and businesses stretching more than 200 miles (322 km). </p><p>Amazon spokeswoman Kelly Nantel said the company would cooperate with the investigation. \"OSHA investigates all workplace fatalities and we are supporting them,\" she said.</p><p>Responding to a reporter, Illinois Governor J. B. Pritzker said officials are investigating the condition of the warehouse before it gave way.</p><p>\"Already there has been an effort to determine some of the challenges ... if there were any structural issues, what exactly the storm's trajectory was coming in and affecting the various pieces of the building,\" Pritzker said. </p><p><br/></p><p>TORNADO TIMELINE</p><p>The National Weather Service said a tornado hit the area around 8:30 p.m. CST on Friday, intensifying rapidly as it struck the Amazon warehouse. Peak winds were estimated at 150 miles per hour (241 kph), causing severe damage.</p><p>The site received tornado warnings between 8:06 p.m. and 8:16 p.m. before the tornado struck the building at 8:27 p.m., Amazon said. </p><p>Several employees <a href=\"https://www.reuters.com/markets/commodities/amazon-driver-died-bathroom-sheltering-tornado-with-colleagues-2021-12-12\" data-type=\"url\" class=\"tr-link\" translate=\"no\">told Reuters over the weekend</a> that workers had been directed by Amazon managers to shelter in bathrooms after receiving emergency alerts on mobile phones from authorities. At least one worker died there, according to his co-worker.</p><p>Amazon said employees were directed to shelter in place at a designated assembly area at the front of the building, which was near a restroom.</p><p>Some of the workers told Reuters they had mobile phones with them despite what they believed was an Amazon policy preventing them from having the phones in their possession while at work. Amazon said there was no policy preventing employees or contractors from having phones at work. </p><p>Edwardsville, a city of 27,000, is about 18 miles northeast of St. Louis, Missouri. </p><p>The company has three facilities in Edwardsville: the delivery station hit by the storm, as well as a fulfillment center and a sorting station. The delivery station opened in July 2020 to prepare orders for last-mile delivery to customers.</p><p>The site, a compound comprised of a few buildings, has been under heavy private and police security through the weekend, accessible only to relief teams and some Amazon and government officials. The remains of the destroyed warehouse were mostly dismantled, reduced to rubble.</p><p>“It was crazy – I was on my way into the warehouse from Pontoon Beach (Illinois) when it happened. I saw the storm and was trying to get in as quickly as possible,\" said Brady Robison, 22, an Amazon van driver who works at the facility. </p><p>\"I just saw the roof completely tilted up ... it’s messed up that people had to lose their lives while they were at work.”</p><p>At least 45 Amazon employees made it out safely. </p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Richa Naidu in Edwardsville, Ill.<br/>Additional reporting by Caroline Stauffer in Chicago and Jeffrey Dastin in San Francisco<br/>Editing by Vanessa O'Connell, Rosalba O'Brien and Matthew Lewis)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:caroline.stauffer@thomsonreuters.com\" data-type=\"email\" translate=\"no\">caroline.stauffer@thomsonreuters.com</a> ; +1-757-390-0985; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://caroline.stauffer.thomsonreuters.com@reuters.net\">caroline.stauffer.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-WEATHER/TORNADOES-AMAZON.COM (UPDATE 3, PIX)</p></div>"}