{"date": "2021-12-27 15:00:45.397000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3393.39, "close": 3384.02}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Read Article Tally Solutions has collaborated with Amazon Web Services (AWS), the world's most comprehensive and broadly adopted cloud offering, to make Tally Solutions' flagship product TallyPrime available on AWS. This availability will enable all Ta...</p><p>Tally Solutions has collaborated with Amazon Web Services (AWS), the world's most comprehensive and broadly adopted cloud offering, to make Tally Solutions' flagship product TallyPrime available on AWS. This availability will enable all TallyPrime users to run their entire business application remotely anytime, anywhere. <br/><br/> Over the past few years, more so since the pandemic has hit, many SMEs have sought solutions to help them operate their businesses through remote technologies to enable anytime anywhere access of business-critical functions and data. A recent NASSCOM study has said that nearly 60% of SMEs have adopted some form of cloud computing as an indicator towards this, most being at nascent stage of adoption. <br/><br/> The collaboration between Tally Solutions and AWS aims to provide entrepreneurs and their teams access to TallyPrime anytime on any network, using laptops, desktops, or mobile devices so they can do business on the move. With AWS, each customer's data volume is encrypted by default. Security is built into every component of the solution with secure pins, password enabled backups and more. TallyPrime on AWS will empower small and medium entrepreneurs to manage their business more efficiently. <br/><br/> \"While we at Tally Solutions build our next generation cloud and connected infrastructure to bring a series of new advantageous experiences to our customers, this collaboration with AWS will help our customers get access to a more secure infrastructure that will allow anytime access to their data on our current flagship product of TallyPrime.\" <br/><br/> Commenting on the new product offering, Puneet Chandok, President, Commercial Sales, AWS India and South Asia, AISPL said, \"Having easy access to financial and operational data anytime, anywhere, is increasingly important for small and medium businesses as they scale and grow. With TallyPrime running on AWS, Tally customers get the same levels of security, reliability, and availability that our large enterprise and public sector customers demand, without the complexity of managing multiple standalone solutions, licence requirements from multiple vendor offerings, or support options. The cloud also makes data backup and access, and user provisioning and permissions enablement much simpler for SMBs. We believe this offering is a positive step towards enabling more SMBs in India digitally transform their business operations.\" <br/><br/> TallyPrime running on AWS is affordable and the price points were considered thoughtfully to cater to the needs of small businesses, especially during these uncertain times. The solution will work on all Windows, Linux and Mac-based systems when accessed through a browser. The solution will be distributed by Elcom Digital and customer engagements led by a group of Tally's certified partners called TVU Priority partners.</p></div><div class=\"tr-npp-body\"><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}