{"date": "2021-11-30 18:30:22+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Stephen Nellis</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Nov 30 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon.com Inc's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> cloud computing unit on Tuesday introduced two new custom computing chips aimed at helping its customers beat the cost of using chips from Intel Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=INTC.O\" data-type=\"ric\" data-ric=\"INTC.O\" translate=\"no\" dir=\"ltr\">INTC.O</a> and Nvidia Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=NVDA.O\" data-type=\"ric\" data-ric=\"NVDA.O\" translate=\"no\" dir=\"ltr\">NVDA.O</a>.</p><p>With $45.37 billion in sales in 2020, Amazon Web Services (AWS) is the world's biggest cloud computing provider and one of the biggest buyers of data center chips, whose computing power AWS rents out to its customers. Ever since buying a startup called Annapurna Labs in 2015, AWS has worked to develop its own custom chips.</p><p>On Tuesday, the company released the third generation of its \"Graviton\" chip that is designed to compete with central processor from Intel and Advanced Micro Devices <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMD.O\" data-type=\"ric\" data-ric=\"AMD.O\" translate=\"no\" dir=\"ltr\">AMD.O</a>. The \"Graviton3\" is 25% faster than its predecessor, and Dave Brown, vice president of Elastic Compute Cloud at Amazon, told Reuters that the company expects it to provide a better performance per dollar than Intel's chips.</p><p>AWS also said that a new class of chip called Trainium, which is designed to train machine learning computer models and will compete against chips from Nvidia, will soon be available to its customers. AWS expects it to train machine learning models for 40% lower cost than Nvidia's flagship chip.</p><p>AWS still works closely with Intel, AMD and Nvidia - for example, it is working with Nvidia to pair its Graviton processors to providing a way for Android game developer to stream their titles to devices. Brown said AWS wants to keep the computing market competitive by offering an additional chip choice.  </p><p>\"We have thrown down the gauntlet on performance. And I believe that in the years to come, you'll see better performance from all of them - Intel, AMD - on price-performance specifically. That's the thing they have got to keep our customers happy on.\"</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Stephen Nellis in San Francisco; editing by David Evans)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Stephen.Nellis@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Stephen.Nellis@thomsonreuters.com</a> ; (415) 344-4934; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-TECH/</p></div>"}