{"date": "2022-01-12 07:01:14.018000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 1920YS4 Capital PLC12 January 2022</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>12 January 2022</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>S4 Capital plc</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>(\"S <span>4</span> Capital\", \"the Company\" or \"the Group\")</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Merger announcement &amp; trading update</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>Combination between Media.Monks and 4 Mile Analytics, expanding the capabilities of Media.Monks' Data&amp;digital media practice</span>\n</p>\n<p>\n<span>·</span>\n<span>Trading continues in line with market expectations, delivering very strong like-for-like revenue and gross profit/net revenue growth well ahead of the previous guidance</span>\n</p>\n<p>\n<span>S <span>4</span>\n</span>\n<span>Capital</span>\n<span>plc (SFOR.L), the tech-led, new age/new era digital advertising and marketing services company, announces a combination between 4 Mile Analytics and Media.Monks, which significantly expands the capabilities of its Data&amp;digital media practice. The merger augments its global analytics capabilities and expands its client base. 4 Mile Analytics is a leader in data analytics, data engineering, data governance, software engineering, UX design and project &amp; product management.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>4 Mile Analytics was founded in 2017 by Nick Fogler in Santa Cruz, California as a focused data consultancy, with the goal of helping clients extract more value from their data. The company works with Fortune 500 brands to enable custom data experiences leveraging technology from partners such as Looker, Snowflake, Fivetran and Google Cloud. With around 50 data specialists, 4 Mile Analytics generated revenues of approximately $6.5m in 2021and is targeting to double up this year.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Sir Martin Sorrell</span>\n</span>\n<span>, S <span>4</span>\n</span>\n<span>Capital</span>\n<span>Executive Chairman said, \"Understanding and acting on data is at the heart of the</span>\n<span>S <span>4</span>\n</span>\n<span>Capital</span>\n<span>Content, Digital Media and Technology services offering. Therefore, we are delighted to welcome Nick, Sam and their colleagues at 4 Mile Analytics, as we expand our capabilities and partnerships, in particular with Google and their Looker and Google Cloud platforms.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Nick Fogler</span>\n</span>\n<span>, 4 Mile Analytics CEO and Founder, said \"We couldn't be more excited to join forces with Media.Monks and</span>\n<span>S <span>4</span>\n</span>\n<span>Capital</span>\n<span>. We see huge opportunities to bring the offerings of the wider group to our clients and provide even more opportunities for our team.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Tyler Pietz</span>\n</span>\n<span>, Global Executive Vice President, Data, Media.Monks, said \"</span>\n<span>We</span>\n<span>'ve seen incredibly strong demand for data analytics and engineering expertise from our clients. Nick and his team at 4 Mile Analytics will bring additional expertise, scale and clients to one of our fastest expanding service areas.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Trading update</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>S <span>4</span>\n</span>\n<span>Capital</span>\n<span>confirms that trading for the first 11 months and forecasts for December continue in line with market expectations, delivering very strong like-for-like revenue and gross profit/net revenue growth well ahead of the previous latest company guidance of 40% (at almost double the growth in our addressable markets, which are forecast to grow 20-30% in 2021)*.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Operational EBITDA margins improved significantly in the second half, as flagged in the half year report in September and the third quarter statement in November. Even after allowing for the cash consideration paid in respect of mergers recently completed, including 4 Mile Analytics, the Company has monthly net debt ranging between £10 and £30 million, reflecting strong operational cash flow.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Commenting on 2022 prospects <span>Sir Martin Sorrell</span>\n</span>\n<span>, S <span>4</span>\n</span>\n<span>Capital</span>\n<span>Executive Chairman said, \"We are excited about the growth opportunity ahead of us in 2022 and beyond, all incorporated into our fourth three year plan for 2022-24. Our budgets are set at 25% like-for-like gross profit/net revenue growth in line with that three year plan, which seeks to double the size of the company organically and targets an improvement in the operational EBITDA margin back towards previous levels\"</span>\n<span>.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Full year results for 2021 will be announced on 18th March 2022.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>*Addressable Markets: Moffat Nathanson forecast 28.8% digital media spend growth in 2021, Groupm at 29.2%, ZenithOptimedia at 25%. Morgan Stanley forecast Tech Services growth at 21% in 2021. The 9 investment analysts that follow</span>\n<span>S <span>4</span>\n</span>\n<span>Capital</span>\n<span>forecast consensus Gross Profit of £560m for 2021.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Enquiries</span>\n</p>\n<p>\n<span>\n<span>\n</span></span></p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>S <span>4</span> Capital plc</span>\n</p>\n</td>\n<td>\n<p>\n<span>Tel: +44 (0)20 3793 0003</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Sir Martin Sorrell, Executive Chairman</span>\n</p>\n</td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Powerscourt (PR</span>\n<span>adviser</span>\n<span>to</span>\n<span>S <span>4</span> Capital</span>\n<span>plc)</span>\n</p>\n</td>\n<td>\n<p>\n<span>Tel: +44 (0)7970 246 725</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Elly Williamson</span>\n</p>\n</td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Jane Glover</span>\n</p>\n</td>\n<td>\n<p>\n</p></td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>About 4 Mile Analytics</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>4 Mile Analytics is a full-service data consultancy specializing in custom data experiences powered by the Looker platform.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>We believe in the power of compelling data narratives to drive better decision-making. 4 Mile's tailored solutions help our clients move up the ladder of analytic maturity.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Our approach to technology is human-centric: we focus on people and relationships first, valuing diversity, empathy, and respect.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>About</span>\n</span>\n<span>\n<span>S <span>4</span>\n</span>\n</span>\n<span>\n<span>Capital</span>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>S <span>4</span>\n</span>\n<span>Capita</span>\n<span>\n<span>l</span>\n</span>\n<span>(SFOR.L) is the tech-led, new age/new era digital advertising and marketing</span>\n</p>\n<p>\n<span>services company, established by Sir Martin Sorrell in May 2018.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Its strategy is to build a purely digital advertising and marketing services business for global, multinational, regional, local clients and millennial-driven influencer brands. This will be achieved by integrating leading businesses in three practice areas: content, data&amp;digital media and technology services, along with an emphasis on \"faster, better, cheaper\" executions in an always-on consumer-led environment, with a unitary structure.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Digital is by far the fastest-growing segment of the advertising market. S <span>4</span>\n</span>\n<span>Capital</span>\n<span>estimates that in 2021 digital accounted for approximately 60% or $420-450 billion of total global advertising spend of $700-750 billion (excluding over $500 billion of trade promotion marketing, the primary target of the Amazon advertising platform) and projects that by 2022 total global advertising spend will expand to $770-850 billion and digital's share will grow to approximately 65% and by 2024 to approximately 70%, accelerated by the impact of covid-19.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>In 2018,</span>\n<span>S <span>4</span>\n</span>\n<span>Capital</span>\n<span>combined with MediaMonks, the leading AdAge A-listed creative digital</span>\n</p>\n<p>\n<span>content production company led by Victor Knaap and Wesley ter Haar, and then with</span>\n</p>\n<p>\n<span>MightyHive, the market-leading digital media solutions provider for future thinking marketers and agencies, led by Peter Kim and Christopher S. Martin. Since then, MediaMonks and MightyHive have combined with more than 25 companies across content, data&amp;digital media and technology services. For a full list, please see the</span>\n<span>S <span>4</span>\n</span>\n<span>Capital</span>\n<span>\n<span>\n<a href=\"https://www.s4capital.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">website</a>\n</span>\n<span>.</span>\n<span>In August 2021,</span>\n<span>S <span>4</span>\n</span>\n<span>Capital</span>\n<span>launched its unitary brand by merging MediaMonks and MightyHive into Media.Monks, represented by a dynamic logo mark that features MightyHive's iconic hexagon. As the operational brand, Media.Monks underpins</span>\n<span>S <span>4</span>\n</span>\n<span>Capital</span>\n<span>'s agility, digital knowledge and efficiency and is the next step in delivering on its foundational promise to unify content, data&amp;digital media and technology services.</span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Victor Knaap, Wesley ter Haar, Pete Kim, Christopher Martin, Mary Basterfield and Scott Spirit all joined the</span>\n<span>S <span>4</span>\n</span>\n<span>Capital</span>\n<span>Board as Directors. The</span>\n<span>S <span>4</span>\n</span>\n<span>Capital</span>\n<span>Board also includes Rupert Faure Walker, Paul Roy, Daniel Pinto, Sue Prevezer, Elizabeth Buchanan, Naoko Okumoto, Margaret Ma Connolly, Peter Rademaker and Miles Young.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The Company now has well over 7,500 people in 33 countries across the Americas, Europe, the Middle East and Africa and Asia-Pacific and a current market capitalisation of approximately £3.0billion (c.$4.0billion) and would rank inside the FTSE 150. It achieved Unicorn status in a little over one year, unique in the advertising and marketing services industry. Sir Martin was CEO of WPP for 33 years, building it from a £1 million \"shell\" company in 1985 into the world's largest advertising and marketing services company with a market capitalisation of over £16billion on the day he left. Today its market capitalisation is £13.5 billion. Prior to that Sir Martin was Group Financial Director of Saatchi &amp; Saatchi Company Plc for nine years.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>MSCBTMFTMTABMBT</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}