{"date": "2021-08-03 06:30:34+00:00", "ticker": "III", "mrkt_info": {"open": 1293.0, "close": 1307.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><h4>\n      3i invests in MAIT to support future growth\n    </h4><p><strong>3i Group plc ('3i Group') announces that it has agreed to invest c. €60m in MAIT GmbH ('MAIT'), a leading provider of innovative and pioneering digital solutions in the DACH region.</strong></p><p>\n      MAIT Group, headquartered in Rottweil, Germany, provides innovative and pioneering digital solutions in product lifecycle management ('PLM'), enterprise resource planning ('ERP') and IT services generating approx. €120m in sales. More than 550 employees across 21 locations in Germany, Austria and Switzerland develop and implement solutions in close cooperation with their over 5,300 SME customers. As a value-added reseller and strategic implementation partner, MAIT uses the most innovative technologies from market-leading PLM, ERP and IT providers such as Siemens, PTC, SAP-PLM, abas, Comarch, HP and Fujitsu.\n    </p><p>\n      MAIT differentiates itself by looking at digitisation in a holistic way and developing tailored solutions in partnership with its customers. Its excellent service is demonstrated by the fact that c. 60% of its customer relationships have existed for over 10 years. The company has a high level of recurring revenues driven by multi-year maintenance and IT infrastructure contracts.\n    </p><p>\n      MAIT operates in an attractive market which is expected to continue to grow considerably. To take advantage of growth opportunities, medium-sized companies in particular are investing significantly in digital transformation in order to make their processes more efficient and effective. Against the backdrop of the increasing importance of software and IT solutions, demand for PLM, ERP and IT is expected to grow by around 8% annually in the coming years, driven by megatrends such as IoT and Industry 4.0.\n    </p><p>\n      Ulf von Haacke, Partner, 3i, commented: 'MAIT is uniquely positioned at the intersection of PLM, ERP and managed IT services and has significant penetration growth potential, as well as multiple strategic M&amp;A opportunities in a highly fragmented market. This makes it an exciting and attractive platform investment for 3i and we are looking forward to working with the excellent management team, and leveraging our other successful partnerships in the technology and software sector, to continue MAIT's profitable growth trajectory.'\n    </p><p>\n      Stefan Niehusmann, Managing Director of MAIT, said: 'As the management team, Kurt Gürtler, Axel Schmied, Oliver Spölgen and I are convinced that 3i will be a great partner for the next stage of MAIT's growth, particularly in supporting our M&amp;A strategy. 3i has a strong track record in the IT services sector and heritage in the DACH region. In addition, the 3i team has an impressive international network which will be very valuable to MAIT.'\n    </p><p>\n      Kamy Niroumand, former Chief Sales Officer at T-Systems and current Chairman of HR management software provider P&amp;I, will join the Advisory Board as Chairman.\n    </p><p><strong>-ENDS-</strong></p><p><strong>For further information, contact:</strong></p><div><div class=\"story-table-container\"><table class=\"story-basic-table\"><tbody><tr><td><p><strong>3i Group plc</strong></p></td></tr><tr><td><p>\n                Silvia Santoro<br/>\n                 Investor enquiries\n              </p></td><td>\n              Tel: +44 20 7975 3258<br/>\n               Email: <a href=\"mailto:silvia.santoro@3i.com\" data-type=\"email\" translate=\"no\">silvia.santoro@3i.com</a></td></tr><tr><td><p>\n                Imogen Harvey<br/><span>Media enquiries</span></p></td><td>\n              Tel: +44 20 7975 3027<br/>\n               Email: <a href=\"mailto:imogen.harvey@3i.com\" data-type=\"email\" translate=\"no\">imogen.harvey@3i.com</a></td></tr></tbody></table></div></div><p><strong>About 3i Group</strong></p><p>\n      3i is an investment company with two complementary businesses, Private Equity and Infrastructure, specialising in core investment markets in Northern Europe and North America.\n    </p><p>\n      3i's Private Equity team provides investment solutions for growing companies, backing entrepreneurs and management teams of mid-market companies with an EV typically between €100m - €500m. We back international growth plans, providing access to our network and expertise to accelerate the growth of companies across the consumer, industrial, healthcare and business and technology services industries.\n    </p><p>\n      For further information, please visit: <a href=\"http://www.3i.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.3i.com</a></p><p><strong>About MAIT</strong></p><p>\n      MAIT Group is the partner for innovative digital solutions in product lifecycle management, enterprise resource planning and IT services. The company serves over 5,300 customers generating sales of €120 million.\n    </p><p>\n      More than 550 MAITs (a neologism made up of 'mate' for partner, 'IT' and 'AI' for artificial intelligence) implement specific solutions in close cooperation with their customers at 21 locations in Germany, Austria and Switzerland. At eye level. Pioneering. As a value added reseller, MAIT uses the most innovative technologies from market-leading PLM, ERP and IT providers such as Siemens, PTC, SAP-PLM, abas, Comarch, HP and Fujitsu.\n    </p><p><strong>Regulatory information</strong></p><p>\n      This transaction involved a recommendation of 3i Investments plc, advised by 3i Germany.\n    </p><p><a href=\"https://www.3i.com/media/5362/mait-press-release-03082021.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Download this press release</a></p><div id=\"public_attachments\"><p><strong>Attachments</strong></p><ul class=\"bulleted-list arrowlist\"><li><a href=\"https://www.3i.com/media-centre/corporate-and-portfolio-news/2021/3i-invests-in-mait-to-support-future-growth/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a></li></ul></div><div id=\"public_disclaimer\"><p><strong>Disclaimer</strong></p><p><strong>3i Group plc</strong> published this content on <strong>03 August 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>03 August 2021 06:30:34 UTC</strong></p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - 3i Group plc</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: 3i-Group-plc</p></div>"}