{"date": "2022-02-04 16:56:42.631000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2776.91, "close": 3158.71}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SUN COUNTRY AIRLINES HOLDINGS INC (\"SNCY-Q\")\n- Statement\n\n     Sun Country Airlines issued a response to the following irregular\nflight incident.\n\n     At approximately 1:18 a.m. PT, Sun Country 110, scheduled to operate\nbetween Las Vegas' McCarran International Airport (LAS) and\nMinneapolis/Saint Paul International Airport (MSP), returned to LAS shortly\nafter takeoff. Upon landing, the aircraft's right landing gear\nmalfunctioned, causing the aircraft to stop on the runway.  Las Vegas\nEmergency Response personnel responded to the aircraft and all 50\npassengers and six crew members were safely deplaned via an airstairs\nbefore being transported to the terminal. At this point there is no report\nof injuries.\n\n     Sun Country has activated its emergency response plan and is\nresponding to this incident in coordination with local authorities and the\nNTSB.\n\n     \"We will first and foremost take care of our passengers and crew,\"\nsaid Sun Country CEO Jude Bricker. \"We will then fully investigate this\nincident to understand what happened.\"\n\n     About Sun Country\n     Sun Country Airlines is a new breed of hybrid low-cost air carrier\nthat dynamically deploys shared resources across our synergistic scheduled\nservice, charter and cargo businesses. Based in Minnesota, we focus on\nserving leisure and visiting friends and relatives (\"VFR\") passengers and\ncharter customers and providing CMI service to Amazon, with flights\nthroughout the United States and to destinations in Mexico, Central\nAmerica, Canada, and the Caribbean.\n\n\n\nTel   : 651-681-3900    SUN COUNTRY AIRLINES HOLDINGS INC\nWWW   : <a href=\"https://www.suncountry.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.suncountry.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203400228.MNPRE2203400908-07480720220204</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}