{"date": "2022-01-10 13:00:01.607000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b class=\"bwalignc\">o9 Solutions and AWS Collaborate to Help Businesses Accelerate the Digital Transformation of Their Supply Chain Planning and Execution Processes</b>\n</p><p>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fo9solutions.com%2F&amp;esheet=52559842&amp;newsitemid=20220110005204&amp;lan=en-US&amp;anchor=o9+Solutions&amp;index=1&amp;md5=902329129731beea7ffb05039abd5a2b\" data-type=\"url\" class=\"tr-link\" translate=\"no\">o9 Solutions</a>, a leading enterprise artificial intelligence (AI) software platform provider for transforming planning and decision-making, today announced joining the AWS Partner Network (APN). This collaboration makes it easier for businesses to deploy the full suite of o9’s cloud-native solutions leveraging the breadth and depth of the Amazon Web Services (AWS) Cloud.\n</p><p>\no9’s AI-powered integrated planning and decision-making platform, built on its future-proof, proprietary <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fo9solutions.com%2Fdigital-brain%2F&amp;esheet=52559842&amp;newsitemid=20220110005204&amp;lan=en-US&amp;anchor=o9+Digital+Brain&amp;index=2&amp;md5=c22ddee1365b4d66ad33238100b14cd0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">o9 Digital Brain</a> platform, leverages AWS’s highly flexible and scalable infrastructure and cloud-computing capabilities to help businesses make faster, more accurate supply chain decisions. Together, o9 and AWS enable companies across a wide range of sectors — including industrial manufacturing, life sciences, oil and gas, telecommunications, high-tech and electronics manufacturing, consumer-packaged goods, and retail — to accelerate their digital transformation.\n</p><p>\n“o9’s planning and decision-making solutions were built from the start to run in best-of-breed cloud environments like AWS,” said Igor Rikalo, Chief Operating Officer at o9 Solutions. “Already, the combination of AWS and o9 has empowered many global businesses to transform their capabilities around integrated planning, revenue management, demand sensing, forecasting, and supply chain planning in general. Now, we can extend the reach of our platform to help even more companies seeking an end-to-end supply chain management solution.”\n</p><p>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.asianpaints.com%2F&amp;esheet=52559842&amp;newsitemid=20220110005204&amp;lan=en-US&amp;anchor=Asian+Paints&amp;index=3&amp;md5=a9c3f92fa126b7c305875eae1a70c4cc\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Asian Paints</a>, India’s leading paints company renowned for its progressive approach to using technology to drive process innovation, has leveraged the o9 platform since 2015 for demand management, as well as sales and operations planning. Since then, Asian Paints has embarked on adding o9’s <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fo9solutions.com%2Fsolutions%2Fsupply-chain%2Fsupply-chain-control-tower%2F&amp;esheet=52559842&amp;newsitemid=20220110005204&amp;lan=en-US&amp;anchor=Supply+Chain+Control+Tower&amp;index=4&amp;md5=c8ed3a6a68d4fee1280c54ad267a4149\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Supply Chain Control Tower</a> to its technology portfolio. This solution equips companies with unprecedented end-to-end visibility into demand and supply volatility, allowing customers to respond to disruption in real time with optimal, automated decisions. Asian Paints engaged with AWS to run the o9 platform.\n</p><p>\n“o9’s cloud-native technology gives us the power to take our planning and demand collaboration processes to the next level, despite our ever-increasing product portfolio and complex supply chain. As a result, we’ve benefitted from much better alignment between marketing, sales, and our supply chain team, leading to improved service levels while controlling our inventory and supply chain costs,” said Aashish Kshetry, Vice President of IT at Asian Paints.\n</p><p>\n“Supply chain volatility and disruption can create new operational challenges throughout the network. Customers across all verticals will benefit from cloud-enabled technologies that improve flexibility, scalability, and collaboration,” said Sanat Joshi, General Manager, Global Manufacturing Industry Solutions at AWS. “We are pleased to work with o9 who are committed to helping companies like Asian Paints run planning and analytics at scale with outstanding performance, positioning them to better compete in the digital age of business.”\n</p><p>\n<b>About o9 Solutions, Inc.</b>\n</p><p>\no9 Solutions is a leading AI-powered platform for integrated business planning and decision-making for the enterprise. Whether it is driving demand, aligning demand and supply, or optimizing commercial initiatives, any planning process can be made faster and smarter with o9’s AI-powered digital solutions. Bringing together technology innovations—such as graph-based enterprise modeling, big data analytics, advanced algorithms for scenario planning, collaborative portals, easy-to-use interfaces and cloud-based delivery—into one platform. For more information, please visit<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.o9solutions.com%2F&amp;esheet=52559842&amp;newsitemid=20220110005204&amp;lan=en-US&amp;anchor=www.o9solutions.com&amp;index=5&amp;md5=c1a1f05d3fb9efe361509e23c0d568a3\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> www.o9solutions.com</a>.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20220110005204r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjIwMTEwMDA1MjA0cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=09797cd27606209f0c2a0b2b6fb429a46fe082f7abaca4076e88eca4aa8ffd95de1fa38165341bc20a584ea16d6720fcdbc2ee449dc2e5c5bd4b53afd20e2a00\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20220110005204/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220110005204/en/</a></span></p><p>\nJenni Otum\n<br/>Sr. PR Manager\n<br/><a href=\"mailto:jennifer.ottum@o9solutions.com\" data-type=\"email\" translate=\"no\">jennifer.ottum@o9solutions.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2022</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: TX-O9-SOLUTIONS</p></div>"}