{"date": "2021-12-01 19:56:23.181000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Unleash live Achieves AWS Energy Competency With Real Time Video Analytics for Wind, Solar and Power Line Automated Inspections</b>\n</p><p>\nUnleash live, one of the world’s leading A.I. video analytics platforms, announced today that it has achieved Amazon Web Services (AWS) Energy Competency status. This designation recognizes that Unleash live has demonstrated deep expertise helping customers leverage AWS cloud technology to transform complex systems and accelerate the transition to a sustainable energy future.\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: <a href=\"https://www.businesswire.com/news/home/20211129005019/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211129005019/en/</a></p><div id=\"bwbodyimg\" style=\"width:480px;float:left;padding-left:0px;padding-right:20px;padding-top:0px;padding-bottom:0px\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Connect the field and office with zero latency live streaming and real time A.I. for automating energy inspections (Graphic: Business Wire)\" src=\"https://mms.businesswire.com/media/20211129005019/en/929916/4/Unleash_live_Energy_Competency_Announcement.jpg\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbXMuYnVzaW5lc3N3aXJlLmNvbS9tZWRpYS8yMDIxMTEyOTAwNTAxOS9lbi85Mjk5MTYvNC9VbmxlYXNoX2xpdmVfRW5lcmd5X0NvbXBldGVuY3lfQW5ub3VuY2VtZW50LmpwZw==&amp;key=0f9fd9096a3b27b434e22162a0dd372e11574f1cd74c3b00f6423845d7a0ec376fa8f0f15b744ff0fd3462a9df2677fc4b5a0b9ec3156390d256b15fd91983dc\"/></div></div><p style=\"font-size:85%\">Connect the field and office with zero latency live streaming and real time A.I. for automating energy inspections (Graphic: Business Wire)</p></div><p>\nAchieving the AWS Energy Competency differentiates Unleash live as an AWS Partner with deep expertise and technical proficiency within this unique industry, including proven customer success developing solutions across the value chain, from project planning, production operations, maintenance and optimization, new energy solutions, and more. To receive the designation, AWS Partners undergo a rigorous technical validation process, including a customer reference audit. The AWS Energy Competency provides energy customers the ability to more easily select skilled partners to help accelerate their digital transformations with confidence.\n</p><p>\n“Our customers in the Energy sector are realising the transformative impact of real time video analytics on their operations. And with the scale and security of AWS, this Competency status further establishes Unleash live as a leading player in video analytics and data insights. Unleash live is proud to achieve the AWS Energy Competency designation,” said Hanno Blankenstein, CEO and Co founder. “Our team is dedicated to helping companies achieve their operational security and efficiency goals by leveraging the agility, breadth of services, and pace of innovation that AWS provides.”\n</p><p>\nAWS is enabling scalable, flexible, and cost-effective solutions from startups to global enterprises. To support the seamless integration and deployment of these solutions, AWS established the <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fpartners%2Fcompetencies%2F&amp;esheet=52537022&amp;newsitemid=20211129005019&amp;lan=en-US&amp;anchor=AWS+Competency+Program&amp;index=1&amp;md5=961048f7c4fed3ddf4ddfba208b929f2\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Competency Program</a> to help customers identify AWS Partners with deep industry experience and expertise.\n</p><p>\nEnvironmental, Social and Governance (ESG) performance is a key part of the Unleash live offering for the Energy sector.\n</p><p>\nPower utilities, asset owners, operators and maintenance companies can now automate their entire visual inspection processes through Unleash live. Catering for organizations seeking to embark on their digitisation journey of handheld or head mounted virtual image and video capture, through to ones with advanced drone operations and EVLOS (Extended line of sight) or BVLOS (Beyond Visual Line of sight). Engineers and subject matter experts no longer need to travel for days to the remote asset locations, don't need to trawl through 100k’s of images. Unleash live’s A.I. can inspect and assist with fast and consistent condition reporting and severity ratings. Unleash live builds a digital asset passport with high resolution imagery, the ability to further annotate and collaborate on high priority issues that need immediate action and connecting into work order management and asset management systems.\n</p><p>\nCustom Machine Learning (ML) algorithms that work right out-of-the-box for Power lines, Wind turbine and Solar PV inspections along with Vegetation Management for linear assets such as Oil &amp; Gas Pipelines can be activated on-demand for monitoring, inspecting and safeguarding any remote asset or corridor globally.\n</p><p>\nGetting started could not be easier. Through the AWS Marketplace, AWS Energy customers can now adopt the Unleash live platform through a simple SaaS subscription service.\n</p><p>\n<b>About Unleash live</b>\n</p><p>\nToday, Unleash live's A.I. App Store supports 34 Apps, addressing a wide range of use cases, from Solar PV and Power line fault detection to traffic and multi modal transport analytics. The number of Apps is expected to pass 200 during the next two years.\n</p><p>\nCustomers connect existing image capture devices (CCTV, IP cameras, drones, headmounted, smartphones, etc.) to Unleash live's cloud-based platform (built on secure AWS services), start streaming their video and then apply the A.I. of their choice from the Apps Store. They do not need to invest in any hardware infrastructure, nor do they need to implement large-scale integration programs.\n</p><p>\nCustomers subscribe to a tiered subscription model, that is based on live streaming, secure storage, and A.I. Apps modules. Existing customers range from city authorities, such as Miami-Dade Transit Authority, the City of Sacramento, and Transport for New South Wales, to energy and resource businesses, such as Worley and BHP.\n</p><p><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211129005019/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211129005019/en/</a></span></p><p>\nHamid Fardoost\n<br/><a href=\"mailto:Hamid@unleashlive.com\" data-type=\"email\" translate=\"no\">Hamid@unleashlive.com</a>\n</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: UNLEASH-LIVE</p></div>"}