{"date": "2022-02-04 07:04:01+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3012.25, "close": 3152.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Hadeel Al Sayegh</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">DUBAI, Feb 4 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Faced with deal fees in the Gulf region a fraction of those in markets elsewhere, many Dubai bankers are handing in their notices, attracted by the lure of cashing out, stock options and share grants at startups.</p><p>Veteran investment banker Omar Abuinnab is one of them. He left Guggenheim Partners' Middle East unit<span class=\"tr-strong\"> in December</span> to set up Keyper, a Dubai real estate technology start-up.</p><p>Launched in January, Keyper describes itself as a private banker to real estate investors. Such \"proptech\" companies constitute a burgeoning global industry, which has secured $2.6 billion of global investment in 2019, up from $1 billion in 2016, according to a KPMG report in 2020.</p><p>Abuinnab is not alone. Former Moelis &amp; Co <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MC.N\" data-type=\"ric\" data-ric=\"MC.N\" translate=\"no\" dir=\"ltr\">MC.N</a> banker Youssef Salem moved to Dubai-based transport startup Swvl, which in July announced a merger with U.S. blank-check company Queen’s Gambit <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GMBT.O\" data-type=\"ric\" data-ric=\"GMBT.O\" translate=\"no\" dir=\"ltr\">GMBT.O</a>. The deal valued Swvl at roughly $1.5 billion.</p><p>Amit Agarwal, who was at Goldman Sachs, joined Mideast logistics and trucking technology firm TruKKer as group chief financial officer.</p><p>\"In the past, people got into investment banking because it was among the highest-paid jobs. Now they're trying to build unicorns,\" said Abuinnab, referring to companies that are worth $1 billion or more.</p><p>Dubai's tech success stories have fuelled more interest into the sector.</p><p>Amazon's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> acquisition of Middle East online retailer Souq.com in 2017 for $580 million triggered more deals in the sector, including Uber's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=UBER.N\" data-type=\"ric\" data-ric=\"UBER.N\" translate=\"no\" dir=\"ltr\">UBER.N</a> $3.1 billion acquisition of ride-hailing firm Careem in 2019.</p><p>But for bankers, the payout for such deals can be slim compared with those in other regions.</p><p>Saudi Telecom Co's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=7010.SE\" data-type=\"ric\" data-ric=\"7010.SE\" translate=\"no\" dir=\"ltr\">7010.SE</a> tech unit Arabian Internet and Communications Services Co said it would pay $12 million in fees for its initial public offering, according to its prospectus in September.</p><p>     The fees, shared by banks, lawyers and auditors, equate to about 1.3% of the deal value, compared with 5% in the U.S. or Europe. </p><p>Saudi Aramco, <a href=\"reuters://REALTIME/Verb=FullQuote/ric=2222.SE\" data-type=\"ric\" data-ric=\"2222.SE\" translate=\"no\" dir=\"ltr\">2222.SE</a> whose offering raised a record $29.4 billion in 2019, paid top banks on the deal $3 million to $4 million each.</p><p>Dubai has not had a major initial public offering since 2017, when Emaar Properties <a href=\"reuters://REALTIME/Verb=FullQuote/ric=EMAR.DU\" data-type=\"ric\" data-ric=\"EMAR.DU\" translate=\"no\" dir=\"ltr\">EMAR.DU</a> spun off its unit Emaar Development <a href=\"reuters://REALTIME/Verb=FullQuote/ric=EMAARDEV.DU\" data-type=\"ric\" data-ric=\"EMAARDEV.DU\" translate=\"no\" dir=\"ltr\">EMAARDEV.DU</a> and listed the company on the local bourse.</p><p>That leaves people like Keyper CEO Abuinnab, 44, seeking other outlets for their ambitions. He next plans to expand the company's operations into global cities, including London.</p><p>     \"Real estate investors are not well serviced in this region. I wanted to elevate that experience from my financial background to property owners to help them make better investment decisions utilising real time data and analytics,\" he said.  </p><p><br/></p><p><br/></p><p>($1 = 3.6726 UAE dirham)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Hadeel Al Sayegh. Editing by Gerry Doyle)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Hadeel.AlSayegh@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Hadeel.AlSayegh@thomsonreuters.com</a> ; +971566883310; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: DUBAI-BANKERS/TECH (PIX)</p></div>"}