{"date": "2021-04-08 05:54:30+00:00", "ticker": "AVV", "mrkt_info": {"open": 3550.0, "close": 3775.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Dubai, UAE:</strong> AVEVA, a global leader in industrial software, driving digital transformation for industrial organizations managing complex operational processes, today announced that it had been recognized with the Frost and Sullivan Product Leadership Award for its Manufacturing Execution System (MES) for Food and Beverage (F&amp;B). This best practice award is bestowed on companies that consolidate or grow their leadership position by continuously innovating and creating new products and solutions that serve the evolving needs of their customers.</p>\n<p>AVEVA was recognized for its success in enabling F&amp;B manufacturers to digitally transform their operations to achieve higher productivity and enhanced manufacturing flexibility and quality while reducing the cost of regulatory compliance in a complex environment. Citing AVEVA’s approach as ‘customer centric’, the report states that AVEVA offers a model driven MES solution that combines the traditional advantages of an MES with a new digital workflow management approach to integrate people, processes, and businesses. AVEVA was also given recognition for delivering enhanced efficiency, capturing work procedures in digital workflows and relevant user experience models in contrast to competitors in this space that provide only standalone MES software.</p>\n<p>The unique selling point of AVEVA’s MES is its out-of-the-box connectors for both plant and enterprise applications, which provide greater flexibility to customers in terms of integrating the MES into their entire business. While competitors’ platforms are designed to integrate only with their proprietary systems, the AVEVA System Platform is vendor-agnostic, working with any competitor’s programmable logic controller (PLC), remote terminal unit (RTU), programmable automation controllers, IIoT devices and general IT applications. AVEVA Connect, which is also mentioned, allows clients to connect and optimize existing operations with advanced capabilities in the cloud – removing organizational silos. Furthermore, the ability to connect with automated manufacturing processes and integrate with asset performance management software or third-party applications, allows customers to achieve end-to-end process management and to standardize processes across the enterprise.</p>\n<p>For several years, AVEVA has been delivering a multi-site MES value proposition to the F&amp;B market to digitalize manufacturing activities and integrate them with both ERP and automation systems. The Best Practices Award further highlights that AVEVA enables users to achieve the maximum level of automation, consistency of operational tasks, and collaboration across diverse teams. AVEVA’s Model driven MES approach is based on the digitalization of operational processes, KPIs and reporting with sustainable reusability as a template and for governance of change across a multi-site enterprise. This standardization approach allows for rapid multi-plant optimization and lays the foundation for the optimization of the manufacturing value chain and for more agile, resilient businesses. </p>\n<p>The MES benefits customers by reducing operating costs, increasing productivity and yield, and shortening the decision time. Vendors who can offer a real-time, plant-wide platform that can be easily implemented in a wide-scale manner without causing any disruptions in existing operations will be best positioned to stay competitive in the dynamic MES market.</p>\n<p>“AVEVA supports manufacturing execution capabilities with its agnostic system platform, bringing state-of-the-art technologies, such as edge, cloud, machine learning, OPC-UA and the InTouch operations management interface to drive operational agility, responsiveness, and collaboration” said Ram Ramasamy, Global Client Leader at Frost &amp; Sullivan. <strong><span>“</span></strong>The cloud is inevitable in today’s context, but it needs to co-exist with the edge. As customers start pivoting from site-level monitoring to fleet-level monitoring, the thirst for centralized applications has become unquenchable. Driven by forces such as an ageing workforce, resource efficiency requirements, and value-chain collaboration, AVEVA Connect brings together cross-functional teams, assets, and an end-to-end (E2E) view of the operations landscape.”</p>\n<p>“This award highlights AVEVA’s leading edge in the global industrial F&amp;B software market, “said Harpreet Gulati, SVP, Planning &amp; Operations Business Unit at AVEVA. “Frost &amp; Sullivan’s recognition of the value of our MES offering is a great testament to AVEVA’s work in the sector. Amid a volatile and dynamic macro environment, AVEVA is committed to helping organizations optimise their value chain and streamline their businesses through digital transformation.”</p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}