{"date": "2022-02-02 06:31:06.340000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The Supreme Court on Tuesday set aside the Delhi High Court's 2021 order, refusing to stay the ruling of an international tribunal that had halted the Future Group's deal with Reliance Group on an appeal by retail giant Amazon, and ordered fresh adjudication over the issue.</p><p>The top court bench headed by Chief Justice of India N V Ramana also quashed two other orders of the High Court over the dispute. It found \"procedural errors\" with the HC's orders and said the Future Group was not provided \"insufficient\" opportunity while dealing with the pleas of US online retail giant Amazon.</p></div><div class=\"tr-npp-body\"><p>The issue dates back to 2020, when Amazon approached the Singapore International Arbitration Centre (SIAC) arguing that the Future Group's deal with Mukesh Ambani-led Reliance Retail was a violation of their contract. The SIAC subsequently put the Future-Reliance deal on hold.</p><p>The Delhi High Court - in its October 29 verdict last year - said it will not interfere with SIAC's order on the Rs 24,713 crore merger deal. Before that, the HC on February 2 had directed status quo to be maintained concerning the merger deal, and on March 18, it attached the properties of Future Group promoter Kishore Biyani and other officials linked to the company.</p><p>SC remitted the ruling on the stay back to HC \"for adjudication on its own merits\" and said it raises \"certain important questions of law concerning the effect of the award of an Emergency Arbitrator and the jurisdiction of an Arbitral Tribunal qua such awards arise in the present matter\".</p><p>Copyright 2022 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}