{"date": "2022-02-04 19:37:48.872000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2776.91, "close": 3158.71}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>US-based e-commerce giant Amazon has reported that its full-year 2021 net sales grew by 22% to $469.8bn compared with $386.1bn in 2020, despite global supply chain disruption.</p><p>The company's net income for the full year increased by $33.4bn from $21.3bn a year earlier, while its earnings per share (EPS) were $64.81 compared with $41.83 in the prior year.Its operating income also rose from $22.9bn in 2020 to $24.9bn.For the fourth quarter (Q4), which ended on 31 December, Amazon's net sales grew by 9% to $137.4bn against $125.6bn in Q4 2020.The company's net income in the quarter almost doubled from $7.2bn to $14.3bn from a year earlier.Amazon CEO Andy Jassy said: \"A big thank you to employees across Amazon who overcame another quarter of Covid-related challenges and delivered for customers this holiday season.\"As expected over the holidays, we saw higher costs driven by labour supply shortages and inflationary pressures, and these issues persisted into the first quarter due to Omicron.\"Despite these short-term challenges, we continue to feel optimistic and excited about the business as we emerge from the pandemic.\"Amazon expects its net sales for Q1 2022 to grow by between 3% and 8%, putting them at between $112.0bn and $117.0bn.The company has also announced that it is raising the fee of its Prime membership in the US, citing rises in wages and transportation costs and the continued expansion of member benefits as reasons for this move.The new rates will be effective from 18 February for new members and are said to be the first Prime price increase since 2018.Last month, Amazon announced that its first physical apparel store, Amazon Style, will open later this year at The Americana at Brand in Glendale, California.The store will offer women's and men's apparel, shoes and other accessories from several brands.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}