{"date": "2022-02-16 15:11:28.447000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NEPTUNE WELLNESS SOLUTIONS INC (\"NEPT-TQ\")\n- Sprout Organics and CoComelon Launch First-Ever Food-Brand\n- Collaboration | Co-branded Products will be Available in Walmart\n- Stores Nationwide\n\n     Today, Sprout Organics - known for making delicious organic meals and\nsnacks for babies and toddlers - launches a co-branded product line with\n\"CoComelon,\" across North America. The partnership, the first of its kind,\nfeatures kiddos' favorite loveable characters, J.J., YoYo, TomTom, and\nmore. As one of the most popular kids' entertainment properties of the\nstreaming age, \"CoComelon\" captivates kids across the globe and Sprout will\nnow bring that fun to mealtime with a sampling of veggie-packed purees and\nwholesome snacks made with real, organic ingredients.\n\n     \"Making mealtime fun is in our DNA, and this collaboration takes that\npromise to a whole new level,\" said Capp Culver, CEO of Sprout Organics.\n\"We're thrilled to bring the beloved 'CoComelon' characters to life through\norganic foods that kids will love and parents can feel good about, making\nmeal and snack time more fun for the whole family.\"\n\n     The Sprout Organics x CoComelon line features a range of offerings\nincluding Baby Food Pouches for 6-months and up, and Wafflez and Curlz\nsnacks for the pickiest toddlers. The baby food pouches will be available\nin two delicious combinations: NEW Yes, Yes Veggies (made from organic\npeas, organic pear, organic apple, organic banana, organic green beans,\norganic kiwi, and organic broccoli) and Apple Oatmeal Raisin with Cinnamon,\npackaged in 'mess proof' pouches. Pumpkin Butter and Jelly Wafflez,\nBroccoli Curlz and White Cheddar Curlz will all feature the loveable\n\"CoComelon\" characters with more varieties launching throughout the year.\n\n     With more than 110 million subscribers worldwide, \"CoComelon\" is the\n#1 children's entertainment and educational show in the world with its top\nthree episodes generating nearly nine billion views on YouTube around the\nworld. Additionally, the show was #1 on Netflix and maintains a Top 10\nranking across all genres with the recent launch of Season 3.\n\n     \"We're constantly looking for new ways to bring fun and excitement to\nfamilies across the country, and mealtime is such a natural opportunity for\nus to explore,\" said Joan Grasso, Head of Consumer Products, North America\nat Moonbug Entertainment. \"Sprout Organics is the perfect veggie-forward\nbrand and partner to bring our characters and songs to life in a way that\npromotes real, organic ingredients as fuel for little, growing minds and\nbodies.\"\n\n     Sprout Organics Enters Walmart with \"CoComelon\" Collaboration\n\n     Sprout Organics will also launch in Walmart nationwide with Sprout\nOrganics x CoComelon products available on Walmart.com by early March and\nrolling out to close to 900 Walmart stores in April 2022. The initial\nproduct offering across Walmart will include 5 SKUs, featuring Blueberry &amp;\nApple Wafflez and Berry Grape Smoothie Pouch available exclusively at\nWalmart, along with the new Yes, Yes Veggies and Apple, Oatmeal, Raisin &amp;\nCinnamon Pouches and Broccoli Curlz.\n\n     \"We're delighted to begin this valued partnership with Walmart with\nthe launch of our Sprout x CoComelon products,\" said Capp Culver, CEO\nSprout Organics. \"Both Walmart and Sprout are committed to making\naffordable, high-quality organic products accessible for families across\nthe country. This expansion onto the shelves of Walmart greatly elevates\nour ability to do this, while also bringing the fun and delight of\nCoComelon to snacking and mealtime. Together, we know kids will say 'Yes,\nYes' to more veggies!\"\n\n     \"We're so pleased to introduce the Sprout Organics CoComelon\ncollaboration at select Walmart locations and on Walmart.com,\" says Noemi\nDominguez, Merchant, on behalf of Walmart, \"Sprout Organics and 'CoComelon'\nbring together the best of what we can offer our children - making mealtime\nand snack time healthy, easy and fun for kids.\"\n\n     With this expansion into Walmart, Sprout Organics will now be\navailable in over 90% of the organic baby food market. Sprout Organics x\nCoComelon products are also available direct-to-consumer on the Sprout\nOrganics website and on Amazon for suggested retail price ranging from\n$1.99 to $4.29. For more information on the new product offerings, please\nvisit www.sproutorganics.com.\n\n     About Sprout Organics\n     Sprout Organics is an organic baby food brand that strives to make\nmealtime easy and fun for parents and babies through delicious snacks and\nmeals made with fresh, organic ingredients. The company aims to make life\nless complicated, give children a head start in life, and explore new foods\nwith excitement with three simple promises: Keep it real, keep it simple\nand keep it fun. Sprout uses only the best, real and organic ingredients in\neverything it makes which means certified organic foods in every bite\nstraight from nature, no GMOs. To learn more, please visit\nwww.sproutorganics.com.\n\n     About Moonbug Entertainment\n     Moonbug Entertainment is an award-winning global entertainment company\nbehind some of the most popular kids' titles in the world. Moonbug's lineup\nincludes global sensations CoComelon, Blippi, Little Baby Bum, My Magic Pet\nMorphle, Supa Strikas, Go Buster, Playtime with Twinkle, Gecko's Garage,\nARPO and many more.\n\n     Moonbug's shows are on more than 100 platforms globally, including\nYouTube, Netflix, Amazon Prime Video, Sky, Super RTL, BBC iPlayer, HBO Max,\nTencent, Youku and Roku. In May of 2020, Tubular Labs named Moonbug one of\nthe leading digital kids' entertainment companies in the world based on the\ntotal number of minutes watched worldwide.\n\n     The company's YouTube channels are viewed over 8 billion times on\naverage every month globally and has more than 440m subscribers. Its\nportfolio currently stands at 29 IPs and 100+ brand partners and is\navailable in 32 languages.\n\n     Moonbug is part of Candle Media, an independent, creator-friendly home\nfor cutting-edge, high-quality, category-defining brands and franchises. By\nbringing together elite talent operating at the intersection of content,\ncommunity, and commerce, it helps to position leading entertainment\nbusinesses for accelerated, sustainable growth in the current market and\nbeyond. Candle is run by its Co-Chairmen and Co-CEOs, leading entertainment\nexecutives Kevin Mayer and Tom Staggs, and backed by investment capital\nfrom funds managed by Blackstone's flagship private equity business.\n\nInvestor Contacts:\nMorry Brown, VP Investor Relations, Neptune Wellness Solutions, Inc.,\nm.brown@neptunecorp.com;\nValter Pinto or Nick Staab, KCSA Strategic Communications,\nneptune@kcsa.com, 212.896.1254\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204600260.MNPRE2204601572-07000420220216</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}