{"date": "2022-01-05 13:20:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n        Here are just a few of our favorite things from CES 2022-including new experiences that demonstrate the power of ambient intelligence at home, in your car, and in outer space. Learn more about the latest from Amazon, developers, and device makers.\n      </div>\n                <div>\n                  <p>\n          Each year we look forward to the Consumer Electronics Show (CES) as a way to highlight how our teams-including Alexa, Fire TV, Ring, and Amazon Web Services (AWS)-work with fellow device makers, developers, and industry leaders to invent new ways artificial intelligence (AI) can improve lives. Our vision remains squarely focused on ambient intelligence-the kind of technology that understands you and adapts accordingly, is there when you need it, and recedes into the background when you don't.\n        </p>\n                  <p>\n          While we weren't at CES in-person this year, we're still excited to share with you just a few of our favorite announcements, all of which demonstrate the power of this technology both in and outside your home. Take a look and stay tuned for more invention in 2022:\n        </p>\n                  <h4>\n          \"Alexa, take me to the Moon.\"\n        </h4>\n                  <p>\n          Together with Lockheed Martin, we have announced plans to send Alexa into space as a part of <span><a href=\"https://www.nasa.gov/artemis-1/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Artemis I</a></span>, the first of several NASA missions that will land the first woman and the first person of color on the Moon. Alexa will be joining the upcoming mission as a part of Callisto, a technology-demonstration payload embedded into NASA's Orion spacecraft and built in collaboration with engineers from Amazon, Lockheed Martin, and Cisco. Alexa is one of many new, innovative technologies that will be tested as part of Artemis I, and the integration will help those involved explore how voice technology and AI can assist astronauts on future missions.\n        </p>\n                  <p>\n          Alongside Alexa's journey to space, we're developing a series of experiences to make space exploration more accessible to students, teachers, and families who want to follow along with the Artemis I mission. Artemis content and experiences for Alexa will launch closer to the mission, but a preview is available now. To get started and to set up reminders for upcoming mission milestones, just say, \"Alexa, take me to the Moon.\" <span><a href=\"https://www.aboutamazon.com/news/devices/alexa-take-me-to-the-moon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read more about Alexa's space journey</a></span>.\n        </p>\n                  <h4>\n          A customer-centric, connected experience across millions of vehicles\n        </h4>\n                  <p>\n          Together with Stellantis, a leading global automaker and mobility provider, we announced a series of global, multi-year agreements that will transform the in-vehicle experience for millions of Stellantis customers and advance the mobility industry's transition to a sustainable, software-defined future. The collaboration brings together our leadership and innovation in digital experiences, cloud computing, AI, and machine learning with Stellantis' automotive engineering excellence and portfolio of 14 iconic vehicle brands, including Jeep, Chrysler, Dodge, Fiat, and Peugeot.\n        </p>\n                  <p>\n          Here's what our CEO Andy Jassy had to say about it:<br/><span>\"Over the past two decades, Amazon has built the technology, expertise, and culture of innovation to be a world leader in cloud computing, artificial intelligence, and machine learning. We've used these capabilities to make life better for customers around the world through products and services like Alexa, Kindle, and Fire TV, and with AWS we've helped thousands of companies transform themselves and their industries. We're excited to collaborate with Stellantis to transform the automotive industry and re-invent the in-vehicle experience. We are inventing solutions that will help enable Stellantis to accelerate connected and personalized in-vehicle experiences, so that every moment in motion can be smart, safe, and tailored to each occupant. Together, we will create the foundation for Stellantis to transform from a traditional automaker into a global leader in software-driven development and engineering.</span>\"\n        </p>\n                  <p>\n                    <span>\n                      <a href=\"https://press.aboutamazon.com/news-releases/news-release-details/amazon-and-stellantis-collaborate-introduce-customer-centric\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read more about the collaboration between Amazon and Stellantis.</a>\n                    </span>\n                  </p>\n                  <h4>\n          Fire TV is on the move\n        </h4>\n                  <p>\n          Fire TV crossed a major milestone of more than 150 million Fire TV devices sold worldwide, and now we're doing even more to deliver amazing entertainment-no matter where you are-by introducing a new Fire TV experience for the car. You'll be able to use Alexa or on-screen touch controls to access more than 1 million TV episodes and movies on Fire TV in-vehicle in the United States, including favorites from Prime Video.\n        </p>\n                  <p>\n          Plus, we're matching the Fire TV experience across devices with personalized settings, so your Fire TV will look the same whether you're looking at the TV in your living room or in your car. You'll also be able to stop playback in your home and resume the show in your car. Fire TV will be available as an option in Jeep Wagoneer, Grand Wagoneer, and Grand Cherokee; Chrysler Pacifica, Ford Expedition, and Lincoln Navigator. <span><a href=\"https://amazonfiretv.blog/fire-tv-is-on-the-move-in-2022-e3f8860bc6b9\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read more on the Fire TV blog</a></span>.\n        </p>\n                  <h4>\n          Ring adds even more functionality to Ring Alarm and Alarm Pro\n        </h4>\n                  <p>\n          Ring Alarm has always gone above and beyond to protect your home and give you peace of mind. And with the addition of a variety of sensors such as Flood and Freeze, or Smoke and CO (sold separately), any Ring Alarm and its compatible sensors provide you with an added level of protection.\n        </p>\n                  <p>\n          At CES, we announced a new Ring Alarm Glass Break Sensor, allowing you to further customize your home security system. This new sensor uses AI technology to accurately detect valid glass break events, like windows being smashed or cracked, from up to 25 feet away, and dismisses false alarms like jingling keys or clattering dishes. If sound is detected, you'll receive a notification to your mobile device. You can also update your settings to automatically trigger your Ring Alarm siren when in Home or Away mode, and receive a call from our monitoring center if enrolled in Professional Monitoring with a Ring Protect Pro subscription. <span><a href=\"https://blog.ring.com/products-innovation/ring-alarm-glass-break-sensor-bringing-even-more-functionality-to-ring-alarm/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read more at the Ring blog</a></span>.\n        </p>\n                  <h4>\n          Alexa Fund companies showcase personal, accessible tech\n        </h4>\n                  <p>\n          The Alexa Fund supports entrepreneurs and startups that are helping shape the future of voice, ambient computing, robotics, and AI. At CES, one Alexa Fund company, <span><a href=\"https://developer.amazon.com/en-US/blogs/alexa/device-makers/2022/01/ces-alexa-fund-labrador-systems.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Labrador Systems</a></span>, unveiled its personal robot designed to empower individuals to live more independently by providing practical, physical assistance with everyday activities in the home. You can use an Alexa-enabled device to ask the Labrador Retriever to move large loads through your home or bring items within reach. In addition to Labrador, other Alexa Fund and Alexa Startup companies-including Endel, TalkSocket, Embodied, Asleep, CLMBR, and Mui Labs-also shared their latest inventions. <span><a href=\"https://developer.amazon.com/en-US/blogs/alexa/device-makers/2022/01/ces-alexa-startups.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read more at the Amazon Developer blog</a></span>.\n        </p>\n                  <h4>\n          New Matter support for device makers\n        </h4>\n                  <p>\n          We believe your home will include devices from many different companies and brands. You may buy a smart refrigerator from one, a smart lock from another, and a smart light bulb from yet another. It's our job to bring those various devices and services together on your behalf. That's why we are a long-time supporter of major smart home standards and protocols, including Matter. Last year, we <span><a href=\"https://developer.amazon.com/en-US/alexa/matter\" data-type=\"url\" class=\"tr-link\" translate=\"no\">announced</a></span> Matter is coming to most Echo devices and that <span><a href=\"https://developer.amazon.com/en-US/blogs/alexa/device-makers/2021/11/support-for-matter-over-thread-coming-to-echo-and-eero-devices\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Echo (4th gen) and eero devices</a></span> will become Matter Thread border routers. We also committed to bringing Frustration-Free Setup to Matter and ensured that all the functionality a device would need to implement Frustration-Free Setup was in the Matter specification, no custom code or software development kit required.\n        </p>\n                  <p>\n          Now, Frustration-Free Setup documentation is available for device makers to review, and brands such as eWeLink, Ledvance, Sengled, TP-Link, Tuya, and Lifx are working with us to deliver a great set-up experience. We're also working with Philips Hue, Resideo, and others to implement the Commissionable Endpoint capability for Alexa, which lets you add Alexa devices as second administrators for Matter devices so you can take advantage of smart home controls even when your internet connection is down.\n        </p>\n                  <p>\n          We're also collaborating with silicon vendors-including SiLabs, Espressif, Beken, Realtek, Nordic, and TI-to support features such as Frustration-Free Setup. Silicon vendors have begun to develop their Matter offerings, which often include tools and testing environments for developers and device makers. This validation work enables silicon vendors to market a Matter System on a Chip (SoC), which supports Frustration-Free Setup. <span><a href=\"https://developer.amazon.com/en-US/blogs/alexa/device-makers/2022/01/ces-amazon-announces-new-matter-support-device-makers.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read more at the Amazon Developer blog</a></span>.\n        </p>\n                  <h4>\n          Even more choice in voice assistants\n        </h4>\n                  <p>\n          In addition to our support for smart home standards and protocols, we want you to be able to choose from a variety of voice assistants on a single device―because each voice assistant will have its own unique skills and capabilities. That is why in 2019, we launched the <span><a href=\"https://developer.amazon.com/en-US/alexa/voice-interoperability\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Voice Interoperability Initiative</a></span>, a program that now has more than 90 members working toward this vision, including Facebook, Intel, Qualcomm, Sonos, and Garmin. Voice assistants coexist in devices from brands like Facebook, Samsung, and LG, as well as newly announced devices from SK Telecom and KT. <span><a href=\"https://developer.amazon.com/en-US/blogs/alexa/device-makers/2022/01/ces-msww-vii.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read more at the Amazon Developer blog</a></span>.\n        </p>\n                  <h4>\n          Follow us for the latest news\n        </h4>\n                  <ul class=\"bulleted-list arrowlist\">\n                    <li>\n            Alexa Developers on <span><a href=\"https://twitter.com/alexadevs\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Twitter</a></span> and <span><a href=\"https://www.linkedin.com/showcase/amazon-alexa-developers/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LinkedIn</a></span></li>\n                    <li>\n            Alexa on <span><a href=\"https://twitter.com/alexa99\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Twitter</a></span></li>\n                    <li>\n            Amazon News on <span><a href=\"https://twitter.com/amazonnews?lang=en\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Twitter</a></span> and <span><a href=\"https://www.linkedin.com/company/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LinkedIn</a></span></li>\n                  </ul>\n                </div>\n                <div>\n                  <div>\n          Related Tags\n        </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/devices\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Devices</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/alexa\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Alexa</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/innovation\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Innovation</a>\n                    </span>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/devices/a-snapshot-of-our-ces-news\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>05 January 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>05 January 2022 13:20:00 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}