{"date": "2021-12-09 15:41:43.443000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.29, "close": 3483.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>TOUCHPOINT GROUP HOLDINGS INC (\"TGHI-0\")\n- Enters Sponsorship Agreement with SRQ Motorsports Group LLC\n\n     Touchpoint Group Holdings, Inc., a media and digital technology\nholding company, announced that it has entered into a sponsorship agreement\nwith SRO Motorsports Group LLC (SRO). As a result, Touchpoint will be\npromoting and featuring Touchpoint and its wholly owned subsidiary, AIR\nRACE, at SRO Fanatec GT America powered by AWS events for the 2022 season.\n\n     With nearly three decades of experience at the forefront of a\ncontinuously evolving industry, SRO Motorsports Group is the established\nglobal leader in GT racing. SRO also works with the International\nAutomobile Federation (FIA) to organize and promote the FIA Motorsport\nGames, a multi-disciplinary event in which drivers compete in the colors of\ntheir national flag. A range of international and domestic series catering\nfor GT2, GT3, GT4 and touring car machinery also form part of an extensive\non-track program, while the burgeoning sim racing scene has taken on\nconsiderable importance through the SRO E-Sport GT Series.\n\n     Marko Radisic, co-founder of SRO, commented, \"We are pleased to\nwelcome Touchpoint and AIR RACE as sponsors of our two BMW Motorsport M4\nGT4's this season. I believe this partnership will bring significant\nbenefits and exposure to both Touchpoint and AIR RACE, whose target\naudience and engaging race format are closely aligned with our own. With so\nmany synergistic opportunities, I truly believe this partnership will be a\nwin-win for all parties.\"\n\n     Nalin Jay, CEO of AIR RACE, commented, \"We are excited to announce\nthis agreement with Marko and SRO. In addition to the traditional rewards\nfrom sponsorship, we will be exploring opportunities to expand our reach\ninto motor racing for our Touchpoint app. We believe the exposure from this\nevent will help build greater awareness for AIR RACE and drive other\npartnership opportunities as we rapidly approach our first AIR RACE event\nin 2022.\"\n\n     AIR RACE World Championship is a race format developed by Red Bull as\nthe Red Bull Air Race.  It was founded in 2003 and has hosted 94\nchampionship series races around the globe. It has attracted viewers in 187\ncountries and has been broadcast to an audience of over 230 million viewers\nwith over 2.3 billion media impressions worldwide in its most recent\nseason. It is the largest live spectator sports event in the world\nattracting over 1 million spectators to a single air race on multiple\noccasions in cities such as Porto and Barcelona.\n\n     Touchpoint plans to utilize its expertise in audience engagement\nthrough its application development to enhance the audience's experience,\nwhile at the same time creating new revenue generating verticles for the\nraces including festivilization and gaming.\n\n     AIR RACE World Championship will build on the significant legacy that\nthe Red Bull Air Race leaves behind, and is well positioned to deliver one\nof the world's most thrilling and pioneering global sporting events -\nfocused on future tech, innovation, clean energy and spectator experience.\nA video overview is available here.\n\n     The 2022 AIR RACE season has 7 races scheduled to take place at iconic\nlocations in Egypt, Greece, Portugal, United Kingdom, Russia, Indonesia and\nthe Middle East. Twelve Elite Race Teams have already signed-up for the\n2022, 2023 and 2024 race seasons, with twelve further challenger pilots\ncompeting in the new second tier Aero Series - including some of the latest\nand greatest graduates of the Air Race Academy. Red Bull maintains its\ninterest in the World Championship Series with continued sponsorship of\nformer World Champion Martin Sonka in the Elite series.\n\n     AIR RACE is designed to push the boundaries of modern air racing, and\nwill deliver a platform that supports and showcases the latest\ntechnological developments in green power and advanced aerial mobility. New\nrace categories to be introduced include electric powered aircraft, EVTOL\n(vertical take off and landing) and JetPacks.\n\n     About Touchpoint Group Holdings.\n\n     Touchpoint Group Holdings Inc. is a media and digital technology\nacquisition and software company. For more information, see\n<a href=\"http://touchpointgh.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://touchpointgh.com</a>/.\n\n     Safe Harbor Statement\n\n     This news release may contain \"forward-looking\" statements. These\nforward-looking statements are only predictions and are subject to certain\nrisks, uncertainties and assumptions that could cause actual results to\ndiffer from those in the forward looking-statements. Potential risks\ninclude such factors as the inability to enter into agreements with parties\nwith whom we are in discussions, the uncertainty of consumer demand for the\nCompany's products, as well as additional risks and uncertainties that are\nidentified and described in the Company's SEC reports. Actual results may\ndiffer materially from the forward-looking statements in this press\nrelease. Statements made herein are as of the date of this press release\nand should not be relied upon as of any subsequent date. The Company does\nnot undertake, and it specifically disclaims, any obligation to update any\nforward-looking statements to reflect occurrences, developments, events or\ncircumstances after the date of such statement.\n\nContact\n\n    Crescendo Communications, LLC 212-671-1021\ntghi@crescendo-ir.com\n\nTel   : 305-420-6640    TOUCHPOINT GROUP HOLDINGS INC\nWWW   : <a href=\"https://www.touchpointgh.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.touchpointgh.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134200369.MNPRE2134201896-07264020211209</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}