{"date": "2021-12-01 20:04:12+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n        AWS All Builders Welcome Grant participants receive a complimentary trip to re:Invent in Las Vegas for a first-hand look at latest technology and opportunity to build their professional networks.\n      </div>\n                <div>\n                  <p>\n          Samuel Owusu works in IT for a community bank in Ejura, a place he describes as a \"small village\" in central Ghana. The bank's customers are mostly farmers. \"We have a relationship with the people we serve and are the main source of short-term loans for things like seeds and fertilizer,\" Owusu said. \"But we are constantly facing outages of one sort or another in the village, and that raises doubts for customers.\"\n        </p>\n                  <p>\n          Given the number of times they are told the bank's systems-and their money-are unavailable, when the bank does come back online, Owusu often sees customers taking their money out of their accounts just to check if it is really still there.\n        </p>\n                  <p>\n          \"Then they deposit it right back,\" Owusu said.\n        </p>\n                  <p>\n          Removing that doubt is why Owusu wanted to learn more about AWS and the cloud. It is why he is sharing his experiences around a table with new friends at the 2021 AWS re:Invent conference in Las Vegas.\n        </p>\n                  <p>\n          \"Stability and reliability are what the cloud means to me,\" Owusu said. \"I want to bring the power and potential of the cloud to my customers, my bank, and other banks across Ghana.\"\n        </p>\n                  <p>\n          Owusu is a member of the All Builders Welcome Grant Program, which provides underrepresented technologists, within the first five years of their career, a complimentary trip to AWS re:Invent-AWS's learning conference for the global cloud computing community. The grant covers conference entry fees, lodging, and incidentals. Owusu and his fellow grant participants, as part of their exclusive experience at the 10th annual AWS re:Invent, have access to AWS employees, customers, and partners as they gather to share ideas and the latest and greatest innovations. Like its name suggests, re:Invent is constantly evolving and, a decade in, is creating space and removing barriers for diverse builders to learn, network, and grow their careers.\n        </p>\n                  <p>\n          Grant participants can join keynotes throughout the conference, hear from AWS leaders, and build their technical skills in breakout sessions and labs that will help them gain the knowledge needed to achieve professional qualifications, such as the Cloud Practitioner, Developer Associate, and Solution Architect Associate AWS certifications. The All Builders Welcome Grant Program, sponsored by Accenture and Netflix, was created to increase the number of underrepresented technologists through educational content, partnerships, and certifications, ensuring a pipeline of tech talent that is as diverse as our world.\n        </p>\n                  <div>\n          Cloud systems engineer and All Builders Welcome Program grantee Olumuyiwa Kolayemi with Andy Tay, Senior Managing Director and Global Lead for the Accenture AWS Business Group.<br/><br/></div>\n                  <p>\n          The need for diverse talent in Science, Technology, Engineering, and Math (STEM) remains a high priority: only 9% of STEM workers are Black, and only 8% are Hispanic, according to a <span><a href=\"https://www.pewresearch.org/science/2021/04/01/stem-jobs-see-uneven-progress-in-increasing-gender-racial-and-ethnic-diversity/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">2021 Pew Research report</a></span>. Women are also underrepresented in computer science, holding just 25% of those occupations. Furthermore, the digital skills gap is an ongoing challenge. According to <span><a href=\"https://assets.aboutamazon.com/45/39/5ab8d17149a1bab0011202552bb6/aws-en-fa-onscn.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">the AWS Digital Skills Study</a></span>conducted by AlphaBeta, 97% of organizations see a need to train their workers on digital skills, but only 30% have done so, reflecting a 67% global training shortfall. Initiatives like the All Builders Welcome Grant Program, and AWS's commitment to <span><a href=\"https://www.aboutamazon.com/news/workplace/amazon-to-help-29-million-people-around-the-world-grow-their-tech-skills-with-free-cloud-computing-skills-training-by-2025\" data-type=\"url\" class=\"tr-link\" translate=\"no\">provide 29 million people free cloud skills training by 2025</a></span>, were designed to remove barriers, create opportunities, and ensure the future of the tech talent pipeline is diverse and equitable.\n        </p>\n                  <p>\n          \"Amazon has made a number of commitments to diversify the tech industry talent pipeline, and we're building on those with the All Builders Welcome Grant Program and by hosting a diverse group of technologists at re:Invent, the largest cloud computing event of the year,\" said AWS Director of Inclusion, Diversity &amp; Equity, LaDavia Drane. \"While we still have a lot of work to do, this is one way we can help support technologists from diverse backgrounds and work to ensure that the tech is being built by people that are representative of the customers who use it.\"\n        </p>\n                  <p>\n          The grant program is one example of the types of initiatives AWS has created to help do its part to increase representation in the tech industry, which include the <span><a href=\"http://www.awsaimlscholarship.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Artificial Intelligence and Machine Learning Scholarship</a></span>, <span><a href=\"https://onlinexperiences.com/scripts/Server.nxp?LASCmd=AI:4;F:QS!10100&amp;ShowUUID=E3B90249-7BCD-47C9-B042-5ED8C1E9EDA4\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Girls' Tech Day</a></span>, <span><a href=\"https://aws.amazon.com/campaigns/aws-get-it/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS GetIT</a></span>, and the <span><a href=\"https://learnmore.scholarsapply.org/awsincommunities/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS InCommunities Scholarship Program</a></span>. These programs exist to inspire young people from all walks of life to pursue STEM as fields of study. AWS is committed to help ensure all technology is developed in a way that's inclusive, diverse, and equitable-across every color, gender, belief, origin, ability, and community.\n        </p>\n                  <p>\n          Another All Builders Welcome Grant participant, Monanshi Shah, is a solutions engineer in Montreal, Canada-who focuses on helping her enterprise clients better collect and utilize their data. Attending re:Invent gives Monanshi the chance to dive deep into machine learning and artificial intelligence.\n        </p>\n                  <p>\n          \"There is always something new coming out, and it is exciting to have the opportunity to learn about these technologies from experts at re:Invent that are just like me. Having this opportunity will help make me a better engineer,\" Shah said.\n        </p>\n                  <p>\n          She hopes coming to re:Invent will help her find the community in tech she is missing. \"I am almost always the only woman on my teams,\" Shah said. \"It's so helpful for young people like myself to come together like we are doing now, to see examples of women and all kinds of people across technology, to know that we share the same values and can become the norm.\"\n        </p>\n                  <p>\n          Learn more about <span><a href=\"https://reinvent.awsevents.com/community/all-builders-welcome/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Inclusion, Diversity, and Equity content at re:Invent</a></span>, including breakout sessions, chalk talks, and networking opportunities with a global community of builders, leaders, and allies.\n        </p>\n                </div>\n                <div>\n                  <div>\n          Related Tags\n        </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/aws\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/diversity\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Diversity, equity, and inclusion</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/re-invent\" data-type=\"url\" class=\"tr-link\" translate=\"no\">re:Invent</a>\n                    </span>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/aws/aws-hosts-diverse-builders-starting-out-in-tech-at-its-biggest-learning-event\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>01 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>01 December 2021 20:04:12 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}