{"date": "2021-12-06 18:58:50.980000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Audible, the Amazon-owned audiobook company, has launched over 100 Audiobooks for free on Alexa. Customers will be able to access these titles for free via the voice assistant. A customer will simply need to rely on voice commands to get Alexa to start reading these books.</p><p>The audiobooks can be accessed with voice commands such as \"Alexa, Read Sherlock Holmes\" or say the same thing in Hindi. The user will need to specify the name of the book which should be read out. Keep in mind that only 100 titles are free, for the rest of the audiobooks, you still need an Audible subscription.</p></div><div class=\"tr-npp-body\"><p>According to Audible, the free titles include A selection of the Cases of Sherlock Holmes, The Complete Chanakya Neeti, A Tale of Two cities, 21 Shreshth Kahaniyan Prem Chand, Shiv Puran, etc. The Mystic Sinners written by Proyashi Barua, On the Double written by Tanushree Podder are some other free audiobooks as well.</p><p>The audiobooks can be accessed on the Amazon Echo and Fire TV range and other Alexa built-in devices. The company plans to add several more titles in the coming months.</p><p>Users will also get a seamless, hands-free experience to customers while switching from one device to another so they can continue where they paused on one device, and pick it up seamlessly on another Alexa device.</p><p>How to access free audiobooks on Alexa</p><p>Users can simply talk to Alexa and ask 'what is free on audible?'. The command can be given in Hindi and English.</p><p>Users will then be directed to Audible's catalogue of free titles on Alexa.</p><p>They can then say the name of the audiobook and ask Alexa to read it out loud.</p><p>How does Audible work?</p><p>Audible is the audiobook app from the company. Subscription in India costs Rs 199 per month, though the first 90 days are free. Customers get one credit a month to use on any title to download and keep. Otherwise, titles have to be purchased at extra cost. So users can either apply their credit to buy a book or pay the cost of the title if they have run out of credits.</p><p>Users can also download their audiobook titles to their library and listen offline. Audible also has podcasts on the platform.</p><p>Earlier this year, the company launched a new Audible 'Plus' catalogue for users in India, with access to 15,000 new titles in Hindi and English, including Audible originals, audiobooks and podcasts. These new titles were made part of the existing Audible membership at no extra cost. These audiobooks which are part of the Plus catalogue can be accessed by the user without using their credits or paying extra.</p><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}