{"date": "2021-11-12 09:59:31.536000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3482.05, "close": 3525.15}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>A protest against the Amazon/River Club development, is expected to take place on Friday. Indigenous and heritage protection and conservation groups with concerned residents have slammed the development by E-commerce giant Amazon.</p><p>Cape Town - A protest against the Amazon/River Club development, is expected to take place on Friday.</p></div><div class=\"tr-npp-body\"><p>Indigenous and heritage protection and conservation groups with concerned residents have slammed the development by E-commerce giant Amazon, calling it a \"destruction of a sacred heritage site that deeply violates climate change policy, including the Paris Agreement\".</p><p>The placard demonstration under the Liesbeek Action Campaign will take place from 2.30pm to 5.30pm at the TRUP mound, Corner of Observatory Road and Liesbeek Parkway.</p><p>Goringhaicona Khoi Khoin Indigenous Traditional Council High Commissioner Tauriq Jenkins said Amazon wanted to build its African headquarters on the floodplain at the confluence of the Black and Liesbeek rivers.</p><p>\"The development entails 150 000 square metres of concrete bulk, which violates environmental principles both nationally and internationally, including the Paris Agreement. Already, bulldozers have begun destroying the land – in our view this is unlawful,\" said Jenkins.</p><p>Jenkins said the Observatory Civic Association and Goringhaicona Khoi Khoin Traditional Indigenous Council had lodged a court interdict against the development, with the matter to be heard in court on November 24 to 25.</p><p>\"Jeff Bezos has announced at COP26 that he will commit $2 billion (R29bn) toward climate change mitigation in Africa. Yet, this development is the antithesis of what he is pledging, since it is a green lung of the city, as well as a delicate ecosystem and site of endangered flora and fauna,\" said Jenkins.</p><p>Observatory Civic Association chairperson Professor Leslie London said: \"The problem is our leaders say nice things in grand public forums, but when it applies to local development, that commitment is discounted or goes out the window.</p><p>\"This particular development never had a climate change assessment. It's just completely antithetical to what we're being asked to do on a global scale.\"</p><p>shakirah.thebus@inl.co.za</p><p><a href=\"https://www.iol.co.za/capeargus\"><span>Cape Argus</span> </a> </p><p>Cape Argus © 1999 - 2021 Independent Newspapers (Pty) Limited. All rights strictly reserved. Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SyndiGate. All Rights Reserved.</p></div>"}