{"date": "2021-11-10 04:18:44+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The author is a Reuters Breakingviews columnist.  The opinions expressed are his own. Refiles to add link.</p><p class=\"tr-by\">By Antony Currie</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">MELBOURNE, Nov 10 (Reuters Breakingviews)</span><span class=\"tr-dl-sep\"> - </span>Just as Rivian Automotive <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RIVN.O\" data-type=\"ric\" data-ric=\"RIVN.O\" translate=\"no\" dir=\"ltr\">RIVN.O</a> makes the electric-vehicle market look racier <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2R000V\" data-type=\"storyId\" data-story-id=\"nL1N2R000V\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span>, another risqué deal comes along. The Amazon.com-backed <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> company on Tuesday priced <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2S100Q\" data-type=\"storyId\" data-story-id=\"nL1N2S100Q\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> its initial public offering at a $77 billion valuation despite only having just started selling its trucks. Even more revealing about the provocative state of the industry is the $1.4 billion sale of battery-powered-van maker Cenntro – to a <a href=\"https://ir.nakedbrands.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">lingerie merchant</a>.</p><p>It’s essentially a special-purpose acquisition company transaction. Buyer Naked Brand <a href=\"reuters://REALTIME/Verb=FullQuote/ric=NAKD.O\" data-type=\"ric\" data-ric=\"NAKD.O\" translate=\"no\" dir=\"ltr\">NAKD.O</a>, which peddles intimate apparel and swimwear under the Frederick’s of Hollywood label, is a shadow of its former self. It trades at 67 cents a share, down from $800 or so in early 2018 before its bricks-and-mortar business floundered. The Nasdaq-listed company recently offloaded much of its U.S. and New Zealand operations and has not reported earnings for over a year. It did, however, become a favourite of the Reddit retail-investing crowd earlier this year, enabling it to raise $150 million.</p><p>Naked is sitting on $270 million in net cash. And Chief Executive Justin Davis-Rice has been open about hunting for a takeover target. He said in August it would probably involve a switch from online retail to clean technology.</p><p>The flattering growth curves Cenntro is modelling would make plenty of shell-company deals blush. It values the enterprise at 80% of 2023 revenue, lower than most publicly traded electric-vehicle startups, with troubled Lordstown <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RIDE.O\" data-type=\"ric\" data-ric=\"RIDE.O\" translate=\"no\" dir=\"ltr\">RIDE.O</a> an exception. The projections are based on boss Peter Wang anticipating a 629% compound growth rate that will take this year’s 1,563 vehicle sales and $25 million of revenue to 75,000 and $2.1 billion within two years. </p><p>That will require a lot of legwork. At present Cenntro only sells small, almost golfcart-like vehicles. Just one of the six outsourced manufacturing plants it wants to use is in operation. And it will face heavy competition for larger designs: Ford Motor <a href=\"reuters://REALTIME/Verb=FullQuote/ric=F.N\" data-type=\"ric\" data-ric=\"F.N\" translate=\"no\" dir=\"ltr\">F.N</a> already has pre-sold at least 25,000 of its e-Transit vans.</p><p>The buyer’s cash should come in handy, though, and Wang is likely to stay in the driver’s seat with Davis-Rice seeming content to ride shotgun as a director. Only in such an overheated market, though, could there be even a hint of logic to such naked ambition.</p><p>Follow <a href=\"https://twitter.com/antonymcurrie\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@AntonyMCurrie</a> on Twitter</p><p>         </p><p>CONTEXT NEWS </p><p>- Rivian Automotive on Nov. 9 priced its initial public offering at $78 a share, valuing the electric-truck maker at $77 billion. The offering will raise more than $10 billion</p><p>- Lingerie and swimwear maker Naked Brand on Nov. 8 said it had agreed to buy Cenntro Automotive, a privately held maker of electric-powered commercial vehicles. The all-stock deal values the combined company’s enterprise at just under $1.7 billion, based on information provided in a presentation. </p><p>- Cenntro’s investors would own 70% of the new company and Naked Brand’s the rest. The two companies expect to have to raise $50 million in cash to complete the transaction. </p><p><br/></p><p class=\"tr-signoff\"> (Editing by Jeffrey Goldfarb and Thomas Shum)</p><p class=\"tr-contactinfo\">((For previous columns by the author, Reuters customers can click on <a href=\"reuters://REALTIME/verb=Headlines/ric=CURRIE/\" data-type=\"newsExpression\" data-expression=\"CURRIE/\" translate=\"no\" dir=\"ltr\">CURRIE/</a> <br/> SIGN UP FOR BREAKINGVIEWS EMAIL ALERTS <a href=\"https://bit.ly/BVsubscribe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://bit.ly/BVsubscribe</a> | <a href=\"mailto:antony.currie@thomsonreuters.com\" data-type=\"email\" translate=\"no\">antony.currie@thomsonreuters.com</a> ; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://antony.currie.thomsonreuters.com@reuters.net\">antony.currie.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: ELECTRIC-LINGERIE/BREAKINGVIEWS</p></div>"}