{"date": "2021-11-30 14:18:23.727000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p></p><pre>    \n    By ANNE D'INNOCENZIO \n  \n\n    NEW YORK (AP) ? The National Labor Relations Board has \nordered a new union election for Amazon workers in Bessemer, \nAlabama, based on objections to the first vote that took place \nin April. \n    The move announced Monday is a blow to Amazon, which spent about \na year aggressively campaigning for warehouse workers in Bessemer \nto reject the union, which they ultimately did by a wide margin. \n    The board has not yet determined the date for the second election \nand it hasn't determined whether it will be conducted \nin person or by mail. \n    The rare call for a do-over was first announced by the Retail, \nWholesale and Department Store Union, which spearheaded the \nunion organizing movement. \n    In a 20-page decision, the regional director for the NLRB Lisa \nHenderson focused much attention on Amazon's installation \nof a U.S. Postal Service mail box at the main employee entrance, \nwhich may have created the false impression that the company \nwas the one conducting the election process. Henderson also \nrejected Amazon's argument that it was making voting \neasier and was trying to encourage as high a turnout as possible. \n    \"The employer's flagrant disregard for the board's \ntypical mail-ballot procedure compromised the authority of \nthe board and made a free and fair election impossible,\" \nHenderson said in her decision. \"By installing a postal \nmailbox at the main employee entrance, the employer essentially \nhighjacked the process and gave a strong impression that it controlled \nthe process. This dangerous and improper message to employees \ndestroys trust in the board's processes and in the credibility \nof the election results.\" \n    The RWDSU charged Amazon with illegal misconduct during the \nfirst vote. In August, the NLRB hearing officer who presided \nover the case determined that Amazon violated labor law and recommended \nHenderson set aside the results and direct another election. \n    About 53% of the nearly 6,000 workers cast ballots during the \nfirst election. \n    Amazon spokesperson Kelly Nantel called the decision \"disappointing.\" \n    \"Our employees have always had the choice of whether or \nnot to join a union, and they overwhelmingly chose not to join \nthe RWDSU earlier this year,\" Nantel said. \"It's \ndisappointing that the NLRB has now decided that those votes \nshouldn't count.\" \n    Stuart Appelbaum, president of the RWDSU, saw the NLRB decision \nas a victory. \n    \"Today's decision confirms what we were saying \nall along ? that Amazon's intimidation and interference \nprevented workers from having a fair say in whether they wanted \na union in their workplace ? and as the Regional Director \nhas indicated, that is both unacceptable and illegal,\" \nhe said in a statement. \"Amazon workers deserve to have \na voice at work, which can only come from a union.\" \n    The order for a new election stands unless Amazon files a request \nwithin the next 10 days for a review with the full board of NLRB. \nThat could set up one of several scenarios, including a stop to \nthe election altogether if the full board reverses the regional \ndirector's decision, or a nullification of the results \nif the board sides with Amazon after the union vote has already \noccurred. \n    But even if a second election is allowed to move forward, labor \nexperts say a union victory remains a long shot. Seattle-based \nAmazon will likely appeal and try to delay another vote. And even \nwhen an election is held, workers may chose to vote against joining \na union again. Last time around, 1,798 workers rejected the union \nand 738 voted in favor of it. \n    A repeat of the election means another battle for Amazon with \nthe RWDSU. The first election garnered nationwide attention \nand put a spotlight on how Amazon treats its workers. It was the \nbiggest union push in Amazon's history and only the second \ntime that an organizing effort from within the company had come \nto a vote. \n    Pro-union employees at the Bessemer facility said they spent \n10-hour shifts on their feet in the warehouse, where online orders \nare packed and shipped, and didn't have enough time to \ntake breaks. A union could force Amazon to offer more break time \nor higher pay, those workers said. Amazon, meanwhile, argued \nthat it already offered more than twice the minimum wage in Alabama \nplus benefits without workers having to pay union dues. \n    Amazon has been fighting two different attempts by workers to \nunionize in the past year. \n    Former Amazon employee Christian Smalls is organizing an effort \nat a distribution center in Staten Island, New York, without \nthe help of a national sponsor. The labor board was expected to \nhold a hearing to determine whether there was sufficient interest \nto form a union there but less than two weeks earlier, the group \nled by Smalls withdrew its petition. The workers, however, can \nrefile. \n    Other organizing efforts are afoot beyond Amazon, including \nby workers at three separate Starbucks stores in and around Buffalo, \nNew York. Meanwhile, thousands of unionized workers at Kellogg \nCo. remain on strike amid widespread worker unrest across the \ncountry. </pre>\n\n<p></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) 2021 Refinitiv. All rights reserved.</p></div>"}