{"date": "2021-12-08 03:35:09.282000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_7qjlkva3&amp;referenceId=tag:reuters.com,2021:newsml_OVF71NSEJ_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_7qjlkva3&amp;referenceId=tag:reuters.com,2021:newsml_OVF71NSEJ_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: A major outage disrupted Amazon's cloud services on Tuesday, temporarily knocking out streaming platforms Netflix and Disney+, Robinhood, a wide range of apps and Amazon.com Inc's e-commerce website as consumers shopped ahead of Christmas. This report produced by Freddie Joyner.<br/>Short Link: <a href=\"https://refini.tv/3y51peb\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3y51peb</a><br/><br/>Video Transcript:<br/><br/>A major outage Tuesday at cloud computing giant Amazon Web Services.<br/>Several Amazon.com services that depend on AWS, including Prime Video, were down for thousands of users. An internal analysis pointed to traffic congestion across multiple network devices in the Northern Virginia region, according to a company insider. AWS later posted an update that read, \"Many services have already recovered, however we are working towards full recovery across services.\" Downdetector.com showed more than 24,000 incidents of people reporting issues with Amazon. Trading app Robinhood, Walt Disney's streaming service Disney+, and Netflix were among the platforms that experienced disruptions, according to Downdetector.com. Amazon's Ring security cameras, mobile banking app Chime and robot vacuum cleaner iRobot, all of which use Amazon Web Services, also reported issues, according to their social media pages. In June, websites including Reddit, Amazon, CNN, PayPal, Spotify, Al Jazeera Media Network and the New York Times were hit by a widespread hour-long outage linked to US-based content delivery network provider Fastly, a smaller rival of AWS.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}