{"date": "2021-11-11 19:51:19.813000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3482.05, "close": 3525.15}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon is the technology company best positioned to take advantage of future IT infrastructure disruption in the sector, according to GlobalData analysts.</p><p>The USA-based company comes top of the list in a ranking of overall leadership in the themes that matter most among IT infrastructure companies.These themes, which can be defined as any issues that keep CEOs awake at night, describe technological, macroeconomic and industry-specific challenges that companies are currently facing, as well as the opportunities they create. GlobalData's Thematic Research ecosystem identifies and tracks these challenges, and how they create the long-term winners and losers of the IT infrastructure industry.Amazon scored highly in several areas, particularly when it comes to Artificial Intelligence, Internet of Things, High performance computing, Edge computing, Everything as a service and COVID-19, where it received top marks of five out of five.Amazon received scores of four for Software Defined Networks, Cybersecurity and Programmable infrastructure; and three for Private networks performances.These scores represent GlobalData analysts' assessments of the competitiveness of each company regarding a particular theme. They are then weighted based on their importance and used to create the final industry ranking.Amazon is followed in our ranking by Microsoft, Cisco and Alphabet.The interactive graphic below allows you to compare company ratings across the 10 themes in question. The higher up a company is on the list, the better positioned it is to weather disruption in the future, while the companies at the bottom are more vulnerable to disruptive threats.Click on any of the companies to compare them across all the themes in our analysis. var pymParent = new pym.Parent(\"mining-card\", \" <a href=\"https://nsmg-projects-public.s3.eu-west-2.amazonaws.com/live/nsmg-077/index.html?theme=it_infrastructure&amp;site=verdict\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://nsmg-projects-public.s3.eu-west-2.amazonaws.com/live/nsmg-077/index.html?theme=it_infrastructure&amp;site=verdict</a> \", {});Our analysis reveals that companies from USA are some of the best-prepared players in the IT infrastructure game. Companies from China and Japan also performed well.!function(){\"use strict\";window.addEventListener(\"message\",(function(e){if(void 0!==e.data[\"datawrapper-height\"]){var t=document.querySelectorAll(\"iframe\");for(var a in e.data[\"datawrapper-height\"])for(var r=0;rThese scores are based on overall technology, macroeconomic and sector-specific leadership in 10 of the key themes that matter most to the IT infrastructure industry and are generated by GlobalData analysts' assessments.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}