{"date": "2021-05-10 11:03:16.701000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3251.0, "close": 3107.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>ENPNEWSWIRE-(C)2021 ENPUBLISHING</p><p>Release date- 06052021 - The three companies will support the Kingdom's manufacturers through digital transformation to improve productivity gains and reduce costs.</p></div><div class=\"tr-npp-body\"><p>Schneider Electric and AVEVA have signed an Alliance Partner agreement with Obeikan Digital Solutions (ODS). The partnership will support Saudi Arabia's industrial sector, and the three companies will collaborate to help the Kingdom's factories on their path to Industry 4.0 through digital transformation.</p><p>Part of the Obeikan Group, ODS offers case-tailored consultancy services and industrial apps for logistics, utility reliability, compliance management, spare part management, organizational optimization and audit management. The company has worked to transform dozens of manufacturers across Saudi Arabia through digital technologies.</p><p>The three companies will collaborate to roll out proof-of-concept projects; Schneider Electric's and AVEVA's Internet-of-Things hardware and cloud-based software will be complemented by local expertise from ODS.</p><p>'Obeikan and ODS have a vision of transforming Saudi Arabia's manufacturing capabilities through technology and digitalization,' said Abdallah Obeikan, ODS. 'Schneider Electric and AVEVA share this belief in how technologies such as the Internet-of-Things and cloud computing can make plants smarter, more efficient, and more sustainable. We want to accelerate the nation's manufacturing sector through technology, and we're excited about this partnership.</p><p>Smart manufacturing technologies have the potential to reshape how factories operate. Concepts such as 5G, the Industrial Internet of Things (IIoT) and artificial intelligence (AI) can drastically decrease equipment downtime by as much as 50% and increase overall equipment effectiveness by a double-digit percentage.</p><p>'The next generation of manufacturing will use digital technologies to connect every machine on the plant floor, collect data streams and analyze that information in real time to improve efficiency, increase safety, and reduce energy and water usage,' said Oseid Faqih, Industrial Automation VP, Schneider Electric. 'Obeikan is a leader in this space, and ODS is a highly respected name thanks to the number of digital transformation projects they've undertaken. This partnership will hasten the Kingdom's growth into a manufacturing hub for the entire region.'</p><p>'Digital technologies will account for a significant portion of economic value over the next decade, a fact recognized by policies such as the UAE's Operation 300bn and the second phase of Saudi Arabia's Vision 2030, which was initiated in 2020. The force multiplier effect of AI, IIoT and cloud computing is already beginning to pay productivity and financial dividends for the industrial sector and AVEVA's partnership with Obeikan Digital Solutions will elevate these efficiencies for sustainable and equitable growth across the region by synergizing digital solutions from AVEVA's portfolio with the advanced skills of implementation available with ODS inside Saudi Arabia and the wider Middle East,' said Dr Tariq Aslam, Head of MEA, AVEVA.</p><p>About Obeikan Investment Group</p><p>Obeikan Investment Group (OIG) is a family-run business, founded in 1982 by the Obeikan family with headquarters in Riyadh. OIG has operations across Middle East Africa and Europe with a strong foothold in manufacturing, packaging, education, and health care. On top of being the leading provider of fully integrated packaging solutions in the region, OIG had a growing focus on digital transformation providing B2B, B2C and B2G business and industrial solutions.</p><p>For more information please visit: www.obeikan.com.sa</p><p>About AVEVA</p><p>AVEVA, a global leader in industrial software, drives digital transformation for industrial organizations managing complex operational processes. Through Performance Intelligence, AVEVA connects the power of information and artificial intelligence (AI) with human insight, to enable faster and more accurate decision making, helping industries to boost operational delivery and sustainability. Our cloud-enabled data platform, combined with software that spans design, engineering and operations, asset performance, monitoring, and control solutions, delivers proven business value and outcomes to over 20,000 customers worldwide, supported by the largest industrial software ecosystem, including 5,500 partners and 5,700 certified developers. AVEVA is headquartered in Cambridge, UK, with over 6,000 employees at 90 locations in more than 40 countries. For more details visit: www.aveva.com</p><p>Copyright 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product-names are the trademarks of their respective companies.</p><p>About Schneider Electric</p><p>Schneider's purpose is to empower all to make the most of our energy and resources, bridging progress and sustainability for all. We call this Life Is On. Our mission is to be your digital partner for Sustainability and Efficiency.</p><p>We drive digital transformation by integrating world-leading process and energy technologies, end-point to cloud connecting products, controls, software and services, across the entire lifecycle, enabling integrated company management, for homes, buildings, data centers, infrastructure and industries.</p><p>We are the most local of global companies. We are advocates of open standards and partnership ecosystems that are passionate about our shared Meaningful Purpose, Inclusive and Empowered values.</p><p>For more information please visit: <a href=\"https://www.se.com/ae/en\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.se.com/ae/en</a>/</p><p>[Editorial queries for this story should be sent to newswire@enpublishing.co.uk]</p><p>((Comments on this story may be sent to info@enpublishing.co.uk))</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 M2 Communications Ltd.</p></div>"}