{"date": "2021-11-04 13:36:14.953000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>WUHAN GENERAL GROUP INC (\"WUHN-0\")\n- Gets Unleashed\n\n     WUHAN GENERAL GROUP, INC. (\"WGG\" or the \"Company\"), a bioceutical\ncompany focused on alternative plant-based cannabinoids and mental health\ntherapeutic research is pleased to share the following update:\n\n     Medspresso(TM) is pleased to announce the launch of the new\nMedspresso(TM) Torro Dual Purpose Home Espresso Maker. The new design is\nunique in that it's one of very few capsule systems that accommodate both\nDolce Gusto(R) and Nespresso(R) size capsules. The machine is a welcome\naddition to the existing Medspresso product range.\n\n     The Torro is available immediately for purchase on the Medspresso\nwebsite and will roll into preferred retailers across South Africa just in\ntime for the festive season. In addition to the South African market, there\nare plans for export to international online retailers like Amazon UK, US,\nand DE. Other exciting markets that are being considered are the Middle\nEast, South America, the Far East, and Australasia.\n\n     CEO and Founder of M2Bio(TM) Jeff Robinson explains: \"We are very\nexcited for the launch of this amazing delivery system. The South African\ncapsule market has massive potential for growth and this offering will give\nconsumers the choice of preferred capsule and beverage in the comfort of\ntheir homes. There are already 75 different capsule beverages available in\nboth Dolce Gusto(R) and Nespresso(R) size capsules to choose from and this\nmachine can accommodate both, opening up a new world of coffee for\nconsumers. Capsule coffee and beverages have come a long way since\nNespresso(R) launched their systems, the new paradigm shift is towards\nsustainability, capsule biodegradability, and recycling. Nespresso(R) has a\ngreat recycling program for consumers and our Medspresso(TM) range is\nproudly fully biodegradable, our consumers can enjoy their favorite coffees\nwith a clear conscience.\"\n\n     The powerful Torro machine features a 19-Bar pressure pump, serving up\na coffee in as little as 25 seconds, and users can choose between a small\nor large cup. The machine comes with easily programmable functions,\nbringing a personalized barista-style coffee experience into your home. The\ndrip tray is adjustable in height to suit everything from tiny espresso\ncups to taller mugs. It's small, streamlined, and sleek-looking too. It\nlooks smart on any kitchen worktop or office space without taking up too\nmuch room.\n\n     Grab your machine now.\n\n     About Wuhan General Group, Inc./ M2Bio Sciences, Inc\n\n     Wuhan General Group, Inc. (DBA M2bio Sciences), through its\nwholly-owned subsidiary MJ MedTech is a nutraceutical biotechnology company\nfocused on alternative plant-based cannabinoids and psilocybin medical\nresearch that develops and commercializes a range of CBD and\nmushrooms-based products under Dr. AnnaRx(TM), Medspresso(TM), and\nLiviana(TM) brands. In addition, our research and clinical trials with\npsilocybin are aimed at new therapies that will help patients who suffer\nfrom alcohol addiction, mental illness, and cardiovascular diseases. Our\nmission is to advance botanical-based medicine to the forefront by\ndeploying best-practice science and medicine, clinical research, and\nemerging technologies. The Company is traded on the Over-the-Counter\nBulletin Board of NASDAQ under the trading symbol \"WUHN\".\n\n     Publicly traded company (OTC Pink: WUHN)\nWebsite: www.m2bio.co\nE-mail: info@m2bio.co\nFollow us on Twitter: <a href=\"https://twitter.com/Medspresso\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/Medspresso</a>\nFollow us on Facebook: <a href=\"https://www.facebook.com/Medspresso\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.facebook.com/Medspresso</a>\nFollow us on YouTube: <a href=\"https://www.youtube.com/channel/Medspresso\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.youtube.com/channel/Medspresso</a>\nFollow us on Instagram: <a href=\"https://www.instagram.com/medspresso.official\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.instagram.com/medspresso.official</a>\n\n     Forward-Looking Statements:\n\n     Safe Harbour Statement - In addition to historical information, this\npress release may contain statements that constitute forward-looking\nstatements within the meaning of the Securities Act of 1933 and the\nSecurities Exchange Act of 1934, as amended by the Private Securities\nLitigation Reform Act of 1995. Forward-looking statements contained in this\npress release include the intent, belief, or expectations of the Company\nand members of its management team with respect to the Company's future\nbusiness operations and the assumptions upon which such statements are\nbased. Prospective investors are cautioned that any such forward-looking\nstatements are not guarantees of future performance, and involve risks and\nuncertainties and that actual results may differ materially from those\ncontemplated by such forward-looking statements. Factors that could cause\nthese differences include, but are not limited to, failure to complete\nanticipated sales under negotiations, lack of revenue growth, client\ndiscontinuances, failure to realize improvements in performance, efficiency\nand profitability, and adverse developments with respect to litigation or\nincreased litigation costs, the operation or performance of the Company's\nbusiness units or the market price of its common stock. Additional factors\nthat could cause actual results to differ materially from those\ncontemplated within this press release can also be found on the Company's\nwebsite. The Company disclaims any responsibility to update any\nforward-looking statements.\n\nTel   : 1-514-928-7368    WUHAN GENERAL GROUP (CHINA) INC\nWWW   : <a href=\"https://www.m2bio.co\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.m2bio.co</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2130700346.MNPRE2130701983-06351420211104</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}