{"date": "2022-02-03 05:18:16.969000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3023.87, "close": 2776.91}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_13mrq2z8&amp;referenceId=6294833698001_B35&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_13mrq2z8&amp;referenceId=6294833698001_B35&amp;pageId=RefinitivNewscasts</a></pre>Source: Real Vision<br/><br/>Description: The metaverse can look a lot like online video games. But what Sebastien Borget, COO and co-founder of The Sandbox, is trying to create is a parallel universe. Blockchain gaming manifests in various ways. Some developers simply utilize blockchain technology to mint in-game NFTs, while others are going so far as to grant DAOs governance over the game’s rules. It’s about giving users dominion over the virtual world they occupy. Interoperability – as in the ability for avatars, items, and currency to be transferred from one world to another – is key. According to Borget, the essence of the metaverse can’t be captured in a simple rebranding campaign. Interviewed by Ash Bennington on January 20, 2022.<br/>Short Link: <a href=\"https://refini.tv/3rjNZcD\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3rjNZcD</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; Welcome to Real Vision Crypto. I'm Ash Bennington. Very excited to have with us today Sebastien Borget, co-founder and COO of The Sandbox to talk about crypto, blockchain, gaming, NFTs, and the metaverse. Sebastien, welcome to Real Vision Crypto. &gt;&gt; Thank you. Hi, everyone. It's a pleasure to be here with you today, Ash. &gt;&gt; And it's a pleasure to have you. Let's talk a little bit about your background, how you got into this space before The Sandbox. &gt;&gt; So I'm 37 years old. I've been an entrepreneur, a serial entrepreneur for close to 14 years. And together with my business partner, ultrametric, we co-founded free companies, we have two exits always in technology. We spent the last 10 years into mobile gaming. Co-founded in 2011, mobile games to deal with this idea of turning players into creators. One of the success from that mobile games to you was actually is the original sandbox game. Started as an iOS and Android game in 2011. And the promisor of that game was to just enable anyone to create 2D pixel world just by the touch of their finger on their smartphone screen. It turned out into a huge success. But I believe more than 40 million installs, 70 million player-made creations and so contents made by users. Users register contents was actually contributing to that success. And yet we also had a little bit of restriction in place like we were not able to reward all the creators, all the users, and all creators for the content they made. So even though the game was very successful on mobile and turn out a good amount of revenue, we were frustrated as founders that we couldn't give back to the creator and the community part of the value they brought to the game. At the end of 2017, we were already exploring with new technology this time into blockchain and Bitcoin. And we found the first game that use NFT's, it was crypto keys. We tried out. We say, wow, there's a game that uses blockchain. What is it about? We still like, wait, it's a game about virtual cats on the blockchain that you can breed, you can trade, and not only trade on the game marketplace but to an external marketplace. And I searched, you could sail and monetize. And that was like the revelation moments for us. Like, what if we apply that same technology and just allow anyone to make their NFTs, then maybe we could solve that issue we had of retaining creators and hollowing them to own and monetize the income they made. And that was literally the birth of a new version of Sandbox. This time 3D, multi-payer, multi-platform. We've been working on it for a little bit over three years, four years and a half now, turning it from a simple game into a platform, that uses a free GAG door, a marketplace, a map, a game-makers that there is no code and the play side, which we recently launched in alpha last months, to showcase the possibilities and to empower creators to own the free asset and experiment they make and finally be able to monetize them through the use of NFTs and Bookshelf. &gt;&gt; As I introduced to you here today, Sebastien, I feel like I went through some of the most important and exciting topics that are happening in this space right now, blockchain gaming, NFTs, metaverse, the Sandbox is that the fusion of all of those points for people who aren't gamers themselves, give us an understanding some background on what's happening in this ecosystem right now. &gt;&gt; So we've been one of the pioneers into blockchain gaming. Blockchain gaming, it's a wild term that encompasses any game that use blockchain technology in a way or another, it could be full decentralization of everything gambling, game rules, I said, et cetera. But it can also be just part of the game that actually being put on the blockchain. Usually, the NFTs, which like game items or other component of the game that are now put on the blockchain, and as such, can be owned by the users, can be exchanged with each other, can be sold on marketplace, can be monetized in new ways. We're at the intersection of blockchain gaming and the metaverse in a sense that, offering if it's 3D virtual world, where users can participate into thousands of different experiences through an avatar, that's a 3D representation of themselves. And those experience being more immersive, more social, more rich, more culturally diverse, is really bringing Sandbox into like the true metaverse, combining the concept of true ownership of your identity, of your digital assets, of your avatar. These gamified experience and we actually will. &gt;&gt; So what is the true metaverse as you describe it? Where do you see that headed and what's the promise in this metaverse technology? Many of our viewers will know metaverse from Facebook changing its name recently from Facebook to Meta. Obviously, this is something that is incredibly important and something that's viewed at least by Silicon Valley right now, as truly being the future. What's the essence of this technology? &gt;&gt; So the concept of virtual world is not new. It's been existing for more than 20, 25 years. We've seen [inaudible 00:06:16] second life. We've seen Mitra, we've seen World of Warcraft, Roblox, Fortnite's now, and Meta, Facebook rebranding itself. So in my opinion, just rebranding yourself isn't going to change massively who you truly are. And being a virtual world without bringing something new, disruptive for users is not being the true metaverse. The true metaverse is the metaverse which puts users are the senders, avatars are the senders and that enable users to be self-sovereign. Meaning they can take the avatars across different virtual worlds. They can carry their identity from one to another. They can carry their digital assets, game item, wearables, and more from one to another, as well as their money in the form of cryptocurrencies and other tokens, from one to another, being able to exchange it in a permissionless manner and accessing different platform, having access to many type of experience and representation follows assets. And that's what's really disruptive. And in my opinion, can only be, is what the metaverse has to offer something new to offer to users. &gt;&gt; I mean, it really does sound like what it's about, is this idea of the empowerment of users, having the ability to control, to own, to be self-sovereign in these universes and in many ways to decentralize those ecosystems away from game-makers who were the gods of those gaming universes, and to empower the community that participates in the game to have a greater role, a greater say, and greater governance. &gt;&gt; Exactly. And I think it's essential to think like what opportunities behind those that enable, before whether you are a user or creator, anything you bring, you create or the value you actually provide by being present and engaging with other users, socializing with them. All of that is actually being captured only by the platform. There is no value that accrues towards the users. There is no reward for users for the time they spend and the content they bring or the activities they do. Which in my instance is not a great way to build something more fair, something more equitable, and something that's going to last and be persistent. With web free and decentralization, the value no longer goes to the platform that hosts those who are natural world or their services. The value goes to the creators and the user first in the form of tokens. And that's great in the sense that it's enabling behind a whole new digital economy where users are free to trade, free to define, and it can be rewarded. Being rewarded is really an important form of triggering more engagements. Why do we keep doing the things we're doing in life? We can keep working, we can keep being active by passion, being driven by our passion. But how long will we be doing that if there is not a form of financial incentive attached to it? I think that's really what was lacking in those closed economy [OVERLAPPING] versus establishing what we can confer in a way the open metaverse and open decentralized natural world can be conferred somehow to a new digital nation, new digital states where everyone is a citizen of it, can participate into the governance, can be rewarded for the value they bring. &gt;&gt; Ultimately can feel they are actively contributing to world-building that better world. &gt;&gt; It's really fascinating to me because as you describe it. And these ideas, the philosophy, the ownership, the openness, the governance structure, are these are ideas that you wouldn't necessarily be able to see immediately on the screen. In other words, a true metaphors as you describe it versus a traditional game might look very similar, but what's happening philosophically under the hood? A very different structure. &gt;&gt; That's right. But I think it's important to start building those key principle in mind. And using those key principles towards what's your goal, how you want to shape that will if your key principle are like we want to monetize as much as possible our users to convert maybe 3% of them into European euros. Or we wanted to track everything they do so we can serve them more ads and be the best that's tracking our users online, so we can better convert an on our outs platform, which is a very different goal. Then ultimately we want to build a world where we will progressively decentralize all the content, all the assets, all the ownership of the world. We as a platform will not even own the assets, the money, or the land of that makes that will and automatically does all the users who will participate into that governance. And we want to encourage bringing more actors into ecosystem, showing the positive impact it could make into people's lives to become creators, to discover new skills, skill that maybe are not actually valued into the physical world that become essential into a digital world. And lead in a way that hopefully is going to be different and hence, make people feel different, make people think differently about life, what is the value of my time online by digital time? &gt;&gt; Yeah, I mean, these are some really abstract concepts that we're talking about but are really large and important ideas of reengineering in some ways the nature of a corporation that's really fundamentally been in the same form that joint-stock corporation for some three or 400 years now, talking about in some ways even reengineering some of the traditional boundaries of the nation-state. Maybe at least at the surface level, really big ideas. &gt;&gt; You're right, and it's still very abstract, so that's one thing as well we shouldn't forget is like, why would users want to come here first? Well, for fun, I think that should be the very first reason that why people would pick a more diverse like Sandbox to come and gauge, be there, spend time with, and after they will get access to all those benefits and other reasons. And that's why we provided the tool to enable anyone to create for an experiences. We worked to bring out brands. Some of the best entertainment brands like Walking Dead, like said we did like Snoop Dogg. And there will be many more, are DJs, artists and etc. To create a place that will go beyond our imagination where they can engage with older it again, they can socialize, they can create games, they can make games with their favorites IDs and brands, and actually even long time game, monetize them on the platform. And from the fun, like you just come fall in friend, we'll stay for the fun, and after will enjoy those long-term benefits. &gt;&gt; Yes, Sebastien, you're so passionate in the way that you talk about this. It's really evident even just in the first few minutes of a conversation like this, how different this would be structured from a traditional company. Traditional COO would come on and they would start talking about what their company did. And they would talk about their products and their services and their relationship with their customers. But you really think about this in a very broad and philosophical way, which I just genuinely appreciate. Because it's such an interesting and I think engaging thing for people who did not grow up in this ecosystem to try and get their heads around just how significant these changes are. &gt;&gt; Thanks. I'm really trying to be as close as possible to our community to try to brew ecosystem, to make people turn their dreams into new careers, about 20 new jobs, try to make a positive impact, and develop around the Sandbox, really a community that's bringing more and building this world together. &gt;&gt; So talking of that community at the Sandbox, give us a sense of what some of the numbers are. Give us a sense of the scope of the activity of the engagement and the number of people who are participating right now in the Sandbox. &gt;&gt; We are proud to have more than 1.6 million registered users with a wallet. Has told them never heard the word before, so we help them to bring into this web free wallet and if this is behind the etc. &gt;&gt; These measures for people who are relatively new to this space, give us a sense of what world creation means and why it's so significant for participation in the community. &gt;&gt; Well, the world is like the access to what you used to access all those decentralized application. And you hold the private keys, the keys to your wallet, it stores the record of your ownership, of your identity, of your digital assets, or your cryptocurrencies. So Instead of trusting a third-party company like Facebook, like Microsoft, like Google to host all your data online. You actually are the only person who can access that data and host it yourself. That's why a wallet is so important. It's the central piece in web free. And I believe it's important to be one of the main drivers for people to learn what is a wallet, to get their wallet, and to use their wallet in a fun and engaging way. We are excited to have in our community millions of followers between Twitter, Discord, Telegram, and all those social channels. Also, activity engaging outside of the platform and on the platform, we've got more than 52 studios buildings, thousands of artists uploading content on the marketplace, 18,500 landowners. So what's interesting is Sandbox also is appealing to different kinds of agencies, creators, artists, gamers, and also investors, people who can hold a token to be exposed to diverse in general without necessarily being a player or creators themselves. And all of them are actively contributing like in Digital Nation to the development of that world. &gt;&gt; I mean, with that level of engagement, with that scale, you've got significant scope going right now. &gt;&gt; Yes. Our roadmap is pretty busy, we are continuously building the platform. It's still into an Alpha stage. We have provided the creation tools for a little bit more than a year now. And we have hundreds of people like I mentioned, like launching their own builders to use their own architects' studios to create for non-owners, for the brand. We have launched last month , the first Alpha, so for the first time Sandbox was accessible for players to engage into social activities, to dances and earn tokens, and FTEs and fruit buses waiting into display tourism season. That Alpha is now closed for now, there will be a second Alpha sometime in February, and then we'll be launching more and more towards this year until everything is open at any time directly launched by landowners themselves. And that I think could be the moment we consider the Sandbox is open and available to the public. &gt;&gt; Yeah. So you mentioned land sales, land ownership a couple of times. And this is a really interesting and I think, confusing point for many people. I had a close friend of mine, a corporate lawyer, incredibly smart, send me a message just last night saying, ''I just don't get land sales it doesn't make any sense to me. How can there be scarcity in a digital universe?'' It's something that people who are not gamers, people who are not part of this ecosystem, I think, struggled to get their heads around. How do you describe it to them? And she said, ''How could you will be paying hundreds of thousands of dollars for virtual land, it just doesn't make any sense.'' &gt;&gt; Well, not all land are worth a hundreds of thousands of dollars. So first of all, though, will be the most expensive. And by the concept of virtual real estate, virtual land, it's very similar to the concept of physical real estate. Like there are virtual worlds, those virtual worlds have a limited space. Think of a town like New York or Paris, like they cannot expand, they have a certain size and within those space, those finite number of digital parcels, you can publish experiences that become accessible to other users. By owning the land, you get access then to monetization on the platform. You can start selling your content, you can publish game that others will maybe pay to play, or you can rent them to another creators who will publish and monetize them. Why is it valuable to build lands and to monetize them? I do think like as I mentioned before, a virtual world by itself is going to be like pretty much empty. And all the content, maybe 99% of the content will be made by users, to rest by professionals, brands, game studios. &gt;&gt; But the speed at which content is going to be built is incredible. It's incredible and it goes beyond anything we've seen in the physical world. First of all, you're not bound anymore by the laws of physics. You can do things that really transcend your imagination, both visually, aesthetically, and in terms of gameplay. You can build great experiences, great content, great architecture in the matter of hours, matter of days, versus in the real world to do that, it's going to take you what? Years? Maybe centuries for some of the most world landmarks, etc, Wonders of the World. You have access to a global audience instantly. Discovery, accessibility has never been as fast as now. If you build in New York, you only get people from New York. There is a such a limited traffic and visibility to this experience you'll create. All of those factors combined as well to the idea, there's a whole generation of people in the world, all the middle-class, as you can read into newspaper that cannot access physical real estate anymore, and they will never be able to access that even if they work all their lifetime. That's a fact. My parent were able to buy their house in their '20s. &gt;&gt; Right. &gt;&gt; Today, you can do that maybe in your '40s at best and so on. &gt;&gt; If you're lucky. &gt;&gt; If you're lucky. If you're into a more digitally native person, a Gen z, etc, you understand the value of digital assets. You're spending more and more time between work, play, and all activities; educating, learning, etc, online. You want to have your house, you want to have your place, you want to build content, you want to monetize as well into a virtual world. That's probably one of the reasons behind the success of virtual world. Also, it's typically a class of digital asset that can be used for gaming, but can be also applied into decentralized finance and finance. You have like Metaverse fans which acquire many parcel and then offer to retail investor, just like investment plan to get access to a certain yields without being themselves, choosing location or creating, etc. They are realtors. They have specialized into buying land, developing virtual concept on top of it, and reselling them. That's what a company like Republic Realm, for example, is doing, selling out the Fantasy Island and older concepts. I think in the future going forward, you might be able to take a loan or mortgage your virtual land because it is valuable. People can see, can produce a predictable revenue on the platform. &gt;&gt; You really do describe it in the traditional context of the economic view of what land is, in that it can create revenue, it can create cash flow, it can become a physical point of presence for, for example, a business. Give us a little bit of a sense of where we are right now versus where we're headed in the future. In other words, what are some of those revenue producing items today and where are we going? &gt;&gt; Right now we're still in the very early days. There are values decentralized virtual world including Sandbox, where you can acquire a parcel of land at a fixed price, reasonably low and start building. The content creation tools are there. The platform are working, the brands are coming, the experiences are being created. The audience will then progressively come, and if the fun is there, if all the key ingredients are there, they will stay. At that moment, we can definitely see. Think of it like urban planning, preparing the land into this new world, making sure it's going to be built. Then attracting progressively after the builders, the investors, the creators, and then the visitors. Except that visitors are not here just for spending as like going to a shopping mall or going to a theme park, they are actually actively participating by their presence and they are being rewarded for being present. Because if they complete quest, if they spend time, they can receive token. Those token have some form of value since they can be sold on the marketplace, for example. That I think it's a whole new approach towards designing a world, and that maybe what will make this open Metaverse work where our Second Life in the past didn't really break through. &gt;&gt; You mentioned this distinction between properties, the most expensive at which is now worth hundreds of thousands of dollars. Worth relative to properties in the digital universe in the Metaverse that are worth far less. Give us a sense of what determines the value of those properties. I think you've already hinted at it in terms of the potential to generate revenue. But what are some of those characteristics that make for prime property? Why is that something that people are willing to pay for? &gt;&gt; Something unique in Sandbox is really the idea that, you can reinforce the ownership of your land by uploading your own logo. When you first look at Sandbox map, what you see is those different squares of different size with some very recognizable logos. Some of them like Atari, Snoop Dogg, Walking Dead, Binance, CoinMarketCap. Brand from the physical world or from the blockchain and web free ecosystem. People like to become the virtual neighbors of those brands. By virtual neighbors, we mean they are literally walking distance with an avatar, when you are into, let's say, Snoop Dogg land, you walk through the border, you really will get into a land from his neighbor. That's typically the land that sold for, I think it was $450,000 to become the virtual neighbor of Snoop Dogg mansion in the Metaverse. It does mean something in term of traffic, it term of discoverability, in term of visibility, and travel time to be close to certain brands. Now apply to the notion of community as well, you want to pick a location that you know will be creative, exciting. You want to be part in a place where there would be a great mix of artists, sports, gaming, arch. You know that will be this attractive neighborhood where you can meet interesting people who also share those common interests. I like to think that that's what makes also neighborhood valuable. You can choose to be part of certain communities or certain interests or be closer to certain brands. That's a little bit what you're seeing as well in the urban planning development of new cities. All cities they used to have just the center and there is a periphery, and downtown, and outside, and suburbs, and that's it. But in the Metaverse that's not the case, it's not just the center and anything around is less valuable. Every corner, we're trying to make it as valuable to certain communities, to make them interesting, and also makes sure they will always be animation at any corner of the Metaverse. &gt;&gt; In many ways that the metaphor of physical land really does work very well here, the idea being, for example, if you're opening an ice cream store, you can probably make more money selling ice cream next to the Apple Store on Fifth Avenue where people just bought a $900 iPad, maybe they're willing to pay 12 bucks for an ice cream cone. But if you build an ice cream store in the middle of a cornfield, there's not a lot of foot traffic, nobody comes on a regular basis. It is this really intriguing metaphor for how this world might work. I do have to ask though, there's always a question of things like, when you have highly speculative assets, the potential for market manipulation. How do we know, for example, that people aren't trading things back and forth between wallets. They control wash trading, building up the value of a piece of land and then attempting to sell it and say, \"Look at this transaction history on chain.\" Obviously, there are people who are willing to pay for it. You should really come in and pay $500,000 for something that maybe a month ago was worth a tenth of that or one 100th of that.\" &gt;&gt; The last thing you need to be very careful at. I think Blockchain enabled more transparency than any other technology to actually see that. There are already businesses and services that monitor transaction and would actually find out. The community will find out because the community is also really looking at understanding the value, the true value from the utility, and not the speculative nature. They would analyze the flow of transaction, the origin, the destination, and find those patterns. There are tools now that help, as I mentioned, almost working like the zero of virtual release date where you can find out: Who were the previous owner? How much land ready? How much time land I've been exchanged users? What's the average time between they're being exchanged among users? Which are the most hotspot on the map? Why? Why is that? Because there is this community, this brand that entered, etc, to provide as much transparency on these data for potential buyers and people who are interested to make sure they are getting the land at the right price. I've seen some services going as far as doing this analysis, calculating the average trade price over all the surrounding parcel to use statistical, and heuristical functions to make sure you don't overprice, don't be over premium. Now, sometimes the opportunity it could be more of an intrusive project like zero point to be the neighbor of Snoop Dogg is probably a unique one, like there's no other person around it that will offer that. And that might be less, be less driven by data and more driven by but just like again, sometimes the views is what drivers to buy a house or rent a house in the physical world. It's all that combination of factor. But what I like is like, it's far from being speculative only or manipulative only in the sense like it's not like just one or two transaction in the days is 500,000 transaction a day on the map, the data is there to back it up. There's been, I think more than $318 million worth of GMV since lifetime over lan. Land in Sandbox became one of the top collection on open sea and many website provide the data to understand why. &gt;&gt; And isn't that GMV gross merchandise value? &gt;&gt; Yes. &gt;&gt; You said something that I thought was really intriguing and you just mentioned it in passing where you said, maybe 90% of our content is generated by users. That's a pretty extraordinary idea and a pretty extraordinary number. This idea that people who are participating in the community, rather than for example, brands, companies that have very deep pockets could be building, developing, putting into productive use some of these virtual spaces. That's a really fascinating idea. &gt;&gt; With 8 billion people in the world, that's definitely going to be more users contributing than actual companies enterprise in breadth. Well, the funding comes from user-generated content. Like what makes to talk friend right now is the capacity of people to be very creative, to be able to remix in a such an easy and accessible way. And that's why we tried to keep in mind. The first vision we are 10 years ago was how do we turn anyone into a crater just by the touch of their fingers. I like to think Sandbox. Now, even as this new metabolic version, to keep that spirit, to inspire others and let them just create anything daylight. It doesn't need to be professional. It needs to be fun first. &gt;&gt; Especially as you look to the future of the sandbox of this technology more generally, over the 1,3, 5-year timer rises. What are you most excited about? &gt;&gt; Well, I'm definitely excited about opening sandbox so that any landowners can start publishing their own experiences. Publishing their plate while in season. Enabling holders of certain energies, digital asset, to access part of their experience and creating even more communities of engagement, rewarding their funds. That's on our roadmap for this year. Followed by pushing progressively the governance once the world is open, once there is these network effects that kick in. Once the economy is running at full speed with an open marketplace and the open experiences, it will make sense to start opening, like renting online and opening governance to the token holders, who own land, who own [inaudible 00:35:29] or who own sand to shape and prioritize what they want us as a platform to develop based on their actual needs. Not just what we would decide is next way. So we've taken sandbox initially with much more hands-on approach, trying to set a certain cap or certain direction or how we want to shape it. And we hope that we'll have inspired enough people and ecosystem, builders, architects, players, and more towards what it could be so that in really a web-free fully decentralized manner, we could fully be withdrawn from operating the platform and you can run on its own and run forever in a decentralized manner. &gt;&gt; Sebastien, you've done a great job of explaining this vision I think two people who've struggled to get their heads around it. As we come to the conclusion of this conversation, key thoughts, final takeaways that you'd like to leave our viewers with? &gt;&gt; Final take away. Well, if you got curious about what I said, if you felt like I'm interested, I want to learn. Do it. Start learning like we have a lot of documentation. We've launched boot camps. Overall G-score, the community is very friendly and can answer your question. There are daily streams on Twitch on how to use Voxilate, how to use GameMaker. We hope you'll break through the ceiling and try out and maybe there will be your next job in the mid-evers, maybe that will be the thing that you were looking for, that you'll get passion for and you can earn revenue from now. Well, you won't hear your parents say anymore like stop playing, stop being spending so much time on your computer. You're not going anywhere with that. That's not valuable. Let's break that image proof and make sure we can be perceived and valued for what we really contribute for even into the digital space. &gt;&gt; Sebastien, really fascinating. Thank you so much for joining us. &gt;&gt; My pleasure. Thank you, everyone. &gt;&gt; Thanks for watching everybody. &gt;&gt; Hey there, since he got to the end, I'm guessing you like the video. And that's probably because we don't just turn on a camera and film. We work really hard on getting the narrative flow just right. And that's why many finance companies are actually now hiring Real Vision to make videos for them. One of our recent client videos just hit 100,000 organic views on YouTube. And there were no kittens and site. If you want to find out how Real Vision can make a video for your company, just email us at customvideo@realvision.com.<br/></span></div></div></div></div>"}