{"date": "2021-11-18 13:00:01.598000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>AWS Expands Access to Free Cloud Skills Training on its Mission to Educate 29 Million People by 2025</b>\n</p><p class=\"bwalignc\">\n<span>New AWS digital learning experience, technical courses on Amazon.com, expanded access to AWS re/Start, and Amazon’s first dedicated in-person cloud learning center will put cloud skills training into the hands of millions of people</span>\n</p><p class=\"bwalignc\">\n<span>New AWS Global Digital Skills Study finds the need for digital skills training is greater than ever, with 85% of workers feeling they need more technical knowledge than they did pre-pandemic</span>\n</p><p>\nToday, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), announced four initiatives to empower learners and make it even easier for anyone with a desire to learn to access free cloud computing skills training and unlock new career possibilities in the cloud. The initiatives announced today include the launch of AWS Skill Builder—a new digital learning experience, the addition of AWS courses to the Amazon.com website, the expansion of the AWS re/Start global reskilling program, and the opening of the AWS Skills Center—Amazon’s first dedicated, in-person cloud learning space. In December 2020, Amazon committed to investing hundreds of millions of dollars to provide <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2Fnews%2Fworkplace%2Famazon-to-help-29-million-people-around-the-world-grow-their-tech-skills-with-free-cloud-computing-skills-training-by-2025&amp;esheet=52533767&amp;newsitemid=20211118005786&amp;lan=en-US&amp;anchor=free+cloud+computing+skills+training&amp;index=1&amp;md5=fdc9dbdc4979830426b25e726017994f\" data-type=\"url\" class=\"tr-link\" translate=\"no\">free cloud computing skills training</a> to 29 million people by 2025—reaching people from all walks of life and all levels of knowledge, in more than 200 countries and territories. On this mission, Amazon has already helped over 6 million people gain cloud skills, and the latest efforts build on the existing commitment by putting skills training into the hands of millions of people.\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: <a href=\"https://www.businesswire.com/news/home/20211118005786/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211118005786/en/</a></p><div id=\"bwbodyimg\" style=\"width:480px;float:left;padding-left:0px;padding-right:20px;padding-top:0px;padding-bottom:0px\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"AWS Expands Access to Free Cloud Skills Training (Graphic: Business Wire)\" src=\"https://mms.businesswire.com/media/20211118005786/en/928658/4/Free_courses_on_Amazon.com_2.jpg\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbXMuYnVzaW5lc3N3aXJlLmNvbS9tZWRpYS8yMDIxMTExODAwNTc4Ni9lbi85Mjg2NTgvNC9GcmVlX2NvdXJzZXNfb25fQW1hem9uLmNvbV8yLmpwZw==&amp;key=8c4464ce983a8751cd9c2b2e23b6d5d26c7c905600cf54497f6beb7b01a62748788120b9395d39517ce4928bfc95695f5a5a096ae26d2bd0209b7382573e8c3a\"/></div></div><p style=\"font-size:85%\">AWS Expands Access to Free Cloud Skills Training (Graphic: Business Wire)</p></div><p>\nThese initiatives come as newly released research shows that the need for digital skills training is greater than ever. The AWS Global Digital Skills Study surveyed employers and workers on their perceptions of digital skills training across 12 countries. The study found that 85% of workers feel that they now need more technical knowledge to do their jobs as a result of pandemic-related changes in their work. Additionally, workers who take the time to learn new skills are seeing significant benefits, with 86% reporting greater efficiency in doing their jobs, 85% experiencing greater personal satisfaction, and 80% reporting improved employability. Employers who support workforce education programs also see benefits, with 87% reporting that investments in digital skills training have allowed their organizations to achieve their digital transformation goals more quickly and 84% noting improved worker retention. The full findings of the AWS Global Digital Skills Study can be found at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2Fimpact%2Fempowerment%2Ftraining-for-the-public&amp;esheet=52533767&amp;newsitemid=20211118005786&amp;lan=en-US&amp;anchor=aboutamazon.com%2F29million&amp;index=2&amp;md5=033834f8f5f7f65fa7e1f4ee03c6adf1\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aboutamazon.com/29million</a>.\n</p><p>\n“Our goal is to empower anyone with a desire to learn by giving them access to the tools necessary to excel in cloud computing careers. Over the next decade, we expect the adoption of cloud computing across every industry will fuel a vast number of new jobs, which is why we are investing hundreds of millions of dollars to develop online courses, local in-person reskilling programs, and new ways to make it easy for anyone to learn cloud skills,” said Maureen Lonergan, Vice President of Training and Certification at AWS. “Lowering barriers to accessing technical skills training is critical to power a thriving, diverse workforce of the future. The programs that are part of this commitment are free and designed to meet a range of learner needs, whether they are totally new to the cloud computing industry—or even to technology—or experienced professionals looking to advance their skills.”\n</p><p>\n<b>Providing engaging, accessible training with AWS Skill Builder and Amazon.com</b>\n</p><p>\nTo boost the availability of the latest technology skills curriculum to millions of people around the world, Amazon is launching <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Ftraining%2Fdigital%2F&amp;esheet=52533767&amp;newsitemid=20211118005786&amp;lan=en-US&amp;anchor=AWS+Skill+Builder&amp;index=3&amp;md5=4b959967e6d252aca76fc4278b4c0f19\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Skill Builder</a>. AWS Skill Builder is a new digital learning experience available in more than 200 countries and territories, allowing learners to quickly and easily access over 500 free, on-demand courses—including nearly 60 new cloud computing classes added this year. AWS Skill Builder offers engaging content to meet different learning goals and styles in 16 languages. Individuals can also get course recommendations for learning plans aligned to job roles and technology areas, helping people access the most relevant content for their skill level.\n</p><p>\nTo make finding skills training content even more convenient, free AWS courses are now available on Amazon.com. U.S. shoppers on the Amazon.com site can access AWS training courses with a single click. Using the same intuitive, easy-to-use Amazon.com shopping experience, people looking to advance their cloud computing knowledge and technology skills can browse for free courses, from cloud computing basics to advanced cloud architecture, as easily as finding a new pair of shoes. The content is available via the new “AWS Courses” section of the Amazon.com site, where consumers can find and select skills training courses and pick up their learning wherever they left off. The AWS courses on Amazon.com can also be found through AWS Training Partners, including additional free offerings. To get started, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazon.com%2Fb%2F%3Fie%3DUTF8%26node%3D14297978011%26ref%3DlearnerHubCoursesVanityUrl&amp;esheet=52533767&amp;newsitemid=20211118005786&amp;lan=en-US&amp;anchor=amazon.com%2Fcourses&amp;index=4&amp;md5=26c845665fdc707928410b4677db5e04\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/courses</a>.\n</p><p>\n<b>Tripling AWS re/Start, the free reskilling program for unemployed and underemployed people seeking careers in tech</b>\n</p><p>\nAWS is further expanding training and job opportunities to the unemployed and underemployed by more than tripling the number of cities where <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Ftraining%2Frestart%2F&amp;esheet=52533767&amp;newsitemid=20211118005786&amp;lan=en-US&amp;anchor=AWS+re%2FStart&amp;index=5&amp;md5=239e71d815d153b0be363a74c7eaf69f\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS re/Start</a> is available—from 25 cities in 12 countries in 2020 to 95 cities in 38 countries by the end of 2021. AWS re/Start is a free, full-time, 12-week program that prepares individuals with little or no technology experience to pursue entry-level cloud computing careers. Through real-world, scenario-based exercises, labs, and coursework, students build a range of skills in a number of technology areas including Linux, Python, networking, security, and relational databases. The program connects up to 90% of graduates with job interview opportunities, and is focused on individuals from underrepresented communities, military veterans and their spouses, and those who have lost their jobs due to outdated skills.\n</p><p>\nRecent graduates of AWS re/Start, such as former cruise ship employees, fitness trainers, stay-at-home parents, and transitioning military members, have successfully used the program to step into new careers in technology. One person whose life has been positively impacted by AWS re/Start is Charlotte Wilkins, who was working at a fast-food restaurant in the UK before losing her job due to the COVID-19 pandemic. “When I got furloughed, I saw this as the right time to look at courses and find a new career,” said Wilkins. “I’ve always been interested in technology and wanted to learn coding, but I wasn’t sure what course to do as I didn’t know the skills I would need. What I liked about AWS re/Start is that it covered a wide range of topics, skills, and cloud computing concepts. The program has really changed my life and gave me the tools I needed to start a whole new career path as an associate solutions engineer at a cloud-based company.”\n</p><p>\nAWS re/Start is a springboard to help individuals start new careers, as well as provide cloud computing talent for cloud customers and partners globally. Andy Tay, global lead of the <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.accenture.com%2Fus-en%2Fservices%2Fcloud%2Faws-business-group&amp;esheet=52533767&amp;newsitemid=20211118005786&amp;lan=en-US&amp;anchor=Accenture+AWS+Business+Group&amp;index=6&amp;md5=bc130e6f1c7dd3332b5809b7eaf9046a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Accenture AWS Business Group</a> at Accenture said: “We recognize the value of diverse perspectives as they help us with the complex work we do across industries, management levels, and geographic borders. The AWS re/Start program is an important source for finding and developing diverse cloud talent and the skills needed, particularly in underrepresented groups, for critical roles today and in the future.”\n</p><p>\n<b>Launching Amazon’s first dedicated in-person cloud learning center</b>\n</p><p>\nTo further assist individuals who are looking for a career in the cloud, Amazon is launching the AWS Skills Center in Seattle—Amazon’s first dedicated, in-person cloud learning space designed for anyone who is curious about cloud computing, career possibilities in the industry, and how to gain the skills to achieve their career goals. AWS will launch additional Skills Centers in the U.S. and globally in the future. The center features interactive exhibits on robotics, space, games, sports, and other real-world applications of cloud computing. Free in-person classes for adults with little or no background in technology are also available. Classes will include fundamentals such as Introduction to Computer Technology, providing beginners with a basic understanding of computing; Cloud Practitioner Essentials, covering basic cloud computing concepts; Exam Readiness: Certified Cloud Practitioner, preparing learners for the AWS Cloud Practitioner Certification exam; and other foundational courses about game tech, machine learning, and more. The Skills Center will also host networking events with local employers and organizations to connect people with career information and job opportunities. Opening to the public on November 22, 2021, the Skills Center is free to use with details on events and classes at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Faws.amazon.com%2Ftraining%2Fskills-centers%2Fseattle-skills-center&amp;esheet=52533767&amp;newsitemid=20211118005786&amp;lan=en-US&amp;anchor=aws.amazon.com%2Ftraining%2Fskills-centers%2Fseattle-skills-center&amp;index=7&amp;md5=0f3b46003429aa92bf6ac66edd98a869\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com/training/skills-centers/seattle-skills-center</a>.\n</p><p>\n“By 2025, 97 million new roles will emerge due to increasing digitization,” said Saadia Zahidi, Managing Director of the World Economic Forum. “Skills are the currency of the future, and businesses and government must urgently work together to prepare workers for the jobs of tomorrow. When organizations like Amazon provide workforce programs for the public, they contribute to creating increased opportunities for individuals and communities around the world.”\n</p><p>\nAmazon’s commitment to train 29 million people for free by 2025 on cloud computing skills is just one aspect of the company’s overall workforce development efforts—which also include science, technology, engineering, and mathematics (STEM) education programs for children, collaborations with colleges and universities, and a $1.2 billion pledge to provide education assistance and skills training opportunities for Amazon employees. To learn more about Amazon’s free skills training programs and how to get started, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2Fimpact%2Fempowerment%2Ftraining-for-the-public&amp;esheet=52533767&amp;newsitemid=20211118005786&amp;lan=en-US&amp;anchor=aboutamazon.com%2F29million&amp;index=8&amp;md5=9a6dda395d791037d0a92f11f0166fa9\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aboutamazon.com/29million</a>.\n</p><p>\n<strong>About Amazon Web Services</strong>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com&amp;esheet=52533767&amp;newsitemid=20211118005786&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=9&amp;md5=e2e38c204b1c4b448108bd33925c6fce\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<strong>About Amazon</strong>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Famazon.com%2Fabout&amp;esheet=52533767&amp;newsitemid=20211118005786&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=10&amp;md5=e1ad7015cdfc61a7b9ec59719f2045de\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211118005786r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTE4MDA1Nzg2cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=888790081ed0c6487000bca146bbe298c1c88b9671b449709967bec30a85d1b9bf5b10d89848e4977b9178fd17185d62d81e1f4d004e577ee3c96210eadec132\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211118005786/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211118005786/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52533767&amp;newsitemid=20211118005786&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=11&amp;md5=3187be882a22d26d25fd22d88b9fae71\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON-WEB-SERVICES</p></div>"}