{"date": "2022-01-06 21:32:36.166000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3287.14, "close": 3251.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>These cute thank you cards will help you express some gratitude in 2022. From Paper Source, Hallmark, Amazon, Target, Papier, Artifact Uprising, and Rifle Paper Co., these cards are stunners.</p><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p></div><div class=\"tr-npp-body\"><p>If you are feeling sentimental about the gifts or quality time you have spent with loved ones during the holiday season or over this past year, one fabulous way to channel this energy is writing thank you notes to the important people in your life. And, it's a great way to kick off 2022.</p><p><span><span>Start off the New Year with deals and shopping advice delivered straight to your phone.</span> Sign up for text message alerts from the experts at Reviewed.</span> </p><p>Seriously, a thank you note is more than just a nice piece of mail to give and receive. Research has shown that expressing gratitude through writing thank you notes not only improves the recipient's well-being but additionally makes the letter writer feel better.</p><p>So, while you may have resolutions to improve your life through hitting the gym and making nourishing food, writing thank you notes can be just as important to your overall happiness.</p><p>Get started with a lovely set of stationery. Keeping a collection of thank you cards on hand means you'll always have one when the moment strikes, and if you're in the market for some new ones, check out these sweet cards.</p><p class=\"tr-npp-section-title\">1. Papier You're the Best set</p><p>To express gratitude to the friends who were by your side this year, reach for this charming card. A cheery illustration on its front provides a sincere message to your loved ones. It comes with a set of envelopes with colorful interiors so your message will have a bright touch.</p><p><span><span>Get the You're the Best card set for $22.50</span> </span> </p><p class=\"tr-npp-section-title\">2. Rifle Paper Co. Rose Gold Thank You set</p><p>If a metallic sheen is more your style, then this floral rose gold design is sure to dazzle you. While these do have a glimmer to them, they're still sophisticated and refined. With a blank interior, there's plenty of space to write a personalized message to those you're looking to thank.</p><p><span><span>Get the Rose Gold Thank You card set for $20</span> </span> </p><p class=\"tr-npp-section-title\">3. Artifact Uprising Elegant Overlay Thank You cards</p><p>Put a personalized spin on your thank you notes beyond just a custom monogram. You can add a personalized image to the front of your card, which is overlaid with sleek font. This is perfect for those sending out notes post a special celebration such as a birthday, baby shower, or wedding. Add a photo of the special event, so this thank you card can serve as a memento of the celebration.</p><p><span><span>Get the Elegant Overlay Thank You cards starting for $19</span> </span> </p><p class=\"tr-npp-section-title\">4. Paper Source Emerald Watercolor Thank You set</p><p>These thank you notes have an artsy watercolor design that is complemented by shimmering gold text. This set of 10 cards is fit for year-round use, so you can write up a thank you note anytime.</p><p><span><span>Get the Emerald Watercolor Thank You set for $17.95</span> </span> </p><p class=\"tr-npp-section-title\">5. Amazon Basics Floral Thank You cards</p><p>If you have a lot of thank you notes to write this year, you can't go wrong on a cute floral set that's also budget friendly. These darling florals are perfect for whenever you're feeling grateful for a friend.</p><p><span><span>Get the Floral Thank You Card Set for $9.24</span> </span> </p><p class=\"tr-npp-section-title\">6. Redbubble T. Hanks Card</p><p>These put hilarious new meaning behind the phrase 'you've got mail.' Tom Hanks is a universally beloved figure on the screen, but he can also bring levity and humor to your thank you cards. This cheeky message is sure to put a smile on your recipient's face, and it's certainly a unique addition to your stationery rotation.</p><p><span><span>Get the T. Hanks Cards starting at $3.95</span> </span> </p><p class=\"tr-npp-section-title\">7. Metallic Brush Stroke Thank You Set</p><p>Decorated in shiny gold flecks and streaks of color, this set brings an artistic touch to your thank you notes. Perfect for the creative who is looking to send out some gratitude.</p><p><span><span>Get the Metallic Brush Stroke Thank You Set for $6.90</span> </span> </p><p class=\"tr-npp-section-title\">8. Hallmark Colored Pencil Thank You Cards</p><p>These cards are fit for both the teacher and the student. An adorable colored pencil design offers a playful canvas for sincere gratitude. Students—or parents of them—can keep these to thank the special teachers who have had an impact on this school year.</p><p><span><span>Get the Hallmark Colored Pencil Thank You Cards for $7.99</span> </span> </p><p class=\"tr-npp-section-title\">9. Moglea Phoenix Thank You Note Card Set</p><p>Lovers of abstract design and bold graphics will love this thank you note set. Designed by Moglea, an Iowa-based letterpress, these chic cards are totally unique. Not only are these notes impressive, but the envelopes also feature stunning designs.</p><p><span><span>Get the Moglea Phoenix Thank You Note Card Set for $16.50</span> </span> </p><p class=\"tr-npp-section-title\">10. Paper Culture Monstera Thank You Notes</p><p>Plant lovers rejoice because this is a card made just for you. Featuring a lovely monstera plant design, these thank yous feature gold foil for a modern look. Plus, you can order in large quantities.</p><p><span><span>Get the Monstera Thank You Note Set from starting at $21.84</span> </span> </p><p><span><span>Make 2022 the year of good decisions.</span> Start by signing up for our newsletter for twice-weekly tips, reviews and more from our experts.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: 10 pretty thank you notes to mail people who made an impact in 2021</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}