{"date": "2022-02-07 20:16:05.912000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_a4vgehk9&amp;referenceId=tag:reuters.com,2022:newsml_OVFXOKJNV_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_a4vgehk9&amp;referenceId=tag:reuters.com,2022:newsml_OVFXOKJNV_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: Peloton Interactive Inc's shares on Monday were set for their best day since their debut after reports of takeover interest from Amazon.com Inc and Nike Inc. This report produced by Chris Dignam.<br/>Short Link: <a href=\"https://refini.tv/3gvZ7Nq\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3gvZ7Nq</a><br/><br/>Video Transcript:<br/><br/>Shares of Peloton shifted into higher gear on Monday, soaring more than 20% after reports Amazon and Nike were interested in taking over the exercise bike maker, which recently lost a majority of its stock gains made during the health crisis. A source told Reuters on Friday that Amazon is exploring an offer for Peloton, while The Financial Times reported Nike was weighing a bid. Amazon, Nike, and Peloton did not immediately respond to a request for comment. The potential offers come at a time Peloton's shares are trading near two-year lows, down over 84% in the past year, as demand for its stay-at-home exercise equipment faded faster than expected due to easing health restrictions. Peloton said last month it was reviewing the size of its workforce and \"resetting\" production levels, which sent shares peddling downhill. It's slated to report second quarter results on Tuesday.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}