{"date": "2022-02-26 02:05:39.088000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3027.16, "close": 3071.26}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Feb. 26 -- Amazon has announced 'Electronics Days' and 'Mega Music Fest' bringing a host of exciting deals and offers on gadgets such as laptops, headphones, speakers, guitars and more from popular brands and latest launches. Customers can get great offers on top brands such as OnePlus, boAt, Sony, Microsoft, Mi, Zebronics, Noise, HP, Sennheiser, Airtel, Sandisk, Blaupunkt, Maono and more. 'Electronics Days' and 'Mega Music Fest' will be live until February 27 and February 28, 2022 respectively.</p><p>Customers can get 7.5% instant discount of up to Rs.2,000 on minimum purchase of Rs.8,000 on Amazon using HSBC and Standard Chartered credit card.</p></div><div class=\"tr-npp-body\"><p>Here are some products with offers and deals:</p><p>Electronics Days</p><p>boAt Airdopes 441</p><p>Plug into Nirvana with boAt Airdopes 441 TWS earbuds to enjoy your music in a truly wireless way. It has the IWP (Insta Wake N' Pair) Technology, meaning as soon as one opens the charging case lid, the earbuds power on and enter connection mode. One may hit the gym or play on any field as its secure sports fit earbuds remain intact and comfortably in place. Its latest Bluetooth v5.0 offers seamless instant connectivity. With a battery capacity of 35mAh for each earbud, indulge in blissful audio experience for up to 5 hours in a go and get an additional 25H of playback with the carry cum charge case. This TWS earbuds is available for Rs.1,999.</p><p>boAt Rockerz 550</p><p>It comes with its latest Bluetooth V5.0. It has been designed and structured as an over-ear headphone to provide the best user experience. The mighty 500mAh battery capacity offers a superior playback time of up to 20 Hours. One can connect to boAt Rockerz 550 via not one but two modes, Bluetooth as well as AUX. Get it for Rs.1,899.</p><p>boAt Stone Marvel Edition 5W Bluetooth Speaker</p><p>boAt Stone Marvel speaker is a must have if you're a Marvel fan. Its powerful 800mAh battery offers a playback time of up to 4 hours. Its speaker possesses the TWS feature, meaning that you can connect two Stone speakers and forge them into one for a greater impact. It has been ergonomically designed keeping in mind the enhanced portability while on the move. Get this speaker for Rs.1,299.</p><p>Noise Buds VS303</p><p>Buds VS303 offer a playtime of up to 6 hours on a single charge and an additional 18 hours making a total playtime of up to 24 hours with the charging case. Its Hyper Sync technology makes you connection easy which ensures instant pairing on just opening the charging case. Get these buds for Rs.1,499 and enjoy rich, powerful sound every time via its 13mm speaker driver.</p><p>Sony ZV-1 Digital Vlog Camera</p><p>Take your YouTube product reviews to a new level of professionalism with the Sony ZV-1 Digital Vlog Camera. Sony's enhanced color science ensures lively, natural images and is especially strong across the diverse range of skin tones. Even while walking with the camera, you can get smooth, highly stable imagery thanks to the Steady-Shot joint optical and electronic stabilization system. It's specifically designed for handheld shots and vlogging with a shooting grip, so you'll enjoy the confidence of blur- and shake-free shots. Get it for Rs.69,490.</p><p>Mega Music Fest</p><p>Blaupunkt SBA40</p><p>Blaupunkt is an iconic German brand that has developed cutting edge audio technology since 1924. Today this legendary Audio Tech German brand is available in India with a wide range of Audio Products. Blaupunkt SBA40's dual passive radiators produce crystal clear surround sound which bring you an immersive sound experience. Blaupunkt SBA40 Bluetooth improves TV sound. The Soundbar is a must-have device to accompany today's modern TVs, brings best leisure experience. Get it for Rs.3,999.</p><p>boAt Rockerz 330</p><p>boAt Rockerz 330 pumps out your favorite tunes with powerful immersive sound via its 10mm dynamic drivers. The neckband offers a huge playback time of up to 30 hours in a go. 10 minutes of charge offers a playtime of up to 10 hours and a full charge can be achieved in just 40 minutes courtesy of its ASAP Fast Charge technology. The ergonomically designed neckband dons magnetic earbuds, has a premium alloy metal control board with high-grade silicone finish and is IPX5 marked for resistance against water, to offer substance with style. Get it for Rs.1,399.</p><p>LG FP5</p><p>Tune into premium audio and tune out the rest with LG FP5's Active Noise Cancellation. Plus, a contoured design fits to the shape of your ear for comfortable listening. A built-in equalizer delivers impressive bass and treble tones that sound like a live recording with pristine clarity. Get this for Rs.9,990 and experience Clear calls with noise reduction &amp; echo cancellation.</p><p>Maono AU-AM200</p><p>Maono AU-AM200 comes with 0-Latency' Monitoring that makes you experience your performance clearly, with no delay or lag in the returning signal, resulting in a better performance and recording. It provides 48Hkz/16Bit sampling rate to capture vocal accurately. It is especially suitable for guitar playing. The 1-Click noise-cancellation can remove most of the environmental noise. It means that you can bring a clearer and more realistic sound to your performance. Get it for Rs.5,999.</p><p>Yamaha FS100C Acoustic Guitar</p><p>Quality and tone at an affordable price is the hallmark of the F series guitars. These guitars share every bit of the passion that ignites the premium range and are the perfect instrument for student or seasoned player alike. Get it for Rs.9,290. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}