{"date": "2021-11-21 22:07:55.314000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Nov. 21 -- Amazon Prime Video will premiere the third season of its original Inside Edge on 3 December. Created by Karan Anshuman, directed by Kanishk Varma and produced by Excel Entertainment, the series stars Vivek Oberoi, Richa Chadha, Tanuj Virwani, Aamir Bashir, Sayani Gupta, Sapna Pabbi, Akshay Oberoi, Sidhant Gupta and Amit Sial in lead roles.</p><p>\"Inside Edge was the first Indian Amazon original that received immense appreciation, accolades and helped set a high bar for storytelling. Our association with Excel Media and Entertainment has continually helped in bringing forth some compelling narratives spanning multiple genres,\" Aparna Purohit, head of India originals, Amazon Prime Video India, said in a statement.</p></div><div class=\"tr-npp-body\"><p>Ritesh Sidhwani of Excel Entertainment said Inside Edge will always be very special given that it is the company's first original with Amazon while also being Amazon's first original in India. Excel has also created shows such as Made In Heaven for the OTT platform.</p><p>Amazon Prime Video had faced controversies earlier this year for web shows like Tandav and Mirzapur 2. It also announced a foray into film production with Akshay Kumar-starrer Ram Setu. Expanding its slate across multiple Indian languages, it has released Putham Pudhu Kaalai, a Tamil anthology of five short films with Rajiv Menon, Suhasini Mani Ratnam, and Karthik Subbaraj besides acquiring a host of Tamil, Telugu and Malayalam films during the pandemic.</p><p>This September, Amazon had turned content aggregator in India with the launch of Prime Video Channels that will make eight other subscription-driven video-on-demand platforms available on its app and website.</p><p>Prime Video customers will be able to access streaming services such as Discovery+, Lionsgate Play, Docubay, Eros Now, MUBI, Hoichoi, Manorama Max, and Shorts TV with add-on subscriptions, paying for the services they choose. There will be a single billing mechanism. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}