{"date": "2021-12-09 19:23:38+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.16, "close": 3444.24}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Corrects typographical errors</p><p class=\"tr-by\">By Stephen Nellis</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Dec 9 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Major companies using Amazon.com's data services got a painful lesson this week about how the complexity and market dominance of the company's cloud unit make it difficult to back up their data with other providers, analysts and experts told Reuters.</p><p>Amazon said that an \"an impairment of several network devices\" in its Amazon Web Services (AWS) Virginia data center region caused the prolonged outage on Tuesday. The outage temporarily interrupted streaming platforms Netflix Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=NFLX.O\" data-type=\"ric\" data-ric=\"NFLX.O\" translate=\"no\" dir=\"ltr\">NFLX.O</a> and Disney+ <a href=\"reuters://REALTIME/Verb=FullQuote/ric=DIS.N\" data-type=\"ric\" data-ric=\"DIS.N\" translate=\"no\" dir=\"ltr\">DIS.N</a>, trading app Robinhood Markets Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=HOOD.O\" data-type=\"ric\" data-ric=\"HOOD.O\" translate=\"no\" dir=\"ltr\">HOOD.O</a> and even Amazon's own e-commerce site, which makes heavy use of AWS.</p><p>An Amazon spokesperson told Reuters on Wednesday that the issues had been resolved.</p><p>The huge trail of damage from a network problem at a single region that AWS calls \"US-EAST-1\" underscored how difficult it is for companies to spread their cloud computing around. </p><p>With 24.1% of the overall market, according to research firm IDC, Amazon is the world's biggest cloud computing firm. Rivals like Microsoft Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MSFT.O\" data-type=\"ric\" data-ric=\"MSFT.O\" translate=\"no\" dir=\"ltr\">MSFT.O</a>, Alphabet's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a> Google Inc and Oracle Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ORCL.N\" data-type=\"ric\" data-ric=\"ORCL.N\" translate=\"no\" dir=\"ltr\">ORCL.N</a> are trying to lure AWS customers to use parts of their clouds, often as a backup.</p><p>But crafting a complex online service that can be easily shifted from one provider to another in case of emergency is far from simple, said Naveen Chhabra, a senior analyst with research firm Forrester. Rather than being a singular \"cloud,\" AWS is actually composed of hundreds of different services, from basic building blocks like computing power and storage to advanced services like high-speed databases and artificial intelligence training.</p><p>Any given website, Chhabra said, might use several dozen of those individual services, each of which must work for the site to function. It is difficult to make a backup on another cloud provider because some services are proprietary to AWS and some work very differently at another provider. </p><p>\"It's like saying, 'Can I put an SUV body on a sedan chassis?' Maybe, if everything is all the same and lines up. But there is no guarantee,\" Chhabra said.</p><p>Another issue that makes it hard for businesses to diversify is that AWS makes it relatively cheap to send data into its cloud, but then charges higher prices for \"egress fees\" to get data out of its cloud to take to a rival.</p><p>\"That amplifies issues like this (outage) when they happen,\" said Matthew Prince, chief executive of internet security firm Cloudflare Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=NET.N\" data-type=\"ric\" data-ric=\"NET.N\" translate=\"no\" dir=\"ltr\">NET.N</a> \"A more resilient cloud is one where egress fees are eliminated and customers can be multi-cloud. I think that would actually increase the faith customers have in the cloud.\"</p><p><br/></p><p>DEPENDENCIES IN ONE REGION </p><p>AWS itself has critical \"dependencies\" within its own services where they are linked together in ways that can cause one to fail when another fails, said Angelique Medina, head of product market at Cisco Systems Inc's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=CSCO.O\" data-type=\"ric\" data-ric=\"CSCO.O\" translate=\"no\" dir=\"ltr\">CSCO.O</a> ThousandEyes. That is because AWS's complex services are often built on top of its own more basic services. One problem that crops up with a basic function like networking can cascade through services that depend on it.</p><p>Early on in the incident on Tuesday, AWS said the outage was \"affecting some of our monitoring and incident response tooling, which is delaying our ability to provide updates.\"</p><p>Medina said AWS also seems to be have critical services clustered in its US-EAST-1 region, where another outage last year also had a widely felt impact. </p><p>\"That's where a lot of their critical dependencies have been located  historically,\" Medina said. \"Over time, they've diversified a bit.\"</p><p>Chhabra, the Forrester analyst, said Amazon has done a lot of \"heavy lifting\" to make its own services resilient. But what Amazon does not do for its customers is build applications in a way that can withstand an outage by tapping multiple locations or providers.</p><p>Doing so can often <span class=\"tr-strong\">involve </span>extra work that might not always be worth it when cloud outages remain relatively rare. </p><p>\"It's this tradeoff you always have between something that is decentralized, something that's secure and something that's useable,\" said Charly Fei, product lead for Inter Blockchain Communication lead at The Interchain Foundation, which is focused on technologies for decentralizing computing. \"It's not something where you'll ever get a perfect solution that gets all three.\"</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Stephen Nellis in San Francisco; Editing by David Gregorio)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Stephen.Nellis@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Stephen.Nellis@thomsonreuters.com</a> ; (415) 344-4934; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-OUTAGE/ (CORRECTED, ANALYSIS, PIX)</p></div>"}