{"date": "2021-11-03 13:00:02.278000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>The Holidays are Here on Amazon Music With Exclusive New Songs and Christmas Covers From Camila Cabello, Dan + Shay, Leon Bridges, Sech, Summer Walker, and George Ezra</b>\n</p><p class=\"bwalignc\">\n<span>New music, artist merch, and podcast episodes arrive on Amazon Music today and throughout the season, including Amazon Original songs for the holidays from Alessia Cara, Norah Jones, She &amp; Him, NEEDTOBREATHE, Switchfoot, JUDAH., Olivia Dean, La Oreja de Van Gogh, and Lang Lang!</span>\n</p><p class=\"bwalignc\">\n<span>For a limited time, customers who haven’t yet tried Amazon Music Unlimited can get three months free—with unlimited access to millions of podcast episodes and more than 75 million songs, ad-free, in the highest-quality streaming audio</span>\n</p><p class=\"bwalignc\">\n<span>Download track artwork <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fpress.aboutamazon.com%2F2021-amazon-music-holiday-originals&amp;esheet=52520554&amp;newsitemid=20211103005270&amp;lan=en-US&amp;anchor=here&amp;index=1&amp;md5=b0e930b35f1fb58bb6b8bd28d7c9bac5\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a></span>\n</p><p>\n(NASDAQ: AMZN) Amazon Music today announced its biggest season of holiday programming yet, with brand-new exclusive Christmas music arriving today from artists across the globe—including Camila Cabello’s cover of “I’ll Be Home for Christmas.” Even more Amazon Original songs are available to stream now, including a fresh original song from Dan + Shay called “Pick Out a Christmas Tree,” a reimagined version of Marvin Gaye’s “Purple Snowflakes” performed by Leon Bridges, a new original song, “Carta Navideña,” by Sech, and Summer Walker’s version of Marvin Gaye’s “I Want to Come Home for Christmas,” coming November 12. Also out today is Norah Jones’ cover of “The Christmas Waltz,” Alessia Cara’s modern take on “Jingle Bell Rock,” a beautiful performance of Dean Martin’s “I've Got My Love To Keep Me Warm” by She &amp; Him, Chris Tomlin’s new version of his song “Emmanuel God With Us” featuring Anne Wilson, and an all-new song from NEEDTOBREATHE, Switchfoot, and JUDAH. called “Hometown Christmas.”\n</p><p class=\"bwalignc\">\n<span>To start streaming a selection of these new holiday classics, click <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Famzn.to%2FMerryMix&amp;esheet=52520554&amp;newsitemid=20211103005270&amp;lan=en-US&amp;anchor=here&amp;index=2&amp;md5=e371ad0ef00f75811f210bd6029f9451\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a> and <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Famzn.to%2Famazonholidayoriginals&amp;esheet=52520554&amp;newsitemid=20211103005270&amp;lan=en-US&amp;anchor=here&amp;index=3&amp;md5=119296a00d243d5b3c4e8652fb1f0c57\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here \n</a><br/>Watch behind-the-scenes interviews with Dan + Shay, Leon Bridges, NEEDTOBREATHE, Switchfoot and JUDAH. <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D7sezpmJZfA4&amp;esheet=52520554&amp;newsitemid=20211103005270&amp;lan=en-US&amp;anchor=here&amp;index=4&amp;md5=3818c9cd995cf9d9a7191c6ceac2fb07\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a>, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DsZc0llb3_VQ&amp;esheet=52520554&amp;newsitemid=20211103005270&amp;lan=en-US&amp;anchor=here&amp;index=5&amp;md5=5a8c49a67b602a4d0eee24b6f81a667b\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a> and <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DmsD7qqP4m6I&amp;esheet=52520554&amp;newsitemid=20211103005270&amp;lan=en-US&amp;anchor=here&amp;index=6&amp;md5=cf1af18636a0d2e5f17e3ed8fc2f8d3d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a></span>\n</p><p>\n“I’ve been traveling a lot since I was 15 and started working so I chose to record this song as an Amazon Original because I’ve always looked forward to being home in Miami with my family for Christmas,” said Camila Cabello. “I wanted to continue the world of my album ‘Familia’ by having it be a Mariachi rendition because I’m half Mexican and I grew up listening to Mariachi music. I’m excited to be on people’s Christmas playlists because it’s such a magical time of the year and getting to be part of the soundtrack during such an intimate family and friend holiday season is a real honor. It’s truly special and really sacred.”\n</p><p>\n“This is one of our favorite times of the year, where we’re able to bring our customers around the world a collection of brand-new music and programming to celebrate the holiday season,” said Ryan Redington, VP of music industry, Amazon Music. “It’s always thrilling to see a spike in the charts for Christmas classics, and our Amazon Original songs for the holidays—from incredible artists like Camila Cabello, Summer Walker, and George Ezra—introduce a contemporary take on the familiar favorites that our customers love to stream. In fact, in the last three years, the top 25 most popular holiday Amazon Original songs, from artists such as Katy Perry, John Legend, and Justin Bieber, have surpassed 750 million streams globally.”\n</p><p>\nAmazon Music is celebrating the holidays across the globe, with new music arriving from international talent to light up the season. From the UK, singer/songwriter George Ezra will debut “Come on Home for Christmas,” his beautifully reworked take on Charles Brown’s “Please Come Home for Christmas.” British Amazon Music Breakthrough artist Olivia Dean, Chinese pianist Lang Lang, and German pop-singer and songwriter Sarah Connor have each recorded their own reimagined versions of Nat King Cole’s timeless classic, “The Christmas Song.” In addition, Latin pop-rock trio Reik will debut their rendition of “Last Christmas,” and Marcos Witt will premiere a Spanglish version of “Noche de Paz (Silent Night) / Santa la Noche (O Holy Night)” with his daughter, Elena Witt-Guerra. From Mexico, singers María León, Paty Cantú, and María José<b> </b>team up for a rendition of Mariah Carey’s “All I Want for Christmas Is You” out on November 19, and French-Canadian singer-songwriter Cœur de pirate premieres a melodic new original, “Parfait Noël.” Spanish pop band La Oreja de Van Gogh will also delight customers with their version of “Blanca Navidad.”\n</p><p>\n“When I first heard I was going to do an Amazon Original, I immediately thought of the Marvin Gaye version of ‘Purple Snowflakes,’” said Leon Bridges. “It’s one of my favorite Christmas songs and I love the classic stuff… but this one has a little bit more soul to it. There aren’t too many renditions of this song and I wanted to kind of put my own spin on it as far as figuring out the arrangement and give it the Fort Worth, Texas approach.”\n</p><p>\n“Writing original Christmas songs is difficult, because there’s already so many good songs that exist and ... you feel like everything’s already been said,” shared Dan + Shay. “One day we sat down to write our song and it sort of poured out of us—it was just the soundtrack for folks going out, families, friends going to a Christmas tree farm, or going to a store down the street and picking out a Christmas tree. We’re so excited about it and hopefully it brings a little joy this holiday season.”\n</p><p>\n“Above all, it is important to give thanks! Music has given me everything, and I am grateful and humbled to use it to give back to my fans,” said Sech. \"‘Carta Navideña’ is an original song inspired by the holiday spirit felt around the world. You can recognize the sounds often heard in the classics, but with my unique style and emotions. The lyrics express my fondest holiday memories and traditions. I hope it becomes a popular classic, too, resonating with fans and reminding them to create many happy memories and give thanks always.”\n</p><p>\nIn addition to new holiday songs, Amazon Music listeners can explore hundreds of festive playlists and stations across artists and decades, including “REDISCOVER: Mariah Carey Christmas,” “Holiday Favorites,” “Christmas Past,” and “Christmas Present,” and a host of new programmed destinations. “Fluent Holidays” is a new playlist celebrating fans who move fluidly between cultures, featuring English, Spanish and bilingual holiday tunes from artists including Reik, Sebastián Yatra, Camila Cabello, Katy Perry, and Sech. The playlist will spotlight English and Spanish language holiday classics, including new Amazon Original songs. “Merry Mix” is a global playlist on Amazon Music featuring iconic holiday classics mixed with tomorrow’s holiday hits. And starting November 19, customers in the U.S. can check out a hosted version of Merry Mix in DJ Mode, which will feature special guests such as Mariah Carey sharing their holiday memories, the stories behind their own holiday songs, and much more. Customers will also hear festive tracks including Bing Crosby’s “White Christmas,” Darlene Love’s “Christmas (Baby Please Come Home),” and John Legend’s “What Christmas Means to Me” with Stevie Wonder. To listen to the station, simply ask “Alexa, play Merry Mix in DJ Mode” in the Amazon Music app for iOS and Android or on Alexa-enabled devices.\n</p><p>\n<b><span>Holiday Merch</span></b>\n</p><p>\nFans can shop holiday merchandise collections on the <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazon.com%2FArtist-Merch-Shop%2F&amp;esheet=52520554&amp;newsitemid=20211103005270&amp;lan=en-US&amp;anchor=Amazon+Music+Artist+Merch+Shop&amp;index=7&amp;md5=8f0f872080b5ed8fe7436097487c474d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Music Artist Merch Shop</a>, a comprehensive shopping experience on Amazon.com, developed and curated by the Amazon Music team. To celebrate the season, Amazon Music offers a wide-ranging <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazon.com%2Fholidaymerch%2F&amp;esheet=52520554&amp;newsitemid=20211103005270&amp;lan=en-US&amp;anchor=gift+guide&amp;index=8&amp;md5=a235c6ed1b52a08ab5d846d33d6481b3\" data-type=\"url\" class=\"tr-link\" translate=\"no\">gift guide</a>, featuring festive merch from some of the biggest stars, including Dolly Parton, Lil Nas X, an exclusive holiday T-shirt from KISS, The Beatles, and more.\n</p><p>\n<b><span>Podcasts</span></b>\n</p><p>\nAmazon Music is home to millions of podcast episodes and shows for the entire family to enjoy together, including <span>Little Stories Everywhere, </span>and <span>Wow in the World </span>available on Wondery. This holiday, Amazon Original podcasts <span>Uncommon Ground with Van Jones</span>, <span>Country Heat Weekly</span>, and <span>That Scene with Dan Patrick</span> will feature special holiday episodes to celebrate the season.\n</p><p>\nFor a limited time, customers who haven’t yet tried Amazon Music Unlimited can get three months free—with unlimited access to more than 75 million songs, ad-free, in the highest-quality streaming audio and millions of podcast episodes. In addition, with the purchase of select Amazon Echo devices, customers new to Amazon Music Unlimited can get six months free.\n</p><p>\n<b>About Amazon Music</b>\n</p><p>\nAmazon Music reimagines music listening by enabling customers to unlock millions of songs and thousands of curated playlists and stations with their voice. Amazon Music provides unlimited access to new releases and classic hits across iOS and Android mobile devices, PC, Mac, Echo, and Alexa-enabled devices including Fire TV and more. With Amazon Music, Prime members have access to ad-free listening of 2 million songs at no additional cost to their membership. Listeners can also enjoy the premium subscription service, Amazon Music Unlimited, which provides access to more than 75 million songs and the latest new releases. Amazon Music Unlimited customers also now have access to the highest-quality listening experience available, with more than 75 million songs available in High Definition (HD), more than 7 million songs in Ultra HD, and a growing catalog of spatial audio. Customers also have free access to an ad-supported selection of top playlists and stations on Amazon Music. All Amazon Music tiers now offer a wide selection of podcasts at no additional cost, and live streaming in partnership with Twitch. Engaging with music and culture has never been more natural, simple, and fun. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Famazonmusic.com%2F&amp;esheet=52520554&amp;newsitemid=20211103005270&amp;lan=en-US&amp;anchor=amazonmusic.com&amp;index=9&amp;md5=48392c759daccb971c39a4586d1f1ab4\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazonmusic.com</a> or download the Amazon Music app.\n</p><p>\n<strong>About Amazon</strong>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Famazon.com%2Fabout&amp;esheet=52520554&amp;newsitemid=20211103005270&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=10&amp;md5=e53f2b83545e0508443de8c0f411f2d0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211103005270r1&amp;sid=ny6r1&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTAzMDA1MjcwcjEmc2lkPW55NnIxJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=0f18634982f2c818feafe079ba915ebc4dcd62a730acb96669d860036f7ccb124d021ed62a2ceca41565f7bbb5289e09948d7e63f8ad018e4fafc7d33e59f51e\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211103005270/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211103005270/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52520554&amp;newsitemid=20211103005270&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=11&amp;md5=0b810e4108ea4560cfd2ba800453d061\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON</p></div>"}