{"date": "2022-01-29 08:56:15+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2792.75, "close": 2991.47}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><br/>\nBy Staff Writer<br/>\n<p><span class=\"round articleImage\" id=\"span\"></span></p>\n<p><span class=\"round articleImage\" id=\"span\"></span></p>\n<div id=\"atext\">\n<div>GFH, a leading regional financial group with key interests in asset management and real estate, said its European subsidiary, Roebuck Asset Management, has successfully completed an exit from its Amazon Last Mile Logistics Warehouses Portfolio, which covers an area of 140,000 sq m in Spain.</div>\n<div>Announcing this today (January 29), GFH said the portfolio, which was acquired in 2020,</div>\n<div>comprises three strategically located, high-quality assets leased to Amazon Road transport Spain (SLU).</div>\n<div>The last mile delivery facilities, spread across Murcia, Alicante and Valladolid, form a critical part of Amazon's rapidly expanding Spanish logistics network, said the statement for GFH.</div>\n<div>Online sales accounted for unprecedented levels of total retail sales during the Covid-19 pandemic, spiking as high as a third in some European countries during lockdowns.</div>\n<div>The e-commerce market in Spain has grown to over €5 billion, expanding by an average of over 13% annually for the past decade. Amazon has invested nearly €3 billion in Spain over the past decade and has seen its revenues quadruple in the past few years. A fact that fueled the need for last mile distribution assets that facilitate and reduce delivery times.</div>\n<div>During the holding period, Roebuck took an active asset management approach, overseeing the completion of the development and the takeover by the tenant, and actively sourcing a suitable buyer to secure the exit, said the statement.</div>\n<div>The portfolio's exit reflects an overall return on investment (ROI) of 17%, matching what was initially targeted over a longer holding period, it added.</div>\n<div>Hugh Macdonald-Brown, Managing Partner at Roebuck, said: \"Significant shifts in the e-commerce and Fast Moving Consumer Goods markets over the last two years have sparked increased demand for quality warehousing facilities across Europe.\"</div>\n<div>\"Leading distributors now rely on well located, modern facilities as part of their logistics networks. This is an opportunity we have been swift to capitalise on,\" he noted.</div>\n<div>Nael Mustafa, Co-Chief Investment Officer at GFH, said: \"While we still believe in the overall fundamentals of investing in logistics assets, our investment in the Amazon Last Mile Logistics Warehouses Portfolio has delivered the target yield and the capital appreciation desired.\"</div>\n<div>\"Amid favourable market conditions, we have decided to make a timely and profitable earlier exit to secure a strong return for investors,\" he stated.</div>\n<div>GFH focuses on defensive sectors and prime, income yielding real estate and logistics assets.</div>\n<div>However, its strategy is also underpinned by an opportunistic and agile outlook that aims to capitalise on market shifts.</div>\n<div>The group has an ongoing strategy to diversify and expand its portfolio of international real estate assets.</div>\n<div>\"GFH remains committed to the strategy of sourcing and structuring robust real estate asset transactions in Europe and the US that provide stable returns in fundamentally sound sectors supported by long term trends,\" remarked Mustafa.</div>\n<div>GFH's exit from its Amazon Last Mile Logistics Warehouses Portfolio has positively impacted the group's year-end financials of 2021, it added<strong>.TradeArabia News Service</strong></div>\n</div>\n<p class=\"syndigate_disclaimer\">Copyright 2022 Al Hilal Publishing and Marketing Group <span>Provided by SyndiGate Media Inc. (<a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a>).</span></p>\n<div class=\"footnote-disclaimer\">Disclaimer: The content of this article is syndicated or provided to this website from an external third party provider. We are not responsible for, and do not control, such external websites, entities, applications or media publishers. The body of the text is provided on an \"as is\" and \"as available\" basis and has not been edited in any way. Neither we nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this article. <a href=\"https://d3a0oa8cittb3t.cloudfront.net/researchreports/Disclaimers/TR%20Disclaimer.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read our full disclaimer policy here</a>.</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© TradeArabia</p></div>"}