{"date": "2021-12-01 19:51:02.336000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Meta Selects AWS as Key, Long-Term Strategic Cloud Provider</b>\n</p><p class=\"bwalignc\">\n<span>Meta will use AWS services and global infrastructure to scale research and development, facilitate third party collaborations, and drive operational efficiency</span>\n</p><p class=\"bwalignc\">\n<span>Meta and AWS will jointly help enterprises use PyTorch on AWS to bring deep learning models from research into production faster and easier</span>\n</p><p>\nToday, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), announced that Meta (NASDAQ: FB) has deepened its relationship with AWS as a strategic cloud provider. Meta uses AWS’s proven infrastructure and comprehensive capabilities to complement its existing on-premises infrastructure, and will broaden its use of AWS compute, storage, databases, and security services to provide privacy, reliability, and scale in the cloud. Meta will run third-party collaborations in AWS and use the cloud to support acquisitions of companies that are already powered by AWS. It will also use AWS’s compute services to accelerate artificial intelligence (AI) research and development for its Meta AI group. In addition, Meta and AWS will work together to improve the performance for customers running <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fpytorch.org%2F&amp;esheet=52542576&amp;newsitemid=20211201005108&amp;lan=en-US&amp;anchor=PyTorch&amp;index=1&amp;md5=5e24ce45fc1b0b83a80a11377b913b39\" data-type=\"url\" class=\"tr-link\" translate=\"no\">PyTorch</a> on AWS and accelerate how developers build, train, deploy, and operate artificial intelligence/machine learning models.\n</p><p>\nAWS and Meta will help machine learning researchers and developers by further optimizing PyTorch performance and its integration with core managed services such as Amazon Elastic Compute Cloud (Amazon EC2) and Amazon SageMaker (AWS’s service that helps developers and data scientists build, train, and deploy machine learning models quickly in the cloud and at the edge) for building, training, and deploying artificial intelligence models at scale. To make it easier for developers to build large-scale deep learning models for natural language processing and computer vision, the companies are enabling PyTorch on AWS to orchestrate large-scale training jobs across a distributed system of AI accelerators. The companies will work together to offer native tools to improve the performance, explainability, and cost of inference on PyTorch. To simplify the deployment of models in production, the companies will continue to enhance TorchServe, the serving engine native to PyTorch that makes it easy to deploy trained PyTorch models at scale. Building on these open-source contributions, AWS and Meta plan to help organizations bring large-scale deep learning models from research to production faster and easier with optimized performance on AWS.\n</p><p>\n“Meta and AWS have been expanding our collaboration over the last five years,” said Kathrin Renz, Vice President of Business Development and Industries at Amazon Web Services, Inc. “With this agreement, AWS will continue to help Meta support research and development, drive innovation, and collaborate with third parties and the open-source community at scale. Customers can rely on Meta and AWS to collaborate on PyTorch, making it easier for them to build, train, and deploy deep learning models on AWS.”\n</p><p>\n“We are excited to extend our strategic relationship with AWS to help us innovate faster and expand the scale and scope of our research and development work,” said Jason Kalich, Vice President of Production Engineering at Meta. “The global reach and reliability of AWS will help us continue to deliver innovative experiences for the billions of people around the world that use Meta products and services and for customers running PyTorch on AWS.”\n</p><p>\n<b>About Amazon Web Services</b>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com&amp;esheet=52542576&amp;newsitemid=20211201005108&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=2&amp;md5=d89ba2c596e3b50ebc342adaf7072c32\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<b>About Amazon</b>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Famazon.com%2Fabout&amp;esheet=52542576&amp;newsitemid=20211201005108&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=3&amp;md5=35b88889a59d80f0abd6125b357708f7\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> amazon.com/about</a> and follow @AmazonNews.\n</p><p><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211201005108/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211201005108/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52542576&amp;newsitemid=20211201005108&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=4&amp;md5=3d7e922656eee4231e0c910895dbce0d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON-WEB-SERVICES</p></div>"}