{"date": "2021-11-30 23:41:32.815000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>INTERNATIONAL BUSINESS MACHINES (\"IBM-N\")\n- Acquires Hybrid Cloud Consulting Business in Australia\n\n     IBM announced the acquisition of SXiQ, an Australian digital\ntransformation services company specializing in cloud applications, cloud\nplatforms and cloud cybersecurity. Today's news further advances IBM's\nhybrid cloud and AI strategy by helping enterprises modernize and transform\ncomplex mission-critical applications on multiple clouds and platforms.\n\n    Continue Reading\n\n     \"Companies are very clearly deploying hybrid cloud strategies as\ninteroperability, security, compliance and avoiding vendor lock-in are top\nof mind,\" said John Granger, Senior Vice President, Hybrid Cloud Services,\nIBM Consulting. \"IBM's acquisition of SXiQ brings additional hybrid and\nmulticloud expertise that is at the core of open innovation for clients.\"\n\n     Organizations are increasingly turning to multiple cloud providers and\nplatforms to best meet a broad range of business needs. A recent global IBM\nstudy found that hybrid cloud is the dominant IT architecture with only\nthree percent of C-level executives using a single private or public cloud\nin 2021.\n\n     SXiQ works with leading Australian enterprises, as well as the\nAustralian operations of global Fortune 2000 companies, to successfully\nmigrate and modernize their cloud infrastructure and applications across\nmultiple industries including financial services, consumer products,\nenergy, healthcare, and the public sector. The company also works with\nclients to monitor and optimize their spend on cloud resources, helping\nenterprises unlock greater value from their cloud investment to realize\ncost savings of 20 percent or more.\n\n     SXiQ will enhance IBM Consulting's capabilities in Australia and New\nZealand to modernize applications and technology infrastructure in the\ncloud. This is the 20th acquisition - and tenth consulting acquisition -\nsince Arvind Krishna became IBM's CEO, adding to the significant\ninvestments the company is making in its hybrid cloud and AI strategy. The\nannouncement of the SXiQ acquisition follows recent acquisitions by IBM of\nleading cloud consulting firms - Nordcloud, Taos, and BoxBoat - earlier\nthis year, which significantly expanded IBM's multicloud transformation,\nmanagement expertise and capabilities in Europe and North America.\n\n     SXiQ will join IBM Consulting's fast-growing Hybrid Cloud Services\nbusiness, helping IBM capitalize on a rapidly growing cloud professional\nservices market which will surpass $200 billion globally by 2024.1  SXiQ's\nteam of technology consultants brings expertise transforming and migrating\nenterprise workloads on cloud platforms including Amazon Web Services and\nMicrosoft Azure.\n\n     \"Our digital transformation experience and track record of client\ndelivery on leading cloud platforms will send a strong signal affirming our\nand IBM's commitment to clients' successful journey to cloud,\" said John\nHanna, Managing Director, SXiQ. \"Our clients can now take advantage of\nIBM's broad capabilities around ERP systems, Data &amp; Analytics, Machine\nLearning &amp; AI, deep platform partnerships and global delivery capabilities,\nallowing us to broaden the transformational capabilities we can bring to\nour customers, ensuring they can take their own digital transformation\nfurther and deeper.\"\n\n     Financial details were not disclosed.\n\n     To learn more about IBM Consulting, please visit:\nwww.ibm.com/consulting\n\n     1 Estimates based on Gartner and IDC 2024 projections for cloud\nmanaged services and professional services.\n\n     Media contacts:\n\n     Marisa ConwayIBM Global Communications[email protected]\n\n     Elizabeth EggintonIBM Communications Australia &amp; New Zealand[email\nprotected]\n\nTel   : 1-914-499-1900    INTERNATIONAL BUSINESS MACHINES\nWWW   : <a href=\"http://www.ibm.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.ibm.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133300773.MNPRE2133303703-15202520211130</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}