{"date": "2021-12-08 10:01:11.081000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Read Article Dell Technologies and Amazon Web Services are bringing Dell's cyber recovery vault to the AWS Marketplace with the launch of Dell EMC PowerProtect Cyber Recovery for AWS. Through the AWS Marketplace, customers can easily purchase and deplo...</p><p>Dell Technologies and Amazon Web Services are bringing Dell's cyber recovery vault to the AWS Marketplace with the launch of Dell EMC PowerProtect Cyber Recovery for AWS. Through the AWS Marketplace, customers can easily purchase and deploy an air-gapped cyber vault from Dell, the leading provider of data protection appliances &amp; software globally1, to help securely protect and isolate data away from a ransomware attack. <br/><br/> Dell EMC PowerProtect Cyber Recovery for AWS provides multiple layers of protection with a modern approach that allows AWS customers to resume normal business operations quickly and confidently after a cyberattack. The solution moves a customer's critical data away from the attack surface, physically and logically isolating it with a secure, automated operational air gap. Unlike standard backup solutions, this air gap locks down management interfaces, requiring separate security credentials and multi-factor authentication for access. <br/><br/> \"Data is a strategic asset and protecting it against ransomware and other cyberattacks is critical for organizations to make informed decisions about their business and thrive in today's digital economy,\" said David Noy, vice president of data protection product management, Dell Technologies. \"By teaming with AWS, we are offering customers a cyber recovery solution that isolates business-critical data away from an attack with an air-gapped cyber vault, helping organizations reduce risk and protect data with confidence after a successful cyberattack.\" <br/><br/> As organizations continue to adopt diverse IT infrastructures, across the public cloud and on-premises environments, data protection solutions can improve data security. According to the 2021 Dell Technologies Global Data Protection Index survey of 1,000 global IT decision makersof which 250 are from APJ (Australia, India, Japan, Singapore, and South Korea), Global: 67%, APJ: 66% of organizations lack confidence that all business-critical data can be recovered in the event of a destructive cyberattack. Dell EMC PowerProtect Cyber Recovery for AWS helps customers address the increasing risk of ransomware and other cyberattacks. <br/><br/> Lucas Salter, general manager, Data Protection Solutions, Asia Pacific &amp; Japan, Dell Technologies added, \"Across APJ, 82% of companies are concerned their organization's existing data protection solutions won't be able to meet all future business challenges. Moreover, 70% of companies are struggling to find suitable data protection solutions for cloud native applications. Our collaboration with AWS is timely as it delivers integrated capabilities to help customers maintain continuity, scale new opportunities for growth, enable greater data mobility, and more importantly, future proof their IT operations.\" <br/><br/> \"In current times, we are witnessing large volumes of data being generated and exchanged, making it vital for organizations to take significant steps to safeguard their mission-critical data. Our recent 2021 Global Data Protection Index survey highlights that 42% of respondents in India lack confidence that all their business-critical data can be recovered in the event of a destructive cyberattack or data loss,\" said Ripu Bajwa, Director &amp; General Manager, Data Protection Solutions, Dell Technologies India. \"Therefore, we have collaborated with AWS to launch a cyber recovery solution that offers modern data protection to isolate critical data, reduces the risk of cyberattacks, and helps accelerate data recovery,\" he added. <br/><br/> Available today, Dell EMC PowerProtect Cyber Recovery for AWS is the latest data protection solution from Dell Technologies available for purchase in AWS Marketplace, a digital catalog with thousands of software listings from independent software vendors that make it easy to find, test, buy and deploy software that runs on AWS. Customers can gain fast access to Dell's portfolio of data protection offerings for AWS with a simple purchase, so they can begin deployment immediately.</p></div><div class=\"tr-npp-body\"><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}