{"date": "2021-11-29 19:35:16.497000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>YES BANK has collaborated with Amazon Pay and Amazon Web Services (AWS), to offer customers an instant real-time payment system via a UPI transaction facility.</p><p>UPI facilitates inter-bank peer-to-peer and person-to-merchant transactions through YES BANK's digital payments platform, and expands YES BANK's digital banking offerings.The integration enables Amazon Pay to issue UPI IDs with the @yapl handle, allowing customers to make secure, fast, and convenient payments. The collaboration with Amazon Pay and AWS marks another milestone for YES BANK, among the market leaders in UPI payments. In FY 2020-21, YES BANK recorded a market share of around 40% by volume in the UPI ecosystem and around 30% by volume in the UPI merchant acquiring business.Based on a multi-bank model, this collaboration allows YES BANK to acquire merchants through the Amazon Pay platform, further extending the Bank's presence in the UPI merchant business segment.YES BANK has developed a cloud-native UPI processing platform to optimally handle the high traffic of transactions observed during surge periods like festivals or annual sales. The Bank is hosting its UPI processing platform on AWS. With AWS, the Bank will have more flexibility to scale with the exponential growth in UPI volumes driven by high customer demand.Welcoming the development, Prashant Kumar, MD &amp; CEO, YES BANK, said, \"In our efforts to provide greater ease and convenience to our customers by continually simplifying payment journeys for them, YES BANK is pleased to announce its partnership with Amazon Pay and AWS. With this collaboration, we will be able to offer our customers more control, flexibility and choice for a vast range of purchases and peer-to-peer transactions - through UPI-based payments. As our country embraces the change in the transaction environment from cash to digital, this timely integration will allow the Bank to better serve the evolving payment preferences of our customers, driving satisfaction levels and a superior and seamless payment experience.\"Mahendra Nerurkar, CEO and Vice President, Amazon Pay, added, \"It is our endeavor to make digital payments trusted, convenient, and rewarding for customers across India. Our collaboration with YES BANK is an extension of this effort and unlocks more choices for our customers to pay anyone, anytime, anywhere, on or off Amazon.in. UPI is one of the most convenient and popular ways to pay in India. With a cloud native architecture we hope to keep raising the bar on availability, speed and customer experience using UPI through the Amazon app.\"\"Building YES BANK'S UPI processing platform on AWS allows the Bank to access the full breadth and depth of AWS to build a highly resilient and scalable payments platform. This platform is available to customers and offers YES BANK the ability to continuously add new features and services focused on enhancing customer experience. We look forward to working closely with the YES BANK team to bring innovative payments and digital services, providing their customers with secure, reliable, and effortless transaction options,\" said Puneet Chandok, President, Commercial Business, AWS India and South Asia, AISPL.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}