{"date": "2022-01-19 01:43:49.810000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_6kdpu81t&amp;referenceId=1_6kdpu81t&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_6kdpu81t&amp;referenceId=1_6kdpu81t&amp;pageId=RefinitivNewscasts</a></pre>Source: Stocktube<br/><br/>Description: Yooma Wellness Inc (CSE:YOOM, OTC:LVVEF, AQSE:YOOM) (Yooma Wellness Inc (CSE:YOOM, OTC:LVVEF, AQSE:YOOM), Yooma Wellness Inc (CSE:YOOM, OTC:LVVEF, AQSE:YOOM), Yooma Wellness Inc (CSE:YOOM, OTC:LVVEF, AQSE:YOOM)) Jordan Greenberg, chief executive and James Lawson Baker, founder of MYO join Proactive London after announcing the MYO Plant Nutrition brand will be stocked in over 800 Boots stores. &amp;#xD;&amp;#xD;&amp;#xD;MYO Plant Proteins will be on the shelves in 838 stores, of which 574 stores will also stock its amino acids and 522 will include functional sprays.&amp;#xD;&amp;#xD;&amp;#xD;This follows listings achieved with Holland &amp; Barrett, Selfridges, Lloyds Pharmacy and Amazon, among others.<br/>Short Link: <a href=\"https://refini.tv/3GJ3Oz0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3GJ3Oz0</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; Hello there. Good Afternoon. You're watching Proactive at London. And joining us today from Yooma Wellness is the CEO, Jordan Greenberg. A warm welcome back. And today accompanied by James Lawson, the founder of Myo. So a warm welcome to you both because big news this week. Because Myo, the plant nutrition brand, will be starting over 800 Boots stores, furthering expanding your UK presence after a number of listings last year. So fantastic news. Let's maybe start with Jordan. Great to see you, again. So tell us how you feel about this news. &gt;&gt; Nice to see you again, Katie. Thanks for having us on. We're very excited. We think that this is transformative for the Myo brand. As you said, distribution now in 800 Boots stores across the UK. Really explosive growth on the Myo brand. We're very excited. At Yooma, we've seen strong growth in Asia, in Europe, and now in the UK. This is really exciting for the Myo brand and for Yooma. &gt;&gt; Well, let's learn more about the brand and the perfect person to do that is James. James, thank you for your time today. &gt;&gt; Hi, Katie. &gt;&gt; So tell us about Myo. &gt;&gt; So Myo is a plant-based full body wellness brand. What we try and do is, we try and take the key pillars of wellness. So everything from the body to the brain, to the gut. And we try and provide the most nutritionally complete plant-based supplements. &gt;&gt; Why would somebody need that? &gt;&gt; So we're seeing this massive trend of wellness. And wellness was something that was fairly niche five or six years ago, but it's totally mainstream now. Health is more important than ever. And people are trying to find little ways to improve what they define as full body wellness. &gt;&gt; Yeah, and I think it's such a common conversation now, isn't it? Wellness. We're all into it. And I think COVID even accelerated that. We're watching our health much, much more and therefore investing more so into it. Going back to Jordan here, what would be the next step? What's your ambition with this one here? You've got 800 Boots stores. What happens next? &gt;&gt; Excuse me, as we've talked about previously, we're working towards integrating. We've taken a pause from the acquisitions. We're working on integrating all of the various assets. So looking for cost savings and efficiencies across the portfolio. And more exciting for us is really promoting those various products across the different sales channels. Some of those sales channels or sales cycles are longer than others, but we're seeing some success. And we're very excited at how the organization is taking shape through that integration. &gt;&gt; And If we remind everybody, I think you acquired Myo in March 2021 and you've had deals with Holland &amp; Barrett, Selfridges, Lloyd's pharmacy , Amazon as well. So it's not shorter deals here, Jordan? &gt;&gt; Correct. So Boots is exciting, from a product recognition standpoint. We're really excited about the online channels. We've seen strong growth, both in traditional retail, but also very strong growth in the online channels which we're very keen to pursue. &gt;&gt; And James, you were talking about how popular products like this are becoming and they are. But they're also becoming very competitive. What do you think it is about Myo? &gt;&gt; That's a really good question. And listing of the size we've got Boots. Really is a sign that our USP is at points of difference, are really in the right place. And so I think there's a few things. The first thing is that we have hyper-key ingredients decks. We have no artificials, no fillers. We try and use as few ingredients as we can to make the best product possible. All of our products are 100% plant-based and gluten-free. We're really environmentally conscious brand, so we use biodegradable packaging. Pouches [inaudible 00:04:10] are made from a derived sugar cane, making it bio-degradable, our [inaudible 00:04:15] are fully recyclable. I think the other thing is that we're wellness and holistic nutrition brands and we're not operating quite in the same space as the traditional, I suppose, more hardcore [inaudible 00:04:25] brands, so we're applicable to a much wider group of people. &gt;&gt; [inaudible 00:04:31]. Thank you very much indeed for talking to us this afternoon. That's Jordan and James there talking about Yooma Wellness here in Proactive London. &gt;&gt; Thank you, Katie.<br/></span></div></div></div></div>"}