{"date": "2021-12-22 20:42:22.446000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.34, "close": 3421.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>DASAN ZHONE SOLUTIONS INC (\"DZSI-Q\")\n- Participates in O-RAN ALLIANCE Plugfest with Mavenir in Turin,\n- Italy to Validate Open, Multi-Vendor 5G Stand Alone and 4G\n- Macro Solutions\n\n   DZS, a global leader in broadband connectivity platforms and\ncommunications software solutions, today announced its participation in the\nthird Global O-RAN ALLIANCE PlugFest at the European Open Test and\nIntegration Center (OTIC) in Turin, Italy hosted and sponsored by TIM. This\ntesting validated multi-vendor 5G interoperability and end-to-end\nfunctional tests of O-RAN ALLIANCE specifications for 5G and 4G Radio\nAccess Network (RAN) elements, including fronthaul, midhaul and backhaul\ninterfaces between Radio Access Network equipment provided by DZS, Mavenir,\nDell, VMware, Microelectronics Technology (MTI), and Keysight Technologies.\n\n   \"DZS is proud to have collaborated in the Turin OTIC lab with Mavenir\nand a strong complement of other O-RAN ALLIANCE members in defining the\nfuture of 4G and 5G O-RAN architectures in Europe and around the world,\"\nsaid Charlie Vogt, President and CEO, DZS. \"This highly successful PlugFest\nin Italy showcased DZS open fronthaul transport solutions and demonstrated\nhow we, in combination with our industry partners, can enable a path\nforward for service providers seeking to modernize their networks with the\nflexibility and efficiencies of O-RAN architectures. The success of the\nGlobal O-RAN Plugfest 2021 clearly shows that O-RAN is emerging as a\ncompelling solution for not only greenfield networks, but also for\nestablished service providers who are already pioneering large-scale 5G\ndeployments.\"\n\n   Starting in Q3 2021, the third O-RAN ALLIANCE Global Plugfest was held\nin 7 venues across the world including 94 participating companies -\ndemonstrating the commercial readiness of many O-RAN implementations.\nVendors participating in the Turin OTIC lab multi-vendor interoperability\ntest network included:\n\n   *  DZS C1216RO open fronthaul gateways featuring built-in GPS and\nnetwork timing support\n   *  Mavenir 5G radio units (RUs) and MTI 4G RUs\n   *  Mavenir MAVair 4G and 5G virtualized RAN (VRAN) and MAVcore converged\ncore network software\n   *  Dell EMC PowerEdge R-Series and XE carrier-grade servers\n   *  VMware Telco Cloud Platform software environment\n   *  AWS Outposts edge cloud infrastructure environment\n   *  Keysight Technologies test solutions\n\n   \"Mavenir commends DZS for its expertise and leadership in bringing\ncutting-edge fronthaul transport technology to this highly successful O-RAN\nALLIANCE Plugfest validating the open fronthaul use case for 5G and 4G\nsolutions,\" said B.G. Kumar, President of the Communications Services\nBusiness at Mavenir. \"O-RAN and virtualization continues to gain momentum\nin Europe. As service providers look to cost effectively deliver advanced\nand differentiated services in their highly competitive markets, Mavenir\nand DZS will work together to enable carriers across the globe to move\nforward with this technology.\"\n\n   With a forward-looking business strategy centered on empowering service\nproviders and network operators through open standards, software-driven\nsystems and freedom of choice, DZS solutions are at the core of\ngroundbreaking, wide-scale open ecosystems like Rakuten Mobile's fully\nvirtualized, cloud-native O-RAN 5G mobile network and playing key roles in\nother parallel O-RAN ALLIANCE PlugFest activities in Asia (click here for\nmore information). The DZS commitment to the O-RAN architectural model is\nbut one example of how DZS is enabling service providers worldwide to enjoy\nthe cost, manageability and service benefits of flexible, scalable and\ninteroperable wireless and wireline broadband networks with no vendor\nlock-in.\n\n   To learn more, visit <a href=\"https://dzsi.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://dzsi.com</a>.\n\n   About DZS\nDZS Inc. (NSDQ: DZSI) is a global leader in broadband connectivity\nplatforms and communications software solutions with more than 20 million\nproducts in service with customers and alliance partners spanning more than\n100 countries.\n\n   DZS, the DZS logo, and all DZS product names are trademarks of DZS Inc.\nOther brand and product names are trademarks of their respective holders.\nSpecifications, products, and/or product names are all subject to change.\n\n   This press release contains forward-looking statements regarding future\nevents and our future results that are subject to the safe harbors created\nunder the Private Securities Litigation Reform Act of 1995. These\nstatements reflect the beliefs and assumptions of the Company's management\nas of the date hereof. Words such as \"anticipate,\" \"believe,\" \"continue,\"\n\"could,\" \"estimate,\" \"expect,\" \"forecast,\" \"goal,\" \"intend,\" \"may,\" \"plan,\"\n\"project,\" \"seek,\" \"should,\" \"target,\" \"will,\" \"would,\" variations of such\nwords, and similar expressions are intended to identify forward-looking\nstatements. Readers are cautioned that these forward-looking statements are\nonly predictions and are subject to risks, uncertainties and assumptions\nthat are difficult to predict. The Company's actual results could differ\nmaterially and adversely from those expressed in or contemplated by the\nforward-looking statements. Factors that could cause actual results to\ndiffer include, but are not limited to, those risk factors contained in the\nCompany's SEC filings available at www.sec.gov, including without\nlimitation, the Company's annual report on Form 10-K, quarterly reports on\nForm 10-Q and subsequent filings. In addition, additional or unforeseen\naffects from the COVID-19 pandemic and the global economic climate may give\nrise to or amplify many of these risks. Readers are cautioned not to place\nundue reliance on any forward-looking statements, which speak only as of\nthe date on which they are made. DZS undertakes no obligation to update or\nrevise any forward-looking statements for any reason.\n\n   For further information see: www.DZSi.com.\nDZS on Twitter: <a href=\"https://twitter.com/dzs_innovation\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/dzs_innovation</a>\nDZS on LinkedIn: <a href=\"https://www.linkedin.com/company/DZSi\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.linkedin.com/company/DZSi</a>/\n\n   About Mavenir\n\n   Mavenir is building the future of networks and pioneering advanced\ntechnology, focusing on the vision of a single, software-based automated\nnetwork that runs on any cloud. As the industry's only end-to-end,\ncloud-native network software provider, Mavenir is focused on transforming\nthe way the world connects, accelerating software network transformation\nfor 250+ Communications Service Providers in over 120 countries, which\nserve more than 50% of the world's subscribers.\n\nMcKenzie Hurst, Thatcher+Co.\nMobile: +1 408.888.6787\nEmail: mhurst@thatcherandco.com\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2135500897.MNPRE2135502090-12312820211222</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}