{"date": "2021-11-24 08:00:05+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Michael Kahn</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">PRAGUE, Nov 24 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Hollywood flocked to central Europe during the pandemic when film producers there were allowed to keep the cameras rolling, making the region an irresistible draw for streaming giants captivated by castles and tax breaks. </p><p>Now, though, some production companies may have bitten off more than they can chew as the region, one of the world's biggest hubs, has enjoyed a <a href=\"https://www.reuters.com/lifestyle/hollywood-investments-boom-central-europe-despite-pandemic-2021-09-06\" data-type=\"url\" class=\"tr-link\" translate=\"no\">record leap</a> in new U.S. movie and television business to about $1 billion this year.</p><p>They, like many peers globally, are struggling to find enough qualified staff to keep pace with the huge appetite of clients like Netflix <a href=\"reuters://REALTIME/Verb=FullQuote/ric=NFLX.O\" data-type=\"ric\" data-ric=\"NFLX.O\" translate=\"no\" dir=\"ltr\">NFLX.O</a>, Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>and Apple <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a> vying with each other to deliver new content and feed consumer demand turbo-charged by lockdowns around the world.</p><p>Even Hungary's state-of-the-art Korda Studios, a giant of the sector with one of the world's biggest sound stage, told Reuters is was focusing on fewer shows and movies to maintain quality. And it has had to come up with imaginative ways to do more with less.</p><p>\"Set directors and designers have to be smarter about shooting angles,\" said Chief Executive Gyorgy Rajnai. \"Now we build a house with three sides instead of four. We save on resources, time and people.\"</p><p>Korda is also importing camera and set-construction crews from countries like Slovakia, Romania, Croatia, he said. </p><p>Other production companies are hiring less experienced staff and in some cases turning down new work altogether, according to interviews with several industry executives and workers. </p><p>\"Either we can pick up the crew or we say no to the project. It is green light or red light,\" Rajnai added. \"It is the bottleneck in the industry.\"</p><p>The challenges in the region, which has recently hosted the likes of sci-fi movie epic Dune and Amazon fantasy series The Wheel of Time, reflect a shortage of skilled production workers across the world, from Hollywood to Queensland.</p><p>Jonathan Olsberg, executive chairman of London-based film industry consultancy Olsberg SPI, expects global production spend on feature films, television series and documentaries to race back to the pre-pandemic level of $177 billion in 2022. </p><p>\"This is a fundamental global problem and we will be experiencing these shortages for years to come,\" he said.  </p><p>Central Europe has also long had skills shortages across many industries. A tight labour market - the Czech rate of 2.8% ranks as the lowest in Europe, for example - makes it difficult for some companies to find workers and specialisms.</p><p>Pavlina Zipkova, head of the Czech Film Commission said the skills shortage in the country's film production industry was acute, though there are no specific estimates.</p><p>\"There is pressure on national film commissions and film institutions as well as on local studios and film production companies,\" Zipkova told Reuters.</p><p>Netflix, Amazon and Apple declined to comment on production staff shortages in the region and the possible consequences.</p><p><br/></p><p>WANT TO WORK IN FILMS?</p><p>Experienced crews, lower labour costs and generous tax incentives have attracted film makers to the Czech Republic and Hungary over the past decade. The region now ranks as the biggest international film production hub in Europe after Britain, with its landscape of rolling countryside and castles ideal for historical and fantasy shows.</p><p>This year, investments in filming projects in Hungary and the Czech Republic are on course to surpass the record 2019 figures of about $405 million and $512 million) respectively, according to national industry officials.</p><p>One problem facing smaller production companies is that giant projects, like the $200 million Netflix action thriller film Gray Man that recently wrapped up in Prague, suck up a lot of the local talent, according to the people inside the industry.</p><p>As a result, they are vying for a limited pool of expertise.        </p><p>At Prague-based Dazzle Pictures, whose credits include work for international films and content for the likes of Netflix and Amazon, managing director Geoffrey Case said the post-production studio receives offers daily from potential clients around the world seeking help in finishing films and TV shows.</p><p>This has created a situation where the amount of work on offer far outstrips what some companies can handle, especially as they fend off rivals looking to add employees, he added.</p><p>\"Most of the artists at our company have been approached by competing companies,\" said Case, whose team focuses on high-end visual effects.</p><p>\"They are getting offers all the time. In the old days there was respect from competitors. You didn't just try to poach people. But it is constant now because people are desperate.\"</p><p>Vojta Ruzicka, who has worked for nearly 20 years as a logistics specialist on productions in Prague including Mission Impossible 4 and Captain America: The Winter Soldier, said this has also created opportunity for people looking to break into the industry or take a faster step up the ladder.</p><p>\"If people keep their eyes open and want to work in the film industry, now is a pretty good time,\" he said.</p><p>($1 = 22.2460 Czech crowns; $1 = 321.3100 forints)</p><p><br/></p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Michael Kahn; Additional reporting by Robert Mueller; Editing by Mark John and Pravin Char)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:michael.kahn@thomsonreuters.com\" data-type=\"email\" translate=\"no\">michael.kahn@thomsonreuters.com</a> ; +420 234 721 612; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://michael.kahn.thomsonreuters.com@reuters.net\">michael.kahn.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: EASTEUROPE-FILM/WORKERS (TV, PIX)</p></div>"}