{"date": "2022-01-20 00:12:50.843000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span><span><span>UPDATE:</span> The Oscar Mayer bologna masks are sold out for now on Amazon but could be restocked. </span> </span><span><span>\"Due to unexpected incredibly high demand, we are working to get the sheet masks back in stock over the coming days,\" Kraft Heinz said in a statement to USA TODAY. </span> </span><span><span>The masks were also listed as Amazon's \"#1 new release\"  in beauty and personal care Wednesday.</span> </span> </p><p>Ever turned a slice of bologna into a face mask with bites taken out of it for eyes and a mouth?</p></div><div class=\"tr-npp-body\"><p>Oscar Mayer said it's paying homage to the classic childhood tradition with a new skin care product inspired by the lunch meat.</p><p>The Kraft Heinz brand partnered with Seoul Mamas, a Korean beauty and skin care company, to create the face sheets, which are described as \"a hydrating and restoring hydrogel that promote skin elasticity, improve hydration and moisture retention.\"</p><p>The limited-edition masks that resemble bologna go on sale Wednesday at Amazon.com for $5 each and will be available while supplies last.</p><p><span><span>►Amazon deals:</span> Updated daily: Here are the 10 best Amazon deals today in January 2022</span> </p><p><span><span>►Free COVID tests:</span> Government's at-home COVID test website launches early. How to order free testing kits</span> </p><p>\"Oscar Mayer has a legacy bringing levity to things that have gotten too serious, and beauty is a ripe territory to playfully subvert,\" Lindsey Ressler, a senior marketing analyst at the brand, said in a statement.</p><p>But these masks with Witch Hazel Botanical and seaweed-derived ingredients are not edible and come with a warning to \"not eat\" them because \"that's what bologna slices are for.\"</p><p>\"Our bologna has a nickname and it's B-E-A-U-T-Y,\" the Amazon product listing says, a throwback to the popular Oscar Mayer jingle, \"My Baloney Has a First Name\" from the 1970s, which spells out O-S-C-A-R. \"No, this sheet mask is not real bologna. Put it on your face, not your sandwich.\"</p><p>The mask packaging looks similar to a pack of Oscar Mayer bologna complete with the Wienermobile, which was added to packages last year as part of the \"Keep It Oscar\" rebranding and transformation campaign.</p><p>According to the directions, after cleansing your face, apply the mask and relax for 10 to 20 minutes. The mask should then be removed.</p><p><span><span>►New Oreo flavor:</span> Chocolate Confetti Cake Cookie to be released for brand's 110th birthday</span> </p><p><span><span>►Save better, spend better:  </span> Money tips and advice delivered right to your inbox. Sign up here</span> </p><p><span><span>Follow USA TODAY reporter Kelly Tyko on Twitter:  <a href=\"https://twitter.com/KellyTyko\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@KellyTyko.</a> </span>   <span>For shopping news, tips and deals, join us on our Shopping Ninjas Facebook group. </span> </span> </p><p><span>This article originally appeared on USA TODAY: Oscar Mayer sells out of bologna-inspired face masks on Amazon, plans to restock</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}