{"date": "2022-01-12 10:32:31.902000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>India</p></div><div class=\"tr-npp-lead\"><p>India, Jan. 12 -- As Omicron cases surge across India, a lot of discussion in the media has been about Covid-19 rapid antigen self test kit and need to invest in one. While RT-PCR is considered the gold standard for Covid-19 testing, the need for antigen tests arose as infections surged across the country.</p><p>A report in Hindustan Times quoted ICMR and said that all those who test positive after using this self test kit do not require additional testing as this self-testing will be considered as true positive. Those who test negative may opt for RT-PCR testing.</p></div><div class=\"tr-npp-body\"><p>Now get yourself tested in the comfort of your home. Some of these kits are safe for use even for children as young as two years. All these kits work via their respective company apps.Such self kits are available online on various online e-commerce platforms like Amazon. If you are keen on buying one, ou curated list should help you decide better.</p><p>1) Mylab CoviSelf - COVID-19 Rapid Antigen Self Test Kit</p><p>This kit can be used by individuals who are 18 or above. It can also be used for children as young as two years, with an adult collecting the sample for them. This product will have minimum six months' expiry at the time of order dispatch. This is a single use kit.</p><p>2) Panbio - Covid-19 Antigen Self-Test Kit</p><p>This antigen self-test kit is a single-use kit that uses a human nasal swab specimen for the detection of Covid. It determines whether you have an active Covid-19 infection and gives test results in 15 minutes. This kit is safe for use by pregnant women too.</p><p>3) Covifind Covid-19 Rapid Antigen and Covid Test Kit- ICMR Approved for Home Use</p><p>This kit allows you to check Covid infection from the comfort of your home. It is safe for use for children as young as two years old. This kit too gives the result in 15 minutes. For it to show result, you have to take nasal swab from 2-4 cm inside the nose. It is a less invasive test kit. Like others, this too works via the company app.</p><p>4) ABFIND India's First Post Vaccination Neutralizing Antibody Test</p><p>This antigen self test kit shows results in 20 minutes. It is less invasive and comes with a user friendly lancet. It also checks your immune status post vaccination and the due date for booster dose of vaccine.</p><p>At Hindustan Times, we help you stay up-to-date with latest trends and products. Hindustan Times has affiliate partnership, so we may get a part of the revenue when you make a purchase. Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}