{"date": "2022-02-23 12:04:40+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-story-p1\"><span class=\"tr-dateline\">BRUSSELS, Feb 23 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, Microsoft <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MSFT.O\" data-type=\"ric\" data-ric=\"MSFT.O\" translate=\"no\" dir=\"ltr\">MSFT.O</a>, other cloud services providers and data processing service providers will have to adopt safeguards to prevent non-EU governments gain illegal access to EU data, according to European Commission draft rules.</p><p>The Data Act, published on Wednesday, lays out rights and obligations on the use of data from consumers and companies in the 27-country European Union in smart gadgets and machinery as well as consumer goods, confirming a Reuters story. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2UE1RN\" data-type=\"storyId\" data-story-id=\"nL1N2UE1RN\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>It is part of a series of rules aimed at curbing the power of U.S. tech giants and help the EU achieve its digital and green objectives.</p><p>\"We want to give consumers and companies even more control  over what can be done with their data, clarifying who can access  data and on what terms,\" the Commission's digital chief Margrethe Vestager said in a statement. </p><p>EU concerns about data transfers have grown since former U.S. intelligence contractor Edward Snowden in 2013 revealed  mass U.S. surveillance.</p><p>This led Europe's top court to outlaw a transatlantic data transfer pact known as the Privacy Shield which thousands of companies depended on for services ranging from cloud infrastructure to payroll and finance.</p><p>The United States and the EU have since then been struggling to find a new data agreement. The EU executive said the new rules will free up a huge volume of data for use and expected to add 270 billion euros of additional gross domestic product by 2028.</p><p>The Data Act also imposes contractual requirements and interoperability standards on cloud and edge services to make it easier for companies to switch to a rival and data to be used between sectors. </p><p>Users of connected devices will be able to access data generated by them, which typically is only accessible to the device makers, and share it with other companies providing  aftermarket or other data-driven innovative services.</p><p>Companies will be obliged to provide certain data to governments during public emergencies such as floods or wildfires.</p><p>The Data Act will need to be thrashed out with EU governments and lawmakers before it can become law.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Foo Yun Chee, editing by Ingrid Melander)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:foo.yunchee@thomsonreuters.com\" data-type=\"email\" translate=\"no\">foo.yunchee@thomsonreuters.com</a> ; +32 2 287 6844; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://foo.yunchee.thomsonreuters.com@reuters.net\">foo.yunchee.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: EU-TECH/DATAACT (URGENT)</p></div>"}