{"date": "2021-12-13 14:43:53+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n                  <div>\n                    <ul class=\"bulleted-list arrowlist\">\n                      <li>\n                        <span>Marisa Banigan</span>\n                      </li>\n                      <li>\n                        <span>December 13, 2021</span>\n                      </li>\n                    </ul>\n                  </div>\n                  <div>\n                    <p>\n                      <span>At</span>\n                      <span>\n                        <a href=\"https://reinvent.awsevents.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">re:Invent 2021</a>\n                      </span>\n                      <span>, Apptio hosted the speaking session \"</span>\n                      <span>\n                        <a href=\"https://virtual.reinvent.awsevents.com/login/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Developing Your FinOps Practice to Make the Most of Your AWS Cloud Spend.\"</a>\n                      </span>\n                      <span>Jennifer Hays, FinOps Foundation Governance Board co-chair; and Ashley Hromatko, director of cloud FinOps, infrastructure and operations at Pearson; joined Apptio vice president of product and engineering, Eugene Khvostov, to discuss cloud financial management principles and share best practices for building and maturing a FinOps team.</span>\n                    </p>\n                    <p>\n            As cloud adoption increases, so does its impact on organizational budgets. For most organizations, cloud usage and spend will only continue to grow-AWS CEO Adam Selipsky noted in his <a href=\"https://reinvent.awsevents.com/keynotes/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">re:Invent 2021 keynote</a> that with only 5-10% of IT already moved to the cloud, there is still a massive cloud adoption wave to come.\n          </p>\n                    <p>\n            During \"Developing Your FinOps Practice to Make the Most of Your AWS Cloud Spend,\" Hays said that now is the time to build your financial and resource management muscle. \"During economic uncertainty, managing costs and, if necessary, drastically reducing costs is vital to gain a competitive edge,\" she said.\n          </p>\n                    <p>\n            The cloud allows companies to leverage new technologies far faster than if they had to own it themselves and build it from scratch, but the cloud realities are complicated:\n          </p>\n                    <ul class=\"bulleted-list arrowlist\">\n                      <li>\n                        <strong>Decentralized cloud purchases break down traditional procurement silos.</strong> Every developer can procure IT-and commit company funds. That's frightening to finance and procurement organizations that rely on centralized processes to control and manage budgets.\n            </li>\n                      <li>\n                        <strong>Cloud spend is variable-by the month, day, and minute.</strong> Hundreds of thousands of stock-keeping units (SKUs) are overwhelming, complex, and unpredictable-throwing traditional forecasting approaches on the scrap heap.\n            </li>\n                      <li>\n                        <strong>Unconstrained resources lead to inefficiency.</strong> Organizations must make a conscious decision to wage war on waste. Scaling on demand provides organizations with levers to control spend-cloud practitioners are obliged to pull them.\n            </li>\n                    </ul>\n                    <p>\n            The lightness of the cloud oversight weighs heavily on executives, finance groups, and IT organizations. Cultural practices, proper tooling and FinOps, the cloud financial management discipline, are the answers. FinOps is the new operating model to address cloud complications by driving efficiency and using transparency and near-real-time data to improve product and service value.\n          </p>\n                    <p>\n            FinOps pushes small steps, quick iterations, and continual momentum to mature cloud financial management. There are three phases of the FinOps lifecycle:\n          </p>\n                    <ul class=\"bulleted-list arrowlist\">\n                      <li>\n                        <strong>Inform:</strong> Start your journey by understanding your cloud spend. Structure your accounts, tagging, and costs to show teams what they are spending and set value expectations.\n            </li>\n                      <li>\n                        <strong>Optimize:</strong> Align costs to something meaningful for your organization. Empower finance and IT teams to identify-and measure-optimization opportunities.\n            </li>\n                      <li>\n                        <strong>Operate:</strong> Action optimization opportunities and measure the outcomes. Continuous implementation of policies and processes ensures proper controls.\n            </li>\n                    </ul>\n                    <p>\n            The FinOps mantra is crawl, walk, and run. Start simple, start small; mature and expand. The key to success is just starting.\n          </p>\n                    <h4>\n            Six principles of FinOps success\n          </h4>\n                    <p>\n            Hays said cloud optimization is a cultural shift that touches many roles and practices. \"We are taking centralized activities and decentralizing them, taking controlled activities and making them variable, taking limited on-premises access and giving cloud practitioners almost limitless product and service access,\" she said.\n          </p>\n                    <p>\n            Hays outlined six principles that lay the foundation for successful collaboration to help you achieve your objectives:\n          </p>\n                    <h4>\n            1. Incentivize common cause\n          </h4>\n                    <p>\n            FinOps is about cultural change and breaking down the silos between teams that historically haven't worked together. To be effective, your FinOps practice needs to promote collaborative, productive conversations and actions. Understanding concerns and requirements allow you to set common goals that the team can work together to attain-and prioritize.\n          </p>\n                    <p>\n            FinOps brings together technology, finance, and business leadership teams, so make sure this is reflected in your taxonomies and organizational structure. Involve people from all three teams when you're figuring out your systems for tagging and account structures. The goal should be to have your linked accounts and tags work together to fit technology's team splits, finance's accounting divides, and leadership's organization charts.\n          </p>\n                    <h4>\n            2. Business value drives cloud decisions\n          </h4>\n                    <p>\n            FinOps should always consider the business value of the cloud with the goal of making completely informed decisions. The purpose of IT services is to deliver business value. The business context is important when making decisions that could impact performance, cost, or speed.\n          </p>\n                    <p>\n            For example, refactoring an application for ECS or Lambda may require a substantial investment of developer time and increase rates over simple EC2 compute. But if doing so increases the speed and stability of your applications enough to increase customer use and retention without substantially increasing your per customer charges, then there's a clear business value to the increased cloud spend.\n          </p>\n                    <h4>\n            3. Everyone takes ownership of their cloud usage\n          </h4>\n                    <p>\n            If you're responsible for cloud usage, then you're responsible for cloud costs. Accountability should be spread to the edges of your organization, all the way to individual engineers and their teams. With decentralized procurement and management of IT, everyone must take ownership of cloud usage and its costs. For many engineers and product owners, this will be a new responsibility.\n          </p>\n                    <p>\n            To avoid runaway costs and overgrown infrastructure, make sure everyone who uses the cloud fully owns their usage-for good or bad. If a team leaves an error that causes a massive spike in EC2 usage, they need to be responsible for that cost. Likewise, if a team finds a way to lower their spend by 30 percent with the same performance by switching instances, they need to be lauded, even if it's just by letting them keep that budget for trying something new.\n          </p>\n                    <h4>\n            4. FinOps should be accessible and timely\n          </h4>\n                    <p>\n            Your teams need to be able to quickly see data as soon as possible so they can make real-time decisions about their cloud usage and spend-instead of waiting until weeks after the fact. Transparency of data usage and costs in the cloud is one of its most significant advantages, but only if you get it into the hands of the people and processes that need to make decisions.\n          </p>\n                    <p>\n            Cost savings measures can be as simple as spending anomaly detection. An update might remove the command to spin down unused EC2 instances, resulting in a massive spike of usage as they're constantly spun up and never turned off. If you catch this within 24 hours, the spending spike will be minimal, but if more m5s are spun up every day and left on, you're looking at a spike that will burn through your reservations and cause massive charges at on-demand rates.\n          </p>\n                    <h4>\n            5. A centralized team drives FinOps\n          </h4>\n                    <p>\n            A central FinOps team drives best practices through standardization, education, and cheerleading. That same team can centralize rate optimizations to take full advantage of them while empowering the rest of the team to maximize usage optimization. There are many practices that will require centralization to achieve. Create a centralized team to act on the benefit of the organization.\n          </p>\n                    <p>\n            AWS is set up to maximize the use of cost optimization tools like Reserved Instances and Savings Plans across an entire consolidated account. Additionally, many organizations with larger usage can work with AWS to develop custom discounts and rates. These kind of cost optimizations are best done on an organization-wide level, and a centralized FinOps team is best equipped to maximize them.\n          </p>\n                    <h4>\n            6. Take advantage of the variable cost model of cloud\n          </h4>\n                    <p>\n            Instead of basing capacity purchases off possible future demand, base your rightsizing, volume discounts, and RI/CUD purchases off your actual usage data. The emphasis becomes making the most out of the services and resources you're currently using scale up and scale down-remove resources when they are no longer needed.\n          </p>\n                    <p>\n            Base all decisions on actual usage. With on-prem, financial management decisions were based on static predictions and then optimizing consumption with current investments of resources and hardware. AWS and the cloud throw that out the window. Teams can constantly vary the size of their infrastructure to fit their needs, fueling innovation and brining releases to market faster.\n          </p>\n                    <h4>\n            Lessons from Pearson's cloud journey\n          </h4>\n                    <p>\n            Pearson wanted to end the challenges of running its data centers (e.g., capacity limits, high procurement costs, fragile services, etc.) and leverage the cloud to support customer experience-centered application teams and introduce DevOps. \"The FinOps practice at Pearson has achieved many financial and intangible goals in just three years,\" said Hromatko. \"The key to our success was knowing we wouldn't get there overnight-it had to be incremental.\"\n          </p>\n                    <p>\n            Like many organizations newly adopting the cloud, Pearson lived a good news/bad news experience. Resource provisioning just needed a credit card (good), but finance lacked insight into total spend and could not tamp down demand (bad).\n          </p>\n                    <p>\n            Pearson piloted two different solutions to solve its cloud spend problem. A cost optimization program went straight to the \"operate\" phase in FinOps-eliminating waste, acting on reservation recommendations, and looking at costs top down. \"In another part of the organization, I took the lead to build a FinOps practice,\" said Hromatko. \"We started at the 'inform' phase and focused on education, granular chargeback, and creating guardrails around spend (e.g., budget alerts, governance policies, etc.).\"\n          </p>\n                    <p>\n            Both solutions were successful financially; however, the cost optimization program was a prescription that didn't target the root problem. \"We needed a culture shift around cloud cost management from the edge to executives, and we knew this was not a one-and-done thing,\" said Hromatko. With the support of the Apptio VP of infrastructure and operations, Pearson began building a formal global FinOps function that would sit under the CIO but have a strong alignment to finance.\n          </p>\n                    <p>\n            A FinOps practice makes the most of the cloud spend, but both Hays and Hromatko agreed that it's not the role of FinOps to say whether money should be spent on IT. \"It's our responsibility to drive meaningful discussions about value, opportunity, and options,\" said Hays. \"We are simply asking the question: 'Are you getting the most of every dollar you are spending on the cloud?'\"\n          </p>\n                  </div>\n                </div>\n                <div>\n                  <div>\n          Article Contents\n        </div>\n                  <div>\n                    <h4>\n            Categories\n          </h4>\n                  </div>\n                  <div>\n                    <ul class=\"bulleted-list arrowlist\">\n                      <li>\n                        <span>\n                          <a href=\"https://www.apptio.com/blog/?fwp_blog_categories=cloud\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Cloud</a>\n                        </span>\n                      </li>\n                    </ul>\n                  </div>\n                  <div>\n                    <h4>\n            Tags\n          </h4>\n                  </div>\n                  <div>\n                    <ul class=\"bulleted-list arrowlist\">\n                      <li>\n                        <span>\n                          <a href=\"https://www.apptio.com/blog/?fwp_blog_tags=aws\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS</a>, <a href=\"https://www.apptio.com/blog/?fwp_blog_tags=cloud-cost-management\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Cloud Cost Management</a></span>\n                      </li>\n                    </ul>\n                  </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.apptio.com/cloudability-free-trial-request/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Start a Free Trial</a>\n                    </span>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.apptio.com/blog/reinvent-2021-finops-optimizes-aws-spend/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Apptio Inc.</strong> published this content on <strong>13 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>13 December 2021 14:43:53 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Apptio Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Apptio-Inc.</p></div>"}