{"date": "2021-11-29 13:30:00.519000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\" style=\"font-weight:normal\">\n<b>cbdMD Announces Exclusive Multi-Year Partnership With Amazon Platform Partner Amify</b>\n</p><p>\ncbdMD, Inc. (NYSE American: YCBD, YCBDpA), one of the leading, most highly trusted and best recognized CBD companies, today announced their multi-year exclusive agreement with Amify, an Amazon.com, Inc. (NASDAQ:AMZN) platform partner, to prepare for the inclusion of CBD products within the Amazon marketplace. Amify, which specializes in Amazon go-to-market strategies, content creation and operational excellence, will act as cbdMD’s exclusive CBD partner to launch products on the Amazon platform as soon as the category is accepted and becomes available. This partnership includes all the leading and award-winning cbdMD branded products, including cbdMD’s gummies, tinctures, gelcaps and topicals, as well as the award-winning Paw CBD animal brand. In addition, the new line of skin care and beauty products under the brand cbdMD Botanicals will also be available.\n</p><p>\nInterest in CBD becoming more readily available has grown exponentially since the passage of the Farm Bill in 2018, and cbdMD believes Amazon is expected to become a major platform to distribute CBD products. To prepare for the category inclusion, cbdMD has worked with Amify to create seller central accounts, build product pages and other essential components of cbdMD’s Amazon store and established Amazon launch strategies in order to fully utilize the Amazon platform. Aside from assisting brands in effective brand and product marketing with their award-winning advertising and content, Amify also works to manage storefronts, oversee the inventory and demand planning and handle customer service and returns with an expert in-house team. Amify refers to its unique approach as being a provider of “Amazon-as-a-Service.” The company is responsible for creating, developing and executing effective customized Amazon strategies that align with broader sales and ecommerce goals. With this exclusive partnership, cbdMD is poised to fully integrate their digital marketing, content curation and product innovation with the world’s largest online retailer.\n</p><p>\n“As an industry, this is the moment we’ve all been waiting for, and we believe we are close. When a global retailer like Amazon is ready to accept your products, you get your strategy prepared and perfected so you’re ready to go to market as soon as possible. That’s exactly what this partnership represents. We are already one of the largest online CBD businesses in America, and this distribution channel will play into our strength. We are excited to be at the forefront of this category inclusion and we’re taking all the necessary steps to properly prepare for launch. Whenever that launch is, we’ll be ready,” said Chairman &amp; Co-CEO Martin Sumichrast.\n</p><p>\n<b>About Amify</b>\n</p><p>\nAmify delivers turnkey, award-winning services to help brands launch, manage and continually optimize their Amazon channel strategy. As the first Amazon-as-a-Service provider, we serve as an outsourced Amazon team, which helps companies own their brand on the world’s largest ecommerce platform by leveraging cross channel data to increase sales and improve customer experience. The Amify team brings vast expertise to sellers, from branding and advertising to data analytics and business operations. From our high-performing, beautiful storefronts, to our optimized forecasting and logistics, we’re an embedded extension of our client’s team, whose mission is to make it painless for clients to win on Amazon. Visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fgoamify.com%2F&amp;esheet=52540883&amp;newsitemid=20211129005376&amp;lan=en-US&amp;anchor=GoAmify.com&amp;index=1&amp;md5=482e0fd8e73c526f5d33345e18b89c3e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">GoAmify.com</a> to learn more about their full-service offerings.\n</p><p>\n<b>About cbdMD, Inc.</b>\n</p><p>\ncbdMD, Inc. is one of the leading and most highly trusted and recognized cannabidiol (CBD) brands with a comprehensive line of U.S.-produced, THC-free<sup>1</sup> CBD products. Our cbdMD brand currently includes over 130 SKUs of high-grade, premium CBD products, including CBD tinctures, CBD gummies, CBD topicals, CBD capsules, CBD bath bombs, CBD bath salts, CBD sleep aids and CBD drink mixes. Our Paw CBD brand of pet products includes over 45 SKUs of veterinarian-formulated products, including tinctures, chews, topicals products in varying strengths, and our cbdMD Botanicals brand of beauty and skin care products features 15 SKUs, including facial oil and serum, toners, moisturizers, clear skin, facial masks, exfoliants and body care. The company also offers a line of full spectrum products (approximately 10 SKUs) under its cbdMD brand. To learn more about cbdMD and their comprehensive line of U.S.-grown, THC-free<sup>1</sup> CBD oil products, please visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.cbdmd.com&amp;esheet=52540883&amp;newsitemid=20211129005376&amp;lan=en-US&amp;anchor=www.cbdmd.com&amp;index=2&amp;md5=e09511ca26362e5098509788ad4914ad\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.cbdmd.com</a>, follow cbdMD on Instagram and Facebook or visit one of the 6,000 retail outlets that carry cbdMD products.\n</p><p>\n<b>Forward-Looking Statements</b>\n</p><p>\nThis press release contains certain forward-looking statements that are based upon current expectations and involve certain risks and uncertainties within the meaning of the U.S. Private Securities Litigation Reform Act of 1995. Such forward-looking statements can be identified by the use of words such as ''should,'' ''may,'' ''intends,'' ''anticipates,'' ''believes,'' ''estimates,'' ''projects,'' ''forecasts,'' ''expects,'' ''plans'' and ''proposes.'' These forward-looking statements are not guarantees of future performance and are subject to risks, uncertainties, and other factors, some of which are beyond our control and difficult to predict and could cause actual results to differ materially from those expressed or forecasted in the forward-looking statements, including, without limitation, statements made with respect to the expansion of the consumer market for CBD products, our ability to increase our market share, the availability of the Amazon platform for our CBD products, our ability to expand our business and significantly increase our revenues, our ability to effectively leverage our brand partnerships and sponsorships, our ability to effectively compete in our market, our ability to achieve our net sales guidance, and our ability to report profitable operations in the future. You are urged to carefully review and consider any cautionary statements and other disclosures, including the statements made under the heading \"Risk Factors\" in cbdMD, Inc.'s Annual Report on Form 10-K for the fiscal year ended September 30, 2020 as filed with the Securities and Exchange Commission (the \"SEC\") and our other filings with the SEC. All forward-looking statements involve significant risks and uncertainties that could cause actual results to differ materially from those in the forward-looking statements, many of which are generally outside the control of cbdMD, Inc. and are difficult to predict. cbdMD, Inc. does not undertake any duty to update any forward-looking statements except as may be required by law. The information which appears on our websites and our social media platforms, including, but not limited to, Instagram and Facebook, is not part of this press release.\n</p><p>\n<sup>1</sup>THC-free is defined as below the level of detection using validated scientific methods.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211129005376r1&amp;sid=ny6r1&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTI5MDA1Mzc2cjEmc2lkPW55NnIxJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=905324b6a94db025c77627a28ab9fd9707820cc662536d27537b6e45dd81a8a9fd8c1566d8b9d3319f4f406aff31dbc26be68e86b4573516cf97f10e6b6bdf9d\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211129005376/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211129005376/en/</a></span></p><p>\n<b>Public Relations:\n<br/></b>Robert Pettway\n<br/>Director of Public Relations\n<br/><a href=\"mailto:rpettway@cbdmd.com\" data-type=\"email\" translate=\"no\">rpettway@cbdmd.com</a><br/>(423) 503-5225\n</p><p>\n<b>Investor Relations: \n</b><br/>John Weston\n<br/>Director of Investor Relations\n<br/><a href=\"mailto:john.weston@cbdmd.com\" data-type=\"email\" translate=\"no\">john.weston@cbdmd.com</a><br/>(704) 249-9515\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NC-CBDMD-INC</p></div>"}