{"date": "2021-11-09 07:08:01+00:00", "ticker": "III", "mrkt_info": {"open": 1378.0, "close": 1365.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n                  <p>\n          9 November 2021\n        </p>\n                  <p>\n          Results for the six months to 30 September 2021\n        </p>\n                  <p>\n          A strong first half, driven by excellent performance from our resilient portfolio. On track to deliver increased FY22 dividend of 10.45 pence per share.\n        </p>\n                  <p>\n          Performance highlights\n        </p>\n                  <p>\n          £250m, 10.6%\n        </p>\n                  <p>\n                    <span>Total return</span>\n                    <span>Strong first half performance driving growth in</span>\n                  </p>\n                  <div class=\"story-table-container\"><table class=\"story-basic-table\">\n                    <tr>\n                      <td>\n                        <p>\n                291.2p\n              </p>\n                      </td>\n                      <td>\n                        <p>\n                net asset value ('NAV')\n              </p>\n                      </td>\n                      <td>\n                      </td>\n                    </tr>\n                    <tr>\n                      <td>\n                      </td>\n                      <td>\n                      </td>\n                    </tr>\n                    <tr>\n                      <td>\n                        <p>\n                NAV per share\n              </p>\n                      </td>\n                      <td>\n                      </td>\n                      <td>\n                      </td>\n                    </tr>\n                    <tr>\n                      <td>\n                      </td>\n                      <td>\n                      </td>\n                      <td>\n                      </td>\n                      <td>\n                      </td>\n                    </tr>\n                    <tr>\n                      <td>\n                      </td>\n                      <td>\n                      </td>\n                      <td>\n                      </td>\n                      <td>\n                      </td>\n                    </tr>\n                    <tr>\n                      <td>\n                      </td>\n                      <td>\n                      </td>\n                      <td>\n                      </td>\n                      <td>\n                      </td>\n                    </tr>\n                  </table></div>\n                </div>\n                <div>\n                  <div>\n                    <p>\n            £56m\n          </p>\n                    <p>\n            Total income and non -income cash\n          </p>\n                    <p>\n            £253m\n          </p>\n                    <p>\n            Cash balances\n          </p>\n                    <p>\n            5.225p\n          </p>\n                    <p>\n            Interim dividend per share\n          </p>\n                  </div>\n                  <div>\n                    <p>\n            Good level of income and non-income cash to support the dividend\n          </p>\n                    <p>\n            Well-funded to make new investments\n          </p>\n                    <p>\n            On track to deliver the FY22 dividend target, 6.6% higher than FY21\n          </p>\n                  </div>\n                </div>\n                <div>\n                  <p>\n          Richard Laing, Chair of 3i Infrastructure plc <span>(the 'Company')</span></p>\n                  <p>\n          \"It has been a strong first half performance from our resilient portfolio. We are well positioned for the second half and are on track to deliver our dividend target, 6.6% higher than last year.\"\n        </p>\n                  <p>\n          Performance\n        </p>\n                  <p>\n          The Company generated a total return of 10.6% on opening NAV for the first half of the year, substantially ahead of our target return of 8% to 10% per annum to be achieved over the medium term. The NAV per share increased to\n        </p>\n                  <p>\n          291.2 pence. The portfolio overall is performing ahead of expectations, both financially and operationally, with our Investment Manager driving value growth over the period through active asset management of the portfolio. We were pleased to complete the acquisition of DNS:NET, a leading independent telecommunications provider in Germany, during the period, further improving the diversification of the p ortfolio.\n        </p>\n                  <p>\n          1\n        </p>\n                </div>\n              </div>\n              <div>\n                <p>\n        The Company delivered a Total Shareholder Return ('TSR') of 4.2% in the period (FTSE 250: 8.4%). Since IPO, the\n      </p>\n                <p>\n        Company's annualised TSR is 12.4%, comparing favourably with the broader market (FTSE 250: 7.9% annualised over the same period). The Company has achieved this long-term outperformance with a low correlation to the broader equity market.\n      </p>\n                <p>\n        Interim dividend\n      </p>\n                <p>\n        The Board is announcing an interim dividend of 5.225 pence per share, scheduled to be paid on 10 January 2022 to holders of ordinary shares on the register on 26 November 2021. The ex-dividend date will be 25 November 2021. As an investment trust, the Company is permitted to designate dividends wholly or partly as interest distributions for UK tax purposes. The Board is designating 2.0 pence of the 5.225 pence interim dividend as an interest distribution.\n      </p>\n                <p>\n        Corporate governance\n      </p>\n                <p>\n        The Company's Annual General Meeting was held on 8 July 2021. All resolutions were approved by shareholders, including the re-election of the existing Directors to the Board. Robert Jennings stepped down from the Board on 16 July 2021 and we thank him for his contribution to the Company.\n      </p>\n                <p>\n        Richard Laing\n      </p>\n                <p>\n        Chair\n      </p>\n                <div class=\"story-table-container\"><table class=\"story-basic-table\">\n                  <tr>\n                    <td>\n                      <p>\n              For further information, please contact:\n            </p>\n                    </td>\n                    <td>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <p>\n              Thomas Fodor, investor enquiries\n            </p>\n                    </td>\n                    <td>\n                      <p>\n              Tel: 020 7975 3469\n            </p>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <p>\n              Kathryn van der Kroft, press enquiries\n            </p>\n                    </td>\n                    <td>\n                      <p>\n              Tel: 020 7975 3021\n            </p>\n                    </td>\n                  </tr>\n                </table></div>\n                <p>\n        Notes\n      </p>\n                <p>\n        This report contains Alternative Performance Measures ('APMs'), which are financial measures not defined in International Financial Reporting Standards ('IFRS'). These include Total return on opening NAV, NAV per share, Total income and non -income cash and Total portfolio return percentage. More information relating to APMs, including why we use them and the relevant definitions, can be found in the Financial review section and in the Company's Annual report and accounts 2021.\n      </p>\n                <p>\n        For further information regarding the announcement of the results for 3i Infrastructure plc, please visit <span>www.3i-infrastructure.com</span>. The analyst presentation will be made available on this website.\n      </p>\n                <p>\n        Notes to editors\n      </p>\n                <p>\n        3i Infrastructure plc is a Jersey-incorporated,closed-ended investment company, an approved UK Investment Trust, listed on the London Stock Exchange and regulated by the Jersey Financial Services Commission. The Company's purpose is to invest responsibly in infrastructure, delivering long-term sustainable returns to shareholders and having a positive impact on our portfolio companies and their stakeholders.\n      </p>\n                <p>\n        3i Investments plc, a wholly-owned subsidiary of 3i Group plc, is authorised and regulated in the UK by the Financial Conduct Authority and acts as Investment Manager to 3i Infrastructure plc.\n      </p>\n                <p>\n        This statement has been prepared solely to provide information to shareholders. It should not be relied on by any other party or for any other purpose. It and the Company's Half-yearly report may contain statements about the future, including certain statements about the future outlook for 3i Infrastructure plc. These are not guarantees of future performance and will not be updated. Although we believe our expectations are based on reasonable assumptions, any statements about the future outlook may be influenced by factors that could cause actual outcomes and results to be materially different.\n      </p>\n                <p>\n        This press release is not for distribution (directly or indirectly) in or to the United States, Canada, Australia or Japan and is not an offer of securities for sale in or into the United States, Canada, Australia or Japan or in any other jurisdiction. Securities may not be offered or sold in the United States absent registration under the U.S. Securities Act of 1933, as amended (the 'Securities Act'), or an exemption from registration under the Securities Act. Any public offering to be made in the United States will be made by means of a prospectus that may be obtained from the issuer or selling security holder and will contain detailed information about 3i Group plc, 3i Infrastructure plc, 3i India Infrastructure Fund and the Investment Manager, as applicable, as well as financial statements. No public offering in the United States is currently contemplated.\n      </p>\n                <p>\n        2\n      </p>\n              </div>\n              <div>\n                <p>\n        3i Infrastructure plc Half-yearly report 2021\n      </p>\n                <p>\n        Review from the Managing Partner\n      </p>\n                <p>\n        Portfolio review\n      </p>\n                <p>\n        The majority of our portfolio companies have met or exceeded the expectations we set at March 2021. The Company remains well-funded and we are progressing several potential investment opportunities across our target markets.\n      </p>\n                <p>\n        Oystercatcher had an excellent first half of the year, outperforming both expectations and prior year, with continued high levels of utilisation across the portfolio of five terminals. On 23 September 2021, we signed an agreement for the sale of Oystercatcher's 45% stakes in its four European terminals in Amsterdam, Terneuzen, Ghent and Malta, together with the 55% stakes held by Oiltanking GmbH, to Evos Finance B.V.. The transaction completed on 29 October 2021. The majority of the net proceeds from the sale were used to prepay all of Oystercatcher's debt. The balance of the net proceeds to Oystercatcher, €55 million, were distributed to the Company. <span>O</span>ystercatcher continues to own a 45% stake in Oiltanking Singapore Limited alongside its partner Oiltanking GmbH. Singapore represented more than half of the carrying value of Oystercatcher prior to the sale.\n      </p>\n                <p>\n        Infinis performed ahead of expectations in the period, primarily due to outperformance in its captured landfill methane business, higher UK power prices and the frequent power supply system imbalances in the UK that benefitted its Power Response assets. Infinis has taken advantage of this higher power price environment to hedge the majority of its expected generation for the next two years at attractive prices. However, our longer-term power price forecasts are now lower than those in the March valuation, reflecting higher expected growth in renewable power generation in the UK and lower projected long-term commodity prices. Infinis has made solid progress on its development pipeline during the period with a 4MW solar site at Winterton receiving planning consent and a further 152MW of solar and battery energy storage sites at the planning or pre-planning stages. In June, Ofgem published its Significant Code Review 'minded to' decision, bringing greater clarity to the regulatory outlook and likely to result in reduced grid connection costs for new developments.\n      </p>\n                <p>\n        Tampnet demonstrated continued resilience during the period. North Sea customers continued to upgrade their bandwidth requirements. Progress with digital pilot projects in partnership with Microsoft are also showing real promise, highlighting the opportunity for Tampnet to capitalise on a wave of expected investment in remote digital operations by its offshore clients. In the Gulf of Mexico, the business experienced some delays in installations, primarily due to Covid-19 and severe weather conditions which also impacted customer operations at times. Despite those disruptions, recent roaming data usage is at record levels and the contracted revenue pipeline is growing. Tampnet appointed a new CEO, Elie Hanna, who joined in September 2021 from Ericsson. We believe he will bring a structured approach at an opportune time, particularly in relation to taking the various digitalisation initiatives to market effectively.\n      </p>\n                <p>\n        For ESVAGT, the offshore wind market is gathering further momentum on the back of supportive government policies in both European countries and the USA. In parallel, the Service Operation Vessel ('SOV'), for which ESVAGT is market leader, is gaining acceptance as the preferred solution for offshore turbine maintenance due to the superior uptime results it underpins. ESVAGT is therefore ideally positioned to continue its growth in the offshore wind segment. During the period, ESVAGT successfully commenced operations with three new SOVs under long term charter with MHI Vestas, taking its operational wind SOV fleet to eight. ESVAGT also finalised its US SOV joint venture agreement with Crowley Maritime Corporation, the largest US Jones Act compliant operator, and has submitted its first US wind SOV bids through that joint venture. ESVAGT's Emergency Rescue and Response Vessel ('ERRV') fleet also achieved good results during the period. In particular, ESVAGT agreed an important contract with its largest ERRV customer, Total Energies, in Denmark, continuing as the preferred supplier on the Danish shelf. Fleet utilisation has also returned to pre-Covid levels, with contract rates strengthening accordingly. ESVAGT's strategy continues to focus on investment in new, contract-backed, wind SOV vessels to deliver growth, while managing its existing ERRV fleet to help fund that investment.\n      </p>\n                <p>\n        Ionisos performed strongly during the period, particularly in its pharmaceutical and testing segment. Ionisos is handling this increase in activity through optimising the product mix and taking steps to expand existing plants, which will also enable Ionisos to capture future growth in customer demand. The construction of a new sterilisation facility in Bautzen, Germany was completed in April in line with budget and one month ahead of schedule and a further site in Kleve, Germany is progressing towards completion in 2022. Further to the announcement in March 2021 that the facilities of Steril Milano, a subsidiary of Ionisos, had been closed, Steril Milano was placed into voluntary liquidation during the period. This was fully provided for in the March 2021 valuation of Ionisos. Steril Milano represented c.3% of Ionisos's 2020 EBITDA.\n      </p>\n                <p>\n        3\n      </p>\n              </div>\n              <div>\n                <p>\n        TCR performed strongly ahead of our expectations during the first half of the year as it continued to support its existing customers and realise cost efficiencies. This provides further evidence of the resilience of TCR's business model, even in the face of such a significant challenge to the air travel sector as Covid-19. During the period TCR successfully concluded new contracts, including strategic sale and lease back arrangements with Finnair in Helsinki and Gategroup across its European bases. European countries continued to roll out their vaccination programmes, which enabled a partial recovery of the air travel market over the summer months. We continue to see increased interest in TCR's full service rental model from customers that previously owned their own fleets of equipment.\n      </p>\n                <p>\n        Joulz outperformed in its core businesses of Infrastructure Services and Metering, with order intake for Infrastructure Services being especially strong. The solar energy business it acquired in April 2021 has seen sales of new solar rooftop installations grow ahead of expectations and the integration with the broader Joulz business has progressed well, although conversion of projects into operations has been slow in the period. Joulz's strategy to develop into a leading integrated energy transition solutions provider took a further step forward with the signing of a 'virtual grid' project for a large distribution centre development near Amsterdam. This project combines products from the Infrastructure Services, Metering and Solar business units and is underpinned by a long term contract. This is the first of an attractive pipeline of similar projects being developed by Joulz against a general background of grid congestion in the Netherlands.\n      </p>\n                <p>\n        The new investment in Berlin-based DNS:NET completed during the period and operationally has performed broadly in line with expectations. The current focus is on ramping up construction capacity and, during the period, DNS:NET signed a framework agreement with a key construction partner to deliver a substantial increase in the rate of homes being passed by the company's fibre network. Its sales pipeline is also growing and we are pleased to see continuing strong demand for DNS:NET's products on entering new areas.\n      </p>\n                <p>\n        Valorem had a good first half of the year, benefitting from better-than-forecast wind conditions and good turbine availability. It is progressing well with its construction activity, with a total of 90MW of wind and solar projects entering into operation during the period. Valorem continues to develop a large wind and solar pipeline, with its main focus being the development of Viiatti, a 300MW wind project in Finland expected to close in the first half of 2022. Its French and Greek pipelines continue to progress, although some French wind projects have experienced delays in the permitting process.\n      </p>\n                <p>\n        Attero performed well in the first half of the year. The waste supply volumes at its Energy from Waste ('EfW') plants were above last year and, by the end of the period, had recovered such that the business was able to run its EfW plants at full capacity without drawing on the company's waste buffer. Our valuation reflects a more conservative assumption for future net gate fee revenues based on recent market developments. The Organics business benefitted from favourable weather and new contract wins, which enabled it to fill the recent capacity expansion at the Wijster facility. The Minerals business is still seeing lower volumes than pre-Covid due to lower levels of construction activity, however gate fees for Minerals remain strong.\n      </p>\n                <p>\n        The availability-based Projects portfolio has performed in line with expectations. Further progress was made towards realising the remaining assets in the India Fund, with the completion of the sale of KMC Roads.\n      </p>\n                <p>\n        The portfolio is analysed below.\n      </p>\n                <div class=\"story-table-container\"><table class=\"story-basic-table\">\n                  <tr>\n                    <td>\n                      <p>\n              Portfolio - Breakdown by value\n            </p>\n                    </td>\n                    <td>\n                    </td>\n                    <td>\n                    </td>\n                    <td>\n                      <p>\n              Portfolio - Breakdown by country\n            </p>\n                    </td>\n                    <td>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <p>\n              at 30 September 2021\n            </p>\n                    </td>\n                    <td>\n                    </td>\n                    <td>\n                    </td>\n                    <td>\n                      <p>\n              at 30 September 2021\n            </p>\n                    </td>\n                    <td>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                    </td>\n                    <td>\n                    </td>\n                    <td>\n                    </td>\n                    <td>\n                    </td>\n                    <td>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <p>\n              Infinis\n            </p>\n                    </td>\n                    <td>\n                      <p>\n              14%\n            </p>\n                    </td>\n                    <td>\n                    </td>\n                    <td>\n                      <p>\n              Netherlands\n            </p>\n                    </td>\n                    <td>\n                      <p>\n              18%\n            </p>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <p>\n              TCR\n            </p>\n                    </td>\n                    <td>\n                      <p>\n              12%\n            </p>\n                    </td>\n                    <td>\n                    </td>\n                    <td>\n                      <p>\n              France\n            </p>\n                    </td>\n                    <td>\n                      <p>\n              16%\n            </p>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <p>\n              Oystercatcher\n            </p>\n                    </td>\n                    <td>\n                      <p>\n              12%\n            </p>\n                    </td>\n                    <td>\n                    </td>\n                    <td>\n                      <p>\n              UK\n            </p>\n                    </td>\n                    <td>\n                      <p>\n              14%\n            </p>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <p>\n              Tampnet\n            </p>\n                    </td>\n                    <td>\n                      <p>\n              11%\n            </p>\n                    </td>\n                    <td>\n                    </td>\n                    <td>\n                      <p>\n              Belgium\n            </p>\n                    </td>\n                    <td>\n                      <p>\n              12%\n            </p>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <p>\n              Joulz\n            </p>\n                    </td>\n                    <td>\n                      <p>\n              10%\n            </p>\n                    </td>\n                    <td>\n                    </td>\n                    <td>\n                      <p>\n              Luxembourg\n            </p>\n                    </td>\n                    <td>\n                      <p>\n              12%\n            </p>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <p>\n              ESVAGT\n            </p>\n                    </td>\n                    <td>\n                      <p>\n              10%\n            </p>\n                    </td>\n                    <td>\n                    </td>\n                    <td>\n                      <p>\n              Norway\n            </p>\n                    </td>\n                    <td>\n                      <p>\n              11%\n            </p>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <p>\n              Ionisos\n            </p>\n                    </td>\n                    <td>\n                      <p>\n              10%\n            </p>\n                    </td>\n                    <td>\n                    </td>\n                    <td>\n                      <p>\n              Denmark\n            </p>\n                    </td>\n                    <td>\n                      <p>\n              10%\n            </p>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <p>\n              DNS:NET\n            </p>\n                    </td>\n                    <td>\n                      <p>\n              7%\n            </p>\n                    </td>\n                    <td>\n                    </td>\n                    <td>\n                      <p>\n              Germany\n            </p>\n                    </td>\n                    <td>\n                      <p>\n              7%\n            </p>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <p>\n              Valorem\n            </p>\n                    </td>\n                    <td>\n                      <p>\n              5%\n            </p>\n                    </td>\n                    <td>\n                    </td>\n                    <td>\n                    </td>\n                    <td>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <p>\n              Attero\n            </p>\n                    </td>\n                    <td>\n                      <p>\n              5%\n            </p>\n                    </td>\n                    <td>\n                    </td>\n                    <td>\n                    </td>\n                    <td>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <p>\n              Projects\n            </p>\n                    </td>\n                    <td>\n                      <p>\n              4%\n            </p>\n                    </td>\n                    <td>\n                    </td>\n                    <td>\n                    </td>\n                    <td>\n                    </td>\n                  </tr>\n                </table></div>\n                <p>\n        4\n      </p>\n              </div>\n              <div>\n                <p>\n        Investment activity\n      </p>\n                <p>\n        In June, we completed the acquisition of a 60% stake in DNS:NET for £157 million. DNS:NET is a leading independent telecommunications provider in Germany.\n      </p>\n                <p>\n        During the period we invested £12 million in ESVAGT to fund further growth in the offshore wind segment, including the three new SOVs for MHI Vestas.\n      </p>\n                <p>\n        In April, Joulz completed the acquisition of rooftop solar developer Zonel Energy, a leading provider of solar rooftop solutions to businesses across the Netherlands, furthering Joulz's ambition to become the leading provider of integrated energy transition solutions in the Netherlands.\n      </p>\n                <p>\n        Sustainability\n      </p>\n                <p>\n        All our portfolio companies are implementing their sustainability strategies developed last year and are gathering greenhouse gas emissions data. We are also addressing other items identified in Environmental, Social and Governance assessments across the portfolio and progressing our sustainability-related objectives for FY22. The sustainability section of our Annual report and accounts 2022 will include a comprehensive review of our progress on sustainability, including emissions reporting for our portfolio companies.\n      </p>\n                <p>\n        We refinanced our existing £300 million revolving credit facility ('RCF') on 3 November 2021 with a £400 million sustainability-linked RCF, following the Loan Market Association's Sustainability Linked Loan Principles. The new facility includes stretching targets across Environmental, Social and Governance themes aligned with our purpose. Performance against these targets will adjust the margin for the subsequent year. The term of the new facility is three years, with two one-year extension options. It also contains a £200 million accordion feature, in line with the previous facility, and we are pleased with the support received from our lenders and the terms we achieved.\n      </p>\n                <p>\n        Outlook\n      </p>\n                <p>\n        Deal activity in the infrastructure sector has been high, reflecting resilient performance and significant available dry powder. The market is more competitive than ever.\n      </p>\n                <p>\n        Against that backdrop we remain focused on finding opportunities that enhance the portfolio and where we can add the most value. We are pursuing several potential new investments, including opportunities in the communications, transport and utilities sectors as well as further investments in our platform businesses.\n      </p>\n                <p>\n        Our investment in ESVAGT is subject to an ongoing strategic review and as part of this review, offers have been invited. No decision to sell has been made and there can be no certainty that any transaction will result.\n      </p>\n                <p>\n        The Company delivered a strong return in the first half and we remain focused on long-term performance.\n      </p>\n                <p>\n        Phil White\n      </p>\n                <p>\n        Managing Partner and Head of Infrastructure 3i Investments plc\n      </p>\n                <p>\n        8 November 2021\n      </p>\n                <p>\n        5\n      </p>\n              </div>\n              <div id=\"noodls_PartTextMsg\">\n                <p>\n        This is an excerpt of the original content. To continue reading it, access the original document <a href=\"https://docs.publicnow.com/97902A2BABA9B65852261FD866E0AABC3EF08C17\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a>.\n      </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.3i-infrastructure.com/media/5504/3in-hy-results-2022_press-release.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>3i Infrastructure plc</strong> published this content on <strong>09 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>09 November 2021 07:08:01 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - 3i Infrastructure plc</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: 3i-Infrastructure-plc</p></div>"}