{"date": "2022-02-25 07:11:35.706000+00:00", "ticker": "AAF", "mrkt_info": {"open": 149.4, "close": 144.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 7822CHelios Towers PLC25 February 2022</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>Helios Towers plc</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Update on Airtel Africa Tower Portfolio Transactions</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>London, 25 February 2022:</span>\n</span>\n<span>On 23 March 2021,</span>\n<span>Helios Towers plc (\"Helios Towers\", the \"Company\"), the independent telecommunications infrastructure company,</span>\n<span>announced that it had entered into agreements with Airtel Africa Group companies (\"Airtel Africa\") to acquire its passive infrastructure operating companies in Madagascar and Malawi and enter into exclusive memorandum of understanding arrangements for the potential acquisition of its passive infrastructure assets in Chad and Gabon, all subject to required regulatory approvals.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>As previously disclosed, the acquisition of Airtel Africa's passive infrastructure operating company in Madagascar closed in November 2021.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Helios Towers is providing the following updates in relation to the remaining countries:</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>Malawi: The Company continues to progress with the acquisition of Airtel Africa's passive infrastructure operating company in Malawi, which, subject to completing remaining customary closing conditions including obtaining required regulatory approval, is expected to close in H1 2022.</span>\n</p>\n<p>\n<span>·</span>\n<span>Gabon: Helios Towers and Airtel Africa have extended the memorandum of understanding arrangement. Subject to obtaining a passive infrastructure licence, the acquisition of assets in Gabon is expected to complete in H2 2022.</span>\n</p>\n<p>\n<span>·</span>\n<span>Chad: On 24 February 2022, the memorandum of understanding arrangement relating to tower assets in Chad expired, and Helios Towers and Airtel Africa mutually agreed that this would not be renewed.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Helios Towers will provide further detail on the integration of acquisitions and organic growth performance during its FY 2021 results announcement on 17 March 2022.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Helios Towers Investor Relations:</span>\n</p>\n<p>\n<span>Chris Baker-Sams, Head of Strategic Finance and Investor Relations</span>\n</p>\n<p>\n<span>+44 (0)752 310 1475</span>\n</p>\n<p>\n<span>\n<a href=\"mailto:investorrelations@heliostowers.com\" data-type=\"email\" translate=\"no\">investorrelations@heliostowers.com</a>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Media Relations:</span>\n</p>\n<p>\n<span>Edward Bridges / Stephanie Ellis</span>\n</p>\n<p>\n<span>FTI Consulting LLP</span>\n</p>\n<p>\n<span>+44 (0)20 3727 1000</span>\n</p>\n<p>\n<span>About Helios Towers</span>\n</p>\n<p>\n<span>·</span>\n<span>Helios Towers is a leading independent telecommunications infrastructure company, having established one of the most extensive tower portfolios across Africa. It builds, owns and operates telecom passive infrastructure, providing services to mobile network operators.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>Helios Towers owns and operates telecommunication tower sites in Tanzania, Democratic Republic of Congo, Congo Brazzaville, Ghana, South Africa, Senegal and Madagascar. Following recent acquisition agreements and subject to regulatory approval, Helios Towers expects to establish a presence in three new markets across Africa and the Middle-East. Including these acquisitions and committed BTS, the Group's total site count is expected to increase from over 9,000 towers to over 14,000.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>Helios Towers pioneered the model in Africa of buying towers that were held by single operators and providing services utilising the tower infrastructure to the seller and other operators. This allows wireless operators to outsource non-core tower-related activities, enabling them to focus their capital and managerial resources on providing higher quality services more cost-effectively.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>For more information about Helios Towers, please visit: <a href=\"https://www.heliostowers.com/investors/investor-home\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.heliostowers.com/investors/investor-home</a>/</span>\n</p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>MSCBIGDDCXDDGDS</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}