{"date": "2022-02-18 04:35:53+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3162.01, "close": 3052.03}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Byron Kaye</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">SYDNEY, Feb 18 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>An Australian state ordered Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> on Friday to pay a minimum rate to freelance delivery drivers, a decision hailed by a union as making it the world's first jurisdiction to compel the retailer to follow government rules on such payments.</p><p>The measure, to be phased in over three years from March 1, requires the world's largest retailer to pay drivers for its Amazon Flex business a minimum of A$37.80 ($27.20) per hour in Australia's most populous state of New South Wales.</p><p>That makes the state, the headquarters of Amazon's operations in Australia, the first place where it must pay wages to contractors that are set by law, the Transport Workers' Union (TWU) said.</p><p>\"Gig behemoths are on notice: this is what happens when workers call out these dangerous bottom feeders and fight together for a fair day's pay,\" said the union's national secretary, Michael Kaine.</p><p>\"For too long the likes of Amazon have been able to exploit independent contractor loopholes to sidestep rights and rip workers off fair rates of pay,\" he added in a statement.</p><p>Amazon representatives in Australia were not immediately available for comment.</p><p>Shares of the $1.6-trillion company have nearly doubled in value over the past two years, as the COVID-19 pandemic prompted a rush to online shopping.</p><p>But it has faced scrutiny over perceptions that it takes a hands-off approach to frontline worker safety and labour laws in the countries where it operates. </p><p>Last year, the U.S. Federal Trade Commission ordered Amazon to pay $61.7 million to reimburse Flex drivers for tips it was accused of stealing. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2K81I4\" data-type=\"storyId\" data-story-id=\"nL1N2K81I4\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Since Flex launched in Australia in 2020, drivers, who use their own vehicles to deliver by deadline packages picked up from Amazon distribution centres, have received varying amounts set by the company as they are not technically employees.</p><p>Friday's ruling by the New South Wales Industrial Relations Commission confirms that it is possible for all workers to have access to enforceable rights and protections, regardless of employment status, the TWU said.</p><p>Commission officials were not immediately available for comment.</p><p>($1=A$1.3897)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Byron Kaye; Editing by Clarence Fernandez)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:byron.kaye@thomsonreuters.com\" data-type=\"email\" translate=\"no\">byron.kaye@thomsonreuters.com</a> ; +612 9171 7541; @byronkaye;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-AUSTRALIA/WAGES</p></div>"}