{"date": "2021-12-02 12:54:59+00:00", "ticker": "ABDN", "mrkt_info": {"open": 233.3, "close": 230.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds CEO comments, share price, analyst</p><p class=\"tr-by\">By Carolyn Cohn and Sachin Ravikumar</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Dec 2 (Reuters)</span><span class=\"tr-dl-sep\"> - </span><span class=\"tr-strong\">Abrdn </span><a href=\"reuters://REALTIME/Verb=FullQuote/ric=ABDN.L\" data-type=\"ric\" data-ric=\"ABDN.L\" translate=\"no\" dir=\"ltr\">ABDN.L</a> <span class=\"tr-strong\">is to</span> buy <span class=\"tr-strong\">investment platform interactive </span>investor for 1.49 billion pounds ($1.98 billion) <span class=\"tr-strong\">in cash, as </span>t<span class=\"tr-strong\">raditional asset managers seek to build up customers using </span>o<span class=\"tr-strong\">nline providers</span>.</p><p>Banks and asset managers are looking at ways to capture a new breed of investors who tend to be younger and invest directly, rather than seek financial advice.</p><p><span class=\"tr-strong\">JPMorgan Chase <a href=\"reuters://REALTIME/Verb=FullQuote/ric=JPM.N\" data-type=\"ric\" data-ric=\"JPM.N\" translate=\"no\" dir=\"ltr\">JPM.N</a> has bought British digital platform Nutmeg in June as part of the U.S. bank's expansion into the UK retail banking and investment market. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL5N2NZ3BZ\" data-type=\"storyId\" data-story-id=\"nL5N2NZ3BZ\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></span></p><p>Abrdn is buying interactive investor from shareholders, including a fund advised by private equity firm JC Flowers and members of interactive investor's management, it said in a statement. <span class=\"tr-strong\">Interactive investor has around 55 billion pounds in assets under administration.</span></p><p><span class=\"tr-strong\">\"We wanted to buy a business that was building into the areas of high secular growth...we want to get those platform effects,\" abrdn CEO Stephen Bird told a media call, adding the purchase would increase the size of abrdn's retail investment business fivefold.</span></p><p>    Interactive investor CEO Richard Wilson will join abrdn and continue to lead the platform, the asset manager said.</p><p>Wilson said the deal meant interactive investor would have access to \"abrdn’s additional capabilities across research, advice and wealth management services.\"</p><p><span class=\"tr-strong\">Abrdn, which has 532 billion pounds in assets under management and administration, is issuing 200 million pounds in capital-boosting debt alongside the deal.</span></p><p><span class=\"tr-strong\">Shares in abrdn, created via a merger of asset managers Standard Life and Aberdeen, fell 2.3%.</span></p><p><span class=\"tr-strong\">Abrdn shares have dropped 45% since the merger completed in Aug 2017 amid concerns about its performance.</span></p><p><span class=\"tr-strong\">KBW analysts said the asset manager's \"chequered recent history of M&amp;A transactions will likely increase investor scepticism in the near term,\" reiterating their \"market perform\" rating on the stock.     </span></p><p>($1 = 0.7509 pounds)</p><p><br/></p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Sachin Ravikumar in Bengaluru and Carolyn Cohn and Abhinav Ramnarayan in London;<br/>Editing by Vinay Dwivedi, Huw Jones and Jane Merriman)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:carolyn.cohn@thomsonreuters.com\" data-type=\"email\" translate=\"no\">carolyn.cohn@thomsonreuters.com</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: INTERACTIVE INVESTOR-M&amp;A/ABRDN (UPDATE 2)</p></div>"}