{"date": "2022-01-18 14:17:45+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n        Public-private cooperation creates the best chance for success.\n      </div>\n                <div>\n                  <p>\n          One of the most significant challenges we face in Washington, particularly in the Puget Sound region, is the availability of affordable housing. While Amazon has made a $2 billion financial commitment to support affordable housing, we believe there is more that the private sector and governments can do to partner together. We are encouraged by the actions taken by Governor Jay Inslee, Senator Mona Das, and Representative Jessica Bateman to initiate debate on housing policy issues.\n        </p>\n                  <p>\n          Last year, in locations where Amazon has a sizeable presence, we began <span><a href=\"https://www.aboutamazon.com/news/community/amazon-launches-2-billion-housing-equity-fund-to-preserve-and-create-over-20-000-affordable-homes\" data-type=\"url\" class=\"tr-link\" translate=\"no\">investing in projects</a></span>where we believe our financial support will make a difference. The Amazon Housing Equity Fund is providing more than $2 billion in low-rate loans and grants to preserve and create more than 20,000 affordable homes for individuals and families earning moderate to low incomes. So far in Washington we've <span><a href=\"https://www.aboutamazon.com/news/community/Amazon-commits-another-28-5-million-for-local-affordable-housing\" data-type=\"url\" class=\"tr-link\" translate=\"no\">committed more than $344.3 million</a></span>in loans and grants from the Amazon Housing Equity Fund to create or preserve 2,870 affordable homes-with more investments to come.\n        </p>\n                  <div>\n                    <div>\n                      <span>\n                        <a href=\"https://www.aboutamazon.com/impact/economy/housing-equity/fund\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Housing Equity Fund</a>\n                      </span>\n                    </div>\n                    <div>\n            In January 2021, we launched the Housing Equity Fund, committing more than $2 billion to preserve and create over 20,000 affordable homes in our hometown communities.\n          </div>\n                    <div>\n                      <span>\n                        <a href=\"https://www.aboutamazon.com/impact/economy/housing-equity/fund\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read more</a>\n                      </span>\n                    </div>\n                  </div>\n                  <p>\n          As a member of the private sector, we were able to develop and quickly execute on creative solutions for equitable affordable housing development. Bringing the public and private sectors together will give us the best chance of success for creating even more solutions in the future.\n        </p>\n                  <p>\n          The Amazon Housing Equity Fund and the Governor's proposed approach both include transit-oriented development (TOD) as an important approach. TOD connects communities to jobs and services and promotes local community and economic development while also reducing commute times and associated expenses. We support smart TOD that helps to bring families closer to more opportunities and services, and our commitment to TOD in Puget Sound includes $100 million in low-rate loans and pre-development grants to developers working with Sound Transit to accelerate the creation of up to 1,200 homes. The first $25 million will fund pre-development activities like site due diligence, engineering, and permitting, while the remaining $75 million will support the construction of new affordable housing, which is expected to begin within five years.\n        </p>\n                  <p>\n          Other investments made by the Amazon Housing Equity Fund in the Puget Sound region include low-rate loans and grants to the King County Housing Authority to preserve over 1,000 affordable homes in the region, funding to nonprofit and for-profit housing providers working to preserve housing affordability, and funding to launch a professional <span><a href=\"https://www.aboutamazon.com/news/community/amazon-launches-21m-program-for-real-estate-developers-of-color\" data-type=\"url\" class=\"tr-link\" translate=\"no\">accelerator pilot program</a></span>in partnership with Local Initiatives Support Corporation Puget Sound to support emerging real estate developers of color focused on affordable housing.\n        </p>\n                  <p>\n          Funding is one part of the equation to solve housing issues, which is why Amazon and other large businesses like <span><a href=\"https://news.microsoft.com/affordable-housing/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Microsoft</a></span>are stepping forward with support. But it's not just about money; it's also about government cultivating the policy environment to create more housing choices, especially near transit. We look forward to supporting Washington State's important work in this area.\n        </p>\n                </div>\n                <div>\n                  <div>\n          Related Tags\n        </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/public-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Public policy</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/housing-equity\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Housing equity</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/washington\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Washington</a>\n                    </span>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/policy-news-views/addressing-housing-issues-in-washington-state\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>18 January 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>18 January 2022 14:17:45 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}