{"date": "2021-11-18 10:46:47.118000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> will stop accepting <a href=\"https://www.independent.co.uk/topic/visa\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Visa</a> credit cards for payments in the UK from January, it said.</p><p>The costs of processing payments on the cards made it too expensive to support them, Amazon said.</p></div><div class=\"tr-npp-body\"><p>Amazon will continue to accept payments on Visa debit cards as well as credit cards from other firms, such as Mastercard and American Express.</p><p>The new rules will start from 19 January, Amazon said in an email to customers.</p><p>The online giant said technology advancements should be making payment processing fees reduce, but complained that they were actually increasing.</p><p>\"The cost of accepting card payments continues to be an obstacle for businesses striving to provide the best prices for customers,\" the company said in a statement.</p><p>\"These costs should be going down over time with technological advancements, but instead they continue to stay high or even rise.</p><p>\"As a result of Visa's continued high cost of payments, we regret that Amazon.co.uk will no longer accept UK-issued Visa credit cards as of January 19, 2022.</p><p>\"With the rapidly changing payments landscape around the world, we will continue innovating on behalf of customers to add and promote faster, cheaper and more inclusive payment options to our stores across the globe.\"</p><p>A Visa spokesperson said the company was disappointed and hoped to resolve the situation before the deadline went into effect.</p><p>\"UK shoppers can use their Visa debit and credit cards at Amazon UK today and throughout the holiday season,\" the company said.</p><p>\"We are very disappointed that Amazon is threatening to restrict consumer choice in the future. When consumer choice is limited, nobody wins.</p><p>\"We have a long-standing relationship with Amazon, and we continue to work toward a resolution so our cardholders can use their preferred Visa credit cards at Amazon UK without Amazon-imposed restrictions come January 2022.\"</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/life-style/gadgets-and-tech/news/alexa-amazon-listen-voice-recordings-b1958780.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">How to listen to the recordings Amazon's Alexa has of you</a> </p><p><a href=\"https://www.independent.co.uk/life-style/gadgets-and-tech/meta-facebook-virtual-reality-gloves-b1959315.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Meta is making a real-life glove that can hold virtual items</a> </p><p><a href=\"https://www.independent.co.uk/life-style/gadgets-and-tech/apple-iphone-repair-self-mac-fix-broken-b1959361.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Apple to officially let people fix their own iPhones for the first time</a> </p><p><a href=\"https://www.independent.co.uk/life-style/gadgets-and-tech/meta-facebook-virtual-reality-gloves-b1959315.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Meta is making a real-life glove that can hold virtual items</a> </p><p><a href=\"https://www.independent.co.uk/life-style/gadgets-and-tech/apple-iphone-repair-self-mac-fix-broken-b1959361.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Apple to officially let people fix their own iPhones for the first time</a> </p><p><a href=\"https://www.independent.co.uk/life-style/gadgets-and-tech/bitcoin-price-ethereum-news-today-live-b1959179.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Bitcoin price slide continues after sudden crash – follow live</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Independent, The (UK) (Online). All rights reserved.</p></div>"}