{"date": "2022-01-27 23:56:21.989000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2777.45, "close": 2879.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Visa's fee battle with Amazon, Russia's potential invasion of Ukraine, spikes in coronavirus infection, supply chain shortages and inflation all have the potential to weigh on Mastercard's operations, but the card network is still projecting growth for the year ahead.</p><p>\"We are optimistic about the coming year as consumers, businesses and governments have become more adaptable to the changing environment,\" Mastercard CEO Michael Miebach said as part of his prepared remarks presentation during a conference call to discuss fourth-quarter earnings.</p></div><div class=\"tr-npp-body\"><p>For the quarter that ended Dec. 31, Mastercard reported net revenue of $5.22 billion, up 28% from the prior year, and adjusted diluted earnings per share of $2.35, up 26%. That beat Zacks Investment Research estimates for earnings of $2.19 per share and revenue of $5.13 billion. For the full year the card network reported net revenue of $18.9 billion and said payment information exchanges between merchant acquirers and the card network topped 100 billion for the first time. Mastercard projected growth in the \"high teens\" for the first quarter of 2022 and the full year.</p><p>Nevertheless, analysts peppered Miebach with questions about Mastercard's outlook. <br/> </p><p>Some asked Miebach about Visa's battle with Amazon over payment fees. <a href=\"https://www.cnn.com/2022/01/17/tech/amazon-visa-uk/index.html\"><span>Amazon recently backed away</span></a> from a threat to ban Visa credit card payments in the U.K. as a protest over interchange and other costs, though negotiations are continuing and Amazon has not ruled out further action. Amazon has also added a surcharge for Visa credit card payments in Singapore.</p><p>\"We have a strong relationship with Amazon,\" Miebach said. \"We agree that consumer choice matters and will work with Amazon on a range of products. There's nothing to worry about from our perspective.\"</p><p>Both Mastercard and Visa plan interchange fee hikes later this year, and the battle between Amazon and Visa in the U.K. is seen as a proxy for a <a href=\"https://www.americanbanker.com/news/amazons-u-k-visa-ban-could-foreshadow-larger-fight-in-u-s\"><span>wider fight</span></a> over interchange fees to come this year. Miebach did not address interchange pricing directly during the earnings call, but stressed it does not have a dispute with Amazon. Amazon did not return a request for comment by deadline.</p><p>\"We have seen these kinds of negotiations in the public domain now and again over the years,\" Miebach said. \"This negotiation didn't involve us.\"</p><p>The dispute between Amazon and Visa has drawn attention to cheaper <a href=\"https://www.americanbanker.com/payments/news/alternative-payment-firms-capitalize-on-amazon-visa-tensions\"><span>credit card alternatives</span></a> such as direct account-to-account transfers. Mastercard's investments in open banking, which is designed to ease data sharing between card issuers and third parties such as payment apps, provide an advantage as account-to-account payments rise, Miebach said.</p><p>The card network's <a href=\"https://www.americanbanker.com/payments/news/mastercard-buys-controlling-stake-in-vocalink-for-920-million\"><span>Vocalink</span></a> division, which powers digital payment processing, is also contributing to Mastercard's account-to-account payments support, according to Miebach, who said Mastercard has account-to-account payment relationships in the U.K. with Lloyds and Tesco, among others. \"We've covered our bases there,\" he said.</p><p>Miebach was also asked about the supply chain shortage, which <a href=\"https://www.cnbc.com/2021/10/28/us-gross-domestic-product-increases-at-2point0percent-annualized-pace-in-q3-vs-2point8percent-estimate.html\"><span>challenged economic output</span></a> in late 2021.</p><p>\"Pressures are there, with impacts such as the <a href=\"https://www.americanbanker.com/payments/news/global-chip-shortage-threatens-payment-card-supply\"><span>chip shortage</span></a> ,\" the CEO said, adding that the holiday spending trends suggest consumers have shifted their spending to products that are not heavily affected by supply chain issues.</p><p>\"We believe these challenges are short lived,\" Miebach said. During the earnings call, Mastercard said supply-chain delays, shortages and inflation have not had a material impact on its performance.</p><p>These issues are playing out against the backdrop of a potential Russian invasion of Ukraine. As tensions between the U.S. and Russia mount, the U.S. has threatened sanctions against Russia that could include restrictions on <a href=\"https://www.americanbanker.com/payments/news/how-u-s-russia-tensions-could-hurt-visa-mastercard\"><span>bank-supported payments</span></a> and other measures targeting financial activity.</p><p>\"It's very early to tell how this will play out,\" Miebach said, adding that Mastercard included geopolitical tensions in its outlook. \"We've seen sanctions applied in previous years. Russia is an important market for us.\"</p><p>And despite the recent spike in coronavirus infections due to the omicron variant, payment volumes have remained strong, Miebach said.</p><p>The accelerated push to digital commerce that resulted from the early stages of the pandemic is permanent and payment categories that suffered, such as travel, are rebounding, he said. International travel, for example, should recover to pre-pandemic levels by the end of 2022. General cross-border spending is already above pre-pandemic levels, Miebach said. There is pent-up demand for travel spending, he said.</p><p>\"Businesses, consumers and governments have learned from the pandemic, and the responses are more targeted these days,\" and a boost in vaccinations should also mitigate future economic impacts from the virus, the CEO said. \"More borders are staying open.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 American Banker. All Rights Reserved.</p></div>"}