{"date": "2022-01-15 10:45:08.914000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3224.28, "close": 3178.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>New Delhi [India], January 15 (ANI): OnePlus, on Friday, launched the OnePlus 9RT 5G smartphone and Buds Z2 in India. The new devices' prices have also been confirmed, along with when they will go on sale.</p><p>New Delhi [India], January 15 (ANI): OnePlus, on Friday, launched the OnePlus 9RT 5G smartphone and Buds Z2 in India. The new devices' prices have also been confirmed, along with when they will go on sale.</p></div><div class=\"tr-npp-body\"><p>As per GSM Arena, the OnePlus 9RT is priced starting at Rs 42,999 for the 8GB/128GB variant. The 12GB/256GB variant is priced at Rs 46,999. The phone will be available in two colours in India - Hacker Black and Nano Silver.</p><p>The OnePlus 9RT 5G will be available beginning January 16 for Amazon Prime members as part of early access on Amazon.</p><p>The OnePlus Red Cable Club members can get the smartphone during the first sale on the OnePlus online portal and the OnePlus Store app from January 17. Open sale on all platforms will start from January 17.</p><p>OnePlus 9RT 5G: Specs and features</p><p>The OnePlus 9RT comes with a Snapdragon 888 chipset and a 6.62\" AMOLED screen. The brand is offering the phone with either 8/128 GB memory or 12/256 GB, and there's no microSD slot for extra storage. There is a bigger heat sink inside the device, increasing heat dissipation by 20 per cent, compared to the one in the OnePlus 9, reported BeeBom.</p><p>The camera section has seen an upgrade too. There's now a 50MP Sony IMX766 main camera with OIS, a 16MP ultra-wide camera, and a 2MP macro camera. However, the front snapper follows the same old OnePlus story and stands at 16MP.</p><p>There's support for a dual-LED flash, 4K videos, slow-motion videos, Night mode, Portrait mode, Dual-view mode, and more camera features.</p><p>The OnePlus 9RT includes a 4,500mAh battery with support for Warp Charge 65T fast charging. It runs OxygenOS 11 based on Android 11 with some ColorOS tidbits.</p><p>Additionally, the phone comes packed with an in-display fingerprint scanner, Face Unlock, WiFi 802.11 ax, Bluetooth version 5,2, NFC, dual stereo speakers with Dolby Atmos, reported BeeBom.</p><p>OnePlus Buds Z2: Specs and features</p><p>OnePlus Buds Z2, the budget truly wireless earbuds, come with Active Noise Cancellation (ANC), fast charging support, and more attractive features, that too, under Rs 5,000.</p><p>The earbuds come in Pearl White and Obsidian Black colours to choose from.</p><p>The earbuds come with support for up to 40dB Active Noise Cancellation (ANC) to cancel out the unnecessary background noises and Transparency mode to allow for the sounds you want to hear. The Buds Z2 feature a three-mic setup for noise and wind reduction calibration.</p><p>While the charging case gets a 520mAh battery, each earbud has a 40mAh battery. The Flash Charge fast charging is claimed to provide 5 hours of playback (charging case and earbuds) and 2 hours of playback (only earbuds) in just 10 minutes, reported BeeBom.</p><p>The combined playback time is touted to 27 hours with ANC and 38 hours without ANC. The case includes a USB Type-C port for charging.</p><p>The OnePlus Buds Z2 also comes with support for IP55 water and sweat resistance, 94ms low latency, and Dolby Atmos. Additionally, it gets Bluetooth version 5.2, Google Fast Pair, and the Hey Melody app for the needed adjustments.</p><p>The earbuds will be available to buy, starting January 18 via Amazon India, Flipkart, and the company's website.</p><p>The OnePlus Buds Z2 is priced at Rs 4,999 and becomes yet another ANC-enabled earbuds that fall under Rs 10,000. (ANI)</p><p>Copyright © 2022 aninews.in All rights reserved. Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 SyndiGate. All Rights Reserved.</p></div>"}