{"date": "2022-01-15 00:52:44.708000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3224.28, "close": 3178.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>IBM Watson Advertising and The Weather Company offer AWS Data Exchange users access to weather data and insights to inform marketing strategies</p><p>IBM Watson Advertising announced the availability of data from The Weather Company, an IBM Business, on AWS Data Exchange, an Amazon Web Services (AWS) platform. The AWS Data Exchange allows businesses to easily find and subscribe to third-party data in the cloud.</p></div><div class=\"tr-npp-body\"><p>Providing data from the world's most accurate weather forecaster1, IBM Watson Advertising's Weather Analytics harness the relationship between weather and consumer behavior using artificial intelligence to extract deep insights to help businesses make more confident, data-driven and insightful enterprise decisions.</p><p>The weather datasets can help analyze how weather affects consumer purchasing across different categories such as pharmaceuticals, apparel, consumer packaged goods and indoor and outdoor activities. Local data by ZIP code including historical weather data, 15-day forecast weather data, and relative data such as hot, cold, windy and other conditions could also be used to help inform campaigns, supply chain and forecasting decisions. This data can even help surface unique or non-obvious relationships between weather and consumer behavior.</p><p>\"We know that weather can impact nearly everything in daily life -- how we feel, what we do, even what we buy,\" said Sheri Bachstein, Chief Executive Officer at The Weather Company and General Manager of IBM Watson Advertising. \"This expanded relationship with AWS gives more businesses access to the weather data that can drive consumer behavior and purchasing. We are committed to opening up our insights and technology to a broad set of organizations, and giving more companies access to what we know can be growth- and efficiency-driving data and tech.\"</p><p>Insights that show locations where weather could affect sales can help businesses drive revenue based on predictive consumer behavior. According to past IBM Watson Advertising research, data revealed that while chocolate candy bar sales generally go up in colder months across the U.S., sales can spike in the Southwest when a higher heat index is expected, and in the Northeast during muggy nights. In another example, while more bug spray is purchased during the summer months, foggy conditions in the Northwest can drive more sales while clear conditions can drive demand in central states.</p><p>AWS Data Exchange helps make it easy to find, subscribe to, and use third-party data from providers in the cloud. Subscribers can use the AWS console or APIs to load IBM Watson Advertising solutions into a wide variety of AWS analytics and machine learning services.</p><p>This is the latest example of how IBM is building together with ecosystem partners of all types to create solutions for developers to address the needs of the hybrid cloud era. IBM is committed to a $1 billion investment in its partner ecosystem over the next three years. This investment is already being utilized to support a coalition of enterprises that are helping customers migrate their mission-critical workloads using IBM's open hybrid cloud architecture.</p><p>To learn more about how IBM Watson Advertising solutions and services visit: <a href=\"https://www.ibm.com/watson-advertising\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.ibm.com/watson-advertising</a>.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Euclid Infotech Pvt Ltd.</p></div>"}