{"date": "2021-11-23 15:41:59.941000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>PHUNWARE INC (\"PHUN-Q\")\n- Multiscreen-as-a-Service (MaaS) Platform for Digital\n- Transformation Now Available in AWS Marketplace\n\n     Phunware, Inc. (the \"Company\"), a fully-integrated enterprise cloud\nplatform for mobile that provides products, solutions, data, and services\nfor brands worldwide, announced immediate availability of its\nMultiscreen-as-a-Service (MaaS) platform in AWS Marketplace, a digital\ncatalog with thousands of software listings from independent software\nvendors that make it easy to find, test, buy, and deploy software that runs\non Amazon Web Services, Inc. (AWS).\n\n     Phunware's portfolio of Smart Solutions on mobile provides access to\nall of the features and capabilities of the MaaS platform that any business\ncan license to drive digital transformation through contactless digital\naccess, room-booking, occupancy management, directories, check-in\ninstructions, screenings, feedback tools, news, notifications, analytics,\nand seamless access and integration to third-party vendors and systems.\n\n     \"We are thrilled to work with AWS and leverage over a decade of\nindustry experience in order to help enterprises drive digital\ntransformation in a mobile-first world,\" said Randall Crowder, Chief\nOperating Officer at Phunware. \"By adding our MaaS Platform to AWS\nMarketplace, customers around the world can more easily access mobile\nsoftware that can tech-enable not only critical operations, but also\ncustomer and workforce engagement.\"\n\n     AWS Marketplace streamlines customer adoption of technology such as\nMaaS via a consolidated purchase environment and integration with their AWS\naccounts, which have terms already established. AWS Marketplace SaaS\nContracts simplifies the process even further by enabling customers to\nprepay for MaaS based on expected usage tiers through contracts up to one\nyear in length. The cost of MaaS is integrated into the customer's AWS bill\nonce they subscribe, resulting in a consolidated, easy-to-process bill.\n\n     Click here to learn more about how MaaS can drive digital\ntransformation.\n\n     Safe Harbor Clause and Forward-Looking Statements\n\nThis press release includes forward-looking statements. All statements\nother than statements of historical facts contained in this press release,\nincluding statements regarding our future results of operations and\nfinancial position, business strategy and plans, and our objectives for\nfuture operations, are forward-looking statements. The words \"anticipate,\"\n\"believe,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"expose,\" \"intend,\"\n\"may,\" \"might,\" \"opportunity,\" \"plan,\" \"possible,\" \"potential,\" \"predict,\"\n\"project,\" \"should,\" \"will,\" \"would\" and similar expressions that convey\nuncertainty of future events or outcomes are intended to identify\nforward-looking statements, but the absence of these words does not mean\nthat a statement is not forward-looking.\n\n     The forward-looking statements contained in this press release are\nbased on our current expectations and beliefs concerning future\ndevelopments and their potential effects on us. Future developments\naffecting us may not be those that we have anticipated. These\nforward-looking statements involve a number of risks, uncertainties (some\nof which are beyond our control) and other assumptions that may cause\nactual results or performance to be materially different from those\nexpressed or implied by these forward-looking statements. These risks and\nuncertainties include, but are not limited to, those factors described\nunder the heading \"Risk Factors\" in our filings with the Securities and\nExchange Commission (SEC), including our reports on Forms 10-K, 10-Q, 8-K\nand other filings that we make with the SEC from time to time. Should one\nor more of these risks or uncertainties materialize, or should any of our\nassumptions prove incorrect, actual results may vary in material respects\nfrom those projected in these forward-looking statements. We undertake no\nobligation to update or revise any forward-looking statements, whether as a\nresult of new information, future events or otherwise, except as may be\nrequired under applicable securities laws. These risks and others described\nunder \"Risk Factors\" in our SEC filings may not be exhaustive.\n\n     By their nature, forward-looking statements involve risks and\nuncertainties because they relate to events and depend on circumstances\nthat may or may not occur in the future. We caution you that\nforward-looking statements are not guarantees of future performance and\nthat our actual results of operations, financial condition and liquidity,\nand developments in the industry in which we operate may differ materially\nfrom those made in or suggested by the forward-looking statements contained\nin this press release. In addition, even if our results or operations,\nfinancial condition and liquidity, and developments in the industry in\nwhich we operate are consistent with the forward-looking statements\ncontained in this press release, those results or developments may not be\nindicative of results or developments in subsequent periods.\n\n     About Phunware, Inc.\n\n     Everything You Need to Succeed on Mobile -- Transforming Digital Human\nExperience\n\n     Phunware, Inc. (NASDAQ: PHUN), is the pioneer of\nMultiscreen-as-a-Service (MaaS), an award-winning, fully integrated\nenterprise cloud platform for mobile that provides companies the products,\nsolutions, data and services necessary to engage, manage and monetize their\nmobile application portfolios and audiences globally at scale. Phunware's\nSoftware Development Kits (SDKs) include location-based services, mobile\nengagement, content management, messaging, advertising, loyalty (PhunCoin &amp;\nPhunToken) and analytics, as well as a mobile application framework of\npre-integrated iOS and Android software modules for building in-house or\nchannel-based mobile application and vertical solutions. Phunware helps the\nworld's most respected brands create category-defining mobile experiences,\nwith approximately one billion active devices touching its platform each\nmonth when operating at scale. For more information about how Phunware is\ntransforming the way consumers and brands interact with mobile in the\nvirtual and physical worlds, visit <a href=\"https://phunware.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://phunware.com</a>,\n<a href=\"https://phunwallet.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://phunwallet.com</a>, <a href=\"https://phuncoin.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://phuncoin.com</a>, <a href=\"https://phuntoken.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://phuntoken.com</a>, and\nfollow @phunware, @phuncoin and @phuntoken on all social media platforms.\n\nPhunware PR &amp; Media Inquiries:\npress@phunware.com\nT: (512) 693-4199\n\nPhunware\n\nContact Information:\n\nContact:\nMatt Glover and John Yi\nGateway Investor Relations\nEmail: PHUN@gatewayir.com\nPhone: (949) 574-3860\n\nTel   : 512-693-4199    PHUNWARE INC\nWWW   : <a href=\"https://www.phunware.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.phunware.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132600330.MNPRE2132601733-07324720211123</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}