{"date": "2021-11-09 14:00:03.705000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>\n<b>Rollbar Joins the AWS Partner Network Global Startup Program</b>\n</p><p>\nRollbar, a Continuous Code Improvement platform, announced today that it has become part of the Amazon Web Services (AWS) Partner Network (APN) Global Startup Program. The AWS Global Startup Program is a unique white glove support and go-to-market program for selected startup AWS Partners, so that they can build on their AWS expertise, better serve shared customers, and accelerate their growth.\n</p><p>\nThe AWS Global Startup Program enables startups to gain visibility, exposure, leads, and commercial opportunities made possible with exclusive AWS resources. Dedicated Startup Partner Development Managers with deep AWS knowledge and startup business experience guide startups in their growth journey with AWS. As an AWS Partner, Rollbar will receive benefits including a tailor-made plan for mapping needs and opportunities to a selection of AWS services and programs, including promotion support to drive visibility and awareness around the startup offering, and business, technical, and marketing resources to sell and deploy innovative solutions on behalf of AWS shared customers.\n</p><p>\nAWS enables companies to deploy services and applications securely with scalability and performance. The benefits of running applications on AWS are complemented by the increased application quality and deployment velocity that Rollbar provides. Rollbar’s Continuous Code Improvement platform helps development teams deploy better software, faster, and to quickly recover from critical errors in their code. Rollbar enables developers to focus on continually improving their code and constantly innovating rather than spending time monitoring, investigating, and debugging.\n</p><p>\nRollbar’s error grouping engine utilizes machine learning to automatically group similar errors to reduce noise and create trustworthy alerts. Rollbar automatically triggers workflows based on new bugs or regressions that are detected to proactively address issues and minimize their impact until developers can get to them. As a result, development teams can unlock greater coverage and insights into broken code across the software lifecycle. This enables them to minimize the impact of code issues on customers and end users while maintaining high-quality customer experiences. Development teams can now focus on pushing forward services and applications, knowing that they can quickly recover from critical errors as they happen.\n</p><p>\nJoining the AWS Global Startup Program enables Rollbar to reach more organizations, make use of AWS products and services, and help companies quickly discover and resolve errors within their distributed systems. To be selected for the AWS Global Startup Program, Rollbar had to meet predefined criteria, including having a clear, demonstrated product market fit for an innovative enterprise tech product, backing by and recommendation from a top-tier venture capital firm, and a strategic commitment to building its AWS expertise.\n</p><p>\nRollbar Enterprise for AWS is <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fmarketplace%2Fpp%2Fprodview-zkez7hobyviiu%3Fsr%3D0-1%26ref_%3Dbeagle%26applicationId%3DAWSMPContessa&amp;esheet=52525826&amp;newsitemid=20211109005705&amp;lan=en-US&amp;anchor=available+in+the+AWS+Marketplace&amp;index=1&amp;md5=059215112266ceddeac6fd296bc899dd\" data-type=\"url\" class=\"tr-link\" translate=\"no\">available in the AWS Marketplace</a>.\n</p><p>\n“Rollbar is excited to join the AWS Partner Network Global Startup Program. We want to help customers focus on their goals and success within the AWS platform by minimizing the time developers spend on errors. Our Continuous Code Improvement platform alongside the breadth of services on AWS provide a great environment to focus on innovating,” said Brian Rue, CEO of Rollbar.\n</p><p>\n“It’s all about the speed of development. Rollbar helps make it easier for everyone involved -- not just developers, but also for QA and Operations to surface issues and resolve them faster,” said Hector Villafuerte, co-founding engineer at Duolingo, a Rollbar customer.\n</p><p>\n<b>About Rollbar</b>\n</p><p>\nRollbar is a leading continuous code improvement platform that proactively discovers, predicts, and remediates errors with real-time AI-assisted workflows. With Rollbar, developers continually improve their code and constantly innovate rather than spending time monitoring, investigating, and debugging.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211109005705r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTA5MDA1NzA1cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=272b2fe52747863e9873cec4dba80689c2d683fad1b6f5b02af3adc4cf97e7e70704ee7b39b6ff66a617accfc832cb42383e07e2f9ff8d5975d2e93007c535d1\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211109005705/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211109005705/en/</a></span></p><p>\nMiranda Honnoll\n<br/>Bospar for Rollbar\n<br/><a href=\"mailto:Miranda@bospar.com\" data-type=\"email\" translate=\"no\">Miranda@bospar.com</a><br/>408-887-8486\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: CA-ROLLBAR</p></div>"}