{"date": "2021-12-29 19:42:27.040000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3413.22, "close": 3372.89}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>RADWARE LTD (\"RDWR-Q\")\n- Armis Selects Radware to Deliver Cloud Security for AWS\n\n     Radware(R), a leading provider of cyber security and application\ndelivery solutions, announced that Armis, a leading unified asset\nvisibility and security platform provider, chose Radware's Cloud Native\nProtector to safeguard its Amazon Web Services (AWS) environment. This\nborn-in-the-cloud business adopted Radware's solution to fortify its cloud\nsecurity posture and identify potential vulnerabilities before they evolved\ninto threats.\n\n     Armis' security platform enables companies to safely use and control\nIoT and other unmanaged devices without fear of compromise by cyberattacks.\nArmis was looking for a solution that would give its DevOps team full\nvisibility and control of its public cloud environment. The company turned\nto Radware to make it easier for its team to remotely track assets,\nsupervise access to sensitive resources, and detect suspicious activity.\n\n    \"The Radware team understands that we are a dynamic company with\nrequirements that are constantly changing,\" said Roi Amitay, head of\nDevInfra at Armis. \"Radware's Cloud Native Protector plays an essential\nrole in securing our cloud environment. It helps us see our full cloud\npicture and focus on what matters most. Radware provides trusted products\nand support, making this the best solution for our company.\"\n\n    Radware's solution enhances the visibility and control Armis has over its\npublic cloud environment. It automates manual analysis and notifies Armis\nabout any publicly exposed assets and potential cyberattacks to help the\ncompany prioritize its work.\n\n    \"Cloud-native companies like Armis have unique and constantly shifting\nsecurity requirements that need specialized solutions,\" said Gilad\nBarzilay, director of public cloud sales at Radware. \"Our Cloud Native\nProtector not only secures Armis' cloud workloads but also is continually\nassessing risks and improving visibility and governance of their cloud.\"\n\n    Radware's Cloud Native Protector is an agentless solution that provides\ncentralized visibility and reporting for workloads and accounts on AWS and\nMicrosoft Azure. Its intuitive 360-degree centralized dashboard shows\nalerts across accounts and clouds with risk-prioritized alerting so that\nsecurity teams know which alert to focus on first. Using a multi-layered\napproach that covers a wide security posture of the cloud and threats to\nindividual workloads, the solution also identifies and prevents public\nexposure of public facing assets, cloud security misconfigurations,\nexcessive permissions, and malicious activity in the cloud.\n\n     About Radware\n\n     Radware(R) (NASDAQ: RDWR) is a global leader of cyber security and\napplication delivery solutions for physical, cloud, and software defined\ndata centers. Its award-winning solutions portfolio secures the digital\nexperience by providing infrastructure, application, and corporate IT\nprotection, and availability services to enterprises globally. Radware's\nsolutions empower enterprise and carrier customers worldwide to adapt to\nmarket challenges quickly, maintain business continuity, and achieve\nmaximum productivity while keeping costs down. For more information, please\nvisit the Radware website.\n\n     Radware encourages you to join our community and follow us on:\nFacebook, LinkedIn, Radware Blog, Twitter, YouTube, and Radware Mobile for\niOS and Android.\n\n     (c)2021 Radware Ltd. All rights reserved. Any Radware products and\nsolutions mentioned in this press release are protected by trademarks,\npatents, and pending patent applications of Radware in the U.S. and other\ncountries. For more details, please see:\n<a href=\"https://www.radware.com/LegalNotice\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.radware.com/LegalNotice</a>/. All other trademarks and names are\nproperty of their respective owners.\n\n     Radware believes the information in this document is accurate in all\nmaterial respects as of its publication date. However, the information is\nprovided without any express, statutory, or implied warranties and is\nsubject to change without notice.\n\n     The contents of any website or hyperlinks mentioned in this press\nrelease are for informational purposes and the contents thereof are not\npart of this press release.\n\n     Safe Harbor Statement\n\n     This press release includes \"forward-looking statements\" within the\nmeaning of the Private Securities Litigation Reform Act of 1995. Any\nstatements made herein that are not statements of historical fact,\nincluding statements about Radware's plans, outlook, beliefs, or opinions,\nare forward-looking statements. Generally, forward-looking statements may\nbe identified by words such as \"believes,\" \"expects,\" \"anticipates,\"\n\"intends,\" \"estimates,\" \"plans,\" and similar expressions or future or\nconditional verbs such as \"will,\" \"should,\" \"would,\" \"may,\" and \"could.\"\nFor example, when we say that our Cloud Native Protector solution is\ncontinually assessing risks while improving visibility and governance of\nthe cloud, we are using a forward-looking statement. Because such\nstatements deal with future events, they are subject to various risks and\nuncertainties, and actual results, expressed or implied by such\nforward-looking statements, could differ materially from Radware's current\nforecasts and estimates. Factors that could cause or contribute to such\ndifferences include, but are not limited to: the impact of global economic\nconditions and volatility of the market for our products; natural disasters\nand public health crises, such as the coronavirus disease 2019 (COVID-19)\npandemic; our ability to expand our operations effectively; timely\navailability and customer acceptance of our new and existing solutions;\nrisks and uncertainties relating to acquisitions or other investments; the\nimpact of economic and political uncertainties and weaknesses in various\nregions of the world, including the commencement or escalation of\nhostilities or acts of terrorism; intense competition in the market for\ncyber security and application delivery solutions and in our industry in\ngeneral, and changes in the competitive landscape; changes in government\nregulation; outages, interruptions, or delays in hosting services or our\ninternal network system; compliance with open source and third-party\nlicenses; the risk that our intangible assets or goodwill may become\nimpaired; our dependence on independent distributors to sell our products;\nlong sales cycles for our solutions; changes in foreign currency exchange\nrates; undetected defects or errors in our products or a failure of our\nproducts to protect against malicious attacks; the availability of\ncomponents and manufacturing capacity; the ability of vendors to provide\nour hardware platforms and components for our main accessories; our ability\nto protect our proprietary technology; intellectual property infringement\nclaims made by third parties; changes in tax laws; our ability to realize\nour investment objectives for our cash and liquid investments; our ability\nto attract, train, and retain highly qualified personnel; and other factors\nand risks over which we may have little or no control. This list is\nintended to identify only certain of the principal factors that could cause\nactual results to differ. For a more detailed description of the risks and\nuncertainties affecting Radware, refer to Radware's Annual Report on Form\n20-F, filed with the Securities and Exchange Commission (SEC) and the other\nrisk factors discussed from time to time by Radware in reports filed with,\nor furnished to, the SEC. Forward-looking statements speak only as of the\ndate on which they are made and, except as required by applicable law,\nRadware undertakes no commitment to revise or update any forward-looking\nstatement in order to reflect events or circumstances after the date any\nsuch statement is made. Radware's public filings are available from the\nSEC's website at www.sec.gov or may be obtained on Radware's website at\nwww.radware.com.\n\nEmail : ir@radware.com    RADWARE LTD\nWWW   : <a href=\"https://www.radware.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.radware.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2136200056.MNPRE2136200358-05221220211229</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}