{"date": "2022-02-11 07:29:45.187000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3223.79, "close": 3065.87}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 3690BTern PLC11 February 2022</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>11 February 2022</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Tern Plc</span>\n</p>\n<p>\n<span>(\"Tern\" or the \"Company\")</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Portfolio Update</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Tern Plc (AIM:TERN), the company</span>\n<span>focused on value creation from <span>Internet of Things (\"IoT\")</span> technology businesses <span>, is pleased to</span> provide an update on the recent activities of the Company and its portfolio companies.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Highlights</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>Further significant progress across Tern's portfolio companies, with growth in recurring revenues and new contract wins, together with unaudited valuation uplifts over the December 2021 to February 2022 period for Device Authority, Konektio, Talking Medicines and Wyld Networks.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>Device Authority,</span>\n<span>\n<span>has continued its positive business momentum following the strategic investment from Venafi, announced on 2 December 2021, with the business being particularly focussed on growing its monthly recurring revenues through its subscription base and its modularised licence platform, KeyScaler®.</span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>In January 2022, Device Authority</span>\n<span>entered into a partnership with Trusted Objects, a leading player in cybersecurity technologies for embedded systems and cloud device management platforms, to integrate Trusted Object's 'TO-protect' software root-of-trust and Device Authority's KeyScaler</span>\n<span>®</span>\n<span>.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>FundamentalVR has continued to enter into further significant contracts in recent months including:</span>\n<span>a £0.6 million contract in the area of interventional medicine; a £1 million contract in the Robotics Assisted Surgical Systems sector; and a £0.3 million contract from a new client to create a virtual education facility.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>Wyld Networks has continued to perform strongly, with further commercial traction, including</span>\n<span>entering into a connectivity partnership with Eutelsat Communications, Senet Inc and TrakAssure to form the Multimodal IoT Infrastructure Consortium™ (\"MMIIC\").</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>Wyld Networks joined the LoRa Alliance®, the global association of companies backing the open LoRaWAN® standard* for the IoT in November 2021. In December 2021, LoRaWAN® was officially approved as a standard by the International Telecommunication Union.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>InVMA is now trading as Konektio and following the £2.125 million equity fund raise, announced on 20 December 2021, the business has continued to see strong demand for AssetMinder®.</span>\n<span>Konektio has also recently appointed Dr Ron Black, the former CEO of <span>Imagination Technologies,</span> as its new Non-Executive Chairman <span>.</span>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>Following the £1.59 million Talking Medicines syndicated fund raise announced on 1 February 2022, Talking Medicines is focussing on expanding the subscription base for</span>\n<span>PatientMetRx® <span>, including in the US via its recently established office in New Jersey.</span>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Commenting Al Sisto, CEO of Tern, said</span>\n</span>\n<span>:</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\"Since our last portfolio update at the end of October 2021, our portfolio companies have all made substantial progress, which I believe significantly increases the value that will ultimately be delivered for Tern shareholders in the form of exit proceeds. We consider that, this value is being built via increases in monthly recurring revenues and the significant market traction which, as can be seen in this update, our companies are enjoying.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\"However, I recognise that the value that is being created is more visible with some of our companies than others. Wyld Networks, now being a publicly quoted company has a value that can be constantly seen, and we are delighted that the value of Tern's holding has more than doubled in the past six months. We expect more to come from Wyld, and we expect that the public listing will provide an exit route over time, when the time is right to maximise value for Tern.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\"With our other companies, we are also constantly evaluating the appropriateness of IPOs as well as trade sales on a case-by-case basis, recognising that getting the timing right is key to delivering shareholder value. Importantly, whilst building our companies to the stage where these events will deliver appropriate value, we are always seeking to have increases in value validated by third parties investing alongside Tern, with some significant step ups in value being sought along the journey.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\"The recent fund raises by Konektio and Talking Medicines are two such events, demonstrating how value can be significantly increased in a short time period. The valuation of Tern's holding in Konektio implied by its December 2021 fund raise price represents an approximate 44% uplift to the amount invested by Tern to date. With Talking Medicines, the valuation implied by its January 2022 fund raise is a 62% uplift to the amount originally invested by Tern. Both of these companies are also now fully funded for their current growth plans.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>\"With Device Authority, some have expressed disappointment with the valuation achieved in December 2021 for the Venafi strategic investment, with it representing only a modest uplift to the previous book value of Tern's holding. However, it must be recognised that this was a complicated transaction that was designed to achieve specific goals and was fundamentally different to an exit valuation. It enabled a very important partner to take a strategic stake in Device Authority, Tern to maintain a majority ownership position and provided Device Authority with sufficient capital for 2022, given its growth plans, removing the dependence on Tern.</span>\n</span>\n<span>\n<span>Building a company of sustainable value is a journey that demands courage to make difficult and sometimes unpopular decisions.</span>\n</span>\n<span>\n<span>I do not believe that we should shy away from taking these steps to enhance the underlying value of our portfolio companies if we are to remain true to the goal of maximising the value that we strongly believe can be delivered for Tern's shareholders.</span>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\"I fundamentally believe that the companies we have within the Tern portfolio all have very exciting futures ahead of them and 2022 will be a year of further significant progress.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Portfolio Update</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Device Authority Limited</span>\n</span>\n<span>(\"DA\" or \"Device Authority\")</span>\n</p>\n<p>\n<span>Holding: 53.8%</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Device Authority,</span>\n<span>\n<span>a global leader in identity and access management (\"IAM\") for the IoT, has continued its positive business momentum following the strategic investment from Venafi, announced on 2 December 2021, with the business being particularly focussed on growing its monthly recurring revenues through its subscription base and its modularised licence platform, KeyScaler®.</span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Particularly strong recent demand has come from the automotive sector, with the retail sector and the US Government, both as a customer and due the effects of its policy, also being strong recent contributors to growth. The executive order from US President Biden in May 2021 that tasked the National Telecommunications and Information Administration (NTIA) and the Commerce Department with defining the minimum elements of a SBOM (software bill of materials), considered critical to improving transparency and security in the software supply chain, continues to provide sales opportunities and leads for Device Authority.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>With the target of growing monthly recurring revenues, Device Authority has recently started selling KeyScaler® as a SaaS (software as a service) product, with initial customers on this model coming from the automotive, healthcare and retail sectors, enabling these customers to more rapidly onboard and scale in a secure, hosted cloud environment.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>In January 2022, Device Authority</span>\n<span>entered into a partnership with Trusted Objects, a leading player in cybersecurity technologies for embedded systems and cloud device management platforms, to integrate Trusted Object's 'TO-protect' software root-of-trust (\"RoT\") and Device Authority's KeyScaler</span>\n<span>®</span>\n<span>. In 2021 Trusted Objects joined the 'KeyScaler Ready' programme, which enabled both companies to work closely together to provide a combined solution for IoT Edge devices.</span>\n<span>Integrating TO-protect with KeyScaler® enables full end-to-end security life cycle management from Edge to Enterprise into IoT cloud applications such as Microsoft Azure, Avnet IoTConnect, AWS, Ericsson, PTC ThingWorx and Google. Utilising a software RoT in IoT deployments meets the needs for robust device security, at the same time as providing scalability to meet the needs of new and legacy device deployments. This software model is being used by distributors such as Avnet, who can provide device software \"stock-keeping units\" or \"SKUs\" for Original Equipment Manufacturers and enable security lifecycle management into its platform.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Device Authority has also continued to further develop its products and recently launched a new release of</span>\n<span>KeyScaler</span>\n<span>®</span>\n<span>Edge, amongst other product enhancements.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Wyld Networks AB</span>\n</span>\n<span>\n<span>(publ)</span>\n</span>\n<span>(\"Wyld Networks\" or \"Wyld\")</span>\n</p>\n<p>\n<span>Holding: 58.7%</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Wyld Networks has continued to perform strongly since the admission to trading of Wyld's shares on the NASDAQ First North Growth Market (\"NASDAQ First North\") in Stockholm on 2 July 2021. Since 2 July 2021, the Wyld Networks share price has risen from SEK11 to SEK 24.2 as at the close of business on 10 February 2021, valuing the Tern holding at approximately £9.3 million. To date Tern has invested approximately £1.75 million in Wyld Networks.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>In recent months Wyld Networks has continued its</span>\n<span>focus on the development of Wyld Connect (a satellite IoT terminal and module) and Wyld Fusion (a provisioning and payment platform). In particular, Wyld has completed the hardware development of Wyld Connect, the world's first Long Range-Frequency Hopping Spread Spectrum (LR-FHSS) sensor-to-satellite modem, to enable satellites to connect to devices/sectors across remote areas around the globe. Wyld is also continuing with the development of Wyld Fusion in preparation for the commercial launch of Wyld's end-to-end satellite IoT solution, planned for later this year.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Additional personnel, both technical and commercial, have been recruited, including a recently appointed sales manager in Brazil to support the South American region and a global Head of Sales and Marketing to support all of Wyld's commercial activities.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Wyld Networks have recently started to sign agreements with customers in new market areas, outside of the previous focus on energy and agriculture with customers such as Chevron and Bayer, as well as with system integrators such as Fujitsu and Wezen. Recently, Wyld signed has also signed agreements with some of the world's largest terrestrial LoRaWAN® IoT operators including American Tower and Senet.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Wyld Networks, together with Eutelsat Communications, Senet Inc and TrakAssure, is a founder member of the Multimodal IoT Infrastructure Consortium™ (\"MMIIC\"). The consortium was set up to bring integrated and interoperable terrestrial and satellite LoRaWAN® IoT connectivity to customers across the globe, as announced by Wyld Networks and Tern on 11 January 2022. Additional partnerships recently signed ahead of the commercial launch include agreements with the Navigator Group in Russia, AgriSound in the UK and Treevia in Brazil.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Additionally, Wyld Networks joined the LoRa Alliance®, the global association of companies backing the open LoRaWAN® standard* for the IoT in November 2021. In December 2021, LoRaWAN® was officially approved as a standard by the International Telecommunication Union, the United Nations specialised agency for information and communication technologies. The LoRa Alliance® also provides a platform for Wyld to showcase its technology to over 500 member companies.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>*The LoRaWAN® specification, developed and maintained by the LoRa Alliance®, is a Low Power, Wide Area networking protocol designed to wirelessly connect battery operated 'things' to the internet in regional, national or global networks, and targets key IoT requirements such as bi-directional communication, end-to-end security, mobility and localisation services.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>FVRVS Limited</span>\n</span>\n<span>(\"FundamentalVR\")</span>\n</p>\n<p>\n<span>Holding: 26.9%, plus convertible loan of £530,000</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>FundamentalVR delivers virtual reality (\"VR\") haptic 'flight simulators' for surgery creating a safe, measurable and repeatable space to refine skills. FundamentalVR's goal is to transform the way surgeons prepare, practice, and refine their skills. It has built an immersive, surgical simulation application platform, Fundamental Surgery, to provide medical professionals with the opportunity to rehearse, practice, and test themselves within a safe, controllable space that is as close to real-life as possible.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>FundamentalVR has continued to enter into further significant contracts in recent months including:</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>A contract in the area of interventional medicine, a strategically important area for FundamentalVR, where they have secured an important contract from a new client to create a simulation platform in an area that can directly benefit from the fidelity and realism of the FundamentalVR platform. The contract is valued at £0.6 million over four years.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>A new contract in another strategically important area with a new client within the fast-moving Robotics Assisted Surgical Systems (\"RASS\") sector. This long-term contract to create a simulated 'digital twin' is valued at £1 million over four years.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>A contract from a new client to create a virtual education facility. The client is a major US medical institution with a globally renowned virtual hospital and hands-on clinical training facility. The initial contract is valued at approximately £0.3 million.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>InVMA Limited</span>\n</span>\n<span>(trading as \"Konektio\")</span>\n</p>\n<p>\n<span>Holding: 36.8%</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Following the £2.125 million equity fund raise by Konektio, announced on 20 December 2021, the business has continued to see strong demand for its Industrial IoT connected asset software as a service (SaaS) product, AssetMinder®. In particular, this has been from customers who are looking to connect their assets to AssetMinder® as Covid-19 has accelerated the need and demand for contactless monitoring of factory and remote assets. Konektio has a strong sales pipeline and is continuing to build its recurring revenue base, particularly via its expansion into Europe and North America.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Konektio has recently appointed Dr Ron Black as its Non-Executive Chairman, <span>succeeding Sarah Payne, Chief Financial Officer of Tern, who remains a Non-Executive Director of Konektio (InVMA Limited). Dr Black, who has recently taken on the role of CEO at Codasip, <span>a leading supplier of processing solutions for integrated circuit designers, brings with him a wealth of technology, innovation, and global business scale-up experience, through his previous roles which have included CEO of Imagination Technologies and CEO of Rambus.</span>\n</span>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Talking Medicines Limited</span>\n</span>\n<span>(\"Talking Medicines\")</span>\n</p>\n<p>\n<span>Holding: 23.8%</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Talking Medicines is a data technology company using Artificial Intelligence, Natural Language Processing and Machine Learning as social listening technologies to give patients a voice. Following the £1.59 million Talking Medicines syndicated fund raise announced on 1 February 2022, Talking Medicines is focussing on expanding the subscription base and resulting recurring revenue stream from major pharmaceutical brand teams and pharma marketing agencies for its next generation data platform,</span>\n<span>PatientMetRx® <span>. Its near-term expansion plans, utilising part of the proceeds from the recent fund raise, include recruiting a US-based sales team to be run from Talking Medicines' recently established office in New Jersey.</span>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Enquiries</span>\n</p>\n<p>\n<span>\n</span></p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>Tern Plc</span>\n</p>\n<p>\n<span>Al Sisto (CEO)</span>\n</p>\n<p>\n<span>Sarah Payne (CFO)</span>\n</p>\n</td>\n<td>\n<p>\n<span>via IFC Advisory</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\n</span></p>\n<p>\n<span>Allenby Capital Limited</span>\n</p>\n<p>\n<span>(Nominated Adviser and Broker)</span>\n</p>\n<p>\n<span>David Worlidge / Alex Brearley (Corporate Finance)</span>\n</p>\n<p>\n<span>Matt Butlin / Kelly Gardiner (Sales and Corporate Broking)</span>\n</p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n<p>\n<span>Tel: 0203 328 5656</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\n</span></p>\n<p>\n<span>IFC Advisory</span>\n</p>\n<p>\n<span>(Financial PR and IR)</span>\n</p>\n<p>\n<span>Tim Metcalfe</span>\n</p>\n<p>\n<span>Graham Herring</span>\n</p>\n<p>\n<span>Florence Chandler</span>\n</p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n<p>\n<span>Tel: 0203 934 6630</span>\n</p>\n<p>\n<span>\n<a href=\"mailto:tern@investor-focus.co.uk\" data-type=\"email\" translate=\"no\">tern@investor-focus.co.uk</a>\n</span>\n<span>\n</span></p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>PFUFIFFIFTILLIF</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}