{"date": "2021-12-14 14:16:48.065000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>NEW YORK, Dec.  14, 2021  (GLOBE NEWSWIRE) -- Nexus Energy Services, Inc. - DRYWORLD (OTC Pink: IBGR) is pleased to announce the launch of D’s Brand Store today on Amazon<b><br/></b></p><p><b><u>To Amazon and Beyond</u></b></p><p>Another major milestone in the Brand fulfilling its “commitment to global fulfilment” is the continued implementation of DRYWORLD’s eCommerce strategy in the launch of our dedicated <a href=\"https://www.globenewswire.com/Tracker?data=CzEz3tAoAepXM3rbtM7JLItxPWhWpMTL2N-awTIOzYhSim7N1G7G7Ilym8QNU6IkIgfdCYnltViXdp93N6KZ4d6c8mSiUxM_Mip4SQTJcp7FYtJ6nOa1-IY95A6PdqdEKR1AyjXOnSut07np77vrrQ==\"><u>Amazon Brand Store</u></a>.</p><p>Amazon receives over 2 billion website visitors each month and is expected to have close to 50% of the eCommerce market in the US by the end of 2021.</p><p>\"With an estimated 300 million users worldwide, 172 million people buying on Amazon in the US, 150 million mobile users and 89% of buyers agreeing that they are more likely to buy products from Amazon than other eComm sites, we see the 12 Amazon marketplaces as a key part of our earning potential going forward.” Said McKenzie of DRYWORLD. </p><p>With the US open, we will now work to open Amazon marketplaces in the following regions:</p><ul class=\"bulleted-list arrowlist\"><li>Canada</li><li>Mexico</li><li>UK</li><li>Europe</li><li>Australia</li><li>Japan</li><li>India</li><li>UAE</li><li>Singapore</li><li>Saudi Arabia</li><li>Egypt</li></ul><p>Kicking off with our carefully curated CoreD Pro Collection made for the athlete in all of us. Followed closely by the release of HauteD by DK, FreeD, and the coveted Signature D collections DRYFEET, AGGRESSION APPAREL and LUXSAUNA.  Available online exclusively through our <a href=\"https://www.globenewswire.com/Tracker?data=CzEz3tAoAepXM3rbtM7JLDN6E6bv7N6Niwny7t5LMri466Z_Tx5IlLQztv7LricRz_D5KeqQ6nNzWAez9OZ6cbWNo5rAa5weH_IOYsCuCd869YO-6YrLdetTHw0mY_dZRu6O2Y4mx0BJ0wzYUncp-A==\"><u>Amazon Brand Store</u></a></p><p><b><u>CoreD Pro</u></b><br/>The capsule collection for athletes. Core pieces that everyone needs in their athletic wardrobe. We’ve reconstructed 9 classic athletic silhouettes with an unparalleled attention to detail in material selection, fit, branding, and seam construction. Offering a full size range from boys and girls youth smalls up to men’s and women’s adult 2XL. The initial drop includes a Singlet, Sleeveless, T-shirt, Shorts, Sweatshirt, Pullover Hoodie, and Tracksuit, Sports Bra and Legging with a Zip Hoodie coming in 2022 to round out the collection. Available in black and baby blue for girls and women, and black and royal blue for boys and men. Nine pieces later you’ve got the perfect athletes capsule wardrobe. <a href=\"https://www.globenewswire.com/Tracker?data=W9wojuOfKN3AGoDdLpshLPf731jX6cVGdrvRTG52WGPaeyC2S1LrGoKUNjtzxBLGGAbCkDO--5tiXgl5hylvly61rydLEyfdu-iwG7BkKFoA55rsuoTJ4HtiJfAboohhlY7sOwcFVJXJceEAWP6gkg==\"><u>Shop Amazon Now</u></a>!</p><p>Check out our <span>WANNA GET FIT? GOTTA DO HIT.</span> campaign on Insta, Twitter, and FB for special offers and chances to win our next drop of CoreD Pro kit! Send us a HIT video of you working out in the CoreD Pro Collection, we’ll put together a brand video to release across all of our platforms and reward the video contributors with an advance selection of our next CoreD Pro drop.</p><p>See below for shop drops coming soon:</p><p><b><u>HauteD</u></b><br/>Trendsetting athletic apparel that pushes the boundaries of performance and fashion. Hand sewn with unparalleled attention to detail and performance. Made from high quality, often unusual fabrics. This guest designer collection featuring Darya Klishina takes our HauteD line into the stratosphere. Smooth clean lines, perfect tailored fit, soft soothing colours and classic understated branding represents Dasha to a T. The collection is comprised of 19 styles and includes sports bras, tank tops, tee’s, sweatshirts, and leggings. Everything you need to keep fit and have fun. Inspired and co-designed by the Olympic athlete with an indomitable will and unrelenting drive for excellence, HauteD DK is athletic apparel at it’s finest.  Stay tuned for announcements, <a href=\"https://www.globenewswire.com/Tracker?data=wRtq7g-MvU1yjY5AqdncfbJ1h8h60E3QaO2g7qIRmCKqVV1E7GU6nzQI2WqcLXOrJZorgs2lFEr20ht7kBZ0UJUrZcCTkTzHte0l68uY0Qg=\"><u>sign up here for updates!</u></a></p><p><b><u>FreeD</u></b><br/>For those who just love the brand and want to rock it, we understand. We’ve created a fun selection of cotton blended T’s, Hoodies, Caps, and more. Also, keep an eye out for limited edition runs dropping through our new blog series, Power of One. Stay tuned for announcements, <a href=\"https://www.globenewswire.com/Tracker?data=wRtq7g-MvU1yjY5AqdncfbJ1h8h60E3QaO2g7qIRmCI4ajQnRZjU2PAJ1sPN5TttYrC9E4xOEUt7lHGiey78-9skAuC-Q3BZJtssWfXvqYU=\"><u>sign up here for updates!</u></a></p><p><b><u>SignatureD</u></b><br/>You won’t want to miss our DRYWORLD signature innovations: DRYFEET, AGGRESSION Apparel, LUXSAUNA and THERMALITE made of our revolutionary BIOSKYN material. Performance products with a fresh perspective on what athletes need to perform at the highest level. Stay tuned for announcements, <a href=\"https://www.globenewswire.com/Tracker?data=wRtq7g-MvU1yjY5AqdncfbJ1h8h60E3QaO2g7qIRmCLzt_lk0buUQWwKsq3PG2sTtpAl6CUpVHqzCmd5CCdqJA1sAnBhWcWG4e1H5fBQHLI=\"><u>sign up here for updates!</u></a></p><p>Stay tuned for more shop drops!</p><p><a href=\"https://www.globenewswire.com/Tracker?data=18e8thUv2LZEn7g7nMSnlskECa64buvgVskCJz2QuGjh8Lx8aNjeK6NTMPQ5qfGpPvlEmM7mOTkNz5TS_KgD6VRe4pahy2ZXhSb0NN1zLB1RNS-P70OOzmpzPuC3xlAm3p0wxvZe3VUQguRoXy0Y9XKfQ2rFHJuiBInL9AuJ6IY=\"><u>Shop CoreD on Amazon Now!</u></a></p><p><a href=\"https://www.globenewswire.com/Tracker?data=gBeJjauKZZXmaImsogtAyvaHIfhahG610xeEeCjr1ZvmwftcT6K3VizneMiTORFTGXuD0mGrxzWFO7vGXoYInsDNq93MyJedT_wlbZuw8li8b8HGfWdWug5gvH3xWuTt\"><u>DRYWORLD Instagram</u></a><br/><a href=\"https://www.globenewswire.com/Tracker?data=gBeJjauKZZXmaImsogtAyjwLIygjZ2WOqYUZ5exohDepKHEumi_jm47yb7-ieJ4jUZcj1L0jAjYJI8LY2H2fA8WIE0dRN0K2oZAsvlmIXn0=\"><u>DRYWORLD Facebook</u></a><br/><a href=\"https://www.globenewswire.com/Tracker?data=gBeJjauKZZXmaImsogtAyk2PTg_N3FU__ck8-lys6wJfjB-Ad2FU5O-T_xe5aIeTGzLH7je0_mSSbkm195_-mnlvNwG4ILCGSuqp49nXOjc=\"><u>DRYWORLD Twitter</u></a></p><p>Contact:</p><p><a href=\"https://www.globenewswire.com/Tracker?data=_pNero3ifyoJOT5fYWG3gDyiyRqUp0yHCBftDh36SVjavY2ozVOhhzxJbu0eTle9I2QIHpZ4RhPLgi3cPG3CQCwwHfPoyfFfoaNkunVyHz0=\"><u>info@thedryworld.com</u></a> <br/><a href=\"https://www.globenewswire.com/Tracker?data=C4_Ivq33PgtcPR-3hTXDONOe47ZG2N_Kq5pzIr-dbxARMpq0q8VXjOhh48JWD7Fl0Re-KUb2mntlAktdvGB8qGIZv8Db_QylA9w1V70c5MA=\"><u>www.thedryworld.com</u></a></p><p><b>ABOUT DRYWORLD</b></p><p>DRYWORLD is a premium performance sports brand offering innovative, superior quality apparel and gear for the athlete in all of us. We build purpose-driven products that give all athletes the edge. Engineered by athletes, proven by science.</p><p><b>Safe Harbor for Forward Looking Statements</b><b> </b></p><p>This press release contains forward-looking statements and is subject to risks and uncertainties. All statements other than statements of historical fact or relating to present facts or current conditions included in this press release are forward-looking statements. Forward-looking statements give our current reasonable expectations and projections relating to our financial condition, results of operations, plans, objectives, future performance and business. You can identify forward-looking statements by the fact that they do not relate strictly to historical or current facts. These statements may include words such as \"anticipate,\" \"estimate,\" \"expect,\" \"project,\" \"plan,\" \"intend,\" \"believe,\" \"may,\" \"should,\" \"can have,\" \"likely\" and other words and terms of similar meaning in connection with any discussion of the timing or nature of future operating or financial performance or other events.<br/>The forward-looking statements contained in this press release are based on reasonable assumptions we have made in light of our industry experience, perceptions of historical trends, current conditions, expected future developments and other factors we believe are appropriate under the circumstances. As you read and consider this press release you should understand that these statements are not guarantees of performance or results. They involve risks, uncertainties (many of which are beyond our control) and assumptions. Although we believe that these forward-looking statements are based on reasonable assumptions, you should be aware that many factors could affect our actual operating and financial performance and cause our performance to differ materially from the performance anticipated in the forward-looking statements. Should one or more of these risks or uncertainties materialize, or should any of these assumptions prove incorrect or change, our actual operating and financial performance may vary in material respects from the performance projected in these forward-looking statements.<br/>Any forward-looking statement made by us in this press release speaks only as of the date of this press release. Factors or events that could cause our actual operating and financial performance to differ may emerge from time to time, and it is not possible for us to predict all of them. We undertake no obligation to update any forward-looking statement, whether as a result of new information, future developments or otherwise.</p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODQxMTU2NiM0NjEzMTc0IzUwMDA4MjEwOQ==\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RReE1UVTJOaU0wTmpFek1UYzBJelV3TURBNE1qRXdPUT09&amp;key=a17864d495b96076779255cb0fe3495bedbd7cdb30cb400cbdf6643f0b2b2b80e95e3c8270cd78a8881f8616a02a7fab8aa8679b215456e92e19cbc31624df94\"/></div></div><br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/NDg3MmMxMzUtMjhiNi00ZWQ2LTg3ZDctYTRiYjZlOGY2M2Q1LTUwMDA4MjEwOQ==/tiny/Nexus-Energy-Services-Inc-.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9ORGczTW1NeE16VXRNamhpTmkwMFpXUTJMVGczWkRjdFlUUmlZalpsT0dZMk0yUTFMVFV3TURBNE1qRXdPUT09L3RpbnkvTmV4dXMtRW5lcmd5LVNlcnZpY2VzLUluYy0ucG5n&amp;key=294017d705a23c5976a66c664068570aca091bc4ea386e29189077b2add1f66cd1cccdff1295828af64aa9a60dc4e252e93bf9d250edf97ef30041fae18d8397\"/></div></div><p><a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/86953029-ea1c-4dfd-af25-877e15198779\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Primary Logo\" border=\"0\" src=\"https://ml.globenewswire.com/media/86953029-ea1c-4dfd-af25-877e15198779/small/dryworld-logo-december-14-2021-png.png\" style=\"max-height:59px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS84Njk1MzAyOS1lYTFjLTRkZmQtYWYyNS04NzdlMTUxOTg3Nzkvc21hbGwvZHJ5d29ybGQtbG9nby1kZWNlbWJlci0xNC0yMDIxLXBuZy5wbmc=&amp;key=8c8fedfda44637b25af509a033fad83ef1ec85b1fa9ad7a0042fec6fe74eb5c9d252dd755e725f5355450676f8e41f108ec8b903614bcb8b7932113192f17028\"/></div></div></a></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">GlobeNewswire, Inc. 2021</p></div>"}