{"date": "2021-04-01 12:03:14.725000+00:00", "ticker": "AAF", "mrkt_info": {"open": 79.7, "close": 81.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>MUMBAI</p></div><div class=\"tr-npp-lead\"><p>MUMBAI, April 1 -- Bharti Airtel shares have fallen nearly 15% from their early February highs, and now trade at Rs521 a piece. During the same time, the Nifty 100 index has risen marginally. Analysts say while the delay in the much-hoped-for tariff hikes remains a problem, institutional investors are also unhappy with some of the firm's recent deals in the private capital markets.</p><p>In February, the company said it will buy the 20% it does not already own in its direct-to-home (DTH) business in a cash-and-stock deal with a private equity (PE) firm. About two months before that, Airtel decided to increase its stake in Indus Towers Ltd. \"Institutional investors are getting wary of the company's capital allocation priorities. They see the telco operations as the core business, and the recent investments are non-core distractions, especially in segments such as DTH which are in decline,\" said an analyst at a domestic institutional brokerage requesting anonymity.</p></div><div class=\"tr-npp-body\"><p>Also Read | Inside Mumbai's new extortion economy</p><p>Airtel had sold shares in its DTH venture to Warburg Pincus to increase cash levels three years ago. And investors were expecting it to cut exposure to the tower infrastructure business. The two deals, therefore, came as a surprise.</p><p>A recent stake sale deal by Airtel Africa in its mobile money operations has also brought back memories of past deals with private equity firms that cost the firm dearly. In mid-March, the company said it raised $200 million by selling a stake in its money business to private equity firm TPG ahead of a planned initial public offering (IPO). The transaction gives TPG the right to sell the stock back to Airtel Africa or its affiliates, if there is no IPO within four years of the deal, or if there is change in control of the firm without TPG's prior approval. While there is no minimum return guarantee, TPG can get as much as $400 million depending on an independent valuation, if and when the stake is sold back.</p><p>Ahead of the Airtel Africa IPO in 2019, investors who bought shares worth $1.45 billion were given certain indemnities. Eventually, the company paid out roughly $580 million to these investors, after the company shares fell drastically post-listing. \"This left a bad taste in the mouths of investors, then, as the payouts on account of the indemnities were extremely high compared to the amounts raised in the pre-IPO fundraising,\" says the analyst mentioned above.</p><p>Airtel Africa shares continue to trade at far lower levels compared to the pre-IPO share placements, despite a continued improvement in its financials in recent years. Of course, this is not to say that the experience with the mobile money stake sale will be similar, although 'once bitten' investors are understandably cautious. The larger concern, as pointed earlier, is the company's sudden interest in deploying capital in non-core areas. And in the absence of tariff hikes, buying interest for the stock is taking a backseat as well. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}