{"date": "2021-12-06 15:32:09.067000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>TOMI ENVIRONMENTAL SOLUTIONS INC (\"TOMZ-Q\")\n- Launches SteraMist Amazon Store featuring the SteraPak\n- SteraPak Leading Disinfection System for All Industries\n\n     TOMI Environmental Solutions, Inc.(R) (\"TOMI\") is a global company\nspecializing in disinfection and decontamination, utilizing its premier\nBinary Ionization Technology (BIT) platform through its SteraMist products\n- a hydrogen peroxide-based mist and fog composed of ionized Hydrogen\nPeroxide (iHP). TOMI has launched the SteraMist Amazon Store which includes\nthe SteraPak and our BIT solution.\n\n     The Amazon digital storefront expands our sales channels which allows\nTOMI to optimize and streamline the buying process for our customers. The\nlaunching of the SteraMist Amazon Store with the recent launch of our\nSteraPak has generated significant interest in the commercial space.\nEase-of-purchase remains a critical aspect of our target market and listing\non Amazon will allow us to distribute the SteraPak on a larger scale. The\nSteraPak is the leading mechanical disinfection system for any area,\nincluding residential homes, commercial buildings, sport venues,\nautomobiles, cruise ships and much more.\n\n     The SteraPak utilizes our SteraMist ionized Hydrogen Peroxide (iHP)\ndisinfection technology, offering a powerful disinfectant that is quick,\nnon-corrosive, and easy-to-use due to no need for mixing, wiping, rinsing.\nUnlike many competitors, SteraMist does not leave behind residues or toxic\nbyproducts when compared to other harsh chemicals.\n\n     To preview go to;\n<a href=\"https://www.amazon.com/stores/page/5C60199C-E351-4318-828A-2CC5A5ACA241?ing\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.amazon.com/stores/page/5C60199C-E351-4318-828A-2CC5A5ACA241?ing</a>\nress=0&amp;visitId=43b3197e-e077-4f52-8287-ba73c4fcac78\n\n     Dr. Halden Shane, CEO of TOMI, states, \"TOMI continually looks for\ninnovative avenues to deploy SteraMist throughout the world. Creating a\nSteraMist Amazon store and listing the SteraPak will expand our customer\nbase and outreach as well as increase brand awareness. As new pathogens\nemerge, including the new variant of SARS CoV-2 Omicron and the deadly C.\nauris fungus, continue to spread around the world, disinfection is deemed\ncritical and SteraMist is here to stop the spread.\"\n\n     TOMI(TM) Environmental Solutions, Inc.: Innovating for a safer\nworld(R)\n\n     TOMI(TM) Environmental Solutions, Inc. (NASDAQ:TOMZ) is a global\ndecontamination and infection prevention company, providing environmental\nsolutions for indoor surface disinfection through the manufacturing, sales\nand licensing of its premier Binary Ionization Technology(R) (BIT(TM))\nplatform. Invented under a defense grant in association with the Defense\nAdvanced Research Projects Agency (DARPA) of the U.S. Department of\nDefense, BIT(TM) solution utilizes a low percentage Hydrogen Peroxide as\nits only active ingredient to produce a fog of ionized Hydrogen Peroxide\n(iHP(TM)). Represented by the SteraMist(R) brand of products, iHP(TM)\nproduces a germ-killing aerosol that works like a visual non-caustic gas.\n\n     TOMI products are designed to service a broad spectrum of commercial\nstructures, including, but not limited to, hospitals and medical\nfacilities, cruise ships, office buildings, hotel and motel rooms, schools,\nrestaurants, meat and produce processing facilities, military barracks,\npolice and fire departments, and athletic facilities. TOMI products and\nservices have also been used in single-family homes and multi-unit\nresidences.\n\n     TOMI develops training programs and application protocols for its\nclients and is a member in good standing with The American Biological\nSafety Association, The American Association of Tissue Banks, Association\nfor Professionals in Infection Control and Epidemiology, Society for\nHealthcare Epidemiology of America, America Seed Trade Association, and The\nRestoration Industry Association.\n\n     For additional information, please visit <a href=\"http://www.tomimist.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.tomimist.com</a>/ or\ncontact us at info@tomimist.com.\n     Safe Harbor Statement under the Private Securities Litigation Reform\nAct of 1995\n\n     This press release contain forward-looking statements that are based\non current expectations, estimates, forecasts and projections of future\nperformance based on management's judgment, beliefs, current trends, and\nanticipated product performance. These forward-looking statements include,\nwithout limitation, statements relating to SteraMist Amazon store.\nForward-looking statements involve risks and uncertainties that may cause\nactual results to differ materially from those contained in the\nforward-looking statements. These factors include, but are not limited to,\nthe impact of COVID-19 pandemic on our business and customers; our ability\nto maintain and manage growth and generate sales, our reliance on a single\nor a few products for a majority of revenues; the general business and\neconomic conditions; and other risks as described in our SEC filings,\nincluding our Annual Report on Form 10-K for the fiscal year ended December\n31, 2020 filed by us with the SEC and other periodic reports we filed with\nthe SEC. The information provided in this document is based upon the facts\nand circumstances known at this time. Other unknown or unpredictable\nfactors or underlying assumptions subsequently proving to be incorrect\ncould cause actual results to differ materially from those in the\nforward-looking statements. Although we believe that the expectations\nreflected in the forward-looking statements are reasonable, we cannot\nguarantee future results, level of activity, performance, or achievements.\nYou should not place undue reliance on these forward-looking statements.\nAll information provided in this press release is as of today's date,\nunless otherwise stated, and we undertake no duty to update such\ninformation, except as required under applicable law.\n\n     INVESTOR RELATIONS CONTACT\nJohn Nesbett/Jennifer Belodeau\nIMS Investor Relations\njnesbett@imsinvestorrelations.com\n\nTel   : 800-525-1698    TOMI ENVIRONMENTAL SOLUTIONS INC\nFax   : 412-766-7878\nWWW   : <a href=\"https://www.tomimist.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.tomimist.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133900406.MNPRE2133901750-07300420211206</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}