{"date": "2021-12-01 19:56:22.443000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Accenture Announces Extended Relationship with AWS and Joint Investments to Help Organizations Get to Cloud Value Faster</b>\n</p><p class=\"bwalignc\">\nNew accelerators will harness the power of the Cloud Continuum — from public to edge and everything in between — taking companies further, faster in an era of compressed transformation\n</p><p>\nAccenture (NYSE: ACN) today announced the renewal of its joint business group with Amazon Web Services, Inc. (AWS). Building on a 13-year relationship, Accenture and AWS will make an additional joint investment over the next five years to help clients spur innovation on the <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.accenture.com%2Fus-en%2Finsights%2Fcloud%2Fcloud-continuum&amp;esheet=52541782&amp;newsitemid=20211129005777&amp;lan=en-US&amp;anchor=Cloud+Continuum&amp;index=1&amp;md5=6ea43be45d76ae06685a1be2448a6322\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Cloud Continuum</a> and accelerate business value at scale by delivering solutions through the <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.accenture.com%2Fus-en%2Fservices%2Fcloud%2Faws-business-group&amp;esheet=52541782&amp;newsitemid=20211129005777&amp;lan=en-US&amp;anchor=Accenture+AWS+Business+Group+%28AABG%29&amp;index=2&amp;md5=7d2dff15c48a00402840e7e548d29dc9\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Accenture AWS Business Group (AABG)</a>.\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: <a href=\"https://www.businesswire.com/news/home/20211129005777/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211129005777/en/</a></p><div id=\"bwbodyimg\" style=\"width:251px;float:left;padding-left:0px;padding-right:20px;padding-top:0px;padding-bottom:0px\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Taking cloud transformation further, faster. (Graphic: Business Wire)\" src=\"https://mms.businesswire.com/media/20211129005777/en/931146/4/AABGReInvent.jpg\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbXMuYnVzaW5lc3N3aXJlLmNvbS9tZWRpYS8yMDIxMTEyOTAwNTc3Ny9lbi85MzExNDYvNC9BQUJHUmVJbnZlbnQuanBn&amp;key=8940f644bb7352874195ca17c6b323e7d4e6a74adacf85732d2de0e6b53f17640cad2c6787bc3ee858d3bb8831dcc2ae2141f75e0a2750fb2098dee548918671\"/></div></div><p style=\"font-size:85%\">Taking cloud transformation further, faster. (Graphic: Business Wire)</p></div><p>\nOn the heels of thousands of cloud projects, the extended AABG relationship announced today will help organizations address the technology, human and business dimensions of cloud change at scale with greater speed and certainty. Accenture’s investment with AWS brings timely resources for <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.accenture.com%2Fcloud&amp;esheet=52541782&amp;newsitemid=20211129005777&amp;lan=en-US&amp;anchor=Accenture+Cloud+First&amp;index=3&amp;md5=2f3592083e273778553754834d63fbe7\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Accenture Cloud First</a>, a multi-service group providing the full stack of cloud services created specifically to help clients become cloud-first businesses so they can accelerate their digital transformation, innovate faster and create differentiated, sustainable value.\n</p><p>\nOver the next five years, Accenture will develop a range of new accelerators to address the biggest challenges in cloud migrations with the goal of enabling AWS innovations to be adopted up to 50% faster. As part of this investment, Accenture will also continue to invest in data-driven solutions for talent development and organizational change, which are critical and often cited as a key barrier to realizing cloud value.\n</p><p>\nThe extended relationship will help clients achieve industry differentiation by tapping into the unparalleled AABG joint portfolio of 175 assets and 20,000 cloud specialists who hold 24,000 AWS certifications – making Accenture among the top systems integrators in the world with vast AWS resources. To date, Accenture and AWS have co-created nearly 40 solutions for 16 industries with proven use-case relevance in order to jumpstart client value.\n</p><p>\nIn today’s hyper-competitive era of compressed transformation, organizations must implement change under tremendous time pressure. For Generali Vitality, a subsidiary of one of the largest global insurance and asset management providers, their wellness business group needed to scale quickly to reach new customers. Working with Accenture and AWS to tap into cloud-native technology, Generali Vitality is now able to roll out new features at the push of a button to continuously improve their products and engage customers.\n</p><p>\n“We have successfully launched in multiple European markets and our user base is constantly growing. Part of this journey has been enabled by smart use of cloud native technology and Accenture’s outstanding software engineering capabilities,” said Simon Guest, CEO of Generali Vitality.\n</p><p>\n“We’ve learned through experience that our customers’ success often hinges on two key factors: speed and the ability to adopt new ways of working,” said Matt Garman, senior vice president of sales and marketing at AWS. “Our investment to create reusable accelerators and mechanisms with Accenture is intended to make cloud transformation and change programs easier and more predictable — so customers can continuously innovate and lead their industries.”\n</p><p>\n“On the Cloud Continuum, breakthrough innovations will continue at a rapid pace. Harnessing those innovations for competitive advantage will require a commitment to permanent reinvention,” said Karthik Narain, global lead of Accenture Cloud First. “Together, we’re investing with AWS to help companies prioritize and invest in people transformation as much as tech transformation, which yields an average of <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.accenture.com%2Fus-en%2Finsights%2Fconsulting%2Fcloud-workforce&amp;esheet=52541782&amp;newsitemid=20211129005777&amp;lan=en-US&amp;anchor=60%25+higher+cloud+return+on+investment&amp;index=4&amp;md5=3c2390ef4bf908e26bb7b599fe8c6533\" data-type=\"url\" class=\"tr-link\" translate=\"no\">60% higher cloud return on investment</a>.”\n</p><p>\nLaunched in 2015, the Accenture AWS Business Group combines the resources, technical capability and industry knowledge of Accenture and AWS to help enterprises unlock innovation, drive business value and support growth through cloud adoption and transformation. Accenture has been recognized by AWS with several awards, including 2021 AWS Global System Integrator (GSI) Partner of the Year for US.\n</p><p>\n<b>About Accenture\n<br/></b>Accenture is a global professional services company with leading capabilities in digital, cloud and security. Combining unmatched experience and specialized skills across more than 40 industries, we offer Strategy and Consulting, Interactive, Technology and Operations services—all powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. Our 624,000 people deliver on the promise of technology and human ingenuity every day, serving clients in more than 120 countries. We embrace the power of change to create value and shared success for our clients, people, shareholders, partners and communities. Visit us at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.accenture.com&amp;esheet=52541782&amp;newsitemid=20211129005777&amp;lan=en-US&amp;anchor=www.accenture.com&amp;index=5&amp;md5=b9e7f0bae35e58e3d652d4746bc3d087\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.accenture.com</a>.\n</p><p><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211129005777/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211129005777/en/</a></span></p><p>\nMylissa Tsai\n<br/>Accenture\n<br/>+1 917 452 9729\n<br/><a href=\"mailto:mylissa.tsai@accenture.com\" data-type=\"email\" translate=\"no\">mylissa.tsai@accenture.com</a>\n</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NV-ACCENTURE</p></div>"}