{"date": "2022-02-08 16:00:00.501000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p align=\"left\">SAN ANTONIO, Feb.  08, 2022  (GLOBE NEWSWIRE) -- <a href=\"https://www.globenewswire.com/Tracker?data=tfuKoNnoVmHhcCcH9lGqqHKrinaOEfHYPPchz5Gi-PyMbBo2df16XnlL7XWkeK82vhQavMzhCoxPf1v_LpkA2-WYOP7yXcArYXohKnWTjng=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Rackspace Technology</a><sup>®</sup> (NASDAQ: RXT), a leading end-to-end, multicloud technology solutions company, today announced its collaboration with VoltaGrid to deploy a secure, serverless cloud-native solution that leverages IoT, Machine Learning (ML) and Artificial Intelligence (AI) in AWS for its software-controlled and managed mobile electric microgrids.<br/></p>  <p>Founded in 2020, VoltaGrid is based in North America and deploys mobile microgrids to provide power in remote locations. The company is serving energy companies that need electricity to power the hydraulic fracturing processes used to extract oil and gas. VoltaGrid also provides energy-generation services to data centers, industrial facilities, and medical centers, and has the capability to add power to a city grid.</p>  <p>VoltaGrid’s microgrid solution consists of a natural gas fired reciprocating engine that sits on a 52-foot trailer weighing over 100,000 pounds. Ten trailers working together can generate an astonishing 26 megawatts of electricity at 13,500 volts.</p>  <p>VoltaGrid is committed to transforming the world through its best-in-class, clean, affordable, intelligent energy technologies and enabling their partners to focus on their core competencies while offering a practical avenue to improve their ESG performance.</p>  <p><strong><span>The Solution</span></strong></p>  <p>Rackspace Technology leveraged an agile workflow to deploy a secure, serverless cloud native solution in AWS for VoltaGrid’s software-controlled, cloud-native solution that leverages IoT, ML and AI for its managed mobile electric microgrids to optimize operations for VoltaGrid customers.</p>  <p>As part of the solution, an edge device, HiveCell, was fitted to each VoltaGrid managed mobile electric microgrid’s trailer which allowed software to be deployed at the edge. The IoT technology on the mobile trailers captures data and sends it to the cloud. The scalable, seamless solution was built to collect data that quantifies power usage and emissions output from the mobile trailers in real-time.</p>  <p>In addition, VoltaGrid worked with Onica by Rackspace Technology<sup>®</sup> to design and deploy an end-to-end cloud native solution that incorporated an edge device by leveraging ML and AI, to build a customer-facing portal. The VoltaGrid customer-facing portal, determines how data is ingested, stored, and refined and can monitor, measure and report on each customer’s power consumption, fuel costs and emissions in real-time at remote locations.</p>  <p>“The VoltaGrid project, including fitting the trailers with IoT technology, building the entire cloud infrastructure, and creating the application, was completed in less than a year,” said Jeff DeVerter, Chief Technology Evangelist at Rackspace Technology. “VoltaGrid was able to launch its service and enhance its product offering quicker than had been initially predicted, allowing VoltaGrid to sell mobile power services to customers more quickly.”</p>  <p>“VoltaGrid had to build the mobile electric microgrids solution fast and by working with Rackspace Technology we were able to quickly and easily access the expertise that was needed when we needed it,” said, John Chavner, Director, Technology and Cloud Development, VoltaGrid. “Rackspace Technology understood our entire AWS ecosystem from a business standpoint, and they helped us get off the ground and I'm very thankful for that.”</p>  <p>To learn more about the VoltaGrid’s Rackspace Technology solution click <a href=\"https://www.globenewswire.com/Tracker?data=31or-oxu_Att_wtCDZ3T8dYZjBuvWsvhdpHHSwvwRhHB7SdJL0sOGBBIB_BDcSviIqNsefVcQxmsVsLQE1qG6FPsQMoaujooPKEaGjFjylo=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a>.</p>  <p><strong>About Rackspace Technology</strong></p>  <p><a href=\"https://www.globenewswire.com/Tracker?data=tfuKoNnoVmHhcCcH9lGqqOEnMFnQzzpq9IGT4Yta6cYizLH_FTQXlU5CucGxZCelPw77HynrYBQeG_mmBsicMu94ATDo7uccrCZa6PqzGFo=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Rackspace Technology</a> is a leading end-to-end multicloud technology services company. We can design, build, and operate our customers’ cloud environments across all major technology platforms, irrespective of technology stack or deployment model. We partner with our customers at every stage of their cloud journey, enabling them to modernize applications, build new products and adopt innovative technologies.</p>  <p>Media Contact<br/>Natalie Silva<br/>Rackspace Technology Corporate Communications<br/><a href=\"https://www.globenewswire.com/Tracker?data=rd1Rk76H2_bkjXZUq-UqNOJVqmC56YlUv2JIFHaXN7u50FKUQSZ9ptNgZIyZedgrSVS1CYcYwRYfWuOtJLmV46nopK16pflteQIxYDsr_r3xH9dtfmJYum_YSosa30ru\" data-type=\"url\" class=\"tr-link\" translate=\"no\">publicrelations@rackspace.com</a></p> <div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODQ3MTQxMyM0NzE3MDEyIzIwMDU3MjQ=\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RRM01UUXhNeU0wTnpFM01ERXlJekl3TURVM01qUT0=&amp;key=71a13b685dcdde86c32f2dc443dd465aa1d4969dab6f47841855bfffbac81e6e3279b8a92c8659b758f42f887a1e94611096953d78d50611742661f623a067ee\"/></div></div> <br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/Mjc3Zjk3MWItYzhhYy00M2FmLTgyNjEtNmMyMjJmNGE0M2ZjLTEwMTcyOTc=/tiny/Rackspace-Technology-Inc-.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9NamMzWmprM01XSXRZemhoWXkwME0yRm1MVGd5TmpFdE5tTXlNakptTkdFME0yWmpMVEV3TVRjeU9UYz0vdGlueS9SYWNrc3BhY2UtVGVjaG5vbG9neS1JbmMtLnBuZw==&amp;key=c83ddea06442066c89ed841132c64c4850eb088c09f24c9eea1f93de6252f0b48f5e575b1943e38713f560e372285074f98f4ae9ba0b30e6d95af7133f54d76c\"/></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright GlobeNewswire, Inc. 2022</p></div>"}