{"date": "2021-12-06 23:18:18.748000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>A <a href=\"https://independent.co.uk/topic/TikTok\" data-type=\"url\" class=\"tr-link\" translate=\"no\">TikTok</a> user shared what appeared to be a screen turning Amazon warehouse work into a kind of game.</p><p>The <a href=\"https://www.tiktok.com/@chutuo/video/7035010571414195503?is_copy_url=1&amp;is_from_webapp=v1\" data-type=\"url\" class=\"tr-link\" translate=\"no\">video posted by @chutuo</a> , which has garnered almost two million views, shows what seems to be a screen in an Amazon warehouse listing possible \"achievements\".</p></div><div class=\"tr-npp-body\"><p>Other items on the list include \"punctual\" and \"picking up speed\". The item entitled \"make history\" urges workers to pick up one million products.</p><p>In a separate video posted on Sunday, <a href=\"https://www.tiktok.com/@couryeo/video/7037993050790038789\" data-type=\"url\" class=\"tr-link\" translate=\"no\">TikTok user @couryeo wrote</a> that working at Amazon was \"the worst job I've ever had\". The TikToker said she was \"overworked\" and \"underpaid\". She added that she was \"treated like a machine\" and that there was \"no socializing at all\".</p><p>\"Basically a prison [in my opinion],\" she wrote.</p><p>One of the top comments on the video showing the \"achievements\" screen was that it was an example of the \"gamification of underpaid work\".</p><p>\"Took the 'logging into play job simulator' trend to literal,\" @ron.in wrote.</p><p>\"Once you complete your weekly quests you get a 5-minute toilet break,\" user @scientificstallion added.</p><p><span>The Independent</span> couldn't independently verify the authenticity of the footage. We have reached out to Amazon for comment.</p><p>Amazon hired around half a million people during the last year, and now have more than 1.2 million staff members across the world. While that's an increase of more than 50 per cent compared to a year ago, the company is struggling with high turnover rates and a national labour shortage, <a href=\"http://go.redirectingat.com/?id=44681X1458326&amp;url=https%3A%2F%2Fwww.nytimes.com%2F2021%2F12%2F03%2Fpodcasts%2Famazon-labor-shortage.html&amp;sref=https://www.independent.co.uk/news/world/americas/amazon-game-board-warehouse-workers-tiktok-b1970534.html\"><span>The New York Times</span> reported.</a> </p><p>\"We have a substantial issue of tight labour markets in the United States right now that is manifesting itself from psychotherapists to gardeners and from investment analysts to fast-food workers,\" former Treasury Secretary Larry Summers said, according to the paper.</p><p>He said concerns about the pandemic, the rising age of the workforce, and changes in the workplace, with people rethinking their relationship to their jobs, were all possible reasons behind the shortage.</p><p>\"I think it is a source of wage inflation pressure and unless the Fed takes very substantial action, it is likely to be with us for quite some time,\" Mr Summers said, adding that it could take a \"few years\" for the labour market to regain its balance.</p><p>Boston University business professor Marshall Van Alstyne told the paper: \"We have to ask the question: Are they so big that they're exhausting the labour pool?\"</p><p>\"They're not,\" Mr Van Alstyne said, arguing that there are still workers the company could attract with good pay.</p><p>The Brookings Institution wrote in a 2019 <a href=\"https://www.brookings.edu/blog/education-plus-development/2019/12/19/the-economy-is-growing-and-leaving-low-wage-workers-behind/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">report</a> that around 44 per cent of American workers have low-paying jobs. At the time, that included about 53 million people with a median hourly pay of $10.22. The professor argued that Amazon can continue to attract workers from other industries in the short term because of the company's $15 starting wage.</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/independentpremium/business/amazon-unionisation-bessemer-alabama-b1967045.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon's nose bloodied by US union as battle of Bessemer set for rematch</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/amazon-union-election-alabama-bessemer-b1966503.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">US labour board calls for new union election at Amazon warehouse in Alabama</a> </p><p><a href=\"https://www.independent.co.uk/news/business/news/black-friday-amazon-injuries-gmb-b1964361.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Ambulance callouts to Amazon warehouses 'surge in run up to Black Friday', union claims</a> </p><p><a href=\"https://www.independent.co.uk/news/uk/home-news/boy-swallowed-magnets-tiktok-challenge-b1920659.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Schoolboy almost dies from swallowing magnets for TikTok challenge</a> </p><p><a href=\"https://www.independent.co.uk/life-style/upper-east-side-apartment-tiktok-b1920202.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Woman shares honest review of New York City apartment</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/tiktok-mom-backlash-son-run-b1919372.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">TikTok mom slammed after making 5-year-old son run in 104 degree heat</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Independent, The (UK) (Online). All rights reserved.</p></div>"}