{"date": "2022-02-04 13:30:21.860000+00:00", "ticker": "AAF", "mrkt_info": {"open": 160.0, "close": 155.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Feb. 4 -- Airtel Africa reported a net profit of $180 million on revenues of $1.22 billion in the quarter ended December for FY22, on the back of increase in average revenue per user (ARPU) and higher customer additions in Nigeria.</p><p>The Bharti Airtel subsidiary which was included in the FTSE 100 last month posted a profit after tax of $180 million, 54.4% higher than $116 million recorded in the same quarter of FY21. ARPU in the December 2021 quarter was $3.3, 12.8% higher on-year compared to $2.9. The total customer base has increased to 125.8 million from 118.9 million in the same period, up 5.8%. The number of data customers has risen sharper at 11.1% to 45.1 million from 40.6 million in the same period.</p></div><div class=\"tr-npp-body\"><p>\"Operationally we have continued to execute on our network and distribution expansion plans, driving continued strong growth in ARPUs across voice, data and mobile money,\" said chief executive officer Segun Ogunsanya.</p><p>He added that the company also saw further improvement in customer growth trends for the Group with Nigeria returning to strong customer growth after a period affected by the implementation of new 'know your customer' requirements, posting 1.9 million net additions in the third quarter, taking total Group customer additions to 3.1 million.</p><p>Ogunsanya added that in Nigeria, the company received in principle approval for both a payment service bank (mobile money) licence and a super-agent licence in Nigeria, which will enable expansion of digital financial products and increase reach to people that do not have access to traditional financial services.</p><p>\"We are now working closely with the Central Bank to meet all its conditions to receive the final operating licences and commence operations,\" he said.</p><p>A strong third quarter has contributed to nine-month financial performance across all key metrics.</p><p>Underlying EBITDA was $1,703 million, growing by 31.3% in reported currency with an EBITDA margin of 48.8%, an increase of 326 basis points led by both revenue growth and improved operational efficiencies. The company added that operating profit grew by 43.1% to $1,146m in reported currency, while profit after tax almost doubled to $514m as higher profit before tax more than offset associated tax charges.</p><p>The company has strengthened balance sheet, with leverage ratio at 1.4 times underlying EBITDA, owing to increases in operating cash flow delivery and to $550m of cash received from minority investments into mobile money business.</p><p>\"We will continue to invest in expanding and evolving our platform to further deepen both financial and digital inclusion across Africa,\" he said, adding that the company saw huge growth potential across voice, data and mobile money. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}