{"date": "2022-02-24 14:31:07.694000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Feb. 24 -- The Supreme Court on Wednesday fast-tracked proceedings before the National Company Law Appellate Tribunal (NCLAT) on the validity of a 2019 deal between Amazon.com Inc. and the Future Group which gave the American retail giant the right to buy into the latter's flagship Future Retail Ltd (FRL).</p><p>In December, the Competition Commission of India (CCI) suspended the clearance for the 2019 deal between Amazon and Future, holding that Amazon failed to notify it about certain crucial details of its acquisition as required under the law. The CCI also imposed a penalty of Rs.202 crore on Amazon, which has now challenged the decision before the NCLAT.</p></div><div class=\"tr-npp-body\"><p>On Wednesday, a bench headed by Chief Justice of India N.V. Ramana noted that the proceedings before the NCLAT require to be decided first before other ancillary issues can be taken up by either by the Supreme Court or the Delhi high court.</p><p>The bench, which also comprised justices A.S. Bopanna and Hima Kohli, was hearing an appeal by Amazon against the Delhi high court order that stayed ongoing arbitration proceedings against the Future Group related to the 2019 deal by an order dated 5 January.</p><p>\"The present special leave petition is one way connected to the outcome of the order passed by the NCLAT. Thus, we ask parties to approach the NCLAT and seek expeditious disposal of the case,\" stated the court in its order while adjourning the hearing for 9 March.</p><p>During the hearing, senior advocate Gopal Subramanium, appearing for Amazon submitted that completion of the arbitration proceedings would be the best course to move forward. But senior advocate Mukul Rohatgi, appearing for Future Coupons, pointed out that the clearance to the 2019 deal was the foundation of the whole relationship between Amazon and Future and therefore, the outcome of NCLAT proceedings on the validity of the agreement is the key.</p><p>The Future Group inked a deal with Amazon to sell 49% of its unlisted entity, Future Coupons, for more than Rs.1,500 Crore. The long-term business agreements handed to Amazon the right to buy into Future Retail after a period between three and 10 years, by exercising a \"call\" option. The deal provided Amazon the Right to First Refusal, and a non-compete clause-barring Future's dealings with potential competitors of Amazon, which included Reliance Industry Ltd, Walmart, Google, SoftBank, Alibaba, Naspers, eBay, Target, Paytm, Zomato, Swiggy, among others. It prohibited Future from selling stake to anyone engaged in online or offline retail in food, non-food and retail.</p><p>In November 2019, the CCI approved Amazon's proposed acquisition. However, Reliance entered the fray in May-June 2020 and entered into a new Rs.24,713 crore deal with the Future Group, buying its retail, wholesale, logistics and warehousing units. With control over India's retail business at stake, the entry of Reliance saw the beginning of a see-saw legal battle between Amazon and Future that has witnessed several challenges and decisions by judicial and quasi-judicial authorities in India ever since. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}