{"date": "2021-12-11 19:15:40.654000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3444.24, "close": 3381.83}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">New integrations with AWS Marketplace will simplify discoverability, subscription, onboarding, and management of MongoDB Atlas when running on AWS</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">NEW YORK, Nov. 30, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">NEW YORK</span>, <span class=\"xn-chron\">Nov. 30, 2021</span>  /PRNewswire/ --<b> </b><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3373594-1&amp;h=445300475&amp;u=https%3A%2F%2Fwww.mongodb.com%2F&amp;a=MongoDB%2C+Inc.\" data-type=\"url\" class=\"tr-link\" translate=\"no\">MongoDB, Inc.</a> (NASDAQ: MDB), the leading modern, general purpose database platform, today announced that it will make it easier for customers to build, scale, and manage data-rich applications with MongoDB Atlas in AWS Marketplace in calendar Q1 2022. With the launch of a pay-as-you-go MongoDB Atlas with Free Trial in AWS Marketplace, developers will have a simplified subscription experience, and enterprises will have another way to procure MongoDB in addition to privately negotiated offers already supported on AWS Marketplace. There will be no up-front commitments required to use MongoDB Atlas on AWS, and customers will pay only for the resources they use and scale based on their needs. MongoDB is also launching the capability for customers to buy MongoDB Professional Services in AWS Marketplace at AWS re:Invent, providing enterprises with one place to implement, configure, and run MongoDB workloads.</p>\n\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/384058/MongoDB_Logo.html\">\n                    <div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"MongoDB\" src=\"https://mma.prnewswire.com/media/384058/MongoDB_Logo.jpg\" title=\"MongoDB\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMzg0MDU4L01vbmdvREJfTG9nby5qcGc=&amp;key=c93798ce9658ca7b035adcf3368940dace3c2f80183b0796345ef0fbcc790931944284b1b0d6ccba276a3d2ac6b81271a5435f1c7ea4df00f9d016d294b1daa6\"/></div></div>\n                        </a>\n                </p>\n\n    </div>\n<p><u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3373594-1&amp;h=1219584482&amp;u=http%3A%2F%2Fwww.unqork.com%2F&amp;a=Unqork\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Unqork</a></u>, the leading enterprise no-code platform, built its business on MongoDB Atlas.</p>\n<p>\"I first started using MongoDB when I was a Fortune 50 CIO and continued to do so later in my career when I founded Unqork.  Atlas was my first choice for a data platform as it provided the performance benefits I needed to run my business. Unqork is an existing AWS Marketplace customer, and we are excited to now be able to subscribe to the new MongoDB SaaS solution through AWS Marketplace for simplified procurement, streamlined billing, and data governance,\" said <span class=\"xn-person\">Gary Hoberman</span>, founder and CEO, Unqork. </p>\n<p>\"MongoDB and its document model are deployed in many AWS and MongoDB customers' environments to increase developer productivity, decrease cost, and scale to meet the needs of high growth applications. This is why both rising startups and global enterprises from around the world, across multiple industries, have chosen MongoDB as the data foundation for their next generation, modern applications,\" said <span class=\"xn-person\">Alan Chhabra</span>, Executive Vice President of Worldwide Partners, MongoDB. \"MongoDB Atlas enables customers to extend their familiar environment into AWS to run the same applications with a common foundation and tooling regardless of whether it is on cloud or on premises. We are excited about offering MongoDB Atlas in AWS Marketplace which will make it easier for MongoDB customers to build, manage, and scale their data-rich applications on AWS.\"</p>\n<p>MongoDB and AWS Marketplace remain committed to removing friction and making it easier for customers to procure and innovate in the cloud. Earlier this year, MongoDB and AWS launched integrations between MongoDB Atlas and AWS Wavelength, Amazon Kinesis Data Firehose, Amazon EventBridge, AWS PrivateLink, AWS App Runner, Amazon Managed Grafana, and more. With today's new AWS Marketplace integrations, AWS customers can enjoy the benefits of consolidated billing via their AWS account. </p>\n<p>\"AWS Marketplace makes it easy for customers worldwide to find, subscribe to, deploy, and govern the best third-party software, data, and professional services offerings,\" said <span class=\"xn-person\">Stephen Orban</span>, General Manager, <span class=\"xn-person\">AWS Marketplace</span> &amp; Control Services at AWS. \"MongoDB Atlas' pay-as-you-go offering will provide customers with one of the most developer-friendly databases with an integrated and simplified subscription experience on AWS Marketplace, and we'll continue to work with MongoDB to make AWS the best place for developers to run MongoDB Atlas.\"</p>\n<p>To get started, visit<u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3373594-1&amp;h=4161816428&amp;u=https%3A%2F%2Faws.amazon.com%2Fmarketplace%2Fpp%2Fprodview-tgusa247vwa7q&amp;a=%C2%A0MongoDB+Atlas+in+AWS+Marketplace\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> MongoDB Atlas in AWS Marketplace</a></u>. To learn more about MongoDB Atlas and AWS integrations, visit<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3373594-1&amp;h=2835743594&amp;u=https%3A%2F%2Fdocs.atlas.mongodb.com%2Freference%2Famazon-aws%2F%23std-label-aws-integrations&amp;a=%C2%A0\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> </a><u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3373594-1&amp;h=2769187938&amp;u=https%3A%2F%2Fdocs.atlas.mongodb.com%2Freference%2Famazon-aws%2F%23std-label-aws-integrations&amp;a=these+\" data-type=\"url\" class=\"tr-link\" translate=\"no\">these </a><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3373594-1&amp;h=4156206884&amp;u=https%3A%2F%2Fdocs.atlas.mongodb.com%2Freference%2Famazon-aws%2F%23std-label-aws-integrations&amp;a=documents\" data-type=\"url\" class=\"tr-link\" translate=\"no\">documents</a></u>. </p>\n<p><b>About MongoDB</b></p>\n<p>MongoDB is the leading modern, general purpose database platform, designed to unleash the power of software and data for developers and the applications they build. Headquartered in <span class=\"xn-location\">New York</span>, MongoDB has more than 29,000 customers in over 100 countries. The MongoDB database platform has been downloaded over 200 million times and there have been more than 1.5 million registrations for MongoDB University courses.</p>\n<p><b>Forward-Looking Statements</b></p>\n<p>This press release includes certain \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, or the Securities Act, and Section 21E of the Securities Exchange Act of 1934, as amended, including statements regarding the benefits of our partnership with Amazon Web Services (AWS) and enhanced integration of MongoDB Atlas in AWS Marketplace. These forward-looking statements include, but are not limited to, plans, objectives, expectations and intentions and other statements contained in this press release that are not historical facts and statements identified by words such as \"anticipate,\" \"believe,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"plan,\" \"project,\" \"will,\" \"would\" or the negative or plural of these words or similar expressions or variations. These forward-looking statements reflect our current views about our plans, intentions, expectations, strategies and prospects, which are based on the information currently available to us and on assumptions we have made. Although we believe that our plans, intentions, expectations, strategies and prospects as reflected in or suggested by those forward-looking statements are reasonable, we can give no assurance that the plans, intentions, expectations or strategies will be attained or achieved. Furthermore, actual results may differ materially from those described in the forward-looking statements and are subject to a variety of assumptions, uncertainties, risks and factors that are beyond our control including, without limitation: the impact that the precautions we have taken in our business relative to the ongoing COVID-19 pandemic may have on our business; the financial impacts of the COVID-19 pandemic on our customers, our potential customers, the global financial markets and our business and future operating results; our potential failure to meet publicly announced guidance or other expectations about our business and future operating results; our limited operating history; our history of losses; failure of our database platform to satisfy customer demands; the effects of increased competition; our investments in new products and our ability to introduce new features, services or enhancements; our ability to effectively expand our sales and marketing organization; our ability to continue to build and maintain credibility with the developer community; our ability to add new customers or increase sales to our existing customers; our ability to maintain, protect, enforce and enhance our intellectual property; the growth and expansion of the market for database products and our ability to penetrate that market; our ability to integrate acquired businesses and technologies successfully or achieve the expected benefits of such acquisitions; our ability to maintain the security of our software and adequately address privacy concerns; our ability to manage our growth effectively and successfully recruit and retain additional highly-qualified personnel; and the price volatility of our common stock. These and other risks and uncertainties are more fully described in our filings with the Securities and Exchange Commission (\"SEC\"), including under the caption \"Risk Factors\" in our Quarterly Report on Form 10-Q for the quarter ended <span class=\"xn-chron\">July 31, 2021</span> filed with the SEC on <span class=\"xn-chron\">September 3, 2021</span> and other filings and reports that we may file from time to time with the SEC. Except as required by law, we undertake no duty or obligation to update any forward-looking statements contained in this release as a result of new information, future events, changes in expectations or otherwise.</p>\n<p><b>Investor Relations<br/></b><span class=\"xn-person\">Brian Denyeau</span><br/>ICR for MongoDB<br/>646-277-1251<br/><a href=\"mailto:ir@mongodb.com\" data-type=\"email\" translate=\"no\">ir@mongodb.com</a> </p>\n<p><b>Media Relations<br/></b><span class=\"xn-person\">Matt Trocchio</span><br/>MongoDB<br/><a href=\"mailto:communications@mongodb.com\" data-type=\"email\" translate=\"no\">communications@mongodb.com</a> </p>\n<p> </p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n</div>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=NY90812&amp;sd=2021-11-30\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1OWTkwODEyJnNkPTIwMjEtMTEtMzA=&amp;key=6fca46aa63828d03ad09aa2eb8d5ce02a353f6d0c4728e60ed422e266e46c7b27f1cedd82e23f797f06ada4c9245584079266193b642d53e1f73294b63128a73\"/></div></div> View original content to download multimedia:<a href=\"https://www.prnewswire.com/news-releases/mongodb-announces-a-pay-as-you-go-offering-with-enhanced-customer-experience-in-aws-marketplace-301433957.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/mongodb-announces-a-pay-as-you-go-offering-with-enhanced-customer-experience-in-aws-marketplace-301433957.html</a><p></p>\n<p>SOURCE  MongoDB, Inc.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: MONGO-PayAsYouGo</p></div>"}