{"date": "2021-12-15 13:55:00.258000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Amazon Donates an Additional $1.5 Million to The Housing Fund in Nashville to Help Preserve Housing Affordability</b>\n</p><p class=\"bwalignc\">\n<span>Donation follows initial $2.25 million investment from 2020 to help people at risk of losing their homes during challenging economic times</span>\n</p><p class=\"bwalignc\">\n<span>Additional funds aim to ease tax burdens on eligible landlords</span> <span>committed to maintaining affordable rental housing</span>\n</p><p>\nAmazon (NASDAQ: AMZN) <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2Fnews%2Fcommunity%2F1-5-million-donation-helps-preserve-affordable-housing-in-nashville&amp;esheet=52550802&amp;newsitemid=20211215005187&amp;lan=en-US&amp;anchor=today+announced&amp;index=1&amp;md5=2f06f2b6d40bffb5f8bd264beb2d3d2f\" data-type=\"url\" class=\"tr-link\" translate=\"no\">today announced</a> it was providing the affordable housing nonprofit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fthehousingfund.org%2F&amp;esheet=52550802&amp;newsitemid=20211215005187&amp;lan=en-US&amp;anchor=The+Housing+Fund&amp;index=2&amp;md5=5922d816e240e1a7643f88551154a02a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Housing Fund</a> an additional $1.5 million donation to help housing residents in Nashville, Tennessee who have been battered by COVID-19 and the events over the past two years, including tax increases. Through this additional funding, The Housing Fund aims to further support local residents by easing the increased tax burdens on eligible landlords who are committed to maintaining affordable housing and might otherwise pass on rent increases to residents. This donation is on top of <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2Fnews%2Fcommunity%2Famazon-donates-2-25-million-to-the-housing-fund-in-nashville&amp;esheet=52550802&amp;newsitemid=20211215005187&amp;lan=en-US&amp;anchor=Amazon%26%238217%3Bs+first+contribution+to+The+Housing+Fund+of+%242.25+million+in+2020&amp;index=3&amp;md5=2d0d726fff5fdee59a2aba4d414e505c\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon’s first contribution to The Housing Fund of $2.25 million in 2020</a>, which established The <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fthehousingfund.org%2Fgrant%2F&amp;esheet=52550802&amp;newsitemid=20211215005187&amp;lan=en-US&amp;anchor=Housing+Resiliency+Fund&amp;index=4&amp;md5=06aacb0365fae9b52b139f077c18e5a6\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Housing Resiliency Fund</a>, a program within the nonprofit aimed at supporting qualified homeowners with property tax relief.\n</p><p>\n“Amazon’s latest contribution will enable The Housing Resiliency Fund to expand its reach to help landlords of small multifamily and naturally occurring affordable housing dwellings of 50 units or less,” said Marshall Crawford, president &amp; CEO of The Housing Fund. “As their taxes go up, landlords also need relief so the burden is not passed on to tenants. These tenants are people who need to stay in their homes. We have been able to help hundreds of families so far and hope to continue that progress with Amazon’s support.”\n</p><p>\nEarlier this year, Nashville Mayor John Cooper convened an affordable housing task force that determined that the Nashville region’s projected population growth rate will require more than 53,000 new homes by 2030. To meet this goal, the task force recommended that the city preserve affordable housing stock and prioritize preservation of expiring subsidized and naturally occurring affordable housing. The task force’s report also found that this support could even incentivize landlords to invest in the upkeep of their properties and keep them affordable.\n</p><p>\nWith this latest donation from Amazon, The Housing Resiliency Fund expands its support, beyond the original homeowner support, and provides funding to help eligible landlords. It also continues to make payments to mortgage companies and the Metro government on behalf of qualified homeowners to help mitigate the impact of rising housing costs. Since establishing The Housing Resiliency Fund last year, Amazon’s donations have helped 412 households pay property taxes and remain in their homes, 76% of which are households of color and 74% of which make less than 80% of Nashville’s Area Median Income (AMI). This translates to less than $68,000 annually for a family of four, and less than $48,000 for an individual. Through The Housing Resiliency Fund, the majority of recipients have a commitment for five years of support.\n</p><p>\n“Financial challenges of late continue to weigh heavily on the residents of Nashville,” said Catherine Buell, director of the Amazon Housing Equity Fund. “We are committed to helping them feel relief and assurance knowing that they can stay in their homes. We look forward to expanding our impact in the region even further by supporting our neighbors in keeping their communities stable, safe, and sustainable places to live.”\n</p><p>\n“We know that housing stability is tightly interwoven with job stability, school success, and decreasing dependence on social services. Providing landlords with a way to absorb higher taxes from rising property values can help keep rents affordable for the vulnerable populations who need that most,” said Council Member Burkley Allen, At-Large, Nashville Metropolitan Council. “I am thankful for Amazon’s commitment to affordable housing and their additional contribution to the Housing Resiliency Fund.”\n</p><p>\nAmazon’s partnership with The Housing Resiliency Fund is part of Amazon’s commitment to housing affordability initiatives in the communities where its employees live and work. Amazon launched the Amazon Housing Equity Fund in January 2021, which is a more than $2 billion commitment to preserve and create more than 20,000 affordable housing units in the Puget Sound region in Washington state; Arlington, Virginia; and Nashville, Tennessee. These are three communities where the company has a large and growing presence.\n</p><p>\nThe Amazon Housing Equity Fund’s first commitment in Nashville consisted of $75 million in low-rate loans for developers to create 800 affordable homes in Nashville near WeGo transit corridors. Most recently, Amazon launched an accelerator program across all three locations, which offers professional development, mentorship, and early grant funding to emerging developers of color to help increase inclusive housing developments and community building. Locally, the accelerator program has partnered with the <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.ulmt.org%2Fredacademy&amp;esheet=52550802&amp;newsitemid=20211215005187&amp;lan=en-US&amp;anchor=Urban+League+of+Middle+Tennessee&amp;index=5&amp;md5=7acf0df46da779e021456c4261d18a5c\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Urban League of Middle Tennessee</a>.\n</p><p>\nSince announcing a new office in Nashville in 2018, Amazon has created more than 2,500 corporate and technology jobs in the city—halfway towards our goal of 5,000 jobs—and is also committed to supporting the local community with contributions and delivery service for local food banks. <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazonfutureengineer.com%2F&amp;esheet=52550802&amp;newsitemid=20211215005187&amp;lan=en-US&amp;anchor=Amazon+Future+Engineer&amp;index=6&amp;md5=3e6587ccc000d370314c853fbf3ba262\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Future Engineer</a> supports more than 240 schools statewide, including Nashville schools, with a high-quality computer science curriculum, robotics clubs, and/or educator professional learning.\n</p><p>\n<b>About Amazon</b>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Fire tablets, Fire TV, Amazon Echo, and Alexa are some of the products and services pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2F&amp;esheet=52550802&amp;newsitemid=20211215005187&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=7&amp;md5=e13d68f7dbbee189537d6bb62edfa637\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Ftwitter.com%2Famazonnews&amp;esheet=52550802&amp;newsitemid=20211215005187&amp;lan=en-US&amp;anchor=%40AmazonNews&amp;index=8&amp;md5=790fbd9cb86ada778fb06aaad4333e96\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@AmazonNews</a>.\n</p><p>\n<b>About The Housing Fund</b>\n</p><p>\nThe Housing Fund provides resources and creative leadership to help individuals and communities create and maintain affordable and healthy places in which low-and moderate-income people live. Through our various loan products and education programs, we strive to make affordable housing and healthy communities available for all Tennesseans. For more information about our programs, visit thehousingfund.org.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211215005187r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMjE1MDA1MTg3cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=0579a08a86fd6d6fb6f7b8a4d34f44480997a740c3ebee26dbd0c9e68bb1a79475b0c99ffb660ca95dfc2bb3275dcccaf35d0e00aede374ba051dd8962bd6a98\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211215005187/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211215005187/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52550802&amp;newsitemid=20211215005187&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=9&amp;md5=a15f5476ea5c9a9877e29e9c3caf17ee\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: TN-AMAZON</p></div>"}