{"date": "2021-09-08 07:01:18+00:00", "ticker": "AVV", "mrkt_info": {"open": 4220.0, "close": 4146.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Riyadh</strong> <strong>-</strong> Aramco, one of the world’s largest integrated energy and chemicals companies, and AVEVA, a global leader in industrial software, driving digital transformation and sustainability, have today announced their intention to form a strategic alliance. Focused on driving sustainability in the region through digital transformation, the partnership will help enable AVEVA to establish their largest digital hub, with an R&amp;D capability, in the Middle East, headquartered in Saudi Arabia. This partnership will represent a significant investment for AVEVA which is also looking to create up to 300 high skill new jobs in the Kingdom by 2030.</p>\n<p>This transformative and groundbreaking partnership is designed to foster a working relationship between the two companies in the deployment of various digital technologies including Artificial Intelligence (AI), Machine Learning (ML), and Data Management.  AVEVA and Aramco aim to work together to unlock the benefits of these technologies in line with the Kingdom’s move towards industrial sustainability. One of the key focus areas of the partnership would be to utilize digital technologies to support the development and implementation of blue hydrogen and decarbonization facilities in Saudi Arabia in line with the Kingdom’s energy transition strategy.  Another area in which the companies intend to work together is in the implementation of cutting-edge predictive analytics technology across Aramco’s operating facilities.  This would be one of the largest deployments of such technology in the region and the main goal is to further improve the reliability, performance, and safety of Aramco’s operation.</p>\n<p>A key offering for customers in the region through this new hub is intended to be AVEVA’s trademark Digital Twin technology which combines asset design and predictive analytics in order to create a fully integrated, real-time data visualization center that reveals functional insights, unlocks efficiencies, and identifies new pathways to optimize performance. The new hub, through its R&amp;D capability, would contribute to enriching Saudi Arabia’s knowledge economy incorporating world-class research at prominent universities across the Kingdom.</p>\n<p>Commenting on the initiative, Ahmad Al-Sa’adi, Senior Vice President of Technical Services, Aramco, said “One of the key pillars for realizing the Kingdom’s Vision 2030 is Digital Transformation. Digital technologies have the potential to accelerate the transformation of the industrial sector and drive it towards more efficient and sustainable operations. Establishing partnerships with leaders in industrial digital software, such as AVEVA, is one of the main elements in our digital transformation strategy and we believe will help us realize our mission of leveraging digital solutions to deliver tomorrow’s energy more sustainably, efficiently, and safely. The regional hub that would be established by AVEVA would contribute to Aramco’s ‘In Kingdom Total Value Add’ (IKTVA) program goals and will facilitate Saudi Arabia’s path to realizing the benefits of a digital economy.”</p>\n<p>AVEVA’s CEO Peter Herweck also commented, “AVEVA is proud to be working with Aramco towards an agreement to facilitate its digital transformation journey.  Through this partnership the vision of our companies is to play a fundamental role in industrial sector decarbonization within Saudi Arabia and the delivery of its sustainable goals, bringing capabilities to optimize every aspect of the value chain with sophisticated imaging, data analytics and deep-learning technologies that this initiative would bring. Through this initiative AVEVA aims to contribute to creating job opportunities in the Kingdom and throughout the Middle East region.”</p>\n<p><strong>-</strong>Ends<strong>-</strong></p>\n<p><strong>About Aramco</strong></p>\n<p><span>Aramco is a global integrated energy and chemicals company driven by the core belief that energy is opportunity. From producing approximately one in every eight barrels of the world’s oil supply to developing new energy technologies, our global team is dedicated to creating impact in all that we do. We focus on making our resources more dependable, sustainable and useful, promoting stability and long-term growth around the world.</span> <span><a href=\"http://www.aramco.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.aramco.com</a></span> <strong> </strong></p>\n<p><strong>About AVEVA</strong></p>\n<p>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence.  AVEVA’s comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries. Learn more at <a href=\"http://www.aveva.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.aveva.com</a>. </p>\n<p>Copyright © 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</p>\n<p><strong>Contacts:<br/></strong><strong>AVEVA Media Contacts:</strong> <a href=\"mailto:nirmala.dsouza@aveva.com\" data-type=\"email\" translate=\"no\">nirmala.dsouza@aveva.com</a> </p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}