{"date": "2022-01-21 18:13:09.858000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3033.35, "close": 2890.88}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>FRL lists conditions to Amazon proposals FRL needs to pay lenders ~3,500 crore by Jan 29 and has asked Amazon to confirm if it will pay the amount by Jan 24</p><p>This included the solution proposed in the term sheet between Samara Capital and FRL, contemplating an infusion of ~7,000 crore into FRL.</p></div><div class=\"tr-npp-abstract\"><p>Independent directors of Kishore Biyani-led Future Retail Ltd (FRL) have given their willingness to accept e-commerce giant Amazon\u0092s proposal to address any financial concern of FRL.</p></div><div class=\"tr-npp-body\"><p>However, it told Amazon any assessment of the proposals would be subject to FRL\u0092s legal obligations.</p><p>FRL has sent the letter to the Directorate of Enforcement, Securities and Exchange Board of India (Sebi), Competition Commission of India (CCI), and CCI Chairman Ashok K Gupta.</p><p>It has sent it also to top executives at banks such as Union Bank of India, Bank of India, State Bank of India, Bank of Baroda, Central Bank of India, Punjab National Bank, UCO Bank, and Indian Bank.</p><p>\u0093While we are willing to assess all proposals, please note that any proposal should be comprehensive and provide a solution for banks, employees, vendors, and other stakeholders. Please also note that any assessment of proposals will be subject to FRL\u0092s legal obligations,\u0094 said FRL\u0092s letter, dated January 21, which Business Standard has reviewed.</p><p>On January 19, Amazon had written to the independent directors of FRL, including Gagan Singh, Ravindra Dhariwal, and Jacob Mathew, reiterating its willingness and ability to assist the retail company in addressing any financial concerns.</p><p>According to sources, as early as June 2020, Amazon-backed private equity firm Samara Capital had signed a non-binding term sheet with FRL. It entailed a ~7,000-crore investment. This was two months before Future Group announcing its ~24,713 crore merger deal with Reliance Industries Ltd (RIL) at the end of August 2020.</p><p>The letter has asked Amazon to confirm the structure of the proposed transaction, and whether the management of Samara Capital is owned and controlled by resident Indians.</p><p>It said FRL was in the multi-brand retail sector, and foreign direct investment (FDI) in this sector was restricted. Amazon\u0092s transaction in Future Coupons had resulted in regulatory scrutiny, including by the Competition Commission of India, as well as enquiries by the Enforcement Directorate, it said. It is, therefore, critical that any investment being proposed is in compliance with the laws, including those on FDI, and the regulations of the CCI and Sebi.</p><p>Further, FRL is in need of cash infusion urgently in order to repay its lenders. It is required to pay its lenders ~3,500 crore by January 29, 2022. If it fails, it will be classified as a non-performing asset.</p><p>FRL has requested Amazon\u0092s confirmation on the matters mentioned in the letter by January 22.</p><p>This week, Amazon in its letter to the independent directors of FRL nominated Abhijeet Muzumdar, head of Amazon Smbhav Venture Fund and corporate development, to lead any and all such engagements with interested stakeholders and decision-makers in FRL, including independent directors, to find a commercial solution for FRL.</p><p>FRL has told Amazon its letter is lacking in detail and asked it to provide written confirmation on various aspects before meeting Muzumdar. This includes providing clarity on how FRL would service its dues and repay its lenders.</p><p>FRL\u0092s liabilities to its lenders aggregate ~9,119.31 crore till March 2022.</p><p>Also, the timing of such cash infusion is not clear, despite it being clear that FRL\u0092s cash requirements are immediate. It is not clear on how such infusion will be implemented in a legally compliant manner.</p><p>FRL\u0092s letter said the scheme of arrangement was approved by its board of directors on August 29, 2020 (Scheme). That was the only solution that would enable FRL to monetise its assets and repay the lenders thousands of crores and pay 30,000 employees and more than 5,000 vendors. The firm alleged that it appeared Amazon has made all attempts to block the scheme and was attempting to block the small-store business monetisation.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Business Standard Ltd.</p></div>"}