{"date": "2022-01-13 13:00:02.287000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3307.24, "close": 3224.28}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>\nnirvanaHealth Introduces Aria Exchange on AWS, the Marketplace-Ready Enterprise Payer Platform, so Payers Can Reduce Admin Costs up to 40% Across Enterprise\n</p><p>\nnirvanaHealth simplifies health insurer exchange participation to empower payers to expand their reach into the exchange, while also reducing admin costs up to 40%. Named <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.nirvanahealth.com%2Fmeet-aria%2F&amp;esheet=52562268&amp;newsitemid=20220113005264&amp;lan=en-US&amp;anchor=%26%238216%3BAria+Exchange%26%238217%3B&amp;index=1&amp;md5=c478033ca8bd718c1815c1719b6f1b74\" data-type=\"url\" class=\"tr-link\" translate=\"no\">‘Aria Exchange’</a>, nirvanaHealth introduces its marketplace-ready enterprise platform on AWS, designed to handle the complexity of exchange implementation and operation for both state and federal exchanges simultaneously. Almost a decade ago, the United States health care system transformed with the passage and implementation of the ACA. By making high-quality and affordable healthcare coverage more accessible, the ACA changed the lives of millions of Americans and reduced the percentage of uninsured and underinsured. With such an overwhelming impact on its large target market, it is clear that the exchange is here to stay, with several insurers joining or expanding their reach into the exchange every year. However, due to the challenges associated with not only the changing regulatory guidelines but also the inconsistency and complexity that results from the mix of federal exchange rules and state-based exchange rules, many also choose to leave or reduce their participation instead of incurring additional cost to continue participation each year.\n</p><p>\nTo address the complexity of exchange implementation, operations, and compliance, insurers have two choices (1) rely on multiple legacy vendors that lead to fragmented processes or (2) create manual processes that are not only tedious and costly, but also introduce risk for human error. However, neither of these solutions are adaptable enough for the dynamic nature of the exchange. Therefore, to succeed as an exchange plan, insurers are forced to accrue costly administrative and operating expenses, lest they have to pay financial penalties.\n</p><p>\nnirvanaHealth introduces Aria Exchange on AWS, the marketplace-ready enterprise payer technology, to reduce admin costs by up to 40%. “The exchange is no longer in its infancy. Its complexity can easily be managed with our robust, cloud-native platform,” says <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.nirvanahealth.com%2Four-mission%2F%23Letter-From-Our-CEO&amp;esheet=52562268&amp;newsitemid=20220113005264&amp;lan=en-US&amp;anchor=Ravi+Ika&amp;index=2&amp;md5=5ded12679be5e78e696987af62506a0e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Ravi Ika</a>, CEO and Founder of nirvanaHealth. “By simplifying and automating operations end-to-end through a digital workforce and improving operational efficiency, Aria overcomes the challenges associated with the ACA compliantly and empowers health plans to succeed in the marketplace business.\" nirvanaHealth’s RPA Cloud platform, Aria, allows insurers to not only enter any state-based or federal exchange with relative ease, but also manage the business going forward compliantly and at a sustainable low cost. Aria Exchange handles the complexity of rules and requirements for both federal and state-based exchanges in a user-configurable way, able to accommodate the ever-changing guidelines and requirements.\n</p><p>\nAria Exchange does more than just streamline operations leading to flawless onboarding, minimized dependency on multiple vendors and platforms, and substantial operating cost reduction. Aria also calculates the actual attained and accumulated medical loss ratio (MLR) against that which was projected MLR during the bid process. It automates both data submission to the EDGE server for the risk adjustment program calculations as well as the resulting financial reconciliation process. Health plans on Aria Exchange can even improve the quality of care and reduce the overall medical cost for their members by sharing Patient-360° actionable intelligence at the point-of-care, point-of-sale, and every care interaction. Additionally, the Aria Exchange platform empowers health plans to optimize their physician and hospital networks for the demographics of the exchange population.\n</p><p>\n“Robotic process automation (RPA), artificial intelligence (AI), and machine learning (ML) are in nirvanaHealth’s DNA. That’s our Aria platform,” says <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.nirvanahealth.com%2Four-leadership%2F&amp;esheet=52562268&amp;newsitemid=20220113005264&amp;lan=en-US&amp;anchor=John+Sculley&amp;index=3&amp;md5=2f3ecc86f103b4b8a763eaaf8208245d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">John Sculley</a>, nirvanaHealth Chairperson and former CEO of Apple. “Not only does Aria Exchange create a digital workforce with bots that automate and manage the various marketing, sales, administrative, financial, medical, utilization, care management, quality, and MLR management functions with built-in compliance, but also makes necessary manual operations more efficient and intelligent.” Therefore, exchange plans can allocate their human workforce to focus on things such as member healthcare experience, social determinants of health, wellness regimens, and care management with platform-driven intelligence. Aria simplifies decision-making and operations, leading to higher quality outcomes and reduced operating costs. “Our payer platform can help any health insurer looking to expand their product line or break into one successfully; even existing payers with large exchange business can benefit substantially from reducing their admin costs,” adds Ravi Ika. The healthcare marketplace is a large opportunity that many fail to succeed in. However, Aria Exchange is designed for successful exchange participation, empowering insurers to succeed in the marketplace. “Expand your reach with nirvanaHealth.”\n</p><p style=\"font-weight:normal\">\nAbout nirvanaHealth\n</p><p>\nnirvanaHealth is an innovative Payer and pharmacy benefit manager (PBM) platform provider that leverages their robotic process automation (RPA) cloud platforms to manage integrated medical, pharmacy and behavioral services that reduce overall administrative, medical, and pharmacy costs and improve overall quality. nirvanaHealth offers the first one-stop-shop, cloud-native Payer and PBM integrated platform in the industry. nirvanaHealth pioneers healthcare automation by uniquely combining deep healthcare domain expertise with proven platform-building experience to deploy RPA using cloud-native architecture across the Payer and PBM industries.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20220113005264r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjIwMTEzMDA1MjY0cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=5fd68497c3d428f072a2c56abaf8be85e66d7731c790e487fd987204119fbc25886bbe554c58080193ad6d94926a332c541aaecd383a61210a6a34a96f9cd283\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20220113005264/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220113005264/en/</a></span></p><p>\nChelsea Jang\n<br/><a href=\"mailto:chelsea.jang@nirvanahealth.com\" data-type=\"email\" translate=\"no\">chelsea.jang@nirvanahealth.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2022</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: MA-NIRVANAHEALTH</p></div>"}