{"date": "2021-11-05 23:11:39.953000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3477.0, "close": 3488.98}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>E-commerce firm Amazon said that its month-long Great Indian Festival (GIF) has seen the biggest ever shopping activity for its sellers and brand partners on Amazon.in, bringing services to millions of customers across the country. GIF started during midnight of October 2 with Prime Early Access and went live for all customers on October 3. Customers had access to the crores of product selection from sellers on Amazon including unique products from lakhs of Small and Medium Businesses (SMBs).</p><p>\u0093We are truly humbled to see how this festive season has brought joy to lakhs of sellers on Amazon.in with many becoming lakhpatis and crorepatis. We also witnessed great participation from over 360,000 MSME buyers on Amazon Business this festive season,\u0094 said Manish Tiwary, Vice President, Amazon India. \u0093We take pride in being a part of their growth journey while enabling them to get back on track, and safely deliver (products) to our customers during this festive season. As for our customers, we remain committed to helping them find everything they need on Amazon, with a wide variety of selection across categories, top brands, and fast delivery.\u0094</p></div><div class=\"tr-npp-body\"><p>Customers from 99.7 per cent pin codes shopped during the month-long festive event. More customers shopped on Amazon than ever before, with 79 per cent of new customers coming from tier 2 and 3 towns like Ernakulam, Guntur, Krishna and Godavari. Customers experienced the Great Indian Festival in English, Hindi, Tamil, Telugu, Malayalam, and Kannada and the newly launched Bangla and Marathi along with voice shopping in Hindi and English.</p><p>\u0093We joined Amazon through the Local Shops program in July 2021,\u0094 said Vijay Waghela, Business Head Vero Coffee, Mumbai. \u0093During GIF, we have crossed over Rs 1.5 lakh in sales for our gourmet Vero Arabica coffee capsules from across Mumbai.\u0094</p><p>Local Shops on Amazon sellers clocked a 2x spike and sold over 10 products every minute. Top-performing sellers under the Local Shops on Amazon program include Smile- Box, Liteon Bangalore, HomeUPS Chennai (kitchen- inverters and batteries), Peps Industries (mattress) and E-Sales India (washing machine, refrigerator, AC and TV). Most loved products from Local shops sellers include front-load washing machines, Refrigerators, LED TV\u0092s, inverter batteries, dish-washers, soap dispensers, JK Copier Paper and Organic Rock Salt. Most loved categories from Local Shops on Amazon include major appliances, kitchen, home entertainment (TV\u0092s), furniture, home, lawn and garden, and grocery.</p><p>\u0093During the pandemic, while I was struggling to keep my business afloat, I decided to launch my brand Rooted Peepul on Amazon\u0092s online marketplace,\u0094 said Sheeza Kazmi, co- founder, Rooted Peepul. \u0093As my brand deals with gourmet spices, it was quite stretching to reach the right audience. Amazon has been of great support to me during these 1.5 years and I witnessed a 1.5x increase in sales during the Great Indian Festival.\u0094</p><p>Startups and brands associated with the Amazon Launchpad program sold a unique product every 2.5 seconds. Most loved categories from Amazon Launchpad include gifts hampers, specialty lighting, health and wellness, Women's Sarees and Speakers.</p><p>\u0093Response for the (Amazon festive event) from our boAtheads has been very positive as they continued to shower us with their love,\u0094 said boAT co-founder and CMO, Aman Gupta.</p><p>As Bharat gets ready for 5G, more than 84 per cent of mid-range segment of smartphones bought on Amazon were 5G ready. More than one million customers purchased a smartphone on Amazon for the first time. About 1 in 6 smartphones and 1 out of 4 TVs sold during this time had Alexa Built in or worked with Alexa. Over 120 audio products were purchased every minute.</p><p>Fitness continued to be a customer favourite with cycling being the new trend as electric bikes and Shimano geared bikes were among the most purchased. Grooming continued to be a customer favourite this festive season with more than 65 per cent of total orders attributed to skincare, haircare and styling products. Consumer interest in securing their homes with smart security cameras piqued this season with more security cameras being bought than before from top brands.</p><p>Amazon\u0092s voice assistant Alexa answered over 36 million requests during the Amazon Great Indian Festival 2021. It guided customers to product searches, event stores, deals, games, information about products and more on the Amazon Android shopping app.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}