{"date": "2021-11-02 20:02:48.763000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_nfyn62e6&amp;referenceId=1_nfyn62e6&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_nfyn62e6&amp;referenceId=1_nfyn62e6&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: Billionaire Amazon founder Jeff Bezos announced a $2 billion dollar pledge to support nature restoration during the United Nations COP26 climate summit in Glasgow. Earlier on Tuesday, More than 100 countries joined an effort led by the US and European Union to slash methane emissions 30% by 2030 from 2020 levels, an initiative aimed at tackling one of the main causes of climate change. Wall Street's main indexes climbed to record highs on Tuesday, getting a boost from a string of encouraging earnings reports, while investors anticipated the Federal Reserve's next meeting where policymakers are expected to announce the withdrawal of pandemic-era stimulus. Pfizer shares rose after it revealed it expects 2021 sales of the COVID-19 vaccine it developed with German partner BioNTech to reach $36 billion and forecast another $29 billion from the shot in 2022, topping analyst estimates for both years. Tesla boss Elon Musk has revealed the EV maker has not signed a contract with Hertz, more than a week after the car rental firm announced a massive deal with the electric carmaker. Apple is to cut back on iPad tablet production in order to allocate more components to the iPhone 13, a sign the global chip supply crunch is hitting apple harder than previously thought, Nikkei reported citing multiple sources. &amp;#xD;&amp;#xD;&amp;#xD;&amp;#xD;&amp;#xD;<br/>Short Link: <a href=\"https://refini.tv/3mEYIw8\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3mEYIw8</a><br/><br/>Video Transcript:<br/><br/>Verified transcript not available</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}