{"date": "2021-05-19 05:58:35+00:00", "ticker": "AVV", "mrkt_info": {"open": 3189.0, "close": 3166.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>Dubai, UAE: AVEVA, a global leader in industrial software, driving digital transformation and sustainability, announced that Henkel, a global consumer goods and industrial chemicals manufacturer with a diverse portfolio of well-known brands, has implemented AVEVA digital solutions to help accelerate sustainability within its supply chain. By integrating AVEVA<sup>TM</sup> System Platform, AVEVA<sup>TM</sup> Historian and AVEVA <sup>TM</sup> Manufacturing Execution System, Henkel is monitoring and minimizing energy consumption saving €8M YOY in 2020 and working towards its target of becoming three times more energy efficient by 2030.</p>\n<p>With sustainability at the heart of its strategy, Henkel’s Laundry &amp; Home Care business unit wanted to reduce energy consumption and align with ISO 50001 standards at all its production sites. Using AVEVA software installed by EMP Etteplan GmbH, the team was able to successfully optimize collection, use and communication of energy consumption and emissions data across its supply chain. As a result, the team has improved supply-chain resource efficiency of on-site production by 5-6% annually.</p>\n<p>“When we started implementing AVEVA digital solutions in 2013, we were already achieving a 3% year-on-year energy saving on every ton of product produced. By the time we had completed the implementation, we were seeing a clear increase in energy efficiency. For example, AVEVA-based Environmental Management System (EMS) has reduced Henkel’s energy consumption (kWh/t) year-on-year by up to 16% in 2020 against a business-as-usual operation. To put this into perspective, the energy saved is equivalent to the capacity needed to support the three million inhabitants of two European capital cities, Amsterdam and Vienna,” commented Wolfgang Weber, Corporate Director, Digital Transformation &amp; Engineering Laundry &amp; Home Care, Henkel.</p>\n<p><strong>Using Technology to Deliver Sustainable Outcomes across the Board</strong></p>\n<p>AVEVA’s flexible solution enabled Henkel’s Laundry &amp; Home Care business unit to address all the information system architecture requirements needed to realize these emissions savings. The project took less than 18 months to start delivering audited benefits and included the energy monitoring solution using AVEVA System Platform and AVEVA Historian.</p>\n<p>“With many organizations today focused on driving sustainable business practices, AVEVA has made positive strides towards this universal call to action by developing technology solutions that are contributing towards effectively reducing industrial organizations’ environmental footprints.  Digital technologies play a vital role in realizing sustainable ambitions and AVEVA is primed to support our customers globally in taking charge of their sustainability objectives,” commented Kim Custeau, Senior Vice President APM and MES, AVEVA.</p>\n<p>“Our offerings are enabling our customers to integrate legacy solutions seamlessly, providing advanced analytics that drive sustainable decision-making through actionable insights. Our aim is to continue to work with world leaders like Henkel, where our business goals are technologically advanced and aligned to support the global sustainability agenda,” Custeau continued.</p>\n<p>“In terms of our vision for the future, AVEVA software will continue to provide the technology that Henkel Laundry &amp; Home Care needs to achieve its goals,” said Dr. Dirk Holbach, Corporate Senior Vice President, Global Supply Chain Laundry &amp; Home Care, Henkel. “Sustainability and efficient use of resources is firmly anchored in Henkel’s corporate values – and this isn’t something recent. We were one of the first companies to start publishing an annual sustainability report thirty years ago and today we have our sights set firmly on our long-term sustainability goals and are proud that our commitment has recently been recognized by the World Economic Forum (WEF) designating several of our factories as sustainability lighthouses.”</p>\n<p>Read AVEVA’s Henkel case study <a href=\"https://www.aveva.com/en/perspectives/success-stories/henkel/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a>.</p>\n<p>-Ends- </p>\n<p><strong>About Henkel</strong></p>\n<p><span>Henkel operates globally with a well-balanced and diversified portfolio. The company holds leading positions with its three business units in both industrial and consumer businesses thanks to strong brands, innovations, and technologies. Henkel Adhesive Technologies is the global leader in the adhesives market – across all industry segments worldwide. In its Laundry &amp; Home Care and Beauty Care businesses, Henkel holds leading positions in many markets and categories around the world. Founded in 1876, Henkel looks back on more than 140 years of success. In 2020, Henkel reported sales of more than 19 billion euros and adjusted operating profit of about 2.6 billion euros. Henkel employs about 53,000 people globally – a passionate and highly diverse team, united by a strong company culture, a common purpose to create sustainable value, and shared values. As a recognized leader in sustainability, Henkel holds top positions in many international indices and rankings. Henkel’s preferred shares are listed in the German stock index DAX. For more information, please visit <a href=\"http://www.henkel.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.henkel.com</a> </span></p>\n<p><strong>About AVEVA</strong></p>\n<p><span>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence.  AVEVA’s comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries. Learn more at <a href=\"http://www.aveva.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.aveva.com</a> </span></p>\n<p><span>Copyright © 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</span></p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}