{"date": "2021-11-23 22:30:52.575000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Nov. 22 -- US giant Amazon had asked Kishore Biyani-led Future Group to withdraw its complaint in CCI as the two discussed a possible end to bitter tussle over investments, according to sources.</p><p>Also, the sources said, a possible exit of Amazon - which is contesting the deal between Future group and Reliance Retail - in lieu of compensation was also discussed.</p></div><div class=\"tr-npp-body\"><p>Officials of Amazon and Future Group had a meeting a couple of weeks back but the US firm maintained that any suggestion of it seeking compensation to end the tussle with Future is \"misplaced and motivated\".</p><p>Amazon, during the meeting that also included Future Group promoter Kishore Biyani, had hinted towards an out-of-court settlement of the ongoing tussle by asking for the withdrawal of Future's complaint over alleged violation of the Foreign Exchange Management Act (FEMA) rules by misrepresenting facts before the Competition Commission of India (CCI), they added.</p><p>Amazon had asked the Future Group to withdraw the complaint filed by Future Retail before the fair trade regulator CCI citing allegations of FEMA violations by the e-commerce major, according to sources.</p><p>A possible exit of Amazon - which is contesting the Rs.24,713 crore deal between Future group with Reliance Retail - in lieu of compensation was also discussed, the sources said.</p><p>While Future Group did not respond to emailed queries, an Amazon spokesperson - in a statement - termed such claims as \"misplaced and motivated.\"</p><p>The spokesperson said \"its objections are based on breach of contract and specific performance of the contract\".</p><p>\"Any claims suggesting a demand for compensation are misplaced and motivated. We have consistently offered to help FRL even during the pendency of arbitration proceedings before various courts and this should not be construed as offer for settlement,\" the spokesperson added.</p><p>The spokesperson said it has also written to Independent Directors to communicate the same.</p><p>\"Amazon is still willing to help FRL via meaningful engagement and discussions.\" the spokesperson said.</p><p>Earlier in July this year, CCI had issued a show-cause notice to Amazon on the issue of revocation of approval given to the US company for investment transaction with Future Coupons Pvt Ltd (FCPL) over the complaints filed by Future Group.</p><p>Last week, the Delhi High Court had directed CCI to expeditiously decide on its show-cause notice to Amazon on the issue of revocation of approval given to it.</p><p>Earlier this month, the independent directors of Future Retail Ltd (FRL), in which Amazon has claimed interest after acquiring 49 per cent stake in FCPL, had also filed their written submissions before the CCI.</p><p>FRL's independent directors had also written two letters to CCI, alleging that records show that Amazon, in its application to the anti-trust watchdog, has contradicted its internal correspondence submitted before courts.</p><p>They had accused Amazon of submitting \"completely opposite information\" which was \"contradictory\" to Amazon''s own internal communications regarding the US giant''s 2019 investments into FRL''s promoter company.</p><p>According to the latest letter by the independent directors, a copy of which has been reviewed by PTI also says that the US giant was initially planning to pump money into FRL through proposed foreign portfolio investment.</p><p>On December 11, 2018, Amazon had finalised an agreement to acquire a 9.9 per cent direct stake in FRL. However, this plan was buried soon after Press Note-2 was issued by the government, which specifically barred a foreign entity from acquiring any stake or control in a retail entity in India.</p><p>That prompted Amazon to invest in the promoter firm, Future Coupons Pvt Ltd rather than directly infusing capital into FRL, the letter had said.</p><p>Amazon negotiated a \"twin-entity structure\", through which it acquired a 49 per cent stake in FCPL. FCPL had its own digital loyalty cards, gifting and couponing business, and also held a 9.82 per cent stake in FRL.</p><p>The US retail giant sought and received approval from Indian regulators, including CCI, for making an investment in the digital loyalty cards, gifting and couponing of FCPL.</p><p>In August last year, Reliance Retail Ventures Ltd, a subsidiary of Reliance Industries Ltd had announced the acquisition of the retail and wholesale business, and the logistics and warehousing business of Future Group for Rs.24,713 deal.</p><p>Amazon is contesting the deal and both sides have been battling it out in Indian courts and Singapore-based arbitration centre.</p><p>The e-commerce major is objecting to the sell-off plans, accusing Future Group of breaching the 2019 investment pact.</p><p>In October last year, an interim award was passed by the EA (emergency arbitrator) of Singapore International Arbitration Center (SIAC) in favour of Amazon that barred FRL from taking any step to dispose of or encumber its assets or issuing any securities to secure any funding from a restricted party.</p><p>This was also upheld by SIAC last month and said FRL is a party to the ongoing arbitration between Amazon and Future group in the dispute over sale of its assets to Reliance Retail. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}