{"date": "2022-01-06 21:20:06.914000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3287.14, "close": 3251.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>RACKSPACE TECHNOLOGY INC (\"RXT-Q\")\n- Works with Auronix on AWS Optimization\n\n     Rackspace Technology(R) -- a leading end-to-end, multicloud technology\nsolutions company-- today announced its collaboration with Auronix to use\nand optimize Amazon Web Services, Inc. (AWS) resulting in a 300% return on\ninvestment since implementation.\n\n     Founded in 1994, Auronix is a technology company focused on Calixta,\nthe #1 communication platform-as-a-service in Latin America. Calixta\nconnects brands handling millions of clients, with the right message and\ntime, on the media they prefer, connecting meaningful conversations to\nsystems, processes, and people.\n\n     Serving the biggest brands in the financial industry, telecom, retail,\nand ecommerce, Auronix provides communication services for their customers\nthrough multiple digital channels and can quickly upgrade their\ninfrastructure to offer availability, redundancy, elastic capacity, and\nincident monitoring.\n\n     What we achieved together\nTogether, AWS, Rackspace Technology and Auronix built a more robust\ninfrastructure, helping to strengthen Auronix's security as well as\nincrease speed and scalability by moving all their products to the cloud.\nIn addition, Rackspace Technology is now in charge of infrastructure\nmonitoring, alerts, solution proposals, and risk mitigation planning, which\nproactively handles issues.\n\n     These upgrades freed up Auronix resources to develop new applications,\nallowing the company to continue innovating and growing while realizing a\n300% return on the investment and doubled migration speed.\n\n     \"Rackspace Technology provides end-to-end multicloud expertise and has\nvast experience centralizing, automating, and optimizing processes more\nsafely and efficiently,\" said Jeff DeVerter, Chief Technology Evangelist at\nRackspace Technology. \"Given our track record, Auronix immediately saw that\nRackspace Technology would be the perfect partner to help accelerate their\ndigital transformation on AWS.\"\n\n     \"Rackspace Technology has been an extremely important business partner\nfor us,\" said Adrian Villasenor, Co-director, Auronix. \"Our partnership has\nallowed us to manage our AWS infrastructure in a more scalable and a more\nappropriate way to be able to focus on what we have to do well.\"\n     About Rackspace Technology\nRackspace Technology is a leading end-to-end multicloud technology services\ncompany. We can design, build and operate our customers' cloud environments\nacross all major technology platforms, irrespective of technology stack or\ndeployment model. We partner with our customers at every stage of their\ncloud journey, enabling them to modernize applications, build new products\nand adopt innovative technologies.\n\n     Contact:Natalie Silva\n     Rackspace Technology Corporate Communications\n     publicrelations@rackspace.com\n\n                            ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200500785.MNPRE2200502174-08134520220106</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}