{"date": "2022-02-07 16:48:32.860000+00:00", "ticker": "AAF", "mrkt_info": {"open": 155.0, "close": 139.1}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .q{margin:42.55pt 54.0pt 2.0cm 72.0pt;}.storyContent p.ap{margin-top:9.0pt;margin-right:0cm;margin-bottom:0cm;margin-left:0cm;margin-bottom:.0001pt;line-height:16.0pt;font-size:11.0pt;font-weight:bold;}.storyContent p.aq{margin-top:9.0pt;margin-right:0cm;margin-bottom:0cm;margin-left:0cm;margin-bottom:.0001pt;line-height:16.0pt;font-size:11.0pt;font-weight:bold;text-align:center;text-decoration:underline;text-decoration-color:inherit;}.storyContent p.ar{margin-top:9.0pt;margin-right:0cm;margin-bottom:0cm;margin-left:0cm;margin-bottom:.0001pt;line-height:16.0pt;font-size:11.0pt;font-weight:bold;margin-top:14.4pt;}.storyContent p.as{margin-top:0cm;margin-right:0cm;margin-bottom:10.0pt;margin-left:0cm;line-height:115%;font-size:11.0pt;font-weight:bold;line-height:16.0pt;margin-bottom:0cm;margin-left:0cm;margin-right:0cm;margin-top:14.4pt;text-align:justify;}.storyContent span.aj{letter-spacing:.3pt;}.storyContent p.h,.storyContent li.h,.storyContent div.h{margin-top:9.0pt;margin-right:0cm;margin-bottom:0cm;margin-left:0cm;margin-bottom:.0001pt;line-height:16.0pt;font-size:11.0pt;}.storyContent span.ah{letter-spacing:.3pt;}.storyContent span.ag{letter-spacing:.3pt;}.storyContent span.af{letter-spacing:.3pt;}.storyContent table.at{margin-left:-5.4pt;border-collapse:collapse;}.storyContent tr.z{height:60.65pt;}.storyContent td.ac{width:294.4pt;padding:0cm 5.4pt 0cm 5.4pt;height:60.65pt;}.storyContent p.au{margin-top:0cm;margin-right:0cm;margin-bottom:10.0pt;margin-left:0cm;line-height:115%;font-size:11.0pt;margin-bottom:6.0pt;line-height:normal;}.storyContent td.aa{width:130.65pt;padding:0cm 5.4pt 0cm 5.4pt;height:60.65pt;}.storyContent p.av{margin-top:0cm;margin-right:0cm;margin-bottom:10.0pt;margin-left:0cm;line-height:115%;font-size:11.0pt;line-height:normal;margin-bottom:6.0pt;text-align:right;}.storyContent span.w{font-size:11.0pt;letter-spacing:.3pt;}.storyContent br.x{page-break-before:always;}.storyContent p.aw{margin-top:0cm;margin-right:0cm;margin-bottom:10.0pt;margin-left:0cm;line-height:115%;font-size:11.0pt;font-weight:bold;text-align:center;text-decoration:underline;text-decoration-color:inherit;}.storyContent p.ax{margin-top:12.0pt;margin-right:0cm;margin-bottom:12.0pt;margin-left:0cm;text-align:justify;font-size:12.0pt;margin-top:6.0pt;margin-right:0cm;margin-bottom:6.0pt;margin-left:0cm;}.storyContent span.v{font-size:11.0pt;}.storyContent span.t{font-size:11.0pt;}.storyContent span.s{font-size:11.0pt;}.storyContent p.ay{margin-top:0cm;margin-right:0cm;margin-bottom:10.0pt;margin-left:0cm;line-height:115%;font-size:11.0pt;text-align:center;}</style><div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><div style=\"text-align:left;font-size:10pt\"><div>RNS Number : 9389A</div>  <div>Citigroup Global Markets Limited</div>  <div>07 February 2022</div>  <div> </div></div>\n<div class=\"q\">\n<p class=\"ap\"><span class=\"an\">NOT FOR RELEASE, PUBLICATION OR DISTRIBUTION, DIRECTLY OR INDIRECTLY, IN WHOLE OR IN PART, IN THE UNITED STATES, AUSTRALIA, CANADA, JAPAN, SOUTH AFRICA OR ANY OTHER JURISDICTION IN WHICH OFFERS OR SALES WOULD BE PROHIBITED BY APPLICABLE LAW. THIS ANNOUNCEMENT DOES NOT CONSTITUTE OR FORM AN OFFER OF SECURITIES IN THE UNITED STATES, AUSTRALIA, CANADA, JAPAN, SOUTH AFRICA OR ANY OTHER JURISDICTION.</span></p>\n<p class=\"ap\"><span class=\"an\">THE INFORMATION CONTAINED WITHIN THIS ANNOUNCEMENT IS DEEMED TO CONSTITUTE INSIDE INFORMATION FOR THE PURPOSES OF ARTICLE 7 OF THE MARKET ABUSE REGULATION (EU) NO.596/2014 AS IT FORMS PART OF UNITED KINGDOM DOMESTIC LAW BY VIRTUE OF THE EUROPEAN UNION (WITHDRAWAL) ACT 2018. UPON THE PUBLICATION OF THIS ANNOUNCEMENT, THIS INSIDE INFORMATION IS NOW CONSIDERED TO BE IN THE PUBLIC DOMAIN.</span></p>\n<p class=\"aq\"><span class=\"an\">Press Release</span></p>\n<p class=\"ar\"><span class=\"an\">Proposed Placing of approximately 53 million ordinary shares in Airtel Africa plc (\"Airtel Africa\" or the \"Company\")</span></p>\n<p class=\"as\"><span class=\"aj\">7</span> <span>February 2022</span></p>\n<p class=\"h\"><span class=\"ah\">Funds managed by Warburg Pincus LLC and Morningstar Investment Pte Ltd (the \"Sellers\") announce their intention to sell approximately 53</span><span class=\"ag\"> million</span><span class=\"af\"> ordinary shares in Airtel Africa (the \"Placing Shares\") (the \"Placing\"). The Placing Shares represent approximately 1.4% of Airtel Africa's issued ordinary share capital.</span></p>\n<p class=\"h\"><span class=\"ah\">The Placing Shares are being offered to institutional investors by way of an accelerated bookbuild, which will be launched immediately following this announcement. Citigroup Global Markets Limited (\"Citi\") is acting as Sole Global Coordinator and Bookrunner in connection with the Placing.</span></p>\n<p class=\"h\"><span class=\"ah\">The final number of Placing Shares to be placed and the placing price will be agreed by Citi and the Sellers at the close of the bookbuild process, and the results of the Placing will be announced as soon as practicable thereafter. The timings for the close of the bookbuild process, pricing and allocations are at the absolute discretion of Citi and the Sellers.</span></p>\n<p class=\"h\"><span class=\"ah\">The Sellers have agreed to a customary 90-day lock-up period from the date of pricing of the Placing with respect to sales of any remaining shares they hold in Airtel Africa.</span></p>\n<p class=\"h\"><span class=\"ah\">Airtel Africa will not receive any proceeds from the Transaction.</span></p>\n<p class=\"ap\"><span class=\"ah\">Enquiries:</span></p>\n<div class=\"story-table-container\"><table cellpadding=\"0\" cellspacing=\"0\" class=\"at\">\n<tr class=\"z\">\n<td class=\"ac\" style=\"width:393\">\n<p class=\"au\"><span style=\"font-weight:bold\"><span>Citigroup Global Markets Limited  </span></span><span>            </span></p>\n<p class=\"au\"><span class=\"ad\">Ken Robins </span></p>\n<p class=\"au\"><span class=\"ad\">Stuart Field</span></p>\n<p class=\"au\"><span class=\"ad\">Chuba Ezenwa</span></p>\n<p class=\"au\"><span class=\"ad\">Mihir Unadkat</span></p>\n</td>\n<td class=\"aa\" style=\"width:174\">\n<p class=\"av\"><span>+44 (0) 20 7500 5000</span></p>\n</td>\n</tr>\n</table></div>\n<span style=\"font-weight:bold\"><span class=\"w\"><br class=\"x\"/>\n<br class=\"x\"/></span></span>\n<p class=\"ar\"><span class=\"ag\"> </span></p>\n<p class=\"aw\"><span class=\"ad\">IMPORTANT NOTICE</span></p>\n<p class=\"ax\"><span class=\"v\">This announcement is not for publication, distribution or release, directly or indirectly, in or into the United States of America (including its territories and possessions), Australia, Canada, Japan or the Republic of South Africa or any other jurisdiction where such an announcement would be unlawful.  The distribution of this announcement may be restricted by law in certain jurisdictions and persons into whose possession this document or other information referred to herein comes should inform themselves about and observe any such restriction.  Any failure to comply with these restrictions may constitute a violation of the securities laws of any such jurisdiction.</span></p>\n<p class=\"ax\"><span class=\"v\">This announcement is for information purposes only and shall not constitute or form part of an offer to buy, sell, issue, acquire or subscribe for, or the solicitation of an offer to buy, sell, issue, acquire or subscribe for any securities, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful.  No action has been taken that would permit an offering of the securities or possession or distribution of this announcement in any jurisdiction where action for that purpose is required.  Persons into whose possession this announcement comes are required to inform themselves about and to observe any such restrictions.</span></p>\n<p class=\"ax\"><span class=\"v\">No prospectus or offering document has been or will be prepared in connection with the Placing. The Placing Shares may not be offered to the public in any jurisdiction in circumstances which would require the preparation or registration of any prospectus or offering document relating to the Placing Shares in such jurisdiction.  No action has been taken by the Sellers or any of their affiliates, that would permit an offering of the Placing Shares or possession or distribution of this announcement or any other offering or publicity material relating to such securities in any jurisdiction where action for that purpose is required. </span></p>\n<p class=\"ax\"><span class=\"v\">The securities referred to herein have not been and will not be registered under the U.S. Securities Act of 1933, as amended (the \"Securities Act\"), and may not be offered or sold in the United States (as defined in Regulation S under the Securities Act) </span><span class=\"t\">absent registration under the Securities Act, except pursuant to an exemption from, or in a transaction not subject to, the registration requirements of the Securities Act</span><span class=\"s\">.  Neither this document nor the information contained herein constitutes or forms part of an offer to sell or the solicitation of an offer to buy securities in the United States.  There will be no public offer of any securities in the United States or in any other jurisdiction.</span></p>\n<p class=\"ax\"><span class=\"v\">In the member states of the European Economic Area, this announcement and any offer if made subsequently is directed exclusively at persons who are \"qualified investors\" within the meaning of the Prospectus Regulation (Regulation (EU) 2017/1129) (\"Qualified Investors\"). In the United Kingdom, this announcement is directed exclusively at Qualified Investors (i) who have professional experience in matters relating to investments falling within Article 19(5) of the Financial Services and Markets Act 2000 (Financial Promotion) Order 2005, as amended (the \"Order\") or (ii) who fall within Article 49(2)(A) to (D) of the Order, or (iii) to whom it may otherwise lawfully be communicated (all such persons together being referred to as \"Relevant Persons\"). This document is directed only at Relevant Persons in the United Kingdom and Qualified Investors in any member state of the EEA, and must not be acted on or relied on by persons who are not Relevant Persons or Qualified Investors. Any investment or investment activity to which this document relates is available only to Relevant Persons or Qualified Investors and will be engaged in only with Relevant Persons or Qualified Investors.  This announcement is not an offer of securities or investments for sale nor a solicitation of an offer to buy securities or investments in any jurisdiction where such offer or solicitation would be unlawful.  </span></p>\n<p class=\"ax\"><span class=\"v\">In connection with any offering of the Placing Shares, Citi and its affiliates acting as an investor for their own account may take up as a proprietary position any Placing Shares and in that capacity may retain, purchase or sell for their own account such Placing Shares.  In addition they may enter into financing arrangements and swaps with investors in connection with which they may from time to time acquire, hold or dispose of Placing Shares.  They do not intend to disclose the extent of any such investment or transactions otherwise than in accordance with any legal or regulatory obligation to do so.</span></p>\n<p class=\"ax\"><span class=\"v\">Citi, which is authorised by the Prudential Regulation Authority and regulated by the Financial Conduct Authority and the Prudential Regulation Authority in the United Kingdom is acting on behalf of the Sellers and no one else in connection with any offering of the Placing Shares and will not be responsible to any other person for providing the protections afforded to any of its clients or for providing advice in relation to any offering of the Placing Shares.  Citi will not regard any other person as its client in relation to the offering of the Placing Shares.</span></p>\n<p class=\"ay\"> </p>\n</div>\n<div style=\"text-align:left;font-size:10pt\"><div>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a>.<br/><br/>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a>.</div><div> </div>  END</div><div> </div><div> </div>IOEQDLFBLLLZBBE</div>"}