{"date": "2021-12-01 19:51:02.489000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Discovery Taps AWS to Power Global Rollout and Increased Personalization of discovery+</b>\n</p><p class=\"bwalignc\">\n<span>With AWS as its preferred cloud provider, Discovery is also accelerating its digital transformation and enhancing viewing experiences across its more than 450 television channels</span>\n</p><p>\nToday, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), and Discovery Inc. announced their extended strategic relationship to support Discovery’s ongoing transformation in the cloud. As Discovery’s preferred cloud provider, AWS powers the vast majority of the company’s infrastructure needs to deliver its discovery+ on-demand streaming video service, its digital services, and more than 450 linear TV channels (traditional scheduled programming) to viewers around the world. With AWS, Discovery also provides greater personalization of discovery+, helping viewers easily find content that appeals to their interests.\n</p><p>\nDiscovery uses the breadth and depth of AWS services to provide discovery+ viewers with enhanced, reliable viewing experiences that are personalized to their tastes and consumption habits. For instance, Discovery is the largest media and entertainment user of Amazon Personalize, AWS’s machine learning service that allows developers to create real-time, personalized user experiences faster and at scale. Discovery relies on Amazon Personalize to offer recommendations for curated content that matches viewer’s specific interests, customizing the browsing experience. Discovery also uses Amazon Transcribe (AWS’s service for automatically converting speech to text) across its linear broadcast channels and streaming services to accurately generate closed captions to ensure content is inclusive and accessible to hearing-impaired viewers, and Amazon Rekognition (AWS’s service for automated image and video analysis) to extract and tag video content with metadata to provide viewers with a searchable video library and more personalized recommendations.\n</p><p>\n“AWS provides the unparalleled portfolio of services, global infrastructure, and proven performance we need to reliably deliver our premium content at scale to Discovery viewers all over the world,” said Avi Saxena, Chief Technology Officer, Direct-to-Consumer at Discovery, Inc. “Running on AWS, we have the agility and elasticity we need to deliver quality viewing experiences for peak events like the Olympics, as well as scalable machine learning capabilities to deliver meaningful personalization to viewers so they can get the most value out of their subscriptions.”\n</p><p>\nDiscovery’s portfolio of iconic television channels, including Animal Planet, Food Network, HGTV, OWN, TLC, and Travel Channel, feature content that inspires, informs, and entertains audiences around the world. Discovery leverages numerous AWS Media &amp; Entertainment Services to deliver more than 8,000 hours of original live and on demand programming each year. AWS Elemental MediaConnect, AWS Elemental MediaLive, and AWS Elemental MediaPackage manage Discovery’s video transport, preparation, processing, and delivery behind-the-scenes, helping ensure an exceptional audience experience regardless of viewing device type or connectivity.\n</p><p>\nIn the summer of 2021, as the Home of the Olympics in Europe, Discovery elastically scaled its use of AWS Media Services to transmit 1.3 billion minutes of<b><span> </span></b>the Olympic Games Tokyo 2020 content across its range of digital platforms, including discovery+ and Eurosport subscription services, successfully delivering sports action in 19 languages across 50 markets in Europe. Discovery used Amazon SageMaker (AWS’s machine learning service that helps developers and data scientists build, train, and deploy machine learning models quickly in the cloud and at the edge) to develop and train machine learning models that automate the process of language monitoring. These machine learning models can identify the program in live broadcast video feeds and verify that content gets delivered in the right local language for each television market.\n</p><p>\n<span><b>Building immersive fan experiences with Discovery Sports Events</b></span>\n</p><p>\nAs well as being Discovery’s preferred cloud provider, AWS is also the Official Cloud, Artificial Intelligence, Machine Learning, and Deep Learning Provider of Discovery Sports Events. As part of this strategic relationship, the two companies are building an immersive fan-engagement experience for the new Union Cycliste Internationale (UCI) Track Champions League to introduce track cycling to new audiences and expand the sport’s global fan base. Discovery Sports Events and AWS will serve live data, analysis, and stats such as bike speed, race position, pedal cadence (i.e., revolutions per minute), and more to fans in the velodrome (where races take place) through live television and streaming, and in a new UCI Track Champions League app. The app will allow for fan communities to grow around the championship, while helping newcomers to the sport better understand the action on the track. Discovery Sports Events will use Amazon Kinesis (AWS’s service for easily collecting, processing, and analyzing video and data streams in real time) to ingest and process live, streaming data from sensors on the track, bikes, and riders, and will apply AWS analytics and machine learning capabilities to serve up stats such as rider power output in watts, time keeping, racer biometrics (e.g., heart rate and calories burned), and more to bring fans closer to the action. Finally, Discovery Sports Events will use AWS Media Services to provide the stats to fans through the app and broadcast in a simple and compelling format.\n</p><p>\n“Discovery is home to some of the world’s most iconic media brands, and AWS makes it easier than ever for its viewers to access, identify, and engage with the content they love,” said Kathrin Renz, Vice President of Business Development and Industries at Amazon Web Services, Inc. “As Discovery brings its deep and growing library of content to audiences around the world, they can count on AWS to elastically scale without ever sacrificing the reliability or high quality that its customers expect.”\n</p><p>\n<b>About Amazon Web Services</b>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com&amp;esheet=52542672&amp;newsitemid=20211201005136&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=1&amp;md5=dbd72b54f9e5d90192171f2da760189c\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<b>About Amazon</b>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Famazon.com%2Fabout&amp;esheet=52542672&amp;newsitemid=20211201005136&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=2&amp;md5=005aaeb9ef4a019fa6f10e870d1476fc\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p>\n<b>About Discovery</b>\n</p><p>\nDiscovery is the global leader in real life entertainment, serving passionate fans around the world with content that inspires, informs and entertains. Discovery delivers over 8,000 hours of original programming each year across deeply loved content genres.\n</p><p>\nAvailable in 220 countries and territories and 50 languages, Discovery is a platform innovator, reaching viewers on all screens and services, from linear, free-to-air and pay–TV channels to digital products and streaming services, to social and mobile-first content and formats. Discovery’s portfolio of premium brands includes Discovery Channel, HGTV, Food Network, TLC, Investigation Discovery, Travel Channel, Turbo/Velocity, Animal Planet, and Science Channel, as well as OWN: Oprah Winfrey Network in the U.S., Discovery Kids in Latin America, and Eurosport, the leading provider of locally relevant, premium sports and Home of the Olympic Games across Europe.\n</p><p><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211201005136/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211201005136/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52542672&amp;newsitemid=20211201005136&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=3&amp;md5=a0917b2e710f5975f9c3c2df644e8f77\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON-WEB-SERVICES</p></div>"}