{"date": "2022-01-18 18:56:08.059000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>BETTER PLANT SCIENCES INC.  (\"PLNT-Z\")\n- Share Consolidation\n\n     Better Plant Sciences Inc. ('Better Plant' or the 'Company') a\nwellness company that develops and sells plant-based products, announces\nthat it will be consolidating all of the issued and outstanding common\nshares of the Company (\"Common Shares\") on the basis of one (1)\npost'consolidation Common Share for each ten (10) pre'consolidation Common\nShares (the \"Consolidation\").\n\n     The Company's board of directors set January 24, 2022 as the record\ndate of the Consolidation. Trading of the Common Shares on a\npost-Consolidation basis on the Canadian Securities Exchange (the \"CSE\") is\nexpected to commence on or about January 21, 2022. The Company's name and\ntrading symbol will remain unchanged.\n\n     The 199,179,698 Common Shares currently issued and outstanding will be\nreduced to approximately 19,917,969 Common Shares on a post-Consolidation\nbasis. No fractional shares will be issued. Any fractional interest in\nCommon Shares that is less than 0.5 of a Common Share resulting from the\nConsolidation will be rounded down to the nearest whole Common Share and\nany fractional interest in Common Shares that is 0.5 or greater of a Common\nShare will be rounded up to the nearest whole Common Share.\n\n     The new CUSIP and ISIN numbers for the post-Consolidation Common\nShares will be 087737201 and CA0877372015 respectively.\n\n     A letter of transmittal will be mailed to registered shareholders\nproviding instructions with respect to surrendering certificates\nrepresenting pre-Consolidation Common Shares in exchange for\npost-Consolidation Common Shares issued as a result of the Consolidation.\nUntil surrendered, each certificate representing pre-Consolidation Common\nShares will be deemed to represent the number of post-Consolidation Common\nShares the holder received as a result of the Consolidation. Shareholders\nwho hold their Common Shares in brokerage accounts are not required to take\nany action.\n\n     Outstanding stock options and share purchase warrants will also be\nadjusted by the Consolidation ratio and the respective exercise prices of\noutstanding options and share purchase warrants will be adjusted\naccordingly.\n\n\n\n\n     About Better Plant Sciences Inc.\n\n     Better Plant has a catalog of hundreds of product formulas and\ndevelops, commercializes, markets, and sells over 50 products through the\nbrands Jusu, NeonMind, and Urban Juve. Better Plant products are sold\nthrough a network of over 150 online and brick-and-mortar retail locations\nincluding Whole Foods Market, Pharmasave, Healthy Planet, and Vitasave.\nBetter Plant has a talented team with expertise in digital design,\nbranding, eCommerce, and digital marketing and offers operational,\nfinancial, and other services to companies with emerging and fast-growing\nbusinesses.\n\n\n     For more information on Better Plant, visit betterplantsciences.com or\nfollow @betterplantsciences on Instagram.\n\n\n     Penny White, President &amp; CEO\n\n     penny@betterplantsciences.com\n\n     1-833-515-2677\n\n\n     Investor Relations:\n\n     Alexandra Dumanski\n\n     invest@betterplantsciences.com\n\n     1-833-515-2677\n\n\n     Sales Inquiries:\n\n     Amber Allen, Director of Sales\n\n     amber@betterplantsciences.com\n\n     604-808-8118\n\n     The Canadian Securities Exchange has not reviewed, approved or\ndisapproved the contents of this news release.\n\n\n     Cautionary Statement Regarding Forward-Looking Statements\n\n     This press release includes forward-looking information and statements\n(collectively, forward-looking statements) under applicable Canadian\nsecurities legislation. Forward-looking statements are necessarily based\nupon a number of estimates, forecasts, beliefs, and assumptions that, while\nconsidered reasonable, are subject to known and unknown risks,\nuncertainties, and other factors which may cause actual results and future\nevents to differ materially from those expressed or implied by such\nforward-looking statements. Such risks, uncertainties, and factors include,\nbut are not limited to: risks related to the development, testing,\nlicensing, brand development, availability of packaging, intellectual\nproperty protection, reduced global commerce, and reduced access to raw\nmaterials and other supplies due to the spread of COVID-19, the potential\nfor not acquiring any rights as a result of the patent application and any\nproducts making use of the intellectual property may be ineffective or the\ncompany may be unsuccessful in commercializing them; and other approvals\nwill be required before commercial exploitation of the intellectual\nproperty can happen. Demand for the company's products, general business,\neconomic, competitive, political, and social uncertainties, delay or\nfailure to receive board or regulatory approvals where applicable, and the\nstate of the capital markets. Better Plant cautions readers not to place\nundue reliance on forward-looking statements provided by Better Plant, as\nsuch forward-looking statements are not a guarantee of future results or\nperformance and actual results may differ materially. The forward-looking\nstatements contained in this press release are made as of the date of this\npress release, and Better Plant expressly disclaims any obligation to\nupdate or alter statements containing any forward-looking information, or\nthe factors or assumptions underlying them, whether as a result of new\ninformation, future events or otherwise, except as required by law.\n\n\n\n\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201700544.MNPRE2201702915-10555420220118</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}