{"date": "2021-11-01 18:59:32.136000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Mumbai</p></div><div class=\"tr-npp-lead\"><p>Mumbai, Oct. 28 -- The Amazon-Future battle over the Reliance Retail deal has yet again reached the Delhi high court, with the Future Group seeking a stay on an interim order passed by the Singapore International Arbitration Centre (SIAC) on 21 October.</p><p>According to a regulatory filing on Wednesday, Future Group promoters and Future Coupons Pvt. Ltd have also urged the high court to set aside the SIAC order.</p></div><div class=\"tr-npp-body\"><p>Last week, SIAC dismissed Future Group's appeal to vacate the interim stay on the Reliance transaction awarded in October 2020.</p><p>In its appeal, the company contested the observation of the arbitration court, saying that Future Retail was in no way a party to the agreement between Amazon and Future Coupons, as the group promoters had not signed any agreement with Amazon.</p><p>Amazon invested Rs.1,400 crore in Future Coupons, which owns nearly 10% stake in Future Retail.</p><p>In its appeal on Tuesday, Future Retail has also urged the court to allow the company to conduct a meeting of shareholders and creditors, according to an order of the Mumbai bench of the National Company Law Tribunal (NCLT).</p><p>On 28 September, the NCLT had allowed the Kishore Biyani-led group companies to hold meetings of shareholders and creditors for approval to sell all its assets to Reliance Retail Ventures Ltd.</p><p>Last week, Amazon filed an interim application in the Supreme Court to restrain Future Retail from holding the meeting of shareholders and creditors on the Reliance Retail deal.</p><p>On 29 August 2020, the debt-laden Future Group announced the sale of its retail and wholesale assets to Reliance Industries Ltd's subsidiaries for Rs.24,713 crore.</p><p>Soon after, Amazon approached SIAC on the grounds that its investment agreement with Future Coupons, another Biyani firm, bars Future Retail from selling its assets to Reliance.</p><p>A SIAC emergency order stayed the sale process, triggering a court battle between Amazon and Future over the legality to enforce the SIAC order.</p><p>Subsequently, the Singapore tribunal has heard both parties, and a final order is expected soon.</p><p>In August, the apex court had upheld the Singapore emergency arbitrator's order suspending the Mukesh Ambani-led Reliance Industries's acquisition of Future Group's retail assets.</p><p>A Supreme Court bench of Justices Rohinton Fali Nariman and B.R. Gavai ruled that the 25 October 2020 order by SIAC is enforceable under Section 17(2) of India's Arbitration Act.</p><p>Reliance Retail Ventures Ltd (RRVL), the retail arm of Reliance Industries, had recently extended the long-stop date for completion of its Rs.24,713 crore deal with Future Group by another six months to 31 March next year in view of the long-drawn-out legal battle with Amazon. Earlier, RRVL had extended the timeline for the long stop date from 31 March to 30 September.</p><p>Online retail giant Amazon is competing against rivals including Walmart-led Flipkart and Reliance Industries for gaining a beachhead in India's burgeoning retail e-commerce space. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}