{"date": "2021-09-30 08:18:18.798000+00:00", "ticker": "III", "mrkt_info": {"open": 1272.5, "close": 1281.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 4462N3i Group PLC30 September 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>3i Group plc</p>\n<p>Chairman and Non-executive Director Appointments</p>\n<p>Following the Company's announcement on 13 May 2021 that Simon Thompson would not seek re-election as Chairman of the Board at the Company's 2022 AGM, 3i Group plc is pleased to announce that David Hutchison, currently Senior Independent Director and Chairman of 3i's Valuations Committee, will become non-executive Chairman of the Board following the announcement of the Company's half-year results, which is expected to take place on 11 November 2021.</p>\n<p>The selection process was conducted by a sub-committee of the Nominations Committee (which excluded Mr Thompson and Mr Hutchison) and included consideration of both internal and external candidates. The sub-committee was assisted by Russell Reynolds Associates.</p>\n<p>3i Group plc is also pleased to announce the appointment of Lesley Knox as a non-executive Director of the Company with effect from 1 October 2021.</p>\n<p>Simon Thompson, 3i Chairman, said: \"During my time as Chairman, the 3i team under Simon Borrows' leadership has significantly strengthened ESG management while achieving total shareholder returns of 19% per annum, despite the headwinds of COVID-19. David has been an outstanding Senior Independent Director and I wish him every success as he takes over as Chairman. I would also like to welcome Lesley Knox, who brings a <span>wealth of international, strategic and financial services experience to the Board.\"</span>\n</p>\n<p>David Hutchison said: \"It will be a great privilege to become Chairman of 3i and I look forward to helping continue the growth and success achieved during Simon Thompson's chairmanship.\"</p>\n<p>Lesley Knox said: \"I am very pleased to be joining 3i's Board. 3i has a strong institutional franchise as well as a strong management team. Its conservative balance sheet strategy and the strength of its portfolio means it is well placed to continue to generate value for its shareholders.\"</p>\n<p>Simon Borrows said \"I am grateful to Simon for his leadership of the 3i Board, particularly through the COVID-19 pandemic. I look forward to working closely with David who has a deep knowledge of 3i, its portfolio and its culture. I am also pleased that Lesley Knox has been appointed to the Board. Together with the executive team, the Board is well placed to drive 3i's continued success.\"</p>\n<p>For further information, contact:</p>\n<p>Kathryn van der Kroft 020 7975 3021</p>\n<p>Communications Director</p>\n<p>Silvia Santoro 020 7975 3258</p>\n<p>Investor Relations Director</p>\n<p>Notes to Editors</p>\n<p>About Lesley Knox</p>\n<p>Lesley brings a wealth of international, strategic and financial services experience having spent over 18 years in senior roles in financial services, including with Kleinwort Benson and the Bank of Scotland. Lesley previously served as Chair of Alliance Trust PLC, as Senior Independent Director at Hays plc and non-executive director of SAB Miller plc, Centrica plc and Thomas Cook Group plc. Her current other appointments are: Legal &amp; General Group plc (Non-executive director); Dovecot Studios Limited (Non-executive Director); Genus Plc (Senior Independent Non-Executive Director and Chair of Remuneration Committee); Grosvenor Group Limited pension fund (Trustee); National Galleries of Scotland Foundation (Trustee)</p>\n<p>There is no further information required to be disclosed by Listing Rule 9.6.13 R.</p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>BOALLMFTMTJTBFB</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}