{"date": "2021-11-17 19:41:38.003000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon Care, the ecommerce giant's healthcare business, has signed a deal with hotel chain Hilton to provide its staff with on-demand virtual medical services.</p><p>Hilton is only the second publicly disclosed company to sign up to Amazon Care and represents a notable step for the world's largest online retailer's move into telehealth.The Amazon Care app provides 24/7 video appointments and a live chat messaging service with a clinician. Amazon also sticks to its logistics roots with prescription deliveries and provides in-person clinical services in selected areas via third-party medical groups it has partnered with.Amazon did not disclose the financial terms of the deal but according to 2020 figures, Hilton has 141,000 employees globally. The deal, first reported by Reuters, will add Amazon Care to all of the hotelier's US staff enrolled on a corporate health plan.Launched initially as a pilot version in September 2019 for Amazon's Seattle-based employees, the Jeff Bezos-founded company significantly stepped up its expansion efforts over the summer. In May this year, Peloton-owned fitness equipment company Precor became Amazon Care's first publicly disclosed customer.But the Hilton deal, its largest yet, is likely to boost the nascent Amazon Care's chances of securing more big-name customers in what is a highly competitive market.Kristen Helton, director of Amazon Care, told Reuters that the service would in future add artificial intelligence capabilities.\"We will have clinicians in the loop for a period of time until we can actually trust that AI and those technology solutions are taking care of the patient in the way that is best,\" Helton said.It is Amazon's second attempt to disrupt the healthcare market following a failed joint venture with JP Morgan and Berkshire Hathaway called Haven. Despite the three companies' combined 1.2 million US employees, the Amazon venture disbanded less than three years after its launch.Amazon's move into telehealth, instead of Haven's goal of lowering costs and improving outcomes across all of healthcare, may prove to be a more achievable market to disrupt.The Covid-19 pandemic has accelerated the use of telemedicine with companies such as Babylon Health experiencing rapid growth since 2020.\"Healthcare providers have been quick to implement alternative solutions to in-person care to ensure patients can access diagnostic and therapeutic services,\" notes a recent GlobalData report on digital health solutions. \"This has led to significant increases in the use of remote patient monitoring, telemedicine platforms, and virtual clinical trials.\"The report goes on to state that \"as the public becomes more digitally savvy, the acceptance of digital health technologies is likely to increase\".Success for Amazon in telehealth would make it the third sector it has disrupted, having grown from an online book seller to a near-$2tn ecommerce behemoth and establishing its lucrative cloud computing business Amazon Web Services.Last year Amazon entered the wearable devices market with the launch of Amazon Halo, a wrist device that uses sensors to measure heart rate, temperature and other health metrics.In perhaps a dent to Amazon's healthcare credentials, the company on Monday reached a $500,000 settlement with the state of California over claims it concealed the number of warehouse workers infected with Covid-19 from its employees and health agencies. Amazon did not admit any wrongdoing or liability as part of the settlement agreement.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}