{"date": "2021-11-25 02:48:11.759000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3580.04, "close": 3504.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>E-commerce giant Amazon has approached the Supreme Court seeking a pause on the Competition Commission of India's review of its investment in Future Retail (FRL). The US giant is currently in a legal dispute with FRL. More on today's top headlines</p><p>Amazon seeks to pause antitrust review of 2019 deal with India's Future</p></div><div class=\"tr-npp-body\"><p>Amazon.com Inc has asked India's Supreme Court to pause an expedited review of allegations that the U.S. firm concealed information while seeking antitrust clearance for a 2019 deal with India's Future Group, legal papers seen by Reuters showed. Read more</p><p>Profit concentration in India Inc rises amid private sector growth</p><p>Big private sector companies have cornered a large chunk of the corporate profit pie in the last few years as small and public sector firms struggle with poor profitability. This has resulted in a steady rise in profit concentration. Read more</p><p>Tighter rules likely for social media firms, may supersede IT laws: Experts</p><p>The Personal Data Protection Bill, which according to news reports is likely to suggest that social media intermediaries be considered platforms, and those not identified as intermediaries be considered publishers, it could override the existing Information Technology Act and Rules, according to experts. Read more</p><p>Digital tax for US companies to stay until OECD pact comes into force</p><p>The 2 per cent equalisation levy imposed by India on digital players will continue for US companies until a global agreement on taxing multinational enterprises (MNEs) comes into effect or March 31, 2024, whichever is earlier. The United States, on the other hand, has committed to withdrawing its threat of retaliatory trade action against India, according to an agreement reached between the two countries on Wednesday. Read more</p><p>Central Vista: 6 firms submit technical bids to construct Executive Enclave</p><p>Six infrastructure firms, including Tata Projects Limited and L&amp;T Limited, have submitted technical bids for the construction of an executive enclave that will house the prime minister's office (PMO), Cabinet secretariat, India House and National Security Council Secretariat, a CPWD official said on Wednesday. Read more</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}