{"date": "2021-11-09 14:13:15.226000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon will soon add PayPal's Venmo as a checkout option through a new agreement that could accelerate the peer-to-peer app's growth.</p><p>Beginning next year, U.S. customers will be able to make purchases with Venmo on Amazon.com and the Amazon mobile app.</p></div><div class=\"tr-npp-body\"><p>\"This is obviously a very significant moment in our Venmo monetization efforts and marks the beginning of an exciting journey with Amazon,\" PayPal CEO Dan Schulman told analysts during a conference call late Monday to discuss the company's third-quarter earnings.</p><p>The move advances PayPal's efforts to encourage Venmo users to store funds within the P2P app by broadening its use cases. A<span><a href=\"https://www.americanbanker.com/payments/news/venmo-launches-card-with-qr-and-nfc-both-in-the-plastic\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Venmo credit card</a> </span>rolled out a year ago, and earlier this year Venmo added tools to<span><a href=\"https://www.americanbanker.com/payments/news/venmo-primes-a-younger-crowd-for-crypto-payments\" data-type=\"url\" class=\"tr-link\" translate=\"no\">manage cryptocurrencies</a> </span>within the app.</p><p>PayPal's reach also is expanding. Schulman said Walmart has added PayPal as a checkout option, United Airlines now accepts PayPal via QR code for in-flight purchases, and thousands of Valero and Phillips 66 gas stations will begin accepting PayPal via QR code later this year. <br/> </p><p>PayPal's Pay in 4 installment loans continue to generate strong volume for PayPal in the U.S., Europe and Australia, and in the first half of next year PayPal plans to add longer-term loans for larger purchases, Schulman said. PayPal is already testing longer-term loans in Germany, he added.</p><p>The Amazon deal is \"an important victory and paves the way for potential beyond just U.S. Venmo users,\" Christopher Donat, managing director at Piper Sandler, wrote in a research note, while noting that PayPal's management did not estimate how much revenue the Amazon pact would contribute.</p><p>PayPal's various breakthroughs with merchants were bright spots in an otherwise muted presentation, as Schulman scaled back the company's year-end revenue projection based on several factors.</p><p>\"The back half of 2021 was always going to be the low point of our revenue growth this year and we are appropriately cautious as we enter Q4 and think about 2022,\" Schulman said, explaining that PayPal expects revenue for the full year to be 0.5% lower than the company projected last summer.</p><p>This outlook is in contrast to PayPal's position a year ago, when it reported<span><a href=\"https://www.americanbanker.com/payments/news/paypals-pandemic-winning-streak-continues-venmo-reaches-44-billion-in-volume\" data-type=\"url\" class=\"tr-link\" translate=\"no\">record-breaking results each quarter</a> </span>, driven by the strong shift to digital payments during pandemic-induced lockdowns.</p><p>Spending habits are shifting again, but they're not as favorable to PayPal.</p><p>The company saw strong sales momentum building in June and July that \"reversed\" in August and September, due to concerns about the delta variant of COVID-19 that caused a slowdown in travel and back-to-school spending, Schulman said.</p><p>Now supply-chain issues are threatening fourth-quarter sales.</p><p>\"With the economy reopening, more people may be likely to do their holiday shopping in stores, as confidence in delivery logistics is depressed from last year,\" Schulman said.</p><p>Although PayPal's split from eBay is nearly complete, the ongoing migration also dampened revenues more than the company expected, Schulman said.</p><p>PayPal's revenue during the third quarter rose 13% from a year earlier to $6.2 billion. Net income rose 7% to $1.087 billion.</p><p>Total payment volume rose 26% to $310 billion.</p><p>PayPal's total active accounts rose 15% year over year to 416 million, with 33 million merchants now accepting PayPal.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 American Banker. All Rights Reserved.</p></div>"}