{"date": "2022-02-20 23:48:56.758000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_g98zki8w&amp;referenceId=tag:reuters.com,2022:newsml_OVFZ7IN4B_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_g98zki8w&amp;referenceId=tag:reuters.com,2022:newsml_OVFZ7IN4B_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: Escalating tensions over a Russian attack of Ukraine continued to weigh on stocks, with all three of Wall Street's main indexes logging weekly declines for the second straight week. Lisa Bernhard has more.<br/>Short Link: <a href=\"https://refini.tv/33xWXdl\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/33xWXdl</a><br/><br/>Video Transcript:<br/><br/>Wall Street's main stock indexes ended lower on Friday as escalating tensions in Ukraine and US statements of an imminent Russian invasion prompted investors to dump risky assets in the run-up to a long weekend. The Dow fell 0.7%, the S&amp;P 500 also shed 0.7%, while the NASDAQ dropped 1.2%, dragged down by declines in high-growth stocks including Apple, Amazon and Tesla. George Ball is Chairman of wealth manager Sanders Morris Harris.<br/><br/>Stocks are slumping for three reasons. One, the best indicator of where the market's going to go on, any given day, is what it did the day before. It works more often than not. Not a good reason. Second, if you're a trader or even an investor, you don't really want to be long. A lot of stocks over a three day weekend when you've got the threat of a shooting war starting and nobody knows whether it will start, when it'll start, or how far it'll spiral. Third, there right now is something of a bear tilt to the market. Speculators are frightened by what the Fed may do. Investors are frightened by the possibility that Fed moves and inflation could cause a recession later this year. So you sort of got a unholy threesome of factors that are weighing on them on the market.<br/><br/>Intel tumbled after the chipmaker forecast its profit margin to drop this year and then be steady for several years as it invests in new technologies and factories to meet rising chip demand. Roku also slumped after the streaming platform's disappointing quarterly revenue and first-quarter outlook. And DraftKings fell after the sports-betting company forecast a bigger-than anticipated 2022 loss. Friday marked the second straight week of declines for Wall Streetâ\u0080\u0099s main indexes.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}