{"date": "2022-01-14 00:14:25+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3304.14, "close": 3242.76}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        Managing the security of your Amazon Web Services (AWS) environment requires constant vigilance. Your strategy should include identifying potential threats to your environment and proactively monitoring for vulnerabilities and system weaknesses that malicious actors might exploit. In a complex environment-such as your AWS account with a multitude of services, coupled with various architectures and applications-the ideal solution should be both comprehensive and straightforward.\n      </p>\n                <p>\n        On this page, we're going to explore some of the security intelligence services available from Sumo Logic and discuss how they can help you stay ahead of potential threats to your environment. We'll cover what each service does, how you can make the most of it, and where to find more information. Finally, we'll introduce you to some of the security dashboards Sumo Logic provides for its users. Security dashboards provide an easy way to observe the health and security of all your systems and provide your security teams with real-time data they can use to make critical business and security decisions.<br/></p>\n                <h4>\n        Getting started with Sumo Logic\n      </h4>\n                <p>\n        If you're new to Sumo Logic, you should know that it's a platform that extends beyond security management and threat intelligence services. Sumo Logic supports cloud monitoring and log management as well. The platform provides a centralized platform that can aggregate data from multiple sources. It provides tools and dashboards to view and analyze data and provide users with a holistic view of their entire cloud ecosystem.\n      </p>\n                <p>\n        If you're interested to see how Sumo Logic can help you monitor, troubleshoot, and secure your cloud environment, check out a <a href=\"https://www.sumologic.com/sign-up/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">30-day free trial</a>.\n      </p>\n                <p>\n        Let's explore some of the sources you can integrate with your Sumo Logic account, as well as how to connect and begin gathering data from those sources.<br/></p>\n                <h4>\n        Bringing cloud metrics into Sumo Logic\n      </h4>\n                <h4>\n                  <strong>Connecting your AWS account data</strong>\n                </h4>\n                <p>\n        At the time of writing, Sumo Logic supports integrations with over thirty of Amazon's most popular <a href=\"https://help.sumologic.com/07Sumo-Logic-Apps/01Amazon_and_AWS\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS services</a>. Most of these services are connected to Sumo Logic using a hosted collector. Typically this involves creating a new role within your AWS account, using AWS Identity and Access Management (IAM) with read-only permissions to the services from which you need to collect data. The <a href=\"https://help.sumologic.com/03Send-Data/Sources/02Sources-for-Hosted-Collectors/Amazon-Web-Services/Grant-Access-to-an-AWS-Product\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Sumo Logic documentation</a> includes step-by-step instructions and even CloudFormation templates to ensure this process is as straightforward as possible.\n      </p>\n                <p>\n        Once the process is complete, the relevant AWS data will be available as a source within your Sumo Logic account. The next step is to install the appropriate app and connect it to the data source. You'll immediately have access to a variety of preconfigured, handy dashboards that you can use to view data, troubleshoot problems, and identify anomalies.\n      </p>\n                <h4>\n                  <strong>Collecting machine metrics</strong>\n                </h4>\n                <p>\n        In addition to AWS services, your AWS environment might also include a variety of virtual machines and containers. Sumo Logic uses <a href=\"https://help.sumologic.com/03Send-Data/Sources/01Sources-for-Installed-Collectors\" data-type=\"url\" class=\"tr-link\" translate=\"no\">installed collectors</a> to gather such metrics as network activity, CPU usage, memory usage, and storage access. Sumo Logic supports these collectors on Windows, Linux, and Docker, among other systems.\n      </p>\n                <p>\n        You can manually install the collector. In dynamic and scalable environments, including the collector as part of your base image ensures that all new machines and containers can report their metrics to your Sumo Logic account. As with the AWS data sources above, once configured, you'll have access to the metrics from a data source within your Sumo Logic account, following which you can install the relevant App and immediately view your data through a variety of preconfigured dashboards.\n      </p>\n                <p>\n                  <strong>Gathering application data</strong>\n                </p>\n                <p>\n        Last, but by no means least, are your applications. Most cloud applications execute with a web server environment. Some of the more popular servers include <a href=\"https://help.sumologic.com/07Sumo-Logic-Apps/24Web_Servers/Apache\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Apache</a>, <a href=\"https://help.sumologic.com/07Sumo-Logic-Apps/24Web_Servers/Apache_Tomcat\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Tomcat</a>, and various flavors of NGINX. You can find a listing of all <a href=\"https://help.sumologic.com/07Sumo-Logic-Apps/24Web_Servers\" data-type=\"url\" class=\"tr-link\" translate=\"no\">supported web servers here</a>.\n      </p>\n                <p>\n        Web servers typically support log management and metric reporting as core functionality. You can add the appropriate configuration to direct those logs and metrics to your Sumo Logic account, referencing the Sumo Logic documentation.\n      </p>\n                <p>\n        Once you have configured the web server as a data source, this data too will become available as a source within your Sumo Logic account. Many of the existing security applications and dashboards within Sumo Logic will aggregate this data with other data points from your environment and give you a well-rounded view of the state of security within your environment.<br/></p>\n                <h4>\n        Connecting your security tools to Sumo Logic\n      </h4>\n                <p>\n        Sumo Logic provides integrations with many of the most popular and advanced security monitoring tools around. From <a href=\"https://help.sumologic.com/07Sumo-Logic-Apps/22Security_and_Threat_Detection/Akamai_Security_Events\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Akamai Security Events</a> and <a href=\"https://help.sumologic.com/07Sumo-Logic-Apps/22Security_and_Threat_Detection/Barracuda_WAF\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Barracuda WAF</a> to <a href=\"https://help.sumologic.com/07Sumo-Logic-Apps/22Security_and_Threat_Detection/Carbon_Black\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Carbon Black</a>, <a href=\"https://help.sumologic.com/07Sumo-Logic-Apps/22Security_and_Threat_Detection/Twistlock\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Twistlock</a>, and <a href=\"https://help.sumologic.com/07Sumo-Logic-Apps/22Security_and_Threat_Detection/Zscaler_Web_Security\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Zscaler</a>. <a href=\"https://www.sumologic.com/applications/secops-security/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">You can find a complete list</a> of supported security and threat detection products and platforms that you can connect to Sumo Logic. Each product includes comprehensive instructions on collecting logs and events and installing the respective App and associated dashboards in your Sumo Logic account.\n      </p>\n                <p>\n        Now that we have our metrics and data sources from our cloud environment and our security tools, we can take a deep dive into several of the security and threat detection dashboards available within your Sumo Logic account.<br/></p>\n                <h4>\n        CrowdStrike Threat Intelligence\n      </h4>\n                <p>\n                  <a href=\"https://help.sumologic.com/07Sumo-Logic-Apps/22Security_and_Threat_Detection/Threat_Intel_Quick_Analysis\" data-type=\"url\" class=\"tr-link\" translate=\"no\">This app</a> correlates threat intelligence data from <a href=\"https://www.crowdstrike.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">CrowdStrike</a> with log data from your environment to detect and mitigate threats to your environment. The CrowdStrike Falcon platform is an industry-leading security platform that actively monitors your cloud environment for threats and automatically mitigates most malicious attempts to infiltrate your system. The Sumo Logic Threat Intel Quick Analysis App is especially adept at protecting your environment against sophisticated and persistent cyber-attacks.\n      </p>\n                <p>\n        The Threat Intel App specifically queries IP, URL, domain, Hash 256, and email logs together with CrowdStrike data from your environment. As this dataset can grow significantly, it's essential to optimize the default queries to filter out unnecessary records and focus on the most critical areas of your environment. An <a href=\"https://help.sumologic.com/07Sumo-Logic-Apps/22Security_and_Threat_Detection/Threat_Intel_Quick_Analysis/02_Threat-Intel-Optimization\" data-type=\"url\" class=\"tr-link\" translate=\"no\">optimization page</a> describes these optimizations and provides clear examples of optimizing the queries based on your environment.\n      </p>\n                <p>\n        The app has six preconfigured dashboards that provide graphics information and count for the number of recent threats (within a 15-minute window), threat trends over time, and the type and source of threats detected. The dashboard shown below describes threats related to malicious IP addresses, including where the threat originated, the confidence of a hostile threat, and the trend in types of threat over time.\n      </p>\n                <p>\n        The dashboards available include:<br/></p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <p>\n                      <strong>Overview:</strong> Consolidated threat counts from each of the threat areas the app monitors.\n          </p>\n                  </li>\n                  <li>\n                    <p>\n                      <strong>Domain:</strong> Threats originating from malicious domains, including actors and sources.\n          </p>\n                  </li>\n                  <li>\n                    <p>\n                      <strong>Email:</strong> Emails received from known bad actors and domains and trends over time.\n          </p>\n                  </li>\n                  <li>\n                    <p>\n                      <strong>IP:</strong> Shown in the dashboard above. Source, types, and confidence of IP threats.\n          </p>\n                  </li>\n                  <li>\n                    <p>\n                      <strong>URL:</strong> Threats from URLs identified as individuals, groups, or nation-states.\n          </p>\n                  </li>\n                  <li>\n                    <p>\n                      <strong>Hash 256:</strong> Sources of threats involving cryptographic-related attempts by type and source.\n          </p>\n                  </li>\n                </ul>\n                <p>\n        By combining data from multiple sources, the Sumo Logic dashboards can present a holistic view of your AWS ecosystem, helping to protect your applications and email system while keeping you informed.<br/></p>\n                <h4>\n        AWS CloudTrail insights\n      </h4>\n                <p>\n        Within your AWS account, you have access to the <a href=\"https://aws.amazon.com/cloudtrail/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">CloudTrail service</a>. CloudTrail records interactions with the AWS APIs, delivering audit capabilities to comply with various regulations and provide insights into activities that indicate potential security risks. As with many AWS services, CloudTrail is comprehensive, versatile, and rich in available data. When combined with the <a href=\"https://www.sumologic.com/application/aws-cloudtrail/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Sumo Logic CloudTrail App</a>, you can visualize the data and create alerts and mitigation strategies.\n      </p>\n                <p>\n        The Sumo Logic CloudTrail App requires that you have CloudTrail enabled on your account. It gathers data through an IAM role that grants read-only access to the CloudTrail data. Once you've enabled the App on your account, you'll have access to various dashboards, including the account overview, shown below.\n      </p>\n                <p>\n        Additional dashboards provide insights into:<br/></p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <p>\n                      <strong>User Monitoring:</strong> User location, top 10 actions by users, and recent launch and terminated instances.\n          </p>\n                  </li>\n                  <li>\n                    <p>\n                      <strong>Network &amp; Security:</strong> Authorization failures, security events, short-lived critical actions, and ingress/egress concerns.\n          </p>\n                  </li>\n                  <li>\n                    <p>\n                      <strong>Operations:</strong> Actions by user for the past hour, recent regional events, Elastic IP, and resource creation and deletion events.\n          </p>\n                  </li>\n                  <li>\n                    <p>\n                      <strong>Console Logins:</strong> User activity relating to the AWS console, including outliers, failed logins, and logins without MFA.\n          </p>\n                  </li>\n                </ul>\n                <p>\n        The App also provides insights into public S3 objects and buckets.<br/></p>\n                <h4>\n        AWS GuardDuty\n      </h4>\n                <p>\n        Much like CloudTrail, <a href=\"https://www.sumologic.com/application/aws-guardduty/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS GuardDuty</a> is an AWS service that monitors your AWS account and environment for malicious activity. GuardDuty works with <a href=\"https://www.sumologic.com/application/aws-cloudtrail/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">CloudTrail</a> logs to prevent unauthorized activity and improve your ability to monitor and investigate security incidents.\n      </p>\n                <p>\n        As with CloudTrail, you can <a href=\"https://www.sumologic.com/application/aws-guardduty/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">install the GuardDuty App</a> on your Sumo Logic account. Providing access to the GuardDuty data in your AWS account will enhance your ability to monitor and observe the state of security within your account. The GuardDuty dashboards present intuitive insights into security threats and their severity.<br/></p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <p>\n                      <strong>Overview:</strong> Shown below, this includes a map and threat details by severity, IP, region, and resource type.\n          </p>\n                  </li>\n                  <li>\n                    <p>\n                      <strong>CloudTrail:</strong> Details of CloudTrail threats in the past 24 hours, including trends and actions are taken.\n          </p>\n                  </li>\n                  <li>\n                    <p>\n                      <strong>GuardDuty:</strong> Threats identified by GuardDuty by region, severity, resource type, and security group, among others.\n          </p>\n                  </li>\n                  <li>\n                    <p>\n                      <strong>VPCs, Subnets, Security Group Details:</strong> Threats affecting your VPC, subnets, and security groups over the past 24 hours.\n          </p>\n                  </li>\n                </ul>\n                <h4>\n        Cloud SIEM\n      </h4>\n                <p>\n        For Enterprises with more sophisticated needs, <a href=\"https://www.sumologic.com/solutions/cloud-siem-enterprise/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Sumo Logic Cloud SIEM</a>, a cloud-native system designed to support the security needs of single-cloud, multi-cloud and hybrid environments is available. Cloud SIEM from Sumo Logic is a Security Operations Center (SOC) platform to protect your enterprise from current and future threats.\n      </p>\n                <p>\n        You can use Cloud SIEM from Sumo Logic to secure AWS, your SaaS apps, infrastructure, and Kubernetes environments from a central control plane. You can even schedule a demo with a Sumo Logic expert to help you uncover all the ways that partnering with Sumo Logic can help you better secure your organization now and in the future.<br/></p>\n                <h4>\n        Learning more\n      </h4>\n                <p>\n        If you'd like to know more about how Sumo Logic can help your organization monitor, troubleshoot, and secure your cloud environment, please reach out to their responsive <a href=\"https://support.sumologic.com/hc/en-us\" data-type=\"url\" class=\"tr-link\" translate=\"no\">support team</a> and a thriving <a href=\"https://support.sumologic.com/hc/en-us/community/topics\" data-type=\"url\" class=\"tr-link\" translate=\"no\">community of enthusiasts</a>. As mentioned above, you can also take advantage of a <a href=\"https://www.sumologic.com/sign-up/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">30-day free trial</a> test drive of each of the apps, dashboards, and features listed above.\n      </p>\n                <div>\n                  <h4>\n          Complete visibility for DevSecOps\n        </h4>\n                  <p>\n          Reduce downtime and move from reactive to proactive monitoring.\n        </p>\n                </div>\n                <div>\n                  <a href=\"https://www.sumologic.com/sign-up/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Start free trial</a>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.sumologic.com/blog/monitor-aws-security-vulnerability-threat-detection-dashboards/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Sumo Logic Inc.</strong> published this content on <strong>13 January 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>14 January 2022 00:14:25 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - Sumo Logic Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Sumo-Logic-Inc.</p></div>"}