{"date": "2022-02-22 14:06:49+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n        Amazon's solar project in South Africa supplies clean, renewable power to AWS data centers and supports economic opportunities for local women and businesses.\n      </div>\n                <div>\n                  <p>\n          Amazon's new 10-megawatt solar plant is up and running in South Africa's Northern Cape Province, the largest province in the country. The plant is expected to generate up to 28,000 megawatt-hours (MWh) of renewable energy per year, which equals the annual electricity consumption of over 8,000 average South African homes.\n        </p>\n                  <p>\n          The solar plant consists of over 24,000 bifacial solar panels-capturing sunlight on both sides-covering an area of 20 hectares in the Northern Cape. The solar panels track the sun throughout the day, absorbing solar energy from the sky and reflected light from the ground. The design will result in avoiding an estimated 25,000 tons of carbon emissions annually, the equivalent of removing 5,400 cars from the road in South Africa.\n        </p>\n                  <p>\n          \"Amazon is committed to working with governments and utility suppliers around the world to help bring more renewable energy projects online,\" said Nat Sahlstrom, director of energy at Amazon Web Services. \"We're honored to work with the Department of Minerals and Energy, the National Energy Regulator of South Africa, and Eskom to help deliver a new model for renewable energy generation in South Africa.\"\n        </p>\n                  <h4>\n          Powering energy and economic transformation\n        </h4>\n                  <p>\n          The Northern Cape solar project also contributes to the region's economic transformation. The solar plant, which contributes to South Africa's 2030 renewable energy goals, is majority-owned by black women and operated by a fully South African-owned company.\n        </p>\n                  <p>\n          \"Historically, black women have been critically underrepresented in infrastructure, agriculture, and utility ownership,\" says Meta Mhlarhi, co-founder and executive director at Mahlako a Phahla Investments, an investor in the project. \"Energy projects that enable black investment are our surest way to a just transition to renewable energy.\"\n        </p>\n                  <p>\n          The project created 167 jobs in local communities during construction and will sustain permanent jobs for its lifetime to support the electrical maintenance, operation, and security. The project also reduced waste by donating unused materials from construction, including pallets and electrical cable drums, to local furniture businesses and special skills schools to support small and medium-sized businesses.\n        </p>\n                  <p>\n          \"While we're building renewable energy capacity in South Africa, we must also develop South African companies and skills,\" says Dom Wills, CEO of SOLA Group, the South African company responsible for developing and operating the energy plant. \"SOLA is committed to transforming South Africa through clean energy, and being able to sell renewables to corporates at large scale makes this one of the most significant power projects in South African History.\"\n        </p>\n                  <h4>\n          Achieving a sustainable future\n        </h4>\n                  <p>\n          We are committed to building a sustainable business for customers and the planet, and it's why we co-founded The Climate Pledge in 2019, becoming the first signatory and setting a goal to meet the Paris Agreement 10 years early by reaching net-zero carbon by 2040. This project brings Amazon closer to powering our global operations with 100% renewable energy, a commitment Amazon is on path to reach by 2025-five years before the original 2030 goal.\n        </p>\n                  <div>\n                    <div>\n                      <span>\n                        <a href=\"https://www.aboutamazon.com/planet/climate-pledge\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Climate Pledge</a>\n                      </span>\n                    </div>\n                    <div>\n            Amazon is committed to building a sustainable business for our customers and the planet. In 2019, Amazon co-founded The Climate Pledge-a commitment to be net zero carbon across our business by 2040, 10 years ahead of the Paris Agreement.\n          </div>\n                    <div>\n                      <span>\n                        <a href=\"https://www.aboutamazon.com/planet/climate-pledge\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read more</a>\n                      </span>\n                    </div>\n                  </div>\n                  <p>\n          In 2020, Amazon became the <span><a href=\"https://www.aboutamazon.com/news/sustainability/amazon-becomes-the-worlds-largest-corporate-purchaser-of-renewable-energy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">world's largest corporate purchaser of renewable energy</a></span>, reaching 65% renewable energy across our business. Amazon now has a portfolio of over 270 global renewable energy projects, totaling over 12 gigawatts of renewable capacity globally. Once all these projects are operational, We estimate that more than 13.7 million metric tons of carbon emissions will be avoided each year-the equivalent of taking nearly 3 million cars off U.S. roads each year.\n        </p>\n                  <p>\n          The Northern Cape solar project is another proud step on Amazon's renewable energy journey. Learn more about Amazon's commitment to <span><a href=\"https://aws.amazon.com/energy/sustainability/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">sustainability through energy</a></span>.\n        </p>\n                </div>\n                <div>\n                  <div>\n          Related Tags\n        </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/aws\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/sustainability\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Sustainability</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/the-climate-pledge\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Climate Pledge</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/renewable-energy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Renewable energy</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/solar\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Solar</a>\n                    </span>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/aws/amazons-first-south-african-solar-plant-delivers-energy-and-opportunity\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>22 February 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>22 February 2022 14:06:49 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}