{"date": "2022-01-25 17:11:51.702000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ELSE NUTRITION HOLDINGS INC (\"BABY-T\")\n- Else Nutrition Opens the Market\n\n     Hamutal Yitzhak, Chief Executive Officer, Co-Founder &amp; Director, Else\nNutrition Holdings Inc. (\"Else\" or the \"Company\") (TSX: BABY) and her team\njoins Yossi Boker, Head of Business Development, Israel, TMX Group, to\ncelebrate the Company's graduation to Toronto Stock Exchange and open the\nmarket.\n\n     (iframe width=\"560\" height=\"315\"\nsrc=\"https://www.youtube.com/embed/ZB2HV3NqV0U\" frameborder=\"0\") (/iframe)\n\n     Else Nutrition GH Ltd. is an Israel-based food and nutrition company\nfocused on developing a proprietary innovative, clean and plant-based food\nand nutrition products for infants, toddlers, children, and adults. Its\nplant-based, non-soy, formula is a clean-ingredient whole food alternative\nto dairy-based formula. Else Plant-Based Complete Nutrition for Toddlers\nwas recently ranked as the #1 Top seller in the baby and toddler formula\ncategory on Amazon. Else's Executives include leaders hailing from leading\ninfant nutrition companies. Many of Else advisory board members had past\nexecutive roles in companies such as Mead Johnson, Abbott Nutrition, Plum\nOrganics and leading infant nutrition Societies, and some of them currently\nserve in different roles in leading medical centers and academic institutes\nsuch as Boston Children's Hospital, Pediatrics at Harvard Medical School,\nUSA, Tel Aviv University, Schneider Children's Medical Center of Israel,\nRambam Medical Center and Technion, Israel and University Hospital\nBrussels, Belgium.\n\n     For Market Openings: Media may pick up a feed from the TOC (television\noperations centre) for all market open ceremonies. The feed is named TSX\nTransmit 1 (SD-SDI) and is produced at the TMX Broadcast Centre and sent\nlive to the TOC. To pick up the feed via the Dejero network, please contact\navservices@tmx.com. The client feature video will begin playing on the TMX\nmedia wall at approximately 9:27 a.m. ET and the markets will open with the\nsound of a siren at 9:30 a.m. ET\n\n     Date:  Tuesday January 25, 2022\n\n     Time:  9:00am - 9:30am\n\n     Place: Virtually Broadcast\n\n Contact Information:\n\nMEDIA CONTACT: Erin Jundef, Brilliant PR, erinj@brilliantpr.com\n\nTel   : 972-3-644-5095    ELSE NUTRITION HOLDINGS INC\nEmail : hamutaly@elsenutrition.com\nWWW   : <a href=\"https://www.elsenutrition.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.elsenutrition.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2202400470.MNPRE2202402535-09071920220125</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}