{"date": "2021-12-29 13:07:40.048000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3393.39, "close": 3384.02}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>BIOTRICITY INC (\"BTCY-Q\")\n- Expands Distribution of New Bioheart Device on Amazon.com\n\n     Biotricity Inc., a modern medical technology company delivering\ninnovative, remote biometric monitoring solutions, today announced it has\nexpanded the distribution of its new Bioheart heart monitor system, a\ndirect-to-consumer device that offers the same continuous heart monitoring\ntechnology used by physicians, on Amazon.com.\n\n     Last month the company launched commercial sales of its Bioheart\ndevice. To improve availability and expand outreach, Biotricity has now\nlisted it for purchase on Amazon.com at: Bioheart on Amazon for $199 with a\nspecial introductory price of $149 for a limited time. You can view the\nBioheart heart monitor in use here.\n\n     \"We are aiming to transform the cardiac health marketplace and believe\nthe Bioheart system will play an important role in that endeavor,\" said Dr.\nWaqaas Al-Siddiq, Biotricity Founder and CEO, \"The Bioheart device is an\nimportant component of our full spectrum, 'virtual cardiac clinic' of\nmobile cardiac care and lifestyle solutions. It will be fully integrated\nwith a growing number of cardiology practices through our cloud-based\n'Biosphere' ecosystem that we plan to fully roll out in 2022, allowing\nphysicians to get a more holistic view of a patient's health.\n\n     \"The ability to offer Bioheart on Amazon expands the availability for\nthe public to easily access the benefits of this exciting technology,\" Dr.\nWaqaas added.\n\n     The launch of Bioheart opens a new market and revenue stream for\nBiotricity while expanding the company's total addressable market by\n$1.24B. Heart conditions are intermittent, requiring long-term data\ncollection for effective insights and lifestyle management. With continuous\nmonitoring, Bioheart reinvents personal heart management with retrospective\nsnapshots and long-term data collection.\n\n     Introducing a groundbreaking new capability, users can collect data\nfor hours, days, weeks, months, and even years! They can create snapshots\nof rhythm data by reviewing past data and marking it for personal records.\nThese are first-of-its-kind features that will help individuals look back\nat their data for a richer understanding of their lifestyle impact and\nheart health.\n\n     Bioheart features include:\n\n*  Built-in dry contacts for data collection\n*  Advanced data collection - three different heart views\n*  24/7 continuous rhythm recording\n*  48-hour battery life\n*  Personalized analytics\n*  Bluetooth connected\n\n     With the Bioheart smartphone app, users can:\n\n*  View electrical heart rhythm live on the app\n*  View data on advanced heart metrics such as electrical heart rhythm,\nheart rate and heart rate variability\n*  View historical heart rate ranges\n*  Create a heart rhythm diary and save snapshots of heart activity\n*  Easily create retrospective snapshots, a first-of-its kind capability\n*  Easily export and share heart data with a physician\n\n     Bioheart incorporates the Company's proprietary advanced heart\ntechnology, combined with powerful analytics and continuous rhythm\nrecording, to help individuals understand and improve their heart health.\nIndividuals can track their heart statistics 24/7 with three different\nviews of the heart, which can be streamed live on the Bioheart smartphone\napp. Bioheart is the most accurate heart monitor available without a\nprescription.\n\n     Bioheart retails for $199 and is available at a special price of $149,\nfor a limited time, on Amazon or www.bioheart.com. The app is available on\nApple's App Store and on Google Play.\n\n     About Biotricity Inc.\n\n     Biotricity is reforming the healthcare market by bridging the gap in\nremote monitoring and chronic care management. Doctors and patients trust\nBiotricity's unparalleled standard for preventive &amp; personal care,\nincluding diagnostic and post-diagnostic solutions for chronic conditions.\nThe company develops comprehensive remote health monitoring solutions for\nthe medical and consumer markets. To learn more, visit www.biotricity.com.\n\n     Bioheart name, logo, and tag lines are trademarks of Biotricity Inc.\nUS and International Patents Pending. Bioheart does not require a\nprescription.\n\n     Bioheart does not diagnose, treat, or repair heart disease. Bioheart\nis not intended to be a diagnostic tool, or for clinical use, or clinical\ninterpretation, and is meant to be a lifestyle and wellness solution for\nindividuals. If users of the Bioheart are concerned about the data obtained\nfrom the device, they should consult a medical professional directly for\nfurther advice. Biotricity disclaims any representation made, whether\nexplicitly or implicitly, which would suggest the accuracy of the data\nobtained is suitable for clinical interpretation.\n\n     Bioheart as described herein, and subsequent versions, may or may not\nbe the same as advertised and may or may not differ in features and\nfunctionality. Any statements made herein in relation to Bioheart, its\nfeatures, functionality are based on design and concepts that the company\nbelieve are achievable, but the functionality may be different.\n\n     Important Cautions Regarding Forward-Looking Statements\n\n     Any statements contained in this press release that do not describe\nhistorical facts may constitute forward-looking statements. Forward-looking\nstatements, which involve assumptions and describe our future plans,\nstrategies, and expectations, are generally identifiable by use of the\nwords \"may,\" \"should,\" \"would,\" \"will,\" \"could,\" \"scheduled,\" \"expect,\"\n\"anticipate,\" \"estimate,\" \"believe,\" \"intend,\" \"seek,\" \"project,\" or \"goal\"\nor the negative of these words or other variations on these words or\ncomparable terminology. Forward-looking statements may include, without\nlimitation, statements regarding (i) the plans, objectives and goals of\nmanagement for future operations, including plans, objectives or goals\nrelating to the design, development and commercialization of Bioflux or any\nof the Company's other proposed products or services, (ii) a projection of\nincome (including income/loss), earnings (including earnings/loss) per\nshare, capital expenditures, dividends, capital structure or other\nfinancial items, (iii) the Company's future financial performance, (iv) the\nregulatory regime in which the Company operates or intends to operate and\n(v) the assumptions underlying or relating to any statement described in\npoints (i), (ii), (iii) or (iv) above. Such forward-looking statements are\nnot meant to predict or guarantee actual results, performance, events or\ncircumstances and may not be realized because they are based upon the\nCompany's current projections, plans, objectives, beliefs, expectations,\nestimates and assumptions and are subject to a number of risks and\nuncertainties and other influences, many of which the Company has no\ncontrol over. Actual results and the timing of certain events and\ncircumstances may differ materially from those described by the\nforward-looking statements as a result of these risks and uncertainties.\nFactors that may influence or contribute to the inaccuracy of the\nforward-looking statements or cause actual results to differ materially\nfrom expected or desired results may include, without limitation, the\nCompany's inability to obtain additional financing, the significant length\nof time and resources associated with the development of its products and\nrelated insufficient cash flows and resulting illiquidity, the Company's\ninability to expand the Company's business, significant government\nregulation of medical devices and the healthcare industry, lack of product\ndiversification, existing or increased competition, results of arbitration\nand litigation, stock volatility and illiquidity, and the Company's failure\nto implement the Company's business plans or strategies. These and other\nfactors are identified and described in more detail in the Company's\nfilings with the SEC. There cannot be any assurance that the Company will\never become profitable. During the three months ended June 30, 2020 the\nCompany incurred a net loss attributable to common stockholders of $3.4\nmillion. The Company assumes no obligation to update any forward-looking\nstatements in order to reflect any event or circumstance that may arise\nafter the date of this release.\n\n     CONTACTS\nMedia\nBospar\nprforbiotricity@bospar.com\n\n     Investor relations\nBiotricity Investor Relations\nInvestors@biotricity.com\n1.800.951.3348\n\n     Mark Forney\nMKR Group, Inc.\n12198 Ventura Blvd., Suite 200\nLos Angeles, CA 91604\nmark@mkrir.com\n\n<a href=\"https://www.biotricity.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.biotricity.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2136100035.MNPRE2136100676-15261920211228</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}