{"date": "2022-01-17 11:00:00.177000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwlistdisc{list-style-type:disc;}</style><p class=\"bwalignc\">\n<b>TD SYNNEX</b> <b>Announces New Strategic Collaboration Agreement with AWS</b>\n</p><p class=\"bwalignc\">\n<span>The strategic collaboration agreement will allow for better customer service and provide new offerings.</span>\n</p><p>\nToday, TD SYNNEX Corporation announced a new strategic collaboration agreement (SCA) with Amazon Web Services, Inc. (AWS).\n</p><p>\nThe SCA provides investment in resources to help small and medium-sized businesses and public sector organizations expand their digital business offerings by leveraging an enhanced range of AWS Cloud services. The agreement covers the North America, Latin America, and Caribbean regions, building off the momentum and success of a similar SCA that was executed in Europe in 2020.\n</p><p>\n“Over the last 18 months, we have seen a significant rise in demand and adoption of cloud solutions as businesses look to expand their digital offerings,” said Ruba Borno, vice president of Worldwide Channels &amp; Alliances at AWS. “We are very excited to expand our relationship with TD SYNNEX and help businesses expand their customer base and bring new products to market.”\n</p><p>\nThe strategic collaboration agreement will provide a significant expansion of cloud solutions for independent software vendors (ISV) and partners throughout the channel. The SCA demonstrates a committed investment in cloud technology that will enable partners to expand their offerings to reach larger markets.\n</p><p>\nThe benefits of this strategic collaboration include:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\nPersonnel commitments to aid businesses in implementing cloud technology to enhance partnerships, including additional resources for marketing, sales, technical, and project management.\n</li>\n</ul><ul class=\"bulleted-list arrowlist\">\n<li>\nAWS-specific enablement resources that will provide partners with the tools, knowledge, and resources to quickly accelerate their AWS practices.\n</li>\n</ul><ul class=\"bulleted-list arrowlist\">\n<li>\nReinforcement of existing AWS services, offering a comprehensive range of services and solutions that help identify and remove high-risk issues and build long-term business relationships and trust among customers.\n</li>\n</ul><p>\n\"The new agreement builds upon a strong existing relationship with AWS; as such, TD SYNNEX is excited to expand our portfolio of offerings to partners that deliver business outcomes today and further unlock the future,\" said Mike Ward, vice president of Cloud Solutions, North America, TD SYNNEX. \"With additional AWS solutions added to our vast portfolio, we're able to enrich the breadth and depth of our offerings so partners can continue to receive the best support we have to offer.\"\n</p><p>\n“TD SYNNEX has been a great partner for us in enabling us to effectively build and scale our AWS practice,” said John Zemonek, Managing Partner of Aligned Technology Group. “The investment in TD SYNNEX through the AWS SCA will drive new opportunities that help us better serve customers in achieving their business objectives with innovative solutions on AWS.”\n</p><p>\n<b>About TD SYNNEX</b>\n</p><p>\nTD SYNNEX (NYSE: SNX) is a leading global distributor and solutions aggregator for the IT ecosystem. We're an innovative partner helping more than 150,000 customers in 100+ countries to maximize the value of technology investments, demonstrate business outcomes and unlock growth opportunities. Headquartered in Clearwater, Florida, and Fremont, California, TD SYNNEX' 22,000 co-workers are dedicated to uniting compelling IT products, services and solutions from 1,500+ best-in-class technology vendors. Our edge-to-cloud portfolio is anchored in some of the highest-growth technology segments including cloud, cybersecurity, big data/analytics, IoT, mobility and everything as a service. TD SYNNEX is committed to serving customers and communities, and we believe we can have a positive impact on our people and our planet, intentionally acting as a respected corporate citizen. We aspire to be a diverse and inclusive employer of choice for talent across the IT ecosystem. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.TDSYNNEX.com&amp;esheet=52563521&amp;newsitemid=20220117005118&amp;lan=en-US&amp;anchor=www.TDSYNNEX.com&amp;index=1&amp;md5=5facf57429a77e86b29c3c9704ec8695\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.TDSYNNEX.com</a> or follow us on <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Ftwitter.com%2FTDSYNNEX&amp;esheet=52563521&amp;newsitemid=20220117005118&amp;lan=en-US&amp;anchor=Twitter&amp;index=2&amp;md5=67a62a18c8319dab39d11dee8a7cd7c0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Twitter</a>, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Ftdsynnex%2F&amp;esheet=52563521&amp;newsitemid=20220117005118&amp;lan=en-US&amp;anchor=LinkedIn&amp;index=3&amp;md5=6cad11d826b810b3eb8360ba78e18562\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LinkedIn</a>, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.facebook.com%2FTDSYNNEX&amp;esheet=52563521&amp;newsitemid=20220117005118&amp;lan=en-US&amp;anchor=Facebook&amp;index=4&amp;md5=91a15af858cfb118da4853c9c8ab851c\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Facebook</a> and <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.instagram.com%2Ftdsynnex%2F&amp;esheet=52563521&amp;newsitemid=20220117005118&amp;lan=en-US&amp;anchor=Instagram&amp;index=5&amp;md5=fa035251829265d92f5406736215b188\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Instagram</a>.\n</p><p>\n<b>Safe Harbor Statement</b>\n</p><p>\nStatements in this news release that are \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934 involve known and unknown risks and uncertainties which may cause the Company's actual results in future periods to be materially different from any future performance that may be suggested in this release. The Company assumes no obligation to update any forward-looking statements contained in this release.\n</p><p>\n© 2022 TD SYNNEX Corporation. TD SYNNEX, the TD SYNNEX Logo, and all other TD SYNNEX company, product and services names and slogans are trademarks of TD SYNNEX Corporation. Other names and trademarks are the property of their respective owners.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20220117005118r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjIwMTE3MDA1MTE4cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=f49d06388cd717777baf03c2a710c3b9618be44b42725dad7e2fa4669d0bb541b06f63535a46dd62a83e4f86db1073c4595e66da6abede396e79f9c32680f4ac\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20220117005118/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220117005118/en/</a></span></p><p>\n<b>Media Contact \n</b><br/>Bobby Eagle\n<br/>Global External Communications Director\n<br/>TD SYNNEX\n<br/>+1 (727) 538-5864\n<br/><a href=\"mailto:bobby.eagle@techdata.com\" data-type=\"email\" translate=\"no\">bobby.eagle@techdata.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2022</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: CA-TD-SYNNEX</p></div>"}