{"date": "2022-02-09 13:38:11.970000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The Supreme Court (SC) has asked Future Group to respond to Amazon\u0092s special leave petition which challenged Delhi High Court\u0092s (HC) divisional bench order last month staying the Singapore International Arbitration Centre (SIAC) arbitration proceedings in the Amazon-Future case.</p><p>The matter was adjourned and will next be heard on February 23. The matter was heard by Chief Justice N V Ramana, Justice A S Bopanna and Justice Hima Kohli.</p></div><div class=\"tr-npp-body\"><p>The Amazon-Future Group arbitration was going on between a three-member arbitration tribunal over the deal between Future Group and Reliance Industries worth Rs 24,500 crore.</p><p>Amazon approached the SIAC in October 2020 after Future Group\u0092s deal with Reliance Industries citing a non-compete agreement with the Kishore Biyani-led chain. Amazon's 2019 deal with Future Group (stake purchase in Future Coupons) specified any disputes would be arbitrated under the SIAC rules. The same month, Amazon got a favourable ruling for its plea in the SIAC against the Future-Reliance deal.</p><p>In November 2020, Future Group moved the HC against Amazon, alleging interference by the ecommerce firm in the deal. Since then, Amazon has been fighting a legal battle with Future Group to stop the latter's deal with Reliance Industries.</p><p>On Tuesday, SC had rejected Amazon\u0092 petition to file a seven-page written submission, five days after the apex court reserved its order on Future Group\u0092s plea to go ahead with National Company Law Tribunal (NCLT) proceedings for its proposed deal with Reliance Industries.</p><p>In January, Future Group also approached SC for approval to proceed with its deal with Reliance Industries. Future Group had stated that it requires necessary approvals from the Competition Commission of India (CCI) and the NCLT for its deal with Reliance Industries to move ahead.</p><p>Last week, Future Retail also approached SC to allow it two weeks\u0092 time to come up with a resolution to pay lenders so as to avoid the non-performing asset (NPA) tag. In SC, the lenders' counsel said that Amazon and Reliance are flush with funds and should agree to an open bid for Future Group\u0092s assets. Lenders also said that their exposure to Future Retail is Rs 17,000 crore and if pushed by a year it will grow to Rs 25,000 crore.</p><p>Lenders could consider any restructuring proposal from the company management under prudential framework for resolution of stressed assets put in place in June 2019 by Reserve Bank of India. This is subject to proceedings in the SC where the company sought time to work out a settlement.</p><p>Such an option (resolution under June 2019 norms) could make room for a six-month resolution and create prospects of upgrading the account based on performance.</p><p>In December 2021, the CCI suspended Amazon\u0092s 2019 deal with Future Coupons for its alleged deliberate design to suppress information about the scope and purpose of the deal and imposed a penalty of Rs 200 crore on Amazon which is to be paid within 60 days of receipt of the order.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Business Standard Ltd.</p></div>"}