{"date": "2021-11-30 16:10:36.453000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SMOKEFREE INNOTEC INC (\"SFIO-0\")\n- SFIO and NeuroSky sign $15-M partnership to bring biotech\n- wearables to global markets\n\n     Starfleet Innotech, Inc. (Smokefree Innotec, Inc.) and biotech company\nNeuroSky signed an agreement earlier this month, awarding the asset\nmanagement company distribution rights of NeuroSky's state-of-the-art\nhealth and wellness monitoring devices. As part of SFIO's broad campaign to\nbuild synergies across their core investment areas, the company plans to\nsell an initial batch of at least 100,000 wearables through partners in\nhealth, construction, education, and other related industries.\n\n     NeuroSky is a Silicon Valley-based, private biotech company that\nspecializes in electronic wearables such as watches, wrist bands, and\nheadsets. Depending on the device, features include vital sign monitoring,\nsymptom tracking for conditions such as viral infections, and brainwave\ntracking to help enhance one's learning abilities.\n\n     The agreement grants SFIO exclusive rights to sell NeuroSky products\nin New Zealand and the United Arab Emirates. SFIO also has non-exclusive\ndistribution rights in Malaysia, Singapore, Thailand, the United States,\nand other countries yet to be determined.\n\n     Tapping their partners across health, construction, education, and\nsimilar industries, SFIO intends to position these wearables as a\nquantitative way to ensure community health in a post-pandemic world,\nfocusing on the communities that have proven to be most vulnerable to\ncommunicable diseases.\n\n     As an initial project, SFIO will be rolling out these devices to\nretirement villages, where residents will be able to both monitor their\nwellbeing and automatically alert medical staff and loved ones with SOS\nnotifications in case of health emergencies picked up by the wearables.\n\n     Educators and researchers will also benefit from NeuroSky's brainwave\nmonitoring technologies. While initially designed to facilitate more\ndata-driven meditation practices, these head-mounted wearables have\nscientifically-proven use cases in improving performance in the classroom\nas well.\n\n     For the first eighteen months, SFIO aims to sell at least 100,000\nunits of NeuroSky's wearables, including their flagship BioSense HR watch.\nSFIO expects this venture to generate $10 to $15 million in revenue.\n\n     In addition to selling to enterprise partners, SFIO will also be\nmaking these devices available to interested buyers through e-commerce\nplatforms like Amazon, and other commercial channels via sub-distributors.\n\n     Beyond distribution, SFIO has larger plans to launch its own brand of\nhealth tracking wearables, with their in-house software development teams\nworking alongside NeuroSky's product designers and engineers.\n\n     These new products will be manufactured by NeuroSky and will fall\nunder a new \"white label\" brand currently being developed by SFIO.\n\n     For media enquiries, please\n\n Contact Information:\n\ncontact:\nCraymond Yeong, PR &amp; Marketing Specialist\nEpiphany Cafe\nPhone: (+64) 21 0833 2966\nEmail: info@sfio.co.nz\n\n     About Starfleet Innotech, Inc.\nStarfleet Innotech, Inc. (OTC: SFIO) is an Asset Management Company, and is\na conglomerate of several companies with five strategic business divisions,\nnamely: franchising, food manufacturing and distribution, coffee business,\nproperty development, as well as technology and software development - all\nof which currently have a strong presence in New Zealand, Australia, and\nthe Philippines.\n\n     SFIO is the new owner and operator of Epiphany Cafe Franchise Group,\nArdent Bakers, Gorgeous Coffee Co., A+ Electrical, AG Architects, Accord\nInvestment Group (AIG), MLV Accounting, The Global Academy NZ and Big Lou's\nDonuts following the successful acquisition of Agrokings, Inc.\n\n     About NeuroSky\nNeuroSky technologies enable the most insightful and easy-to-understand\nhealth and wellness biometrics for mobile solutions, wearable devices, and\nservice providers. The company's proprietary, market-leading biosensor\ntechnologies provide a foundation for analyzing biometric data in a way\nthat's never before been practical. NeuroSky-enabled solutions deliver\nunique insights into body and mind health and wellness that can motivate\npeople to make better lifestyle choices. NeuroSky was founded in 2006, and\nis headquartered in San Jose, California with offices in Asia and Europe.\nLearn more at www.neurosky.com\n\nTel   : 1-775-434-0864    SMOKEFREE INNOTEC INC (NV)\nWWW   : <a href=\"http://www.smokefree-innotec.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.smokefree-innotec.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133300410.MNPRE2133302354-07442720211130</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}