{"date": "2022-02-22 19:45:32+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n        Cross-disciplinary leaders and builders will gather this summer for immersive technology-focused sessions, including visionary talks, interactive workshops, technical deep dives, roundtables, and hands-on demos.\n      </div>\n                <div>\n                  <p>\n          re:MARS is back. The event brings together some of the brightest leaders in science, academia, and business to explore innovation, scientific advancements, and practical applications of the MARS Domains (Machine Learning, Automation, Robotics, and Space). This year, re:MARS is scheduled as an in-person event, June 21-24, at the ARIA Resort and Casino in Las Vegas, Nevada. Business leaders and technical builders will learn, share, and imagine how the four MARS fields of study will shape the future.\n        </p>\n                  <div>\n                    <div>\n                      <span>\n                        <a href=\"https://remars.amazonevents.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">A peek into Amazon re:MARS 2022</a>\n                      </span>\n                    </div>\n                    <div>\n                      <span>\n                        <a href=\"https://remars.amazonevents.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Watch now</a>\n                      </span>\n                    </div>\n                  </div>\n                  <p>\n          AI and ML drive many of Amazon's processes. Some processes are highly visible, such as the company's autonomous <span><a href=\"https://www.aboutamazon.com/news/transportation/a-drone-program-taking-flight\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Prime Air delivery drones</a></span>, <span><a href=\"https://www.aboutamazon.com/news/retail/amazon-fresh-grocery-store-meet-just-walk-out-shopping\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Go</a></span>(stores without checkout lines), and <span><a href=\"https://www.aboutamazon.com/what-we-do/devices-services\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Alexa</a></span>. Others work below the surface, contributing to Amazon's package-delivery speeds, broad selection of products, low prices, and consumer analytics. In addition, AWS continues to offer unrivaled breadth and depth of AI and ML products and services to customers of all sizes.\n        </p>\n                  <p>\n          \"We're at the beginning of a golden age of AI,\" said Jeff Bezos, founder and executive chair of Amazon. \"Recent advancements have already led to inventions that previously lived in the realm of science fiction-and we've only scratched the surface of what's possible. AI is an enabling technology that can improve products and services across all industries. We're excited to offer re:MARS, bringing together leaders and builders from diverse areas to share learnings and spark new ideas for future innovation.\"\n        </p>\n                  <div>\n                    <div>\n                      <span>\n                        <a href=\"https://www.aboutamazon.com/news/aws/aws-course-aims-to-reimagine-the-machine-learning-industry\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS course aims to reimagine the machine learning industry</a>\n                      </span>\n                    </div>\n                    <div>\n            As machine learning remakes global industries, developers need a diversity of brain power.\n          </div>\n                    <div>\n                      <span>\n                        <a href=\"https://www.aboutamazon.com/news/aws/aws-course-aims-to-reimagine-the-machine-learning-industry\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read more</a>\n                      </span>\n                    </div>\n                  </div>\n                  <p>\n          re:MARS is an extension of MARS, the intimate, invite-only event hosted by Bezos that embraces an optimistic vision for scientific discovery to advance a golden age of innovation. Embodying the same spirit of MARS, re:MARS combines the latest in forward-looking science with practical applications that will initiate change in organizations today. Attendees learn how the MARS domains can improve the customer experience, drive business efficiency, streamline operations, improve automation, reach customers through new services and interfaces, and more.\n        </p>\n                  <p>\n          re:MARS brings together innovative minds with diverse skillsets. The event is for business leaders and technical builders (including, but not limited to developers, engineers, data scientists, ML experts, and roboticists) who want to learn, share, and use AI to initiate change in organizations today.\n        </p>\n                  <div>\n                    <div>\n                      <span>\n                        <a href=\"https://www.aboutamazon.com/news/innovation-at-amazon/6-tips-from-jeff-bezos-re-mars-fireside-chat\" data-type=\"url\" class=\"tr-link\" translate=\"no\">6 tips from Jeff Bezos' re:MARS fireside chat</a>\n                      </span>\n                    </div>\n                    <div>\n            Jeff Bezos speaks candidly at re:MARS, on getting support for ideas, big bets, knowing when to throw in the towel, and more.\n          </div>\n                    <div>\n                      <span>\n                        <a href=\"https://www.aboutamazon.com/news/innovation-at-amazon/6-tips-from-jeff-bezos-re-mars-fireside-chat\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read more</a>\n                      </span>\n                    </div>\n                  </div>\n                  <p>\n          Ultimately, we want participants to have fun, foster new friendships and collaborations, and find inspiration.\n        </p>\n                  <p>\n                    <span>\n                      <a href=\"https://remars.amazonevents.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Sign up for re:MARS email updates</a>\n                    </span>to learn about speakers, logistics and pricing information, and agenda details when re:MARS registration opens in March. Interested sponsors can reach the program at <span><a href=\"mailto:remars-sponsorship@amazon.com\" data-type=\"email\" translate=\"no\">remars-sponsorship@amazon.com</a></span>.\n        </p>\n                  <div>\n                    <div>\n            re:MARS FAQs\n          </div>\n                    <ul class=\"bulleted-list arrowlist\">\n                      <li>\n                        <div>\n                          <div>\n                  What is the goal?\n                </div>\n                          <div>\n                  re:MARS attendees explore the future of AI innovation across machine learning, automation, robotics, and space. The event combines the latest in forward-looking science with practical applications that translate customer problems into real-world technical solutions. Attendees hear from thought leaders across fields, learn about proven AI best practices, and immerse themselves in breakthrough technology. Our goal is to help you disrupt and innovate faster by arming you with business best practices and technical acumen to adopt AI technologies for your business.\n                </div>\n                        </div>\n                      </li>\n                      <li>\n                        <div>\n                          <div>\n                  Who should attend?\n                </div>\n                          <div>\n                  re:MARS brings together innovative minds with diverse skillsets. The event is for business leaders and technical builders (including developers, engineers, data scientists, ML experts, and roboticists) who want to learn, share, and use AI to initiate change in organizations today.\n                </div>\n                        </div>\n                      </li>\n                      <li>\n                        <div>\n                          <div>\n                  What's behind the name?\n                </div>\n                          <div>\n                  re:MARS is inspired by MARS, the annual invite-only conference for machine learning, automation, robotics, and space that embraces an optimistic vision for scientific discovery to advance a golden age of innovation. re:MARS embodies the spirit of MARS, expands the discussion to business leaders and technical builders, and showcases practical applications of AI technologies to help drive real business impact today.\n                </div>\n                        </div>\n                      </li>\n                      <li>\n                        <div>\n                          <div>\n                  How do re:MARS and re:Invent compare?\n                </div>\n                          <div>\n                  re:MARS focuses on technologies across the fields of machine learning, automation, robotics, and space, and combines the latest in forward-looking science and research with practical applications that will drive impact in your organization today. In contrast, AWS re:Invent is an education conference where customers learn, build, and innovate with AWS products and services, including compute, storage, AI/ML, databases, analytics, networking, and security. At re:Invent, customers get hands-on experience with the tools and content they need to develop cloud solutions and architectures. re:Invent is for anyone who is using or interested in using AWS services and solutions.\n                </div>\n                        </div>\n                      </li>\n                    </ul>\n                  </div>\n                </div>\n                <div>\n                  <div>\n          Related Tags\n        </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/aws\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/re-mars\" data-type=\"url\" class=\"tr-link\" translate=\"no\">re:MARS</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/machine-learning\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Machine learning</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/artificial-intelligence\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Artificial intelligence</a>\n                    </span>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/aws/amazon-re-mars-returns-to-explore-ml-automation-robotics-and-space\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>22 February 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>22 February 2022 19:45:32 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}