{"date": "2022-01-26 14:00:07.669000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">- SPINS Omni-Intelligence offers an unparalleled view of eCommerce and proprietary data across retail channels with enhanced views and capabilities from SPINS Product Intelligence</h2>\n<h2 class=\"xn-hedline\">- Acquisition of ClearCut Analytics opens Amazon data to provide the most complete view of the market for clients and partners</h2>\n<h2 class=\"xn-hedline\">- Rapid and persistent behavioral shifts from consumers to prioritize their wellness journeys accelerates need for omnichannel intelligence</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">CHICAGO, Jan. 26, 2022</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">CHICAGO</span>, <span class=\"xn-chron\">Jan. 26, 2022</span> /PRNewswire/ -- The pandemic changed consumer shopping behaviors in impactful ways and data shows these behaviors continuing – especially in the health and wellness industry. Consumers are prioritizing wellness for themselves and their families and seek to be better informed about the products they use, so they traverse retail channels to find the products that meet their needs. These consumer shifts have left data blind spots for brands and retailers as they serve their customers. SPINS – an advocate and leading data provider for the health and wellness industry for the past two decades – can now fill the blind spots with omnichannel data which allows brands and retailers to have the most extensive view of shopping habits across the industry.  </p>\n\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/380199/SPINS_LLC_Logo.html\">\n                    <div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"SPINS LLC www.spins.com\" src=\"https://mma.prnewswire.com/media/380199/SPINS_LLC_Logo.jpg\" title=\"SPINS LLC www.spins.com\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMzgwMTk5L1NQSU5TX0xMQ19Mb2dvLmpwZw==&amp;key=7786d76acb557b5728a8aeb26509115d83e79e969114784fe4b9d85dc2d68cf388ab1eda1077a4d7ca504b5ed27853ec3c36b43bc1caa5643fbd05f45c68aeea\"/></div></div>\n                        </a>\n                </p>\n\n    </div>\n<p>SPINS accesses the broadest selection of data from across retail channels, including natural-enhanced, regional grocery, conventional, pet, and now Amazon. SPINS enhances this data with Product Intelligence that makes data smarter, more valuable, and easily usable in an array of applications for retailers, brands, and the ecosystem that serves the health and wellness industry. </p>\n<p>For retailers, SPINS data delivers key channel, category, and store level performance metrics, insight to emerging innovation, and the ability to inform shoppers with personalized experiences. The availability of Amazon data and SPINS proprietary data, both enhanced with Product Intelligence, extends retailers' ability to understand emerging trends and merchandise the innovative products their customers need. </p>\n<p>\"Consumer shopping trends have been trending toward health and wellness and across channels for decades. Today, with eCommerce innovation and pandemic induced changes, shifts in shopping habits are continuing to evolve and brands and retailers are adapting to this new reality,\" said <span class=\"xn-person\">Tony Olson</span>, CEO, SPINS. \"SPINS remains a trusted partner and supporter of the health and wellness industry and will continue to make investments that allow our brand and retail partners to be competitive and successful.\" </p>\n<p>In this environment, brands need to meet their customers where they are – in store and online. Brands play a critical role innovating with new products to meet consumer needs as they pursue wellness. Consumers want information on the products they buy, and they are willing to search across retail options for products that meet their needs. With the addition of Amazon data delivered by ClearCut Analytics, SPINS can provide brands with a roadmap for omnichannel growth. </p>\n<p><b>ClearCut Analytics Acquisition</b></p>\n<p>Founded in 2018, based in <span class=\"xn-location\">Chicago, Illinois</span>, ClearCut Analytics is a retail analytics provider on a mission to support CPG brands make critical decisions with confidence and drive sustainable business growth.</p>\n<p>\"The decision for ClearCut to join the SPINS family was an easy one. Both companies share an entrepreneurial spirit, value candid collaboration, and aspire to learn as we grow,\" said <span class=\"xn-person\">Patrick Mclaughlin</span>, Co-Founder of ClearCut Analytics. \"It has been exciting to watch the ClearCut team settle in and excel in their new roles at SPINS. The number of brands and retailers using ClearCut data is growing daily and is having a positive impact on all sizes of business.\"</p>\n<p>With billions of dollars in eCommerce and Amazon sales data analyzed, ClearCut's intelligence delivers actionable insights into today's complex retail marketplace to power successful product innovation, optimize cross-channel performance, and outmaneuver an expanding set of competitors. Beyond its technology, ClearCut's team of experts ensures companies are equipped with a roadmap and partner for success in the digital era for consumer goods.</p>\n<p>\"SPINS acquired ClearCut in summer of 2021 and we've begun rolling out joint solutions which will become ever more closely integrated. The decision to add ClearCut to the SPINS family made sense as both companies are mission aligned and accelerated the omnichannel solutions our customers need,\" said <span class=\"xn-person\">Jay Lovelace</span>, Chief Commercial Officer, SPINS. \"Omni-Intelligence is a major part of the discussions our sales force is having today, and SPINS has the strongest solution in the industry to meet brands and retailers' needs.\"</p>\n<p><span>For more information on SPINS Omni-Intelligence, click <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3424194-1&amp;h=3358222822&amp;u=https%3A%2F%2Fwww.spins.com%2Fomni-intelligence%2F&amp;a=here\"><b>here</b></a>. </span></p>\n<p><b>About SPINS<br/></b>SPINS LLC is a wellness-focused data company and advocate for the Natural Products Industry. Over the past two decades, the wide adoption of SPINS' Product Intelligence has led to a common language used across the industry as well as laid the foundation for the next generation of innovation, while providing dynamic data, actionable insights, and digital activation solutions that drive growth for our clients &amp; partners and contribute to a healthier and more vibrant America. Learn more at <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3424194-1&amp;h=2162846738&amp;u=http%3A%2F%2Fwww.spins.com%2F&amp;a=www.spins.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.spins.com</a>.</p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n</div>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=CG42338&amp;sd=2022-01-26\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1DRzQyMzM4JnNkPTIwMjItMDEtMjY=&amp;key=619b1039b1f270921375f0127b2ddf9b3e0b03372ebed07670d673bbdeadad27c26f356d75e20be1e2c910b115af6fbdc5a2cd124e9811f9f86bcf28e6e88662\"/></div></div> View original content to download multimedia:<a href=\"https://www.prnewswire.com/news-releases/spins-launches-most-extensive-omni-intelligence-view-for-the-health-and-wellness-industry-301468564.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/spins-launches-most-extensive-omni-intelligence-view-for-the-health-and-wellness-industry-301468564.html</a><p></p>\n<p>SOURCE  SPINS</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: IL-SPINS-omni-intel</p></div>"}