{"date": "2021-12-11 19:15:16.259000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3444.24, "close": 3381.83}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">NEW YORK, Nov. 29, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">NEW YORK</span>, <span class=\"xn-chron\">Nov. 29, 2021</span> /PRNewswire/ -- <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3372842-1&amp;h=2659007039&amp;u=https%3A%2F%2Fwww.datadoghq.com%2F&amp;a=Datadog\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Datadog</a></u>, Inc. (NASDAQ: DDOG), the monitoring and security platform for cloud applications, announced today that it has achieved <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3372842-1&amp;h=2903022800&amp;u=https%3A%2F%2Faws.amazon.com%2Fnetworking%2Fpartner-solutions&amp;a=Amazon+Web+Services+(AWS)+Migration+%26+Modernization+Competency+status+for+AWS+Partners\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Web Services (AWS) Migration &amp; Modernization Competency status for AWS Partners</a></u>. This designation recognizes that Datadog has demonstrated technical proficiency and proven customer success automating and accelerating customer application migration and modernization journeys.</p>\n\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/1434744/Datadog_Logo.html\">\n                    <div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"(PRNewsfoto/Datadog, Inc.)\" src=\"https://mma.prnewswire.com/media/1434744/Datadog_Logo.jpg\" title=\"(PRNewsfoto/Datadog, Inc.)\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMTQzNDc0NC9EYXRhZG9nX0xvZ28uanBn&amp;key=d2e73770401301a063067f8c59d6df4eaf7d5632f8c91d3efca0115719fe1b6a7dd43a75130828352d3838cbd9cbcb82c9ca7a3a4b3dd368c9a310f641e869b7\"/></div></div>\n                        </a>\n                </p>\n\n    </div>\n<p>AWS launched the AWS Migration &amp; Modernization Competency to allow customers to easily and confidently engage highly specialized AWS Partners that help AWS customers modernize their applications, either before or after they are moved to AWS. The AWS Migration &amp; Modernization Competency takes on the heavy lifting of identifying and validating industry leaders with proven customer success and technical proficiency in migration and application modernization tooling.</p>\n<p>Achieving the AWS Migration &amp; Modernization Competency differentiates Datadog as an AWS Partner with deep domain expertise delivering software products that help customers embrace cloud and application transformation, reducing licensing costs, optimizing operational costs, and improving performance, agility, and resiliency. These tools can perform an application portfolio assessment, identifying the applications that are candidates for modernization; augment and automate developer tasks to carry out the modernization of legacy applications.</p>\n<p>\"Datadog is proud to achieve the new AWS Migration &amp; Modernization Competency status,\" said <span class=\"xn-person\">Ilan Rabinovitch</span>, Senior Vice President, Product and Community at Datadog. \"Our team is dedicated to helping companies achieve their business transformation goals by providing deep visibility into AWS, on-premises and hybrid environments during every phase of a cloud migration. This visibility enables organizations to move to the cloud with greater confidence.\"</p>\n<p>\"The AWS Migration &amp; Modernization Competency raises the bar again by choosing to solve the hardest challenge faced in application migration and modernization,\" said <span class=\"xn-person\">Bill Platt</span>, General Manager, AWS Migration Services. \"I am confident that solutions, validated by the AWS Migration &amp; Modernization Competency, will provide a complete portfolio of migration and modernization solutions to customers and partners.\"</p>\n<p>AWS is enabling scalable, flexible, and cost-effective solutions for organizations ranging from startups to global enterprises. To support the seamless integration and deployment of these solutions, AWS established the AWS Competency Program to help customers identify AWS Partners with deep industry experience and expertise.</p>\n<p>Datadog's cloud monitoring platform brings together infrastructure metrics, application traces, log data, and synthetic monitoring, allowing organizations to improve their agility to reduce their time to market, reduce risk during the modernization of their infrastructure and applications, reduce their operational and development costs, and enable visibility across the stack for all teams and stakeholders. Datadog supports a wide range of AWS services and is a member of the AWS Partner Network (APN).</p>\n<p>For more information about Datadog's solutions for AWS, please visit: <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3372842-1&amp;h=3570647965&amp;u=https%3A%2F%2Fwww.datadoghq.com%2Fsolutions%2Faws%2F&amp;a=https%3A%2F%2Fwww.datadoghq.com%2Fsolutions%2Faws%2F\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.datadoghq.com/solutions/aws/</a>.</p>\n<p><b>About Datadog<br/> <br/></b>Datadog is the monitoring and security platform for cloud applications. Our SaaS platform integrates and automates infrastructure monitoring, application performance monitoring and log management to provide unified, real-time observability of our customers' entire technology stack. Datadog is used by organizations of all sizes and across a wide range of industries to enable digital transformation and cloud migration, drive collaboration among development, operations, security and business teams, accelerate time to market for applications, reduce time to problem resolution, secure applications and infrastructure, understand user behavior and track key business metrics.</p>\n<p><b>Forward-Looking Statements</b></p>\n<p>This press release may include certain \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, or the Securities Act, and Section 21E of the Securities Exchange Act of 1934, as amended, including statements on the benefits of new products and features. These forward-looking statements reflect our current views about our plans, intentions, expectations, strategies and prospects, which are based on the information currently available to us and on assumptions we have made. Actual results may differ materially from those described in the forward-looking statements and are subject to a variety of assumptions, uncertainties, risks and factors that are beyond our control, including those risks detailed under the caption \"Risk Factors\" and elsewhere in our Securities and Exchange Commission filings and reports, including the Quarterly Report on Form 10-Q filed with the Securities and Exchange Commission on <span class=\"xn-chron\">November 5, 2021</span>, as well as future filings and reports by us. Except as required by law, we undertake no duty or obligation to update any forward-looking statements contained in this release as a result of new information, future events, changes in expectations or otherwise.</p>\n<p><b>Contact<br/></b><span class=\"xn-person\">Dan Haggerty</span><br/><a href=\"mailto:press@datadoghq.com\" data-type=\"email\" translate=\"no\">press@datadoghq.com</a> </p>\n<p> </p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n</div>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=NY90063&amp;sd=2021-11-29\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1OWTkwMDYzJnNkPTIwMjEtMTEtMjk=&amp;key=55771e81d915a77106b0cb8987ccaa9b641b9ddff25b730e80e55c7d5bbd310e98fe53f2b97a0c5824911328005f4dea642eb59c00309cc535341c5495e38215\"/></div></div> View original content to download multimedia:<a href=\"https://www.prnewswire.com/news-releases/datadog-achieves-aws-migration--modernization-competency-status-301433141.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/datadog-achieves-aws-migration--modernization-competency-status-301433141.html</a><p></p>\n<p>SOURCE  Datadog, Inc.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: DATADOG-AWS</p></div>"}