{"date": "2022-02-02 19:30:15+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3023.87, "close": 2776.91}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The Day Ahead is an email and PDF publication that includes the day's major stories and events, analyses and other features. To receive The Day Ahead, Eikon users can register at <a href=\"reuters://REALTIME/verb=Headlines/ric=DAY/US\" data-type=\"newsExpression\" data-expression=\"DAY/US\" translate=\"no\" dir=\"ltr\">DAY/US</a>. Thomson One users can register at RT/DAY/US. All times in ET/GMT</p><p class=\"tr-story-p1\"></p><p><br/></p><p>Amazon.com Inc is expected to show a fall in fourth-quarter profit, hurt by escalating costs amid supply chain issues, new logistics investments and other COVID-19-related spending. Revenue is expected to grow at its slowest pace since the pandemic as it caps strong sales from last year when consumers were heavily dependent on online shopping.</p><p><br/></p><p>The number of Americans filing new claims for unemployment benefits is expected to decrease to 245,000 for the week ended Jan. 29, from 260,000 in the previous week. Meanwhile, the Commerce Department's report is expected to show factory orders edging 0.2% lower in December, following a 1.6% gain in November. Separately, ISM's non-manufacturing activity index is expected to fall to 59.5 in January from a reading of 62.0 in the previous month. (1000/1500) Markit services and composite PMI data for January is also scheduled for release. (0945/1445)</p><p><br/></p><p>Ford Motor Co is scheduled to report fourth-quarter results and it is expected to show a rise in quarterly revenue. Analysts expect the company to be cautious in its outlook for 2022. Rival General Motors reported fourth-quarter earnings on Tuesday and said it will spend more than the $35 billion previously planned through 2025 to speed up launches of new electric vehicles and noted that investments in technology will take priority over richer profits next year.</p><p><br/></p><p>Eli Lilly and Co reports its fourth-quarter earnings and investors will look for commentary on its forecast for 2022 and the company's progress in getting anti-diabetes drug tirzepatide and Alzheimer's drug donanemab approved and launched. Meanwhile, Biogen Inc is expected to report fourth-quarter results, the first earnings report after the U.S. Medicare program proposed to severely limit coverage of its Alzheimer's disease drug. Investors will focus on the company's discussions with Centers for Medicaid and Medicare Services ahead of a final coverage decision, and Biogen's full-year forecast. Merck &amp; Co Inc also reports its results for the fourth quarter.</p><p><br/></p><p>The Bank of England will announce a rate decision and publish the minutes of its meeting. While investors have been in thrall to the U.S. Federal Reserve's hawkish anti-inflation twist in 2022, the Bank of England is widely expected to hike UK interest rates for the second time in less than three months. Meanwhile, the governing council of the European Central Bank will hold a monetary policy meeting and deliver a press conference.</p><p><br/></p><p>U.S. Senate Banking Committee conducts nomination hearing for President Joe Biden's three picks for Federal Reserve. Biden earlier this month nominated former Federal Reserve Gov. Sarah Bloom Raskin to be central bank's vice chair for supervision and two economists, Lisa Cook and Philip Jefferson, to serve on its board of governors.</p><p><br/></p><p>U.S. life insurer Prudential Financial Inc is set to report its fourth-quarter earnings after markets close. Investors are awaiting details on how insurance claims for COVID-19 deaths as well as variable investment income will impact Prudential's bottom line.</p><p><br/></p><p>Honeywell International Inc is expected to post a fall in its fourth-quarter profit and revenue due to  slower business jet demand as the Omicron variant of COVID-19 batters the aviation industry.</p><p><br/></p><p>Activision Blizzard Inc is expected to show a fall in fourth-quarter revenue, due to a cool down in pandemic-driven demand for its popular titles. Investors will also look for comments on Microsoft's recent deal to buy the video game publisher.</p><p><br/></p><p>Estee Lauder Companies is expected to post a rise in second-quarter revenue, helped by strong demand for its self-care, Clinique skin care, and fragrance products. Investors will lookout for comments on supply chain disruptions and the impact of Omicron variant of coronavirus. Meanwhile, Ralph Lauren Corp is expected to post a jump in December quarter sales, with the company's results coming after European luxury peers reported a healthy increase in demand for high-end fashion during the holiday shopping season.</p><p><br/></p><p>Pinterest Inc is expected to show a rise in fourth-quarter revenue, helped by a steady growth in ad sales. Investors will also look out for MAU growth, a key metric indicating users’ level of engagement, after a disappointing last quarter, as well as commentary on COVID-19 impact on the business.</p><p><br/></p><p>Aptiv PLC expects to post a fall in fourth-quarter revenue, hurt by decrease in global vehicle production rates, continued impacts of the pandemic and the worldwide semiconductor shortage on the global automotive supply chain. Investors will be looking for commentary on its full-year financial outlook, Omicron impact and any commentary on the state of the supply chain.</p><p><br/></p><p>Chocolate maker Hershey Co is expected to post increases in its fourth-quarter sales and profit, bolstered by higher prices and strong demand for its products in North America. Investors will be interested in commentary about inflationary pressures, supply chain disruptions and any forecast for the upcoming fiscal year.</p><p><br/></p><p>Investment bank Lazard Ltd is expected to post a jump in fourth-quarter profit, helped by high advisory fees as strong M&amp;A activity closed out a record year for dealmaking.</p><p><br/></p><p>Data firm IHS Markit is scheduled to release Brazil's services and composite PMI data for January. (0800/1300) Meanwhile, Mexico's consumer confidence data for January will be released.</p><p><br/></p><p class=\"tr-signoff\"> (Compiled by Yoganand KN in Bengaluru; Editing by Krishna Chandra Eluri)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Yoganand.KN@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Yoganand.KN@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMERS-WHATTOWATCH/</p></div>"}