{"date": "2022-02-08 08:17:47+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\"><li class=\"tr-summaryitem\">State wants companies to electrify fleet before 2025</li><li class=\"tr-summaryitem\">May offer higher incentives for bulk purchase of EVs - minister</li><li class=\"tr-summaryitem\">India not ready for rapid EV shift - executive </li><li class=\"tr-summaryitem\">Need lower import tax on EVs for Tesla to test India - minister</li></ul><p class=\"tr-by\">By Aditi Shah</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW DELHI, Feb 8 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>India's Maharashtra state will offer companies like Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and Uber <a href=\"reuters://REALTIME/Verb=FullQuote/ric=UBER.N\" data-type=\"ric\" data-ric=\"UBER.N\" translate=\"no\" dir=\"ltr\">UBER.N</a> new incentives to electrify their delivery fleets ahead of a 2025 target for cleaner air, its environment minister told Reuters.</p><p>One of India's richest states and home to the financial hub of Mumbai, Maharashtra is an important market for e-commerce, ride-hailing and food delivery companies. Last year, it set a target for such companies to electrify 25% of their fleet by 2025.</p><p>Now it wants to bring the target forward by offering companies higher incentives for bulk purchase of electric vehicles (EVs), the state minister, Aaditya Thackeray, told Reuters in an interview. </p><p>\"We are trying to be on the earlier side of 2025 and see if companies can get certain more incentives and move sooner. This not only benefits us in terms of cleaner air but also benefits them in terms of economies and their revenue models,\" he said.     </p><p>Companies the state is likely to approach in the next month include Amazon, Uber, Walmart's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=WMT.N\" data-type=\"ric\" data-ric=\"WMT.N\" translate=\"no\" dir=\"ltr\">WMT.N</a> Flipkart, Softbank Group-backed <a href=\"reuters://REALTIME/Verb=FullQuote/ric=9984.T\" data-type=\"ric\" data-ric=\"9984.T\" translate=\"no\" dir=\"ltr\">9984.T</a> ridesharing firm Ola and food-delivery companies Zomato <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ZOMT.NS\" data-type=\"ric\" data-ric=\"ZOMT.NS\" translate=\"no\" dir=\"ltr\">ZOMT.NS</a> and Swiggy.</p><p>The push comes weeks after India's capital, New Delhi, issued strict <a href=\"https://reut.rs/3rx6dYg\" data-type=\"url\" class=\"tr-link\" translate=\"no\">draft rules</a> for companies to get a licence on condition that a certain percentage of their new fleet is electric.</p><p>The Maharashtra government has yet make its offer to the companies and Amazon, Flipkart, Uber, Ola, Zomato and Swiggy did not immediately respond to questions from Reuters about the possibility of speeding up the electrification process.</p><p>Amazon, Flipkart, Zomato and Swiggy have previously set out EV targets for 2025 and 2030, and Uber is working with EV companies to introduce electrification in its fleet.    </p><p><br/></p><p>GREEN SHIFT</p><p>But the proposal to bring forward the target could worry some industry executives who fear a significant shift towards electric vehicles could come with costs because of a lack of affordable, long-range vehicles and insufficient charging infrastructure.</p><p>\"When one state makes such a move it becomes a template for others to follow without fully understanding the business implications,\" said an executive with a fleet company who declined to be identified.</p><p>Thackeray, who is spearheading the state's broader climate-change agenda, says he is aware of the challenges and has plans to make Maharashtra a leading EV manufacturer.</p><p>The state is already a major auto hub and home to domestic carmakers like Tata Motors <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TAMO.NS\" data-type=\"ric\" data-ric=\"TAMO.NS\" translate=\"no\" dir=\"ltr\">TAMO.NS</a> that will invest in <a href=\"https://reut.rs/3guFHIK\" data-type=\"url\" class=\"tr-link\" translate=\"no\">building more EVs</a>, as well as global players like Mercedes Benz <a href=\"reuters://REALTIME/Verb=FullQuote/ric=DAIGn.DE\" data-type=\"ric\" data-ric=\"DAIGn.DE\" translate=\"no\" dir=\"ltr\">DAIGn.DE</a>, which will <a href=\"https://reut.rs/3Lj06if\" data-type=\"url\" class=\"tr-link\" translate=\"no\">assemble</a> its luxury electric sedan there.</p><p>Maharashtra offers some of the highest incentives of any Indian state to EV manufacturers and buyers in the form of lower taxes. It is also building a network of charging stations along highways and in state-owned parking lots in Mumbai.</p><p>Thackeray plans to shift public transport to clean fuels and has mandated government departments to convert their vehicles to electric. He has also talked with investors on ways to boost investment in clean transport and energy.</p><p>\"This whole shift towards a green economy ... it is a huge economic revolution. There is a lot of gain in terms of revenues for the country, profit for corporates and jobs for private individuals,\" he said.</p><p>But Thackeray says to increase EV supply and demand, India needs to lower import taxes on cars to allow companies like Tesla Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TSLA.O\" data-type=\"ric\" data-ric=\"TSLA.O\" translate=\"no\" dir=\"ltr\">TSLA.O</a>, with which the state has held talks, to test the market.</p><p>\"Global manufacturers need to see India as a major market. Once demand is created here they will naturally come and produce. Until then, we need to incentivise imports,\" he said.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Aditi Shah<br/>Editing by Robert Birsel)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:aditi.shah@tr.com\" data-type=\"email\" translate=\"no\">aditi.shah@tr.com</a> ; +91-11-4954 8023, +91-11-3015 8023; Reuters Messaging: twitter: <a href=\"https://twitter.com/aditishahsays\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/aditishahsays</a>) )</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: INDIA-ELECTRIC/MAHARASHTRA (PIX)</p></div>"}