{"date": "2021-12-28 03:40:22.806000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3393.39, "close": 3384.02}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>UK customers can now apply for a reusable credit account from Barclays, which lets them spread the cost of eligible purchases on amazon.co.uk in equal monthly instalments</p><p>Customers can pay for future additional purchases through instalments without needing to reapply, as long as they stay within their spending limits</p></div><div class=\"tr-npp-body\"><p>Monthly instalment payments are automated, giving shoppers a simple and convenient way to pay on time</p><p>Amazon customers in the UK will have access to a new, flexible payment method ? Instalments by Barclays, helping them to finance purchases of ?100 or more on amazon.co.uk. The reusable credit account can be used on millions of products, including those from thousands of small and medium businesses selling on Amazon. With Instalments by Barclays, customers will have greater flexibility to pay for their purchases, with financing options available on terms between 3 - 48 months.</p><p>First time users will select their choice of instalment plan from available term options at Amazon checkout, complete an online application, and in most cases* they?ll receive an immediate response from Barclays letting them know whether they?ve been approved, and setting out their spending limits. All lending is fully regulated by the FCA**, and Barclays carries out robust credit and affordability checks to ensure that the customer is not given access to more credit than they can comfortably afford.</p><p>If approved, customers will find their reusable credit account added to their wallet and available at checkout while shopping on Amazon, allowing them to make repeat purchases without needing to reapply, as long as they remain within their overall credit limit and monthly payment limit.</p><p>Payments are automated via Direct Debit, giving customers a simple and convenient way to pay off their purchases on time, and the account can be managed directly through the Barclays App, even if the customer doesn?t bank with Barclays.</p><p>Barclays offers this credit account at an APR of 10.9% for online purchases on Amazon, although promotional rates and interest-free financing may be available at times. There are no account management fees, late fees, statement fees, or other hidden fees.</p><p>Customers need to meet certain eligibility requirements to apply for an instalment account ? for example, they need to be over 18 years of age and have been a UK resident for at least three years; see website for further details. Instalments by Barclays is not available for orders containing Amazon Gift Cards, digital products, groceries, pre-sale products and out-of-stock products. The minimum spend for each order is ?100.</p><p>Rob Levy, Head of Instalment Lending, Amazon UK, commented: ?Every day we strive to innovate on behalf of our UK customers. Instalments is one way we will offer customers flexible options, enabling them to choose to pay now or split the cost of larger purchases into budget-friendly monthly instalments. This is a simple and transparent service from Barclays that automates monthly payments, providing greater comfort for customers making bigger purchases.?</p><p>Ruchir Rodrigues, Head of Barclays Cubed and Consumer Bank Europe, said: ?This is another major step in our ambition to reinvent payments at the point-of-sale and delight customers. Amazon offers a world-class shopping experience, and this new service gives users a fully reusable payment-by-instalments option, which they can use to spread the cost of purchases over a longer period.?</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}