{"date": "2021-12-01 16:02:00.258000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>TREND MICRO INC (\"TMICF,TMICY-0;TMI-F\")\n- Thriving Access as a Service Cybercrime Market Fuels Ransomware\n- Attacks\n\n   Trend Micro Incorporated, a global cybersecurity leader, released new\nresearch detailing the murky cybercrime supply chain behind much of the\nrecent surge in ransomware attacks. Demand has increased so much over the\npast two years that many cybercriminal markets now have their own\n\"Access-as-a-Service\" sections.\n\n   To read a full copy of the report, Access-as-a-Service, please visit:\n<a href=\"https://research.trendmicro.com/AccessAsAService\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://research.trendmicro.com/AccessAsAService</a>\n\n   \"Media and corporate cybersecurity attention have been focused only on\nthe ransomware payload when we need to focus first on mitigating the\nactivity of initial access brokers,\" said David Sancho, senior threat\nresearcher for Trend Micro. \"Incident responders often need to investigate\ntwo or more overlapping attack chains to identify the root cause of a\nransomware attack, which often complicates the overall IR process. Teams\ncould get ahead of this issue by monitoring for activity by Access Brokers\nwho steal and sell enterprise network access - essentially cutting off the\nsupply for ransomware actors.\"\n\n   The research is based on an analysis of over 900 access broker listings\nfrom January through August 2021 across multiple English and Russian\nlanguage-based cybercrime forums.\n\n   Education was the most frequently featured sector, accounting for 36% of\nadvertisements--more than triple the second and third most targeted\nindustries, manufacturing, and professional services, which both account\nfor 11%.\n\n   The report reveals three main types of access brokers:\n\n//st\n\n* Opportunistic sellers who are focused on making a quick profit and don't\n  spend all their time on access.\n* Dedicated brokers are sophisticated and skilled hackers who offer access\n  to a range of different companies. Their services are often used by\n  smaller ransomware affiliates and groups.\n* Online shops that offer RDP and VPN credentials. These dedicated shops\n  only guarantee access to a single machine rather than an entire network\n  or organization. However, they represent a simple, automated way for\n  cybercriminals with lower skill sets to purchase access. They can even\n  search by location, ISP, operating system, port number, admin rights, or\n  company name.\n\n//et\n\nMost access broker offerings involve a simple set of credentials that may\nhave been sourced from: Previous breaches and password hash breaking;\ncompromised bot computers; vulnerability exploitation on VPN gateways, web\nservers, etc.; or one-off opportunistic attacks.\n\n   Prices vary depending on the type of access (single machine or entire\nnetwork/corporation), annual revenue of the company, and how much extra\nwork the buyer needs to do. Although RDP access can be obtained for as\nlittle as $10, the average price for admin credentials into a business is\naround $8,500. However, prices can reach up to $100,000.\n\n   Trend Micro recommends the following strategies for defenders:\n\n//st\n\n* Monitor for public breaches\n* Trigger a password reset for all users if you suspect corporate\n  credentials might be breached\n* Set up Multi-Factor Authentication (MFA)\n* Monitor user behavior\n* Watch the DMZ and assume internet-facing services like VPN, webmail and\n  web servers are under constant attack\n* Implement network segmentation and micro-segmentation\n* Deploy best practice password policies\n* Implement some form of Zero Trust architecture\n\n//et\n\nAbout Trend MicroTrend Micro, a global cybersecurity leader, helps make the\nworld safe for exchanging digital information. Fueled by decades of\nsecurity expertise, global threat research, and continuous innovation,\nTrend Micro's cybersecurity platform protects hundreds of thousands of\norganizations and millions of individuals across clouds, networks, devices,\nand endpoints. As a leader in cloud and enterprise cybersecurity, the\nplatform delivers a powerful range of advanced threat defense techniques\noptimized for environments like AWS, Microsoft, and Google, and central\nvisibility for better, faster detection and response. With 7,000 employees\nacross 65 countries, Trend Micro enables organizations to simplify and\nsecure their connected world. www.TrendMicro.com.\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133400617.MNPRE2133402434-07581720211201</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}