{"date": "2021-11-22 19:30:13+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The Day Ahead is an email and PDF publication that includes the day's major stories and events, analyses and other features. To receive The Day Ahead, Eikon users can register at <a href=\"reuters://REALTIME/verb=Headlines/ric=DAY/US\" data-type=\"newsExpression\" data-expression=\"DAY/US\" translate=\"no\" dir=\"ltr\">DAY/US</a>. Thomson One users can register at RT/DAY/US. All times in ET/GMT</p><p class=\"tr-story-p1\"></p><p>Dell Technologies Inc is expected to report a rise in its third-quarter revenue as hybrid work continues to boost demand for its products. Investors will be looking out for comments on the impact of costs and supply chain logistics on the company.</p><p><br/></p><p>Data firm IHS Markit is expected to report its flash manufacturing PMI likely rose to 59 in November from a reading of 58.4 in October. The flash services reading is expected to have advanced to 59 from a reading of 58.7.</p><p><br/></p><p>Gap Inc is set to post a jump in third-quarter revenue, boosted by strong demand for its apparel as shoppers start going out again. Investors will be on the lookout for any supply chain impacts going into the holiday season.</p><p><br/></p><p>Best Buy Co Inc is expected to report a fall in third-quarter revenue on slowing demand for work-from-home electronics after last year's pandemic-induced boom. The retailer's forecast for the holiday season will be in focus as shipping bottlenecks and semiconductor shortages threaten to constrain supplies to stores.    </p><p><br/></p><p>Dollar Tree Inc is expected to post a rise in third-quarter revenue, aided by robust demand for its discounted products as more people visit its stores. Investors will be interested in comments on the impact from the supply chain disruptions and labor inflation, and inventory levels ahead of the crucial holiday season.</p><p><br/></p><p>Medtronic Plc is set to report its second-quarter results, where investors will watch out for the company's commentary on the recovery in sales of medical devices as well as demand for non-urgent procedures. The focus will also be on supply challenges and full-year outlook.</p><p><br/></p><p>Apparel chain Abercrombie &amp; Fitch Co is expected to post an increase in third-quarter revenue, as people spend more to refresh their wardrobes following the easing of the coronavirus curbs. Investors will be on the lookout for its comments on holiday inventory, supply-chain issues and inflation.</p><p><br/></p><p>Nordstrom Inc is expected to post a jump in third-quarter sales, boosted by shoppers returning to its stores after the easing of COVID-19 curbs. Investors will be looking out for the company's comments on the holiday season as the industry grapples with a tight supply chain that has threatened to create product shortages.    </p><p>        </p><p>Aerie parent American Eagle Outfitters Inc is expected to post an increase in third-quarter revenue, as people returning to offices and schools spend more on clothing. Investors will be on the lookout for its comments on holiday inventory, supply-chain issues and inflation.</p><p><br/></p><p>Jamie Dimon, chief executive of JPMorgan Chase &amp; Co, will speak as part of the \"Conversations with CEOs\" series of the Boston College Chief Executives Club.</p><p><br/></p><p>Paul Beaudry, deputy governor of the Bank of Canada, will give a speech to the Ontario Securities Commission on risks to the stability of the Canadian financial system. </p><p><br/></p><p>Canadian Prime Minister Justin Trudeau will have to address the flooding in British Columbia, which could be the most expensive natural disaster in the country's history, when he appears in parliament to outline his priorities for the new legislature.</p><p><br/></p><p>India's Supreme Court is set to hear Amazon.com Inc and Future Group's case on the Indian firm's $3.4 billion sale of retail assets to market leader Reliance Industries. The U.S. firm has accused Future of violating certain contracts by agreeing to the sale, while Future has denied any wrongdoing.</p><p><br/></p><p>LIVECHAT - REUTERS GLOBAL MARKETS FORUM</p><p>Will Hershey, co-founder &amp; CEO of Roundhill Investments, discusses his firm's META ETF, the growing interest in the space after Facebook's rebrand and how to evaluate related investments. He will also discuss the outlook for the sports betting and esports sectors. (1100/1600) To join the conversations, <a href=\"https://www.refinitiv.com/en/products/refinitiv-messenger/editorial-communities-financial-forums\" data-type=\"url\" class=\"tr-link\" translate=\"no\">click here</a></p><p><br/></p><p class=\"tr-signoff\"> (Compiled by Nachiket Tekawade in Bengaluru; Editing by Ramakrishnan M.)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Nachiket.Tekawade@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Nachiket.Tekawade@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMERS-WHATTOWATCH/</p></div>"}