{"date": "2021-12-14 10:11:58+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        GK solutions running on AWS give retailers additional cloud-based hosting options that accelerate digital transformation\n      </p>\n                <p>\n        GK today announced that its CLOUD4RETAIL OmniPOS 5.19 and T+ Enterprise and Central EJ, Returns and Loyalty solutions are now available on Amazon Web Services, Inc. (AWS), running on cloud native services that include Amazon Elastic Kuberntes Service (Amazon EKS) and Amazon Relational Database Service (Amazon RDS). By providing support on the native AWS infrastructure, GK's omnichannel commerce and payment solutions give retailers purpose-built offerings that provide value across the entire spectrum of retail IT operations.\n      </p>\n                <p>\n        Retailers are seeking cloud solutions that accelerate innovation, optimize operations and delight customers. The availability of GK's cloud solutions on AWS empowers retailers to create exceptional experiences with an agile, high-performance infrastructure. This collaboration makes it easy and seamless for retailers running on the cloud to take advantage of AWS solutions, which are containerized and delivered using AWS native services.\n      </p>\n                <p>\n        GK CLOUD4RETAIL OmniPOS 5.19 is an enhanced POS solution that provides an enterprise-class, unified platform for every retail format. Its flexible, open commerce platform powers the modern retail experience, from touchless mobile payments to table-service support, as well as integrated payment processing. T+ Enterprise and Central EJ, Returns and Loyalty solutions allow retailers to analyze and process transactions from any source across the enterprise, including all software and data, in real time. GK's solution is currently being used at almost 500,000 retail and payment installations across approximately 100,000 stores in more than 60 countries.\n      </p>\n                <p>\n        With this collaboration, GK customers can now create and configure shared file systems simply and quickly. The solutions can also be used with Amazon RDS, which makes it easy to set up, operate, and scale a relational database in the cloud. It provides cost-efficient and resizable capacity while automating time-consuming administration tasks such as hardware provisioning, database setup, patching and backups.\n      </p>\n                <p>\n        \"It's become increasingly important for retailers to transform their digital operations by enhancing their cloud capabilities,\" said Michael Jaszczyk, chief executive officer at GK America. \"Our AWS offerings allow retailers to easily leverage cloud computing and accelerate their innovation journey. We're excited to bring this solution to the table for our customers and make it easier than ever to improve efficiency and productivity in all areas of a retailer's business.\"\n      </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://investor.gk-software.com/en/publications/corporate-news/gk-announces-availability-on-aws\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>GK Software SE</strong> published this content on <strong>14 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>14 December 2021 10:11:58 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - GK Software SE</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: GK-Software-SE</p></div>"}