{"date": "2021-12-12 00:08:31+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3444.24, "close": 3381.83}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Updates with death tolls from Amazon warehouse, Missouri</p><p class=\"tr-by\">By Cheney Orr</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">MAYFIELD, Ky., Dec 11 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>At least 100 people were feared dead in Kentucky after a swarm of tornadoes tore a 200-mile path through the U.S. Midwest and South, demolishing homes, levelling businesses and setting off a scramble to find survivors beneath the rubble, officials said Saturday. </p><p>The powerful twisters, which weather forecasters say are unusual in cooler months, destroyed a candle factory and the fire and police stations in a small town in Kentucky, ripped through a nursing home in neighboring Missouri, and killed at least six workers at an Amazon warehouse in Illinois.</p><p>Kentucky Governor Andy Beshear said the collection of tornadoes was the most destructive in the state's history. He said about 40 workers had been rescued at the candle factory in the city of Mayfield, which had about 110 people inside when it was reduced to a pile of rubble. It would be a \"miracle\" to find anyone else alive under the debris, Beshear said.  </p><p>\"The devastation is unlike anything I have seen in my life and I have trouble putting it into words,\" Beshear said at a press conference. \"It's very likely going to be over 100 people lost here in Kentucky.\" </p><p>Beshear said 189 National Guard personnel have been deployed to assist with the recovery. The rescue efforts will focus in large part on Mayfield, home to some 10,000 people in the southwestern corner of the state where it converges with Illinois, Missouri and Arkansas.</p><p>Video and photos posted on social media showed brick buildings in downtown Mayfield flattened, with parked cars nearly buried under debris. The steeple on the historic Graves County courthouse was toppled and the nearby First United Methodist Church partially collapsed.</p><p>Mayfield Fire Chief Jeremy Creason, whose own station was destroyed, said the candle factory was diminished to a \"pile of bent metal and steel and machinery\" and that responders had to at times \"crawl over casualties to get to live victims.\"</p><p>Paige Tingle said she drove four hours to the site in the hope of finding her 52-year-old mother, Jill Monroe, who was working at the factory and was last heard from at 9:30 p.m.</p><p>\"We don't know how to feel, we are just trying to find her,\" she said. \"It's a disaster here.\"</p><p>The genesis of the tornado outbreak was a series of overnight thunderstorms, including a super cell storm that formed in northeast Arkansas. That storm moved from Arkansas and Missouri and into Tennessee and Kentucky.</p><p>Unusually high temperatures and humidity created the environment for such an extreme weather event at this time of year, said Victor Gensini, a professor in geographic and atmospheric sciences at Northern Illinois University. </p><p>\"This is an historic, if not generational event,\" Gensini said. </p><p>Saying the disaster was likely one of the largest tornado outbreaks in U.S. history, President Joe Biden on Saturday approved an emergency declaration for Kentucky. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2SW0H7\" data-type=\"storyId\" data-story-id=\"nL1N2SW0H7\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>He told reporters he would be asking the Environmental Protection Agency to examine what role climate change may have played in fuelling the storms, and he raised questions about the tornado warning systems.</p><p>\"What warning was there? And was it strong enough and was it heeded?\" Biden said. </p><p><br/></p><p>'LIKE A BIG BOMB'</p><p>About 130 miles east of Mayfield in Bowling Green, Kentucky, Justin Shepherd said his coffee shop was spared the worst of the storm, which struck other businesses hard on the busy commercial strip just off the bypass to U.S. Highway 31 West.</p><p>\"We've got some siding and roof damage here, but just across the road there's a brewery that half of it is gone. It's just totally gone, like a big bomb exploded or something.\"    </p><p>One person was killed and five seriously injured when a tornado tore through a nursing home with 90 beds in Monette, Arkansas, a small community near the border with Missouri, according to Craighead County Judge Marvin Day.</p><p>\"We were very blessed that more people weren't killed or injured in that. It could have been a whole lot worse,\" Day told Reuters.</p><p>A few miles away in Leachville, Arkansas, a tornado destroyed a Dollar General Store, killing one person, and laid waste to much of the city's downtown, said Lt. Chuck Brown of the Mississippi County Sheriff's Office in Arkansas.  </p><p>\"It really sounded like a train roaring through town.\"</p><p>In Illinois, <a href=\"https://www.reuters.com/world/us/injuries-reported-after-roof-collapse-amazon-warehouse-illinois-ap-2021-12-11\" data-type=\"url\" class=\"tr-link\" translate=\"no\">at least six workers were confirmed killed</a> after an Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> warehouse collapsed in the town of Edwardsville, when the winds ripped off the roof and reduced a wall longer than a football field to rubble. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2SW03N\" data-type=\"storyId\" data-story-id=\"nL1N2SW03N\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Amazon truck driver Emily Epperson, 23, said she was anxiously waiting for information on the whereabouts of her workmate Austin McEwan late Saturday afternoon to relay to his girlfriend and parents. </p><p>\"We're so worried because we believe that, you know, he would have been found by now,\" she told Reuters. </p><p>In Tennessee, the severe weather killed at least three people, said Dean Flener, spokesperson for the state's Emergency Management Agency. And two people, including a young child, were killed in their homes in Missouri, Governor Mike Parson said in a statement. </p><p>The National Weather Service's Storm Prediction Center said it received 36 reports of tornadoes touching down in Illinois, Kentucky, Tennessee, Missouri, Arkansas, and Mississippi.</p><p>The weather forecast was broadly clear for Saturday night, but temperatures were expected to drop and thousands of residents lack power and water after the storm. As of Saturday afternoon, nearly 99,000 customers in Kentucky and more than 71,000 in Tennessee were without power, according to PowerOutage.US, a website tracking power outages. </p><p>Kentucky officials called on residents to stay off the roads and to donate blood, as responders rushed to rescue survivors and account for people in communities that had lost communications. </p><p>\"We've got Guardsmen who are out doing door knocks and checking up on folks because there's no other communication with some of these people,\" said Brigadier General Haldane Lamberton of the Kentucky National Guard.</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Cheney Orr; Additional reporting by Njuwa Maina, Brendan O'Brien, Rich McKay, Vishal Vivek, Makini Brice, Valerie Volcovici, Maria Caspani and Steve Gorman; Writing by Nathan Layne and Alexandra Ulmer; Editing by Frances Kerry and Daniel Wallis)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:frances.kerry@thomsonreuters.com\" data-type=\"email\" translate=\"no\">frances.kerry@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-WEATHER/TORNADOES (UPDATE 12, TV, PIX)</p></div>"}