{"date": "2021-11-04 20:15:00.515000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3384.0, "close": 3518.99}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwlistdisc{list-style-type:disc;}</style><p class=\"bwalignc\">\n<b>Teradata Forms Global Strategic Collaboration with AWS</b>\n</p><p class=\"bwalignc\">\n<span>Deal helps enterprises accelerate their cloud adoption journey and digital transformation initiatives</span>\n</p><p>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.teradata.com%2F&amp;esheet=52521370&amp;newsitemid=20211104005281&amp;lan=en-US&amp;anchor=Teradata&amp;index=1&amp;md5=b324937fb64b685b4bdfa573f4194378\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Teradata</a> (NYSE: <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Finvestor.teradata.com%2Fhome%2Fdefault.aspx&amp;esheet=52521370&amp;newsitemid=20211104005281&amp;lan=en-US&amp;anchor=TDC&amp;index=2&amp;md5=6c0340a5af80a9231c58ea06b593eb02\" data-type=\"url\" class=\"tr-link\" translate=\"no\">TDC</a>), the connected multi-cloud data platform for enterprise analytics company, today announced a three-year Strategic Collaboration Agreement (SCA) with Amazon Web Services, Inc. (AWS). Together, AWS and Teradata are increasing both product integrations and development with AWS, and launching joint go-to-market programs designed to help customers migrate, modernize, and de-risk their cloud adoption journey using <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.teradata.com%2FCloud%2FAWS&amp;esheet=52521370&amp;newsitemid=20211104005281&amp;lan=en-US&amp;anchor=Teradata+Vantage+on+AWS&amp;index=3&amp;md5=22330b333caaad6a572cdd796688c3d9\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Teradata Vantage on AWS</a>. Teradata is providing its industry-leading data platform on AWS to deliver impactful business outcomes from start to enterprise scale.\n</p><p>\nExpected customer benefits of the Strategic Collaboration Agreement include:\n</p><p>\n<b>Easier adoption of Teradata Vantage by AWS customers</b>\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\nTeradata and AWS are collaborating on making it simple for a wide variety of personas – including data scientists, data analysts, line of business teams, IT, and DevOps – to use Teradata Vantage on AWS to migrate, manage, connect, and build new data workloads and applications across the broad array of AWS services, at enterprise scale in the cloud.\n</li>\n</ul><p>\n<b>Industry cloud solutions delivering meaningful business outcomes</b>\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\nFor organizations adopting <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Findustries%2F&amp;esheet=52521370&amp;newsitemid=20211104005281&amp;lan=en-US&amp;anchor=AWS+industry+clouds&amp;index=4&amp;md5=3294efb95853ed1b770db11299648430\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS industry clouds</a>, Teradata and AWS are collaborating to deliver ready-to-use reference architectures and use case-specific recipes that leverage the power and speed of Teradata Vantage to drive impactful business outcomes. With Teradata’s proven industry experience, customers in key industries will benefit from an accelerated time-to-insight.\n</li>\n</ul><p>\n<b>Data marketplace and data sharing</b>\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\nTeradata and AWS are working together to take data sharing to the next level. Through tight integration with Teradata Vantage, Amazon Simple Storage Service (Amazon S3), AWS Data Exchange and AWS Service Catalog, users are offered an open approach to data sharing with open file formats and the ability to leverage multiple tools, technologies, models, and industry data to access and process that data within Teradata Vantage at scale.\n</li>\n</ul><p>\n<b>Simple purchasing and billing through AWS Marketplace</b>\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\nTeradata Vantage continues to be available in AWS Marketplace, allowing customers to consolidate their purchasing of Vantage by subscribing directly through AWS and contributing to the draw down on a customer’s AWS commitment.\n</li>\n</ul><p>\n“AWS is delighted to establish a Strategic Collaboration Agreement with Teradata as we always aim to help customers use data to innovate and modernize faster in the cloud,” said Doug Yeum, Global Head of Partner Organization at AWS. “This collaboration accelerates Teradata’s ability to meet the demands of the largest data workloads we see, with cloud services from AWS to expedite the value and benefits Teradata can offer customers.”\n</p><p>\n“As part of our ongoing transformation to modernize our technology ecosystem, we knew we wanted to leverage the cloud for our data analytics platform,” said John Higginson, Chief Technology Officer at Groupon. “It wasn’t just the flexibility, agility, and cost optimization, it was about unlocking business value by giving our partners – in marketing or sales or inventory or finance – the tools and the information they need to drive their parts of the business forward. We realized that our fastest and lowest-risk path to the cloud, with minimal downtime and proven stability at scale, was to continue with the Teradata family of products and move into <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.teradata.com%2FCloud%2FAWS&amp;esheet=52521370&amp;newsitemid=20211104005281&amp;lan=en-US&amp;anchor=Teradata+Vantage+on+AWS&amp;index=5&amp;md5=f82483bf7a2b79eced5bf5495bdd6392\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Teradata Vantage on AWS</a>.”\n</p><p>\nAs part of the agreement, Teradata and AWS will engage in co-marketing and co-selling programs built around industry use cases, incentives, and accelerators that create more value for customers. AWS and Teradata will focus on selected industries globally, helping customers utilize artificial intelligence (AI), machine learning (ML), and Internet of Things (IoT) services to drive real-time data insight and data management connected to Vantage.\n</p><p>\n“Teradata is advancing the proven enterprise-scale data management capabilities that Vantage offers customers – at compelling price performance – in the cloud. By coming together with AWS to create a deeper, more compelling go-to-market and technology alliance, we can help enterprise and government organizations throughout the world move fast to meet their digital transformation imperatives, all while using data to serve their customers,” said Todd Cione, Chief Revenue Officer at Teradata. “Our mission for this strategic collaboration is to work with AWS to make it easier for customers to move and manage their data, and run data workloads at massive scale with the compute processing and cloud services they now must have to compete and grow.”\n</p><p>\n<b><span>Note to Investors</span></b>\n</p><p>\nThis release contains forward-looking statements within the meaning of Section 21E of the Securities and Exchange Act of 1934. Forward-looking statements generally relate to opinions, beliefs and projections of expected future financial and operating performance, business trends, and market conditions, among other things. These forward-looking statements are based upon current expectations and assumptions and involve risks and uncertainties that could cause actual results to differ materially, including those factors described from time to time in Teradata’s filings with the U.S. Securities and Exchange Commission, including its annual report on Form 10-K for the year ended December 31, 2020 and subsequent quarterly reports on Forms 10-Q, as well as the Company’s annual report to stockholders. Teradata does not undertake any obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\n</p><p>\n<b><span>About Teradata</span></b>\n</p><p>\nTeradata is the connected multi-cloud data platform for enterprise analytics company. Our enterprise analytics solve business challenges from start to scale. Only Teradata gives you the flexibility to handle the massive and mixed data workloads of the future, today. Learn more at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fteradata.com%2F&amp;esheet=52521370&amp;newsitemid=20211104005281&amp;lan=en-US&amp;anchor=Teradata.com&amp;index=6&amp;md5=bd753644228631ee0520f6d9e40762a3\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Teradata.com</a>.\n</p><p class=\"bwalignc\">\nThe Teradata logo is a trademark, and Teradata is a registered trademark of Teradata Corporation and/or its affiliates in the U.S. and worldwide.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211104005281r1&amp;sid=ucdp4&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTA0MDA1MjgxcjEmc2lkPXVjZHA0JmRpc3Rybz1ueCZsYW5nPWVu&amp;key=cd3b278264577b5229c0cb803aedb7eac676d865b5585f6026358731d13e55f4920591efd27fe755d7ea6bbd067763caf50f42040c1f719d3ca87d160e3ac7e5\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211104005281/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211104005281/en/</a></span></p><p>\nJennifer Donahue\n<br/>858-485-3029 office\n<br/><a href=\"mailto:jennifer.donahue@teradata.com\" data-type=\"email\" translate=\"no\">jennifer.donahue@teradata.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: CA-TERADATA</p></div>"}