{"date": "2022-02-01 20:49:05+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Caroline Valetkevitch</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW YORK, Feb 1 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>U.S. earnings news has been less impressive this reporting season than in recent quarters, giving some investors another reason to worry after Wall Street's tumultuous start to the year. </p><p>Downbeat forecasts so far this reporting period from companies like Netflix Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=NFLX.O\" data-type=\"ric\" data-ric=\"NFLX.O\" translate=\"no\" dir=\"ltr\">NFLX.O</a> and Intel Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=INTC.O\" data-type=\"ric\" data-ric=\"INTC.O\" translate=\"no\" dir=\"ltr\">INTC.O</a> have added to recent pressure on stocks, while reports from a number of heavyweights are still expected. Google parent Alphabet Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a> was due to post results after market close on Tuesday, and Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and Meta Platforms Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a> are also slated to release earnings this week.</p><p>S&amp;P 500 companies are still beating analysts' earnings expectations for the fourth quarter of 2021, but they are beating by a much lower margin than they had been over the past year when companies were just bouncing back from the depths of the pandemic.</p><p>With results in from more than 180 companies as of Tuesday, S&amp;P 500 companies in aggregate are reporting earnings 4.3% above expectations, well below the average of 16% for the past four full quarters but in line with the 4.1% average going back to 1994, according to IBES data from Refinitiv.</p><p>Estimated year-over-year profit growth for S&amp;P 500 companies for the fourth quarter has gone up slightly since the start of the reporting period. Growth was forecast at 25.6% as of Tuesday versus 22.3% at the start of January, based on Refinitiv data.</p><p>\"It was huge beats last year and that's shrunk,\" said Nick Raich, CEO of The Earnings Scout. \"It's partially reverting back to normal, but it's also the supply-chain pressures and inflationary pressures taking a toll.\"</p><p>Wall Street is trying to find its footing after the recent sharp selloff. The S&amp;P 500 <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.SPX\" data-type=\"ric\" data-ric=\".SPX\" translate=\"no\" dir=\"ltr\">.SPX</a> had its worst January since 2009, while the Nasdaq <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.IXIC\" data-type=\"ric\" data-ric=\".IXIC\" translate=\"no\" dir=\"ltr\">.IXIC</a> posted its biggest January percentage drop since 2008 following increasing worries about rising interest rates. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2UB2WW\" data-type=\"storyId\" data-story-id=\"nL1N2UB2WW\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Growth stocks like large-cap technology have been among the hardest hit, and investors are focused on whether earnings this year will be able to support the market.</p><p>While down from about 22 at the start of the year, the forward price-to-earnings ratio for the S&amp;P 500 is at 20.1, still well above its long-term average of 15.5, according to Refinitiv DataStream.</p><p>Companies have been facing higher prices and labor costs, and some companies may be struggling to pass on those costs at this point, said Rick Meckler, partner at Cherry Lane Investments, a family investment office in New Vernon, New Jersey.</p><p>Among them, Oreo cookie maker Mondelez International Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MDLZ.O\" data-type=\"ric\" data-ric=\"MDLZ.O\" translate=\"no\" dir=\"ltr\">MDLZ.O</a> last week said it expects to face a larger impact from supply-chain problems in its key North American segment in the current quarter. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2U74L8\" data-type=\"storyId\" data-story-id=\"nL4N2U74L8\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>To be sure, profit growth is seen as a positive overall for the market.</p><p>\"The tug-of-war between earnings and rising interest rates continues. Earnings are trending higher, while rising interest rates are compressing valuation multiples and increasing price volatility,\" Terry Sandven, chief equity strategist at U.S. Bank Wealth Management in Minneapolis, wrote in a recent note.</p><p>   Yet just 78.8% of the reports so far this season have beaten analysts' earnings estimates, compared with an average of 84% of companies beating over the past four quarters, Refinitiv's data showed.</p><p>   S&amp;P 500 earnings are expected to gain by about 8.5% this year after growth of roughly 50% in 2021, based on Refinitiv data.     </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Caroline Valetkevitch in New York<br/>Editing by Alden Bentley and Matthew Lewis)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:caroline.valetkevitch@thomsonreuters.com\" data-type=\"email\" translate=\"no\">caroline.valetkevitch@thomsonreuters.com</a> ; +1 646 223 6393; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://caroline.valetkevitch.thomsonreuters.com@reuters.net\">caroline.valetkevitch.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-RESULTS/BEATS (PIX)</p></div>"}