{"date": "2021-11-28 09:16:34+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3504.56, "close": 3507.07}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Aditya Kalra and Abhirup Roy</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW DELHI, Nov 28 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon has asked India's antitrust regulator to revoke its approval for Future Retail's $3.4 billion sale of retail assets to Reliance, saying it was \"illegally obtained\", violating an order suspending the deal, a letter seen by Reuters shows.</p><p>The approval for the deal was a \"nullity in the eyes of law\" as an arbitrator's order was still in force, according to the letter sent by Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> to the Competition Commission of India (CCI) last week. </p><p>The battle between two of the world's richest men, Amazon founder Jeff Bezos and Reliance Industries Ltd <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RELI.NS\" data-type=\"ric\" data-ric=\"RELI.NS\" translate=\"no\" dir=\"ltr\">RELI.NS</a> boss Mukesh Ambani, marks a contest for preeminence in India’s booming, nearly trillion-dollar retail market.</p><p>The winner in the fight for Future Retail Ltd <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FRTL.NS\" data-type=\"ric\" data-ric=\"FRTL.NS\" translate=\"no\" dir=\"ltr\">FRTL.NS</a>, India’s second-largest retailer and Amazon’s estranged local partner, will get pole position in the race to meet the daily needs of more than a billion people.</p><p>The CCI, Amazon, Future Group and Reliance did not respond to requests for comment. </p><p>Future has said the <span class=\"tr-strong\">arbitrator's suspension order</span> was invalid but Indian courts have declined to overturn it.</p><p>If the regulator agrees with the previously unreported letter, it would be a major setback for oil-to-telecom conglomerate Reliance.</p><p>Amazon won an <a href=\"https://www.reuters.com/article/amazon-india-future-reliance-idCNL4N2RN47P\" data-type=\"url\" class=\"tr-link\" translate=\"no\">injunction</a> against the deal from a Singapore arbitrator last year, alleging Future had violated contracts that prevented it from selling the assets to entities including Reliance.</p><p>But the CCI later cleared the deal.</p><p>Future misled the CCI and continued to seek approval for the deal, Amazon said in the letter dated Wednesday, calling the injunction a \"brazen attempt to subvert the rule of law\".</p><p>Amazon asked for a personal hearing from the CCI to make its case. </p><p>The letter comes as Amazon is also battling allegations that it misrepresented facts and concealed information while seeking antitrust clearance for a 2019 deal with Future Group.</p><p>Amazon has so far successfully used this deal's contracts to block Future's deal with Reliance. </p><p>           </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Aditya Kalra and Abhirup Roy in New Delhi; Additional reporting by Zeba Siddiqui; Editing by William Mallard)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:zeba.siddiqui@tr.com\" data-type=\"email\" translate=\"no\">zeba.siddiqui@tr.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-INDIA/FUTURE-RELIANCE (PIX)</p></div>"}