{"date": "2021-12-09 14:32:43.711000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.29, "close": 3483.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">The number of Americans applying for unemployment benefits plunged last week to the lowest level in 52 years, more evidence that the U.S. job market is recovering from last year's coronavirus recession</p><p class=\"tr-npp-section-title\">Last August, Vince Patton was watching a YouTube video of a Tesla owner who had made a startling observation: Tesla drivers could now play a video game on their car's touch-screen dashboard — while the vehicle is moving</p><p class=\"tr-npp-section-title\">Italy's anti-trust authority has fined Amazon 1.13 billion euros, accusing the company of exploiting its dominant position against independent sellers on its website in violation of European Union competition rules</p><p class=\"tr-npp-section-title\">A growing effort to unionize Starbucks stores is facing its first major test</p><p class=\"tr-npp-section-title\">China's central bank is trying to restrain the rise of the yuan after the currency hit a 2 1/2-year high against the dollar</p><p class=\"tr-npp-section-title\">A small spa town in western Ukraine is standing out in a country where only 29% of the population has received coronavirus vaccine shots</p><p class=\"tr-npp-section-title\">CVS Health is hiking its dividend and offering a better-than-expected 2022 revenue forecast as the health care giant prepares to dive deeper into providing more care</p><p class=\"tr-npp-section-title\">A new report group says digital contact tracing apps, artificial intelligence and other tech tools that European governments rolled out to combat COVID-19 failed to play a key role in solving the pandemic and now threaten to make such monitoring widely accepted</p><p class=\"tr-npp-section-title\">The World Health Organization has expressed concerns that rich countries spooked by the emergence of the omicron variant could step up hoarding of COVID-19 vaccines and strain global supplies again</p><p class=\"tr-npp-section-title\">Denmark's government has ordered nightclubs, bars and restaurants to close at midnight in an attempt to counter an uptick in COVID-19 cases</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 The Associated Press.  All rights reserved. This material may not be published, broadcast, rewritten or redistributed.</p></div>"}