{"date": "2021-12-01 19:33:12.940000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Vulcan Cyber, developers of the cyber risk management platform for infrastructure, application, and cloud security, has launched an integration with the new Amazon Inspector.</p><p>Through this integration Vulcan Cyber and Amazon Web Services (AWS) customers can aggregate vulnerability data from multiple sources to establish a comprehensive approach to cyber risk reduction through measured, orchestrated security remediation campaigns.Vulcan Cyber integrates with Amazon Inspector by ingesting customers' vulnerability findings across multiple AWS services to provide a consolidated, prioritized view into customer workload AWS cyber risk posture. Vulcan Cyber is then used to coordinate actionable mitigation campaigns for AWS environments alongside campaigns for any other IT, application, or cloud surface. IT and cloud security teams are then able to filter and prioritize vulnerabilities, as well as create remediation campaigns by business group risk, and automation playbooks based on Amazon Inspector findings.Amazon Inspector is a vulnerability management service that continually scans AWS workloads for software vulnerabilities and unintended network exposure. With a few clicks in the AWS management console, Inspector can be enabled across all accounts in your organization. Once enabled, Inspector automatically discovers all running Amazon Elastic Compute Cloud (Amazon EC2) instances and container images residing in Amazon Elastic Container Registry (ECR), at any scale, and immediately starts assessing them for known vulnerabilities.Vulcan Cyber and Amazon Inspector can be used to create risk scores for each vulnerability finding by correlating Common Vulnerabilities and Exposures (CVE) information with factors such as network access and exploitability. These scores are used to prioritize the most critical vulnerabilities to help increase remediation response efficiency. Vulnerabilities found in container images are sent to Amazon ECR for resource owners to view and remediate. With Vulcan Cyber and Amazon Inspector, even small security teams and developers can ensure infrastructure workload security and compliance across your AWS workloads.\"The combination of Amazon Inspector and Vulcan Cyber is an important security solution for our customers,\" said Michael Fuller, Director, Product Management, AWS Security Services at AWS. \"With the new Amazon Inspector, we've simplified continuous and automated vulnerability assessment for customers across their entire organization, whether they have one AWS account or five thousand. Layering on Vulcan Cyber risk management platform provides actionable detail to help customers remediate vulnerabilities and quickly respond to protect critical resources.\"\"In scale-out cloud environments it's crucial that cloud security teams are able to prioritize and orchestrate their risk mitigation efforts based on what constitutes a real, immediate threat to business,\" said Yaniv Bar-Dayan, CEO, Vulcan Cyber. \"The new Vulcan Cyber integration with Amazon Inspector provides AWS users with the capability to scan and prioritize customer vulnerabilities while simultaneously orchestrating and automating the mitigation of risk across cloud, application and network surfaces to secure workloads at scale.\"The key benefits of the Vulcan Cyber integration with Amazon Inspector include: Consolidation of Amazon EC2 and container vulnerability management with a fully managed and highly scalable service that is enabled with only a few clicks.Intelligent prioritization of findings using the accurate, contextual, and meaningful Amazon Inspector Next risk score to help target the most important vulnerabilities first.Reduction of the mean time to resolve (MTTR) vulnerabilities with automation through integration with Amazon EventBridge and AWS Security Hub.In addition to its integrations with best-in-class security solutions like Amazon Inspector, the Vulcan Cyber risk management platform integrates with and orchestrates tools teams use for IT, cloud and application security including scanners, asset management, collaboration, ITSM, patch and configuration management, and DevOps.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}