{"date": "2021-12-29 19:31:43.574000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3413.22, "close": 3372.89}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Radware has announced that Armis selected Radware's Cloud Native Protector to safeguard its Amazon Web Services (AWS) environment.</p><p>This born-in-the-cloud business adopted Radware's solution to fortify its cloud security posture and identify potential vulnerabilities before they evolved into threats.Armis' security platform enables companies to safely use and control IoT and other unmanaged devices without fear of compromise by cyberattacks. Armis was looking for a solution that would give its DevOps team full visibility and control of its public cloud environment. The company turned to Radware to make it easier for its team to remotely track assets, supervise access to sensitive resources, and detect suspicious activity.\"The Radware team understands that we are a dynamic company with requirements that are constantly changing,\" said Roi Amitay, head of DevInfra at Armis. \"Radware's Cloud Native Protector plays an essential role in securing our cloud environment. It helps us see our full cloud picture and focus on what matters most. Radware provides trusted products and support, making this the best solution for our company.\"Radware's solution enhances the visibility and control Armis has over its public cloud environment. It automates manual analysis and notifies Armis about any publicly exposed assets and potential cyberattacks to help the company prioritize its work.\"Cloud-native companies like Armis have unique and constantly shifting security requirements that need specialized solutions,\" said Gilad Barzilay, director of public cloud sales at Radware. \"Our Cloud Native Protector not only secures Armis' cloud workloads but also is continually assessing risks and improving visibility and governance of their cloud.\"Radware's Cloud Native Protector is an agentless solution that provides centralized visibility and reporting for workloads and accounts on AWS and Microsoft Azure. Its intuitive 360-degree centralized dashboard shows alerts across accounts and clouds with risk-prioritized alerting so that security teams know which alert to focus on first. Using a multi-layered approach that covers a wide security posture of the cloud and threats to individual workloads, the solution also identifies and prevents public exposure of public facing assets, cloud security misconfigurations, excessive permissions, and malicious activity in the cloud.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}