{"date": "2022-02-01 17:28:04+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds analyst comment</p><p class=\"tr-by\">By Siddharth Cavale and Arriana McLymore</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Feb 1 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>United Parcel Service Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=UPS.N\" data-type=\"ric\" data-ric=\"UPS.N\" translate=\"no\" dir=\"ltr\">UPS.N</a> projected 2022 revenue above market expectations and doled out its biggest dividend boost on Tuesday, as the logistics giant posted record annual earnings on the back of a pandemic-driven surge in online shopping and labor shortages. </p><p>     UPS stock jumped <span class=\"tr-strong\">16</span>% to a record high of $233.72 a share, as the company capped 2021 with double-digit revenue growth across all units and consolidated operating margins touching 14-year highs. </p><p>Under Chief Executive Officer Carol Tome, who took charge in June 2020 when the COVID-19 pandemic raged, the world's largest parcel delivery service adopted a \"better, not bigger\" strategy. </p><p>It prioritized lucrative deliveries over volume and courted customers generating more revenue and profits, such as healthcare companies and small and medium-sized businesses (SMBs).</p><p>\"2021 was an outstanding year for UPS,\" Chief Financial Officer Brian Newman said on a call with analysts on Tuesday. </p><p>Average daily volumes with SMBs grew 18% in the United States despite higher prices, while business with Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> - its largest customer - also notched a healthy jump.</p><p>The e-commerce behemoth's contribution to UPS' total revenue rose to 11.7% in 2021, above pre-pandemic levels, even as concerns lingered over Amazon's development of its own logistics network.</p><p>\"We have a great relationship with Amazon, and we have mutually agreed about the volume that we should take and the volume that they should keep that works best for both companies,\" Tome said. </p><p>     Much like other industries, UPS and rival FedEx Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FDX.N\" data-type=\"ric\" data-ric=\"FDX.N\" translate=\"no\" dir=\"ltr\">FDX.N</a> have been grappling with supply chain challenges and rising Omicron variant cases among their staff. </p><p>FedEx said on Tuesday that it was suspending its domestic express freight services due to COVID-19 cases. UPS said on its earnings call that it had cut staff and returned rental equipment at the tail end of the fourth quarter as COVID cases rose and package volumes decreased. </p><p>However, UPS managed to expand operating margins to 13.5% in 2021. It expects to increase that to 13.7% in 2022, a year earlier than anticipated, helped by lowering costs through automation and higher volumes.</p><p>\"UPS has emphasized the 'better not bigger' concept, which is what they seemed to have put in practice at the end of Q4,\" said Patrick Donnelly, a senior analyst at Third Bridge Group. \"FedEx, now having taken a similar approach, should begin to see margins grow as a result as well.\"</p><p>Atlanta based-UPS hiked its quarterly dividend by 49% year-over-year to $1.52 per share.</p><p>The company in 2022 expects to spend $5.5 billion, with 60% of the amount earmarked for growth projects such as adding radio-frequency identification, or RFID, tags on packages and purchasing electric vehicles, and 40% toward fleet maintenance.</p><p>It also forecast a 2022 revenue of about $102 billion, above the Refinitiv-IBES estimate of $100 billion. </p><p><br/></p><p class=\"tr-signoff\"> (Additional reporting by Arriana Mclymore in New York; Editing by Ramakrishnan M. and Jonathan Oatis)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:lisa.baertlein@thomsonreuters.com\" data-type=\"email\" translate=\"no\">lisa.baertlein@thomsonreuters.com</a> ; +1 310-491-7241; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://lisa.baertlein.thomsonreuters.com@reuters.net\">lisa.baertlein.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: UPS-RESULTS/ (UPDATE 5, PIX)</p></div>"}