{"date": "2021-12-05 07:46:27+00:00", "ticker": "AVV", "mrkt_info": {"open": 3207.0, "close": 3371.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>Dubai, UAE – AVEVA, a global leader in industrial software, driving digital transformation and sustainability, today launched Vision AI Assistant 2021™ – an image classification-based analytics tool. The artificial intelligence (AI) solution, which can be integrated into AVEVA™ System Platform and Operations Management Interface and AVEVA™ Insight, enables customers to use video and images from existing general-purpose cameras and convert them into user-friendly information and timely alerts.</p>\n<p>Designed for low latency industrial environments, Vision AI Assistant leverages deep learning to train and deploy 24x7 artificial intelligence models to enhance situational awareness to help operators focus on the task at hand without continuously monitoring live camera feeds.</p>\n<p>Vision AI Assistant enables organizations to improve operations, quality, and maintenance capabilities across industrial enterprises by using cameras to determine visual anomalies, assess quality, and vigorously monitor production, optimizing efficiencies and improving sustainability in the process. Product applications include:</p>\n<ul class=\"bulleted-list arrowlist\">\n<li>Standard digital cameras can be used with Vision AI Assistant to ensure quality control, such as by analyzing the quality of water treatment fluids, by gauging if a hopper is full or empty, or by identifying defective products on a production line.</li>\n<li>Vision AI Assistant can also scan thermal or infrared camera feeds so operations teams can uncover visual inconsistencies. For example, by locating compressed air or fluid leaks, it can reduce failure and efficiency loss, and by spotting hot-spots in a data center, it can prevent overheating of critical equipment.</li>\n<li>The AI solution assists maintenance efforts through continuous monitoring of plants and machinery and diagnosis of equipment issues weeks, or months before failure.</li>\n</ul>\n<p>Kenneth Labhart, Innovation Leader – Global Supply Chain North America, Schneider Electric said: “AVEVA’s Vision AI is monitoring and analyzing the 1.5 km main drive chain for our Lexington, Kentucky, smart factory which manufactures electric breaker panels. If that chain goes down, our entire factory comes to a halt, which typically happens a few times per year. Vision AI has already provided early detection of issues with parts of this chain on two occasions, giving us the ability to take proactive action. By doing this, we avoid revenue-impacting, unplanned downtime. We’re looking forward to expanding our usage of this AI system.”</p>\n<p>Jim Chappell, Global Head of AI and Advanced Analytics at AVEVA said: “This breakthrough technology represents a game changer that transforms factory operations through the power of AI. The Vision AI Assistant enables enhanced process optimization, thereby reducing time, wastage, and costs. Cameras can also be used in areas that are not suitable for humans for security or safety concerns, freeing up workers to focus on high-value tasks instead of continuously monitoring live camera feeds.”  </p>\n<p>Vision AI Assistant is offered as an exclusive extension for AVEVA System Platform purchases through the AVEVA Flex subscription initiative. The flexible payment and usage program spans any mix of cloud, hybrid, and on-premises solutions across AVEVA's portfolio – enabling simple license purchasing, usage and management.</p>\n<p>-Ends-</p>\n<p><strong>About AVEVA</strong></p>\n<p><span>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence.  AVEVA’s comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries.</span></p>\n<p>Learn more at <a href=\"http://www.aveva.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.aveva.com </a> </p>\n<p><span>Copyright © 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</span></p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}