{"date": "2022-02-04 21:22:02+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2776.91, "close": 3158.71}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\"><li class=\"tr-summaryitem\">Nasdaq ends up &gt;1.5%, S&amp;P 500 gains, DJI slips; banks outperform</li><li class=\"tr-summaryitem\">Consumer disc leads major S&amp;P sectors; materials weakest </li><li class=\"tr-summaryitem\">Dollar, bitcoin, crude, gold all rise </li><li class=\"tr-summaryitem\">U.S. 10-Year Treasury yield pops to ~1.92%</li></ul><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Feb 4</span><span class=\"tr-dl-sep\"> - </span>Welcome to the home for real-time coverage of markets brought to you by Reuters reporters. You can share your thoughts with us at <a href=\"mailto:markets.research@thomsonreuters.com\" data-type=\"email\" translate=\"no\">markets.research@thomsonreuters.com</a></p><p><br/></p><p>WALL STREET ENDS WEEK HIGHER AFTER SOUR RUMBLINGS (1603 ET/2103 GMT)</p><p>What a wacky week on Wall Street. Earnings and outlooks both crumbled and soared while the U.S. jobs market surprised so much to the upside it put an aggressive agenda of Fed rate hikes back on the table, a prospect growth stocks happily ignored. <a href=\"reuters://REALTIME/verb=Headlines/ric=.N\" data-type=\"newsExpression\" data-expression=\".N\" translate=\"no\" dir=\"ltr\">.N</a></p><p>A plunge in Meta Platforms Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a> shares sharply pulled down Snap Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SNAP.N\" data-type=\"ric\" data-ric=\"SNAP.N\" translate=\"no\" dir=\"ltr\">SNAP.N</a>, Spotify Technology SA <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SPOT.N\" data-type=\"ric\" data-ric=\"SPOT.N\" translate=\"no\" dir=\"ltr\">SPOT.N</a> and Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> on Thursday, but after Bezos' juggernaut said later profits almost doubled, tech darlings soared on Friday.</p><p>Snap jumped 58.8%, Spotify climbed 9.2% and Amazon leaped 13.5%. After losing more than a quarter of its value on Thursday, Facebook's parent Meta only fell around 0.3% on Friday.</p><p>Of note, Amazon posted the biggest single day market-cap gain for a stock on Friday, a day after Meta posted the largest market-cap loss ever on a daily basis.</p><p>Growth stocks <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.IGX\" data-type=\"ric\" data-ric=\".IGX\" translate=\"no\" dir=\"ltr\">.IGX</a> made mincemeat of what higher rates might mean to future earnings and valuations, rising 1.3% to trounce a 0.3% slide in value <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.IVX\" data-type=\"ric\" data-ric=\".IVX\" translate=\"no\" dir=\"ltr\">.IVX</a> shares.</p><p>The Dow Jones Industrial Average <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.DJI\" data-type=\"ric\" data-ric=\".DJI\" translate=\"no\" dir=\"ltr\">.DJI</a> slipped just 0.06% while the S&amp;P 500 <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.SPX\" data-type=\"ric\" data-ric=\".SPX\" translate=\"no\" dir=\"ltr\">.SPX</a> gained 0.5% and the Nasdaq Composite <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.IXIC\" data-type=\"ric\" data-ric=\".IXIC\" translate=\"no\" dir=\"ltr\">.IXIC</a> advanced 1.6%.  </p><p>The three indices were positive for the week, with the Dow up 1.0%, the S&amp;P 500 1.6% and the Nasdaq 2.4%. </p><p>The jobs report had a very strong headline number but also showed the number of unemployed people increased, suggesting a super hawkish Fed might not be in the cards, said Thomas Hayes, chairman and managing member at Great Hill Capital LLC.</p><p>\"The initial reaction of the headline was 'uh-oh,' that's bad news,\" Hayes said. \"But when you look under the surface and see the number of unemployed now versus pre-pandemic, that's why you're seeing a bid on everything.</p><p>     The economic rebound will be robust the next 12 to 18 months, making dislocations in biotech stocks, for example, a great opportunity, Hayes said.</p><p>\"The economy's just generally OK. People are going back to work, people are getting out and about and that's a positive thing.\"</p><p>Here is Friday's closing snapshot:</p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"ac7b317f-d7da-4fbb-bc5d-187eb43a3725\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://fingfx.thomsonreuters.com/gfx/buzz/zgpomjaqnpd/Closer02042022.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9maW5nZngudGhvbXNvbnJldXRlcnMuY29tL2dmeC9idXp6L3pncG9tamFxbnBkL0Nsb3NlcjAyMDQyMDIyLnBuZw==&amp;storyId=urn:newsml:reuters.com:20220204:nL1N2UF2CV:3&amp;key=a9c3d45525d708ed887ae042eb93f3a2bb8e94a7f39ae9bf7f8735b04a0faa3132cca921e5ae666f30ae9f992a98b4f1e3984262790c177d979cf8067d7adf43\"/></div></div></div></p><p><br/></p><p>(Herbert Lash)</p><p>*****</p><p><br/></p><p>EARNINGS OUTLOOK GAINS DESPITE META PLATFORMS' SOUR MISS  (1415 EST/1915 GMT)</p><p>After a week rocked by a dismal forecast from Meta Platforms <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a>, fourth-quarter results appear to be in from most of the S&amp;P 500 mega cap companies.</p><p>Mixed in with some big misses from banks and other major companies, there have been some upbeat reports, including Thursday's blowout quarterly results from Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>.</p><p>As such, estimated profit growth has gone up since the start of the reporting period.</p><p>Based on results from 278 companies and forecasts for the rest, S&amp;P 500 earnings for the fourth quarter are now estimated to have increased 27.2%, up from the 22.3% forecast at the start of January, according to IBES data from Refinitiv.</p><p>Of those companies that have reported, 78.4% have beaten consensus, up from 77% just a few days ago, according to Refinitiv data.</p><p><br/></p><p>(Caroline Valetkevitch)</p><p>*****    </p><p><br/></p><p>AMID RECENT TURMOIL, BEARS STILL HIGH, BULLS STILL LOW (1253 EST/1753 GMT)</p><p>The percentage of individual investors with a pessimistic outlook on the U.S. stock market remained \"unusually high\" and optimism was still \"unusually low\" in the latest American Association of Individual Investors Sentiment Survey (AAII). With this, neutral sentiment increased.</p><p>AAII reported that bearish sentiment, or expectations that stock prices will fall over the next six months, fell by 9.3 percentage points to 43.7%. This is bearish sentiment's 11th straight week above its historical average of 30.5% and its third consecutive week at an \"unusually high level.\"</p><p>Bullish sentiment, or expectations that stock prices will rise over the next six months, rose by 3.4 percentage points to 26.5%. Nevertheless, optimism remains well below its historical average of 38.0%. Bullish sentiment levels are also \"unusually low\" for the fourth straight week. This is the first time this has happened since the four-week period from June 17 to July 8, 2020. </p><p>Neutral sentiment, or expectations that stock prices will stay essentially unchanged over the next six months, jumped by 5.9 percentage points to 29.9%. The historical average is 31.5%.</p><p>AAII noted that the S&amp;P 500 index has \"gone on to realize above-average and above-median returns during the six- and 12-month periods following an unusually low reading for bullish sentiment.\" Six-month returns in the wake of an unusually high bearish sentiment reading have also \"tended to be above-average and above-median.\"    </p><p>With these changes, the bull-bear spread rose to -17.20 from -29.8 last week <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2U80PV\" data-type=\"storyId\" data-story-id=\"nL1N2U80PV\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span>:  </p><p>  </p><p><div class=\"tr-resource-ref\" id=\"g40fa0129-795d-40e6-9636-7bf5b5de748d\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://fingfx.thomsonreuters.com/gfx/buzz/gkvlgjbaxpb/AAII02042022.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9maW5nZngudGhvbXNvbnJldXRlcnMuY29tL2dmeC9idXp6L2drdmxnamJheHBiL0FBSUkwMjA0MjAyMi5wbmc=&amp;storyId=urn:newsml:reuters.com:20220204:nL1N2UF2CV:3&amp;key=cc7d0ca0185c1871c37982c6e2d718cb5e4aac30f6aeb8cfa23ecfe7a7edf511c34eb496dd7d58fdfe1e5a093c17c83db5ebda89724e79764468e8f33dd31e92\"/></div></div></div></p><p><br/></p><p>(Terence Gabriel)</p><p>*****</p><p><br/></p><p>TIME TO GO BIG IN SMALL CAP SPACE? (1250 EST/1750 GMT)  </p><p>With key small cap indexes down sharply from their all-time highs, some market watchers are reminding investors not to ignore the space.</p><p>With increased market volatility and rising inflation, small caps are attractive to many investors, according to Joel Rubenstein, senior portfolio manager for EFG New Capital. In a recent note, he says small caps have \"outperformed inflation in every decade on record.\"</p><p>The Russell 2000 index <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.RUT\" data-type=\"ric\" data-ric=\".RUT\" translate=\"no\" dir=\"ltr\">.RUT</a> is down about 18% from its Nov. 8 closing record high after recently confirming it was in a bear market by falling more than 20% from that November peak.</p><p>Others note that investors should focus in particular on small-cap value shares.</p><p>Conditions are ideal for small-cap value to experience a prolonged period of outperformance, Michael Petro, portfolio manager of the Putnam Small Cap Value Fund, wrote in a recent report.</p><p>\"Small caps should benefit as the economy rebounds from the depths of the pandemic and growth broadens beyond select work-from-home technology beneficiaries,\" he said.</p><p>\"A resurging economy combined with higher inflation could bring double-digit nominal growth rates to a wider swath of the investing universe. This should make reasonable growth less scarce and attract investors to the long-neglected small-cap value space,\" he wrote.</p><p>Steve Lipper, senior investment strategist at Royce Investment Partners, in a note said he believes that small-cap value should continue to outperform small-cap growth, as measured by the Russell 2000 value and growth indexes.</p><p>The Russell 2000 Value Index <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.RLV\" data-type=\"ric\" data-ric=\".RLV\" translate=\"no\" dir=\"ltr\">.RLV</a> is down just 2.3% for the year to date, while the Russell 2000 Growth Index <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.RLG\" data-type=\"ric\" data-ric=\".RLG\" translate=\"no\" dir=\"ltr\">.RLG</a> is down about 10.2% over that same period.</p><p><br/></p><p>(Caroline Valetkevitch)</p><p>*****</p><p><br/></p><p>THAT'S FIVE STRAIGHT WEEKS OF LOSSES FOR EUROPE (1202 EST/1702 GMT)  </p><p>The STOXX 600 <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.STOXX\" data-type=\"ric\" data-ric=\".STOXX\" translate=\"no\" dir=\"ltr\">.STOXX</a> has closed on a weekly loss of 0.7%, its fifth straight week of losses. </p><p>In other words, the pan-European index has never so far in 2022 made it to the weekend with some gains in its pocket. </p><p>Five red weeks in a row is a pretty rare occurrence which only last happened during the March 2020 COVID-19 market crash. </p><p>Another worrying fact is the 6.8% decline by the STOXX 600 since its Jan. 4 record high of 495.46 points.</p><p>It's not a correction yet, but it's getting dangerously close. </p><p>Tensions over Ukraine, the uncertainty surrounding tech and the new global monetary tightening cycle make the direction of travel uncertain even if analysts are still revising their expectations upwards for the ongoing earnings season.  </p><p>European equity markets have been happily co-existing with negative yields on benchmark euro zone government bonds for years now but the European Central Bank's \"pivot\" moment on Thursday probably marks the end of that era. </p><p>This session saw the yield of Germany's Bund reach 0.29%, a first since January 2019 and the country's five-year bond yields turned positive for the first time since 2018. </p><p>With money market investors already rushing in to price several ECB rate hikes in 2022 - something President Christine Lagarde said was unlikely only until recently - equity traders may also soon work out how that impacts their equity risk premium models.</p><p>We'll probably find out soon.  </p><p><br/></p><p>(Julien Ponthus) </p><p>*****</p><p><br/></p><p><br/></p><p><br/></p><p>STRONG JOBS DATA TIGHTENS FED'S OUTLOOK (1109 EST/1609 GMT) </p><p>The strong labor market report on Friday was a boost for anyone worried about the strength of the U.S. economy, but it keeps the Fed on a tightrope with the first hurdle whether to hike interest rates by 25 or 50 basis points in March.</p><p>Economists and market participants said the upward revisions in the labor report put the jobs trend more in line with how they had seen the economy before the Omicron variant led so many workers to call in sick and cloud the jobs picture.</p><p>The strong data highlights the Federal Reserve's gradualist approach to policy and will bring back talk of a 50 bps hike in March, said David Petrosinelli, senior trader at InspereX.</p><p>\"It's disturbing that the Fed is still buying bonds and hasn't raised rates yet,\" Petrosinelli told Reuters.</p><p>\"Does this is increase the probability of a 50 basis points in March? You bet it does. I don't think we're going to get that because I think this Fed has locked themselves in to a gradualist regime and a gradualist approach.\" </p><p>Concerns that the Fed will be forced to act more urgently could come back to the fore and be a headwind for equities, said Matt Peron, director of research at Janus Henderson Investors.</p><p>The labor report was especially strong in \"re-opening\" sectors and together with wage gains continues to spur the inflationary \"wall of worry,\" he said.</p><p>\"Our fears that the first half of 2022 would be 'choppy' for markets are still holding and we are not out of the woods yet,\" Peron said.</p><p>Morgan Stanley said a Fed in tightening mode historically brings lower returns and great uncertainty for equities.</p><p>\"We remain sellers of rallies and of the view that S&amp;P 500 fair value remains closer to 4,000 tactically,\" the bank's research team said. The 4,000 level represents more than a 10% decline from the benchmark's close on Thursday.</p><p>The data made it clear that the labor market before Omicron was much stronger than previously believed, said Ian Shepherdson, chief economist at Pantheon Macroeconomics. </p><p>\"It's very tempting to argue that the January data mean that all danger of an Omicron hit has passed,\" he said. \"We're a bit more cautious.\"</p><p>Shepherdson noted that the year-over-year wage growth jumped to 5.7%, but the three-month-on-previous-three-month annualized rate rose to a startling 7.7%.</p><p>\"No matter how bullish you are about productivity growth, the Fed can't live with that pace,\" Shepherdson said.</p><p>The report showed a jump in the labor participation rate to 62.2%, a surprise because Omicron was believed to have put a crunch on people seeking work.  </p><p>People are more willing to seek work, which should improve the overall labor market landscape if it continues and ease inflationary pressures, said Russell Price, chief economist at Ameriprise Financial Services Inc in Troy, Michigan.</p><p>\"The wage increases that we've seen are having the positive effect of drawing more people back into the job market,\" Price said, adding that \"it would alleviate some of the upward pressure on inflation.\"</p><p>The results also suggest that businesses have been more willing to hold on to as many seasonal workers as they could as a means of overcoming ongoing labor market tightness, he said.</p><p><br/></p><p>(Herbert Lash)</p><p>*****</p><p><br/></p><p>U.S. STOCKS MIXED AS JOBS DATA STIRS THE POT (1009 EST/1509 GMT)</p><p>Major U.S. indexes are mixed in early trade on Friday. This as a boost from Amazon.com's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> results is helping to counter an unexpected jump in U.S. growth in January which is fanning inflation fears. <a href=\"reuters://REALTIME/verb=Headlines/ric=.N\" data-type=\"newsExpression\" data-expression=\".N\" translate=\"no\" dir=\"ltr\">.N</a></p><p>The U.S. 10-Year Treasury yield <a href=\"reuters://REALTIME/Verb=FullQuote/ric=US10YT=RR\" data-type=\"ric\" data-ric=\"US10YT=RR\" translate=\"no\" dir=\"ltr\">US10YT=RR</a> has thrust above 1.90%, and is on the verge of its highest weekly close since December 2019.</p><p>With this, the Nasdaq <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.IXIC\" data-type=\"ric\" data-ric=\".IXIC\" translate=\"no\" dir=\"ltr\">.IXIC</a> is rising nearly 1%, while the S&amp;P 500 <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.SPX\" data-type=\"ric\" data-ric=\".SPX\" translate=\"no\" dir=\"ltr\">.SPX</a> is slightly green. The Dow <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.DJI\" data-type=\"ric\" data-ric=\".DJI\" translate=\"no\" dir=\"ltr\">.DJI</a> is down slightly.</p><p>Of note, however, both the SPX and the DJI are attempting to use their 200-day moving averages (DMA) as support. Here is the S&amp;P 500's daily chart:</p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"g51ebbce4-7765-4607-a9b3-c922af8e2a78\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://fingfx.thomsonreuters.com/gfx/buzz/dwpkrjknwvm/SPX02042022.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9maW5nZngudGhvbXNvbnJldXRlcnMuY29tL2dmeC9idXp6L2R3cGtyamtud3ZtL1NQWDAyMDQyMDIyLnBuZw==&amp;storyId=urn:newsml:reuters.com:20220204:nL1N2UF2CV:3&amp;key=e2991846e93e9c90b4b1e04bbba378ff623f0a5c9a1985e730dd0cef2fb28e41bf077824849db21b07c0724e2c5ad07f6469211697bc9e99ba1dde9c044d2203\"/></div></div></div></p><p>     </p><p>The SPX hit a low of 4,464.63 and the DJI fell to 34,968.82 before bouncing. Their closely watched longer-term moving averages now reside around 4,444 and 35,000. The Nasdaq is well below its 200-DMA which is at 14,735.</p><p>Here is where markets stand in early trade:</p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"e5800ef8-049b-4920-9914-141ef2f8a938\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://fingfx.thomsonreuters.com/gfx/buzz/xmvjojbxzpr/earlytrade02042022.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9maW5nZngudGhvbXNvbnJldXRlcnMuY29tL2dmeC9idXp6L3htdmpvamJ4enByL2Vhcmx5dHJhZGUwMjA0MjAyMi5wbmc=&amp;storyId=urn:newsml:reuters.com:20220204:nL1N2UF2CV:3&amp;key=234e37c73c9e2085565d310023eb2cf23625078939598b1d50125b60349b3bd6d21d10d801f004a70e466081d6ee1fb4680b67e4320b0dde413d3ba741d68f0c\"/></div></div></div></p><p><br/></p><p>(Terence Gabriel)</p><p>***** </p><p><br/></p><p>U.S. FUTURES PRESSURED AFTER ABOVE ESTIMATES PAYROLLS PRINT (0900 EST/1400 GMT)</p><p>U.S. equity index futures are under pressure after the headline jobs number in the January payrolls report came in well above estimates, and the December number was revised sharply higher. With this, wage data came in on the hot side vs estimates <a href=\"reuters://REALTIME/verb=Headlines/ric=.N\" data-type=\"newsExpression\" data-expression=\".N\" translate=\"no\" dir=\"ltr\">.N</a>:</p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"g7a785760-e11b-470b-8cee-57b9b237f614\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://fingfx.thomsonreuters.com/gfx/buzz/byvrjxmnbve/NFP02042022.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9maW5nZngudGhvbXNvbnJldXRlcnMuY29tL2dmeC9idXp6L2J5dnJqeG1uYnZlL05GUDAyMDQyMDIyLnBuZw==&amp;storyId=urn:newsml:reuters.com:20220204:nL1N2UF2CV:3&amp;key=6e11be5fbfadc933c42bb32f54904c7db2c79b7afc48c851d503a027b73f6b113a2e8dd89f750d1c5137e2a853204d55dfa4ee05a6383e80651e5fdbb05f0641\"/></div></div></div></p><p><br/></p><p>Nasdaq 100 futures <a href=\"reuters://REALTIME/Verb=FullQuote/ric=NQcv1\" data-type=\"ric\" data-ric=\"NQcv1\" translate=\"no\" dir=\"ltr\">NQcv1</a>, which were up more than 2% in overnight trade, with a boost from Amazon.com's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> results <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2UF1RF\" data-type=\"storyId\" data-story-id=\"nL4N2UF1RF\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span>, are now off around 0.5%. </p><p>S&amp;P 500 futures <a href=\"reuters://REALTIME/Verb=FullQuote/ric=EScv1\" data-type=\"ric\" data-ric=\"EScv1\" translate=\"no\" dir=\"ltr\">EScv1</a> and Dow futures <a href=\"reuters://REALTIME/Verb=FullQuote/ric=1YMcv1\" data-type=\"ric\" data-ric=\"1YMcv1\" translate=\"no\" dir=\"ltr\">1YMcv1</a> are also posting modest declines of around 0.5%.</p><p>Meanwhile, the U.S. 10-Year Treasury yield <a href=\"reuters://REALTIME/Verb=FullQuote/ric=US10YT=RR\" data-type=\"ric\" data-ric=\"US10YT=RR\" translate=\"no\" dir=\"ltr\">US10YT=RR</a> is pushing over 1.90%, and is hitting fresh highs going back to January 2020. </p><p>Regarding the jobs data, Sam Stovall, chief investment strategist at CFRA Research, said \"With the payroll numbers coming substantially stronger than expected, it will help relieve some economic growth worries at a time the Fed is ready to tap the break.\"</p><p>Stovall added \"This definitely would relieve investor worries that a 25 or 50 basis point rate hike in March would be adverse for economic growth and it gives the Fed a reason to start the rate hike cycle at a 50-bps hike and leaves on the table a possibility of four or more rate hikes.\"</p><p>Here is your premarket snapshot:</p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"g651e2b7c-58be-4b83-9250-e2d04fd06ad2\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://fingfx.thomsonreuters.com/gfx/buzz/klpykmqlypg/Premarket02042022.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9maW5nZngudGhvbXNvbnJldXRlcnMuY29tL2dmeC9idXp6L2tscHlrbXFseXBnL1ByZW1hcmtldDAyMDQyMDIyLnBuZw==&amp;storyId=urn:newsml:reuters.com:20220204:nL1N2UF2CV:3&amp;key=4e5ba1081b8969b8619012cec9883eaad664e8398e2cf583e77205dff28c37047423ef8b370bceec6fd2b36525977009dd8f71fc133471a746ef7da43337b941\"/></div></div></div></p><p><br/></p><p>(Terence Gabriel, Shashank S. Nayar)</p><p>*****</p><p><br/></p><p>FOR FRIDAY'S LIVE MARKETS' POSTS PRIOR TO 0900 EST/1400 GMT - CLICK HERE: <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2UF3UW\" data-type=\"storyId\" data-story-id=\"nL8N2UF3UW\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Terence Gabriel is a Reuters market analyst. The views expressed are his own)</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: GLOBAL-STOCKS/</p></div>"}