{"date": "2021-11-29 17:24:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><strong>(SACRAMENTO)</strong>\n              <p>\n                <a href=\"https://health.ucdavis.edu/welcome/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">UC Davis Health</a> has launched a Cloud Innovation Center (CIC), powered by Amazon Web Services, making the renowned academic medical center one of America's leaders in digital medicine.\n    </p>\n              <p>\n      UC Davis Health is the first academic medical center in the world to launch a CIC with Amazon Web Services. Focused on digital health equity, the UC Davis Health CIC will allow clinicians, patients, developers, and students to exchange ideas, as well as design and prototype solutions focused on making digital health more equitable and accessible worldwide.\n    </p>\n              <p>\n      \"Digital health equity has become a front-and-center issue, particularly during the COVID-19 pandemic,\" said <a href=\"https://health.ucdavis.edu/leadership/bios/lubarsky_bio.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">David Lubarsky</a>, CEO of UC Davis Health. \"Many of our underserved communities have struggled even more to receive the care they need, and the digital divide has only widened. We are committed to finding innovative ways to make healthcare more accessible to every patient, no matter who they are or where they live.\"\n    </p>\n              <p>\n      UC Davis Health and Amazon Web Services will each commit staff to work with clinicians, students, organizations, and the community to define real world challenges around digital health equity through the CIC. The challenges will explore difficult issues around providing equitable care to a diverse patient population. They may address issues around remote patient care, discrepancies in technology used for healthcare, transportation, or mental health that could be improved to better serve a diversity of patients. Projects will be driven by clinicians, patients, and the community-at-large who will submit their challenge ideas.\n    </p>\n              <p>\n      The challenge findings will be published as open source for other community members to access, build upon, and implement.\n    </p>\n              <p>\n      \"Many clinicians and patients are mandated to use certain products and services, but they're often left out of the decision-making process,\" said <a href=\"https://health.ucdavis.edu/leadership/bios/atreja_bio.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Ashish Atreja</a>, chief information officer and chief digital officer at UC Davis Health. \"Our goal with the UC Davis Health CIC powered by Amazon Web Services is to create a global collaborative community with a mission to leave no patient, clinician, or researcher behind in the digital transformation of healthcare.\"\n    </p>\n              <p>\n      The CIC is the latest initiative from UC Davis Health to advance digital medicine through its <a href=\"https://health.ucdavis.edu/CoLab/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Digital CoLab</a> (Digital Collaborative for Innovation and Validation). Digital CoLab will serve as the liaison between clinicians, researchers, students, and the community to co-ideate, co-create, co-validate, and co-transform digital health solutions. The program is the digital health innovation hub for UC Davis Health and is focused on accelerating digital health technologies to make healthcare more accessible, equitable, and inclusive for everyone.\n    </p>\n              <p>\n      \"We are committed to advancing digital-first and data-driven models of care to continue to provide exceptional patient care and experiences,\" said Keisuke Nakagawa, executive director of the UC Davis Health Cloud Innovation Center and director of innovation for the Digital CoLab. \"Our collaboration with Amazon Web Services will provide us with a tool to unlock the intrapreneurial spirit of our clinicians, patients, and developers in the region to provide a one-of-a-kind space where people who've never had a voice in healthcare will be the ones driving the thinking and innovation.\"\n    </p>\n              <p>\n      The UC Davis Health CIC is part of the Amazon Web Services <a href=\"https://aws.amazon.com/government-education/cloud-innovation-centers/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">global CIC Program</a>, which brings together nonprofit, education, and government organizations. The goal is to collaborate on solutions to address challenges and real-world problems that matter most to communities related to healthcare, smart cities, sustainability, and cybersecurity. Organizations bring their expertise, while Amazon provides resources, to work through challenges to find new ways to innovate.\n    </p>\n              <p>\n      \"For a number of years, Amazon Web Services has been accelerating innovation throughout the global healthcare industry-from powering vaccine production, to advancing academic medical research, and creating a variety of solutions that drive the development of life-saving therapies,\" said Kim Majerus, vice president of education, state and local government at Amazon Web Services. \"Our collaboration with UC Davis Health, a vast and diverse health system, brings together our commitment to improve health outcomes with an organization that is deeply invested in addressing health disparities and providing the best care to communities.\"\n    </p>\n              <p>\n      Learn more about UC Davis Health's <a href=\"https://health.ucdavis.edu/cic\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Cloud Innovation Center powered by AWS</a>.\n    </p>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://health.ucdavis.edu/health-news/newsroom/initiative-to-make-uc-davis-health-a-leader-in-digital-medicine/2021/11\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>UC Davis Health System</strong> published this content on <strong>29 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>29 November 2021 17:24:00 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - UC Davis Health System</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: UC-Davis-Health-System</p></div>"}