{"date": "2022-01-03 05:50:09+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Aditya Kalra and Abhirup Roy</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">MUMBAI, Jan 3 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>India's Future Retail <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FRTL.NS\" data-type=\"ric\" data-ric=\"FRTL.NS\" translate=\"no\" dir=\"ltr\">FRTL.NS</a> has asked a New Delhi court to declare ongoing arbitration proceedings with Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> illegal, saying the country's antitrust agency had suspended a 2019 deal which Amazon used to assert its rights over Future.</p><p>Amazon successfully used the terms of its toehold $200 million investment in debt-laden Future to <a href=\"https://reut.rs/3FS0roN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">block</a> the Indian retailer's attempt to sell retail assets to a rival, alleging breach of certain contracts. </p><p>But the Indian antitrust body, the Competition Commission of India, in December <a href=\"https://reut.rs/3qAZqLu\" data-type=\"url\" class=\"tr-link\" translate=\"no\">suspended</a> the 2019 deal saying Amazon suppressed information while seeking approvals.</p><p>The long-running dispute is being heard by a Singapore arbitration panel, but both sides have been fighting parallel cases in Indian courts to enforce or overrule certain decisions taken by the arbitrator.</p><p>In the latest Future Retail filing in New Delhi, the company argues that since the 2019 deal no longer has antitrust approval, it has \"no legal existence\" in India and Amazon can no longer assert any of its rights.</p><p>The \"continuation of the entire arbitration proceedings is a perpetuation of illegality,\" Future said in its filing <span class=\"tr-strong\">dated</span> Dec. 31.</p><p>The case will likely be heard by judges this week.</p><p>Future and Amazon did not respond to a request for comment.</p><p>The filing also showed that Future's appeal to the Delhi High Court comes after the Singapore arbitration panel did not agree to its immediate demands to terminate the proceedings, saying arguments would continue this month.</p><p>Amazon has long argued that Future violated the terms of its 2019 deal in deciding to sell retail assets to Reliance, and the U.S. company's position has so far been backed by the Singapore arbitrator and Indian courts. Future denies any wrongdoing.</p><p>But people familiar with the case say the antitrust suspension could make it easier for Future to push through its attempts to sell retail assets to Reliance and weaken Amazon's legal position.</p><p>The dispute over Future Retail, which has more than 1,500 supermarket and other outlets, is the most hostile flashpoint between Jeff Bezos' Amazon and Reliance, run by India's richest man Mukesh Ambani, as they try to gain the upper hand in winning retail consumers. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2ID0LX\" data-type=\"storyId\" data-story-id=\"nL1N2ID0LX\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Abhirup Roy; Editing by Michael Perry)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:abhirup.roy@thomsonreuters.com\" data-type=\"email\" translate=\"no\">abhirup.roy@thomsonreuters.com</a> ; + 91 22 6180 7067; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://abhirup.roy.thomsonreuters.com@reuters.net\">abhirup.roy.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-INDIA/FUTURE-RELIANCE (PIX)</p></div>"}