{"date": "2021-12-16 02:05:11+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3381.83, "close": 3377.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n                  <strong>TOKYO - December 16, 2021</strong> - <a href=\"https://www.nttdata.com/global/en\" data-type=\"url\" class=\"tr-link\" translate=\"no\">NTT DATA</a>, a global digital business and IT services leader, today announced a strategic collaboration with Amazon Web Services (AWS), to support clients' use of cloud services to accelerate their digital transformation (DX). NTT DATA will leverage AWS technical support and other resources to accelerate clients' DX, develop services using cloud technologies from AWS, and pursue human resource development and research and development (R&amp;D).<br/>\n         Moving forward, NTT DATA aims to leverage its proven track record and high delivery capabilities in Japan to establish a leading position in digital business together with AWS, advance its business on a global scale, and contribute to business growth for its clients.\n      </p>\n                <p>\n        Background\n      </p>\n                <p>\n        The use of cloud-based systems has accelerated over the years as companies seek to quickly launch digital businesses, reduce the cost of legacy systems, and enhance operational efficiency. The capability to safely and securely utilize the latest technologies is essential. Through this strategic collaboration with AWS, NTT DATA will generate new business opportunities, and strengthen its digital offerings by combining the strengths and expertise of each company.\n      </p>\n                <p>\n        Aims and Framework of Collaboration\n      </p>\n                <p>\n                  <span>1. Promote clients' introduction to cloud services, and businesses that support clients' acceleration of DX</span>\n                  <br/>\n         As experts in large-scale, mission critical systems with optimal solutions capabilities for clients' digital projects, NTT DATA will strengthen a framework to support clients that consider moving their IT infrastructure to the cloud. This collaboration will combine NTT DATA's accumulated knowledge and experience as an AWS Premier Consulting Partner, with services from AWS as well as technical expertise delivered by the AWS Professional Services Team. The framework will include a comprehensive quality enhancement program as well as a superior level of support for clients, allowing them to select and adopt optimal cloud services that meets their business needs.\n      </p>\n                <p>\n                  <span>2. Develop new services by combining both companies' expertise</span>\n                  <br/>\n         The collaboration will also combine NTT DATA's expertise in providing solutions that match clients' business needs with AWS to develop new services.<br/>\n         In addition to expanding collaboration in fields such as data collection, analysis and security on AWS<sup>1</sup>, NTT DATA will also explore utilizing this collaboration framework to develop new services that aim to contribute to solving social issues through clients' business growth.<br/>\n         Further, NTT DATA will make these services available on AWS Marketplace.\n      </p>\n                <p>\n                  <span>3. Further strengthen development of personnel with digital expertise, and pursue R&amp;D</span>\n                  <br/>\n         NTT DATA will utilize both online and customized training and other resources provided by AWS to increase the number of AWS certified engineers in the NTT DATA Group from approximately 2,300 (as of August 31, 2021) nationwide, to 5,000 by the end of March 2025. Further, NTT DATA will develop personnel who are able to provide consulting or assist with the cutting-edge technologies, and contribute to clients' efforts on digitization.<br/>\n         Additionally, NTT DATA will also pursue measures to utilize the latest digital technologies and explore new avenues of research and development through this collaboration. The outcome of these efforts will be incorporated into NTT DATA's Altemista<sup>®</sup><sup>3</sup> solution suite, an internal standard for creating business value for clients, with the aim of allowing a rapid response to changes in the business environment, with safe and secure system development.\n      </p>\n                <p>\n        Commenting on the strategic cooperation, Isao Arima, Managing Executive Officer at NTT DATA, said: \"Digital transformation (DX) is continuing to accelerate in all types of industries, and utilizing highly agile cloud services has become essential to implement these systems. As a Trusted Global Innovator, NTT DATA is focusing on strengthening its digital capabilities, including cloud services, and developing human resources to support successful DX implementation for clients. We are extremely pleased to be able to strengthen collaboration with AWS, a leader in cloud services, and expect to provide clients with even greater value.\"\n      </p>\n                <p>\n        Chris Sullivan, Head of Global Strategic Alliances at AWS commented: \"NTT Data joined the Partner Network when we were just started in 2012, and for almost a decade has greatly supported our joint Japanese customers across all industries, including finance, public infrastructure, and other enterprises. With this collaboration agreement, we will strengthen our relationship even further and we look forward to many more years of working closely to support our joint customers as they are moving to the cloud.\"\n      </p>\n                <p>\n        Notes\n      </p>\n                <p>\n        About NTT DATA\n      </p>\n                <p>\n        NTT DATA - a part of NTT Group - is a trusted global innovator of IT and business services headquartered in Tokyo. We help clients transform through consulting, industry solutions, business process services, IT modernization and managed services. NTT DATA enables clients, as well as society, to move confidently into the digital future. We are committed to our clients' long-term success and combine global reach with local client attention to serve them in over 50 countries. Visit us at <a href=\"https://www.nttdata.com/global/en\" data-type=\"url\" class=\"tr-link\" translate=\"no\">nttdata.com.</a></p>\n                <p>\n        Contacts\n      </p>\n                <p>\n        Media inquiries\n      </p>\n                <p>\n        NTT DATA Corporation<br/>\n         Public Relations Department<br/><a href=\"mailto:pr-support@kits.nttdata.co.jp\" data-type=\"email\" translate=\"no\">pr-support@kits.nttdata.co.jp</a></p>\n                <p>\n        Product and service inquiries\n      </p>\n                <p>\n        NTT DATA Corporation<br/>\n         Data Center &amp; Cloud Services Division<br/>\n         Cloud Services Strategy Group<br/>\n         Contact persons: Takayuki Umino<br/>\n         Tel: 050-5546-7240\n      </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.nttdata.com/global/en/media/press-release/2021/december/ntt-data-enters-a-strategic-collaboration-agreement-with-aws\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>NTT DATA Corporation</strong> published this content on <strong>16 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>16 December 2021 02:05:11 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - NTT DATA Corporation</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NTT-DATA-Corporation</p></div>"}