{"date": "2021-12-02 14:00:02.657000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>AWS Helps Pfizer Accelerate Drug Development and Clinical Manufacturing</b>\n</p><p class=\"bwalignc\">\n<span>AWS works with Pfizer to support more rapid innovation and improved clinical manufacturing operations to help develop tomorrow’s therapies</span>\n</p><p>\nToday, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), announced that it is working with Pfizer to create innovative, cloud-based solutions with the potential to improve how new medicines are developed, manufactured, and distributed for testing in clinical trials. The companies are exploring these advances through their newly created Pfizer Amazon Collaboration Team (PACT) initiative, which applies AWS capabilities in analytics, machine learning, compute, storage, security, and cloud data warehousing to Pfizer laboratory, clinical manufacturing, and clinical supply chain efforts. For instance, AWS is helping Pfizer enhance its continuous clinical manufacturing processes by incorporating predictive maintenance capabilities built with AWS machine learning services like Amazon Lookout for Equipment (AWS’s service for detecting abnormal equipment behavior by analyzing sensor data). As a result, Pfizer can maximize uptime for equipment such as centrifuges, agitators, pulverizers, coaters, and air handlers used in clinical drug manufacturing. The overall focus of this collaboration is to support Pfizer in more rapidly and reliably producing new drugs and evaluating their potential health benefit for patients.\n</p><p>\n“Our life sciences customers are increasingly looking for opportunities to scale expertise, insight, and secure access to the right information, at the right time, with the aim of reducing the time and cost for drug development and clinical trials,” said Kathrin Renz, Vice President of Business Development and Industries at Amazon Web Services, Inc. “AWS’s breadth and depth of cloud capabilities help support Pfizer’s teams through secure, novel research methods as they work to optimize drug development and clinical manufacturing processes. The past two years have reinforced for the world just how much speed and agility matter at every step of the research, development, and clinical manufacturing cycle when lives are on the line. We’re proud to work with Pfizer and lend our deep domain expertise to assist in developing solutions that could significantly improve the lives of patients globally.”\n</p><p>\n“Pfizer’s goal with AWS is to expedite the processes for drug discovery and development in ways that can ultimately enhance patient experiences and deliver new therapies to market. Working closely with AWS experts in machine learning and analytics, we aim to provide our scientists and researchers with the insights they need to help deliver medical breakthroughs that change patients’ lives,” said Andrew McKillop, Vice President of Pharmaceutical Sciences, Worldwide Research, Development, and Medical at Pfizer.\n</p><p>\nAWS is working with Pfizer to develop a prototype solution for detecting abnormal data points in its drug product continuous clinical manufacturing platform for solid, oral-dose medicines. The prototype solution uses Amazon SageMaker (AWS’s service for building, training, and deploying machine learning models quickly in the cloud and at the edge), Amazon Lookout for Equipment, Amazon Lookout for Metrics (AWS’s service for automatically detecting anomalies in metrics and identifying their root cause), and Amazon QuickSight (AWS’s scalable machine learning-powered business intelligence service for the cloud). The machine learning models used in the prototype were able to provide early warnings for alarms with minimal false positives and direct users to the relevant signals. As a result, Pfizer can process data from the equipment and sensors involved in <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.pfizer.com%2Fnews%2Ffeatured_stories%2Ffeatured_stories_detail%2Fpfizer_advancing_rapid_deployment_tablet_manufacturing_platform&amp;esheet=52543836&amp;newsitemid=20211202005591&amp;lan=en-US&amp;anchor=Portable+Continuous+Miniature+and+Modular&amp;index=1&amp;md5=18fd247275551b92a5a06f054a4da504\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Portable Continuous Miniature and Modular</a> (PCMM) manufacturing to detect anomalies as they occur, predict maintenance needs, and reduce potential equipment downtime.\n</p><p>\nPfizer scientists will also collaborate with AWS healthcare and life sciences professionals to explore how researchers in Pfizer’s Pharmaceutical Sciences Small Molecules teams can extract and mine information from legacy documents by leveraging AWS analytics and machine learning services. Pfizer has an extensive collection of documents that contain valuable data from a variety of drug development processes. The documents include data related to synthetic chemistry routes, recipes, analytical tests, method development, formulation composition, clinical manufacturing campaigns, batch records, technology transfer, and many other types of work. Housed within these documents are potentially powerful insights that could point Pfizer researchers in the right direction for developing new drugs or repurposing existing ones—if the researchers can identify and link the right information efficiently. To gain quick, secure access to the right information at the right time, Pfizer’s Pharmaceutical Sciences Small Molecules teams are working with AWS to develop a prototype system that can automatically extract, ingest, and process data from this documentation to help in the design of lab experiments. The prototype system is powered by Amazon Comprehend Medical (AWS’s HIPAA-eligible natural language processing (NLP) service to extract information from unstructured medical text accurately and quickly) and Amazon SageMaker, and uses Amazon Cognito to deliver secure user access control.\n</p><p>\n<strong>About Amazon Web Services</strong>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com&amp;esheet=52543836&amp;newsitemid=20211202005591&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=2&amp;md5=16807820c233d9e19c3d8e178bda6786\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<strong>About Amazon</strong>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Famazon.com%2Fabout&amp;esheet=52543836&amp;newsitemid=20211202005591&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=3&amp;md5=ae42e78b187d1605a359ea4e9e4e8f3e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p>\n<b>About Pfizer: Breakthroughs That Change Patients’ Lives</b>\n</p><p>\nAt Pfizer, we apply science and our global resources to bring therapies to people that extend and significantly improve their lives. We strive to set the standard for quality, safety and value in the discovery, development and manufacture of health care products, including innovative medicines and vaccines. Every day, Pfizer colleagues work across developed and emerging markets to advance wellness, prevention, treatments and cures that challenge the most feared diseases of our time. Consistent with our responsibility as one of the world's premier innovative biopharmaceutical companies, we collaborate with health care providers, governments and local communities to support and expand access to reliable, affordable health care around the world. For more than 170 years, we have worked to make a difference for all who rely on us. We routinely post information that may be important to investors on our website at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.Pfizer.com&amp;esheet=52543836&amp;newsitemid=20211202005591&amp;lan=en-US&amp;anchor=www.Pfizer.com&amp;index=4&amp;md5=ca58c15605770efbad3122f7efaac800\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.Pfizer.com</a>. In addition, to learn more, please visit us on <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.Pfizer.com&amp;esheet=52543836&amp;newsitemid=20211202005591&amp;lan=en-US&amp;anchor=www.Pfizer.com&amp;index=5&amp;md5=40e029a969f529fadd0432766dd0a808\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.Pfizer.com</a> and follow us on Twitter at @Pfizer and @Pfizer News, LinkedIn, YouTube and like us on Facebook at Facebook.com/Pfizer.\n</p><p>\n<b>Pfizer Disclosure Notice</b>: The information contained in this release is as of November 29, 2021. Pfizer assumes no obligation to update forward-looking statements contained in this release as the result of new information or future events or developments.\n</p><p>\nThis release contains forward-looking information about an initiative between Amazon Web Services, Inc. (AWS) and Pfizer (the Pfizer Amazon Collaboration Team (PACT) initiative) that applies AWS capabilities in analytics, machine learning, compute, storage, security, and cloud data warehousing to Pfizer laboratory, clinical manufacturing and clinical supply chain efforts, including efforts by AWS and Pfizer to create innovative, cloud-based solutions with the potential to improve how new medicines are developed, manufactured, and distributed for testing in clinical trials, including its potential benefits, that involve substantial risks and uncertainties that could cause actual results to differ materially from those expressed or implied by such statements. Risks and uncertainties include, among other things, the uncertainties inherent in research and development; uncertainties regarding the commercial success of and the ability to realize the anticipated benefits of the initiative; uncertainties regarding the impact of COVID-19 on our business, operations and financial results; other business effects, including the effects of industry, market, economic, political or regulatory conditions; and competitive developments.\n</p><p>\nA further description of risks and uncertainties can be found in Pfizer’s Annual Report on Form 10-K for the fiscal year ended December 31, 2020 and in its subsequent reports on Form 10-Q, including in the sections thereof captioned “Risk Factors” and “Forward-Looking Information and Factors That May Affect Future Results,” as well as in its subsequent reports on Form 8-K, all of which are filed with the U.S. Securities and Exchange Commission and available at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.sec.gov&amp;esheet=52543836&amp;newsitemid=20211202005591&amp;lan=en-US&amp;anchor=www.sec.gov&amp;index=6&amp;md5=f7919105513a85ea06532b59c1cd3ffc\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.sec.gov</a> and <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.pfizer.com&amp;esheet=52543836&amp;newsitemid=20211202005591&amp;lan=en-US&amp;anchor=www.pfizer.com&amp;index=7&amp;md5=2caf4371198cf574ac29a8560b88e266\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.pfizer.com</a>.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211202005591r1&amp;sid=ucdp3&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMjAyMDA1NTkxcjEmc2lkPXVjZHAzJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=b359a3b8dbe789ef7396675af923ad4fb5a13ee59b627f21591914b0e22a449f5a9adb794a61da3d71d9a8b509c6c2fbc7903ee38b59a5d13fbf707ba8464ac9\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211202005591/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211202005591/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52543836&amp;newsitemid=20211202005591&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=8&amp;md5=1da72eb86e80f3f27abff99c9ceac325\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON-WEB-SERVICES</p></div>"}