{"date": "2021-12-10 19:35:17.876000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3483.42, "close": 3391.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon Global Air has signed an agreement with the Port Authority of New York and New Jersey (PANYNJ) to redevelop and expand two current air cargo facilities at Newark Liberty International Airport in the US.</p><p>These structures, namely buildings 339 and 340, will be transformed into an air cargo campus under a 20-year lease period.The cargo airline will spend $125m for the overhaul.This agreement covers nearly 250,000ft2 of cargo space on 23 acres.Subject to final negotiation, the lease will offer the PANYNJ an upfront payment of $150m and another $157m in extra rent during the 20-year agreement.The lease is anticipated to take effect later this year.According to the PANYNJ, the modernisation project will improve the overall Newark Liberty's air cargo throughput and service capabilities.New Jersey Governor Phil Murphy said: \"This investment in Newark Liberty International Airport will create 1,000 jobs and provide significant opportunities for minority-owned and women-owned business enterprises.\"Air cargo is vital to the international supply chain, and with this new partnership, Newark will continue to be a global leader in logistics. This new e-commerce hub will provide needed revenue to the Port Authority while also bringing new jobs to our state.\"This airport's cargo business is being expanded as part of the ongoing airport-wide redevelopment project.A new Terminal A is currently being completed on the south end of the airport.Meanwhile, the Port Authority is also working towards the replacement of the outdated AirTrain Newark.In May 2021, a request for proposal for a design-builder for the AirTrain was released to four pre-selected design and construction teams.Last month, the US Department of Homeland Security agency Transportation Security Administration allowed three airports to enter into security agreements with Amazon Air.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}