{"date": "2022-02-25 16:37:38+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3027.16, "close": 3071.26}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><span>Regional startups can apply for the ‘Startups Go Online’ suite, valid until the end of 2022, by visiting the</span> <span>Amazon Payment Services website</span></p>\n<p><strong>Dubai, United Arab Emirates</strong><strong> </strong>– Amazon Payment Services, a payment service provider operating across MENA, announced today a program that aims to support startups across the Middle East and North Africa (MENA) region who are looking to grow their business online. The ‘Startups Go Online’ suite will offer startups free and discounted services, tools, and resources, to help streamline and accelerate their business expansion in today’s digital economy.</p>\n<p>As part of the ‘Startups Go Online’ suite, Amazon Payment Services is providing free monthly account management support, discounted bank rates, a 50% discount on Amazon Payment Services’ Installments service, a dedicated account manager to fast-track onboarding, and extensive go-to-market guidance including two live training webinars. The program is also extending benefits from Amazon Web Services (AWS) as part of AWS Activate, providing eligible startups that opt into the ‘Startups Go Online’ program with cloud computing tools and resources, including AWS Credits and AWS Support Credits to help them quickly get started on AWS and grow their business.</p>\n<p><strong>Peter George, Managing Director of Amazon Payment Services,</strong> commented: “At Amazon Payment Services, enabling startups across the region is a fundamental part of our mission and culture. This new program is another step in our ongoing commitment to support businesses of all sizes with simple, affordable, and trusted online payment experiences. We are confident that the ‘Startups Go Online’ suite will truly help startups in MENA jump-start and successfully expand their growth online.”</p>\n<p>The new ‘Startups Go Online’ suite was announced at the 2022 STEP Conference, a tech festival in Dubai which brings private and public organizations together with the community of start-ups, investors, and accelerators, to share best practices and discuss digital innovations.</p>\n<p>Driving home the potential that the digital payment space holds for startups and Small to Medium Sized Businesses (SMBs), <strong>Mohamed Imtiyaz, Head of Business Development at Amazon Payment Services,</strong> delivered a keynote speech, on the first day of the STEP Conference, titled “Levelling the Playing Field – Digital Payments Are the Great Equalizer.”</p>\n<p>During his keynote, Mohamed said: “From sending payment links via text messages, to adding a secure payment gateway to a website, digital payments allow merchants to sell their products to customers anytime and anywhere in the world. By partnering with the right payment service provider, startups can expand their market reach, customize payment options based on customer preference, access detailed insights and valuable data, enjoy a straightforward onboarding and integration experience, all while limiting costs and ensuring ROI for their business’ growth online.”</p>\n<p>Mohamed also took part in an interactive workshop held by Scality, an Amazon Payment Services Partner, at STEP conference where he shared best practices with startups, talking through selecting the right payment solutions tailored to audience online buying habits and trends.</p>\n<p>For more information on the ‘Startups Go Online’ program that runs until the end of 2022, and details on how to sign up, please visit the Amazon Payment Services website.</p>\n<p>Amazon Payment Services continues to roll out initiatives supporting the startup and SMB community. Last year, Amazon Payment Services launched the Amazon Fintech Lab at the Dubai International Financial Centre (DIFC), collaborating with DIFC’s community of startups to promote innovation in fintech through networking, mentorship opportunities, workshops, and more.</p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}