{"date": "2021-11-04 02:16:43.806000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company, announced general availability of Amazon Elastic Compute Cloud (Amazon EC2) DL1 instances, a new instance type designed for training machine learning models. DL1 instances are powered by Gaudi accelerators from Habana Labs (an Intel company) to provide up to 40% better price performance for training machine learning models than the latest GPU-powered Amazon EC2 instances. With DL1 instances, customers can train their machine learning models faster and more cost effectively for use cases like natural language processing, object detection and classification, fraud detection, recommendation and personalization engines, intelligent document processing, business forecasting, and more. DL1 instances are available on demand via a low-cost pay-as-you-go usage model with no upfront commitments. To get started with DL1 instances, visit aws.amazon.com/ec2/instance-types/dl1.</p><p>Machine learning has become mainstream as customers have realized tangible business impact from deploying machine learning models at scale in the cloud. To use machine learning in their business applications, customers start by building and training a model to recognize patterns by learning from sample data, and then apply the model on new data to make predictions. For example, a machine learning model trained on large numbers of contact center transcripts can make predictions to provide real-time personalized assistance to customers through a conversational chatbot. To improve a model's prediction accuracy, data scientists and machine learning engineers are building increasingly larger and more complex models. To maintain prediction accuracy and high quality of the models, these engineers need to tune and retrain their models frequently. This requires a considerable amount of high-performance compute resources, resulting in increased infrastructure costs. These costs can be prohibitive for customers to retrain their models at the frequency they need to maintain high-accuracy predictions, while also posing an obstacle to customers that want to begin experimenting with machine learning.</p></div><div class=\"tr-npp-body\"><p>New DL1 instances use Gaudi accelerators built specifically to accelerate machine learning model training by delivering higher compute efficiency at a lower cost compared to general purpose GPUs. DL1 instances feature up to eight Gaudi accelerators, 256 GB of high-bandwidth memory, 768 GB of system memory, 2nd generation Amazon custom Intel Xeon Scalable (Cascade Lake) processors, 400 Gbps of networking throughput, and up to 4 TB of local NVMe storage. Together, these innovations translate to up to 40% better price performance than the latest GPU-powered Amazon EC2 instances for training common machine learning models. Customers can quickly and easily get started with DL1 instances using the included Habana SynapseAI SDK, which is integrated with leading machine learning frameworks (e.g. TensorFlow and PyTorch), helping customers to seamlessly migrate their existing machine learning models currently running on GPU-based or CPU-based instances onto DL1 instances, with minimal code changes. Developers and data scientists can also start with reference models optimized for Gaudi accelerators available in Habana?s GitHub repository, which includes popular models for diverse applications, including image classification, object detection, natural language processing, and recommendation systems.</p><p>?The use of machine learning has skyrocketed. One of the challenges with training machine learning models, however, is that it is computationally intensive and can get expensive as customers refine and retrain their models,? said David Brown, Vice President, of Amazon EC2, at AWS. ?AWS already has the broadest choice of powerful compute for any machine learning project or application. The addition of DL1 instances featuring Gaudi accelerators provides the most cost-effective alternative to GPU-based instances in the cloud to date. Their optimal combination of price and performance makes it possible for customers to reduce the cost to train, train more models, and innovate faster.?</p><p>Customers can launch DL1 instances using AWS Deep Learning AMIs or using Amazon Elastic Kubernetes Service (Amazon EKS) or Amazon Elastic Container Service (Amazon ECS) for containerized applications. For a more managed experience, customers can access DL1 instances through Amazon SageMaker, making it even easier and faster for developers and data scientists to build, train, and deploy machine learning models in the cloud and at the edge. DL1 instances benefit from the AWS Nitro System, a collection of building blocks that offload many of the traditional virtualization functions to dedicated hardware and software to deliver high performance, high availability, and high security while also reducing virtualization overhead. DL1 instances are available for purchase as On-Demand Instances, with Savings Plans, as Reserved Instances, or as Spot Instances. DL1 instances are currently available in the US East (N. Virginia) and US West (Oregon) AWS Regions.</p><p>Seagate Technology has been a global leader offering data storage and management solutions for over 40 years. Seagate?s data science and machine learning engineers have built an advanced deep learning (DL) defect detection system and deployed it globally across the company?s manufacturing facilities. In a recent proof of concept project, Habana Gaudi exceeded the performance targets for training one of the DL semantic segmentation models currently used in Seagate?s production. ?We expect the significant price performance advantage of Amazon EC2 DL1 instances, powered by Habana Gaudi accelerators, could make a compelling future addition to AWS compute clusters,? said Darrell Louder, Senior Engineering Director of Operations, Technology and Advanced Analytics, at Seagate.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}