{"date": "2021-11-18 06:35:59+00:00", "ticker": "AVV", "mrkt_info": {"open": 3361.0, "close": 3411.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>Dubai, United Arab Emirates – AVEVA, a global leader in industrial software, driving digital transformation and sustainability, today announced three add-ons to AVEVA™ E3D Design –  infusing AI capabilities into the industry’s most advanced engineering design software which maximizes efficiency through cloud collaboration. The FTSE 100 company also announced a sustainability enhancement for AVEVA™ Process Simulation – an integrated platform spanning the process engineering lifecycle of design, simulation, training, and operations. </p>\n<p>The latest enhancements of AVEVA E3D Design and AVEVA Process Simulation empower organizations from chemicals, oil and gas, power, marine, and mining, metals and minerals to design sustainable processes and plants at the speed the market demands. The new AVEVA E3D Design add-ons improve engineering quality and efficiency through expedited, streamlined design processes, while AVEVA Process Simulation enables organizations to move beyond linear, wasteful workflows to implement circular, sustainable processes.<strong> </strong></p>\n<p><strong>AVEVA E3D Design</strong></p>\n<p>The first add-on, AVEVA™ E3D Whitespace Optimizer, automatically completes drawings, significantly reducing staff-hours and project design costs. The second add-on, AVEVA™ Model Simplification and AVEVA™ Native Model Simplification, achieves significant reduction in design file size through the simplification of imported CAD models, enhancing software performance so engineers can work more efficiently with ease and accuracy. The final add-on, 3DFindIt, enables customers to directly import vendor-supplied CAD models of mechanical equipment to allow them to quickly and easily design digital twin models.</p>\n<p>Atkins, a member of the SNC-Lavalin Group and one of the world's foremost design, engineering and project management consultancies, leverages AVEVA E3D Design for some of its most prestigious projects. Jim Wright, Design Team Lead at Atkins, commented: “We trialed AVEVA E3D Design. We found that getting drawings out in this way would reduce the delivery time of structural drawings by 40%. That saves a lot of money, especially if you’re looking at massive projects.”</p>\n<p><strong>AVEVA Process Simulation</strong></p>\n<p>The new features of AVEVA Process Simulation put sustainability at the heart of process design. Engineers can now work smarter while designing for a sustainable world. The new renewables library includes the models necessary to design renewable power generation networks for wind turbines, solar panels, electrical distribution, and hydrogen electrolysis. With almost no additional effort, engineers can track greenhouse gas emissions from the earliest design concept using the same workflows they would use to analyze and optimize profitability and efficiency.  </p>\n<p>\"Digital transformation is the key enabler for sustainability, efficiency and agility. AVEVA E3D Design and AVEVA Process Simulation enable organizations to build digital plant designs that will empower the future. With E3D Design, teams can collaborate across disciplines to avoid rework and on-site retrofits,” said Amish Sabharwal, Executive Vice President – Engineering Business Unit at AVEVA.</p>\n<p>“Meanwhile, with AVEVA Process Simulation, organizations can quantify, track, and optimize greenhouse gas emissions from the earliest stages of design to operations. The simulation platform empowers companies to design the sustainable processes of the future and bring new processes to market more quickly by accelerating the process design cycle,” added Sabharwal.</p>\n<p>For more information on the technology, please visit AVEVA E3D Design and AVEVA Process Simulation.<strong> </strong></p>\n<p>-Ends-</p>\n<p><strong>About AVEVA</strong></p>\n<p><span>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence.  AVEVA’s comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries. Learn more at <a href=\"http://www.aveva.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.aveva.com.</a></span></p>\n<p><span>Copyright © 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</span></p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}