{"date": "2022-02-17 13:10:49.309000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3130.21, "close": 3093.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ALITHYA GROUP INC (\"ALYA-TQ\")\n- Bolsters its expertise as a Talend Systems Integrator\n\n     Alithya Group inc. (\"Alithya\") is pleased to announce it is now a\nSystems Integrator of solutions from Talend, a global leader in data\nintegration and data governance. The company's unified Talend Data Fabric\nis one of the only platforms that seamlessly combines an extensive range of\ndata integration and governance capabilities designed to manage the health\nof corporate information.\n\n     Alithya's status as a System Integrator includes ongoing specialized\ntraining for its experts in Talend-based solutions, designed to provide\nsimple, powerful, flexible, and scalable data solutions for enterprises. As\na member of Talend's partner ecosystem, Alithya has earned the distinction\nof becoming a trusted advisor and implementor of the company's efficient\nand cost-effective solutions.\n\n     Talend was named by Gartner as a Leader in the August 2021 Gartner\nMagic Quadrant for Data Integration Tools review, based on an assessment of\neighteen vendors. It was the sixth consecutive time that Talend was\npositioned in the Gartner Leaders quadrant.\n\n     Building on Alithya's foundations Alithya has a strong track record in\nthe implementation of solutions from leading Talend technology partners,\nincluding Microsoft Azure, Snowflake, AWS, and Databricks. Alithya's\ndesignation as a Talend Systems Integrator allows the firm to expand its\nexpertise in both on-premise and cloud-based migrations, including the\ndesign of multi-cloud and hybrid integrations on managed cloud platforms,\nand automated provisioning of cloud data integration and management.\n\n     Quote by Michel Lacasse, Senior Vice President, Sales at Alithya:\n\"Cloud migration services continue to drive digital transformation projects\nacross numerous industries, and our partnership with Talend expands our\nservice offering in that space. As with every technology solution available\nin a competitive market space, certified professionals hold the keys to\nsuccessful implementations. Moving forward, as our experts are trained and\ncertified, Alithya will be able to offer Talend-based solutions to all of\nits sectors of expertise.\"\n\n     Alithya's training initiatives also provide the company with the added\ndistinction and competitive advantage of being the technology firm with the\nmost Talend-certified resources in Quebec. Becoming a System Integrator of\nTalend solutions not only opens the door to future projects in the\nprovince, but also to addressing the needs of existing clients.\n\n     About Alithya Alithya is a North American leader in strategy and\ndigital transformation, employing a dedicated and highly skilled workforce\nof 3,600 professionals in Canada, the United States and internationally.\nAlithya's strategy is based on a plan of accelerated organic growth and\ncomplementary acquisitions to create a global leader. The company's\nintegrated offer is based on four pillars of expertise: business\nstrategies, enterprise cloud solutions, application services, and data and\nanalytics. To learn more about Alithya, visit www.alithya.com.\n\nContact Information:\n\nBenjamin Cerantola, Director of Communications, 514 285-0006 # 6480,\nbenjamin.cerantola@alithya.com\n\nTel   : 514-227-6434    ALITHYA GROUP INC\nEmail : nathalie.forcier@alithya.com\nWWW   : <a href=\"https://www.alithya.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.alithya.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204700123.MNPRE2204700637-04531720220217</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}