{"date": "2022-02-03 08:49:41.448000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3023.87, "close": 2776.91}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p> <br/>   By Siddhi Nayak<br/>NewsRise<br/>   MUMBAI (Feb 3) -- The lenders of India’s Future Retail have proposed an open bid for the debt-laden company’s assets between U.S. online giant Amazon and domestic conglomerate Reliance Industries.<br/><br/>The suggestion was made at a hearing today in the Supreme Court. The apex court was listening to a plea in which Future Retail dragged its own lenders to the court to prevent them from declaring the company as a defaulter. <br/><br/>“Amazon and Reliance, who are cash rich, can bid for Future Retail anything above 170 billion rupees ($2.27 billion) and let them take (over the assets),” Rakesh Dwivedi, the counsel representing the lenders, told the Supreme Court bench presided by Chief Justice N.V. Ramana. “This is sure shot (method by which) we get our money, and who wins (will) get Future Retail. This is the one and only solution.”<br/><br/>The counsel for Future Group, Harish Salve, sought two weeks’ time to discuss the issue with the lenders and agreed to the proposal. Amazon’s counsel Gopal Subramaniam also said the company had “no problem to engage with banks” and that it was “prepared to discuss the matter with lenders.”<br/><br/>The court directed all the respective parties to come to a solution and refused to pass an order on the plea. It adjourned the case, without giving a hearing date.<br/><br/>Some of Future Retail's lenders include State Bank of India, Union Bank of India, Bank of India, Bank of Baroda, Axis Bank and IDBI Bank. The lenders’ consortium had issued default notices to the company after it missed its repayment deadline and classified the account as non-performing assets.<br/><br/>Future alleged that the lenders issued default notices to the group “erroneously,” despite its intent to adhere to the timelines as stated in the framework agreement. The acts of the lenders are “unreasonable, arbitrary and without any justification or reasoning,” and severely hamper its right to carry on trade and business, it had said.<br/><br/>Future Group, which is on the brink of liquidation, has been locked in a long-drawn-out legal dispute with Amazon, which in 2019 picked up a 49% stake in Future Coupons, the group’s gift voucher unit, and owned a 7.3% stake in Future Retail, effectively giving the U.S. e-commerce company a foothold in the retailer. <br/><br/>In 2020, much to the chagrin of Amazon, Future agreed to sell its entire retail, wholesale, warehousing, and logistics businesses to billionaire Mukesh Ambani’s Reliance Industries in a $3.4 billion deal. The dispute started after Amazon sought to block the Reliance deal by getting a freeze order from a Singapore arbitration court, citing alleged violation of contractual agreements. The merged entity will pose formidable competition to the U.S. company’s dominance in India. <br/><br/>Meanwhile, the Supreme Court today reserved an earlier order from the National Company Law Tribunal on allowing Future Retail to proceed with the deal with Reliance.<br/>   - By Siddhi Nayak; siddhi.nayak@newsrise.org; 91-22-61353307<br/>- Edited by Sunil Nair<br/>- Send Feedback to feedback@NewsRise.org<br/>- Copyright (c) 2022 NewsRise Financial Research &amp; Information Services Pvt. Ltd.<br/>    </p></div>"}