{"date": "2021-12-13 07:10:40.843000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"fr\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">Le gouvernement du Canada met en lumière des projets qui aideront à réduire les obstacles à l'emploi pour les Canadiens noirs</p>\n<p>GATINEAU, QC, le 1er févr. 2022</p>\n<p>\n<span>GATINEAU</span> , QC, le 1er févr. 2022 /CNW/ - La diversité fait la force du <span>Canada</span> , et le gouvernement du <span>Canada</span> est déterminé à créer des milieux de travail plus diversifiés et inclusifs où chaque Canadien a une chance juste et égale de réaliser son plein potentiel. Pour souligner le début du <span>Mois de</span> l'histoire des Noirs, le ministre du Travail, l'honorable <span>Seamus O'Regan Jr.</span> , a mis en lumière des projets visant à éliminer les obstacles à l'emploi pour les membres de la communauté noire. Les projets sont financés par le programme de subventions et de contributions Possibilités en milieu de travail : Éliminer les obstacles à l'équité (PMTEOE).</p>\n<p>La Black Business Initiative a reçu du financement pour le projet Removing Barriers to Equity in the Banking Sector, qui vise à augmenter la représentation des Canadiens noirs dans les postes de gestion du secteur bancaire et leur accès à ces postes.</p>\n<p>Pour mieux comprendre les obstacles qui contribuent à la sous-représentation des Canadiens noirs dans les postes de cadres supérieurs du secteur bancaire, la Fédération des Canadiens noirs collaborera avec les employeurs sous réglementation fédérale et d'autres intervenants dans le cadre de son projet <a href=\"https://c212.net/c/link/?t=0&amp;l=fr&amp;o=3430411-1&amp;h=135682753&amp;u=https%3A%2F%2Fsearch.open.canada.ca%2Fen%2Fgc%2Fid%2Fesdc-edsc%2C001-2021-2022-Q2-00694%2Ccurrent&amp;a=Representation+in+Federal+Sectors.+\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Representation in Federal Sectors.</a>\n</p>\n<p>Dans le cadre de son projet Diversity Works: Exploring Supported Employment Experiences of BIPOC Who Experience Disability, l'Association canadienne de soutien à l'emploi en apprendra davantage sur les personnes autochtones, noires et de couleur (PANDC) qui se retrouvent en situation de handicap lorsqu'elles entrent sur le marché du travail et consultent des fournisseurs de services d'emploi.</p>\n<p>Ces projets contribueront à créer une main-d'œuvre plus dynamique et diversifiée, de sorte que tous les Canadiens puissent participer à la relance économique.</p>\n<p>Le 18 janvier 2022, le gouvernement a lancé l' <a href=\"https://c212.net/c/link/?t=0&amp;l=fr&amp;o=3430411-1&amp;h=3564677007&amp;u=https%3A%2F%2Fwww.canada.ca%2Ffr%2Femploi-developpement-social%2Fservices%2Ffinancement%2Fequite-milieu-travail.html&amp;a=appel+de+concepts+ouverts+de+2022\" data-type=\"url\" class=\"tr-link\" translate=\"no\">appel de concepts ouverts de 2022</a> pour le programme PMTEOE. Les organismes canadiens sont invités à soumettre des concepts de projets visant à éliminer des obstacles à l'emploi pour un ou plusieurs des quatre groupes en quête d'équité désignés en vertu de la <span>Loi sur l'équité en matière d'emploi</span> dans les milieux de travail sous réglementation fédérale. L'appel de concepts prend fin le 15 février 2022.</p>\n<p>\n<span>Citations</span>\n</p>\n<p>« La représentation est importante, mais beaucoup de Canadiens noirs sont encore confrontés à des obstacles à l'emploi. En travaillant main dans la main avec les organisations qui ouvrent la voie au changement, nous pouvons rendre les milieux de travail sous réglementation fédérale plus représentatifs, inclusifs et équitables. Au bout du compte, cela contribuera au succès des entreprises. Parce que lorsqu'on inclut tout le monde, tout le monde y gagne. »- Le ministre du Travail, l'honorable <span>Seamus O'Regan Jr.</span>\n</p>\n<p>« Au Canada, la diversité est un fait, mais l'inclusion est un choix. Au cours du mois, pendant que nous célébrons les réalisations remarquables des personnes et communautés noires au <span>Canada</span> , force est de constater que le racisme systémique à l'endroit des personnes noires continue de créer des obstacles à l'emploi pour les Canadiens et Canadiennes d'ascendance africaine. Ces projets contribueront à lever ces obstacles et à rendre les milieux de travail plus diversifiés et plus inclusifs partout au pays. »- Le ministre du Logement et de la Diversité et de l'Inclusion, l'honorable <span>Ahmed Hussen</span>\n</p>\n<p>« Nous sommes très heureux de mener cet important projet. Les dirigeants du secteur bancaire peuvent apporter énormément d'expertise et d'expérience. Plus il y a de personnes qui prennent part à ces discussions, plus nous serons en mesure de comprendre les défis et les solutions potentielles. En ce moment, une excellente occasion s'offre à nous de poursuivre sur notre lancée et d'apporter des changements durables. »- <span>Rustum Southwell</span> , Ph. D., chef de la direction, Black Business Initiative</p>\n<p>« Les Canadiens noirs continuent de jouer un rôle important dans divers secteurs au <span>Canada</span> , bien qu'ils doivent encore surmonter des obstacles évidents. Notre organisme national sans but lucratif s'efforce d'éradiquer le racisme envers les Noirs et de promouvoir les possibilités pour les Canadiens noirs. Nous sommes heureux d'intensifier nos efforts pour éliminer les obstacles à l'emploi grâce à cette subvention. Nous travaillerons avec nos partenaires de la Banque Royale du <span>Canada</span> et de l'Université de <span>Toronto</span> pour engager les employeurs du secteur bancaire à examiner les possibilités d'éliminer les obstacles qui persistent encore aujourd'hui. »- Christopher Thompson, directeur général, Fédération des Canadiens noirs</p>\n<p>« Nous reconnaissons que les obstacles que rencontrent les gens lorsqu'ils cherchent un emploi peuvent être liés à leur identité. En comprenant mieux leur expérience, nous espérons mieux soutenir les membres de la communauté des PANDC qui se retrouvent en situation de handicap lorsqu'ils cherchent à obtenir ou conserver un emploi compétitif. La main-d'œuvre canadienne doit pouvoir compter sur la contribution de l'ensemble de la population diversifiée de notre pays. »- <span>Joanna Goode</span> , directrice générale, Association canadienne de soutien à l'emploi</p>\n<p>\n<span>Produit connexe</span>\n</p>\n<p>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=fr&amp;o=3430411-1&amp;h=1569821107&amp;u=https%3A%2F%2Fwww.canada.ca%2Ffr%2Femploi-developpement-social%2Fnouvelles%2F2022%2F01%2Fdocument-dinformation-projets-finances-dans-le-cadre-de-lappel-de-propositions-sollicite-de-2021-visant-a-reduire-les-obstacles-a-lemploi-dans-les-.html&amp;a=Document+d%27information%C2%A0%3A+Projets+financ%C3%A9s+dans+le+cadre+de+l%27appel+de+propositions+sollicit%C3%A9+de+2021+visant+%C3%A0+r%C3%A9duire+les+obstacles+%C3%A0+l%27emploi+dans+les+milieux+de+travail+sous+r%C3%A9glementation+f%C3%A9d%C3%A9rale\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Document d'information : Projets financés dans le cadre de l'appel de propositions sollicité de 2021 visant à réduire les obstacles à l'emploi dans les milieux de travail sous réglementation fédérale</a>\n</p>\n<p>\n<span>Liens connexes</span>\n</p>\n<ul class=\"bulleted-list arrowlist\">\n<li>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=fr&amp;o=3430411-1&amp;h=520934685&amp;u=https%3A%2F%2Fwww.canada.ca%2Ffr%2Fpatrimoine-canadien%2Fcampagnes%2Fmois-histoire-des-noirs.html&amp;a=Le+Mois+de+l%27histoire+des+Noirs\">\n<span>Le Mois de</span> l'histoire des Noirs</a>\n</li>\n<li>Communiqué - <a href=\"https://c212.net/c/link/?t=0&amp;l=fr&amp;o=3430411-1&amp;h=3627742933&amp;u=https%3A%2F%2Fwww.canada.ca%2Ffr%2Femploi-developpement-social%2Fnouvelles%2F2022%2F01%2Fmilieux-de-travail-sous-reglementation-federale-le-gouvernement-du-canada-lance-un-appel-de-concept-pour-aider-a-eliminer-les-obstacles-a-lemploi.html&amp;a=Milieux+de+travail+sous+r%C3%A9glementation+f%C3%A9d%C3%A9rale+%3A+Le+gouvernement+du+Canada+lance+un+appel+de+concept+pour+aider+%C3%A0+%C3%A9liminer+les+obstacles+%C3%A0+l%27emploi\">Milieux de travail sous réglementation fédérale : Le gouvernement du <span>Canada</span> lance un appel de concept pour aider à éliminer les obstacles à l'emploi</a>\n</li>\n<li>\n<span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=fr&amp;o=3430411-1&amp;h=3912510614&amp;u=https%3A%2F%2Fwww.bbi.ca%2F&amp;a=Black+Business+Initiative\">\n<span>Black Business Initiative</span>\n</a>\n</span> (en anglais seulement)</li>\n<li>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=fr&amp;o=3430411-1&amp;h=4272522176&amp;u=https%3A%2F%2Fsupportedemployment.ca%2Ffr%2F&amp;a=Association+canadienne+de+soutien+%C3%A0+l%27emploi\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Association canadienne de soutien à l'emploi</a>\n</li>\n<li>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=fr&amp;o=3430411-1&amp;h=1056368711&amp;u=https%3A%2F%2Ffbcfcn.ca%2Ffr&amp;a=F%C3%A9d%C3%A9ration+des+Canadiens+noirs\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Fédération des Canadiens noirs</a>\n</li>\n<li>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=fr&amp;o=3430411-1&amp;h=3184477616&amp;u=https%3A%2F%2Fwww.canada.ca%2Ffr%2Femploi-developpement-social%2Fministere%2Fportefeuille%2Ftravail%2Fprogrammes%2Fequite-emploi.html&amp;a=%C3%89quit%C3%A9+en+mati%C3%A8re+d%27emploi+dans+les+lieux+de+travail+sous+r%C3%A9glementation+f%C3%A9d%C3%A9rale\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Équité en matière d'emploi dans les lieux de travail sous réglementation fédérale</a>\n</li>\n</ul>\n<p>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=fr&amp;o=3430411-1&amp;h=1049541201&amp;u=https%3A%2F%2Ftwitter.com%2FEDSC_GC&amp;a=Suivez-nous+sur+Twitter\">\n<span>Suivez-nous sur Twitter</span>\n</a>\n</p>\n<p>\n<span>\n</span></p>\n<p>SOURCE Emploi et Développement social <span>Canada</span>\n</p>\n<p>Consulter le contenu original : <a href=\"http://www.newswire.ca/fr/releases/archive/February2022/01/c9098.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/fr/releases/archive/February2022/01/c9098.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}