{"date": "2022-01-26 15:36:41.005000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NASDAQ INC (\"NDAQ-Q\")\n- Fourth Quarter and Full Year 2021 Results; Delivers Strong Growth\n- in Revenue and EPS\n\n     Nasdaq, Inc. reported financial results for the fourth quarter of 2021\nand full year 2021.\n\n     *  2021 net revenues1 were $3,420 million, an increase of 18% over\n2020. Solutions segments2 revenues increased 21% while Market Services\nincreased 13%.\n     *  Net revenues increased 12% compared to the fourth quarter of 2020.\nSolutions segments revenues increased 19%, including 12% organic growth and\n7% contribution from the acquisition of Verafin.\n     *  Annualized Recurring Revenue (ARR)3 increased 19% compared to the\nfourth quarter of 2020, and excluding Verafin, increased 9%. Annualized\nSaaS revenues increased 43% and represented 34% of ARR.\n     *  GAAP diluted earnings per share increased 26% in 2021 and 14% in\nthe fourth quarter 2021.\n     *  Non-GAAP4 diluted earnings per share increased 22% in 2021 and 21%\nin the fourth quarter 2021.\n     *  The company returned $1,293 million of cash to shareholders in\n2021, including $943 million in share repurchases and $350 million in\ndividends.\n\n     Fourth Quarter 2021 Highlights\n\n//st\n\n  (US$ millions, except    4Q21     % Change (YoY)   2021     % Change\n(YoY)\n  per share)\n\n  Solutions Segments       $581     19%              $2,152   21%\n  Revenues\n\n  Market Services Net      $303     5%               $1,241   13%\n  Revenues\n\n  Net Revenues             $885     12%              $3,420   18%\n\n  ARR                      $1,871   19%\n\n  GAAP Diluted EPS         $1.53    14%              $7.05    26%\n\n  Non-GAAP Diluted EPS     $1.93    21%              $7.56    22%\n\n//et\n\n     Adena Friedman, President and CEO said, \"Our record performance in\n2021 is another important milestone in Nasdaq's journey as a technology\nbusiness serving the financial system. We grew across all segments of our\nbusiness last year with a focus on competitive positioning, innovation in\nour trading and listing businesses, and the continued expansion of our\nsoftware, analytics, data and cloud services. We have entered 2022 in a\nposition of strength across all of our businesses, primed to capture\nsecular growth opportunities as we continue to play our part in increasing\ninvestor participation, optimizing capital formation, and driving\nefficiency and resiliency in the global financial system.\"\n\n     Ann Dennison, Executive Vice President and CFO said, \"Nasdaq's strong\nquarterly and full year results underscore our focus on executing and\ncompeting in vibrant markets and a clear eyed focus on driving a more\ndiversified revenue profile. During the year, we delivered record\nprofitability underpinned by a 19% increase in ARR and 43% increase in\nannualized SaaS revenues. Combined, this provides us with sustainable\nrunway to continue to deliver attractive returns to shareholders while\ninvesting in long-term growth opportunities across our enterprise.\"\n\n     FINANCIAL REVIEW\n\n     *  2021 net revenues were $3,420 million, an increase of $517 million,\nor 18% over 2020. Net revenues reflected a $395 million, or 14%, positive\nimpact from organic growth, a $93 million increase from the net impact of\nacquisitions and divestitures, and a $29 million increase from the impact\nof changes in FX rates.\n\n     *  Fourth quarter 2021 net revenues were $885 million, an increase of\n$97 million, or 12%, from $788 million in the prior year period. Net\nrevenues reflected a $78 million, or 10%, positive impact from organic\ngrowth and a $26 million increase from the net impact of acquisitions and\ndivestitures, partially offset by a $7 million decrease from the impact of\nchanges in FX rates.\n\n     *  Solutions segments revenues were $581 million in the fourth quarter\nof 2021, an increase of $91 million, or 19%. The increase reflects a $61\nmillion, or 12%, positive impact from organic growth and a $35 million, or\n7%, increase from the inclusion of revenues from the acquisition of\nVerafin, partially offset by a $5 million decrease from the impact of\nchanges in FX rates.\n\n     *  Market Services net revenues were $303 million in the fourth\nquarter of 2021, an increase of $15 million, or 5%. The increase reflects a\n$17 million, or 6%, positive impact from organic growth, partially offset\nby a $2 million decrease from the impact of changes in FX rates.\n\n     *  Fourth quarter 2021 GAAP operating expenses increased 15% versus\nthe prior year period. The increase primarily reflects higher compensation\nand benefits expense, regulatory expense, depreciation and amortization\nexpense, partially offset by lower general, administrative and other\nexpense and restructuring charges.\n\n     *  Fourth quarter 2021 non-GAAP operating expenses increased 7% versus\nthe prior year period. The increase reflects a $6 million, or 1%, organic\nincrease over the prior year period, a $24 million, or 6%, increase from\nthe net impact of acquisitions and divestitures, partially offset by a $2\nmillion decrease from changes in FX rates. The organic increase primarily\nreflects higher compensation and benefit expense, marketing and advertising\nexpense and computer operations and data communication expense, partially\noffset by lower general, administrative and other expense.\n\n     *  The company repurchased $58 million in shares of its common stock\nfourth quarter of 2021 and repurchased an aggregate of $943 million in\n2021, including the impact of the $475 million accelerated share repurchase\n(ASR) agreement executed in the second half of 2021. The company\nrepurchased $142 million in shares in January 2022, and plans to enter into\nan ASR agreement to repurchase an additional $325 million of shares, which\nis expected to be completed in the first quarter of 2022. As of January 25,\n2022, there was $784 million remaining under the board authorized share\nrepurchase program.\n\n     2022 EXPENSE AND TAX GUIDANCE5\n\n     The company is initiating its 2022 non-GAAP operating expense guidance\nto a range of $1,680 to $1,760 million. Nasdaq expects its 2022 non-GAAP\ntax rate to be in the range of 24.0% to 26.0%.\n\n     STRATEGIC AND BUSINESS UPDATES\n\n     *  Nasdaq and AWS partner to transform capital markets through\nbenefits of a cloud-enabled infrastructure. Nasdaq and Amazon Web Services,\nInc. (AWS) announced a multi-year partnership to build the next generation\nof cloud-enabled infrastructure for the world's capital markets. Nasdaq\nwill use a new edge computing solution that is co-designed by Nasdaq and\nAWS specifically for market structure. Beginning in 2022, Nasdaq plans to\nmigrate its North American markets to AWS in a phased approach, starting\nwith Nasdaq MRX, a U.S. options market.\n\n     *  Nasdaq's annualized SaaS revenues in the fourth quarter of 2021\nincreased 43% year over year. Annualized SaaS revenues totaled $640 million\nin the fourth quarter of 2021, representing 34% of total company ARR, up\nfrom 28% in the fourth quarter of 2020. The 43% year over year increase in\nannualized SaaS revenues primarily reflects the inclusion of Verafin and\nstrong growth in our surveillance and analytics businesses.\n\n     *  The Analytics offerings of eVestment and Solovis delivered a 41%\nincrease in new sales in 2021 versus the prior year while the gross\nretention improved one percentage point. Our combined Analytics offerings\nincluding eVestment and Solovis saw continued strong user adoption across\nboth asset owners and asset managers with combined new sales of $26 million\nin 2021, an increase of 41% versus 2020. There were 61 ETPs tracking Nasdaq\nindexes launched in 2021 with nearly $3 billion of AUM accumulated during\nthe year, including the PHLX Semiconductor Index, and Hashdex products\nlinked to the Nasdaq Crypto Index. In the fourth quarter of 2021, Nasdaq\nlaunched Data Fabric, a managed data solution built off Nasdaq Data Link to\nhelp investment management firms scale their data infrastructure with\nenhanced quality, governance and integrity.\n\n     *  The Nasdaq Stock Market led U.S. exchanges for IPOs during 2021 and\nfeatured nine of the ten largest U.S.-based IPOs by capital raised. The\nNasdaq Stock Market led U.S. exchanges in 2021 with a 73% total win rate,\nreflecting a 76% win rate among operating companies6 and a 71% win rate\namong SPACs. The Nasdaq Stock Market welcomed 1,000 new company listings in\n2021, including 752 IPOs representing $181 billion in capital raised, while\nNasdaq's European exchanges welcomed 207 new listings. New listings in 2021\nincluded the IPOs of Rivian, the largest by capital raised, and\nGlobalFoundries as well as 33 listing switches including Honeywell, Palo\nAlto Networks and Baker Hughes.\n\n       *  For the second consecutive year, Nasdaq led all exchanges in\ntotal traded U.S. options, inclusive of multiply-list equity options and\nindex options products, while equity value traded on the Nasdaq Nordic\nmarkets reached their highest level since 2008. Nasdaq's U.S. options\nmarket average daily number of contracts set a new annual record and\ntotaled 12.8 million in 2021, an increase of 25% year over year. The\naverage daily trading value of Nasdaq's Nordic and Baltic main markets\nreached $4.7 billion, an increase of 10% year over year, and the highest\nsince 2008.\n\n1 Represents revenues less transaction-based expenses.\n2 Constitutes revenues from Market Technology, Investment Intelligence and\nCorporate Platforms segments.\n3 Annualized Recurring Revenue (ARR) for a given period is the annualized\nrevenue derived from subscription contracts with a defined contract value.\nThis excludes contracts that are not recurring, are one-time in nature or\nwhere the contract value fluctuates based on defined metrics. ARR is\ncurrently one of our key performance metrics to assess the health and\ntrajectory of our recurring business. ARR does not have any standardized\ndefinition and is therefore unlikely to be comparable to similarly titled\nmeasures presented by other companies. ARR should be viewed independently\nof revenue and deferred revenue and is not intended to be combined with or\nto replace either of those items. ARR is not a forecast and the active\ncontracts at the end of a reporting period used in calculating ARR may or\nmay not be extended or renewed by our customers.\n4 Refer to our reconciliations of U.S. GAAP to non-GAAP net income, diluted\nearnings per share, operating income and operating expenses, included in\nthe attached schedules.\n5 U.S. GAAP operating expense and tax rate guidance are not provided due to\nthe inherent difficulty in quantifying certain amounts due to a variety of\nfactors including the unpredictability in the movement in foreign currency\nrates, as well as future charges or reversals outside of the normal course\nof business.\n6 Operating companies exclude special purpose acquisition companies and\nwhen a special purpose acquisition company completes an acquisition.\n\n     ABOUT NASDAQ\n\n     Nasdaq (Nasdaq: NDAQ) is a global technology company serving the\ncapital markets and other industries. Our diverse offering of data,\nanalytics, software and services enables clients to optimize and execute\ntheir business vision with confidence. To learn more about the company,\ntechnology solutions and career opportunities, visit us on LinkedIn, on\nTwitter @Nasdaq, or at www.nasdaq.com.\n\n     NON-GAAP INFORMATION\n\n     In addition to disclosing results determined in accordance with U.S.\nGAAP, Nasdaq also discloses certain non-GAAP results of operations,\nincluding, but not limited to, non-GAAP net income attributable to Nasdaq,\nnon-GAAP diluted earnings per share, non-GAAP operating income, and\nnon-GAAP operating expenses, that include certain adjustments or exclude\ncertain charges and gains that are described in the reconciliation table of\nU.S. GAAP to non-GAAP information provided at the end of this release.\nManagement uses this non-GAAP information internally, along with U.S. GAAP\ninformation, in evaluating our performance and in making financial and\noperational decisions. We believe our presentation of these measures\nprovides investors with greater transparency and supplemental data relating\nto our financial condition and results of operations. In addition, we\nbelieve the presentation of these measures is useful to investors for\nperiod-to-period comparisons of results as the items described below in the\nreconciliation tables do not reflect ongoing operating performance.\n\n     These measures are not in accordance with, or an alternative to, U.S.\nGAAP, and may be different from non-GAAP measures used by other companies.\nIn addition, other companies, including companies in our industry, may\ncalculate such measures differently, which reduces its usefulness as a\ncomparative measure. Investors should not rely on any single financial\nmeasure when evaluating our business. This information should be considered\nas supplemental in nature and is not meant as a substitute for our\noperating results in accordance with U.S. GAAP. We recommend investors\nreview the U.S. GAAP financial measures included in this earnings release.\nWhen viewed in conjunction with our U.S. GAAP results and the accompanying\nreconciliations, we believe these non-GAAP measures provide greater\ntransparency and a more complete understanding of factors affecting our\nbusiness than U.S. GAAP measures alone.\n\n     We understand that analysts and investors regularly rely on non-GAAP\nfinancial measures, such as those noted above, to assess operating\nperformance. We use these measures because they highlight trends more\nclearly in our business that may not otherwise be apparent when relying\nsolely on U.S. GAAP financial measures, since these measures eliminate from\nour results specific financial items that have less bearing on our ongoing\noperating performance.\n\n     Organic revenue growth, organic change and organic impact are non-GAAP\nmeasures that reflect adjustments for: (i) the impact of period-over-period\nchanges in foreign currency exchange rates, and (ii) the revenues, expenses\nand operating income associated with acquisitions and divestitures for the\ntwelve month period following the date of the acquisition or divestiture.\nReconciliations of these measures are described within the body of this\nrelease.\n\n     Foreign exchange impact: In countries with currencies other than the\nU.S. dollar, revenues and expenses are translated using monthly average\nexchange rates. Certain discussions in this release isolate the impact of\nyear-over-year foreign currency fluctuations to better measure the\ncomparability of operating results between periods. Operating results\nexcluding the impact of foreign currency fluctuations are calculated by\ntranslating the current period's results by the prior period's exchange\nrates.\n\n     CAUTIONARY NOTE REGARDING FORWARD-LOOKING STATEMENTS\n\nInformation set forth in this communication contains forward-looking\nstatements that involve a number of risks and uncertainties. Nasdaq\ncautions readers that any forward-looking information is not a guarantee of\nfuture performance and that actual results could differ materially from\nthose contained in the forward-looking information. Such forward-looking\nstatements include, but are not limited to (i) projections relating to our\nfuture financial results, total shareholder returns, growth, trading\nvolumes, products and services, ability to transition to new business\nmodels, taxes and achievement of synergy targets, (ii) statements about the\nclosing or implementation dates and benefits of certain acquisitions,\ndivestitures and other strategic, restructuring, technology, de-leveraging\nand capital allocation initiatives, (iii) statements about our integrations\nof our recent acquisitions, (iv) statements relating to any litigation or\nregulatory or government investigation or action to which we are or could\nbecome a party, and (v) other statements that are not historical facts.\nForward-looking statements involve a number of risks, uncertainties or\nother factors beyond Nasdaq's control. These factors include, but are not\nlimited to, Nasdaq's ability to implement its strategic initiatives,\neconomic, political and market conditions and fluctuations, government and\nindustry regulation, interest rate risk, U.S. and global competition, the\nimpact of the COVID-19 pandemic on our business, operations, results of\noperations, financial condition, workforce or the operations or decisions\nof our customers, suppliers or business partners, and other factors\ndetailed in Nasdaq's filings with the U.S. Securities and Exchange\nCommission, including its annual reports on Form 10-K and quarterly reports\non Form 10-Q which are available on Nasdaq's investor relations website at\n<a href=\"http://ir.nasdaq.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://ir.nasdaq.com</a> and the SEC's website at www.sec.gov. Nasdaq\nundertakes no obligation to publicly update any forward-looking statement,\nwhether as a result of new information, future events or otherwise.\n\n     WEBSITE DISCLOSURE\n\n     Nasdaq intends to use its website, ir.nasdaq.com, as a means for\ndisclosing material non-public information and for complying with SEC\nRegulation FD and other disclosure obligations.\n\n//st\n\n           Media Relations Contact       Investor Relations Contact\n\n           Will Briganti                 Ed Ditmire, CFA\n\n           +1.646.964.8169               +1.212.401.8737\n\n           william.briganti@nasdaq.com   ed.ditmire@nasdaq.com\n\n//et\n\nTel   : 212-401-8700    NASDAQ INC\nEmail : investor.relations@nasdaq.com\nWWW   : <a href=\"http://www.nasdaq.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.nasdaq.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2202500413.MNPRE2202501806-07245620220126</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}