{"date": "2022-02-20 10:20:16+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3052.03, "close": 2896.54}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Shilpa Jamkhandikar</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">MUMBAI, Feb 20 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon's rivalry in India with oil-to-retail conglomerate Reliance Industries looks set to head to the cricket field, where they will likely battle media heavyweights for telecast rights to India's premier cricket league with its hundreds of millions of viewers. </p><p>Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and Reliance Industries Ltd <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RELI.NS\" data-type=\"ric\" data-ric=\"RELI.NS\" translate=\"no\" dir=\"ltr\">RELI.NS</a> are expected to take on India units of Sony Group Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=6758.T\" data-type=\"ric\" data-ric=\"6758.T\" translate=\"no\" dir=\"ltr\">6758.T</a> and Walt Disney Co <a href=\"reuters://REALTIME/Verb=FullQuote/ric=DIS.N\" data-type=\"ric\" data-ric=\"DIS.N\" translate=\"no\" dir=\"ltr\">DIS.N</a> for exclusive five-year TV and digital broadcast rights to the two-month series of matches, at a cost that could run to a record 500 billion rupees ($6.7 billion), sources familiar with the companies' plans said.</p><p>\"Cricket is the second-biggest sport in the world with two-and-a-half billion fans and IPL is like its Super Bowl,\" said Anton Rublievskyi, head of Parimatch, a betting company that advertised at the Indian Premier League (IPL) last year.</p><p>\"If you're not there, you do not exist.\"</p><p>Disney-owned Star India, which is one of the top broadcasters in India along with Sony and its planned acquisition Zee Entertainment Enterprises Ltd <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ZEE.NS\" data-type=\"ric\" data-ric=\"ZEE.NS\" translate=\"no\" dir=\"ltr\">ZEE.NS</a>, paid 163.48 billion rupees for the digital and television rights until 2022. The league's matches reached 350 million viewers during the first half of the 2021 season alone.</p><p>But traditional media firms now face stiff competition from deep-pocketed rivals like Reliance, India's biggest retailer, and Amazon, two billionaire-led behemoths competing for the fast-growing e-commerce market while building up their digital platforms. <a href=\"reuters://REALTIME/verb=Headlines/ric=L4N2IB3MD\" data-type=\"newsExpression\" data-expression=\"L4N2IB3MD\" translate=\"no\" dir=\"ltr\">L4N2IB3MD</a></p><p>Amazon and Reliance are already locked in a pitched courtroom battle over the acquisiton of assets of Future Group, another big India retailer. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2TR0JF\" data-type=\"storyId\" data-story-id=\"nL1N2TR0JF\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>    Reliance is also in talks with investors, including foreigners, to raise up to $1.6 billion for its broadcasting joint venture, Viacom18. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2U73OE\" data-type=\"storyId\" data-story-id=\"nL4N2U73OE\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>\"Winning this bid is critical to Reliance's long-term plans for its Jio platform and its digital expansion,\" said a source with direct knowledge of the company's strategy.</p><p>\"Everything that has happened at Viacom18 in the last few months, like buying rights to the Spanish La Liga and setting up a sports channel, has been building up to this,\" the source said.</p><p>Reliance and Viacom18 did not respond to requests for comment.</p><p>Amazon, whose Prime Video platform recently began live-streaming cricket matches, wants to win the IPL rights to expand the platform's user base, another industry source familiar with the company's thinking said.</p><p>An Amazon India spokesperson did not respond to a request for comment.</p><p>The company lacks a TV platform and would need to bring in a TV partner or could only bid for the digital portion. The Board of Control for Cricket in India (BCCI), which runs the tender, awarded it in 2017 to a consolidated TV and digital bid from Star, which surpassed any of the combined individual bids.</p><p>Industry sources expect flexibility from the BCCI given the prospects for record payments by bidders including a deep-pocketed digital-only player like Amazon.</p><p>BCCI secretary Jay Shah, in an interview with Reuters, said the board had studied various models and proposals but he did not comment on details or the likely dollar value of the bids. </p><p>\"We will do our best to derive the right value a tournament like the IPL deserves,\" he said. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2UU082\" data-type=\"storyId\" data-story-id=\"nL4N2UU082\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Among the media majors, Disney India did not respond to a request for comment but Disney CEO Bob Chapek told a recent earnings teleconference that the company was confident of achieving its subscriber targets in India even without IPL rights.</p><p>Sony's India entertainment unit said it would evaluate bids for both broadcast and digital rights.</p><p>Some in the industry however, are questioning the sharp rise in the cost of the rights and whether it is sustainable.</p><p>\"The IPL has got to a stage where it's now too big to fail and therefore everyone who is part of the ecosystem is propping it up,\" said advertising industry veteran Meenakshi Menon.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Shilpa Jamkhandikar in Mumbai; Additional reporting by Amlan Chakraborty in New Delhi and Sudipto Ganguly in Mumbai; Editing by Euan Rocha and Edmund Klamann)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:shilpa.jamkhandikar@thomsonreuters.com\" data-type=\"email\" translate=\"no\">shilpa.jamkhandikar@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: CRICKET-INDIA/RIGHTS (PIX)</p></div>"}