{"date": "2021-12-08 06:20:01.546000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Minsait, an Indra company, announced that it has joined the AWS ISV Accelerate and AWS Solution Provider programs of Amazon Web Services (AWS) to speed up the sale of AWS cloud services and create new businesses to drive the digital transformations of companies and institutions.</p><p>The AWS ISV Accelerate program facilitates co-selling to AWS partners providing software solutions that are run on or integrated with AWS. By joining it, Minsait will receive support for this co-selling and benefits to connect with the AWS global sales team, which serves millions of active customers. Co-selling ensures better results for customers and guarantees the joint commitment by AWS and its partners.</p></div><div class=\"tr-npp-body\"><p>Minsait will thus be able to gain priority access to its support and its resources focused on shared sales and offer its products marketed under the Onesait brand in AWS Marketplace, a digital software catalog with AWS-based ISVs that makes it easier for customers to search for, implement and manage software that runs on AWS.</p><p>Minsait now also forms part of the AWS Solution Provider program. As a member of this program, Minsait will offer next-generation system integration, software development and consulting services in the AWS cloud.</p><p>The AWS Solution Provider program is designed to help member companies expand the capabilities of their cloud solutions and services through sales, technical support and the support of alliances. In addition, the members establish relationships with other members of the AWS ecosystem, thus creating a community that benefits the cloud?s end customers.</p><p>Success stories</p><p>The close collaboration between Minsait and AWS over the last four years has been reflected in the development of important strategic projects for the transition to the cloud with a measurable impact on their customers' business growth and enhanced services for citizens, as well as improvements in the time to market and the efficiency of the companies? processes.</p><p>The benefits obtained include reductions of between 15% and 50% in the operating and maintenance costs of technological services massively migrated to the cloud in various Utilities and Telco projects and increases of over 50% in the figures resulting from the calculations of the power supply quality indexes.</p><p>Another outstanding success story is the significant reduction in the response time of the content suggestion engine for viewers of an Internet TV platform. Thanks to the project developed by Minsait on AWS, the platform is able to offer tips on programs, series and movies in less than 200 milliseconds (thousandths of a second).</p><p>Moreover, Minsait is deploying its telecontrol solutions at their ?phygital? area on AWS, enabling it to reduce the initial investment costs by up to 50% and the infrastructure upgrade costs by the same percentage as a result of the Cloud services. Also worth highlighting is the project to implement its commercial and asset management solutions (Onesait Customers and Onesait Grid) currently being executed for EWA, the Bahrain Electricity and Water Company, on AWS.</p><p>?The incorporation of Minsait into the AWS ISV Accelerate and AWS Solution Provider programs constitutes a significant boost for the sales of our solutions and our contribution to the digital transformations of companies and institutions with services that help them to scale and grow at the pace that?s currently in demand. On the one hand, it means Minsait?s products can form part of the AWS reference product community. On the other, it gives us the autonomy to sell AWS services as part of a distinctive solution?, declared Carlos Beldarrain, Head of Data Cloud at Minsait.</p><p>Minsait, an Indra company, has a unique proposal in the Cloud-Data field to assist companies and organizations in their transition to cloud services, from the transformation of core systems, with proprietary methodologies developed from experience, to the creation of digital native assets and processes based on knowledge of the data, always maintaining its commitment to generating impact.</p><p>To do this, it relies on a strong end-to-end technological solution based on collaboration with the main cloud providers and a network of more than 5,000 professionals who specialize in the most relevant technologies.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}