{"date": "2022-01-05 17:15:54+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3350.44, "close": 3265.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The opinions expressed here are those of the author, a columnist for Reuters.</p><p class=\"tr-by\">By Jamie McGeever</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">ORLANDO, Fla., Jan 5 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Apple's $3 trillion market cap landmark underscores the influence Big Tech <span class=\"tr-strong\">holds </span>over U.S. stock indices - but also the vulnerability of passive investors to any lurch lower of the leading lights of the sector.</p><p>Apple's and a handful of other U.S.-based tech giants' market cap and earnings power is so great it is difficult to imagine a, say 10%-15%, correction in mega-tech not exerting a significant drag on the S&amp;P 500, and hard to see the index rising 10%-15% without these top stocks leading the charge.</p><p>Some of the numbers are startling. </p><p>At $3 trillion, Apple's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a> market cap has more than tripled from the March 2020 low. Tesla <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TSLA.O\" data-type=\"ric\" data-ric=\"TSLA.O\" translate=\"no\" dir=\"ltr\">TSLA.O</a> has soared more than 1,600% in that time. The top five firms are all one-trillion dollar companies with a combined market cap of over $10 trillion - almost a quarter of the S&amp;P 500 index's entire market cap of $42.9 trillion. </p><p>The top five companies in the S&amp;P 500 last year were all tech firms, and accounted for around 30% of the index's total returns. Before the pandemic two years ago, the top five stocks accounted for around a fifth of the index's overall market cap and total returns in 2019.</p><p>As the following chart from Todd Sohn at Strategas Securities in New York shows, concentration at the top is approaching the historic levels of late 2020. </p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"g1edb84a6-d103-4312-93eb-0e3e1bda19ec\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://fingfx.thomsonreuters.com/gfx/mkt/xmvjobledpr/TOP5SP.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9maW5nZngudGhvbXNvbnJldXRlcnMuY29tL2dmeC9ta3QveG12am9ibGVkcHIvVE9QNVNQLnBuZw==&amp;storyId=urn:newsml:reuters.com:20220105:nL8N2TK45A:7&amp;key=deb0b974e6721372bf0cca11b58353f67f036e41202bb307ed1b14434ee7a6faca5f11645687f49bc0379ae31e003d5f271f9101c12bd4fe7d20ec44ba4a013a\"/></div></div></div></p><p><br/></p><p>The narrowing at the top is even more extreme. Sohn reckons there has never been a time when the top two individual weights each account for more than 6% of the index. Right now, Apple is almost 7% and Microsoft <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MSFT.O\" data-type=\"ric\" data-ric=\"MSFT.O\" translate=\"no\" dir=\"ltr\">MSFT.O</a> is almost 6%.</p><p>\"Pretty wild,\" is how Sohn puts it.</p><p>Matt Orton at Carillon Tower Advisers calculates that based on S&amp;P 500 weightings as of Dec. 31, a 10% move in Apple, Microsoft, Alphabet <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a>, Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, and Tesla would collectively add or detract 2.3% from the overall index. For context, it would take a 10% move in the next 27 largest companies to offset that.</p><p>\"Being tactical will matter this year. While I'm optimistic for the group, there will be better entry points to mega tech,\" Orton reckons. </p><p>The remarkable degree of concentration has not come from nowhere. Big tech just sailed through the biggest (although shortest-lived) recession in decades, its green credentials are attracting large and growing ESG-related inflows, the companies are well-run, diversified, with little or no debt, and are cash rich.</p><p>Why wouldn't you want a slice of that? </p><p>\"It is far less risky to own a small number of companies that you know extremely well, and in which you can be confident in their future earnings potential, than it is to own 500 companies you know nothing about,\" notes Guy Davis at GCI Investors. </p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"bfe7c815-3b5a-4c10-990c-732dfc6692cd\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://fingfx.thomsonreuters.com/gfx/mkt/gkvlgbxanpb/TECHSNP.jpg\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9maW5nZngudGhvbXNvbnJldXRlcnMuY29tL2dmeC9ta3QvZ2t2bGdieGFucGIvVEVDSFNOUC5qcGc=&amp;storyId=urn:newsml:reuters.com:20220105:nL8N2TK45A:7&amp;key=859a2cdcc3e76de4968a7b487765503e750357d4d63a290c35c1a0f54faee9a167b8d8f09846de56afb27f52ae762f96fccbdfe49bf6f7b759674768216dcba1\"/></div></div></div></p><p><br/></p><p><br/></p><p>TECH TANTRUM</p><p>Are there any clouds on this sunny horizon that might trigger a tech tantrum? </p><p>The big black one - the threat of break-up on anti-trust grounds - is unlikely to come into view this side of the U.S. mid-term elections, and may never come into view during Joe Biden's presidency if the Democrats lose control of the House and or Senate.  </p><p>But smaller ones might. </p><p>Positioning is stretched. Institutional investors and asset managers are already loaded up on equities, as Bank of America's fund manager survey shows. 'Long tech' was the survey's most crowded trade in December for the sixth month in a row, and has been the most crowded trade in 13 of the last 16 months.</p><p>This raises the question of where the marginal demand will come from, especially as the Federal Reserve takes the foot off the monetary accelerator (tapering) and gets ready to apply the brakes (rate hikes and eventually reducing its balance sheet). </p><p>And the tech sector is particularly vulnerable to rising rates, shrinking market liquidity, and a weakening credit impulse. </p><p>Rates futures markets are now fully discounting three rate hikes from the Fed this year, and are shifting to price in a fourth as policymakers adjust stimulus in the face of a strong labor market and sticky inflation. </p><p>Treasury bond yields are the highest in six weeks. Real yields, while still deeply negative around -1.0%, appear to have bottomed out and have jumped 20 basis points this week. </p><p>Low real rates and yields mean future profits are discounted at lower rates, lifting the valuations of stocks that investors believe will post solid earnings growth. Tech, especially big tech, falls into this category.</p><p>Citi's Matt King in London notes that low, falling and negative real yields have stimulated a surge in liquidity, credit, and borrowing in recent years. </p><p>\"But this appears to be changing, and if there is a correction the Fed may not ride to the rescue given the strong economy, low unemployment and rising inflation,\" he notes.</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (By Jamie McGeever<br/>Editing by Alexandra Hudson)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:jamie.mcgeever@thomsonreuters.com\" data-type=\"email\" translate=\"no\">jamie.mcgeever@thomsonreuters.com</a> ; +1 (407) 288-5607; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://jamie.mcgeever.reuters.com@reuters.net\">jamie.mcgeever.reuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: MARKETS-STOCKS/TECH (COLUMN, PIX)</p></div>"}