{"date": "2020-12-10 07:01:43.518000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3249.0, "close": 3256.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 1460IAggreko PLC10 August 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>NOT FOR RELEASE, PUBLICATION OR DISTRIBUTION IN WHOLE OR IN PART, IN OR INTO ANY JURISDICTION WHERE TO DO SO WOULD CONSTITUTE A VIOLATION OF THE RELEVANT LAWS OF SUCH JURISDICTION</p>\n<p>FOR IMMEDIATE RELEASE</p>\n<p>10 August 2021</p>\n<p>RECOMMENDED CASH ACQUISITION</p>\n<p>of</p>\n<p>Aggreko plc by</p>\n<p>Albion Acquisitions Limited</p>\n<p>(a newly formed company owned by funds managed by I Squared Capital Advisors (US) LLC and investment funds managed by TDR Capital LLP)</p>\n<p>to be effected by means of a Scheme of Arrangement under Part 26 of the Companies Act 2006</p>\n<p>Scheme of Arrangement Becomes Effective</p>\n<p>On 5 March 2021, the boards of Aggreko plc (\" <span>Aggreko</span> \") and Albion Acquisitions Limited (\" <span>Bidco</span> \") announced that they had reached agreement on the terms and conditions of a recommended all cash acquisition of the entire issued, and to be issued, ordinary share capital of Aggreko (the \" <span>Acquisition</span> \"), to be effected by means of a Court-sanctioned scheme of arrangement under Part 26 of the Companies Act (the \" <span>Scheme</span> \").</p>\n<p>The circular in relation to the Scheme was published and posted to Aggreko Shareholders on 1 April 2021 (the \" <span>Scheme Document</span> \"). On 26 April 2021, the Scheme was approved by the Scheme Shareholders at the Court Meeting and the Special Resolution relating to the implementation of the Scheme was approved by the Aggreko Shareholders at the General Meeting.</p>\n<p>On 6 August 2021, Aggreko announced that the Court of Session in Edinburgh, Scotland had sanctioned the Scheme at the Scheme Court Hearing held on 6 August 2021.</p>\n<p>Aggreko and Bidco are pleased to announce that, following the delivery of a copy of the Scheme Court Order to the Registrar of Companies today, the Scheme has now become effective in accordance with its terms and the entire issued and to be issued ordinary share capital of Aggreko is now owned by Bidco. As set out in the Scheme Document, Aggreko and Bidco confirm that the Aggreko Deferred Shares were transferred to Bidco (in accordance with the transfer provisions set out in the Articles of Association) simultaneously with the Scheme becoming effective.</p>\n<p>A Scheme Shareholder on the register of members of Aggreko at the Scheme Record Time, being 6:00 p.m. (London time) on 9 August 2021, will be entitled to receive 870 pence in cash for each Scheme Share held (being the Offer Price of 880 pence per Scheme Share less the amount of the Final Dividend of 10 pence per Aggreko Share, as per the terms set out in the Scheme Document). Settlement of the consideration to which any Scheme Shareholder is entitled will be effected by way of the despatch of cheques or the crediting of CREST accounts (for Scheme Shareholders holding Scheme Shares in certificated form and in uncertificated form respectively) as soon as practicable and in any event not later than 14 days after the Effective Date, as set out in the Scheme Document (being 24 August 2021).</p>\n<p>Applications have been made to the Financial Conduct Authority and the London Stock Exchange in relation to the de-listing of Aggreko Shares from the premium listing segment of the Official List of the Financial Conduct Authority and the cancellation of the admission to trading of Aggreko Shares on the London Stock Exchange's main market for listed securities, which is expected to take effect by 8:00 a.m. (London time) on 11 August 2021.</p>\n<p>As the Scheme has now become effective, Aggreko duly announces that, as of today's date, Ken Hanna, Mark Clare, Uwe Krueger, Dame Nicola Brewer, Barbara Jeremiah, Sarah Kuijlaars, Ian Marchant and Miles Roberts have stepped down from the Aggreko Board. Chris Weston and Heath Drewett will remain on the Aggreko Board.</p>\n<p>Full details of the Acquisition are set out in the Scheme Document published on 1 April 2021.</p>\n<p>Capitalised terms used in this announcement (the \" <span>Announcement</span> \") shall, unless otherwise defined, have the same meanings as set out in the Scheme Document. All references to times in this Announcement are to London, United Kingdom times unless otherwise stated.</p>\n<p>[ <span>Remainder of page intentionally left blank</span> ]</p>\n<p>\n<span>\n</span></p>\n<p>Enquiries:</p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>Aggreko Louise Bryant, Richard Foster</span>\n</p>\n</td>\n<td>\n<p>\n<span>+44 (0) 20 7227 0090</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Headland (PR Adviser to Aggreko) Andy Rivett-Carnac Rosh Field</span>\n</p>\n</td>\n<td>\n<p>\n<span>+44 (0) 7968 997 365 +44 (0) 7515 187 426</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Centerview Partners (Financial Adviser to Aggreko) Nick Reid, Hadleigh Beals, Marc Murray</span>\n</p>\n</td>\n<td>\n<p>\n<span>+44 (0) 20 7409 9700</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Citi (Financial Adviser and Corporate Broker to Aggreko) Peter Brown, Sian Evans</span>\n</p>\n</td>\n<td>\n<p>\n<span>+44 (0) 20 7986 4000</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Jefferies (Financial Adviser and Corporate Broker to Aggreko) Ed Matthews, Philip Noblet, Daniel Frommelt</span>\n</p>\n</td>\n<td>\n<p>\n<span>+44 (0) 20 7029 8000</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>Slaughter and May is acting as legal adviser to Aggreko, and Dickson Minto W.S. is acting as legal adviser to Aggreko on matters of Scots law.</p>\n<p>Person responsible</p>\n<p>The person responsible for arranging for the release of this Announcement on behalf of Aggreko is Simon Thomson, Group Legal Director and Company Secretary.</p>\n<p>Further information</p>\n<p>This Announcement is for information purposes only and is not intended to and does not constitute, or form part of, an offer, invitation or the solicitation of an offer to purchase, otherwise acquire, subscribe for, sell or otherwise dispose of any securities, or the solicitation of any vote or approval in any jurisdiction, pursuant to the Acquisition or otherwise, nor shall there be any sale, issuance or transfer of securities of Aggreko in any jurisdiction in contravention of applicable law. The Acquisition will be implemented solely by means of the Scheme Document, which (together with the Forms of Proxy) contains the full terms and conditions of the Acquisition.</p>\n<p>This Announcement does not constitute a prospectus, prospectus equivalent document or an exempted document.</p>\n<p>Important notices</p>\n<p>Centerview Partners UK LLP (\" <span>Centerview Partners</span> \"), which is authorised and regulated by the FCA, is acting exclusively as financial adviser to Aggreko and no one else in connection with the matters described in this Announcement and will not be responsible to anyone other than Aggreko for providing the protections afforded to clients of Centerview Partners nor for providing advice in connection with the matters referred to herein. Neither Centerview Partners nor any of its affiliates owes or accepts any duty, liability or responsibility whatsoever (whether direct or indirect, whether in contract, in tort, under statute or otherwise) to any person who is not a client of Centerview Partners in connection with this Announcement, any statement contained herein, the Acquisition or otherwise.</p>\n<p>Citigroup Global Markets Limited (\" <span>Citi</span> \"), which is authorised by the PRA and regulated in the UK by the FCA and the PRA, is acting as joint financial adviser to Aggreko and for no one else in connection with the matters set out in this Announcement and will not be responsible to anyone other than Aggreko for providing the protections afforded to clients of Citi nor for providing advice in connection with the matters set out in this Announcement. Neither Citi nor any of its affiliates, directors or employees owes or accepts any duty, liability or responsibility whatsoever (whether direct or indirect, consequential, whether in contract, in tort, in delict, under statute or otherwise) to any person who is not a client of Citi in connection with the matters set out in this Announcement or any other matter or arrangement referred to herein.</p>\n<p>Jefferies International Limited (\" <span>Jefferies</span> \"), which is authorised and regulated by the FCA in the United Kingdom, is acting exclusively for Aggreko and no one else in connection with the Acquisition and will not be responsible to anyone other than Aggreko for providing the protections afforded to clients of Jefferies nor for providing advice in relation to the Acquisition or any other matters referred to in this Announcement. Neither Jefferies nor any of its affiliates owes or accepts any duty, liability or responsibility whatsoever (whether direct or indirect, whether in contract, in tort, under statute or otherwise) to any person who is not a client of Jefferies in connection with this Announcement, any statement contained herein or otherwise.</p>\n<p>Overseas jurisdictions</p>\n<p>The availability of the Acquisition to Aggreko Shareholders who are not resident in and citizens of the UK may be affected by the laws of the relevant jurisdictions in which they are located or of which they are citizens. Persons who are not resident in the UK should inform themselves of, and observe, any applicable legal or regulatory requirements of their jurisdictions. Any failure to comply with the applicable restrictions may constitute a violation of the securities laws of any such jurisdiction. Further details in relation to overseas shareholders will be contained in the Scheme Document.</p>\n<p>The release, publication or distribution of this Announcement in or into jurisdictions other than the UK may be restricted by law and therefore any persons who are subject to the law of any jurisdiction other than the UK should inform themselves of, and observe, any applicable legal or regulatory requirements. Any failure to comply with such requirements may constitute a violation of the securities laws of any such jurisdiction. To the fullest extent permitted by applicable law, the companies and persons involved in the Acquisition disclaim any responsibility or liability for the violation of such restrictions by any person. This Announcement has been prepared for the purposes of complying with English and Scots law, the UK Listing Rules, the rules of the London Stock Exchange and the Code and the information disclosed may not be the same as that which would have been disclosed if this Announcement had been prepared in accordance with the laws of jurisdictions outside of the UK.</p>\n<p>Copies of this Announcement and the formal documentation relating to the Scheme and the Acquisition will not be and must not be, directly or indirectly, mailed, transmitted or otherwise forwarded, distributed or sent in, into or from any Restricted Jurisdiction or any jurisdiction where to do so would violate the laws of that jurisdiction, and persons receiving such documents (including, without limitation, agents, custodians, nominees and trustees) must not, directly or indirectly, mail or otherwise forward, distribute or send them in or into or from any such jurisdiction.</p>\n<p>US Holders</p>\n<p>US Holders should note that the Acquisition relates to the securities of a Scottish company, is subject to UK disclosure requirements and practices (which are different from those of the US) and is proposed to be implemented by means of a scheme of arrangement under Scots law. A transaction effected by means of a scheme of arrangement is not subject to the tender offer or proxy solicitation rules under the US Exchange Act of 1934. Accordingly, the Acquisition and the Scheme will be subject to the disclosure requirements and practices applicable in the UK to schemes of arrangement, which are different from the disclosure requirements of the US tender offer and proxy solicitation rules. The financial information included in this Announcement and the Scheme Document has been or will have been prepared in accordance with IFRS, and thus may not be comparable to financial information of US companies or companies whose financial statements are prepared in accordance with generally accepted accounting principles in the US.</p>\n<p>The receipt of cash pursuant to the Acquisition by a US Holder as consideration for the transfer of its Scheme Shares pursuant to the Scheme may be a taxable transaction for US federal income tax purposes and under applicable US state and local, as well as foreign and other, tax laws. Each Aggreko Shareholder is urged to consult with legal, tax and financial advisers in connection with making a decision regarding this transaction.</p>\n<p>It may be difficult for US Holders to enforce their rights and claims arising out of the US federal securities laws, since Bidco and Aggreko are located in countries other than the US, and some or all of their officers and directors may be residents of countries other than the US. US Holders may not be able to sue a non-US company or its officers or directors in a non-US court for violations of US securities laws. Further, it may be difficult to compel a non-US company and its affiliates to subject themselves to a US court's judgement.</p>\n<p>To the extent permitted by applicable law, in accordance with normal UK market practice and pursuant to Rule 14e-5(b) of the US Exchange Act, Bidco or its nominees, or their brokers (acting as agents), may from time to time make certain purchases of, or arrangements to purchase, Aggreko Shares outside of the US, other than pursuant to the Acquisition, until the date on which the Acquisition becomes effective, lapses or is otherwise withdrawn. These purchases may occur either in the open market at prevailing prices or in private transactions at negotiated prices.</p>\n<p>Forward-looking statements</p>\n<p>This Announcement (including information incorporated by reference in this Announcement), oral statements made regarding the Acquisition, and other information published by Bidco and Aggreko contain statements which are, or may be deemed to be, \"forward-looking statements\". Forward-looking statements are prospective in nature and are not based on historical facts, but rather on current expectations and projections of the management of Bidco and Aggreko about future events, and are therefore subject to risks and uncertainties which could cause actual results to differ materially from the future results expressed or implied by the forward-looking statements.</p>\n<p>The forward-looking statements contained in this Announcement include statements relating to the expected effects of the Acquisition on Bidco and Aggreko, the expected timing and scope of the Acquisition and other statements other than historical facts. Often, but not always, forward-looking statements can be identified by the use of forward-looking words such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"is subject to\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does not anticipate\", or \"believes\", or variations of such words and phrases or statements that certain actions, events or results \"may\", \"could\", \"should\", \"would\", \"might\" or \"will\" be taken, occur or be achieved. Although Bidco and Aggreko believe that the expectations reflected in such forward-looking statements are reasonable, Bidco and Aggreko can give no assurance that such expectations will prove to be correct. By their nature, forward-looking statements involve risk and uncertainty because they relate to events and depend on circumstances that will occur in the future. There are a number of factors that could cause actual results and developments to differ materially from those expressed or implied by such forward-looking statements.</p>\n<p>These factors include, but are not limited to: the ability to complete the Acquisition; the ability to obtain requisite regulatory and shareholder approvals and the satisfaction of other Conditions on the proposed terms and schedule; as future market conditions, changes in general economic and business conditions, the behaviour of other market participants, the anticipated benefits from the proposed transaction not being realised as a result of changes in general economic and market conditions in the countries in which Bidco and Aggreko operate, weak, volatile or illiquid capital and/or credit markets, changes in tax rates, interest rate and currency value fluctuations, the degree of competition in the geographic and business areas in which Bidco and Aggreko operate and changes in laws or in supervisory expectations or requirements. Other unknown or unpredictable factors could cause actual results to differ materially from those in the forward-looking statements. Such forward-looking statements should therefore be construed in the light of such factors. Neither Bidco nor Aggreko, nor any of their respective associates or directors, officers or advisers, provides any representation, assurance or guarantee that the occurrence of the events expressed or implied in any forward-looking statements in this Announcement will actually occur. You are cautioned not to place any reliance on these forward-looking statements. Other than in accordance with their legal or regulatory obligations, neither Bidco nor Aggreko is under any obligation, and Bidco and Aggreko expressly disclaim any intention or obligation, to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.</p>\n<p>No profit forecasts or estimates</p>\n<p>No statement in this Announcement is intended as a profit forecast, profit estimate or quantified benefits statement for any period and no statement in this Announcement should be interpreted to mean that earnings or earnings per share for Bidco or Aggreko, as appropriate, for the current or future financial years would necessarily match or exceed the historical published earnings or earnings per share for Bidco or Aggreko, as appropriate.</p>\n<p>Publication on a website</p>\n<p>\n<span>In accordance with Rule 26.1 of the Code, a copy of this Announcement will be made available, subject to certain restrictions relating to persons resident in Restricted Jurisdictions, on Aggreko's website at <span>www.plc.aggreko.com</span> and/or Bidco's website at</span>\n<a href=\"http://www.albionoffer.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.albionoffer.com</a>\n<span>(as relevant) by no later than 12 noon (London time) on the business day following this Announcement. For the avoidance of doubt, the contents of these websites are not incorporated by reference and do not form part of this Announcement.</span>\n</p>\n<p>Requesting hard copy documents</p>\n<p>Aggreko Shareholders may request a hard copy of this Announcement by contacting Aggreko on +44 (0)141 225 5900 or by writing to Aggreko at 8th Floor, 120 Bothwell Street, Glasgow, Lanarkshire G2 7JS, Scotland, in each case, stating the name and address to which the hard copy should be sent. For persons who receive a copy of this Announcement in electronic form or via a website notification, a hard copy of this Announcement will not be sent unless so requested. You may also request that all future documents, announcements and information to be sent to you in relation to the Acquisition should be in hard copy form.</p>\n<p>Electronic communications</p>\n<p>Please be aware that addresses, electronic addresses and certain other information provided by Aggreko Shareholders, persons with information rights and other relevant persons for the receipt of communications from Aggreko may be provided to Bidco during the offer period as required under Section 4 of Appendix 4 of the Code.</p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>SOAPMMLTMTBBMBB</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}