{"date": "2021-11-01 20:51:11.425000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Global Leader in Personal Self Defense Sprays, Announces 3Q21 Financial Results; Launches Sales with New Retail Customers Advance Auto and Carquest, and Online Retailers Lowes.com and</p>\n</div>\n<div class=\"tr-npp-body\">\n<pre>MACE SECURITY INTERNATIONAL INC (\"MACE-0\")\n- Global Leader in Personal Self-Defense Sprays, Announces 3Q21\n- Financial Results; Launches Sales with New Retail Customers\n- Advance Auto and Carquest, and Online Retailers Lowes.com and\n- Target.com\n\n   Mace Security International announced its third quarter and year-to-date\n2021 financial results for the periods ended September 30, 2021.\n\n   Mace reported net sales for the third quarter of $3,819,000, down 20%\nversus the same period in 2020. The decrease is due to several factors\nincluding robust retail sales in the prior year comparable period due to\nsocial unrest that did not recur in 2021, along with a significant private\nlabel fill customer insourcing. This was partially mitigated with a 64%\ngrowth in Mace's online channels, including a 769% increase in its Mace\nbranded Guard Alaska bear spray. Net sales across its retail and e-commerce\nchannels were up $1,648,000, or 23%, for the year over the same nine months\nof 2020.\n\n   Mace reported a gross margin rate for the third quarter of 40% vs 41%\nfor the same quarter last year. SG&amp;A expenses were $1,311,000, or 34% of\nnet sales, compared with $1,183,000, or 25% of net sales, in the like\nquarter of 2020. The increase in SG&amp;A expenses was predominantly attributed\nto the Company's sustained commitment to increase its direct-to-consumer\nrevenues through digital advertising and branding, along with its\ninvestment in new product development. These increases were somewhat offset\nby a reduction in incentive pay provision.\n\n   Sanjay Singh, Executive Chairman, commented, \"We knew that the\ncomparison against the exceptional third quarter of 2020 would be\ndifficult. Our execution on generating revenues from new customers in the\nquarter, which we expected to exceed the loss of private label revenues\nsince the beginning of the year, was slower than expected. Design changes\ncaused delays in new product introductions thus adding more headwinds. We\nrestructured our manufacturing costs mid-quarter which are now lower by\nthirty percent vs. prior year and eighteen percent vs. the second quarter\nthis year. The company delivered a positive EBITDA in the quarter despite\nlower revenues and has no debt despite an inventory build that will help\ncombat longer than usual lead times from its suppliers. Mace has superior\nbrand recognition, and we are now making impactful progress on reaching our\nconsumers. Our YTD POS sales on the Amazon platform are up 359% vs. 2019\nwhile 2020 was up 176% over 2019. We expect revenue comparisons in the\nfourth quarter to continue to be challenging due to social unrest revenues\nin the prior year.\"\n\n   President and CEO Gary Medved commented, \"We remain committed to\nexpanding our retail reach, adding three new retailers to our customer\nportfolio in the third quarter, and developing new products, of which we\nexpect to launch two of them in early 1Q22. We continue to invest in our\ndigital efforts to grow our online presence, and our focus on manufacturing\nautomation is producing higher efficiencies.\"\n\n   Third Quarter 2021 Financial Highlights\n\n*  Net sales were $3,819,000, up 12% over the second quarter of 2021 and\ndown 20% versus the same period in the prior year. The quarter-to-quarter\nincrease was driven by double-digit growth in both online and international\nsales with a 123% increase in overall bear spray sales driven entirely by\nthe 2021 launch of its Mace branded Guard Alaska product. The decline to\nprior year was primarily due to a more than 70% decline in non-Mace brand,\nprivate label sales along with declines from the robust retail sales that\noccurred in the Company's record third quarter sales of 2020 influenced by\nthe social unrest in the U.S.\n*  Gross profit rate of 40% was down 1% from the same period in 2020 as the\nlower sales volume led to deleveraging of the fixed manufacturing costs\ncoupled with increased freight costs. Product margins improved both\nquarter-to-quarter over second quarter 2021 and quarter-over-quarter to\nlast year. The Company continued to reduce its manufacturing cost structure\nto improve its leverage on a go-forward basis.\n*  Gross profit for the third quarter decreased by $436,000, or 22%, from\nthe third quarter of 2020, primarily resulting from the decline in sales\nvolume.\n*  SG&amp;A expenses increased by $128,000 to $1,311,000 for the quarter, or\n34% of net sales, driven by Mace's commitment to increase its penetration\nin the direct-to-consumer market and the related advertising expense, an\nincrease in its provision for loss on trade accounts receivable, and\nresearch and development costs for upcoming new product introductions.\nThese expense increases were partially offset by a decrease in personnel\nrelated expense predominantly from a reduction in incentive pay provisions.\n*  Net income of $142,000 for the quarter decreased by $540,000 when\ncompared to the Company's record third quarter 2020 net income due to the\nlower sales volume and expenses associated with the Company's commitment to\ngrowth.\n*  Cash and cash equivalents decreased to $378,000 as of September 30,\n2021, a decline of $389,000 from the $767,000 on hand on December 31, 2020,\nwhile completely paying off $284,000 of outstanding debt during 2021,\nassociated with a prior acquisition.\n*  Working capital increased by $1,197,000 compared to December 31, 2020,\nwith an increase of $1,752,000 in inventory of which $1,110,00, or 63% of\nthe increase, was in raw materials or component goods. Supply chain\nreliability, uncertainty and delays has expanded lead times and the need to\nincrease component part quantities. The Company sold down 20% of its\nfinished goods inventory from the end of the second quarter. The increase\nin inventory was partially offset by a decrease of $445,000 in net accounts\nreceivable.\n*  Adjusted EBITDA for the quarter was $317,000 compared to Mace's third\nquarter record $889,000 for the third quarter of 2020.\n\n   Third Quarter 2021 Operational Highlights\n*  Mace further reduced its manufacturing costs partially due to capital\ninvestments in manufacturing automation elevated the Company's\nmanufacturing efficiency rate by 900 bp over the third quarter in 2020. The\nCompany believes that there are still efficiencies to be gained as it\ncontinues to operate with its modified cost structure.\n\n   Year-to-Date September 2021 Financial Highlights\n\n*  Net Sales of $10,519,000 decreased by $461,000, or 4%, versus the first\nnine months of 2020 driven down by a 65% decline in private label sales,\nwhich was mostly offset by a 23% increase in online and retail sales.\n*  Gross profit rate declined to 39% for 2021 compared to 40% for the same\nperiod in 2020 due to lower profit margins for certain customers, which the\nCompany is addressing, along with increased freight costs.\n*  Gross Profit decreased by $316,000, or 7%, when compared to the first\nnine months results of 2020 due predominantly to the lower sales volume.\n*  SG&amp;A increased by $669,000, or 23%, mostly from advertising to increase\nthe Company's penetration in the direct-to-consumer market, increase in\ninsurance premiums related to market conditions, increase in provision for\nloss on trade accounts receivable, and research and development costs for\nnew product introductions.\n*  Net Income was $953,000, or 9% of net sales, a decline of $302,000 from\nnet income of $1,255,000 in the first nine months of 2020. The 2021 net\nincome was enhanced by a $625,000 gain from PPP Loan forgiveness obtained\nin the first half of 2021.\n*  Adjusted EBITDA for the first nine months, which excludes the $625,000\ngain from PPP Loan forgiveness, was $875,000 compared to the Company's\nrecord $1,815,000 for the same period in 2020.\n\n   Conference Call\n\n   Mace(R) will conduct a conference call on Tuesday, November 2, 2021, at\n11:00 AM EDT, 8:00 AM PDT to discuss its financial and operational\nperformance for the third quarter and first nine months of 2021. The call\ncan be accessed by telephone within the US at (833) 360-0862. Please use\nthe conference identification number 1092552.\n\n   A digital recording of the conference call will be available for replay\nafter the call's completion. It will be available two hours after the call\nand will expire on November 16, 2021, at 11:59 PM. To access the recording,\nuse the dial in numbers listed below and the conference ID 1092552.\n\n   Encore dial-in number: (855) 859-2056 or internationally on (404)\n537-3406.\n\n   The full set of financial statements and an accompanying slide\npresentation is available on Mace's website www.corp.mace.com under the\nsubheading \"Newsroom.\"\n\n   About Mace Security International, Inc.\n\n   Mace(R) Security International, Inc. (MACE) is a globally recognized\nleader in personal safety and security. Based in Cleveland, Ohio, the\ncompany has spent more than 40 years designing and manufacturing consumer\nand tactical products for personal defense and security under its\nworld-renowned Mace(R) Brand - the original trusted brand of defense spray\nproducts. The company also offers aerosol defense sprays and tactical\nproducts for law enforcement and security professionals worldwide through\nits Mace(R) Take Down(R) brand, KUROS!(R) Brand personal safety products,\nVigilant(R) Brand alarms, and Tornado(R) Brand pepper spray and stun guns.\nMACE(R) distributes and supports Mace(R) Brand products through mass market\nretailers, wholesale distributors, independent dealers, Amazon.com,\nMace.com, and other channels. For more information, visit www.mace.com.\n\n   Mace Security International distributes and supports its products and\nservices through mass-market retailers, wholesale distributors, independent\ndealers, e-commerce channels and through its website, www.Mace.com. For\nmore information, please visit www.mace.com.\n\n   Forward-Looking Statements\n\n   Certain statements and information included on this website constitute\n\"forward-looking statements\" within the meaning of the Federal Private\nSecurities Litigation Reform Act of 1995. When used on this site, the words\nor phrases \"will likely result,\" \"are expected to,\" \"will continue,\" \"is\nanticipated,\" \"estimate,\" \"projected,\" \"intend to\" or similar expressions\nare intended to identify \"forward-looking statements\" within the meaning of\nthe Federal Private Securities Litigation Reform Act of 1995.\nForward-looking statements are subject to several known and unknown risks\nand uncertainties that may cause our actual results, trends, performance or\nachievements, or industry trends and results, to differ materially from the\nfuture results, trends, performance, or achievements expressed or implied\nby such forward-looking statements. Those risks and uncertainties may\ninclude, but are not limited to, (a) general economic and business\nconditions, including the impact of the COVID-19 pandemic and other\npossible pandemics and similar outbreaks; (b) competition; (c) potential\nchanges in customer spending; (d) acceptance of our product offerings and\ndesigns; (e) the variability of consumer spending resulting from changes in\ndomestic economic activity; (f) a highly promotional retail environment;\n(g) any significant variations between actual amounts and the amounts\nestimated for those matters identified as our critical accounting\nestimates, as well as other significant accounting estimates made in the\npreparation of our financial statements; (h) the impact of current and\npotential hostilities in various parts of the world, as well as other\ngeopolitical or public health concerns; (i) the impact of international\nsupply chain disruptions and delays; (j) the impact on the Company of\nchanges in U.S. Federal and State income tax regulations; and (k) the\nimpact of inflation and the Company's inability to pass on rising prices to\nits customers. You are urged to consider all such factors. Because of the\nuncertainty inherent in such forward-looking statements, you should not\nconsider their inclusion to be a representation that such forward-looking\nmatters will be achieved. Mace Security International, Inc. assumes no\nobligation for updating any such forward-looking statements to reflect\nactual results, changes in assumptions or changes in other factors\naffecting such forward-looking statements.\n\n(figure class=\"image image_resized\" style=\"width:700px;\")(/figure)(figure\nclass=\"image image_resized\" style=\"width:700px;\")(/figure)(figure\nclass=\"image image_resized\" style=\"width:700px;\")(/figure)(figure\nclass=\"image image_resized\" style=\"width:700px;\")(/figure)(figure\nclass=\"image image_resized\" style=\"width:700px;\")(/figure)(figure\nclass=\"image image_resized\" style=\"width:702px;\")(/figure) In this press\nrelease, the Company's financial results and financial guidance are\nprovided in accordance with accounting principles generally accepted in the\nUnited States (GAAP) and using certain non-GAAP financial measures.\nManagement believes that presentation of operating results using non-GAAP\nfinancial measures provides useful supplemental information to investors\nand facilitates the analysis of the Company's core operating results and\ncomparison of operating results across reporting periods. Management also\nuses non-GAAP financial measures to establish budgets and to manage the\nCompany's business. A reconciliation of the GAAP financial results to\nnon-GAAP financial results is included in the attached schedules.\n\nMike Weisbarth\nChief Financial Officer\nmweisbarth@mace.com\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2130400594.MNPRE2130403089-13485520211101</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}