{"date": "2021-11-08 14:17:39.700000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Connectivity at AAO 2021</p>\n<p>Alcon (SIX/NYSE: ALC), the global leader in eye care dedicated to helping people see brilliantly, will feature its latest advancement in integrated and connected surgical technologies - SMART Solutions by Alcon, a digital platform uniquely designed for ophthalmology - at the upcoming American Academy of Ophthalmology (AAO) 2021 annual meeting. This new platform furthers Alcon's leadership in clinic-to-operating room (OR) integration with image-guided technologies and cloud-based planning. Key data on leading surgical equipment, ARGOS(R)Biometer with Image Guidance and Optiwave Refractive Analysis (ORA) SYSTEM(R), will also be presented at the meeting.</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>SMARTCataract to be Showcased to U.S. Ophthalmologists at AAO 2021</p>\n<p>Alcon will conduct live demos of SMARTCataract, the first application under Alcon's SMART Solutions platform. Key elements of this novel application include planning, connectivity, analysis and optimization - all designed to enable greater efficiency, reliability and accuracy.1-5?</p>\n<p>The application connects data systems and most diagnostic devices, including ARGOS Biometer with Image Guidance, with Alcon's cataract surgical equipment, including LenSx(R)Femtosecond Laser and LuxOR(R)RevaliaT Ophthalmic Microscope, as well as most commonly used third-party microscopes - from the clinic to the OR and back.</p>\n<p>Alcon plans to roll out additional connectivity in the OR with the ORA SYSTEM and NGENUITY(R)3D Visualization System in the near future.</p>\n<p>\"Alcon's SMARTCataract application can now give us tools that tie together our biometry instruments and medical records with the most modern IOL formulas, so state-of-the art surgical planning, even for post-refractive patients, takes a fraction of the time it used to. And, we can virtually eliminate manual data transfer from one piece of equipment to the next, giving us peace of mind that transcription errors are a thing of the past,\" said Dr. John Hovanesian, Harvard Eye Associates. \"For my practice, this means confidence in our surgical outcomes and a much better patient experience.\"</p>\n<p>SMART Solutions leverages the open, cloud-based infrastructure and services of Philips HealthSuite, built on Amazon Web Services (AWS), to enable surgeons to aggregate, organize and analyze all relevant data within a single, integrated application designed for security and remote planning.</p>\n<p>\"As the global leader in eye care, we are continuing to push the boundaries of technology to help drive efficacy and accuracy with cataract surgery,\" said Sergio Duplan, President, North America, Alcon. \"We are collaborating with experts inside and outside of the industry to build on our existing ecosystem and bring ongoing advancements in this space.\"</p>\n<p>Alcon is expanding to additional customers in the U.S. through the end of the year, with a broader rollout in 2022. For more information about SMART Solutions and the SMARTCataract application, please visit AlconSMARTSolutions.com.</p>\n<p>Superior Refractive Outcomes Can Be Achieved Using ORA SYSTEM Versus Barrett True K Formula6</p>\n<p>ORA SYSTEM is the only intraoperative aberrometer on the market. With the first and only database for real-time intraocular lens (IOL) calculations during cataract surgery, the ORA SYSTEM currently includes the power of more than two million cases.</p>\n<p>A new, retrospective analysis on 1,067 eyes implanted with AcrySof(R) IQ monofocal IOLs demonstrated that intraoperative aberrometry achieved superior refractive outcomes (measured as absolute prediction error p&lt;0.005) in post-myopic LASIK/PRK eyes versus using Barret True K alone.6Constantly optimizing its growing database of millions of cases, the ORA SYSTEMhelps surgeons to catch outliers in real-time before IOL implantation and hit refractive targets with precision.7An additional study on the ORA SYSTEM will be presented:</p>\n<p>* Comparison of Prediction Error Using Intraoperative Aberrometry Guidance versus Preoperative Planning Following Trifocal IOL Implantation, presented by Dr. John F. Blaylock (on demand only). ARGOS Achieves Superior Acquisition Rate, Outperforming Lenstar* and IOLMaster* biometers; Demonstrates Time Savings for Faster and Smarter Planning8-16</p>\n<p>ARGOS is the industry-leading Swept Source Optical Coherence Tomography (SS-OCT) biometer equipped with image guidance for a faster and smarter planning solution. 9-12, 15</p>\n<p>Data from the \"Impact of an Optical Biometer's Time Efficiency in Cataract Evaluation and Surgery: A Time-and-Motion Study\" will highlight that ARGOS delivers substantial time efficiencies for cataract surgery practices, surgeons and patients through its superior acquisition rate and integration functionality.17The time-and-motion study being presented at AAO will demonstrate that ARGOS can deliver efficiency gains in the evaluation of cataract patients through measurement time and reducing the need for Manual A-scan.8,10</p>\n<p>The full abstract book, registration links for events taking place onsite and booth information are all available at MyAlconatAAO.com.</p>\n<p>###</p>\n<p>About SMART Solutions</p>\n<p>SMART Solutions by Alcon is a comprehensive cloud-based digital health solutions platform designed specifically for ophthalmology practices. Through its SMARTCataract application, it enables automatic evaluation of patient data and surgeon preferences to make optimal recommendations that improve surgical accuracy and lead to better patient outcomes for the treatment of cataracts. Surgeons and their staff should refer to the equipment product manuals for Important Product Information.</p>\n<p>About ARGOS(R) Biometer with Image Guidance</p>\n<p>ARGOS is a non-invasive, non-contact biometer based on sweptsource optical coherence tomography (SS-OCT). The device is intended to acquire ocular measurements as well as perform calculations to determine the appropriate intraocular lens (IOL) power and type for implantation during intraocular lens placement. Please refer to the ARGOS User Manual for a complete description of proper use and maintenance, optical and technical specifications, as well as a complete list of warnings and precautions.</p>\n<p>About Optiwave Refractive Analysis (ORA) SYSTEM(R)</p>\n<p>The ORA SYSTEM technology utilizes wavefront aberrometry data to measure and analyze the refractive power of the eye (i.e., sphere, cylinder, and axis measurements) to support cataract surgical procedures. Surgeons should refer to the ORA SYSTEM Operator's Manual for a complete description of proper use and maintenance, as well as a complete list of warnings and cautions.</p>\n<p>ABOUT ALCON</p>\n<p>Alcon helps people see brilliantly. As the global leader in eye care with a heritage spanning more than seven decades, we offer the broadest portfolio of products to enhance sight and improve people's lives. Our Surgical and Vision Care products touch the lives of more than 260 million people in over 140 countries each year living with conditions like cataracts, glaucoma, retinal diseases, and refractive errors. Our more than 23,000 associates are enhancing the quality of life through innovative products, partnerships with eye care professionals and programs that advance access to quality eye care. Learn more at www.alcon.com.</p>\n<p>?Enabled with integrated Image Guidance by ALCON(R).</p>\n<p>*Trademarks are the property of their respective owners.</p>\n<p>References</p>\n<p>1. Alcon Data on File, 2020.</p>\n<p>2. Blaylock JF, Hall B. Astigmatic results of a diffractive trifocal toric IOL following intraoperative aberrometry guidance. Clin Ophthalmol. 2020;14:4373-4378. doi: 10.2147/OPTH.S285711.</p>\n<p>3. Cionni RJ, Dimalanta R, Breen M, Hamilton C. A large retrospective database analysis comparing outcomes of intraoperative aberrometry with conventional preoperative planning. J Cataract Refract Surg. 2018;44(10):1230-1235. doi:10.1016/j.jcrs.2018.07.016</p>\n<p>4. Van Vliet EJ, Bredenhoff E, Sermeus W, Kop LM, Sol JCA, Harten WH. Exploring the relation between process design and efficiency in high-volume cataract pathways from a lean thinking perspective. Int J Qual Health Care. 2011;23(1):83-93. doi:10.1093/intqhc/mzq071.</p>\n<p>5. Håkansson I, Lundström M, Stenevi U, Ehinger B. Data reliability and structure in the Swedish National Cataract Register. Acta Ophthalmol Scand. 2001;79(5):518-523. doi:10.1034/j.1600-0420.2001.790519.x.</p>\n<p>6. Fram, Nicole R., MD. Refractive Prediction Accuracy Using Intraoperative Aberrometry vs. Barrett True K in Post-Corneal Refractive Surgery Eyes. AAO, New Orleans, LA. 12 November 2021.</p>\n<p>7. Alcon Data on File. 2021.</p>\n<p>8. Multack, Sam, DO, FAOCO. Impact of An Optical Biometer's Time Efficiency in Cataract Evaluation and Surgery: A Time-and-Motion Study. AAO, New Orleans, LA. 12 November 2021.</p>\n<p>9. Tamaoki A, Kojima T, Hasegawa A, et al. Clinical Evaluation of a New Swept-source Optical Coherence Biometer That Uses Individual Refractive Indices to Measure Axial Length Cataract Patients. Ophthalmic Res. 2019;19;1-13.</p>\n<p>10. Shammas HJ, Ortiz S, Shammas MC, et al. Biometry measurements using a new large-coherence-length swept-source optical coherence tomographer. J Cataract Refract Surg. 2016;42:50-61.</p>\n<p>11. Hussaindeen JR, Mariam EG, Arunachalam S, et al. Comparison of Axial Length Using a New Swept-Source Optical Coherence Tomography-Based Biometer. PLOS One. December 2018.</p>\n<p>12. Zeiss IOL Master 700 510k Submission 2015.</p>\n<p>13. ARGOS(R) Biometer User Manual. 2019.</p>\n<p>14. VERION(R) Reference Unit User Manual Part I. 2019.</p>\n<p>15. Whang, Woong-Joo. Predictive Accuracy of Partial Coherence Interferometry and Swept-source Optical Coherence Tomography For Intraocular Lens Power Calculation. Scientific Report. September 2018.</p>\n<p>16. Shammas HJ, Shammas MC, Jivrajka RV, Cooke DL, Potvin R. Effects on IOL power calculation and expected clinical outcomes of axial length measurements based on multiple vs single refractive indices. Clin Ophthalmol. 2020;14:1511-1519.</p>\n<p>17. Woodard, Lawrence, MD. Time Efficiency of an Innovative Optical Biometer in Cataract Surgery: A Time-and-Motion Study. ASCRS. Las Vegas, NV. 23 July 2021. Cautionary Note Regarding Forward-Looking Statements</p>\n<p>This press release contains \"forward-looking statements\" within the meaning of the safe harbor provisions of the United States Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by words such as: \"anticipate,\" \"intend,\" \"commitment,\" \"look forward,\" \"maintain,\" \"plan,\" \"goal,\" \"seek,\" \"believe,\" \"project,\" \"estimate,\" \"expect,\" \"strategy,\" \"future,\" \"likely,\" \"may,\" \"should,\" \"will\" and similar references to future periods.</p>\n<p>Forward-looking statements are neither historical facts nor assurances of future performance. Instead, they are based only on our current beliefs, expectations and assumptions regarding the future of our business, future plans and strategies, and other future conditions. Because forward-looking statements relate to the future, they are subject to inherent uncertainties and risks that are difficult to predict. Some of these factors are discussed in our filings with the United States Securities and Exchange Commission, including our Form 20-F. Should one or more of these uncertainties or risks materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those anticipated. Therefore, you should not rely on any of these forward-looking statements.</p>\n<p>Forward-looking statements in this press release speak only as of the date of its filing, and we assume no obligation to update forward-looking statements as a result of new information, future events or otherwise.</p>\n<p>Connect with us on Facebook</p>\n<p>LinkedIn</p>\n<p>View source version on businesswire.com: <a href=\"https://www.businesswire.com/news/home/20211108005426/en\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211108005426/en</a>/</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}