{"date": "2022-01-05 14:45:23.387000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>New Delhi [India], January 5 (ANI): The Delhi High Court's Division Bench on Wednesday stays arbitration proceedings before the Singapore tribunal in the Future Group-Amazon case.</p><p>New Delhi [India], January 5 (ANI): The Delhi High Court's Division Bench on Wednesday stays arbitration proceedings before the Singapore tribunal in the Future Group-Amazon case.</p></div><div class=\"tr-npp-body\"><p>The Court also stays the order of single-judge passed yesterday till the next date of hearing, that is, February 1, 2022.</p><p>The bench of Justice DN Patel and Justice Jyoti Singh on Wednesday after hearing the lengthy submissions of both sides said, \"Much has been argued including on the maintainability ground. We will deal with all these issues on the next date February 1, 2022.\"</p><p>\"Meanwhile court issued notice to amazon in the appeal and stays the proceedings of arbitral tribunal till next date of hearing. We also stay the order of single-judge passed in the matter\", the Division Bench ordered.</p><p>The bench was hearing an appeal of Future Group against single bench order which had dismissed the Future Group's petitions that sought direction to Arbitral Tribunal to immediately decide its application seeking termination of arbitral proceedings of Amazon matter.</p><p>Delhi HC while passing the order also said, \"If a stay is not granted, it will cause irreparable loss to this appellant. Looking into the order passed by the CCI dated December 17, 2021, by which the approval granted on November 28, 2019, was kept in abeyance and moreover, looking into the order by CCI which showed there was the suppression of facts by the respondents, there is a prima facie case in favor of appellants.\"</p><p>Before the Single bench, in the petition filed by Future Retail Limited, the petitioner has preferred against the orders dated December 29, 2021, and December 30, 2021, passed by the Arbitral Tribunal in SIAC Arbitration of 2020 (captioned Amazon.com NV Investment Holdings LLC v. Future Coupons Private Limited) (\"Arbitration Proceedings\").</p><p>Future Retail Limited has sought to issue an appropriate order or direction declaring that the continuation of the Arbitration Proceedings in the SIAC Arbitration Case is contrary to law.</p><p>The petition also sought to issue an appropriate order or direction quashing and setting aside the Impugned Orders dated December 29, 2021, and December 30, 2021, passed by the Arbitral Tribunal and to issue an appropriate order or direction directing the Arbitral Tribunal to immediately and forthwith hear, dispose of and pass order on the Termination Application.</p><p>Amazon and FRL are embroiled in a legal fight over FRL's Rs 24,713 crore merger deal with Reliance Retail. Amazon has a 49 per cent stake in FCPL, which in turn owns a 9.82 per cent stake in FRL. Amazon's contention is that it has invested Rs 1,431 crore in FCPL on the clear understanding that FRL would be the sole vehicle for its retail business and its retail assets would not be alienated without consent and never to a Restricted Person.</p><p>FRL, on the other hand, has objected to the enforcement of the EA award saying that it is not an order under Section 17(1) of the Arbitration and Conciliation Act and hence not enforceable in India. However, later the top court said the EA award is enforceable in India.</p><p>FRL has contended that the Rs 24,731 crore deal was very important to save its 25,000 employees. It had said that as per the deal, Reliance will not only take over FRL's shops but also all its liabilities. (ANI)</p><p>Copyright © 2022 aninews.in All rights reserved. Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 SyndiGate. All Rights Reserved.</p></div>"}