{"date": "2021-11-30 16:17:42+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n        It was Amazon's biggest kickoff to the holiday shopping season ever-Home, Toys, and Apparel were among the top-selling categories from Black Friday through Cyber Monday.\n      </div>\n                <div>\n                  <p>\n          Since Amazon kicked off the holiday season on October 4, customers have saved big-including millions in savings over the Black Friday and Cyber Monday holiday shopping weekend. On Black Friday and Cyber Monday, customers shopped incredible deals across every category from fashion and home to electronics, toys, Amazon devices, and beauty. On Black Friday alone, Amazon offered customers products with incredible savings compared to other retailers:<br/></p>\n                  <ul class=\"bulleted-list arrowlist\">\n                    <li>\n            The LG Gaming Monitor, 27-inch, at 17% less.\n          </li>\n                    <li>\n            JBL LIVE 300 Wireless Headphones at 47% less.\n          </li>\n                    <li>\n            Citizen Eco Drive Men's watch at 37% less.\n          </li>\n                    <li>\n            T-Fal deep fryer at 20% less.\n          </li>\n                    <li>\n            Braun Electric Razor for Men, Series 7, at 38% less.\n          </li>\n                    <li>\n            Crest 3D Whitestrips, 22 treatments, at 53% less.\n          </li>\n                  </ul>\n                  <p>\n          Customers discover savings on Amazon during the holiday season-and every day. According to a recent <span><a href=\"https://www.businesswire.com/news/home/20211111005463/en/Profitero-Study-Finds-Amazon-Chewy-to-be-the-Cheapest-Online-Retailers-Ahead-of-the-Holidays\" data-type=\"url\" class=\"tr-link\" translate=\"no\">study</a></span>from independent analyst firm Profitero, Amazon had the lowest prices by an average of 14% compared to all major retailers across every category coming into the holidays.\n        </p>\n                  <p>\n          It was a record-breaking Black Friday and Cyber Monday for Amazon, and some of this year's top-selling categories included Home, Toys, and Apparel and best-selling items were Apple AirPods, REVLON One-Step Hair Dryer, Fire TV Stick with Alexa Voice Remote, Echo Dot (3rd Gen), All-new Echo Show 5 (2nd Gen), Sengled Smart Light Bulbs, Beats Studio Buds, and Colorfulkoala Yoga Pants. Plus, more than half of sales from Black Friday through Cyber Monday were from independent selling partners, most of which are small and medium-sized businesses.\n        </p>\n                  <p>\n          And there is still time to shop and save, as new deals will drop daily on Amazon throughout the rest of the holiday season. Amazon will also be offering low prices on giftable products and buzzworthy items across all categories. Customers can visit <span><a href=\"https://www.amazon.com/cybermonday\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Deals</a></span>to continue to shop incredible discounts.\n        </p>\n                  <p>\n          Amazon is proud to make customers' holiday celebrations easier by offering a wide selection of incredible deals and low prices with convenient delivery and pick-up options. Amazon also looks forward to delivering smiles through the rest of the holiday season and beyond. The holiday season-and every day of the year at Amazon-is made possible by our employees, delivery drivers, in-store staff, and the nearly two-million small and medium-sized businesses among our independent selling partners who continue to deliver a great shopping experience for our customers around the world.\n        </p>\n                  <p>\n          Here are some highlights from Amazon's holiday season so far, including Black Friday and Cyber Monday:<br/></p>\n                  <ul class=\"bulleted-list arrowlist\">\n                    <li>\n            Some of the best-selling items from Amazon's biggest selection of gift guides, like the <span><a href=\"https://www.amazon.com/customersmostlovedgifts\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Customers' Most-Loved Gifts</a></span>, <span><a href=\"http://www.amazon.com/ExpertsGiftPicks\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Experts' Gift Picks</a></span>, <span><a href=\"https://www.amazon.com/gcx/Oprah's-Favorite-Things/gfhz/events/?categoryId=oprahs-favorite-things#fashion\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Oprah's Favorite Things</a></span>, and <span><a href=\"http://www.amazon.com/holidaytoylist\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Holiday Toy List</a></span>, include:<br/><ul class=\"bulleted-list arrowlist\"><li>\n                Oculus Quest 2, Advanced All-in-One Virtual Reality Headset, Beats Solo3 Wireless On-Ear Headphones, Bose QuietComfort Noise Cancelling Earbuds, Fire TV Stick with Alexa Voice Remote, Echo Show 10 (3rd Gen), and Mario Party Superstars - Nintendo Switch.\n              </li><li>\n                Catan Board Game, Hasbro Candy Land, Hot Wheels Criss Cross Crash Track Set, Melissa &amp; Doug Let's Play House Dust! Sweep! Mop! Play Set, ThinkFun Gravity Maze Marble Run Brain Game and STEM Toy, Monopoly, and Crayola Light-Up Tracing Pad.\n              </li><li>\n                Olaplex No. 7 Bonding Oil, EcoTools Makeup Brush Set, Jade Roller &amp; Gua Sha, Face Roller, and La Roche-Posay Toleriane Double Repair Face Moisturizer.\n              </li><li>\n                K. Carroll Kelsey Crossbody, Lollia Imagine Bubble Bath, Good Night Stories for Rebel Girls, and Poppy &amp; Pout Lip Balm all small or women-owned businesses from Oprah's Favorite Things list.<br/></li></ul></li>\n                    <li>\n            Customers were shopping more holiday prep and décor than last year, with increased purchases of items like garland, lights, and wreaths.\n          </li>\n                    <li>\n            From Black Friday through Cyber Monday some of the best-selling items included iRobot Roomba 694, Shark IQ Robot Vacuum, Fire TV Stick with Alexa Voice Remote, Echo Show 10 (3rd Gen), All-new Echo Show 5 (2nd Gen), JBL Live 300 Wireless Headphone, National Geographic Earth Science Kit, Hasbro Connect 4, Carhartt Men's Knit Cuffed Beanie, REVLON Volcanic Face Roller, and Philips Norelco Multigroomer All-in-One Grooming Kit.\n          </li>\n                    <li>\n            We have delivered billions of packages to customers around the world so far this holiday season.\n          </li>\n                    <li>\n            Amazon delivered over 10 million items to alternative delivery locations in countries around the world this holiday season, such as an Amazon Locker or Counter location, including Amazon physical retail stores like Amazon 4-star and Amazon Books. In the U.S., some of the top items delivered to one of these locations includes an Amazon Fire TV Stick 4K with Alexa Voice Remote, Amazon Gift Cards, Apple AirPods, Amazon Echo Dots, and disposable face masks.\n          </li>\n                  </ul>\n                  <p>\n          Customers who still need to complete their holiday shopping lists can visit <span><a href=\"https://www.amazon.com/cybermonday\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Deals</a></span>or the Amazon shopping app, or ask their Alexa-enabled device, \"Alexa, what are my deals?\" to find incredible savings and deep discounts across every category, including fashion, home, beauty, toys, electronics, and Amazon Devices.\n        </p>\n                  <p>\n          Customers in need of gifting inspiration can continue to check out Amazon's biggest selection of <span><a href=\"http://www.amazon.com/gifts\" data-type=\"url\" class=\"tr-link\" translate=\"no\">gift guides</a></span>, making it fun and easier than ever to find the perfect present for everyone this year by visiting <span><a href=\"https://www.amazon.com/gcx/Gifts-for-Everyone/gfhz/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Gifts</a></span>. To continue to support small this season, customers can find amazing gifts in the <span><a href=\"https://www.amazon.com/gcx/Small-Business-Gift-Guide/gfhz/events/?categoryId=small-business\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Small Business Gift Guide</a></span>.\n        </p>\n                </div>\n                <div>\n                  <div>\n          Related Tags\n        </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/shopping\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Shopping</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/holiday\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Holiday</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/retail\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Retail</a>\n                    </span>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/retail/customers-drove-record-breaking-black-friday-through-cyber-monday-sales-on-amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>30 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>30 November 2021 16:17:42 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}