{"date": "2021-11-04 16:08:53.249000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3384.0, "close": 3518.99}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Oct 29, 2021</p></div><div class=\"tr-npp-lead\"><p>Apple and Amazon's surprising results served as a reality check amidst all the earnings euphoria because both companies saw some of the effects of supply chain issues we were expecting this season.</p><p>In Apple's case, it was mostly because of component (semiconductor) shortages coming out of Asia, mainly related to the recent COVID-related shutdowns. And the electronics supply chain is such that shortage in any one or more components pushes other component inventories out of balance because each one is required to assemble a final product.</p></div><div class=\"tr-npp-body\"><p>In Amazon's case, it was also likely a question of increasing competition in AWS. Some of the issues Amazon expects in the current quarter are \"labor supply shortages, increased wage costs, global supply chain issues, and increased freight and shipping costs.\"</p><p>Quite a few of the transportation sector earnings reports are out. And it's clear to see that it isn't just the holiday demand, the economic rebound, the strong customer/household that's creating the imbalance, but also the constrained capacity and driver shortage.</p><p>Company management is generally of the view that the situation normalizes next year, if not in the first half, then definitely in the second. In the meantime, they are enjoying higher rates across the board. Companies are also entering into longer-term contracts to secure deliveries. Here are some more details-</p><p><span>Ryder System, Inc. <a href=\"https://www.zacks.com/stock/quote/R\" data-type=\"url\" class=\"tr-link\" translate=\"no\">R</a> </span></p><p>Ryder, which belongs to the Transportation - Equipment and Leasing industry (top 24% of 250+ Zacks-classified industries) is one of the world's largest providers of integrated logistics and transportation solutions to companies of all sizes and across a number of industries, including automotive, electronics, transportation, grocery, lumber and wood products, food service and home furnishing.</p><p>Its exposure to a large number of markets makes it an ideal candidate to study, especially with respect to what's going on with the supply chain.</p><p>Accordingly, management says that there is a high level of demand overall as well as truck production constraints that is supporting stronger pricing. Another challenge is the rising labor cost, which is however being successfully passed on to customers, something management expects to continue doing next year as well.</p><p>The increased uncertainty is also having another positive impact in that it is driving customers/companies to sign long-term, and therefore larger transportation and logistics outsourcing deals. The supply chain and dedicated businesses are seeing a record number of new contract wins with the potential to increase long-term profitability.</p><p>The company is directing its strategic investments to the warehousing, distribution, e-commerce micro fulfillment, digital driver staffing and last mile delivery segments, which have been particularly strong pockets of growth since the pandemic hit. It is also investing in startups and acquiring companies like Midwest Warehouse &amp; Distribution System to build these capabilities.</p><p>Management expects to grow both revenue and profit next year, on top of the solid growth expected this year (2021 earnings are now expected to come in at $8.40-$8.50, up from previous guidance of $7.20-$7.50). That's up from a 27-cent loss in 2020. The situation is expected to remain conducive to price increases in 2022 that will more than offset labor cost escalation.</p><p>The Zacks Rank #1 (Strong Buy) company with Value, Growth and Momentum Scores of A, B and A respectively, beat September quarter estimates by 20.3%. The 2021 estimate is up 21 cents and the 2022 estimate is up 39 cents in the last 30 days.</p><p><span>Covenant Logistics Group, Inc. <a href=\"https://www.zacks.com/stock/quote/CVLG\" data-type=\"url\" class=\"tr-link\" translate=\"no\">CVLG</a> </span></p><p>Covenant, which belongs to the Transportation – Truck industry (top 6%) through its subsidiaries, offers a portfolio of transportation and logistics services, including asset-based expedited, dedicated and irregular route truckload capacity, as well as asset-light warehousing, transportation management and freight brokerage capability.</p><p>Like Ryder, Covenant management also pointed to the strong freight market as the main reason for the company's performance in the last quarter (the Managed Freight and Warehouse segments combined grew 73% year over year). Managed Freight grew its customer base, and handled overflow flight freight from Expedited and Dedicated as well. The strength was attributed to growing economic activity, low inventories, and supply chain disruptions, accompanied  by  constrained  capacity  due  to  an  intensifying  national  driver  shortage.</p><p>Management said that pricing and utilization grew nicely, but lower capacity hurt revenue while the driver shortage was also a dampener. Cost increases are being passed on.</p><p>The Zacks Rank #2 (Buy) company with Value, Growth and Momentum Scores of A, A and B respectively, beat September quarter estimates by 2.0%. This was the strongest earnings result in company history, and 2021 projections are now for  $1 billion in revenue and the highest-ever annual earnings per share. The 2021 and 2022 estimates are both up 7 cents in the last 30 days.</p><p><span>Costamare Inc. <a href=\"https://www.zacks.com/stock/quote/CMRE\" data-type=\"url\" class=\"tr-link\" translate=\"no\">CMRE</a> </span></p><p>Costamere, which belongs to the Transportation – Shipping industry (top 23%), owns containerships that are chartered to liner companies. The company deploys its containership fleet principally under multi-year time charters with leading liner companies that operate regularly scheduled routes between large commercial ports. It also provides a range of shipping services, such as technical support and maintenance, insurance consulting, financial and accounting services.</p><p>Mr. Gregory Zikos, Chief Financial Officer of Costamare Inc., commented:</p><p>\"The container market rebound that began in the second half of last year is continuing, drawing strength from favorable supply and demand dynamics. The availability of containerships in the market has been stretched thin due to high cargo volumes and strong tonnage demand, that has been exacerbated by port congestion and an overall shortage of equipment.\"</p><p>So all its containerships are being chartered at increasingly higher rates. Most of its dry bulk vessels, including the 20 added during the quarter are operating in the spot market, making the most of the high rates.</p><p>Contracted revenues continue to increase with the contract period now averaging four years, lending very good visibility into the future.</p><p>Third quarter earnings jumped to 87 cents from 14 cents a year ago. Adjusted earnings went from 22 cents to 66 cents.</p><p>The Zacks Rank #1 company with Value, Growth and Momentum Scores of B, D and A, respectively, fell short of September quarter estimates by 13.2%. But the 2021 and 2022 estimates are up 46 cents and 89 cents, respectively in the last 30 days.</p><p>Some other buy-ranked transportation stocks worth buying today are ArcBest Corp. <a href=\"https://www.zacks.com/stock/quote/ARCB\" data-type=\"url\" class=\"tr-link\" translate=\"no\">ARCB</a> (the company reports in November), KnightSwift Transportation <a href=\"https://www.zacks.com/stock/quote/KNX\" data-type=\"url\" class=\"tr-link\" translate=\"no\">KNX</a> , Herc Holdings (HRI), Triton International Ltd. <a href=\"https://www.zacks.com/stock/quote/TRTN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">TRTN</a> , GasLog Partners LP <a href=\"https://www.zacks.com/stock/quote/GLOP\" data-type=\"url\" class=\"tr-link\" translate=\"no\">GLOP</a> and EuroDry <a href=\"https://www.zacks.com/stock/quote/EDRY\" data-type=\"url\" class=\"tr-link\" translate=\"no\">EDRY</a> .</p><p><span><span>Price Performance Over Last Three Months</span></span></p><p>Image Source: Zacks Investment Research</p><p><span>Tech IPOs With Massive Profit Potential:</span>Last years top IPOs surged as much as 299% within the first two months. With record amounts of cash flooding into IPOs and a record-setting stock market, this year could be even more lucrative. </p><p><a href=\"https://www.zacks.com/registration/ultimatetrader/welcome/eoffer/4e87?add=2116&amp;adid=NEWSTEX_CONTENT_ZU_IPOREPORT_2A_ANALYSTBLOG_215_IND_10292021&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cinvestment_ideas-1820256\" data-type=\"url\" class=\"tr-link\" translate=\"no\">See Zacks' Hottest Tech IPOs Now &gt;&gt;</a></p><p>Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.</p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=RPT_7BST_LP194&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_215&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cinvestment_ideas-1820256\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Click to get this free report</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=R&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_215&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cinvestment_ideas-1820256\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Ryder System, Inc. (R): Free Stock Analysis Report</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=KNX&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_215&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cinvestment_ideas-1820256\" data-type=\"url\" class=\"tr-link\" translate=\"no\">KnightSwift Transportation Holdings Inc. (KNX): Free Stock Analysis Report</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZR_LINK&amp;d_alert=rd_final_rank&amp;t=CMRE&amp;ADID=NEWSTEX_CONTENT_ZR_ARTCAT_ANALYSTBLOG_215&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cinvestment_ideas-1820256\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Costamare Inc. (CMRE): Free Stock Analysis Report</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZR_LINK&amp;d_alert=rd_final_rank&amp;t=ARCB&amp;ADID=NEWSTEX_CONTENT_ZR_ARTCAT_ANALYSTBLOG_215&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cinvestment_ideas-1820256\" data-type=\"url\" class=\"tr-link\" translate=\"no\">ArcBest Corporation (ARCB): Free Stock Analysis Report</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZR_LINK&amp;d_alert=rd_final_rank&amp;t=GLOP&amp;ADID=NEWSTEX_CONTENT_ZR_ARTCAT_ANALYSTBLOG_215&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cinvestment_ideas-1820256\" data-type=\"url\" class=\"tr-link\" translate=\"no\">GasLog Partners LP (GLOP): Free Stock Analysis Report</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=TRTN&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_215&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cinvestment_ideas-1820256\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Triton International Limited (TRTN): Free Stock Analysis Report</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZR_LINK&amp;d_alert=rd_final_rank&amp;t=EDRY&amp;ADID=NEWSTEX_CONTENT_ZR_ARTCAT_ANALYSTBLOG_215&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cinvestment_ideas-1820256\" data-type=\"url\" class=\"tr-link\" translate=\"no\">EuroDry (EDRY): Free Stock Analysis Report</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZR_LINK&amp;d_alert=rd_final_rank&amp;t=CVLG&amp;ADID=NEWSTEX_CONTENT_ZR_ARTCAT_ANALYSTBLOG_215&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cinvestment_ideas-1820256\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Covenant Logistics Group, Inc. (CVLG): Free Stock Analysis Report</a></p><p> </p><p><a href=\"http://www.zacks.com/stock/news/1820256/what-transportation-earnings-tell-us-about-the-supply-chain?cid=CS-NEWSTEX-FT-analyst_blog%7Cinvestment_ideas-1820256\" data-type=\"url\" class=\"tr-link\" translate=\"no\">To read this article on Zacks.com click here.</a></p><p> </p><p><a href=\"http://www.zacks.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Zacks Investment Research</a></p><p>The views expressed in any and all content distributed by Newstex and its re-distributors (collectively, the \"Newstex Authoritative Content\") are solely those of the respective author(s) and not necessarily the views of Newstex or its re-distributors. Stories from such authors are provided \"AS IS,\" with no warranties, and confer no rights. The material and information provided in Newstex Authoritative Content are for general information only and should not, in any respect, be relied on as professional advice. Newstex Authoritative Content is not \"read and approved\" before it is posted. Accordingly, neither Newstex nor its re-distributors make any claims, promises or guarantees about the accuracy, completeness, or adequacy of the information contained therein or linked to from such content, nor do they take responsibility for any aspect of such content. The Newstex Authoritative Content shall be construed as author-based content and commentary. Accordingly, no warranties or other guarantees are offered as to the quality of the opinions, commentary or anything else appearing in such Newstex Authoritative Content. Newstex and its re-distributors expressly reserve the right to delete stories at its and their sole discretion.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Zacks Investment Research</p></div>"}