{"date": "2022-02-15 13:08:20.681000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> workers and organizers in Bessemer, <a href=\"https://www.independent.co.uk/topic/alabama\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Alabama</a> are making door-to-door house calls, sporting pro-union T-shirts and challenging anti-union messaging by Amazon-hired consultants as they try to convince their peers for the second time to unionize their warehouse in an election that starts Friday by secret ballot.</p><p>The new organizing tactics come two months after the National Labor Relations Board ordered a do-over election upon determining that Amazon unfairly influenced the first election last year. Workers back then overwhelmingly rejected the union in a vote of 1,798 to 738 and a turnout of 53%.</p></div><div class=\"tr-npp-body\"><p>The Retail, Wholesale and Department Store Union, which like last time is spearheading the union drive, has solicited help from other unions, including those representing teachers and postal clerks.</p><p>Stuart Appelbaum, president of the RWDSU, says the union is also courting community groups like Greater Birmingham Ministries to amplify the message that Amazon workers are not just warehouse workers but belong to communities and deserve respect.</p><p>\"Alabama has a long history of denying the rights of workers in order to attract corporations,\" said Scott Douglas, executive director of Greater Birmingham Ministries. \"We have to put a stop to this.\"</p><p>RWDSU estimates that more than half of the roughly 6,100 workers at the Alabama facility who voted last year remain eligible to vote in the current election. But the numbers also speak to high worker turnover — an issue that has made it difficult for organizing efforts to gain traction in Bessemer and elsewhere.</p><p>Organizers are nonetheless optimistic. <a href=\"https://www.independent.co.uk/topic/vaccines\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Vaccines</a> have made it easier for them to do face-to-face meetings during the pandemic as opposed to the texts, emails and phone calls they relied on last year. They also say workers are more open to being unionized and that new employees are taking note of the labor unrest that has become even stronger in recent months, not just at Amazon but other companies such as Starbucks.</p><p>\"We are letting Amazon know that we are going to stick together. We are going to work together and we are going to be one,\" said Kristina Bell during a union-organized call last week. The Bessemer worker has been helping to organize solidarity drives where workers wear pro-union T-shirts a few times a week.</p><p>A repeat of the election puts the spotlight back Amazon and how it treats its workers. Pro-union employees at the Bessemer warehouse complain of 10-hour shifts on their feet with little time to take breaks.</p><p>Barbara Agrait, an Amazon spokeswoman, countered in an email to The Associated Press that full-time employees at the Bessemer facility earn at least $15.80 an hour and have access to health care on the first day of work, and a matching 401(k) program with matching company contributions. In addition, Amazon will pay the full cost of employees' college tuition after three months on the job. Agrait further noted that more than 450 employees have been promoted since the opening of the warehouse in the spring of 2020.</p><p>\"Our employees have always had the choice of whether or not to join a union, and our focus remains on working directly with our team to make Amazon a great place to work,\" Agrait said.</p><p>If organizers are successful, the Bessemer warehouse would be the first unionized Amazon facility in the U.S. The company is fighting a separate attempt by workers to unionize a <a href=\"https://www.independent.co.uk/topic/new-york\" data-type=\"url\" class=\"tr-link\" translate=\"no\">New York</a> City facility, where last week the nascent Amazon Labor Union lined up enough support to hold a vote.</p><p>The RWDSU still faces an uphill battle with Amazon, which hasn't relented on its anti-union stance. Workers say the company continues to rely on consultants and managers to hold mandatory staff meetings to talk about why unions are a bad idea.</p><p>Agrait defended the meetings: \"If the union vote passes, it will impact everyone at the site, which is why we host regular informational sessions and provide employees the opportunity to ask questions and learn about what this could mean for them and their day-to-day life working at Amazon.\"</p><p>The company is also keeping a controversial U.S. Postal Service mailbox that was key in the NLRB's decision to invalidate last year's vote. Amazon had argued it wanted to make it more convenient for workers to vote but the NLRB said the mailbox gave the false impression that Amazon was running the election.</p><p>The mailbox has since been relocated from the entrance of the facility to another part of the parking lot. And, under the new election rules, it no longer contains the signage that Amazon erected last year.</p><p>But the union says that the mailbox is still under camera surveillance and can leave workers under the false impression that they can only drop off their ballots there as opposed to the post office or mailing their ballots from home.</p><p>\"The whole election was overturned because of the mailbox. It needs to be removed,\" said Darryl Richardson, an Amazon worker in the Bessemer facility.</p><p>The NLRB declined to comment. The agency will begin to send ballots to workers on Friday; the ballots must be returned to the NLRB regional office by March 25.</p><p>For its part, Amazon reached a settlement with the NLRB pledging to refrain from activities such as threatening workers with discipline or calling the police when they're engaging in union activity in exterior non-work areas during a non-work environment.</p><p>But <a href=\"https://www.independent.co.uk/topic/john-logan\" data-type=\"url\" class=\"tr-link\" translate=\"no\">John Logan</a> director of Labor and Employment Studies at San Francisco State University, says the settlement only required Amazon to act within the labor law, which favors employers. He noted the current labor law allows companies lot of leeway, including holding mandatory meetings that can potentially intimidate workers and send a barrage of anti-union messages throughout the workers' day.</p><p>Appelbaum and some Amazon workers say they have pushed back at these mandatory meetings, correcting consultants or other managers on any false statements and sometimes even shutting the meetings down.</p><p>Still, Logan says while Amazon made missteps in the last election, it continues to get better at anti-union campaigns, figuring out what it can and cannot do.</p><p>\"They're learning, and they're becoming more sophisticated,\" Logan said.</p><p>_______</p><p>Follow Anne D'Innocenzio: <a href=\"http://twitter.com/ADInnocenzio\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://twitter.com/ADInnocenzio</a> </p><p>Read More</p><p><a href=\"https://www.independent.co.uk/news/spacex-cape-canaveral-amazon-earth-tonga-b2011371.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">SpaceX satellites falling out of orbit after solar storm</a> </p><p><a href=\"https://www.independent.co.uk/news/cabinet-peru-lima-torres-amazon-b2010845.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Peru's president swears in his 4th Cabinet half a year</a> </p><p><a href=\"https://www.independent.co.uk/news/will-smith-oscar-jane-campion-netflix-coda-b2009875.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">'Dune,' 'Power of the Dog' poised for Oscar nomination hauls</a> </p><p><a href=\"https://www.independent.co.uk/news/oscar-hollywood-netflix-new-york-oscars-b2009745.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">What to watch out for when Oscar noms are announced Tuesday</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/walmart-amazon-nestle-new-york-maersk-b2009670.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Report: Corporate climate pledges are weaker than they seem</a> </p><p><a href=\"https://www.independent.co.uk/news/scarlett-johansson-colin-jost-alexa-los-angeles-amazon-b2009290.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Scarlett Johansson, Colin Jost reunite for Super Bowl ad</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 Independent, The (UK) (Online). All rights reserved.</p></div>"}