{"date": "2021-12-02 11:20:20.638000+00:00", "ticker": "ABDN", "mrkt_info": {"open": 233.3, "close": 230.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 3704Uabrdn PLC02 December 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>2 December 2021</span>\n</p>\n<p>\n<span>NOT FOR RELEASE, PUBLICATION OR DISTRIBUTION, IN WHOLE OR IN PART, IN, INTO, OR FROM ANY JURISDICTION WHERE TO DO SO WOULD CONSTITUTE A VIOLATION OF THE RELEVANT LAWS OF THAT JURISDICTION</span>\n</p>\n<p>\n<span>THIS ANNOUNCEMENT CONTAINS INSIDE INFORMATION</span>\n</p>\n<p>\n<span>FOR IMMEDIATE RELEASE</span>\n</p>\n<p>\n<span>abrdn plc (\"abrdn\")</span>\n</p>\n<p>\n<span>Proposed acquisition of interactive investor Limited</span>\n</p>\n<p>\n<span>abrdn announces plans to acquire 100 per cent. of the UK's leading subscription-based investment platform interactive investor for £1.49 billion. abrdn and interactive investor have a shared vision of the growth and development of the wealth market and a commitment to being the customer champion. This acquisition will significantly enhance our presence and growth opportunities within a fast-growing and attractive market.</span>\n</p>\n<p>\n<span>Stephen Bird, Chief Executive Officer of abrdn plc commented:</span>\n</p>\n<p>\n<span>\"This is a unique opportunity and a transformative step in delivering our growth strategy. interactive investor is the UK's number one subscription-based investing platform with a powerful reputation as a consumer champion. abrdn's scale, resources, and shared vision will enable interactive investor to grow confidently and expand its leadership position in the UK's attractive savings and wealth market. I am delighted that Richard Wilson and his team will continue to lead interactive investor.\"</span>\n</p>\n<p>\n<span>Richard Wilson, Chief Executive Officer of interactive investor Limited commented:</span>\n</p>\n<p>\n<span>\"This is an exciting new chapter in our history and means that we can focus exclusively on serving those who matter most: our customers. We will have access to abrdn's additional capabilities across research, advice and wealth management services, and we will benefit from being part of one of Europe's largest investment and wealth management firms, with a vision and values closely aligned to our own.</span>\n</p>\n<p>\n<span>Our management will remain the same, and the same extraordinary team will continually develop our service and technology, while maintaining our subscription pricing, our whole of market choice and the same campaigning spirit and editorial independence.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>abrdn has agreed to acquire 100 per cent. of the ordinary share capital of the holding company of interactive investor Limited (\"interactive investor\") from its shareholders, including J.C. Flowers IV L.P. (a fund advised by J.C. Flowers &amp; Co.) and key members of interactive investor's management, for total consideration of £1.49 billion <span>\n<a href=\"#_ftn1\">[1]</a>\n</span> .</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>Completion of the Acquisition is subject to the satisfaction of customary conditions including regulatory consents and abrdn Shareholder approval.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>interactive investor is the leading subscription-based platform <span>\n<span>\n<span>\n<a href=\"#_ftn2\">[2]</a>\n</span>\n</span>\n</span> within the high-growth UK direct investing market, with over 400,000 customers <span>\n<span>\n<span>\n<a href=\"#_ftn3\">[3]</a>\n</span>\n</span>\n</span> and AUA of approximately £55 billion <span>\n<span>\n<span>\n<a href=\"#_ftn4\">[4]</a>\n</span>\n</span>\n</span> . The UK direct investing market benefits from accelerating demographic and structural market trends. In combination, the high-tech, high-touch models of interactive investor and abrdn can enable clients to become better investors and create more opportunities for their financially secure futures.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>The Acquisition is a material step in our building of a leadership position in the personal wealth market, with AUMA in the Personal vector increasing nearly fivefold to £69 billion <span>\n<a href=\"#_ftn5\">[5]</a>\n</span> on a pro forma basis.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>abrdn considers the investment choices, flexibility and fixed fee pricing model that interactive investor offers customers, and its ethos as a consumer champion, to positively differentiate it in the market. abrdn is therefore committed to interactive investor's standalone open-architecture, subscription-based revenue model for the long-term.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>As part of the Acquisition, Richard Wilson, CEO of interactive investor will join abrdn and continue to lead interactive investor, which will operate as a standalone business within abrdn's Personal vector.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>interactive investor has grown rapidly, attracting high-value customers and is expected to continue to deliver a strong profile of growth and efficiency <span>. The Acquisition is expected to be double-digit earnings accretive <span>\n<a href=\"#_ftn6\">[6]</a>\n</span> in the first full financial year following</span> Completion.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>The Acquisition will be funded in cash from abrdn's capital resources. Following the Acquisition, abrdn's capital position will remain strong with an indicative pro forma regulatory capital surplus (post IFPR) of c.£0.5 billion and in addition c.£2.5 billion of value from our listed investments <span>\n<a href=\"#_ftn7\">[7]</a>\n</span> . We intend to issue Additional Tier 1 debt of c.£200 million to optimise our capital structure.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Strategic rationale for the Acquisition</span>\n</p>\n<p>\n<span>Acquisition achieves scale in the high-growth direct investing market, accessing new customer segments and capabilities</span>\n</p>\n<p>\n<span>·</span>\n<span>Growing our Personal vector and expanding its capabilities and scale is a clear strategic priority for abrdn. The current focus of our Personal vector on financial planning and discretionary investment management will be transformed by combining with the high-tech model of interactive investor enabling us to meet clients' financial needs throughout their lives. Following the Acquisition, our Personal vector will have £69 billion of AUMA <span>\n<a href=\"#_ftn8\">[8]</a>\n</span> on a pro forma basis and the share of abrdn Group fee based revenue <span>\n<a href=\"#_ftn9\">[9]</a>\n</span> from Personal will increase from 6 per cent. <span>\n<a href=\"#_ftn10\">[10]</a>\n</span> to 13 per cent. <span>\n<a href=\"#_ftn11\">[11]</a>\n</span>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>The direct investing market has grown at c.15 per cent. <span>\n<a href=\"#_ftn12\">[12]</a>\n</span> compound historically and is expected to continue growing at a similar rate in the future driven by accelerating demographic and structural market trends. These include the democratisation of wealth, increased digitalisation of services, better value for money propositions, substantial inter-generational wealth transfers and the growing importance of a dynamic offering to address changing client behaviours and needs over time.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>interactive investor is the UK's leading subscription-based direct investing platform and consumer champion</span>\n</p>\n<p>\n<span>·</span>\n<span>interactive investor is the leading subscription-based direct investing platform in the UK, with over 400,000 customers, and a meaningful proportion of high-value customers based on AUA per customer. Its open-architecture, digitally-enabled, data-centric model and technology platform drives strong customer engagement, activity and acquisition, through data analytics, customer personalisation and high user functionality.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>This has enabled interactive investor to build growth momentum, with net flows of £5.5 billion <span>\n<span>\n<span>\n<a href=\"#_ftn13\">[13]</a>\n</span>\n</span>\n</span> , c.17 per cent. of opening AUA, and increasing trading volumes of c.21,700 daily average retail trades over the twelve month period to 30 June 2021, which compares to c.8,700 over the twelve month period to 31 December 2019. Total AUA has increased 55 per cent. compound over the period between 31 December 2018 to 30 June 2021.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>interactive investor is focused on continuing to deliver enhanced user experience for its customers following the successful roll out of a new mobile app and website and, most recently, the launch of 'Friends and Family', where existing customers can introduce multiple friends or family for only £5 per month.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>interactive investor's platform is scalable with a large proportion of efficient straight-through processing, which allows significant scaling in customer numbers and activity. Strong operating leverage in the business has resulted in an improving margin <span>\n<a href=\"#_ftn14\">[14]</a>\n</span> from 23 per cent. <span>\n<span>\n<span>\n<a href=\"#_ftn15\">[15]</a>\n</span>\n</span>\n</span> to 34 per cent. <span>\n<span>\n<span>\n<a href=\"#_ftn16\">[16]</a>\n</span>\n</span>\n</span> .</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Transforms our Personal vector, significantly growing and diversifying revenue and profitability</span>\n</p>\n<p>\n<span>·</span>\n<span>Following the Acquisition, abrdn's Personal vector will have scale and relevance, with fee based revenue more than doubling from £83 million <span>\n<span>\n<span>\n<a href=\"#_ftn17\">[17]</a>\n</span>\n</span>\n</span> to £199 million <span>\n<span>\n<span>\n<a href=\"#_ftn18\">[18]</a>\n</span>\n</span>\n</span> on a pro forma basis. The vector's growth potential is expected to accelerate given the trends supporting strong growth prospects for the personal wealth market and direct investing specifically.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>interactive investor's projected revenue growth complements abrdn's high single digit revenue growth target (three year CAGR to 2023), accelerating sustainable growth, and its operating margin is incremental to abrdn's existing <span>target to exit 2023 at a cost/income ratio of c.70 per cent.</span>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>The Acquisition significantly expands our addressable market and creates a step change in our combined UK wealth offering. interactive investor expands abrdn's client reach, adding over 400,000 customers, allowing us to meet a broader range of client behaviours and needs.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Shared vision of a combined high-tech, high-touch model that meets clients' financial needs throughout their lives</span>\n</p>\n<p>\n<span>·</span>\n<span>interactive investor aligns closely with abrdn's client-led offering. Together with abrdn's established propositions in financial planning and discretionary investment management, the combined offering provides clients with trust, confidence and compelling value for clients at all stages of their financial journeys.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>interactive investor complements recently added new digital capabilities, with Exo Investing, which allows easier investing for clients through <span>AI digital investing capabilities</span> , and Finimize, which offers digestible investing information and insights to a highly engaged investor community.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>interactive investor will be able to leverage abrdn's trust, deep expertise in financial advice, meticulous research and global perspective. In combination, interactive investor's high-tech model</span>\n<span>broadens abrdn's existing personal wealth offerings, from self-directed investing to high-touch financial planning and discretionary investment management.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Optimal deployment of our capital to drive sustainable growth, returns, scale and shareholder value - the Acquisition is expected to be double-digit earnings accretive <span>\n<a href=\"#_ftn19\">[19]</a>\n</span>\n</span>\n</p>\n<p>\n<span>·</span>\n<span>The Acquisition creates a leading position for the Personal vector in the high-growth UK savings market, and is <span>expected to be double-digit earnings accretive <span>\n<a href=\"#_ftn20\">[20]</a>\n</span> in the first full financial year following Completion.</span>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>The Acquisition will be funded in cash from abrdn's capital resources. Following the Acquisition, abrdn's capital position will remain strong with an indicative pro forma regulatory capital surplus (post IFPR) of c.£0.5 billion and in addition c.£2.5 billion in value from our listed investments <span>\n<a href=\"#_ftn21\">[21]</a>\n</span> . We intend to issue Additional Tier 1 debt of c.£200 million to optimise our capital structure.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>The Acquisition improves abrdn's dividend cover. The Board intends to maintain the total dividend at 14.6 pence per annum until it is covered at least 1.5 times by adjusted capital generation, at which point the Board will seek to grow the dividend in line with its assessment of the underlying medium term growth in profitability.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Further information on interactive investor</span>\n</p>\n<p>\n<span>interactive investor is the leading subscription-based, digitally enabled, direct investing platform in the UK, founded in 1995. Its holding company is controlled by a fund advised by J.C. Flowers &amp; Co., a leading private equity firm. interactive investor is the UK's largest fixed fee subscription-based investing platform, with £55 billion of AUA and over 400,000 customers <span>\n<span>\n<span>\n<a href=\"#_ftn22\">[22]</a>\n</span>\n</span>\n</span> .</span>\n</p>\n<p>\n<span>interactive investor has a strong track record of acquiring, integrating and investing in complementary platform businesses. interactive investor completed the acquisition of TD Direct Investing in 2017, Alliance Trust Savings in 2019, and Share plc in 2020. The latest acquisition was the EQi book of customers, which completed in June 2021. interactive investor is based in Manchester, with offices in London and Leeds, and has c.777 employees <span>\n<a href=\"#_ftn23\">[23]</a>\n</span> .</span>\n</p>\n<p>\n<span>The interactive investor Group generated adjusted profit before tax of £45.5 million and reported profit before tax of £41.7 million for the year ended 2020 and had gross assets of £636 million as at 30 June 2021.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>2018</span>\n</p>\n</td>\n<td>\n<p>\n<span>2019</span>\n</p>\n</td>\n<td>\n<p>\n<span>2020</span>\n</p>\n</td>\n<td>\n<p>\n<span>LTM June 2021</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Customers ('000s)</span>\n</p>\n</td>\n<td>\n<p>\n<span>258</span>\n</p>\n</td>\n<td>\n<p>\n<span>273</span>\n</p>\n</td>\n<td>\n<p>\n<span>277</span>\n</p>\n</td>\n<td>\n<p>\n<span>404</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Daily Average Retail Trades</span>\n</p>\n</td>\n<td>\n<p>\n<span>8,591</span>\n</p>\n</td>\n<td>\n<p>\n<span>8,691</span>\n</p>\n</td>\n<td>\n<p>\n<span>19,083</span>\n</p>\n</td>\n<td>\n<p>\n<span>21,721</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>AUA (as at period end, £ billion)</span>\n</p>\n</td>\n<td>\n<p>\n<span>18</span>\n</p>\n</td>\n<td>\n<p>\n<span>32</span>\n</p>\n</td>\n<td>\n<p>\n<span>38</span>\n</p>\n</td>\n<td>\n<p>\n<span>55</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Net flows (£ billion)</span>\n</p>\n</td>\n<td>\n<p>\n<span>0.9</span>\n</p>\n</td>\n<td>\n<p>\n<span>1.7</span>\n</p>\n</td>\n<td>\n<p>\n<span>4.3</span>\n</p>\n</td>\n<td>\n<p>\n<span>5.5</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Revenue (£ million) <span>\n<a href=\"#_ftn24\">[24]</a>\n</span>\n</span>\n</p>\n</td>\n<td>\n<p>\n<span>73.0</span>\n</p>\n</td>\n<td>\n<p>\n<span>90.2</span>\n</p>\n</td>\n<td>\n<p>\n<span>133.2</span>\n</p>\n</td>\n<td>\n<p>\n<span>-</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Adjusted profit before tax (£ million) <span>\n<a href=\"#_ftn25\">[25]</a>\n</span>\n</span>\n</p>\n</td>\n<td>\n<p>\n<span>17.1</span>\n</p>\n</td>\n<td>\n<p>\n<span>23.2</span>\n</p>\n</td>\n<td>\n<p>\n<span>45.5</span>\n</p>\n</td>\n<td>\n<p>\n<span>-</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<p>\n<span>Key terms of the Acquisition</span>\n</p>\n<p>\n<span>A summary of the key terms of the principal agreements in connection with the Acquisition is set out in Appendix I to this announcement.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Transaction timetable and conditionality</span>\n</p>\n<p>\n<span>The Acquisition is a Class 1 transaction for abrdn under the Listing Rules. Accordingly, the approval of abrdn Shareholders is required and will be sought at the General Meeting expected to take place in the first quarter of 2022. The Circular containing the notice convening the General Meeting will be published in due course. In addition, the Acquisition is subject to the satisfaction of other conditions including receipt of regulatory and anti-trust approvals.</span>\n</p>\n<p>\n<span>The timing of the satisfaction of certain of the conditions to Completion is uncertain given the involvement of third parties, including relevant regulators, but it is currently expected that Completion will occur in the second quarter of 2022.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Integration plan</span>\n</p>\n<p>\n<span>abrdn intends to operate interactive investor as a standalone business within its Personal vector, with its own management team and operational platform, to ensure a continued high-quality service for both existing and future customers. Richard Wilson, CEO of interactive investor, will join abrdn as part of the Acquisition and lead interactive investor in its next phase of growth under abrdn's ownership.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Analysts and investors</span>\n</p>\n<p>\n<span>A presentation and Q&amp;A session for analysts and investors will take place at 12.00pm (GMT) on 2 December 2021 via conference call. To participate in the call please dial:</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>United Kingdom 0800 640 6441</span>\n</p>\n<p>\n<span>United Kingdom (Local) 020 3936 2999</span>\n</p>\n<p>\n<span>All other locations +44 20 3936 2999</span>\n</p>\n<p>\n<span>Access code: 574541</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The presentation and Q&amp;A session will be webcast live. Please go to</span>\n<span>\n<a href=\"https://www.abrdn.com/corporate/investors/acquisition-of-ii\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.abrdn.com/corporate/investors/acquisition-of-ii</a>\n</span>\n<span>to view the webcast and to download the slides accompanying the presentation. The webcast will also be made available for replay from 11.00am (GMT) on 3 December 2021.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Enquiries</span>\n</p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>abrdn plc</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Media</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Stephen Whitehead</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>07920 369595</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Iain Dey (Edelman Smithfield)</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>07976 295906</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Latika Shah (Edelman Smithfield</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>07950 671948</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Institutional equity investors and analysts</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Catherine Nash</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>07798 518657</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Retail equity investors</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Equiniti</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>*0371 384 2464</span>\n</p>\n</td>\n</tr>\n<tr>\n<td colspan=\"2\">\n<p>\n<span>* Calls may be monitored and/or recorded. Call charges will vary.</span>\n</p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Debt investors and analysts</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Graeme McBirnie</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>01313 727760</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Group Secretariat</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Kenneth Gilmour</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>07734 974073</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>J.P. Morgan Cazenove</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>+44 (0) 20 7742 4000</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>(Sole Financial Adviser)</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Conor Hillery</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Edward Squire</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Claire Brooksby</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Ravin Mehta</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n</td><td>\n</td><td>\n</td></tr>\n</tbody>\n</table></div>\n<p>\n<span>Important notice</span>\n</p>\n<p>\n<span>This announcement is not intended to, and does not constitute, or form part of, an offer to sell or an invitation to purchase or subscribe for any securities or a solicitation of any vote or approval in any jurisdiction. This announcement does not constitute a prospectus or a prospectus equivalent document. abrdn Shareholders are advised to read carefully the formal documentation in relation to the Acquisition once it has been despatched. Any response to the proposals should be made only on the basis of the information in the formal documentation to follow.</span>\n</p>\n<p>\n<span>Overseas jurisdictions</span>\n</p>\n<p>\n<span>The release, publication or distribution of this announcement in jurisdictions other than the United Kingdom may be restricted by law and therefore any persons who are subject to the laws of any jurisdiction other than the United Kingdom should inform themselves about, and observe, any applicable requirements. This announcement has been prepared for the purposes of complying with the Listing Rules and the information disclosed may not be the same as that which would have been disclosed if this announcement had been prepared in accordance with the laws and regulations of any jurisdiction outside of the United Kingdom.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Forward-looking statements</span>\n</p>\n<p>\n<span>Certain statements in this announcement are, or may be deemed to be, \"forward-looking statements\". Forward-looking statements are prospective in nature and are not based on historical facts, but rather on current expectations and projections of the management of abrdn and interactive investor about future events, and are therefore subject to risks and uncertainties which could cause actual results to differ materially from the future results expressed or implied by the forward-looking statements. Each forward-looking statement speaks only as of the date of the particular statement, and the events discussed herein may not occur.</span>\n</p>\n<p>\n<span>The forward-looking statements contained in this announcement include statements relating to the expected effects of the Acquisition on abrdn and interactive investor or the Enlarged Group (including their future prospects, developments and strategies), the expected timing and scope of the Acquisition and other statements other than historical facts. Often, but not always, forward-looking statements can be identified by the use of forward-looking words such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"is subject to\", \"budget\", \"projects\", \"strategy\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does not anticipate\", or \"believes\", or variations of such words and phrases or statements that certain actions, events or results \"may\", \"could\", \"should\", \"would\", \"might\" or \"will\" be taken, occur or be achieved. Although abrdn and interactive investor believe that the expectations reflected in such forward-looking statements are reasonable, abrdn and interactive investor can give no assurance that such expectations will prove to be correct.</span>\n</p>\n<p>\n<span>\n<span>By their nature, forward-looking statements involve risk and uncertainty because they are based on information available at the time they are made, including current expectations and assumptions, and relate to future events and/or depend on circumstances which may be or are beyond the abrdn Group's control, including among other things: UK domestic and global political, economic and business conditions (such as the UK's exit from the EU); market related risks such as fluctuations in interest rates and exchange rates, and the performance of financial markets generally; the impact of inflation and deflation; the impact of competition; the timing, impact and other uncertainties associated with future acquisitions, disposals or combinations undertaken by abrdn or its affiliates and/or within relevant industries; the value of and earnings from the abrdn Group's strategic investments and ongoing commercial relationships; default by counterparties; information technology or data security breaches (including the abrdn Group being subject to cyberattacks); operational information technology risks, including the abrdn Group's operations being highly dependent on its information technology systems (both internal and outsourced); natural or man made catastrophic events; the impact of pandemics, such as the COVID-19 (coronavirus) outbreak; climate change and a transition to a low carbon economy (including the risk that</span>\n</span>\n<span>\n<span>the abrdn Group may not achieve its targets); exposure to third party risks including as a result of outsourcing; the failure to attract or retain necessary key personnel; the policies and actions of regulatory authorities; and the impact of changes in capital, solvency or accounting standards, and tax and other legislation and regulations in the jurisdictions in which abrdn and its affiliates operate.</span>\n</span>\n</p>\n<p>\n<span>Neither abrdn and interactive investor, nor any of their respective associates or directors, officers or advisers, provides any representation, assurance or guarantee that the occurrence of the events expressed or implied in any forward-looking statements in this announcement will actually occur. You are cautioned not to place any reliance on these forward-looking statements. Other than in accordance with their legal or regulatory obligations, neither abrdn nor interactive investor is under any obligation, and abrdn and interactive investor expressly disclaim any intention or obligation, to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.</span>\n</p>\n<p>\n<span>No profit forecasts, estimates or quantified financial benefits statements</span>\n</p>\n<p>\n<span>No statement in this announcement is intended as a profit forecast, profit estimate or quantified financial benefits statement for any period and no statement in this announcement should be interpreted to mean that earnings or earnings per share for the Enlarged Group, abrdn and/or interactive investor for the current or future financial years would necessarily match or exceed the historical published earnings or earnings per share of abrdn or interactive investor.</span>\n</p>\n<p>\n<span>Rounding</span>\n</p>\n<p>\n<span>Certain figures included in this announcement have been subjected to rounding adjustments. Accordingly, figures shown for the same category presented in different tables may vary slightly and figures shown as totals in certain tables may not be an arithmetic aggregation of figures that precede them.</span>\n</p>\n<p>\n<span>Currency</span>\n</p>\n<p>\n<span>Unless otherwise indicated, all references in this document, to \"sterling\", \"pounds sterling\", \"GBP\" and \"£\" are to the lawful currency of the United Kingdom. abrdn prepares its financial statements in pounds sterling.</span>\n</p>\n<p>\n<span>Disclaimer</span>\n</p>\n<p>\n<span>J.P. Morgan Securities plc, which conducts its UK investment banking business as J.P. Morgan Cazenove (\"J.P. Morgan Cazenove\"), and which is authorised in the United Kingdom by the Prudential Regulation Authority (the \"PRA\") and regulated by the PRA and the FCA, is acting as financial adviser exclusively for abrdn and no one else in connection with the Acquisition and will not regard any other person as its client in relation to the Acquisition and will not be responsible to anyone other than interactive investor for providing the protections afforded to clients of J.P. Morgan Cazenove or its affiliates, nor for providing advice in relation to the Acquisition or any other matter or arrangement referred to herein.</span>\n</p>\n<p>\n<span>LEI number of abrdn plc: 0TMBS544NMO7GLCE7H90</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>APPENDIX I</span>\n</p>\n<p>\n<span>PRINCIPAL TERMS OF THE ACQUISITION</span>\n</p>\n<p>\n<span>Principal agreements in connection with the Acquisition</span>\n</p>\n<p>\n<span>\n<span>SPA</span>\n</span>\n<span>\n<span>\n</span>\n</span></p>\n<p>\n<span>interactive investor is the holding company of the interactive investor Group. Currently, c.95.2 per cent. of interactive investor's shares are held by Antler Holdco Limited (\"Antler\"), a Guernsey-incorporated company controlled by J.C. Flowers IV L.P. (the \"J.C. Flowers Fund\").</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>On 2 December 2021, abrdn and the Initial Sellers entered into the SPA to give effect to the Acquisition. The Initial Sellers include the J.C. Flowers Fund, MMC and key members of interactive investor's management team, Richard Wilson (Chief Executive Officer), Barry Bicknell (Chief Finance Officer), John Tumilty (Chief Technology Officer) and Gary Shaw (Director of Operations) (together, the \"Management Sellers\"). The Initial Sellers own the majority of the issued share capital in Antler.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Pursuant to the SPA, the Initial Sellers have agreed to sell their shares in Antler to abrdn. After the signing of the SPA and before Completion: (i) the Management Sellers have agreed to take certain steps (and the J.C. Flowers Fund and MMC have agreed, if necessary, to invoke their drag rights) to transfer the shares of the other Antler shareholders to abrdn; and (ii) J.C. Flowers and the Management Sellers have agreed to procure that Antler takes certain steps (including, if necessary, by invoking its drag rights) to transfer the c.4.8 per cent. of the shares of interactive investor held by minority shareholders to Antler.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Consideration</span>\n</p>\n<p>\n<span>The purchase price for 100 per cent. of the Antler shares and all of the c.4.8 per cent. minority shares in interactive investor is £1.49 billion in cash. The purchase price is subject to: (i) a locked box adjustment from 30 September 2021; and (ii) a regulatory capital adjustment, which is equal to two times the difference between the actual minimum regulatory capital requirement as at 31 March 2022 and £48 million. The maximum regulatory capital adjustment (in either direction) will be £20 million. As a result, the total deal consideration will be in the range of £1.47 billion to £1.51 billion.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Antler has outstanding discount notes in issue, which will be redeemed at Completion. The redemption amount will be funded by abrdn and will be deducted from the purchase price to be paid by abrdn at Completion.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Conditions and break fee</span>\n</p>\n<p>\n<span>Completion under the SPA is subject to the satisfaction of certain customary conditions, including: the approval of the Acquisition by abrdn Shareholders at the General Meeting to be convened pursuant to the notice of meeting to be set out in the Circular</span>\n<span>(the \"Shareholder Approval Condition\"); the approval of the FCA and the Competition and Markets Authority; and certain material adverse events not having occurred in respect of the interactive investor Group by Completion.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The SPA requires that abrdn ensures that its directors provide a unanimous recommendation to its shareholders to approve the Acquisition. This obligation is subject to a carve-out allowing the directors not to provide such recommendation (or to withdraw such recommendation once made) if required by the directors' fiduciary duties. However, if the Shareholder Approval Condition has not been satisfied by the longstop date in circumstances where the directors have exercised their right to withhold or withdraw their recommendation of the Acquisition to its shareholders, abrdn would be required to pay a break fee of £7.5 million in cash to the Initial Sellers.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Warranties, and</span>\n</span>\n<span>\n<span>warranty and indemnity insurance</span>\n</span>\n</p>\n<p>\n<span>The SPA contains title and capacity warranties. The liability of the Initial Sellers for any breach of warranty under the SPA is subject to customary limitations and exclusions.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The Management Warrantors have agreed to give fundamental and business warranties under a separate Management Warranty Deed. The Management Warrantors' liability for any breach of these warranties is limited by (among other things) an aggregate financial cap of £1, which is customary for deals with warranty and indemnity insurance.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The warranties under the Management Warranty Deed and the SPA are backed by warranty and indemnity insurance. The liability of the insurers under the warranty and indemnity insurance is subject to further limitations and exclusions in addition to those contained in the Management Warranty Deed and the SPA. In particular, there is an overall cap on liability of £375 million.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>APPENDIX II</span>\n</p>\n<p>\n<span>SOURCES OF INFORMATION AND BASES OF CALCULATION</span>\n</p>\n<p>\n<span>In this Announcement, unless otherwise stated:</span>\n</p>\n<p>\n<span>·</span>\n<span>All financial information presented other than financial information in respect of the abrdn Group, reflects reported results for interactive investor, which is the holding company of the interactive investor Group. Currently, c.95.2 per cent. of interactive investor's shares are held by Antler;</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>Information on net flows, revenue, expenses and adjusted profit before tax with respect to the years ended 31 December 2018 - 2020 relating to interactive investor is from audited financial accounts at the time of this announcement;</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>Information on customers, daily average retail trades and AUA with respect to the years ended 31 December 2018 - 2020 relating to interactive investor is from unaudited management accounts at the time of this announcement;</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>Information on customers, net flows and AUA is in relation to customers, net flows and AUA on the interactive investor platform; and</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>Information with respect to the 12 months ended 30 June 2021 relating to interactive investor is from unaudited management accounts at the time of this announcement.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>APPENDIX III</span>\n</p>\n<p>\n<span>DEFINITIONS</span>\n</p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>\"abrdn\"</span>\n</p>\n</td>\n<td>\n<p>\n<span>abrdn plc or the abrdn Group, in each case as the context may require;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\"abrdn Group\"</span>\n</p>\n</td>\n<td>\n<p>\n<span>abrdn plc and its subsidiaries and subsidiary undertakings from time to time, and where the context permits, each of them;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\"abrdn Shareholder(s)\"</span>\n</p>\n</td>\n<td>\n<p>\n<span>holders of the shares in abrdn;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\" <span>Acquisition</span> \"</span>\n</p>\n</td>\n<td>\n<p>\n<span>the proposed acquisition of interactive investor by abrdn, as effected by the transaction structuring described in Appendix I;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\" <span>Antler</span> \"</span>\n</p>\n</td>\n<td>\n<p>\n<span>Antler Holdco Limited;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\" <span>AUA</span> \"</span>\n</p>\n</td>\n<td>\n<p>\n<span>assets under administration;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\" <span>AUMA</span> \"</span>\n</p>\n</td>\n<td>\n<p>\n<span>assets under management and administration;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\" <span>Circular</span> \"</span>\n</p>\n</td>\n<td>\n<p>\n<span>the circular to be issued by abrdn setting out further details of the Acquisition and containing a notice convening the General Meeting;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\" <span>Completion</span> \"</span>\n</p>\n</td>\n<td>\n<p>\n<span>completion of the Acquisition;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\" <span>Enlarged Group</span> \"</span>\n</p>\n</td>\n<td>\n<p>\n<span>the enlarged group of companies which will, following Completion, comprise the abrdn Group, Antler and the interactive investor Group;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\" <span>Exceptional Items</span> \"</span>\n</p>\n</td>\n<td>\n<p>\n<span>items of income or expenditure that are significant in size and which are not expected to repeat over the short to medium term;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\"FCA\"</span>\n</p>\n</td>\n<td>\n<p>\n<span>the Financial Conduct Authority;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\" <span>General Meeting</span> \"</span>\n</p>\n</td>\n<td>\n<p>\n<span>the general meeting of shareholders of abrdn to be convened to approve the Acquisition;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\"IFPR\"</span>\n</p>\n</td>\n<td>\n<p>\n<span>the Investment Firms Prudential Regime</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\" <span>Initial</span>\n<span>Sellers</span> \"</span>\n</p>\n</td>\n<td>\n<p>\n<span>the J.C. Flowers Fund, MMC, and other investors, together with the Management Sellers;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\"interactive investor\"</span>\n</p>\n</td>\n<td>\n<p>\n<span>interactive investor Limited;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\"interactive investor Group\"</span>\n</p>\n</td>\n<td>\n<p>\n<span>Interactive investor and its subsidiaries and subsidiary undertakings from time to time and where the context permits, each of them;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\"J.C. Flowers &amp; Co.\"</span>\n</p>\n</td>\n<td>\n<p>\n<span>J.C. Flowers &amp; Co;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\"J.C. Flowers Fund\"</span>\n</p>\n</td>\n<td>\n<p>\n<span>J.C. Flowers IV L.P.;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\" <span>J.P. Morgan Cazenove</span> \"</span>\n</p>\n</td>\n<td>\n<p>\n<span>J.P. Morgan Securities plc, which conducts its UK investment banking business as J.P. Morgan Cazenove;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\" <span>Listing Rules</span> \"</span>\n</p>\n</td>\n<td>\n<p>\n<span>the listing rules, made by the Financial Conduct Authority under Part 6 of the Financial Services and Markets Act 2000, as amended from time to time;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\"Management Sellers\"</span>\n</p>\n</td>\n<td>\n<p>\n<span>Richard Wilson, Barry Bicknell, John Tumilty and Gary Shaw;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\"Management Warrantors\"</span>\n</p>\n</td>\n<td>\n<p>\n<span>Richard Wilson, Barry Bicknell, Chris Horner, Gary Shaw, John Tumilty and Libby Jones</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\" <span>Management Warranty Deed</span> \"</span>\n</p>\n</td>\n<td>\n<p>\n<span>the management warranty deed entered into between abrdn and the Management Warrantors on 2 December 2021;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\"MMC\"</span>\n</p>\n</td>\n<td>\n<p>\n<span>means, collectively, MMC GP Scale-Up I LLP, MMC Scale-Up Fund 2019 LP and Mainspring Nominees (2) Limited;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\"PRA\"</span>\n</p>\n</td>\n<td>\n<p>\n<span>the Prudential Regulation Authority;</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\"Shareholder Approval Condition\"</span>\n</p>\n</td>\n<td>\n<p>\n<span>the approval of the Acquisition by abrdn Shareholders at the General Meeting to be convened pursuant to the notice of meeting to be set out in the Circular; and</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\" <span>SPA</span> \"</span>\n</p>\n</td>\n<td>\n<p>\n<span>the sale and purchase agreement entered into between abrdn and the Initial Sellers and Antler on 2 December 2021.</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<a href=\"#_ftnref1\">[1]</a>\n</span>\n<span>Subject to a locked box adjustment and a regulatory capital adjustment</span>\n</p>\n<p>\n<span>\n<a href=\"#_ftnref2\">[2]</a>\n</span>\n<span>Second largest direct investing platform by AUA, as at 30 June 2021</span>\n</p>\n<p>\n<span>\n<a href=\"#_ftnref3\">[3]</a>\n</span>\n<span>As at 30 June 2021</span>\n</p>\n<p>\n<span>\n<a href=\"#_ftnref4\">[4]</a>\n</span>\n<span>As at 30 June 2021</span>\n</p>\n<p>\n<span>\n<a href=\"#_ftnref5\">[5]</a>\n</span>\n<span>As at 30 June 2021</span>\n</p>\n<p>\n<span>\n<a href=\"#_ftnref6\">[6]</a>\n</span>\n<span>In percentage terms</span>\n</p>\n<p>\n<span>\n<a href=\"#_ftnref7\">[7]</a>\n</span>\n<span>As at 30 September 2021</span>\n</p>\n<p>\n<span>\n<a href=\"#_ftnref8\">[8]</a>\n</span>\n<span>As at 30 June 2021</span>\n</p>\n<p>\n<span>\n<a href=\"#_ftnref9\">[9]</a>\n</span>\n<span>Fee based revenue for interactive investor is revenue net of cost of sales, and comparable to the fee based alternative performance measure used by abrdn</span>\n</p>\n<p>\n<span>\n<a href=\"#_ftnref10\">[10]</a>\n</span>\n<span>Last twelve months to 30 June 2021</span>\n</p>\n<p>\n<span>\n<a href=\"#_ftnref11\">[11]</a>\n</span>\n<span>Last twelve months to 30 June 2021 for abrdn, and twelve months to 31 December 2020 for interactive investor</span>\n</p>\n<p>\n<span>\n<a href=\"#_ftnref12\">[12]</a>\n</span>\n<span>Fundscape, D2C channel assets. Refers to period</span>\n<span>between 30 June 2015 to 30 June 2021</span>\n</p>\n<p>\n<span>\n<a href=\"#_ftnref13\">[13]</a>\n</span>\n<span>Last twelve months to 30 June 2021</span>\n</p>\n<p>\n<span>\n<a href=\"#_ftnref14\">[14]</a>\n</span>\n<span>Profit before Exceptional Items, amortisation of acquisition intangibles and tax. Includes £4.7 million of other income</span>\n</p>\n<p>\n<span>\n<a href=\"#_ftnref15\">[15]</a>\n</span>\n<span>\n<span>Twelve months to 31 December 2018</span>\n</span></p>\n<p>\n<span>\n<a href=\"#_ftnref16\">[16]</a>\n</span>\n<span>Twelve months to 31 December 2020</span>\n</p>\n<p>\n<span>\n<a href=\"#_ftnref17\">[17]</a>\n</span>\n<span>Last twelve months to 30 June 2021</span>\n</p>\n<p>\n<span>\n<a href=\"#_ftnref18\">[18]</a>\n</span>\n<span>\n<span>Last twelve months to 30 June 2021 for abrdn, and twelve months to 31 December 2020 for interactive investor</span>\n</span></p>\n<p>\n<span>\n<a href=\"#_ftnref19\">[19]</a>\n</span>\n<span>In percentage terms</span>\n</p>\n<p>\n<span>\n<a href=\"#_ftnref20\">[20]</a>\n</span>\n<span>In percentage terms</span>\n</p>\n<p>\n<span>\n<a href=\"#_ftnref21\">[21]</a>\n</span>\n<span>As at 30 September 2021</span>\n</p>\n<p>\n<span>\n<a href=\"#_ftnref22\">[22]</a>\n</span>\n<span>As at 30 June 2021</span>\n</p>\n<p>\n<span>\n<a href=\"#_ftnref23\">[23]</a>\n</span>\n<span>As at 30 June 2021, refers to FTEs, excluding The Share Centre FTEs</span>\n</p>\n<p>\n<span>\n<a href=\"#_ftnref24\">[24]</a>\n</span>\n<span>\n<span>Revenue is gross of cost of sales</span>\n</span></p>\n<p>\n<span>\n<a href=\"#_ftnref25\">[25]</a>\n</span>\n<span>Adjusted profit before tax refers to profit before Exceptional Items, amortisation of acquisition intangibles and tax. FY 2020 includes £4.7 million of other income</span>\n</p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>ACQTTBMTMTTMBAB</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}