{"date": "2021-11-07 16:13:36.330000+00:00", "ticker": "III", "mrkt_info": {"open": 1378.0, "close": 1365.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Evos Hamburg GmbH through its subsidiary Evos Finance BV, has completed the acquisition of 100% stake in four terminals located in Amsterdam, Terneuzen, Ghent and Malta, from 3i Infrastructure plc and Oiltanking GmbH</p><p>The acquisition has been funded through a capital increase at Evos by First Sentier and additional debt financing</p></div><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">Deal In Brief</p><p>Under the transaction, 3i Infrastructure has divested 45% stake and Oiltanking has divested 55% stake in four terminals, respectively</p><p>The Amsterdam and Terneuzen terminals have a tank capacity of 1,701,937 cbm and 511,187 cbm located in Netherlands. The Ghent terminal has a tank capacity of 899,473 cbm located in Belgium. The Malta terminals has a tank capacity of 568,380 cbm</p><p>Clifford Chance LLP acted as legal advisor to 3i Infrastructure and Oiltanking in the transaction. The transaction is in line with Evos' vision and First Sentier ́s long term infrastructure investment philosophy to create a tank storage platform with presence in the key European liquid bulk hubs</p><p>Marcus Ayre, Head of Infrastructure Investments Europe of First Sentier Investors said \"We are delighted to have reached an agreement on the acquisition of the terminals in Amsterdam, Terneuzen, Ghent and Malta. This diversified portfolio of world-class liquid bulk storage terminals provides an excellent fit with First Sentier's existing platform, Evos, and with our long-term infrastructure investment philosophy. We look forward to working with the incumbent management team and employees to continue to develop and grow the combined business.\" Koert Schouten, CFO of Evos, said, \"We welcome the terminals in Amsterdam, Terneuzen, Ghent and Malta to our platform. Evos will now have a total capacity of 6.2 million cbm across its 8 terminals for the storage of oil products, chemicals, and renewable fuels. We will continue our drive for safety and service excellence. Our increased scale will enable us to provide an even better service offering to our customers and will facilitate the pursuit of energy transition opportunities, together with our customers, in line with our ambition to be a frontrunner in new sustainable energy products.\" Richard Laing, Chair of 3i Infrastructure, commented, \"3i Infrastructure was a pioneer among infrastructure investors into the liquids storage sector 14 years ago and Oystercatcher has proven a good investment for the Company over that period. Now is an appropriate time for the four European terminals to move to new ownership, well-placed to support them into the future.\" Matti Lievonen, CEO of Oiltanking, said, \"The divestment of our four European terminals is in line with Oiltanking's strategy 2025 as we shift our portfolio and focus on gas, chemicals and new energy. Together with our partner 3i Infrastructure we have invested into the expansion and upgrading of our terminals and improved their environmental and safety performance. Driven by our commitment to apply a best-owner mindset we are confident the terminals are well placed to provide a perfect match with Evos' asset portfolio.\" Deal history Update 1: On September 23, 2021, Evos Hamburg has entered into a binding agreement to acquire 100% stake in four terminals located in Amsterdam, Terneuzen, Ghent and Malta, from 3i Infrastructure and Oiltanking</p><p>Announced: On July 22, 2021, Evos Hamburg has entered into an agreement to acquire 100% stake in four terminals located in Amsterdam, Terneuzen, Ghent and Malta, from 3i Infrastructure and Oiltanking.</p><div class=\"story-table-container\"><table class=\"story-basic-table\"><tbody><tr><td>Deal Type</td><td>Acquisition</td> </tr><tr><td>Sub-Category</td><td>Asset Purchase</td> </tr><tr><td>Deal Status</td><td>Completed: 2021-10-29</td> </tr> </tbody> </table></div><p class=\"tr-npp-section-title\">Deal Participants</p><div class=\"story-table-container\"><table class=\"story-basic-table\"><tbody><tr><td>Acquirer (Company)</td><td>Evos Hamburg GmbH</td> </tr><tr><td>Vendor (Company)</td><td>Oiltanking GmbH</td> </tr> </tbody> </table></div><p class=\"tr-npp-section-title\">Deal Rationale</p><p>The transaction is in line with Evos' vision and First Sentier ́s long term infrastructure investment philosophy to create a tank storage platform with presence in the key European liquid bulk hubs.</p><div class=\"story-table-container\"><table class=\"story-basic-table\"><tbody><tr><td>% Acquisition</td><td>100%</td> </tr> </tbody> </table></div><p><span>(Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. Marketline shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.)</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 Marketline. All rights reserved.</p></div>"}