{"date": "2021-11-16 12:01:18.074000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\">\n<li><span><strong>Arcology Team Advances Development To Create Seamless Environment for Ethereum Developers</strong></span></li>\n<li><span><strong>Arcology Code Advanced to Cover all Ethereum Layer 2 Solutions</strong></span></li>\n<li><span><strong>Arcology Team Will Release the AWS Testnet Results Soon</strong></span></li>\n</ul>\n<p><strong>VANCOUVER, BC / ACCESSWIRE / November 16, 2021 / Codebase Ventures Inc.</strong> (\"Codebase\" or the \"Company\") (CSE:CODE)(FSE:C5B)(OTCQB:BKLLF) is pleased to announce that Mr. Laurent Zhang, Founder and President of Arcology, in which CODE has an investment, has provided an update on Arcology's progress.</p>\n<p>\"Over the last 2 months Arcology's development team has made some very important updates to the original design,\" noted Mr. Laurent Zhang. \"30% of the Arcology code has been re-written to cover some key functionalities of Ethereum Layer 2 (L2) scaling solutions.\"</p>\n<p>L2 has been of one the hottest topics in the blockchain world. With L2, different Ethereum applications can run in parallel. Many believe L2 can solve the Ethereum scalability issue.</p>\n<p>But L2 suffers a major drawback; they aren't ‘composable,' which makes it inherently difficult for different L2s to interact with each other. But applications like DeFi needs composability. There are some workarounds but no native way to do it. Arcology is now fully composable and therefor offers developers an advantage.</p>\n<p>\"Arcology is more scalable than L2 Ethereum solutions without having L2 related problems. We spent the last couple of months working on some design details of Arcology. To test the latest update, we deployed Uniswap V2 on Arcology to see how it worked and results met or exceeded our objectives,\" said Mr. Zhang.</p>\n<p>This advance means that in order to use previous versions and fully utilize Arcology design advantages, developers would have had to make some changes to their source code. The original Ethereum applications could have run on Arcology with no modification but generally the performance gains would have been limited.</p>\n<p>\"For developers, changing some code in the smart contracts requires additional effort. Using Arcology in its updated form, developers can simply redeploy whatever they have to Arcology, and the system makes it seamless, without the requirement to change any code,\" continued Mr. Zhang.</p>\n<p>With the latest version of Arcology, Ethereum developers no longer need to make any change to their smart contracts. Once they move their applications to Arcology, they will experience significant performance gains right away.</p>\n<p>The latest version is expected to significantly lower the barriers to entry for Ethereum developers to move to Arcology once its mainnet is finally launched. The Arcology technical team has started a large-scale test on Amazon AWS and will to release the test results soon.</p>\n<p><strong>About Codebase Ventures Inc.</strong></p>\n<p>Codebase Ventures Inc. seeks early-stage investments in emerging technology sectors, including the blockchain ecosystem and fintech. The Company identifies such opportunities and applies its relationships and capital to advance its interests.</p>\n<p>For further information, please contact:</p>\n<p>George Tsafalas - Ivy Lu<br/>\nInvestor Relations<br/>\nTelephone: Toll-Free (877) 806-CODE (2633) or 1 (778) 806-5150<br/>\nE-mail: <a href=\"mailto:IR@codebase.ventures\" data-type=\"email\" translate=\"no\">IR@codebase.ventures</a></p>\n<p>Neither the Canadian Securities Exchange nor its Regulation Services Provider (as that term is defined in the policies of the Canadian Securities Exchange) accepts responsibility for the adequacy or accuracy of this release.</p>\n<p><strong>Forward Looking Statements</strong></p>\n<p>Certain information set forth in this news release may contain forward-looking statements that involve substantial known and unknown risks and uncertainties. All statements other than statements of historical fact are forward-looking statements, including, without limitation, statements regarding future financial position, business strategy, use of proceeds, corporate vision, proposed acquisitions, partnerships, joint-ventures and strategic alliances and co-operations, budgets, cost and plans and objectives of or involving the Company. Such forward-looking information reflects management's current beliefs and is based on information currently available to management. Often, but not always, forward-looking statements can be identified by the use of words such as \"plans\", \"expects\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"predicts\", \"intends\", \"targets\", \"aims\", \"anticipates\", \"may\" or \"believes\" or variations (including negative variations) of such words and phrases or may be identified by statements to the effect that certain actions \"may\", \"could\", \"should\", \"would\", \"might\" or \"will\" be taken, occur or be achieved. A number of known and unknown risks, uncertainties and other factors may cause the actual results or performance to materially differ from any future results or performance expressed or implied by the forward-looking information. These forward-looking statements are subject to numerous risks and uncertainties, certain of which are beyond the control of the Company including, but not limited to, the impact of general economic conditions, industry conditions, risks relating to epidemics or pandemics such as COVID-19, including the impact of COVID-19 on the Company's business, financial condition and results of operations, lack of investor demand for Bitcoin and/or Bitcoin futures exchange traded funds, and dependence upon regulatory approvals. Readers are cautioned that the assumptions used in the preparation of such information, although considered reasonable at the time of preparation, may prove to be imprecise and, as such, undue reliance should not be placed on forward-looking statements. The Company does not assume any obligation to update or revise its forward-looking statements, whether as a result of new information, future events, or otherwise, except as required by securities laws.</p>\n<p><strong>SOURCE:</strong> Codebase Ventures Inc.</p>\n<br/>\n<br/>\nView source version on accesswire.com:<br/>\n<a href=\"https://www.accesswire.com/673056/Codebase-Receives-Progress-Update-From-Arcology\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.accesswire.com/673056/Codebase-Receives-Progress-Update-From-Arcology</a><br/>\n<br/>\n<div class=\"tr-image\"><div class=\"tr-image-components\"><img height=\"0\" src=\"https://www.accesswire.com/img.ashx?id=673056\" width=\"0\"/></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright 2021 ACCESSWIRE. All Rights Reserved.</p></div>"}