{"date": "2022-01-12 14:10:47.401000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>CELLEBRITE DI LTD (\"CLBT-Q\")\n- Joins AWS Partner Network as an Advanced Technology Partner\n\n     Cellebrite (Nasdaq: CLBT), a global leader in Digital Intelligence\n(DI) solutions for the public and private sectors, announced that it has\njoined the AWS Partner Network (APN) as an Advanced Technology Partner and\nis providing Cellebrite Guardian, an investigative digital evidence\nmanagement solution designed specifically for investigators, examiners, and\nattorneys, on Amazon Web Services (AWS). Cellebrite Guardian is the latest\noffering in Cellebrite's end-to-end investigative DI Platform designed to\nhelp public safety agencies and enterprises modernize their investigative\nworkflow.\n\n     By joining the APN, Cellebrite gains access to a community of over\n10,000 Partners in 150 countries using AWS to build solutions and services\nfor customers across a range of different sectors and disciplines. Access\nto the APN's joint go-to-market programs, expertise, and resources will\nsupport Cellebrite's ability to expand its portfolio of cloud-based\nsolutions that help customers reduce risk, increase collaboration, and\ndrive down storage, hardware, and system maintenance costs.\n\n     Ryan Reynolds, US Justice and Public Safety Leader at AWS, said: \"We\nwelcome Cellebrite into our AWS Partner Network where customers will find\nan industry-leading solution that allows them to securely manage,\ncollaborate, and gain insights from digital evidence as part of their\ninvestigative efforts.\"\n\n     Leeor Ben-Peretz, Chief Strategy Officer at Cellebrite, commented:\n\"Introducing new market-leading DI solutions in the cloud is a significant\narea of focus for Cellebrite. The AWS Partner Network will enable us to\nscale quickly and meet growing customer demands for cloud-based\ninvestigative solutions.\"\n\n     Cellebrite and AWS customer, Joshua Lee, a police sergeant in the City\nof Mesa (Arizona) Police Department, said: \"Using Cellebrite Guardian to\nmanage chain of custody for physical evidence and digital evidence, while\nstreamlining every step throughout the workflow, makes it an essential\nsolution for conducting effective investigations and accelerating time to\naction. The transformational change from paper and USB drives to Cellebrite\nGuardian will directly and positively impact the ability of investigative\nteams to optimize resources. Guardian is flexible and can be adapted to any\nworkflow, helping to eliminate manual processes, and allows investigators\nto review findings in real-time. It is great that two industry leaders have\nteamed up to provide an essential solution when backlogs are just getting\nlonger.\"\n\n     For more information on Cellebrite Guardian, please visit here.\n\n     About Cellebrite\nCellebrite's (Nasdaq: CLBT) mission is to enable its customers to protect\nand save lives, accelerate justice, and preserve privacy in communities\naround the world. We are a global leader in Digital Intelligence solutions\nfor the public and private sectors, empowering organizations in mastering\nthe complexities of legally sanctioned digital investigations by\nstreamlining intelligence processes. Trusted by thousands of leading\nagencies and companies worldwide, Cellebrite's Digital Intelligence\nplatform and solutions transform how customers collect, review, analyze and\nmanage data in legally sanctioned investigations.\n\n     To learn more visit us at www.cellebrite.com and\n<a href=\"https://investors.cellebrite.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://investors.cellebrite.com</a>.\n\n     Caution Regarding Forward Looking Statements\n\n     This document includes \"forward looking statements\" within the meaning\nof the \"safe harbor\" provisions of the United States Private Securities\nLitigation Reform Act of 1995. Forward-looking statements may be identified\nby the use of words such as \"forecast,\" \"intend,\" \"seek,\" \"target,\"\n\"anticipate,\" \"believe,\" \"could,\" \"continue,\" \"expect,\" \"estimate,\" \"may,\"\n\"plan,\" \"outlook,\" \"future\" and \"project\" and other similar expressions\nthat predict, project or indicate future events or trends or that are not\nstatements of historical matters. Such forward looking statements include\nestimated financial information. Such forward looking statements with\nrespect to revenues, earnings, performance, strategies, prospects, and\nother aspects of the business of Cellebrite are based on current\nexpectations that are subject to risks and uncertainties. A number of\nfactors could cause actual results or outcomes to differ materially from\nthose indicated by such forward looking statements. These factors include,\nbut are not limited to: Cellebrite's ability to develop technologically\nadvanced solutions and successfully integrate with the software solutions\nused by customers; acceptance of solutions by customers; errors, failures,\ndefects or bugs in solutions; a failure to maintain sales and marketing\npersonnel productivity or hire, integrate and retain additional sales and\nmarketing personnel; the impact of the global COVID-19 pandemic; the impact\nof competition on pricing and on Cellebrite's market share; sub-optimal\nresults from products due to misuse by customers; Cellebrite's failure to\nmaintain and enhance its reputation and brand; inaccuracy of the estimates\nof Cellebrite's market opportunity and forecasts of market growth; changes\nto packaging and licensing models that adversely affect the ability to\nattract or retain customers; failure to manage future growth effectively;\nfailure to introduce new solutions and add-ons; issues in the use of\nartificial intelligence resulting in reputational harm or liability; the\nneed for additional capital to support the growth of Cellebrite's business;\na failure to maintain the security of operations and the integrity of\nsoftware solutions; the impact of government budgeting cycles and\nappropriations, early termination, audits, investigations, sanctions and\npenalties; a decline in government budgets, changes in spending or\nbudgetary priorities, or delays in contract awards; a failure to adequately\nobtain, maintain, protect and enforce Cellebrite's intellectual property or\ninfringement of the intellectual property rights of others; perceptions or\ncourt or regulatory decisions that Cellebrite's solutions violate privacy\nrights; the use of solutions by customers in a way that is, or that is\nperceived to be, incompatible with human rights; failure to comply with\nlaws regarding privacy, data protection and security, technology\nprotection, sanctions, export controls and other matters; and other\nfactors, risks and uncertainties set forth in the sections titled \"Risk\nFactors\" and \"Cautionary Note Regarding Forward-Looking Statements\" in the\nfinal proxy statement/prospectus relating to Cellebrite's consummated\nbusiness combination filed with the SEC on August 5, 2021 and in other\ndocuments filed by Cellebrite with the SEC, which are available free of\ncharge at www.sec.gov. You are cautioned not to place undue reliance upon\nany forward-looking statements, which speak only as of the date made, in\nthis communication or elsewhere. Cellebrite undertakes no obligation to\nupdate its forward-looking statements, whether as a result of new\ninformation, future developments or otherwise, should circumstances change,\nexcept as otherwise required by securities and other applicable laws.\n\nInvestors\nAnat Earon-Heilborn\nVP Investor Relations\n+972 73 394 8440\ninvestors@cellebrite.com\n\n\nWWW   : <a href=\"https://www.cellebrite.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.cellebrite.com</a>    CELLEBRITE DI LTD\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201100204.MNPRE2201101049-05572820220112</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}