{"date": "2022-02-19 07:46:00.059000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3093.05, "close": 3003.95}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Feb. 19 -- Amazon has announced 'Soundbar Days' for all the music and entertainment enthusiasts bringing together a host of exciting deals on a range of soundbars, music systems, accessories and much more. Customers can great offers on soundbars from popular brands such as boAt JBL, Sony, Blaupunkt and more. 'Soundbar Days' will be live on Amazon.in until 20th February 2022.</p><p>Customers can get up to 55% off on Soundbars with Adaptive Sound Control, Wireless subwoofer, Bluetooth Streaming, Versatile Connectivity and TV Sound Sync which provides a High-Fidelity Sound experience.</p></div><div class=\"tr-npp-body\"><p>Moreover, customers can also get up to Rs.1,500 instant discount on EMI transactions via Citi Bank &amp; Yes Bank credit cards. Additionally, they can also avail no-cost EMI and exchange offers with a price drop on select models.</p><p>Here are some popular soundbars and accessories on offers:</p><p>boAt Aavante Bar 1800</p><p>The soundbar with its premium finish adds to the beauty of your home as much as it adds to the immersive auditory experience. All your devices are made accessible by the wireless and wired forms of connectivity, such as Bluetooth V5.0/AUX/USB/Optical/Coaxial and HDMI(ARC) with the versatile Aavante Bar 1800. Its 2.1 Channel captivating sound gets you set for an alternate dimension, with an ethereal sound quality that adds colour to your audio as well as visual experience. Get this at just Rs.7,999.</p><p>Sony HT-S20R</p><p>It has a 5.1 separate audio channels with Dolby Digital. 5.1 channels of real surround sound. Rear speakers and an external subwoofer work with a 3-ch soundbar to deliver dynamic, immersive, cinematic sound. Easily play your favourite content via bluetooth connectivity. button for every sound-choose the mode that's right for whatever you're watching or listening to, including Auto, Standard, Cinema and Music. You can also select Night and Voice modes. Get this at just Rs.17,990.</p><p>JBL Cinema SB110</p><p>It comes with 110-Watt power output. It is embedded with Dolby Digital and has a built-in subwoofer for deep bass. It offers one cable connection with HDMI ARC. With HDMI ARC that allows for a simple and hassle-free setup to your compatible HDTV, you can simplify your setup. HDMI ARC (Audio Return Channel) provides a high-speed connection to compatible devices with a single cable. Get this just at Rs.8,499.</p><p>boAt Aavante Bar 1700D</p><p>Its 2.1 Channel captivating sound with Dolby Digital / Digital Plus technology gets you set for an alternate dimension, with an ethereal sound quality that adds colour to your audio as well as visual experience. Experience the boAt Signature sound with the 60W R.M.S premium audio delivered by AAVANTE BAR 1700D and its 60W Wired Subwoofer at just Rs.10,990.</p><p>Blaupunkt Germany's SBW200</p><p>It features a 2.1 channel surround sound system. It is equipped with an 8-inch subwoofer and offers multiple connectivity options. It also features a built-in surround sound feature. The soundbar has an elegant design with a wooden subwoofer that can go really well for a premium look. It has multiple connectivity options including HDMI ARC, USB, Bluetooth and AUX. Get this just at Rs.7,999. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}