{"date": "2022-01-20 17:52:30.503000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3125.98, "close": 2852.86}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Every day, we scour Amazon to find the best deals available. Whether it's something for your kitchen or top-rated tech to give your smart home an upgrade, the online shopping giant offers some of the best prices on a  <span>very</span> wide range of items. Whatever you need, Amazon has you covered.</p></div><div class=\"tr-npp-body\"><p><span><span>Get deals and shopping advice delivered straight to your phone.</span> Sign up for text message alerts from the experts at Reviewed.</span> </p><p>Below, you'll find our top Amazon deals right now, including one of our favorite coffee grinders, some charging and connection accessories and a comfy gaming headset, all of which have been vetted by our team of deals experts to make sure they're \"best of web\" prices. </p><p>► <span>Valentine's Day gifts: </span> 20 amazing gifts for women that are romantic and thoughtful.</p><p>► <span>Cloth masks are no longer recommended to protect against the omicron variant: </span> Here's how to find the best KN95 masks for kids and N95 masks are your best mask option—here's where to buy them online</p><p>If you're not already an Amazon Prime subscriber, you can sign up for a 30-day membership for free. An Amazon Prime subscription gets you free two-day shipping and tons of other benefits for $12.99 a month ($6.49 for students and $5.99 for those receiving qualifying government assistance).</p><p class=\"tr-npp-section-title\">The best Amazon deals of the day</p><p><big>1. Up to 40% off: These compact charging accessories</big> </p><p>Keep your essential electronics fully juiced with these Anker charging and connectivity accessories on sale at Amazon. Power up at any wall outlet with the brand's Nano II 30-watt USB C charger, typically listed for $33.99 but now available for $24.99. Anker said the device is compatible with the latest iPhone models, the iPad, the Samsung Galaxy S8 and later Galaxy S models, plus the MacBook Air. You can charge your phone upright with the Anker PowerWave magnetic wireless charger, normally priced at $49.99 but now selling for $33.99. The brand says you can attach iPhone 13 or 12 models to the magnetic stand either vertically or horizontally so you can see notifications or watch videos while it charges. </p><p><span>Save up to 40% on Anker charging and connectivity accessories</span> </p><p><big>2. 47% off: These stylish earbuds</big> </p><p>There are few earbuds as striking as the Samsung Galaxy Buds Live. Typically listed for $169.99, these bean-shaped buds are now on sale for an $80 price cut at $89.99. When we tested the compact buds, our tester said these \"chubby, metallic caterpillars\" have a fit that may not work for every set of ears. Still, the output of the Buds Live offers a rich and satisfying sound with a bevy of features, including an EQ preset dial to adjust specifics and transparency mode to let in more environmental sound. </p><p><span>Get the Samsung Galaxy Buds Live for $89.99 (Save $80)</span> </p><p><big>3. Up to 67% off: These cozy down jackets</big> </p><p>Stay warm and stylish during the coldest days of winter by grabbing one of these Instagram-famous Orolay parkas and down jackets on sale at Amazon today. We tested the brand's women's fleece thickened down jacket, which you can get for as low as $100.79 in select sizes. Amanda Tarlton, Reviewed's style editor, said she was impressed with how thick and insulated the jacket was, keeping her warm on long outdoor walks on the coldest days. It also features six spacious pockets so you can keep everything from face masks to your phone. \"I don't even need to carry a purse when I wear this coat,\" Tarlton said.</p><p><span>Save up to 67% on Orolay down jackets and parkas</span> </p><p><big>4. Save $30: This comfortable gaming headset</big> </p><p>Stay immersed in your favorite video games with the Corsair HS60 Pro headset. Typically listed for $69.99, this wired gaming sound device is on sale in its Carbon black color for 43% off, or $39.99. Corsair says the HS60 Pro offers 7.1 Surround Sound audio through adjustable cups fitted with plush memory foam, so you can have a soft feel over your ears for even the longest streaming sessions. The headset is compatible not only with PCs, but also the latest consoles from Sony, Microsoft and Nintendo, and has a detachable noise-canceling unidirectional microphone so you can chat while gaming.</p><p><span>Get the Corsair HS60 Pro Gaming Headset from $39.99 (Save $30)</span> </p><p><big>5. 10% off: One of our favorite coffee grinders</big> </p><p>If you're particular about how your beans are ground, the Fellow Ode Brew grinder can give you control without taking over your kitchen counter. Normally priced at $299, this unique home appliance is on sale for a $29 price cut that brings it down to $270. The Fellow Ode Brew is one of our favorite coffee grinders for its compact design that features a single-dose bin with no timer. We also found the grinder to be one of the quietest we've ever tested—and we appreciated the way its grinds-receiving bin can be magnetically attached to the base for stability.</p><p><span>Get the Fellow Ode Brew Grinder for $270 (Save $29)</span> </p><p class=\"tr-npp-section-title\">The best Amazon deals from this week</p><p><big>1. iRobot Roomba i3+</big> </p><p>We love Roombas for their top-shelf performance, and right now, one of our favorites is more than 33% off. The iRobot Roomba i3+, usually priced at $599.99, is now available for $399. This robot vacuum is our favorite affordable Roomba for the self-emptying feature that collects dirt in the accompanying dirt tower. In our testing, we found the i3+ picked up an average of 11 grams of dirt per run, which is on par with our favorite robot vacuum, the iRobot Roomba i7+ ($746). </p><p><span>Get the iRobot Roomba i3+ for $399 (Save $200.99)</span> </p><p><big>2. Chamberlain myQ Smart Garage Hub and Sensor</big> </p><p>Control your home garage even when you're not home with the Chamberlain myQ smart garage hub. Typically listed for $29.98, this compact smart home device can be yours for $19.98, or $10 off. Chamberlain says the myQ lets you open and close your garage door from a dedicated app available for iPhones and Android smartphones. You can also schedule specific times for your garage to open and close with real-time notifications sent to your phone.</p><p><span>Get the Chamberlain myQ Smart Garage Hub and Sensor for $19.98 (Save $10)</span> </p><p><big>3. Philips Norelco Shaver 9100</big> </p><p>Keep your stubble in check with the Philips Norelco Shaver 9100 on sale at Amazon today. Normally priced at $149.95, this cordless electric trimmer is now listed for $109.95 thanks to a 27% discount. Philips says the shaver features V-Track Precision Blades in its heads that move in eight directions to catch hair along every curve of your face. The brand also promises 50 minutes of cordless shaving on each charge—and a battery that's ready to go after just an hour of charging.</p><p><span>Get the Philips Norelco Shaver 9100 for $109.95 (Save $40)</span> </p><p><big>4. Apple Watch Series 7</big> </p><p>When it comes to smartwatches, we think the Apple Watch Series 7 is the best tech of its kind. When we tested it, we were impressed with how fast the battery charged and its many fitness tracking abilities, including the way it automatically detect cycling workouts. The Series 7 also has a larger display than its predecessors, making more room for a new watch-friendly keyboard and for an easier time reading text messages or GPS directions. Normally listed from $399, you can get Apple's latest smartwatch for as low as $339 in its 41-millimeter size with GPS capabilities.</p><p><span>Get the Apple Watch Series 7 from $339 (Save $29.01 to $80)</span> </p><p><big>5. BalanceFrom 40-Pound All-Purpose Weight Set</big> </p><p>Build some major body strength this year with this BalanceFrom 40-pound weight set on sale at Amazon today. Typically listed for $45.64, you can get this pair of vinyl-coated dumbbells for 49% off at $23.39. The brand says the fitness tools come with four collar locks to help keep the provided weights secure no matter how tough your home fitness routine is. The vinyl coating is also meant to keep the weights from rusting over time. </p><p><span>Get the BalanceFrom 40-Pound All-Purpose Weight Set for $23.39 (Save $22.25)</span> </p><p class=\"tr-npp-section-title\">Other noteworthy Amazon deals we found </p><ul class=\"bulleted-list arrowlist\"><li>Save up to 27% on Shark Vacuums and Air Purifiers</li><li>Save up to 41% on Clorox Cleaning Supplies</li><li>Save up to 50% on select Nintendo Switch games</li><li>Stasher Platinum Silicone Food Grade Reusable Storage Bag 2-Set for $7.93 (Save $6.06)</li><li>iHealth 2020 No Touch Forehead Thermometer for $14.52 (Save $3.94)</li><li>Amazon Fire TV Stick Lite for $18.99 (Save $11)</li><li>Tribit XSound Go Portable Bluetooth Speaker from $27.74 with coupon (Save $18.25)</li><li>Elechomes EPI081 Air Purifier from $29.99 (Save $30)</li><li>Olay Regenerist Retinol 24 Max Moisturizer for $32.94 (Save $20.05)</li><li>Sporzon! Rubber Encased Hex Dumbbells from $34.99 (Save $9.90 to $67.56)</li><li>Sensyne 10-Inch Ring Light for $38.99 (Save $11)</li><li>JavaPresse Manual Coffee Grinder for $39.99 (Save $6)</li><li>Dreo 4-Quart Air Fryer for $79.99 with coupon (Save $10)</li><li>Eufy BoostIQ RoboVac 11S Robot Vacuum Cleaner for $159.99 (Save $40 to $70)</li><li>Apple AirPods Pro for $189.99 (Save $59.01)</li><li>Philips Premium Airfryer XXL from $199.95 (Save $100.56 to $150)</li><li>Hisense Class H9 Quantum Series Android 4K ULED Smart TV from $499.99 (Save $78.85 to $150)</li><li>iRobot Roomba j7+ with Authentic Replacement Parts for $615.99 (Save $250.99)</li><li>Echelon EX-5 Smart Connect Fitness Bike for $800.99 (Save $399)</li><li>2020 Apple 13-inch MacBook Pro from $1,199 (Save $100)</li> </ul><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Updated daily: Here are the 10 best Amazon deals today</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}