{"date": "2022-02-09 10:05:07.067000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>Hod Hasharon, Israel, Feb.  09, 2022  (GLOBE NEWSWIRE) -- <a href=\"https://www.globenewswire.com/Tracker?data=Y57UDq8G6PjvBEOBYYFy6cXl_JZ_OQt2IHstajKTTTxC5NT8vok8vSg_4UESTxtuRhPXixUTq321E5RoKUVOxg==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Allot Ltd</a>. (NASDAQ: ALLT) (TASE: ALLT), a leading global provider of innovative network intelligence and security-as-a-service (SECaaS) solutions for communication service providers (CSPs) and enterprises, today announced a strategic collaboration agreement with Amazon Web Services (AWS). The relationship will enable CSPs to deploy new Allot cloud-native application workloads on AWS and expand their existing Allot deployments. The strategic collaboration will enhance the ability of CSPs to leverage the full suite of Allot cloud-native applications on AWS, providing a consistent and scalable operating model for 5G cloud-based networks and services. Allot has already deployed a solution using the AWS cloud platform for a CSP customer in North America.</p><p> </p><p>As an AWS Independent Software Vendor (ISV), Allot is collaborating with AWS to build and certify Allot applications on AWS. This helps telecom operators to fully deploy their 5G networks on the cloud with higher efficiency, lower cost, more agile deployment of new services to customers and greater security.</p><p> </p><p>\"As CSPs move to adopt cloud native technology for 5G connectivity, Allot and AWS are committed to helping them deploy 5G networks on the cloud. This will help revolutionize the telecom space in the same way the cloud revolutionized enterprise software,” said Keren Rubanenko, SVP Cybersecurity, at Allot. \"We are proud to collaborate with AWS toward enabling secure cloud-based 5G network deployments.\"</p><p> </p><p align=\"center\">###</p><p> </p><p>Additional Resources:</p><p>Allot Blog: <a href=\"https://www.globenewswire.com/Tracker?data=EYOHtU5EiMWCC8vcjwzK-9nf9NsMQTNIDohzMYKO8ieTZt13AsieLPNGx0GtezTmrZFSAyxZjjq8H0U9TRsf5MYGq66YgmqOi67wG_EWJDA=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.allot.com/blog</a></p><p>Allot On-air Podcast: <a href=\"https://www.globenewswire.com/Tracker?data=EYOHtU5EiMWCC8vcjwzK-9nf9NsMQTNIDohzMYKO8idG0_W4eulFjS-YTQVR-oHz2rzA2lrk2h5qtaV_vKa93YSBIXufy78swA823VV0zPi7OY0kIGn2C_u185pu-C7srvBdmLBVvV6Jt-4wUZxRWg==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.allot.com/resources/podcasts</a></p><p>Follow us on Twitter: <a href=\"https://www.globenewswire.com/Tracker?data=UnuMGsCkefyepm7U-i93RRwLA7BoxNzQP5Kv8e0EBiuuMmmj5qABgHPSmWkh2TikmhWssAHl_ilo7rB0Be7h9g==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@allot_ltd</a></p><p>Follow us on LinkedIn: <a href=\"https://www.globenewswire.com/Tracker?data=EYOHtU5EiMWCC8vcjwzK-0xuFPNpHU8kokqWBu4gXsH3rPVQtrbR8-G43zwE0wTdTNbUmODsrVLjXmPkdnu5uGJGvrjwELtyFGbAz22ArVdQ7JJgbD45W3ffxcYb_IQMDPjvtX7UWnEsp4l9ENHMnLU1XFi3cHZdtdBA5xf0_N9J-RdwF8yMWTsI7u3zXn0e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.linkedin.com/company/allot-communications</a></p><p> </p><p>About Allot</p><p>Allot Ltd. (NASDAQ: ALLT, TASE: ALLT) is a provider of leading innovative network intelligence and security solutions for service providers and enterprises worldwide, enhancing value to their customers. Our solutions are deployed globally for network and application analytics, traffic control and shaping, network-based security services, and more. Allot’s multi-service platforms are deployed by over 500 mobile, fixed and cloud service providers and over 1000 enterprises. Our industry-leading network-based security as a service solution has achieved over 50% penetration with some service providers and is already used by over 20 million subscribers globally.</p><p>Allot. See. Control. Secure.</p><p>Forward-Looking Statement</p><p>This release contains forward-looking statements, which express the current beliefs and expectations of company management. Such statements involve a number of known and unknown risks and uncertainties that could cause our future results, performance or achievements to differ significantly from the results, performance or achievements expressed or implied by such forward-looking statements. Important factors that could cause or contribute to such differences include risks relating to: acceptance of our products by our reseller and customer in EMEA, our ability to compete successfully with other companies offering competing technologies; the loss of one or more significant customers; consolidation of, and strategic alliances by, our competitors, government regulation; lower demand for key value-added services; our ability to keep pace with advances in technology and to add new features and value-added services; managing lengthy sales cycles; operational risks associated with large projects; our dependence on third-party channel partners for a material portion of our revenues; and other factors discussed under the heading \"Risk Factors\" in the Company's annual report on Form 20-F filed with the Securities and Exchange Commission. Forward-looking statements in this release are made pursuant to the safe harbor provisions contained in the Private Securities Litigation Reform Act of 1995. These forward-looking statements are made only as of the date hereof, and the Company undertakes no obligation to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise.</p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODQ3MjEyNCM0NzE4OTQ3IzIxMzYyOTM=\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RRM01qRXlOQ00wTnpFNE9UUTNJekl4TXpZeU9UTT0=&amp;key=40c75554c35e1379d30991b66c5d9dcb13a6a3c9d75e5514b377165a00d3e2c3ddea957d2a9e742ef8f5da2fdca70dbb8d20b035e9a038d6f283d9a25b8b4dc2\"/></div></div><br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/YjQxMzhiNTUtYzhiNS00NTgzLWE2OWQtODZkZWY5ZDlmNzBkLTExNDc4NjQ=/tiny/Allot.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9ZalF4TXpoaU5UVXRZemhpTlMwME5UZ3pMV0UyT1dRdE9EWmtaV1k1WkRsbU56QmtMVEV4TkRjNE5qUT0vdGlueS9BbGxvdC5wbmc=&amp;key=a77e4e904ee5205e9dcf99e30552d81b95526566ef84c991280a1da07b292d54da6596aff987685dc32c7a94cfc48c88874309924a711b22ac3b364b42df6160\"/></div></div><pre>Seth Greenberg\nAllot\n+972 549222294\nsgreenberg@allot.com\n\nEhud Helft / Kenny Green\nAllot Investor Relations\n+1 212 378-8040\nAllot@gkir.com\n</pre><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">GlobeNewswire, Inc. 2022</p></div>"}