{"date": "2022-01-31 17:13:11.599000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_fk3nab7x&amp;referenceId=tag:reuters.com,2022:newsml_OVFWKLZ0R_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_fk3nab7x&amp;referenceId=tag:reuters.com,2022:newsml_OVFWKLZ0R_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: After kicking off 2022 with two mega acquisitions, the video gaming sector is racing to a new record of $150 billion in deals, financing and IPOs this year, according to investment banking firm Drake Star Partners. Francis Maguire reports.<br/>Short Link: <a href=\"https://refini.tv/3KQMQku\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3KQMQku</a><br/><br/>Video Transcript:<br/><br/>Video gaming could be on course for a record-breaking $150 billion in deals, financing and IPOs this year. At least that's what investment banking firm Drake Star Partners believes. Their estimate comes after the year kicked off with two mega buyouts. Microsoft targeted Activision Blizzard - the home of big-seller Call of Duty - for nearly $70 billion. While Take-Two Interactive bid $11 billion for Farmville developer Zynga. Those two buys alone have put this year's deals close to 2020's record total of $85 billion, itself almost three times the year before. Drake Partners projects that Amazon and Netflix could move in with big bets on the industry. In Asia, the likes of China's ByteDance and Japan's Sony - the maker of the PlayStation - are also on the radar. It all comes after lockdowns drove a huge boom in gaming. The industry is also consolidating as big players hunt new revenue streams. Then there is the so-called 'metaverse'. It has long been seen a part of gaming's future, connecting people though augmented or virtual reality. But it recently caught headlines when Facebook changed its name to Meta Platforms, and said it would focus on the online realm. Elsewhere, Drake Partners believes that EPIC Games and Discord will be names to watch when it comes to potential IPOs.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}