{"date": "2021-11-10 00:22:16.701000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>SEATTLE (AP) — A small publishing company in Vermont is suing Sen. Elizabeth Warren, saying her chastising Amazon over the sale of a book that promotes misinformation about COVID-19 amounted to censorship.</p><p>The company, Chelsea Green, published a book called \"The Truth About COVID-19,\" which accuses the \"global elite\" of using the pandemic to grab \"unprecedented power.\"</p></div><div class=\"tr-npp-body\"><p>It also promotes unproven and possibly dangerous treatments for the coronavirus, while falsely suggesting COVID-19 vaccines approved by the government have not been properly tested.</p><p>In a letter in September, the Massachusetts Democrat accused Seattle-based Amazon of peddling misinformation. Warren also issued a news release suggesting the company's actions were \"unethical, unacceptable, and potentially unlawful.\"</p><p>Chelsea Green, along with the book's authors, sued Warren in U.S. District Court in Seattle this week. Amazon was not named in the lawsuit, but the plaintiffs' attorney wrote that the case was filed in Seattle because Warren sent the letter to Amazon.</p><p>The lawsuit says the book contains factual information and reasonable opinions protected by the First Amendment, and that Warren's \"veiled threats\" that Amazon could face legal repercussions if it doesn't stop selling the book amounted to unlawful government censorship.</p><p>The book is by Dr. Joseph Mercola, a Florida osteopath who has a long history of selling unapproved health products, and Ronnie Cummins, an activist against genetically modified food. It features a foreword by Robert F. Kennedy, Jr., a longtime vaccine skeptic.</p><p>The Food and Drug Administration has warned Mercola to stop offering vitamin D and other products as \"safe and/or effective for the treatment or prevention of COVID-19.\"</p><p>Warren's office did not immediately return an email seeking comment Tuesday. Amazon did not reply to an inquiry about whether it had responded to Warren's letter.</p><p>According to the lawsuit, Amazon notified Chelsea Green on Oct. 1 that it was refusing to accept ads promoting the book.</p><p>The book continued to be offered on Amazon's website Tuesday as a best-seller in the \"political freedom\" category.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.</p></div>"}