{"date": "2021-12-09 13:11:58.619000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.29, "close": 3483.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>WONDERFI TECHNOLOGIES INC (\"WONDF-0\")\n- January App Launch\n\n   WonderFi Technologies Inc. (the \"Company\" or \"WonderFi\") today announced\nthe launch date of the WonderFi App, a simple and free app that makes it\neasy for everyday users to access the high-growth area of decentralized\nfinance (\"DeFi\"). The WonderFi app will be released on desktop on January\n25, 2022, with mobile app releases to follow.\n\n   \"The WonderFi app empowers anyone with a mobile phone to access DeFi,\nregardless of their background or experience in the sector,\" said WonderFi\nCEO Ben Samaroo. \"We're committed to providing fair and equal access to\nDeFi and lowering the barriers to entry for everyone.\"\n\n   DeFi is a new technology which cuts out the middleman in traditional\ncentralized finance, like banks and brokerages. With the total locked value\n(TVL) of DeFi markets having tripled over the last year to nearly $85\nbillion, interest in cryptocurrency has ramped up, with investors drawn to\nthe ease of conducting their own transactions and the high earnings\npotential. But for most consumers, DeFi is overwhelming and difficult to\naccess - an exclusive area of finance accessible to only experts and\ntraders.\n\n   WonderFi is backed by strategic investors such as Alameda Research and\nFTX's Sam Bankman-Fried, Shark Tank's Kevin O'Leary, and Gen-Z influencer\nand investor Josh Richards.\n\n   \"DeFi can be extremely complex-it's not 'consumerized' in the way that\ntraditional banking and investments are, and managing compliance and risk\ncan be an issue, so it's out of reach for most people. When my own daughter\ncame to me looking to invest in DeFi, there was no feasible way for her to\nget started,\" said O'Leary. \"WonderFi has solved that problem with a\nplatform that makes it easy for anyone to get started, to earn more and\nmanage all of their assets in one trusted platform.\"\n\n   Additional Information\nFor additional information, please contact:\n\n   WonderFi Technologies Inc.\nBen Samaroo, CEO\nben@wonder.fi\n(778) 843-9637\n\n   Investor Relations Contact: invest@wonder.fi\nMedia Contact: press@wonder.fi\n\n   ABOUT WONDERFI\n   WonderFi is a leading technology company with the mission of creating\nbetter access to DeFi through the core principles of simplicity and\neducation. WonderFi has a multi-pronged business strategy which includes a\nhigh-growth consumer finance app which will serve as a trusted gateway to\nthe new financial system, and a digital asset portfolio which consists of\nleading crypto and DeFi assets. WonderFi's executive team and Board of\nDirectors have an established track record in finance and crypto, with\nprevious experience at Amazon, Shopify, PayPal, Galaxy Digital, Hut 8 and\nBIGG Digital. WonderFi's core team of engineers and technologists believe\nthat everyone should have equal access to finance, and are aligned in the\nmission to empower people around the world to access DeFi in a simple,\nsmart and secure way. For more information, visit www.wonder.fi.\n\n   Forward-Looking Information and Statements\n\n   This press release contains certain \"forward-looking information\" within\nthe meaning of applicable Canadian securities legislation and may also\ncontain statements that may constitute \"forward-looking statements\" within\nthe meaning of the safe harbor provisions of the United States Private\nSecurities Litigation Reform Act of 1995. Such forward-looking information\nand forward-looking statements are not representative of historical facts\nor information or current condition, but instead represent only the\nCompany's beliefs regarding future events, plans or objectives, many of\nwhich, by their nature, are inherently uncertain and outside of the\nCompany's control. Generally, such forward-looking information or\nforward-looking statements can be identified by the use of forward-looking\nterminology such \"could\", \"intend\", \"expect\", \"believe\", \"will\",\n\"projected\", \"estimated\", or variations of such words. The forward-looking\ninformation and forward-looking statements contained herein may include,\nbut are not limited to, information concerning: the release date of the\nWonderFi app on desktop and mobile.\n\n   By identifying such information and statements in this manner, the\nCompany is alerting the reader that such information and statements are\nsubject to known and unknown risks, uncertainties and other factors that\nmay cause the actual results, level of activity, performance or\nachievements of the Company to be materially different from those expressed\nor implied by such information and statements. In addition, in connection\nwith the forward-looking information and forward-looking statements\ncontained in this press release, the Company has made certain assumptions.\nAmong the key factors that could cause actual results to differ materially\nfrom those projected in the forward-looking information and statements are\nthe following: the ability of the Company to work effectively with\nstrategic investors; and changes in general economic, business and\npolitical conditions, including changes in the financial markets, changes\nin applicable laws, and compliance with extensive government regulation.\nShould one or more of these risks, uncertainties or other factors\nmaterialize, or should assumptions underlying the forward-looking\ninformation or statements prove incorrect, actual results may vary\nmaterially from those described herein.\n\n   Although the Company believes that the assumptions and factors used in\npreparing, and the expectations contained in, the forward-looking\ninformation and statements are reasonable, undue reliance should not be\nplaced on such information and statements, and no assurance or guarantee\ncan be given that such forward-looking information and statements will\nprove to be accurate, as actual results and future events could differ\nmaterially from those anticipated in such information and statements. The\nforward-looking information and forward-looking statements contained in\nthis press release are made as of the date of this press release, and the\nCompany does not undertake to update any forward-looking information and/or\nforward-looking statements that are contained or referenced herein, except\nin accordance with applicable securities laws. All subsequent written and\noral forward-looking information and statements attributable to the Company\nor persons acting on its behalf is expressly qualified in its entirety by\nthis notice.\n\n   Neither NEO Exchange nor its Regulation Services Provider (as that term\nis defined in policies of the NEO Exchange) accepts responsibility for the\nadequacy or accuracy of this news release.\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134101180.MNPRE2134103740-22061520211208</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}