{"date": "2022-02-27 07:21:51+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3075.77, "close": 3022.84}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds lawyer comment on Amazon</p><p class=\"tr-by\">By Aditya Kalra</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW DELHI, Feb 27 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Future Retail Ltd <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FRTL.NS\" data-type=\"ric\" data-ric=\"FRTL.NS\" translate=\"no\" dir=\"ltr\">FRTL.NS</a>, India's second-largest retailer, suspended most of its online and offline operations as stores remained shut on Sunday, after rival Reliance bid to take over its flagship supermarkets for missed lease payments.</p><p>Reliance Industries Ltd <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RELI.NS\" data-type=\"ric\" data-ric=\"RELI.NS\" translate=\"no\" dir=\"ltr\">RELI.NS</a> will rebrand the Future stores after the company failed to make payments for them to Reliance, sources told Reuters on Saturday, closing most outlets of the popular Big Bazaar chain. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2V10C1\" data-type=\"storyId\" data-story-id=\"nL1N2V10C1\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Though Future has more than 1,700 outlets, all the 200 stores that Reliance will rebrand as its own will be Big Bazaars, which was started around two decades ago by Kishore Biyani, dubbed as India's retail king for transforming the sector.</p><p>Future and Reliance did not respond to requests for comment. Future told stock exchanges on Saturday the company was \"scaling down its operations.\"</p><p>Future's stores across India remained shut on Sunday as Reliance did stock-taking ahead of a rebranding, people familiar with the plans said.</p><p>\"We regret to inform you that currently stores are non-operational for 2 days,\" Big Bazaar told a Twitter user who complained about a closure.</p><p>Future's e-commerce mobile app and website were also not available for online ordering. </p><p>Reliance's move assumes significance as <span class=\"tr-strong\">it </span>follows failed efforts since 2020 to close a $3.4 billion deal to acquire the retail assets of Future, whose partner Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> has blocked the transaction by citing violation of contracts. Future denies any wrongdoing.</p><p>Reliance had transferred leases of some stores of debt-laden Future to its name and sublet them to Future, but is now taking over as Future did not make payments. Reliance has offered store staff jobs on existing terms.</p><p>\"All employees, consumers, and everyone in India - we are all attached to the Big Bazaar brand,\" a Big Bazaar employee on Sunday. \"So you feel sad this is happening.\"</p><p>In blocking the Future-Reliance deal, Amazon has long argued that Future violated the terms of a 2019 deal in which the U.S. giant invested $200 million in the Indian company. Amazon's position has been backed so far by a Singapore arbitrator and Indian courts.</p><p>The move will upset plans of Amazon, which <span class=\"tr-strong\">hoped</span> one day to have a piece of Future's stores itself. <span class=\"tr-strong\">B</span>ut the U.S. firm appears to have little legal recourse, as store landlords appear to have independently given the leases to Reliance, said a lawyer familiar with the dispute.</p><p>\"Probably Amazon didn’t think Reliance will be this aggressive,\" said the lawyer.</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Aditya Kalra in New Delhi; Editing by William Mallard)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:aditya.kalra@tr.com\" data-type=\"email\" translate=\"no\">aditya.kalra@tr.com</a> ; +91-11-49548021; Twitter <a href=\"https://twitter.com/adityakalra\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/adityakalra</a>; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: INDIA-FUTURE/BIGBAZAAR (UPDATE 2, PIX)</p></div>"}