{"date": "2022-02-15 14:08:12.962000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENTHUSIAST GAMING INC (\"EGLX-TQ\")\n- Audience Surpasses 145 Million Social Followers Globally\n\n     Enthusiast Gaming Holdings Inc. (\"Enthusiast Gaming\" or the\n\"Company\"), a media and content platform for video game and esports fans to\nconnect and engage, today announced the results of its latest custom study\nwith Nielsen (NYSE: NLSN), the leading global source for media and sports\nmeasurement, to measure the total social reach and Twitch viewership of the\nCompany's Luminosity Gaming esports audience.\n\n     With time spent on game streams, forums, and communities now nearly\nequal to time spent actually playing video games (Accenture, Gaming: The\nNext Super Platform, April 2021), Luminosity Gaming's roster of 50+ leading\nesports content creators and streamers provides a unique opportunity for\nbrands looking to reach and engage Gen Z and Millennials, with an audience\nmeasured by Nielsen.\n\n     The results of the latest custom Nielsen study for January 2022 show\nthat Luminosity Gaming's total social following is now over 145M globally,\nhaving grown 13% since the last study in October 2021. In addition, the\nhours watched for Luminosity Gaming's esports team on Twitch surpassed 32M\nglobally in January, an increase of 34% since the last study.\n\n     The results mean that Luminosity Gaming has significantly increased\nits margin as the world's most watched esports team on Twitch, with hours\nwatched now 50% greater than the nearest esports competitor:\n\n     Top Esports Teams on Twitch\n\n//st\n\n                      Organization   Hours Watched (000)\n\n                      Luminosity     32,132\n\n                      Team 2         21,492\n\n                      Team 3         18,605\n\n                      Team 4         14,015\n\n                      Team 5         13,777\n\n                      Team 6         10,282\n\n//et\n\n     Source: Nielsen Sports, custom study commissioned by Enthusiast\nGaming, January 2022\n\n     \"Luminosity is now head-and-shoulders above any other professional\nesports organization when it comes to time watched,\" commented Adrian\nMontgomery, CEO of Enthusiast Gaming. \"This massive esports audience,\ncombined with our top-ranked digital media property, makes Enthusiast\nGaming the best partner for any major brand trying to connect with Gen Z\nand Millennials.\"\n\n     The Company utilizes the Nielsen studies and findings in its direct\nsales process.\n\n     About Enthusiast Gaming\n\n     Enthusiast Gaming is building the largest media and content platform\nfor video game and esports fans to connect and engage worldwide. Combining\nthe elements of its four core pillars; Media, Talent, Esports, and\nExperiences, Enthusiast Gaming provides a unique opportunity and integrated\napproach to reach and connect with its coveted GenZ and Millennial\naudience. Through its proprietary mix of digital media and entertainment\nassets, Enthusiast Gaming has built a vast network of like-minded\ncommunities to deliver the ultimate fan experience.\n\n     Contacts\n\nEnthusiast Gaming Contact:\nEric Bernofsky, Chief Corporate Officer\ninvestor@enthusiastgaming.com\n\n     Media Relations:\nDerek Holota, Provident Communications\nDerek@providentcomms.com\n343-422-5606\n\n     Neither the Toronto Stock Exchange nor its Regulation Services\nProvider (as that term is defined in the policies of the exchange) accepts\nresponsibility for the adequacy or accuracy of this release.\n\n     Forward-Looking Statements\n\n     This news release contains certain statements that may constitute\nforward-looking information under applicable securities laws. All\nstatements, other than those of historical fact, which address activities,\nevents, outcomes, results, developments, performance or achievements that\nEnthusiast Gaming anticipates or expects may or will occur in the future\n(in whole or in part) should be considered forward-looking information.\nOften, but not always, forward-looking information can be identified by the\nuse of words such as \"plans\", \"expects\", \"is expected\", \"budget\",\n\"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\", or\n\"believes\" or variations (including negative variations) of such words and\nphrases, or statements formed in the future tense or indicating that\ncertain actions, events or results \"may\", \"could\", \"would\", \"might\" or\n\"will\" (or other variations of the forgoing) be taken, occur, be achieved,\nor come to pass. Forward-looking statements in this news release include,\nbut are not limited to, statements regarding the growth of the Company's\nesports audience and the Company's direct sales process.\n\n     Forward-looking statements are based on assumptions and analyses made\nby the Company in light of its experience and its perception of historical\ntrends, current conditions and expected future developments, including, but\nnot limited to, expectations and assumptions concerning: interest and\nforeign exchange rates; capital efficiencies, cost saving and synergies;\ngrowth and growth rates; the success in the esports and gaming media\nindustry; the Company's growth plan, and judgment applied in the\napplication of the Company's accounting policies and in the preparation of\nfinancial statements in accordance with applicable financial reporting\nstandards. While Enthusiast Gaming considers these assumptions to be\nreasonable, based on information currently available, they may prove to be\nincorrect. Readers are cautioned not to place undue reliance on\nforward-looking statements. In addition, forward-looking statements\nnecessarily involve known and unknown risks, including, without limitation,\nrisks associated with general economic conditions; adverse industry events;\nand future legislative, tax and regulatory developments. Readers are\ncautioned that the foregoing list is not exhaustive. For more information\non the risks, uncertainties and assumptions that could cause anticipated\nopportunities and actual results to differ materially, please refer to the\npublic filings of Enthusiast Gaming which are available on SEDAR at\nwww.sedar.com. Readers are further cautioned not to place undue reliance on\nforward-looking statements as there can be no assurance that the plans,\nintentions or expectations upon which they are placed will occur. Such\ninformation, although considered reasonable by management at the time of\npreparation, may prove to be incorrect and actual results may differ\nmaterially from those anticipated. Forward-looking statements contained in\nthis news release are expressly qualified by this cautionary statement and\nreflect our expectations as of the date hereof, and thus are subject to\nchange thereafter. Enthusiast Gaming disclaims any intention or obligation\nto update or revise any forward-looking statements, whether as a result of\nnew information, future events or otherwise, except as required by\napplicable law.\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204500143.MNPRE2204501377-06072420220215</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}