{"date": "2021-12-01 19:52:13.847000+00:00", "ticker": "III", "mrkt_info": {"open": 1387.0, "close": 1400.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Post Capital Partners Announces the Sale of EC Waste to 3i Group plc</b>\n</p><p class=\"bwalignc\">\n<span>Successful execution of Post Capital’s Executive-First strategy</span>\n</p><p>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fpostcp.com%2F&amp;esheet=52543004&amp;newsitemid=20211201005312&amp;lan=en-US&amp;anchor=Post+Capital+Partners&amp;index=1&amp;md5=2fdac99f8688ecb9f0af159cc594e588\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Post Capital Partners</a> today announced the sale of <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fecwaste.com%2F&amp;esheet=52543004&amp;newsitemid=20211201005312&amp;lan=en-US&amp;anchor=EC+Waste%2C+LLC&amp;index=2&amp;md5=743171cf7d5ca4e58da1dc8115aec920\" data-type=\"url\" class=\"tr-link\" translate=\"no\">EC Waste, LLC</a>, a fully integrated solid waste services provider in Puerto Rico, to 3i Group plc. The sale was completed on November 30. Financial terms were not disclosed.\n</p><p>\nPost Capital partnered with Randy Jensen, a talented waste management executive with more than 25 years of experience in the industry, to acquire EC Waste from Waste Management, Inc. (NYSE: WM) in April 2014. With locations throughout Puerto Rico, EC Waste provides multiple waste services to over 100,000 residential, commercial, and industrial customers. The company operates four U.S. EPA compliant disposal sites, two transfer stations, runs the island’s largest solid waste collections network and hosts what will be Puerto Rico’s largest renewable natural gas collection project at its Humacao facility. Under Mr. Jensen’s leadership, the company has grown significantly and employs over 350 people on the island.\n</p><p>\n“We are extremely pleased with the outcome of our partnership with Randy and EC Waste,” said Michael Pfeffer, Co-founder and Managing Director of Post Capital. “The exit is a great illustration of the power of Post Capital’s <span><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.postcp.com%2Fstrategy&amp;esheet=52543004&amp;newsitemid=20211201005312&amp;lan=en-US&amp;anchor=Executive-First+strategy&amp;index=3&amp;md5=112982b14106b9c40f3e1f95d98200c1\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Executive-First strategy</a></span> – we worked with Randy upfront to identify EC Waste, to set the strategy and then supported him and the company through its growth. We are grateful to Randy and the rest of the EC Waste team for their hard work and dedication throughout our investment.”\n</p><p>\nMr. Jensen added, “It has been a pleasure working with Post Capital. They believed in my initial vision for the industry and through their <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.postcp.com%2Fstrategy&amp;esheet=52543004&amp;newsitemid=20211201005312&amp;lan=en-US&amp;anchor=Executive+Partnership+Program&amp;index=4&amp;md5=11e660af98d19c276327bbc70f63c7ff\"><span>Executive Partnership Program</span></a> enabled me to become not only the senior leader of EC Waste, but also a meaningful owner of the business. Throughout our partnership, Post Capital provided the company with valuable guidance and insight, including facilitating the execution of highly accretive acquisitions and the successful divestiture of several non-core assets. My experience with Post Capital has been a true collaboration from beginning to end.”\n</p><p>\nStifel served as financial advisor to EC Waste on the transaction. Winston &amp; Strawn LLP and Pietrantoni Mendez &amp; Alvarez LLC acted as legal advisors, KPMG LLP and BDO USA LLP provided accounting advice and Deloitte Tax LLP provided tax advice to EC Waste.\n</p><p>\n<b>About EC Waste</b>\n</p><p>\nEC Waste, LLC. is a leading provider of non-hazardous waste management and disposal services in Puerto Rico. The Company protects the quality of life in many communities, providing waste solutions to over 100,000 residential clients and over 8,500 commercial and industrial customers in Puerto Rico. EC Waste operates four sanitary landfill systems on the island and operates and manages two transfer stations.\n</p><p>\n<b>About Post Capital Partners</b>\n</p><p>\nPost Capital Partners (<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.postcp.com&amp;esheet=52543004&amp;newsitemid=20211201005312&amp;lan=en-US&amp;anchor=http%3A%2F%2Fwww.postcp.com&amp;index=5&amp;md5=d2b6ac7eb72c4d2e54d3a462f4812e81\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.postcp.com</a>) is a private investment firm that makes both minority growth and control investments in businesses with repeat or recurring revenue models. Post Capital primarily employs an “Executive-First” deal sourcing and investment strategy in which it first identifies and partners with talented senior operating executives and then works proactively with those “Executive Partners” to identify investments. In addition to “Executive-First” platform searches, Post Capital also pursues management buyouts and growth capital investments. Based in New York City, Post Capital invests a committed capital fund with top-tier institutional and sophisticated private investors.\n</p><p><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211201005312/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211201005312/en/</a></span></p><p>\n<b>Media: \n</b><br/>Rosalia Scampoli\n<br/>Marketcom PR\n<br/>914-815-1465\n<br/><a href=\"mailto:rscampoli@marketcompr.com\" data-type=\"email\" translate=\"no\">rscampoli@marketcompr.com</a>\n</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NY-POST-CAPITAL-PARTNERS</p></div>"}