{"date": "2021-11-02 10:37:01.530000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Nov. 2 -- Jeff Bezos-headed Amazon has announced the launch of first two satellites under Project Kuiper, its low-earth orbit (LEO) satellite constellation, which will provide fast and affordable internet to 'unserved and undeserved' communities across the globe. The two satellites, both prototypes, will be launched in fourth quarter next year, the company announced.</p><p>\"The first two satellites for Project Kuiper will be launched next fall. This is a big step towards our mission of providing fast, affordable internet to unserved and undeserved communities across the world,\" the Seattle-headquartered firm tweeted on Monday.</p></div><div class=\"tr-npp-body\"><p>In a statement, Amazon said that the two satellites will be called 'KuiperSat-1' and 'KuiperSat-2,' adding that these will be used to test the communications and network technology that will be used in the final satellite design. Describing these as an 'important step' in the development process, the company also said that the two will have much of the technology and sub-systems which power the production version of the satellite design.</p><p>Additionally, the team will also test the prototype of the project's low-cost customer terminal; the platform has been designed to provide fast, reliable services at a cost far more affordable than that incurred due to legacy antennas.</p><p>\"We have filed an experimental license application with the Federal Communications Commission (FCC) to launch, deploy and operate the prototype satellites for Project Kuiper,\" the statement noted. \"These initial launches will be supported by the all-new RS1 rocket under an agreement with the ABL Space Systems, which has designed it. The launches will take place at the Florida-based Cape Canaveral Space Force Centre,\" the statement mentioned further.</p><p>Project Kuiper was developed under Kuiper Systems LLC, a subsidiary of Amazon which was set up in 2019. Currently, more than 750 people are working on it, and hundreds more will be added to the team in the coming years, Amazon said. Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}