{"date": "2021-12-16 20:15:53.363000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3466.3, "close": 3400.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Online retailer Amazon has received a ?1.13bn ($1.28bn) fine by Italy's antitrust watchdog, Autorità Garante della Concorrenza e del Mercato (AGCM), over allegations it has abused its dominant market position.</p><p>This fine is said to be one of the largest imposed in Europe on a US-based tech firm.According to the regulator, sellers were encouraged by Amazon to embrace its logistics service, Fulfilment by Amazon (FBA).The online retailer had allegedly done this to bolster its own market position to the 'detriment' of the logistics services provided by competing firms.It was suggested that Amazon had linked the FBA access to a host of benefits, including the Prime label, for sellers.In a statement, AGCM said: \"Amazon prevents third-party sellers from associating the Prime label with offers not managed with FBA.\"The regulator plans to impose corrective measures, which would be reviewed by a monitoring trustee.Amazon said that it 'strongly disagreed' with the watchdog's decision and is planning to appeal it.An Amazon spokesperson told CNBC: \"The proposed fine and remedies are unjustified and disproportionate.\"According to Amazon, small and medium-sized businesses (SMBs) form more than 50% of the total annual sales on its platform in Italy, meaning their success was 'essential' to its own business approach.The company spokesperson said: \"Small and medium-sized businesses have multiple channels to sell their products both online and offline: Amazon is just one of those options.\"We constantly invest to support the growth of the 18,000 Italian SMBs that sell on Amazon, and we provide multiple tools to our sellers, including those who manage shipments themselves.\"The company added that most of its third-party sellers do not use the optional FBA service and those that use it do so because it is 'efficient and competitive' in pricing terms.In August, Amazon was given a E746m fine for allegedly flouting European Union data privacy laws.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}