{"date": "2022-01-28 17:28:48+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2792.75, "close": 2991.47}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n        Join us for a Q&amp;A with Director of Alexa Trust, Anne Toth, Vice President of Alexa Speech, Manoj Sindhwani, and Vice President of Alexa AI Natural Understanding, Prem Natarajan.\n      </div>\n                <div>\n                  <p>\n          Our vision for Alexa is to not only be useful, but to markedly improve the lives of millions of people worldwide. The Alexa Trust and Alexa AI teams work every day to make this vision a reality. To help mark Data Privacy Day on January 28, we sat down with Anne Toth, Manoj Sindhwani, and Prem Natarajan to discuss how Amazon protects customer privacy while using data responsibly to improve the Alexa experience.\n        </p>\n                  <div>\n                    <div>\n            Anne Toth, director of Alexa Trust\n          </div>\n                    <div>\n            Manoj Sindhwani, vice president of Alexa Speech<br/></div>\n                    <div>\n            Prem Natarajan, vice president of Alexa AI Natural Understanding<br/><br/></div>\n                  </div>\n                  <h4>\n          Why do you need to collect Alexa customer data and how is it used?\n        </h4>\n                  <p>\n                    <strong>Toth:</strong> First and foremost, Alexa can't answer a question without collecting and processing that voice interaction, which seems obvious, right? But what makes it possible for Alexa to understand and respond accurately is all of the complex learning and constant refinement that makes Alexa better and smarter for all our customers with each interaction. It takes data to do that. One specific example is understanding human speech. Speech is complex and varies substantially based on region, dialect, context, environment, and the individual speaker. This includes factors like whether they are a native or non-native speaker of the language and whether they have a speech impairment. Training Alexa with customer data is incredibly important because for Alexa to work well, the machine learning models that power Alexa need to be trained using a diverse, wide range of real-world customer data. This is how we can ensure the service performs well for everyone, and under all kind of acoustic conditions, at home or on the go.\n        </p>\n                  <p>\n                    <span>\n                      <a href=\"https://www.amazon.com/gp/help/customer/display.html?nodeId=G9JFV7VRANZDKKWG\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Multilingual Mode</a>\n                    </span>is a great example of how data makes it possible for Alexa to be both inclusive and accurate for diverse households. Hundreds of thousands of customers across the U.S. are using Multilingual Mode on their Alexa devices to seamlessly switch between English and another language-like Spanish. Some customers have shared with us that Multilingual Mode helps their entire family access Alexa.\n        </p>\n                  <p>\n                    <strong>Sindhwani:</strong> Exactly. Data is what makes Alexa smart. Training our speech recognition models with the latest data patterns allows our teams to provide a useful, accurate, and even entertaining experience.\n        </p>\n                  <p>\n          Training with voice recordings is why Alexa can distinguish if a customer is asking for the weather in \"Austin\" versus \"Boston,\" or the difference between \"U2\" and \"YouTube.\" And, while customers did not ask Alexa to play songs by Lil Nas X when we introduced Alexa in 2014, training with voice recordings helped Alexa to quickly learn all the varied ways customers pronounce his name and request to play his music.\n        </p>\n                  <p>\n          Training Alexa with data over time also helps Alexa accurately answer questions about events that happen once every several years like the Olympics or World Cup. Understandably, customers tend to ask Alexa more frequently about \"Curling\" during the Winter Olympics, and these questions are easier to understand if Alexa is trained on historical data. Similarly, quickly training Alexa with voice recordings also ensures accuracy on trending topics where there's less historical knowledge-like COVID-19, Brexit, or NBA champion Giannis Antetokounmpo.\n        </p>\n                  <p>\n          Continuously training our machine learning models with customer data is the reason Alexa's understanding of customer requests has improved by an average of 37% over the last three years across all languages.\n        </p>\n                  <h4>\n          How are your teams protecting customer privacy while continuing to innovate?\n        </h4>\n                  <p>\n                    <strong>Toth:</strong> We talk a lot about how privacy is in Alexa's DNA. The \"microphone off\" button, the physical camera shutter, and the light and audio indicators notifying customers when Alexa processes a request are all controls that customers can see, hear, and touch. While these controls are important, we believe customers should have privacy without having to take an extra step.\n        </p>\n                  <p>\n          I've worked on privacy for most of my career. Privacy is often presented as a constraint and, in a way, it is. Having constraints certainly spurs creativity, but privacy has also become an opportunity for invention itself. Our science and speech teams have invested in programs to protect privacy and use data responsibly that don't require any action from the customer.\n        </p>\n                  <div>\n                    <div>\n                      <span>\n                        <a href=\"https://www.aboutamazon.com/news/devices/this-amazon-devices-engineer-is-leading-customer-privacy-efforts\" data-type=\"url\" class=\"tr-link\" translate=\"no\">This Amazon Devices engineer is leading customer privacy efforts</a>\n                      </span>\n                    </div>\n                    <div>\n            Welcome to our series \"Real (cool) jobs at Amazon,\" where we highlight some of the most peculiar jobs at Amazon.\n          </div>\n                    <div>\n                      <span>\n                        <a href=\"https://www.aboutamazon.com/news/devices/this-amazon-devices-engineer-is-leading-customer-privacy-efforts\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read more</a>\n                      </span>\n                    </div>\n                  </div>\n                  <p>\n                    <strong>Natarajan:</strong> Voice assistants present unique privacy challenges because there are parts of the experience that customers cannot see or hear. When we do collect and use customer data, we keep it secure and use it responsibly. For example, we use privacy-preserving methods to limit the amount and type of data that we use in our natural language understanding modeling environment when training our machine learning models, and continue to invest in anonymization and synthetic data generation techniques to further protect customer privacy.\n        </p>\n                  <p>\n                    <strong>Sindhwani:</strong> Our scientists and engineers invest in research and privacy-enhancing techniques to further improve Alexa speech recognition. Similar to the work Prem described, we are also developing new techniques to use synthetic data-training data generated by algorithms that mimic the real world-for improving our automatic speech recognition models. And, we've taken steps to rely even less on supervised learning techniques-where voice recordings are manually reviewed-through improvements in privacy-preserving techniques, like transfer learning, active learning, federated learning, and unsupervised or self-learning. Self-learning technologies learn entirely from customer interactions through implicit and explicit feedback without requiring manual labeling.\n        </p>\n                  <h4>\n          You describe privacy as an opportunity for invention, can you tell us more about how that comes to life for customers?\n        </h4>\n                  <p>\n                    <strong>Toth:</strong> There's a lot of innovation happening around privacy, especially within the Alexa organization. One core privacy principle is to always try to give customers more value while using less data, which I see as being not that different from how science has given us more computing processing power at lower cost. Do more with less. In the world of privacy, we call this data minimization. Some examples of this are moving more data processing directly onto our devices, looking for ways to de-identify data sooner, and building and refining privacy-preserving machine learning models. The team is working behind the scenes to do more with less by investing in data minimization techniques such as reducing the reliance on supervised learning.\n        </p>\n                  <p>\n                    <strong>Natarajan:</strong> We are always exploring new techniques for future implementation and investments in research. We are actively leveraging large, pre-trained models built from open-source data for few-shot and zero-shot learning to reduce the need for customer data to develop AI models for language understanding. We are also developing algorithms that de-identify the data used in model training and enable our models to be robust against privacy attacks. Any advancements or applications could have tremendous benefits for our customers and further protect the data we use every day.\n        </p>\n                  <h4>\n          Are there any privacy-preserving advancements you're excited to bring to customers?\n        </h4>\n                  <p>\n                    <strong>Sindhwani:</strong> We've continued to invest in Alexa's on-device speech-processing capabilities. Customers in the U.S. with compatible Echo smart speakers will soon be able to enable a new setting that allows the audio of their Alexa voice requests to be processed locally on-device, without being sent to the cloud. The voice recordings are deleted after the on-device processing. To do this, we had to make Automatic Speech Recognition models-that used to be many gigabytes in size, required huge amounts of memory, and ran on massive servers in the cloud-efficient enough to work on a single device. I'm particularly excited about innovations like this that have tangible benefits for customers through reduced latency and lower bandwidth consumption, while offering more choice about what happens with their data.\n        </p>\n                </div>\n                <div>\n                  <div>\n          Related Tags\n        </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/alexa\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Alexa</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/devices\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Devices</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/privacy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy</a>\n                    </span>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/devices/how-amazon-protects-customer-privacy-while-making-alexa-better\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>28 January 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>28 January 2022 17:28:48 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}