{"date": "2021-03-10 11:00:38.485000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3397.0, "close": 3400.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Read Article AVEVA has underscored how digital transformation will help to maximize business returns while also optimizing sustainability in a post-pandemic world. Speaking at the 25th Annual ARC Industry Forum recently, AVEVA CEO Craig Hayman and Alan...</p><p>AVEVA has underscored how digital transformation will help to maximize business returns while also optimizing sustainability in a post-pandemic world. Speaking at the 25th Annual ARC Industry Forum recently, AVEVA CEO Craig Hayman and Alan Nelson, CTO Abu Dhabi National Oil Company (ADNOC), joined a keynote panel hosted by Andy Chatha, President of leading research and advisory firm ARC Advisory Group, to share how Cloud and artificial intelligence (AI) are rapidly unlocking value across the industrial sector.</p></div><div class=\"tr-npp-body\"><p>Alan Nelson, ADNOC CTO, explained that the acceleration of digital and AI is at the forefront of technology discussions in every organization. \"We have deployed a myriad of digital solutions to effectively manage our business, including AI-enhanced blueprints for faster reservoir development, predictive maintenance and real-time centralized monitoring for critical plant equipment, managing our shipping business virtually, and real-time logistics monitoring,\" he continued. \"What we have learned from going through digital transformation in the global pandemic is that this is a business transformation. Digital and AI strategies are not standalone approaches, they are an extension of the business needs.\"</p><p>As a strategic partner to companies like ADNOC, Craig Hayman, AVEVA CEO, explained the criticality of high-fidelity data to business outcomes. \"Industrial data flow through AI algorithms in combination with human insight, which deliver transformational benefits. Predictive solutions and operational data reduce cost and improve processes in real time.\"</p><p>\"At AVEVA we are investing approximately £150 million per year on R&amp;D to enable 150 scrum teams of eight to 12 people each to develop meaningful insights and solutions that will address business-critical issues such as supply chain management. While our business has tripled in the last three years, digitalization is only now beginning to truly accelerate.\"</p><p>\"Digital innovation can realize the added benefit of reducing organizational carbon footprint,\" Hayman added. \"AVEVA's view of sustainability is twofold. Over time, our goal is to develop initiatives that minimize our entire environmental footprint, including applying circular economy principles to our global offices and operational practices. Our biggest opportunity, however, is what we think of as our handprint – how our software can enable and drive sustainability for industries. Digitalization will be critical to providing shareholder value, as sustainability is a metric that is in high demand from the boardroom to the customer.\"</p><p>\"The pandemic has represented a steep learning curve for all kinds of enterprises,\" said Andy Chatha, President of ARC. \"Over the past year, we learned that disruption happens faster than we anticipate. But while our priorities can change quickly, resets are possible and we can rebound quickly too,\" he said.</p><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}