{"date": "2021-11-22 15:02:09.630000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>TREND MICRO INC (\"TMICF,TMICY-0;TMI-F\")\n- Leads the Cloud Security Industry with the Most Data\n- Centers Across More Geographies\n\n   Trend Micro Incorporated, the global cloud security leader, offers cloud\nsecurity in data centers across 9 countries. This represents the broadest\nglobal distribution of data centers from any security company, supporting\nthe largest number of cloud security customers in the world.\n\n   Global data center availability better enables customer digital\ntransformation and cloud adoption by removing data residency roadblocks.\nData residency and data sovereignty are key considerations for compliance\nand business risk when companies move to the cloud.\n\n   According to Gartner, businesses \"face huge challenges to mitigate\ngrowth in associated business and financial risks from incidents such as\nnoncompliance, hacking and ransomware. These risks are compounded by data\nresidency issues and poor security planning as data flows across new\nstorage and analytics platforms on-premises and across public multicloud\nand hybrid cloud services.1\"\n\n   \"SaaS is the way to buy today, and security is no exception. We've seen\nexponential growth in our SaaS-based solutions and demand for local data\ncenter availability has risen accordingly,\" said Kevin Simzer, chief\noperating officer for Trend Micro. \"We are always looking for the best ways\nto solve business problems with our security platform and we're happy to\noffer the most regional data centers as one of the latest ways we're\nmeeting customers where they are - both physically and in their digital\ntransformation journey.\"\n\n   Trend Micro is committed to supporting the business priorities of\ncustomers and reducing business risk any way possible. The company has\nresponded to customer demand by helping enterprises meet data residency and\nsovereignty requirements with more local data centers. In addition, cloud\nsecurity services are integrated and available for Amazon Web Services,\nMicrosoft Azure and Google Cloud Platform, further meeting customers where\nthey are in their digital transformation journey.\n\n   All regional data centers meet leading compliance regulations, including\nPCI DSS and ISO 27001, as well as GDPR requirements.\n\n   To learn more about Trend Micro's market-leading cloud security\nplatform, please click here. Also, visit and follow Trend Micro's AWS\nre:Invent 2021 activities here.\n\n   About Trend Micro\n   Trend Micro, a global cybersecurity leader, helps make the world safe\nfor exchanging digital information. Fueled by decades of security\nexpertise, global threat research, and continuous innovation, Trend Micro's\ncybersecurity platform protects hundreds of thousands of organizations and\nmillions of individuals across clouds, networks, devices, and endpoints. As\na leader in cloud and enterprise cybersecurity, the platform delivers a\npowerful range of advanced threat defense techniques optimized for\nenvironments like AWS, Microsoft, and Google, and central visibility for\nbetter, faster detection and response. With 7,000 employees across 65\ncountries, Trend Micro enables organizations to simplify and secure their\nconnected world. www.TrendMicro.com.\n\n   1 Gartner - Use the Data Security Governance Framework to Balance\nBusiness Needs and Risks, Brian Lowans, Bart Willemsen, Marc-Antoine\nMeunier, 18 December 2019\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132500233.MNPRE2132501642-06595020211122</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}