{"date": "2021-11-03 18:41:37.656000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>GROVE INC (\"GRVI-Q\")\n- Launches \"Fund Your Brand\" Option for Amazon\n- Aggregation Initiative\n\n    Grove, Inc. (\"Grove\" or the \"Company\"): Grove Inc., a global innovator\nin hemp, health, and wellness, announced the launch of its \"Fund Your\nBrand\" option on Upexi, its wholly owned division to acquire promising\nAmazon and Ecommerce businesses.\n\n   In addition to buying and scaling Amazon and Ecommerce brands, Grove\nInc.'s Upexi unit will provide capital to growing brands in need of\nfunding.\n\n   Upexi has two operating segments: one that buys and scales Amazon and\ne-commerce brands, and one that provides funding to proven brands in need\nof capital to accelerate growth. Grove's investment will include funding\nand assistance with growth in the Amazon ecosystem and direct-to-consumer\nmarkets for a perpetual royalty on the future sales of the brands'\nproducts.\n\n   Grove Inc. recently launched Upexi to use its market and e-commerce\nexpertise in the Amazon aggregation market, which, according to Marketplace\nPulse, has attracted more than $10 billion in funding since 2020.\n\n   Grove Inc. has made a name for itself in the Wellness space, growing\n2021 fiscal revenues to $24.1 million, a 250% increase from the year prior.\nThe company hopes to apply a similar growth model to other brands they\nacquire or fund through Upexi, although there are no guarantees of similar\nsuccess given industry, market and economic forces.\n\n   \"Between Amazon's ecosystem and the meteoric rise of e-commerce over the\nlast few years, direct-to-consumer brands are growing bigger and faster\nthan ever,\" says Chief Marketing Officer Nathan Stavseth. \"Our goal is to\nidentify winning D2C brands on the cusp of exponential growth, bring them\ninto our ecosystem, and help them reach their full potential.\"\n\n   The company recently acquired Vitamedica, an online nutraceutical\ncompany, which has seen a growing presence in ecommerce and Amazon since\nbeing acquired. Through its in-house team of digital marketers, Grove is\nnow pursuing more companies in the health and wellness industry that they\ncan take to the next level.\n\n   About Grove, Inc.\n\n   Grove, Inc. is in the business of developing, producing, marketing and\nselling quality products and end consumer products containing the\nindustrial hemp plant extract Cannabidiol (\"CBD\"), as well as diversified\nproducts in other verticals. The Company sells to numerous consumer markets\nincluding the botanical, beauty care, pet care and functional food sectors.\nIt seeks to take advantage of an emerging worldwide trend to re-energize\nthe production of industrial hemp and to foster its many uses for\nconsumers.\n\n   Company Contact\n\n   Andrew Norstrud\nEmail: investorinfo@cbd.io\nPhone: (702) 332-5591\n\n   Investor Relations Contact\n\n   TraDigital IR\nJohn McNamara\nEmail: john@tradigitalir.com\nPhone: (917) 658-2602\n\n   Forward-Looking Statements\n\n   This news release contains \"forward-looking statements\" as that term is\ndefined in Section 27A of the United States Securities Act of 1933 and\nSection 21E of the Securities Exchange Act of 1934. Statements in this\npress release which are not purely historical are forward-looking\nstatements and include any statements regarding beliefs, plans,\nexpectations or intentions regarding the future. Actual results could\ndiffer from those projected in any forward-looking statements due to\nnumerous factors. Such factors include, among others, the inherent\nuncertainties associated with business strategy, potential acquisitions,\ngrowth potential, revenue guidance, product development, integration and\nsynergies of acquiring companies and personnel. These forward-looking\nstatements are made as of the date of this news release, and we assume no\nobligation to update the forward-looking statements, or to update the\nreasons why actual results could differ from those projected in the\nforward-looking statements. Although we believe that the beliefs, plans,\nexpectations and intentions contained in this press release are reasonable,\nthere can be no assurance that such beliefs, plans, expectations or\nintentions will prove to be accurate. Investors should consult all of the\ninformation set forth herein and should also refer to the risk factors\ndisclosure outlined in our annual report on Form 10-K and other periodic\nreports filed from time-to-time with the Securities and Exchange\nCommission.\n\nTel   : 701-353-5425    GROVE INC\nWWW   : <a href=\"https://www.cbd.io\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.cbd.io</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2130600546.MNPRE2130602728-11155420211103</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}