{"date": "2021-12-08 12:05:13.760000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Several Amazon services – including its website, Prime Video and applications that use Amazon Web Services (AWS) – went down for thousands of users on Tuesday.</p><p>Amazon said the outage was probably due to problems related to application programming interface (API), which is a set of protocols for building and integrating application software, Reuters reported.</p></div><div class=\"tr-npp-body\"><p>\"We are experiencing API and console issues in the US-East-1 Region,\" Amazon said in a report on its service health dashboard, adding that it had identified the cause. By late late afternoon the outage appeared to be partially resolved, with the company saying that it was \"working towards full recovery\".</p><p>\"With the network device issues resolved, we are now working towards recovery of any impaired services,\" the company said on the dashboard.</p><p>Downdetector showed more than 24,000 incidents of people reporting problems with Amazon. It tracks outages by collating status reports from a number of sources, including user-submitted errors on its platform.</p><p>The outage was also affecting delivery operations. Amazon's warehouse operation use AWS and experienced disruptions, spokesperson Richard Rocha told the <a href=\"https://www.washingtonpost.com/technology/2021/12/07/aws-outage-websites-offline/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Washington Post</a> . A Washington state Amazon driver said his facility had been \"at a standstill\" since Tuesday morning, <a href=\"https://www.cnbc.com/2021/12/07/amazon-web-services-outage-causes-issues-at-disney-netflix-coinbase.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">CNBC reported</a> .</p><p>Other services, including Amazon's Ring security cameras, mobile banking app Chime and robot vacuum cleaner maker iRobot were also facing difficulties, according to their social media pages.</p><p>Ring said it was aware of the issue and working to resolve it. \"A major Amazon Web Services (AWS) outage is currently impacting our iRobot Home App,\" iRobot said on its website.</p><p>Other websites and apps affected include the Internet Movie Database (IMDb), language learning provider Duolingo and dating site Tinder, according to Downdetector.</p><p>The outage also affected presale tickets for Adele's upcoming performances in Las Vegas. \"Due to an Amazon Web Services (AWS) outage impacting companies globally, all Adele Verified Fan Presales scheduled for today have been moved to tomorrow to ensure a better experience,\" Ticketmaster <a href=\"https://twitter.com/Ticketmaster/status/1468294115741872131\" data-type=\"url\" class=\"tr-link\" translate=\"no\">said on Twitter</a> .</p><p>In June, websites including the Guardian, Reddit, Amazon, CNN, PayPal, Spotify, Al Jazeera Media Network and the New York Times were hit by a widespread hour-long outage linked to US-based content delivery network provider Fastly Inc, a smaller rival of AWS.</p><p>In July, Amazon experienced a disruption in its online stores service, which lasted for nearly two hours and affected more than 38,000 users.</p><p>Users have experienced 27 outages over the past 12 months on Amazon, according to the web tool reviewing website ToolTester.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 theguardian.com-NonSyndicated</p></div>"}