{"date": "2022-01-04 14:05:54.910000+00:00", "ticker": "AAF", "mrkt_info": {"open": 141.1, "close": 137.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Jan. 4 -- Bharti Airtel Tuesday withdrew its plans to change its corporate structure to house all its digital assets under itself, stating that it was well positioned to invest aggressively into growth opportunities in the Indian market.</p><p>The change in plans follows the reforms package announced by the government in September, which provided much needed relief for the sector, and significantly boosted the investor confidence for the industry while simplifying the license framework.</p></div><div class=\"tr-npp-body\"><p>\"The Board of Directors of Airtel is of the view that the existing corporate structure of the Company is, therefore, optimal for leveraging these emerging opportunities and unlocking value while continuing to scale up Airtel's digital businesses. Therefore, the scheme of arrangement for the new corporate structure announced on April 14, 2021 stands withdrawn,\" the second largest telecom services provider said.</p><p>It added that under modified scheme which has been previously approved by the Board, Airtel will merge its wholly owned subsidiary Telesonic Networks Limited, resulting in consolidation of its fiber assets into Airtel. Nettle Infrastructure Investments Limited will also be merged with Airtel.</p><p>\"The company will pursue its plan to eventually fold the DTH business (Bharti Telemedia) into Airtel to move towards the NDCP vision of converged services to customers,\" it said in the statement.</p><p>Airtel's businesses continue to be categorised under four key verticals - India, Digital, International and Infrastructure.</p><p>Bharti Airtel's shares closed at Rs.697.2, up 0.87% on Tuesday, at the Bombay Stock Exchange.</p><p>Also read: Airtel Payments Bank gets scheduled bank status from RBI</p><p>In April last year, the Sunil Mittal led services provider had announced large scale corporate restructuring under which all its digital assets - Wynk Music, Airtel Xstream, Airtel Thanks app, Mitra payments platform, Airtel Ads, Airtel IQ, Airtel Secure, Airtel Cloud and all future digital products and services - would be housed under Bharti Airtel.</p><p>As per the earlier plan, Bharti Airtel would have also become the holding company of its separate units of Airtel's telecom business, Airtel Payments Bank, Airtel Africa, data centres under Nxtra and mobile phone tower infrastructure business Indus.</p><p>While it had announced the plans in April, it had not specified the date on which the changes would have come into effect. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}