{"date": "2021-11-29 16:38:16+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        Here's what you need to know about each of these specialty certs.\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          Format: Multiple choice, multiple answer\n        </li>\n                  <li>\n          Length: 180 minutes\n        </li>\n                  <li>\n          Registration fee: $300\n        </li>\n                </ul>\n                <p>\n        Demonstrate your ability to use various AWS database services to help accelerate and drive your organization's business, including knowing how to design, recommend, and maintain AWS database services.\n      </p>\n                <p>\n        Before you take this certification, AWS recommends at least five years of experience with database technologies, at least two years of hands-on AWS experience, and some time spent working with relational and non-relational databases.\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          Format: Multiple choice, multiple answer\n        </li>\n                  <li>\n          Length: 170 minutes\n        </li>\n                  <li>\n          Fee: $300\n        </li>\n                </ul>\n                <p>\n        If you're into complex networking projects, especially ones that span scalable AWS systems, then this cert is perfect for you. The exam requires you to know how to manage a network architecture for any service on the AWS platform and automate most networking tasks.\n      </p>\n                <p>\n        Before taking this exam, AWS recommends earning an <a href=\"https://aws.amazon.com/certification/certified-cloud-practitioner/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Certified Cloud Practitioner</a> cert or any of the associate certs. AWS also suggests five years of experience managing networks and a firm understanding of networking concepts and best practices related to the AWS platform.\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          Format: Multiple choice, multiple answer\n        </li>\n                  <li>\n          Length: 170 minutes\n        </li>\n                  <li>\n          Fee: $300\n        </li>\n                </ul>\n                <p>\n        This AWS exam is all about advanced methods for securing the AWS Cloud platform. Candidates for this cert should be seasoned IT security experts who can demonstrate expert-level knowledge of data protection and encryption techniques for AWS environments. You also must demonstrate a mastery of AWS tools for implementing and managing cloud security.\n      </p>\n                <p>\n        Before taking this certification, AWS recommends at least two years of hands-on experience securing AWS workloads and a minimum of five years of IT security experience.\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          Format: Multiple choice, multiple answer\n        </li>\n                  <li>\n          Length: 180 minutes\n        </li>\n                  <li>\n          Fee: $300\n        </li>\n                </ul>\n                <p>\n        This certification emphasizes designing and deploying machine learning solutions to solve practical business problems. You can expect questions that ask you to choose the best machine learning solution to a problem and why the chosen approach is better than others. You'll also need to understand which AWS services are relevant to delivering a machine-learning solution. And you'll need to know how to optimize your AWS services to deliver scalable, reliable, and secure solutions.\n      </p>\n                <p>\n        Before taking this exam, AWS recommends that candidates work in development or data science roles and have one to two years of experience using machine learning or deep learning on the AWS Cloud.\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          Format: Multiple choice, multiple answer\n        </li>\n                  <li>\n          Length: 180 minutes\n        </li>\n                  <li>\n          Fee: $300\n        </li>\n                </ul>\n                <p>\n        This cert tests your abilities with AWS data lakes and analytics services. That includes understanding how to design, build, secure, and maintain analytics solutions on AWS. You will need to know how to define AWS data analytics services to understand how they integrate securely. You will need to show how data analytics services fit in the data life cycle of collection, storage, processing, and visualization.\n      </p>\n                <p>\n        For this certification, AWS recommends at least five years of data analytics technology experience and at least two years of hands-on experience with the AWS Cloud.\n      </p>\n                <p>\n        Building your AWS Certification plan\n      </p>\n                <p>\n        As a Solutions Strategy Director and AWS expert for New Relic, people often ask me in what order they should take these exams. I recommend the following sequence for starting and turbocharging your cloud career:\n      </p>\n                <ol>\n                  <li>\n                    <a href=\"https://aws.amazon.com/certification/certified-solutions-architect-associate/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Certified Solutions Architect - Associate</a>\n                  </li>\n                  <li>\n                    <a href=\"https://aws.amazon.com/certification/certified-developer-associate/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Certified Developer - Associate</a>\n                  </li>\n                  <li>\n                    <a href=\"https://aws.amazon.com/certification/certified-sysops-admin-associate/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Certified SysOps Administrator - Associate</a>\n                  </li>\n                  <li>\n          Any specialty AWS certifications that interest you\n        </li>\n                  <li>\n                    <a href=\"https://aws.amazon.com/certification/certified-devops-engineer-professional/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Certified DevOps Engineer - Professional</a>\n                  </li>\n                  <li>\n                    <a href=\"https://aws.amazon.com/certification/certified-solutions-architect-professional/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Certified Solutions Architect - Professional</a>\n                  </li>\n                </ol>\n                <p>\n        Note that this route does not include the <a href=\"https://aws.amazon.com/certification/certified-cloud-practitioner/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Certified Cloud Practitioner</a> exam, which isn't terribly useful for anyone in a technical role. I recommend folks in technical roles begin with the AWS Certified Solutions Architect - Associate exam and go from there. This certification also covers topics you'll see again in the Developer and SysOps Administrator exams, which makes it a great up-front investment for anyone planning to take all three exams.\n      </p>\n                <p>\n        The knowledge gained prepping for the database, network, and security specialty certifications will help you with the two professional level certifications, but the others don't offer that extra edge.\n      </p>\n                <p>\n        Preparing for AWS exams-today and in the future\n      </p>\n                <p>\n        The AWS platform has always been a hotbed of innovation and constant, often rapid-fire change. While there's only so much AWS can do to address the effect of technology change on its exams, it does adhere to some guidelines that will keep your exam prep reasonably focused:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          AWS requires a new feature or service to be generally available (GA) for at least six months before allowing it to appear on an exam.\n        </li>\n                  <li>\n          As noted in its exam guides, AWS will discuss in broad terms which \"topic areas and objectives\" you'll find on an exam, although it won't discuss specific features and services.\n        </li>\n                  <li>\n          AWS \"regularly rotates questions in and out\" of its exams, but every question should remain within the exam's stated topic areas and objectives.\n        </li>\n                </ul>\n                <p>\n        As for the AWS exam prep process, you'll want to see for yourself <a href=\"https://aws.amazon.com/certification/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">what's available to get you ready for each exam</a>. Based on my experience, however, serious and thorough preparation for an Associate-level exam requires 120 hours or more-and the Speciality- or Professional-level exams are even more demanding.\n      </p>\n                <p>\n        Many engineers, especially younger ones, get into the zone during their exam prep and take two, three, or even more exams in a matter of months. I know the feeling, but I also strongly suggest resisting the urge to binge test. Instead, take a minimum of three to six months between each exam.\n      </p>\n                <p>\n        Consider when you'll need to re-certify: You might be in the zone today, but what about three, six, or even nine years down the line? When the time comes, preparing to re-certify when you have a family, and a career in mid-flight, and who knows what else happening in your life, could become an overwhelming burden if you have multiple certifications expiring within a short period. A little foresight today can pay huge benefits throughout the rest of your career.\n      </p>\n                <p>\n        Stay focused on your career goals, plan and prepare carefully for these exams, and move ahead with confidence that you've got a winning-and lucrative-career-building strategy.\n      </p>\n                <p>\n        Best of luck in your AWS certification journey!\n      </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://newrelic.com/blog/nerd-life/aws-cloud-certifications-explained\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>New Relic Inc.</strong> published this content on <strong>29 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>29 November 2021 16:38:16 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - New Relic Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: New-Relic-Inc.</p></div>"}