{"date": "2021-12-01 15:01:10+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n        Find out what all of this means for AWS customers and Matterport partners\n      </div>\n                <div>\n                  <div>\n                    <h4>\n            Brittany Schramm\n          </h4>\n                  </div>\n                  <div>\n          December 1, 2021\n        </div>\n                </div>\n                <div>\n                  <div>\n                    <p>\n                      <span>During the recent Amazon Web Services (AWS) re:Invent conference, our team made an exciting announcement: Matterport is now available on the</span>\n                      <span>\n                        <u>\n                          <span>AWS Marketplace</span>\n                        </u>\n                      </span>\n                      <span>, having officially become an AWS ISV partner and a member of the AWS Partner Network.</span>\n                    </p>\n                    <p>\n                      <span>Not only does our partnership mean that all of the capabilities of Matterport digital twins are being supercharged with existing AWS add-ons, but we also plan to deliver new, innovative joint offerings to the market together, in order to reach even more customers across the world.</span>\n                    </p>\n                    <p>\n                      <span>As we look toward the future, learn what the partnership between AWS and Matterport means for you.</span>\n                    </p>\n                    <h4>\n                      <span>\n                        <strong>\n                          <span>Powering digital twin technology with deep learning analytics</span>\n                        </strong>\n                      </span>\n                    </h4>\n                    <p>\n                      <span>For the past ten years, the team at Matterport has focused on making immersive 3D experiences available to everyone, ranging from individuals to Fortune 500 companies located around the world. Individuals can even easily start creating digital twins today</span>\n                      <span>\n                        <u>\n                          <span>if they own an iPhone or Android device</span>\n                        </u>\n                      </span>\n                      <span>. Now, through our partnership with AWS, we can take that mission even further.</span>\n                    </p>\n                    <p>\n                      <span>AWS customers can now access Matterport directly from the AWS Marketplace, the company's online software store that allows users to find, buy, and immediately start using new and innovative products. This means AWS customers can instantly unlock all of the benefits of Mattertport's digital twin technology, including:</span>\n                    </p>\n                    <ul class=\"bulleted-list arrowlist\">\n                      <li>\n                        <span>A new, digitized way to design, build, promote, and manage properties.</span>\n                      </li>\n                      <li>\n                        <span>Powerful spatial data insights and analytics.</span>\n                      </li>\n                      <li>\n                        <span>An enhanced understanding of how visitors interact and experience spaces.</span>\n                      </li>\n                    </ul>\n                    <p>\n                      <span>Through Matterport's Application Programming Interfaces (APIs) and Software Development Kits (SDKs) we're able to further empower our partners, like what AWS has done, to build new solutions and customized add-ons using our platform.</span>\n                    </p>\n                    <h4>\n                      <span>\n                        <strong>\n                          <span>Announcing AWS IoT TwinMaker</span>\n                        </strong>\n                      </span>\n                    </h4>\n                    <p>\n                      <span>With AWS, we also plan to continue developing new, best-in-class solutions for our customers, the first of which we've already announced at re:Invent this week: AWS IoT TwinMaker, a new Internet of Things (IoT) offering for manufacturing, smart buildings, IoT and industrial customers.</span>\n                    </p>\n                    <p>\n                      <span>AWS IoT TwinMaker serves as a powerful example of what is possible when companies like AWS and Matterport come together to create new and unique solutions for our mutual customers.</span>\n                      <span>By leveraging Matterport with the AWS IoT TwinMaker, here are a few of the ground-breaking features:</span>\n                      <span>:</span>\n                    </p>\n                    <ul class=\"bulleted-list arrowlist\">\n                      <li>\n                        <span>Ability to create 3D scenes with spatial anchors linked to data with Scene Composer.</span>\n                      </li>\n                      <li>\n                        <span>Enhanced facilities management by establishing real-time remote monitoring, process optimization and historical root cause analysis.</span>\n                      </li>\n                      <li>\n                        <span>Option to build user-centric web apps on top of digital twins, whether it's an app for training employees, or an app to trigger notifications if there is a change in the device data.</span>\n                      </li>\n                    </ul>\n                    <p>\n                      <span>With Matterport as a launch partner, customers will be able to use AWS IoT TwinMaker to contextualize their digital twin data, gather insights and analytics, and virtually access real-time and time-series replicas of their spaces anytime, anywhere. Learn more about AWS IoT TwinMaker</span>\n                      <span>\n                        <u>\n                          <span>here</span>\n                        </u>\n                      </span>\n                      <span>.</span>\n                    </p>\n                  </div>\n                  <div>\n                    <div>\n                      <p>\n              <a href=\"https://matterport.com/blog/matterport-becomes-amazon-web-services-aws-partner\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://matterport.com/blog/matterport-becomes-amazon-web-services-aws-partner</a>\n            </p>\n                    </div>\n          Copy\n        </div>\n                </div>\n                <div>\n                  <h4>\n          Categories\n        </h4>\n                  <div>\n                    <div>\n                      <div>\n              Residential Real Estate\n            </div>\n                      <div>\n              Commercial Real Estate\n            </div>\n                      <div>\n              3D Photography\n            </div>\n                      <div>\n              Education\n            </div>\n                      <div>\n              Homeowners\n            </div>\n                      <div>\n              Retail\n            </div>\n                      <div>\n              Travel &amp; Hospitality\n            </div>\n                      <div>\n              Insurance &amp; Restoration\n            </div>\n                      <div>\n              Architect/Engineer/Construct\n            </div>\n                      <div>\n              Facilities Management\n            </div>\n                    </div>\n                    <div>\n            New &amp; Noteworthy\n          </div>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://matterport.com/blog/matterport-becomes-amazon-web-services-aws-partner\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Matterport Inc.</strong> published this content on <strong>01 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>01 December 2021 15:01:10 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Matterport Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Matterport-Inc.</p></div>"}