{"date": "2021-11-04 13:19:37.203000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>E-commerce retailer Amazon has reported that its net sales were up 15% to $110.8bn in the third quarter of 2021 compared with $96.1bn in the previous year quarter.</p><p>In a conference call, Amazon chief financial officer Brian Olsavsky said that its customers, especially Prime members, increased their annual purchases in the past 20 months.The company has nearly doubled its operations capacity to meet customer demand in the past two years.During the quarter that ended 30 September, the company's net income dropped to $3.2bn compared to $6.3bn in the same period last year.Earnings per share (EPS) was $6.12 against $12.37 in the same 2020 quarter, the sharpest year-over-year (YoY) decline since the second quarter of 2017.Operating income also declined to $4.9bn in the third quarter, compared with $6.2bn in the same period in the previous year.Olsavsky said that the company incurred billions of dollars in additional costs to support Covid-19 testing and other related expenses and keep its employees safe.Over the last 18 months, the company's global headcount increased by 628,000 and will continue to grow to meet demand.Olsavsky said: \"This demand for labour has recently coincided with the shortage of available workers particularly in the US that began in Q2, but it really started to impact our operations and cost structure in Q3.\"For the fourth quarter, Amazon expects its net sales to grow between 4% and 12% to between $130bn and $140bn compared with the fourth quarter of 2020.It also expects operating income to be between around $3bn against $6.9bn in the fourth quarter of 2020.Amazon CEO Andy Jassy Andy Jassy said: \"In the fourth quarter, we expect to incur several billion dollars of additional costs in our Consumer business as we manage through labour supply shortages, increased wage costs, global supply chain issues, and increased freight and shipping costs, all while doing whatever it takes to minimise the impact on customers and selling partners this holiday season. It'll be expensive for us in the short term, but it's the right prioritisation for our customers and partners.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}