{"date": "2021-12-03 15:36:02.818000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3443.72, "close": 3389.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Dec 02, 2021</p></div><div class=\"tr-npp-lead\"><p>Chicago, IL – December 2, 2021 – Zacks Director of Research Sheraz Mian says, \"We remain positive in our earnings outlook, as we see the overall growth picture steadily improving, as the near-term logistical issues get addressed.\"</p><p><span>Note: The following is an excerpt from this week's <a href=\"https://www.zacks.com/ZER/zer_get_pdf.php?r=H8395402113&amp;ADID=ZP_Article_EarningsTrends\"><span>Earnings Trends</span></a> report. You can access the full report that contains detailed historical actual and estimates for the current and following periods, <a href=\"https://www.zacks.com/ZER/zer_get_pdf.php?r=H8395402113&amp;ADID=ZP_Article_EarningsTrends\"><span>please click here&amp;gt;&amp;gt;&amp;gt;</span></a> </span> </p></div><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">For Immediate Release</p><p class=\"tr-npp-section-title\"> Looking Ahead to Q4 Earnings Season </p><p>The market has been focused on the rising cost of inputs and labor and other supply chain issues for the last few months. There was tangible nervousness in the market ahead of the start of the Q3 earnings season that these headwinds will start weighing on corporate profits through compressed margins.</p><p>We saw some of that in the Q3 reporting cycle, with a number of companies struggling to effectively deal with higher input and labor costs. Even mighty<span>Apple</span><a href=\"https://www.zacks.com/stock/quote/AAPL\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AAPL</a> and<span>Amazon</span><a href=\"https://www.zacks.com/stock/quote/AMZN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AMZN</a> came up short in their quarterly reports as a result of these developments. But many other companies have been able to pass on higher costs to the end consumer.</p><p>Higher expenses prompted Amazon to cut 2021 Q4 guidance, with the company outlining $6 billion in incremental higher outlays, of which $2 billion was on account of labor cost inflation. Supply-chain issues were behind Apple's revenue miss, with the logistical challenge shaving an estimated $6 billion from the company's Q3 top line.</p><p>While these unfavorable cost trends may not have had as much negative impact on earnings as many had feared ahead of the start of the Q3 reporting cycle, they still remain a risk to long-term earnings trends. In fact, a number of sectors where the margin cushion is already fairly thin, struggled with these trends.</p><p>A notable sector suffering such a margin squeeze in the ongoing Q3 reporting cycle is Consumer Staples whose Q3 earnings growth of +5.8% on +13.9% includes a 110 basis-point net margin contraction. The Utilities, Autos, Retail and Construction sectors suffered margin squeezes, though relatively less pronounced compared to Consumer Staples.</p><p>Net margins for the index as a whole are expected to expand 81 basis points in 2021 Q4, though they are expected to be below the year-earlier level for 6 of the 16 Zacks sectors. These include Consumer Staples, Utilities, Industrials, Retail, Autos and Technology.</p><p>These margin pressures have been a big contributing factor to the recent negative shift in the revisions trend, which consistently remained positive since July 2020. You can see this in the revisions trend for 2021 Q4.</p><p>We remain positive in our earnings outlook, as we see the overall growth picture steadily improving, as the near-term logistical issues get addressed.</p><p>Follow us on Twitter: <a href=\"https://twitter.com/zacksresearch\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/zacksresearch</a> </p><p>Join us on Facebook: <a href=\"https://www.facebook.com/home.php#/pages/Zacks-Investment-Research/57553657748?ref=ts\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.facebook.com/home.php#/pages/Zacks-Investment-Research/57553657748?ref=ts</a> </p><p>Zacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates.</p><p>Media Contact</p><p>Zacks Investment Research</p><p>800-767-3771 ext. 9339</p><p><a href=\"mailto:support@zacks.com\" data-type=\"email\" translate=\"no\">support@zacks.com</a> </p><p><a href=\"https://www.zacks.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.zacks.com</a> </p><p>Zacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. <a href=\"https://www.zacks.com/disclaimer/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.zacks.com/disclaimer</a> .</p><p>Past performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&amp;P 500 is an unmanaged index. Visit <a href=\"https://www.zacks.com/performance\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.zacks.com/performance</a> for information about the performance numbers displayed in this press release.</p><p><span>Infrastructure Stock Boom to Sweep America</span></p><p>A massive push to rebuild the crumbling U.S. infrastructure will soon be underway. It's bipartisan, urgent, and inevitable. Trillions will be spent. Fortunes will be made.</p><p>The only question is \"Will you get into the right stocks early when their growth potential is greatest?\"</p><p>Zacks has released a Special Report to help you do just that, and today it's free. Discover 7 special companies that look to gain the most from construction and repair to roads, bridges, and buildings, plus cargo hauling and energy transformation on an almost unimaginable scale.</p><p><a href=\"https://www.zacks.com/registration/ultimatetrader/welcome/eoffer/3b9f?add=1728&amp;adid=NEWSTEX_CONTENT_ZU_INFRASTRUCTUREREPORT_PRESSRELEASES_12022021&amp;cid=CS-NEWSTEX-FT-press_releases-1834235\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Download FREE: How to Profit from Trillions on Spending for Infrastructure &gt;&gt;</a></p><p>Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.</p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=RPT_7BST_LP194&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_PRESSRELEASES&amp;cid=CS-NEWSTEX-FT-press_releases-1834235\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Click to get this free report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=AMZN&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_PRESSRELEASES&amp;cid=CS-NEWSTEX-FT-press_releases-1834235\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. (AMZN): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=AAPL&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_PRESSRELEASES&amp;cid=CS-NEWSTEX-FT-press_releases-1834235\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Apple Inc. (AAPL): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/stock/news/1834235/zacks-earnings-trends-highlights-apple-and-amazon?cid=CS-NEWSTEX-FT-press_releases-1834235\" data-type=\"url\" class=\"tr-link\" translate=\"no\">To read this article on Zacks.com click here.</a></p><p><a href=\"http://www.zacks.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Zacks Investment Research</a></p><p>The views expressed in any and all content distributed by Newstex and its re-distributors (collectively, the \"Newstex Authoritative Content\") are solely those of the respective author(s) and not necessarily the views of Newstex or its re-distributors. Stories from such authors are provided \"AS IS,\" with no warranties, and confer no rights. The material and information provided in Newstex Authoritative Content are for general information only and should not, in any respect, be relied on as professional advice. Newstex Authoritative Content is not \"read and approved\" before it is posted. Accordingly, neither Newstex nor its re-distributors make any claims, promises or guarantees about the accuracy, completeness, or adequacy of the information contained therein or linked to from such content, nor do they take responsibility for any aspect of such content. The Newstex Authoritative Content shall be construed as author-based content and commentary. Accordingly, no warranties or other guarantees are offered as to the quality of the opinions, commentary or anything else appearing in such Newstex Authoritative Content. Newstex and its re-distributors expressly reserve the right to delete stories at its and their sole discretion.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Zacks Investment Research</p></div>"}