{"date": "2021-11-08 16:34:00.179000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>AWS Announces Plans to Open Second Region in Canada</b>\n</p><p class=\"bwalignc\">\n<span>New AWS Canada West (Calgary) Region will be available in late 2023/early 2024, providing customers with even lower latency, greater fault tolerance, and resiliency for critical cloud workloads</span>\n</p><p class=\"bwalignc\">\n<span>Newly released AWS economic impact study estimates that AWS will invest over $17 billion (CA$21 billion) in Canada by 2037 on the construction and operation of its two infrastructure Regions </span>\n</p><p>\nToday, Amazon Web Services, Inc. (AWS), an <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2FAmazon.com&amp;esheet=52524624&amp;newsitemid=20211108005823&amp;lan=en-US&amp;anchor=Amazon.com%2C+Inc.&amp;index=1&amp;md5=95c5babda4f9f434c95d7c19cce15ef6\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc.</a> company (NASDAQ: AMZN), announced plans to open an infrastructure Region in Alberta, Canada, in late 2023/early 2024. The new AWS Canada West (Calgary) Region will consist of three Availability Zones (AZs) at launch and join the existing AWS Canada (Central) Region in Montreal, which also consists of three Availability Zones. Globally, AWS has 81 Availability Zones across 25 geographic regions, with plans to launch 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. The upcoming AWS Canada West (Calgary) Region will enable even more developers, startups, and enterprises, as well as government, education, and nonprofit organizations, to run their applications and serve end users from data centers located in Canada. AWS also released an <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fpages.awscloud.com%2Frs%2F112-TZM-766%2Fimages%2FGEN_aws-economic-impact-canada_Nov-2021.pdf&amp;esheet=52524624&amp;newsitemid=20211108005823&amp;lan=en-US&amp;anchor=economic+impact+study+%28EIS%29&amp;index=2&amp;md5=56a30723e1dc8f91b1974c06226c309b\" data-type=\"url\" class=\"tr-link\" translate=\"no\">economic impact study (EIS)</a> estimating that the company’s spending on construction and the operation of the new AWS Canada West (Calgary) Region and existing AWS Canada (Central) Region in Montreal will together create more than 5,000 new jobs with an estimated investment of over $17 billion (CA$21 billion) in the local economies by 2037. Both infrastructure Regions will add an estimated $31.6 billion (CA$39 billion) to Canada’s GDP over the same time period. For more information on AWS’s global infrastructure, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fabout-aws%2Fglobal-infrastructure%2F&amp;esheet=52524624&amp;newsitemid=20211108005823&amp;lan=en-US&amp;anchor=aws.amazon.com%2Fabout-aws%2Fglobal-infrastructure%2F&amp;index=3&amp;md5=7c0d6153285a6f10187b9997b6faf4f9\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com/about-aws/global-infrastructure/</a>.\n</p><p>\n“Our infrastructure in Canada has allowed customers to transform the way businesses, educational institutions, and government agencies serve their stakeholders. With another AWS Region in Canada, customers will see even lower latency for emerging solutions like 5G-enabled applications and machine learning at the edge, and it will strengthen their ability to architect their regional infrastructure for even greater fault tolerance, resiliency, and availability,” said Prasad Kalyanaraman, Vice President of Infrastructure Services at AWS. “We are excited to build world-class infrastructure to help organizations reinvent how they deliver customer solutions and fuel economic growth.”\n</p><p>\n“This major investment from AWS again demonstrates that Alberta is establishing itself as a dominant player in digital technology and innovation. This multibillion-dollar data center project in our province underscores the work being done by Invest Alberta to create jobs and diversify the economy,” said Alberta Premier Jason Kenney. “I look forward to working with AWS on this project and seeing how it will strengthen Alberta’s information technology and communication sector.”\n</p><p>\nAWS Regions are composed of Availability Zones that place infrastructure in separate and distinct geographic locations. Availability Zones are located far enough from each other to support customers’ business continuity but near enough to provide low latency for high availability applications that use multiple Availability Zones. Each Availability Zone has independent power, cooling, and physical security, and is connected through redundant, ultra-low latency networks. AWS customers focused on high availability can design their applications to run in multiple Availability Zones to achieve even greater fault tolerance. The AWS Canada West (Calgary) Region will enable customers with data residency preferences to securely store data in Canada while providing even lower latency across the country and more flexibility to run applications across multiple Regions.\n</p><p>\nOverall, AWS is estimated to invest over $17 billion (CA$21 billion) in Canada by 2037 through the construction and operation of its two infrastructure Regions. This AWS infrastructure investment is expected to increase Canada’s GDP by approximately more than $31 billion (CA$39 billion) over the same time period. In the newly announced AWS Canada West (Calgary) Region, AWS plans to invest over $3 billion (CA$4 billion)<span> </span>by 2037, which includes capital expenditures on the construction of data centers, operational expenses such as ongoing utilities and facility costs, and purchases of goods and services from regional businesses. The EIS also estimates that the new AWS Region will bring direct and indirect economic benefits like new employment and sales for the data center supply chain and related sectors in Canada. In total, investment in the new AWS Canada West (Calgary) Region is estimated to create more than 950 new full-time equivalent (FTE) jobs in Canada.\n</p><p>\n<b>Customers and AWS Partners Welcome the AWS Canada West (Calgary) Region</b>\n</p><p>\nCustomers in Canada will join the millions of active customers using AWS every month in over 190 countries around the world. Canadian organizations, including Air Canada, Athabasca University, Benevity, BMO Financial Group, Canada Border Services Agency, D2L, Hootsuite, Humber College, Keyera, Neo Financial, NHL, Nutrien, lululemon athletica, Provincial Health Services Authority, Porter Airlines, Sun Life, Trimac Transportation, and Vancouver General Hospital choose AWS to run their workloads to drive cost savings, accelerate innovation, and speed time to market.\n</p><p>\nSun Life is a leading international financial services organization providing life, health, and wealth solutions to individual and corporate clients. “Through our digital transformation, we’re constantly innovating to enhance what we do to help our clients achieve lifetime financial security and live healthier lives,” said Laura Money, Executive Vice President and Chief Information Officer at Sun Life. “With today’s announcement of a second AWS Region in Canada, we will add another layer of business resiliency to further support our clients who need to keep their data in Canada.”\n</p><p>\nThe Provincial Health Services Authority (PHSA) is the backbone of British Columbia's healthcare system, ensuring that 5 million residents have access to a network of specialized healthcare services and programs. When the COVID-19 pandemic hit, PHSA provided COVID-19 test results and vaccination booking. “Using Amazon Pinpoint, PHSA delivered millions of text messages and emails confirming registrations, booking notifications, and vaccine appointment reminders to British Columbians,” said Shannon Malovec, Chief Digital Innovation Officer at PHSA. “AWS enabled us to scale up our communications quickly. We see the value in using the latest technology to serve our citizens, and this new AWS Region in western Canada will help us and many other organizations unlock innovation.”\n</p><p>\nKidoodle.TV is a Calgary-based children’s streaming service with more than 100 million downloads in 235 countries and territories worldwide. “I’ve been using AWS in the media and entertainment industry for so long that I can’t imagine a world without it. It’s integral to our ability to release new features and products quickly,” said Daniel Riddell, Chief Technology Officer at Kidoodle.TV. “Because the AWS Cloud existed when we started this company, we could build everything off premises. We didn’t have the need for huge overhead costs. We could build essentially the same service architecture that multibillion-dollar companies were able to deploy. When COVID hit, our numbers spiked. We used AWS Elemental MediaTailor and other AWS services to scale up our monthly active users by 3,200% in one year and quickly pivot our ad delivery process.”\n</p><p>\nAthabasca University (AU), Canada’s Online University, is one of the world’s fastest-growing online and open education institutions serving more than 43,000 students across 87 countries. AU became the first Canadian post-secondary institution to move its entire digital operational infrastructure to AWS last year. “I like to say that ‘there is no innovation at scale without a solid foundation.’ AU’s move to AWS in 2020 was the foundation of our digital transformation strategy, providing the infrastructure and cost savings that will allow us to make personalized learning for our students an infinitely scalable reality,” said Jennifer Schaeffer, AU Vice President of Information Technology and Chief Information Officer. “Not only have we transformed our digital foundation, but we’ve also moved cloud into the forefront with our curriculum. We are helping train the next generation of cloud professionals through the AU PowerEDTM and AWS Academy Cloud Foundations programs.”\n</p><p>\nAs one of Canada’s largest independent midstream companies, Keyera operates an integrated energy infrastructure business with extensive interconnected assets. Keyera plays a crucial role in processing, transporting, and marketing clean-burning natural gas and natural gas liquids that responsibly fuel modern life across North America. “Part of how we provide sustainable and responsible energy is by collaborating with a strong technology innovation partner. We recognize the need for digital innovation as a way to provide our customers with increased accuracy and reliability. Working with AWS, we built a new machine learning application that proactively identifies issues in metering, which enables us to respond and react within days compared to weeks. To date, we have seen significant metering improvements for Keyera and our customers, and based on this success, we are expanding its deployment to two additional facilities,” said Kelly Hill, Vice President of Information Technology at Keyera. “Working with AWS means we have built a digital innovation platform for our current and future needs. AWS Professional Services is helping us transform our digital business through new applications and services such as Amazon Rekognition for asset tracking using computer vision, and other services like Amazon SageMaker and Amazon QuickSight for business intelligence and dashboarding in our measurement initiative. We’re excited to continue collaborating with AWS to advance our innovation journey.”\n</p><p>\nBorn on AWS, Neo Financial is a financial tech startup that uses the elasticity of the AWS Cloud to scale its business. “When we launched in 2019, we needed a cloud provider to help us scale and meet the regulatory requirements we face as a financial services company. Our customers also have compliance mandates that require their data to be kept in Canada,” said Kris Read, co-founder and CTO at Neo Financial. “Today, we use Amazon Elastic Compute Cloud for our core infrastructure and Amazon Simple Storage Service for its highly durable storage. We also have improved security with Amazon GuardDuty and improved performance for our customers with Amazon CloudFront.”\n</p><p>\nCanada-based partners are part of the AWS Partner Network (APN), which includes over 100,000 independent software vendors (ISVs) and systems integrators (SIs) around the world. AWS Partners build innovative solutions and services on AWS, and the APN provides business, technical, marketing, and go-to-market support to customers. APN SIs, consulting partners, and ISVs help enterprise and public sector customers migrate to AWS, deploy mission-critical applications, and provide a full range of monitoring, automation, and management services for customers’ environments. Examples of AWS Canada Partners include Accenture, Bell Canada, Deloitte, FuseForward, FX Innovation, Levio, OpsGuru, Rackspace, Slalom, Softchoice, Qalius, Quantiphi, and Xerris. AWS ISVs in Canada including Arctic Wolf, Benevity, CrowdStrike, D2L, Lightspeed POS, Salesforce, SmartSimple, Tidal Migrations, Vidyard, and Workday are already using AWS to deliver their software to customers around the world and plan to serve their Canadian customers from the AWS Canada West (Calgary) Region at launch. For the full list of APN members, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fpartners&amp;esheet=52524624&amp;newsitemid=20211108005823&amp;lan=en-US&amp;anchor=aws.amazon.com%2Fpartners&amp;index=4&amp;md5=1cc8f37b5a643a16032df34378040780\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com/partners</a>.\n</p><p>\nXerris Inc., an advanced AWS Partner based in Calgary, Alberta, specializes in providing technology-focused solutions for media and entertainment, energy, public sector, and retail companies. “We’ve been working with AWS for a number of years, and in 2020, we really ramped up our operations—growing from an eight-person team to well over 100 people,” said Jeremy Tooley, CEO at Xerris. “We’ve been helping customers in the Calgary area like StellarAlgo scale and optimize their data solutions to use machine learning models to provide valuable insights into fan behavior and retention at live sports and entertainment events. We are also working with Nutrien, Burnco, enerPlus, and Aldo on a variety of transformation and foundational projects. The AWS Cloud offers a wide range of services that help our customers operate with agility and scale. We welcome the continued growth and investment AWS is putting into Canada.”\n</p><p>\nSlalom, a global consulting firm focused on strategy, technology, and business transformation with more than 11,000 employees in 41 markets around the world, has the autonomy to move fast and build for its customers. “Slalom and AWS have partnered and completed more than 1,500 projects together on migration, modernization, data analytics, and overall cloud strategies, leading to Slalom investing and growing operations through the AWS Canada (Central) Region beginning in 2016,” said Wayne Ingram, Country General Manager of Slalom Canada. “Through this partnership, Slalom Canada has grown to more than 750 employees over the last five years, including 150 in western Canada across Vancouver and Calgary. With Canadian customers such as <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Furldefense.com%2Fv3%2F__https%3A%2Fwww.slalombuild.com%2Four-work%2Floyaltyone__%3B%21%21Jrgwm_wKFTPpVg%21YvBeyRev3JsqPCcsuEumq4XGjgYdTrtMOo64pYi2ge6yM1zwjBQvbbPgQVzIiRai1A%24&amp;esheet=52524624&amp;newsitemid=20211108005823&amp;lan=en-US&amp;anchor=LoyaltyOne&amp;index=5&amp;md5=34be684ad55972ed30909a90bf0d468c\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LoyaltyOne</a>, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Furldefense.com%2Fv3%2F__https%3A%2Faws.amazon.com%2Fsolutions%2Fcase-studies%2Ftc-energy%2F__%3B%21%21Jrgwm_wKFTPpVg%21YvBeyRev3JsqPCcsuEumq4XGjgYdTrtMOo64pYi2ge6yM1zwjBQvbbPgQVwMVVs3aQ%24&amp;esheet=52524624&amp;newsitemid=20211108005823&amp;lan=en-US&amp;anchor=TC+Energy&amp;index=6&amp;md5=b56744a2090e18ace7426070ed67d0e6\" data-type=\"url\" class=\"tr-link\" translate=\"no\">TC Energy</a>, and many others, we’re especially excited to see the increased interest and need for cloud strategies and look forward to even more innovation in this country.”\n</p><p>\n<b>Investing in Canada’s Future</b>\n</p><p>\nIn addition to the AWS Canada (Central) Region in Montreal, AWS has launched five Amazon CloudFront edge locations in Vancouver, Toronto, and Montreal. Amazon CloudFront is a highly secure and programmable content delivery network (CDN) that accelerates the delivery of data, videos, applications, and APIs to users worldwide with low latency and high transfer speeds. Amazon opened tech hubs in Toronto and Vancouver for developers, engineers, sales, marketing, and business development professionals to help local customers and partners, and opened the AWS Thinkbox office in Winnipeg focused on the development of solutions and services for the creative industry. In March 2021, Amazon Games launched a new development studio in Montreal, and Amazon currently has 17 fulfillment centers, six sortation centers, and 35 delivery stations across the country. Amazon employs more than 39,500 full-time and part-time employees, and the company has announced plans to create thousands of additional jobs in the country across its operations network and teams including AWS, Amazon Ads, Amazon Games, Alexa, and Prime Video.\n</p><p>\n<b>Upskilling Canada’s Workforce</b>\n</p><p>\nAWS continues to invest in upskilling developers, students, and the next generation of IT leaders in Canada through programs like AWS re/Start, AWS Academy, and AWS Educate, and since 2013, has helped train more than 100,000 individuals with cloud computing skills. These AWS Education Programs help learners of all backgrounds and experiences prepare for careers in the cloud. From college courses to full-time training programs and self-paced learning content, AWS Education Programs offer access to the skills needed to begin a career in cloud computing. With the support of Calgary Economic Development’s <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.edgeupyyc.com%2F&amp;esheet=52524624&amp;newsitemid=20211108005823&amp;lan=en-US&amp;anchor=Edge+Up&amp;index=7&amp;md5=07a3645f7005c310adc8d0d7630f9058\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Edge Up</a> 2.0 program, AWS and Mount Royal University have teamed up to bring the AWS re/Start program to Calgary in early 2022. The AWS re/Start job skills training program will prepare individuals for entry level roles in cloud computing and connect them to potential employers as part of Amazon’s commitment to help <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faboutamazon.com%2F29million&amp;esheet=52524624&amp;newsitemid=20211108005823&amp;lan=en-US&amp;anchor=29+million+people&amp;index=8&amp;md5=516d62898cb234694fc113e4987510d0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">29 million people</a> around the world grow their tech skills with free cloud computing training by 2025.\n</p><p>\n<b>Commitment to Sustainability</b>\n</p><p>\nAmazon is committed to running its business in an environmentally friendly way and has committed to reach net zero carbon across all business operations by 2040, 10 years ahead of the Paris Agreement, as part of <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fsustainability.aboutamazon.com%2Fabout%2Fthe-climate-pledge&amp;esheet=52524624&amp;newsitemid=20211108005823&amp;lan=en-US&amp;anchor=The+Climate+Pledge&amp;index=9&amp;md5=f5ff631cbc48c5cd4a216d949f53cacd\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Climate Pledge</a>. A key component of this commitment is powering Amazon’s global infrastructure with 100% renewable energy, and the company is now on a path to achieve this milestone by 2025, five years ahead of the initial 2030 target. Amazon also became the world’s largest corporate purchaser of renewable energy in 2020, reaching 65% renewable energy across its business. In April 2021, Amazon announced its first renewable energy project in Canada—an 80 megawatt (MW) solar project in the County of Newell in Alberta. Once complete, the project will contribute an estimated 195,000 megawatt hours (MWh) of renewable energy to the grid, which is enough energy to power more than 18,000 Canadian homes for a year. In June 2021, Amazon announced its second and largest renewable energy project in Canada—a 375 MW solar farm in Vulcan, Alberta. When it comes online next year, the project will bring Amazon’s capacity in Canada to more than 1 million MWhs, which is enough to power more than 100,000 Canadian homes for a year. These projects will contribute to powering Amazon’s global infrastructure. More information on AWS sustainability efforts can be found at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fabout-aws%2Fsustainability&amp;esheet=52524624&amp;newsitemid=20211108005823&amp;lan=en-US&amp;anchor=aws.amazon.com%2Fabout-aws%2Fsustainability&amp;index=10&amp;md5=07c87940add288815260a5c9b9ad213e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com/about-aws/sustainability</a>.\n</p><p>\n<strong>About Amazon Web Services</strong>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com&amp;esheet=52524624&amp;newsitemid=20211108005823&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=11&amp;md5=d0fc247ea5f6d69971f8e046462ba414\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<strong>About Amazon</strong>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Famazon.com%2Fabout&amp;esheet=52524624&amp;newsitemid=20211108005823&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=12&amp;md5=aa90888cb08c42a69c4ccff7e032c8d8\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211108005823r1&amp;sid=ny6r1&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTA4MDA1ODIzcjEmc2lkPW55NnIxJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=8778e19c9ddf51e546ebff479d2cc1f30c64af13acf69b93557fcf3310359e3b7ce9578eabff7e109e558a38ac8c11948ff2ac762d568a1f00ce51ab8c829aa7\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211108005823/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211108005823/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52524624&amp;newsitemid=20211108005823&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=13&amp;md5=483481c99c59de229747eaa3abce2cd5\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON-WEB-SERVICES</p></div>"}