{"date": "2022-01-13 23:43:05.122000+00:00", "ticker": "III", "mrkt_info": {"open": 1434.5, "close": 1415.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENBRIDGE INC (\"ENB-TN\")\n- To Host Webcast to Discuss 2021 Fourth Quarter and Full-Year\n- Results on Feb. 11\n\n     Enbridge Inc. (Enbridge or the Company) will host a conference call\nand webcast to provide a business update and review 2021 fourth quarter and\nfull-year results on Feb. 11, 2022 at 7:00 a.m. MT (9:00 a.m. ET).\n\n     The conference call format will include prepared remarks from the\nexecutive team followed by a question and answer session for the analyst\nand investor community only. Enbridge's media and investor relations teams\nwill be available after the call for any additional questions.\n\n     Enbridge will announce its financial results before markets open on\nFeb. 11, 2022.\n\n     2021 Fourth Quarter Earnings Webcast and Conference Call\n\n     Details of the webcast\n\n//st\n\n  When:      Friday, Feb.11, 2022\n\n             7:00 a.m. MT (9:00 a.m. ET)\n\n  Webcast:   Sign-up\n\n  Call:      Dial-in (Audio only - please dial in 15 minutes ahead):\n\n             North America Toll Free:                         (833)\n233-4460\n\n             Outside North America:                           (647)\n689-4543\n\n             Conference ID:                                   6486063\n\n//et\n\n     A webcast replay, as well as a transcript which will be posted to\nEnbridge's website, will be available shortly after the conclusion of the\nevent.\n\n     About Enbridge Inc.Enbridge Inc. is a leading North American energy\ninfrastructure company. We safely and reliably deliver the energy people\nneed and want to fuel quality of life. Our core businesses include Liquids\nPipelines, which transports approximately 25 percent of the crude oil\nproduced in North America; Gas Transmission and Midstream, which transports\napproximately 20 percent of the natural gas consumed in the U.S.; Gas\nDistribution and Storage, which serves approximately 3.8 million retail\ncustomers in Ontario and Quebec; and Renewable Power Generation, which owns\napproximately 1,766 megawatts (net) in renewable power generation capacity\nin North America and Europe. The Company's common shares trade on the\nToronto and New York stock exchanges under the symbol ENB. For more\ninformation, visit www.enbridge.com.\n\n     FOR FURTHER INFORMATION PLEASE CONTACT:\n\n     MediaToll Free: (888) 992-0997Email: [email protected]\n\n     Investment CommunityToll Free: (800) 481-2804Email: [email protected]\n\nTel   : 403-231-3900    ENBRIDGE INC CUM REDEEMABLE PR SHARES SERIES L\nFax   : 403-231-5929\nEmail : CorporateSecretary@enbridge.com\nWWW   : <a href=\"https://www.enbridge.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.enbridge.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201201058.MNPRE2201203416-15274220220113</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}