{"date": "2022-02-08 16:41:17.825000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>RACKSPACE TECHNOLOGY INC (\"RXT-Q\")\n- Works with VoltaGrid to Generate Cost Savings with Cloud Native\n- Solutions That Provide Optimization of Energy Generation and\n- Consumption\n\n     Rackspace Technology(R) a leading end-to-end, multicloud technology\nsolutions company, announced its collaboration with VoltaGrid to deploy a\nsecure, serverless cloud-native solution that leverages IoT, Machine\nLearning (ML) and Artificial Intelligence (AI) in AWS for its\nsoftware-controlled and managed mobile electric microgrids.\n\n     Founded in 2020, VoltaGrid is based in North America and deploys\nmobile microgrids to provide power in remote locations. The company is\nserving energy companies that need electricity to power the hydraulic\nfracturing processes used to extract oil and gas. VoltaGrid also provides\nenergy-generation services to data centers, industrial facilities, and\nmedical centers, and has the capability to add power to a city grid.\n\n     VoltaGrid's microgrid solution consists of a natural gas fired\nreciprocating engine that sits on a 52-foot trailer weighing over 100,000\npounds. Ten trailers working together can generate an astonishing 26\nmegawatts of electricity at 13,500 volts.\n\n     VoltaGrid is committed to transforming the world through its\nbest-in-class, clean, affordable, intelligent energy technologies and\nenabling their partners to focus on their core competencies while offering\na practical avenue to improve their ESG performance.\n\n     The Solution\n\n     Rackspace Technology leveraged an agile workflow to deploy a secure,\nserverless cloud native solution in AWS for VoltaGrid's\nsoftware-controlled, cloud-native solution that leverages IoT, ML and AI\nfor its managed mobile electric microgrids to optimize operations for\nVoltaGrid customers.\n\n     As part of the solution, an edge device, HiveCell, was fitted to each\nVoltaGrid managed mobile electric microgrid's trailer which allowed\nsoftware to be deployed at the edge. The IoT technology on the mobile\ntrailers captures data and sends it to the cloud. The scalable, seamless\nsolution was built to collect data that quantifies power usage and\nemissions output from the mobile trailers in real-time.\n\n     In addition, VoltaGrid worked with Onica by Rackspace Technology(R) to\ndesign and deploy an end-to-end cloud native solution that incorporated an\nedge device by leveraging ML and AI, to build a customer-facing portal. The\nVoltaGrid customer-facing portal, determines how data is ingested, stored,\nand refined and can monitor, measure and report on each customer's power\nconsumption, fuel costs and emissions in real-time at remote locations.\n\n     \"The VoltaGrid project, including fitting the trailers with IoT\ntechnology, building the entire cloud infrastructure, and creating the\napplication, was completed in less than a year,\" said Jeff DeVerter, Chief\nTechnology Evangelist at Rackspace Technology. \"VoltaGrid was able to\nlaunch its service and enhance its product offering quicker than had been\ninitially predicted, allowing VoltaGrid to sell mobile power services to\ncustomers more quickly.\"\n\n     \"VoltaGrid had to build the mobile electric microgrids solution fast\nand by working with Rackspace Technology we were able to quickly and easily\naccess the expertise that was needed when we needed it,\" said, John\nChavner, Director, Technology and Cloud Development, VoltaGrid. \"Rackspace\nTechnology understood our entire AWS ecosystem from a business standpoint,\nand they helped us get off the ground and I'm very thankful for that.\"\n\n     To learn more about the VoltaGrid's Rackspace Technology solution\nclick here.\n\n     About Rackspace Technology\n\n     Rackspace Technology is a leading end-to-end multicloud technology\nservices company. We can design, build, and operate our customers' cloud\nenvironments across all major technology platforms, irrespective of\ntechnology stack or deployment model. We partner with our customers at\nevery stage of their cloud journey, enabling them to modernize\napplications, build new products and adopt innovative technologies.\n\n Contact Information:\n\nContact:Natalie Silva\nRackspace Technology Corporate Communications\npublicrelations@rackspace.com\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203800475.MNPRE2203802456-08245020220208</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}