{"date": "2022-01-31 15:43:13.474000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>PLANTFUEL LIFE INC (\"FUEL-Z;PLFLF-0\")\n- Is Officially Available on Amazon's Exclusive Launchpad Platform\n\n     Demand for vegan products on Amazon continues to accelerate. PlantFuel\nplans to turbocharge its digital channel sales partnering with the world's\nbiggest online marketplace.\n\n      PlantFuel Life Inc. (\"PlantFuel\" or the \"Company\")announces that its\nnew PlantFuel line of revolutionary, plant-based supplements and\nnutritional products is now available on Amazon's Launchpad platform, which\nempowers innovative brands.\n\n     PlantFuel was founded byBrad Pyatt. A nutrition industry veteran and\nformer NFL athlete, Pyatt now brings the next big thing to sports nutrition\nand customers that seek plant-based products.\n\n     Amazon Launchpad is unique. It showcases promising products from\nstartups with powerful founding stories, then gives them promotional perks\nincluding chances to be featured in Amazon emails, Instagram, on their\nhomepage or via other Amazon campaigns. On top of that, these brands\nreceive exclusive marketing support from Amazon. Startups also enjoy access\nto a company Launchpad representative that guides sellers as they build\ntheir brand and look at global expansion possibilities like Amazon\nAustralia, EU, and Japan.\n\n     \"We are excited to be included in Amazon's Launchpad program. We\nbelieve it will enable us to reach a broader audience, introduce\nmuch-needed alternatives to current whey-based supplements, and solidify\nPlantFuel as a category leader in performance plant nutrition,\" comments\nPyatt. \"After our initial conversations with Amazon's Launchpad, the\ninterest was high on both sides to introduce our breakthrough plant-based\nproducts to their millions of customers. Many have been looking for premium\nnutrition but have not found any answers in the plant-based spaceuntil\nnow.\"\n\n     Furthermore, PlantFuel'sBrand Storeis also officially live on Amazon.\nAccording to statista.com and eMarketer, 63 percent of online shoppersgo to\nAmazon when they start searching for products. PlantFuel believes that this\nshould increase awareness and customer acquisition.\n\n     \"As the founder of PlantFuel, my mission was simple: start a new\nfrontier in plant-based supplement initiatives by expanding the current\nlandscape using ingredient technologies. We only use the latest, greatest\ninnovations for our wellness platform,\"confirms Pyatt. \"Our team of leading\nphysicians and formulators has worked for years to bridge the gap between\ntraditional sports nutrition and plant-based ingredients. Until now, no\nplant-based products could deliver to the sports nutrition category. Our\ntrailblazing line of supplements solves this dilemma. Finally, athletes and\nconsumers have truly effective, plant-based, sports nutrition products to\nmaximize peak performance.\"\n\n     About PlantFuel Life Inc.\n\n     PlantFuel Life, Inc., is a scientifically focused, plant-based\nwellness company managed by successful entrepreneurs with extensive\nexperience in the areas of consumer-packaged goods, manufacturing,\nlogistics, and distribution. FUEL is a CPG life science company focused on\nthe plant-based foods and supplements industry.https://plantfuel.com/\n\n     About Amazon Launchpad\n\n     WithAmazonLaunchpad, startups and other small businesses and new\nbrands can overcome many of the challenges associated with launching new\nproducts by leveraging Amazon's marketing tools, ecommerce expertise, and\nfulfillment network, while receiving unique merchandising opportunities,\ncurated webinars, content creation tools, AWS credits, and more. Launchpad\nalso helps brands take advantage of all thatAmazonoffers to help small\nbusinesses grow, including new pilot programs, promotions, and events.\nLaunchpad then makes it easier for customers to discover these brands with\na dedicated shopping destination. To learn more about the Amazon Launchpad\nprogram, visitwww.amazon.com/launchpad/signup. To shop the Amazon Launchpad\nstore, visitwww.amazon.com/launchpad\n\n     About Amazon\n\n     Amazon is guided by four principles: customer obsession rather than\ncompetitor focus, passion for invention, commitment to operational\nexcellence, and long-term thinking. Customer reviews, 1-Click shopping,\npersonalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle\nDirect Publishing, Kindle, Fire tablets, Fire TV, Amazon Echo,and Alexa are\nsome of the products and services pioneered by Amazon. For more\ninformation, visitwww.amazon.com/aboutand follow@AmazonNews.\n\n     The Canadian Securities Exchange (\"CSE\") has neither approved nor\ndisapproved the contents of this news release. Neither the CSE nor its\nMarket Regulator (as that term is defined in the policies of the CSE)\naccepts responsibility for the adequacy or accuracy of this release.\n\n     Contact:ir@plantfuel.com\n\n     Copyright (c) 2022 TheNewswire - All rights reserved.\n          __________________________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203000596.MNPRE2203001864-07310320220131</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}