{"date": "2021-12-10 14:12:47.670000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.16, "close": 3444.24}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>VERY GOOD FOOD CO INC (\"VERY-V;VGFC-Q\")\n- Stuffed Beast available across Canada at Select Loblaws, Real\n- Canadian Superstore and Zehrs Locations\n\n    The Very Good Food Company Inc. (\"VERY GOOD\" or the \"Company\"), a\nleading plant-based food technology company, announced that their popular\nStuffed Beast, under its core The Very Good Butchers brand, will be\navailable for purchase in select Loblaws and Real Canadian Superstore\nlocations across Canada.\n\n    After selling out of the limited-edition Stuffed Beast last year, VERY\nGOOD increased production and distribution for the 2021 holiday season.\nAvailable for purchase in mid December, the Stuffed Beast can be found in\n123 Real Canadian Superstore locations nationally and 40 Loblaw and Zehrs\nstores throughout Ontario (collectively \"Loblaws stores\"); along with other\nCanadian retailers such as Whole Foods, Thrifty Foods, La Moisson, Country\nGrocer, Natures Emporium, Organic Garage, Fiesta Farms, Good Rebel, Vegan\nSupply, and many more natural and independent stores. This seasonal\nrotation at Loblaw stores is incremental to the 1,400 stores that are\ncurrently selling The Very Good Butchers products across North America.\n\n    \"We've been thrilled to see such overwhelming demand for our\nbest-selling Stuffed Beast, and are incredibly excited to bring this\nlimited-edition product to select Loblaws and Real Canadian Superstore\nlocations across the country,\" said Mitchell Scott, co-founder and CEO of\nThe Very Good Food Company. \"We have always had trouble keeping up with\ndemand and orders for our Stuffed Beasts, so we ramped up production in\norder to increase availability this holiday season. We want to ensure\nCanadians have access to easy, approachable and delicious plant-based\noptions in time for the holidays.\"\n\n    About The Very Good Food Company Inc.\n\n    The Very Good Food Company Inc. is an emerging plant-based food\ntechnology company that produces nutritious and delicious plant-based meat\nand cheese products under VERY GOOD's core brands: The Very Good Butchers\nand The Very Good Cheese Co. www.verygoodfood.com.\n\n    OUR MISSION IS LOFTY, BADASS BUT BEAUTIFULLY SIMPLE: GET MILLIONS TO\nRETHINK THEIR FOOD CHOICES WHILE HELPING THEM DO THE WORLD A WORLD OF GOOD.\nBY OFFERING PLANT-BASED FOOD OPTIONS SO DELICIOUS AND NUTRITIOUS, WE'RE\nHELPING THIS KIND OF DIET BECOME THE NORM.\n\n    Forward-Looking Statements\n\n    This news release contains \"forward-looking information\" within the\nmeaning of applicable securities laws in Canada and \"forward-looking\nstatements\" within the meaning of the United States Private Securities\nLitigation Reform Act of 1995, including Section 21E of the Securities\nExchange Act of 1934, as amended (collectively referred to as\n\"forward-looking information\"), for the purpose of providing information\nabout management's current expectations and plans relating to the future.\nReaders are cautioned that reliance on such information may not be\nappropriate for other purposes. Any such forward-looking information may be\nidentified by words such as \"plans\", \"proposed\", \"expects\", \"anticipates\",\n\"intends\", \"estimates\", \"may\", \"will\", and similar expressions.\nForward-looking information contained or referred to in this news release\nincludes statements relating, but not limited to: the expected availability\nof the Stuffed Beast in Loblaws and Real Canadian Superstore locations\nincluding the number of stores that will carry the product and the timing\ntherefor; the number of other retailers that carry the Stuffed Beast;\nconsumer demand for the Stuffed Beast; the Company's increased production\nof the Stuffed Beast and the attributes and appeal of the Stuffed Beast and\nThe Very Good Butchers' other products including their taste and\nnutritional content. Forward-looking information is based on a number of\nfactors and assumptions which have been used to develop such information,\nbut which may prove to be incorrect including, but not limited to, material\nassumptions with respect to no significant disruptions in VERY GOOD's\nsupply chain and distribution network including as a result of recent\nsevere flooding in British Columbia, continued strong demand for VERY\nGOOD's products, continued growth of the popularity of meat alternatives\nand the plant-based food industry, the availability of sufficient financing\non reasonable terms to fund VERY GOOD's capital and operating requirements,\nthe successful placement of VERY GOOD's products in retail stores and\ncontinued wholesale expansion and eCommerce growth, VERY GOOD's ability to\nsuccessfully enter new markets and manage its international expansion, VERY\nGOOD's ability to obtain the necessary production equipment, the\navailability of labour as well as the accuracy of construction and ramp-up\nschedules, including the timely receipt of required permits, and accuracy\nof cost estimates for the commissioning of production lines at VERY GOOD's\nRupert and Patterson facilities, VERY GOOD's relationship with its\nsuppliers, distributors and third-party logistics providers, and the\nCompany's ability to position VERY GOOD competitively. Although the Company\nbelieves that the expectations reflected in such forward-looking\ninformation are reasonable, undue reliance should not be placed on\nforward-looking information because VERY GOOD can give no assurance that\nsuch expectations will prove to be correct. Risks and uncertainties that\ncould cause actual results, performance or achievements of VERY GOOD to\ndiffer materially from those expressed or implied in such forward-looking\ninformation include, among others, the impact of, uncertainties and risks\nassociated with the ongoing COVID-19 pandemic, negative cash flow and\nfuture financing requirements to sustain and grow operations, limited\nhistory of operations and revenues and no history of earnings or dividends,\nexpansion of facilities, competition, availability of raw materials,\ndependence on senior management and key personnel, availability of labour,\ngeneral business risk and liability, regulation of the food industry,\nchange in laws, regulations and guidelines, compliance with laws,\nunfavourable publicity or consumer perception, product liability and\nproduct recalls, risks related to intellectual property, difficulties with\nforecasts, management of growth and litigation. For a more comprehensive\ndiscussion of the risks faced by VERY GOOD, please refer to VERY GOOD's\nmost recent Annual Information Form filed with Canadian securities\nregulatory authorities at www.sedar.com and as an exhibit to the\nregistration statement on Form F-10 filed with the SEC and available at\nwww.sec.gov. The forward-looking information in this news release reflects\nthe current expectations, assumptions and/or beliefs of the Company based\non information currently available. Any forward-looking information speaks\nonly as of the date of this news release. VERY GOOD undertakes no\nobligation to publicly update or revise any forward-looking information\nwhether as a result of new information, future events or otherwise, except\nas otherwise required by law. The forward-looking information contained in\nthis news release is expressly qualified by this cautionary statement.\n\n    None of the Nasdaq, TSX Venture Exchange, the SEC or any other\nsecurities regulator has either approved or disapproved the contents of\nthis news release. None of the Nasdaq, the TSX Venture Exchange or its\nRegulation Services Provider (as that term is defined in the policies of\nthe TSX Venture Exchange), the SEC or any other securities regulator\naccepts responsibility for the adequacy or accuracy of this news release.\n\n Contact Information:\n\nMitchell Scott\nChief Executive Officer\nThe Very Good Food Company Inc.\n\nKevan Matheson\nCorporate Communications and Investor Relations\nEmail:  invest@verygoodbutchers.com\nPhone: +1 855-472-9841\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134300101.MNPRE2134300482-05442620211210</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}