{"date": "2022-01-08 00:40:06+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3265.08, "close": 3229.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>BETTER PLANT SCIENCES INC (\"PLNT-Z;VEGGF-0\")\n- Change of Auditor\n\n     Better Plant Sciences Inc. (\"Better Plant\" or the \"Company\") announces\nthat the Company has changed its auditor from Saturna Group Chartered\nProfessional Accountants LLP (the \"Former Auditor\") to Mao &amp; Ying LLP\nChartered Professional Accountants (the \"Successor Auditor\").  The Former\nAuditor resigned as the auditor of the Company by notice sent on November\n29, 2021 and received by the Company on December 17, 2021, and the board of\ndirectors of the Company (the \"Board\"). Upon the recommendation of the\nCompany's audit committee, the Company approved the appointment of the\nSuccessor Auditor on December 28, 2021, which appointment was formalized on\nDecember 30, 2021.  The Former Auditor resigned on its own initiative due\nto staffing issues; the Successor Auditor is expected to serve as the\nauditor of the Company until at least the Company's next annual meeting of\nshareholders.  The Company would like to thank the Former Auditor for its\nservices since the inception of the Company.\n     The Company has sent a Notice of Change of Auditor (the \"Notice\") to\nboth the Former Auditor and to the Successor Auditor and has received a\nletter from each, addressed to the securities commissions in British\nColumbia, Alberta, Saskatchewan, Manitoba, Ontario, New Brunswick and Nova\nScotia, as well as the Canadian Securities Exchange, stating that they\nagree with the information contained in the Notice.  The Notice, together\nwith the letter from the Former Auditor and the letter from the Successor\nAuditor, have been reviewed by the Board and the Company's audit committee\nand have been filed under the Company's SEDAR profile at www.sedar.com.\n     There were no disagreements or unresolved issues with the Former\nAuditor on any matter of audit scope or procedures, accounting principles\nor policies, or financial statement disclosure.  It is the Company's\nopinion that there have been no \"reportable events\" (as defined in National\nInstrument 51-102 - Continuous Disclosure Obligations) between the Company\nand the Former Auditor.  The Former Auditor did not provide a modified\nopinion in its audit reports on the Company's financial statements for the\nfiscal years ended November 30, 2020 and 2019.\n     About Better Plant Sciences Inc.\n     Better Plant has a catalog of hundreds of product formulas and\ndevelops, commercializes, markets and sells over 50 products through the\nbrands Jusu and NeonMind. Better Plant products are sold through a network\nof online and brick-and-mortar retail locations including Whole Foods\nMarket, Pharmasave, Healthy Planet and Vitasave. Better Plant has a\ntalented team with expertise in digital design, branding, eCommerce and\ndigital marketing and offers operational, financial, and other services to\ncompanies with emerging and fast growing businesses.       For more\ninformation on Better Plant, visit betterplantsciences.com or follow\n@betterplantsciences on Instagram.\n\nPenny White, President &amp; CEO\npenny@betterplantsciences.com\n1-833-515-2677\nInvestor Relations:\nAlexandra Dumanski\ninvest@betterplantsciences.com\n1-833-515-2677\n\nSales Inquiries:\nAmber Allen, Director of Sales\namber@betterplantsciences.com\n604-808-8118\n\nThe Canadian Securities Exchange has not reviewed, approved or disapproved\nthe contents of this news release.\n\nCautionary Statement Regarding Forward-Looking Statements\nThis press release includes forward-looking information and statements\n(collectively, \"forward looking statements\") under applicable Canadian\nsecurities legislation. Forward-looking statements are necessarily based\nupon a number of estimates, forecasts, beliefs and assumptions that, while\nconsidered reasonable, are subject to known and unknown risks,\nuncertainties, and other factors which may cause actual results and future\nevents to differ materially from those expressed or implied by such\nforward-looking statements. Such risks, uncertainties and factors include,\nbut are not limited to: risks related to the development, testing,\nlicensing, brand development, availability of packaging, intellectual\nproperty protection, reduced global commerce and reduced access to raw\nmaterials and other supplies due to the spread of COVID-19, the potential\nfor not acquiring any rights as a result of the patent application and any\nproducts making use of the intellectual property may be ineffective or the\ncompany may be unsuccessful in commercializing them; and other approvals\nwill be required before commercial exploitation of the intellectual\nproperty can happen. Demand for the company's products, general business,\neconomic, competitive, political and social uncertainties, delay or failure\nto receive board or regulatory approvals where applicable, and the state of\nthe capital markets. Better Plant cautions readers not to place undue\nreliance on forward-looking statements provided by Better Plant, as such\nforward-looking statements are not a guarantee of future results or\nperformance and actual results may differ materially. The forward-looking\nstatements contained in this press release are made as of the date of this\npress release, and Better Plant expressly disclaims any obligation to\nupdate or alter statements containing any forward-looking information, or\nthe factors or assumptions underlying them, whether as a result of new\ninformation, future events or otherwise, except as required by law.\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200604972.MNPRE2200606055-16391620220107</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}