{"date": "2022-01-13 14:41:36.067000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3307.24, "close": 3224.28}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Payments Corp. Kicks off 2022 By Welcoming Nicholas Nolasco and Scott Carnley as Senior Leaders within the Company's Research, Development &amp; InfraOps Team</p>\n</div>\n<div class=\"tr-npp-body\">\n<pre>APPTECH PAYMENTS CORP (\"APCX-Q\")\n- Payments Corp. Kicks off 2022 By Welcoming Nicholas Nolasco and\n- Scott Carnley as Senior Leaders within the Company's Research,\n- Development &amp; InfraOps Team\n\n     AppTech Payments Corp. (\"AppTech\"), a fintech company powering\ncommerce experiences, announced that they have appointed Nicholas Nolasco\nand Scott Carnley as members of the company's senior technical leadership\nteam.\n\n     Nicolas will be AppTech's Chief Architect responsible for setting the\ntechnical strategy and direction of AppTech's fintech platform; ensuring\nthat it is robust, scalable, and secure.\n\n     Nicolas joins AppTech from Zuora, where he led the development of\ncloud infrastructure and tooling that greatly accelerated developer\nproductivity across the organization, enabling products to release new\nfeatures multiple times an hour. Most recently, he worked on a big data\nobservability system processing millions of events per second to enable\nreal-time insights, alerting, and predictive analytics from previously\nsiloed logs, metrics, and application data.\n\n     Nicolas brings over 17 years of experience working on a wide range of\ncritical production systems across multiple industries. Early in his\ncareer, Nick worked on real-time software for automated guided vehicles,\nand for the past 11 years has been architecting, building, and leading\nteams focused on big data, communications, payments, and infrastructure in\nboth AWS and Azure. Prior to working at Zuora, Nick developed and\narchitected multiple large-scale systems at non-profit SaaS provider,\nBlackbaud, including a greenfield Data Platform and a re-imagined\nCommunication Services platform.\n\n     \"I couldn't be happier to be a part of the AppTech team,\" said\nNicolas, \"I very much look forward to working with the R&amp;D team to deliver\nworld-class products that will delight our customers today, as well as\nbuilding a secure foundation that can scale to meet our customers' needs in\nthe future.\"\n\n     Scott will be AppTech's Director of Engineering, leading the\nday-to-day management of AppTech's Engineering team. He will also work with\nthe company's Chief Architect in defining the technical strategy and\ndirection for AppTech's fintech platform.\n\n     Scott joins AppTech with over two decades of experience developing\nmission critical systems that are capable of processing large volumes of\ntransactional throughput with high performance, scalability, and\nredundancy.\n\n     Most recently, Scott joins AppTech from Blackbaud where he held the\nrole of Principle Software Architect. Early in his career, Scott was\ninstrumental in architecting the company's first content management\nsolution. This CMS gave non-profits an easy means to launch a website that\nallowed for multi-channel marketing that was fully integrated into\nBlackbaud's existing suite of non-profit solutions. This segued into\nScott's most recent role with the company as Chief Architect of Blackbaud\nCommunication Services. This service acts as the communication backbone for\nBlackbaud's suite of enterprise non-profit solutions and regularly\nprocesses billions of messages per year, with spikes reaching tens of\nmillions of messages per hour during high-volume days.\n\n     \"I'm thrilled to be a part of the AppTech family,\" said Scott, \"With\nour talented team, our innovative platform, and all of the opportunities in\nthe fintech space, we're poised for a very exciting 2022!\"\n\n     AppTech CTO, Ben Jenkins, commented, \"I'm extremely pleased to welcome\nNick and Scott to our technical leadership team. Their extensive background\nin building enterprise solutions, as well as their tremendously valuable\ninsight and talent brought forth from years of developing and leading\ninnovative platforms at scale will anchor AppTech's growth well into the\nfuture.\"\n\n     About AppTech\n\n     AppTech Payments Corp. is a publicly listed fintech company utilizing\ninnovative payment processing and digital banking technologies to\ncomplement core merchant services capabilities. AppTech's patented and\nproprietary software will provide progressive and adaptable products that\nare available through a suite of synergistic offerings directly to\nmerchants, banking institutions and business enterprises.\n\n     AppTech is developing an embedded, highly secure digital payments and\nbanking platform that powers commerce experiences for clients and their\ncustomers. Based upon industry standards for payment and banking protocols,\nAppTech will offer standalone products and fully integrated solutions that\ndeliver innovative, unparalleled payments, banking, and financial services\nexperiences. Our processing technologies can be taken off-the-shelf or\ntapped into via our RESTful API to build fully branded and customizable\nexperiences while supporting tokenized, multi-channel, and multi-method\ntransactions. For more information about our company, please visit\nwww.apptechcorp.com.\n\n     Forward-Looking Statements\n\n     This press release contains forward-looking statements that are\ninherently subject to risks and uncertainties. Any statements contained in\nthis document that are not historical facts are forward-looking statements\nas defined in the U.S. Private Securities Litigation Reform Act of 1995.\nWords such as \"anticipate, believe, estimate, expect, forecast, intend,\nmay, plan, project, predict, should, will\" and similar expressions as they\nrelate to AppTech are intended to identify such forward-looking statements.\nThese risks and uncertainties include, but are not limited to, general\neconomic and business conditions, effects of continued geopolitical unrest\nand regional conflicts, competition, changes in methods of marketing,\ndelays in manufacturing or distribution, changes in customer order\npatterns, changes in customer offering mix, and various other factors\nbeyond the company's control. Actual events or results may differ\nmaterially from those described in this press release due to any of these\nfactors. AppTech is under no obligation to update or alter its\nforward-looking statements whether as a result of new information, future\nevents or otherwise.\n\n     Contact\n\n     AppTech Corp. Investor Relations\n\n     ir@apptechcorp.com\n\n     (760) 707-5955\n\nTel   : 760-707-5959    APPTECH CORP\nEmail : ir@apptechcorp.com\nWWW   : <a href=\"https://www.apptechcorp.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.apptechcorp.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201200590.MNPRE2201201707-06210320220113</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}