{"date": "2021-11-01 16:24:02.249000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_sqy2r3w0&amp;referenceId=tag:reuters.com,2021:newsml_OVF1RV5HN_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_sqy2r3w0&amp;referenceId=tag:reuters.com,2021:newsml_OVF1RV5HN_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: Workers at some of Amazon's German warehouses went on strike Monday as part of a long-running battle with the firm over pay and conditions. Julian Satterthwaite reports.<br/>Short Link: <a href=\"https://refini.tv/3jSgycT\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3jSgycT</a><br/><br/>Video Transcript:<br/><br/>Workers at some of Amazon's German warehouses began strike action on Monday. It's part of a long-running battle with the company over pay and conditions. The Verdi services union has been organizing industrial action on and off since 2013. It says it called the latest strike to demand a pay rise in line with agreements it reached with the country's broader retail and mail-order industries. Verdi says workers will walk out at seven facilities over Monday and Tuesday. It didn't say how many employees were taking part in the action. In a statement, Amazon said it offered excellent pay, benefits and career opportunities. It said the strike had not had any impact on customers so far. Earlier this year Amazon said it would guarantee a minimum wage at its German warehouses of EUR12 or almost $14 an hour. That would be in line with a level expected to be set by the country's new coalition government.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}