{"date": "2022-01-17 13:11:08.939000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>EMERGE COMMERCE LTD (\"ECOM-V;EMCMF-0\")\n- Engages Harish Consul of Ocgrow Ventures, as Strategic Advisor\n\n     EMERGE Commerce Ltd. (\"EMERGE\" or the \"Company\"), a leading acquirer\nand operator of niche e-commerce brands, is pleased to announce the\naddition of Harish Consul, Founder and CEO of Ocgrow Ventures (\"Ocgrow\"),\nas strategic advisor to the Company.\n\n     Harish has extensive experience as an entrepreneur building, operating\nand investing in highly successful growth-oriented technology and\ne-commerce businesses across North America and globally, in both public and\nprivate markets, with a focus on building and inspiring high energy teams,\nand creating long-term value for all stakeholders.\n\n     \"We are incredibly fortunate to have Harish and Ocgrow join EMERGE as\nstrategic advisor. From the moment we met, it was crystal clear that we\nshared the same values, and he has a deep understanding of what it takes to\nwin big. Harish has a refreshingly long-term perspective on building iconic\nbusinesses that stand the test of time, offering very patient capital and\nsupport. We could not be more thrilled to partner with him on this\njourney,\" commented Ghassan Halazon, Founder and CEO, EMERGE.\n\n     \"With our experience in investing and scaling high growth companies\nfrom an early stage with founder-led businesses, including those such as\nAmazon, Shopify and Coupang, I see tremendous growth potential with EMERGE.\nThe business that Ghassan and his incredible team are building is uniquely\npositioned to become one of the leading e-commerce portfolios globally over\ntime. I am thrilled to join as strategic advisor and will continue to\nsupport the company in various ways through its next phase of growth and\nbeyond,\" commented Harish Consul, Founder and CEO, Ocgrow.\n\n     Ocgrow has amassed an extensive portfolio of market-leading technology\ninvestments, counting global e-commerce powerhouses such as Amazon (NASDAQ:\nAMZN), Shopify (NYSE: SHOP), and Coupang (NYSE: CPNG) amongst its most\nsuccessful early investments to date.\n\n     \"We are planning 2022 to be a year of significant growth for EMERGE.\nAdding Harish as a strategic advisor is a big step and we are excited to\nlearn from and apply all his extraordinary successes in technology, and\nbusiness at large, as we work together to take the Company to the next\nlevel,\" commented Drew Green, Chairman, EMERGE.\n\n     About Ocgrow Group of Companies\n\n     Ocgrow Group of Companies (www.ocgrowgroup.com) is a privately held,\ninvestment group involved in venture capital &amp; real estate development.\n\n     Ocgrow's venture capital group is focused on early-stage technology\nsector, cleantech, healthcare, &amp; other special situation in new growth\nventure investments. Our technology focus includes several areas including\necommerce, cloud computing, SaaS, software, fintech, social commerce &amp;\nother related high growth sectors. We believe the opportunity in several\nvertical specific software markets will continue to accelerate going\nforward, with rapid growth in mobile &amp; cloud technologies.\n\n     Ocgrow is headquartered in Calgary, Alberta with offices in Vancouver,\nBritish Columbia. To learn more visit www.ocgrowgroup.com\n\n     About EMERGE\n\n     EMERGE (TSXV: ECOM) is a disciplined, diversified, rapidly growing\nacquirer and operator of profitable niche e-commerce brands. Our\nsubscription and marketplace e-commerce properties provide our members with\naccess to pet products, premium meat &amp; groceries, outdoor gear, golf, and\nother curated experiences. Our portfolio houses some of North America's\nmost coveted online destinations including WholesalePet.com, trulocal.ca,\nBattlBox.com, UnderPar.com, JustGolfStuff.ca, CarnivoreClub.co, WagJag.com,\nand BeRightBack.ca. EMERGE was named one of the fastest growing companies\nin Canada by the Startup 50, and the Globe and Mail's 2020 Canada's Top\nGrowing Companies.\n\n     To learn more, visit <a href=\"https://www.emerge-commerce.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.emerge-commerce.com</a>/\n\n     Follow EMERGE:\n\n     LinkedIn | Twitter | Instagram | Facebook\n\n     Cautionary notice\n\n     Neither TSX Venture Exchange nor its Regulation Services Provider (as\nthat term is defined in policies of the TSX Venture Exchange) accepts\nresponsibility for the adequacy or accuracy of this release.\n\n     Notice regarding forward-looking statements\n\n     This press release may contain certain forward-looking information and\nstatements (\"forward-looking information\") within the meaning of applicable\nCanadian securities legislation, that are not based on historical fact,\nincluding without limitation statements containing the words \"believes\",\n\"anticipates\", \"plans\", \"intends\", \"will\", \"should\", \"expects\", \"continue\",\n\"estimate\", \"forecasts\" and other similar expressions. Readers are\ncautioned to not place undue reliance on forward-looking information.\nActual results and developments may differ materially from those\ncontemplated by these statements. The Company undertakes no obligation to\ncomment on analyses, expectations or statements made by third-parties in\nrespect of the Company, its securities, or financial or operating results\n(as applicable). Although the Company believes that the expectations\nreflected in forward-looking information in this press release are\nreasonable, such forward-looking information has been based on\nexpectations, factors and assumptions concerning future events which may\nprove to be inaccurate and are subject to numerous risks and uncertainties,\ncertain of which are beyond the Company's control, including the risk\nfactors discussed in the Company's annual information form, which are\navailable through SEDAR at www.sedar.com. The forward-looking information\ncontained in this press release are expressly qualified by this cautionary\nstatement and are made as of the date hereof. The Company disclaims any\nintention and has no obligation or responsibility, except as required by\nlaw, to update or revise any forward-looking information, whether as a\nresult of new information, future events or otherwise.\n\n Contact Information:\n\nJames Bowen, CFA, EMERGE Commerce Ltd., 416-519-9442,\ninvestor@emerge-brands.com\n\nTel   : 416-519-9442    EMERGE COMMERCE LTD\nEmail : james.bowen@loderockadvisors.com\nWWW   : <a href=\"https://www.emerge-commerce.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.emerge-commerce.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201600294.MNPRE2201600642-05091120220117</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}