{"date": "2021-11-12 16:20:45.416000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3472.5, "close": 3545.68}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Rosamund Pike stars in Amazon's magical new fantasy epic, while the Tiger King returns to Netflix. Plus: the beloved anime Cowboy Bebop comes to physical life</p><p>Given that it has already been renewed for a second season, Amazon clearly has high hopes for this lavish fantasy drama. Based on Robert Jordan's novels of the same name, The Wheel of Time stars Rosamund Pike as Moiraine, a member of the Aes Sedai, a sect of women endowed with magical gifts. It's pitched somewhere between Game of Thrones and Britannia but, initially at least, lacks either the former's seething intrigue or the latter's wayward irreverence. However, the world-building feels subtle and patient enough to be worth persevering with. As we join Moiraine's tiny band they're in retreat but strong bonds are forming in adversity. <br/><span>Amazon Prime Video, from Friday 19 November</span> </p></div><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">Pick of the week</p><p class=\"tr-npp-section-title\">The Wheel of Time</p><p>***</p><p class=\"tr-npp-section-title\">Crime</p><p>Irvine Welsh's 2008 novel is brought to grimy life as Dougray Scott plays troubled Edinburgh murder detective DI Ray Lennox, who's just about holding it together while storming furiously in and out of AA meetings. It's an admirably nuanced performance – Lennox's rage and anguish is mostly internalised but his simmering intensity still takes some handling, as his new sidekick DS Amanda Drummond (Joanna Vanderham) learns. Searching for a missing schoolgirl, Lennox is haunted by \"Mr Confectioner\", an almost mythical, uncaptured evil suspect. But does he even exist? <br/><span>BritBox, from Thursday 18 November</span> </p><p class=\"tr-npp-section-title\">The World's Biggest Druglord</p><p>Pablo Escobar and Joaquín \"El Chapo\" Guzmán never enjoyed the profits that virtually unknown drug lord Tse Chi Lop made, according to this very dramatic look at the criminal mastermind. And yet, the man behind the largest drug trafficking operation in history managed to remain below the radar for more than a decade. In this crime-thriller documentary, Harvard professor Laura Huang charts Tse's rise, from committing petty street crimes to becoming the unofficial CEO of the global drug trade – until, of course, he was finally caught. <br/><span>Discovery+, from Sunday 14 November</span> </p><p>***</p><p class=\"tr-npp-section-title\">This Girl's Changed</p><p>Growing up in Huddersfield, Persephone Rizvi was a big party animal. But her chaotic lifestyle needed to change and the steps she decided to take were dramatic. Five years ago, she adopted Islam and removed herself completely from her old life. But how did that sit with her old friends? In this fascinating documentary, Rizvi looks at the pros and cons of a total life change as she attempts to reconnect with some of the people she left behind. How do they feel about her transformation? And does she owe them an explanation? <br/><span>BBC Three, from Tuesday 16 November</span> </p><p>***</p><p class=\"tr-npp-section-title\">Tiger King 2</p><p>We're about to learn whether the interest in this odd, gloomy, marginal story endures beyond the unique circumstances (the panicky beginning of lockdown) under which people binged season one. Already, it's proved controversial – Carole Baskin has taken legal action against Netflix over her continuing presence in the series, which doesn't speak well of the ethics involved. Meanwhile, Joe Exotic is now behind bars. What, beyond the scurrilous stoking of a freakish but fundamentally grim set of circumstances, will be achieved? <br/><span>Netflix, from Wednesday 17 November</span> </p><p>***</p><p class=\"tr-npp-section-title\">The Line</p><p>A grim story of lost morality in the fog of war, this four-part series explores the case of US Navy Seal Eddie Gallagher, who was accused of war crimes after allegedly killing a prisoner of war in Iraq in 2017. The case was complicated by the fact that the only viable witnesses were his fellow Seals. Thus began the process of unravelling interpersonal grievances, tackling the omerta that exists within military realms and trying to retrieve evidence. Then, as if matters weren't already tricky enough, Donald Trump got involved … <br/><span>Apple TV+, from Friday 19 November</span> </p><p>***</p><p class=\"tr-npp-section-title\">Cowboy Bebop</p><p>Back in the late 90s, Japanese sci-fi anime Cowboy Bebop smashed all genre preconceptions, presenting itself as a sort of existentially questioning noir western. This series brings the anime to physical life. It's a risky gambit given the affection surrounding the original series: is it possible to maintain the wonder and fantasy of a cherished animation while populating it with actual humans? The adaptation wisely concentrates on developing a distinct universe of its own – John Cho stars as Spike Spiegel, the intergalactic bounty hunter at the heart of the story. <br/><span>Netflix, from Friday 19 November</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 theguardian.com-NonSyndicated</p></div>"}