{"date": "2021-11-02 14:50:14.701000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MINIM INC (\"MINM-Q\")\n- Revenue Growth of 25%\n\n     Minim, Inc., the creator of intelligent networking products under the\nglobally-recognized Motorola brand, today reported third quarter financial\nresults for the period ended September 30, 2021.\n\n     Q3 2021 Financial Highlights:\n\n     *  Net revenue of $15.0 million, up 25% year-over-year from $12.0\nmillion in Q3 2020.\n     *  Revenue Bookings of $15.2 million; total deferred revenue as of\nSeptember 30, 2021 increased by 17% compared to Q2 2021.\n     *  Gross margin of 29.9%, down 234 basis points compared to 32.2% in\nQ3 2020, due to component pricing pressures that the business has adjusted\nfor as we moved into Q4.\n     *  Net income of $1.7 million, inclusive of the one-time income of\napproximately $4.0 million related to the sale of Zoom(R) trademark,\ncompared to a net loss of $0.3 million in Q3 2020.\n\n     Recent Business Highlights\n\n     *  Released the new motosync, powered by Minim, mobile app. This app\ncomes with parental controls, security, data tracking, ad blocking, and\nmuch more versus its prior generation, MotoManage.\n     *  Launched WiFi 6 mesh system, the Motorola MH7603, in Amazon.com and\nBest Buy online. This product offers 1.8 Gbps in speed, up to 5,000 sqft.\nof coverage, and the new motosync app at a competitive price.\n     *  Launched the Motorola MH7020 mesh WiFi system in India in Amazon.in\nand Flipkart.in, marking the first major step towards international\ne-commerce expansion. The product received positive reviews by leading\nconsumer tech influencers TechMakhnified and #TheGadgets360Show.\n     *  Joined the Telecom Infra Project (TIP) with members including BT,\nVodafone, Telefonica, Deutsche Telekom, Dell, Intel, and Facebook;\nannounced that Minim is being evaluated as a standard element in TIP's\nOpenWiFi framework, which would allow easy access to the Minim cloud\nservices for TIP members.\n     *  Entered a customer trial with MultiChoice Group, Africa's leading\nentertainment company that reaches more than 20 million households across\n50 countries in Africa.\n\n     Gray Chynoweth, Chief Executive Officer of Minim, said, \"We delivered\nanother quarter of strong double-digit revenue growth, an increase of 25%\nover last year, while successfully navigating a more challenging macro\nenvironment characterized by global supply chain challenges and\ninflationary pressures. Based on our current business plan, we believe the\nrecently completed capital raise and trademark sale provides us with ample\nrunway to sustain our current operations and invest for continued growth.\nImportantly, we are deploying the capital to not just drive growth, but to\ndrive disciplined growth. Committing our resources to inventory\noptimization, pricing strategies, technology innovation and expanding\nglobal access to our products to truly propel our business forward and\nachieve material adjusted profitability on an Adjusted EBITDA basis in 2022\nand beyond.\"\n\n     Sean Doherty, Chief Financial Officer of Minim, commented, \"Revenue\nbookings, which grew 26% year-over-year to $15.2 million, once again\nincluded an increased proportion from subscription services vs. pure\nproduct sales. For the third consecutive quarter, our deferred revenue\nbalance increased, adding to our base of future revenue to be recognized.\nWe experienced some gross margin pressure due to component price increases\nand are addressing with fourth-quarter pricing increases that remain\ncompetitive in our categories. Gross margins may continue to see pressure\nquarter-to-quarter as we refine our pricing and component sourcing\nstrategies and optimize our distribution and delivery channels.\"\n\n     Deferred revenue as of September 30, 2021 was $1.2 million compared\nwith $1.0 million as of June 30, 2021.\n\n     Net income in the third quarter of 2021 was $1.7 million, inclusive of\napproximately $4.0 million of income from the sale of the Zoom trademark,\ncompared to a net loss of $0.3 million in the third quarter of 2020.\nSequentially, this compares to a net loss of $1.6 million in the second\nquarter of 2021. Net income per share on a GAAP basis for the third quarter\nof 2021 was $0.04, compared with ($0.01) in the comparable period of Q3\n2020, and ($0.04) in the prior quarter in Q2 2021.\n\n     Non-GAAP Adjusted EBITDA in the third quarter of 2021 was ($1.4)\nmillion when adjusted for $4.0 million trademark income, $0.2 million in\nstock-based compensation expense, and $0.2 million of revenue bookings, a\n($2.2) million year-over-year decrease compared to $0.8 million in the\nthird quarter of 2020. On a sequential, quarter-over-quarter basis, this\nrepresents a ($1.1) million decrease compared to ($0.3) million in the\nsecond quarter of 2021.\n\n     At the end of Q3 2021, the company had $19.4 million of cash, cash\nequivalents and restricted cash compared to $1.6 million at the end of Q2\n2021. The company had $50 thousand in availability for borrowing under its\n$12.0 million credit facility at September 30, 2021. The Q3 2021 ending\ncash balance increased over the prior quarter and prior year-end as a\nresult of the closing of a secondary public offering for $22.7 million in\nnet proceeds and the sale of assets related to the Zoom brand for $4.0\nmillion in gross proceeds. Subsequent to quarter-end, the company amended\nits revolving credit facility with its primary lender. The amendment\nincreased the size from $12.0 million to $25.0 million and extended the\nmaturity to November, 2023.\n\n     Business Outlook\n\n     \"Our year-over-year growth in the quarter was an impressive feat for\nthis slow time period in consumer electronics sales,\" said Nicole Zheng,\nPresident and CMO of Minim. \"We accomplished this through continued strong\nperformance in e-commerce of our highest ASP products. Looking ahead, we\nare excited for what's expected to be a strong holiday season -- a season\nwhere 'Inventory is King' and shoppers are looking for incredible value in\nhardware/software combination products. We expect that we will deliver. Our\nhigh-performance mesh system has just dropped in Amazon and retail; the new\nmotosync app, powered by Minim, promises more features than ever; and we're\ndriving toward the launch of our next-generation high-speed and low-latency\ngateways for gamers and highly connected homes.\"\n\n     Non-GAAP Financial Measure\n\n     In addition to financial measures prepared in accordance with\ngenerally accepted accounting principles in the United States (\"GAAP\"),\nthis news release contains the non-GAAP financial measures Adjusted EBITDA,\nwhich we define as GAAP net income (loss) plus depreciation of fixed assets\nand amortization of intangible assets, other (expense) income, net, income\ntax provision, Revenue Bookings (defined below), material one-time expenses\nand income, and stock-based compensation expenses, and Revenue Bookings,\nwhich we define as GAAP Revenue, which was $15.0 million for Q3 2021, plus\nthe change in Deferred Revenue recorded within the financial reporting\nperiod being disclosed, which amounted to $0.2 million for Q3 2021.\n\n     We use these non-GAAP financial measures in internal forecasts and\nmodels when establishing internal operating budgets, supplementing the\nfinancial results and forecasts reported to our Board of Directors, and\nevaluating short-term and long-term operating trends in our operations. We\nbelieve that these measures provide an enhanced understanding of our\nunderlying operational measures to manage the business, to evaluate\nperformance compared to prior periods and the marketplace, and to establish\noperational goals.\n\n     Minim believes that these non-GAAP financial measures are also useful\nto investors and analysts in comparing its performance across reporting\nperiods on a consistent basis. These supplemental financial measures\nexclude temporary supplemental air freight resulting from supply chain\ninterruptions resulting from a global pandemic; China tariffs as the\ncompany believes these costs are not part of normal business operations\n(the imposed tariff rates increased mid-2019 from 10% to 25% on the value\nof imported goods and remained at 25% until the company relocated its\nmanufacturing source from China to Vietnam by June 2020); costs incurred\nand related to the merger with Zoom Connectivity, Inc. as the company deems\nthese costs as one-time in nature; and the one-time income from the\nforgiveness of the Payroll Protection Program loan.\n\n     These non-GAAP financial measures should not be considered in\nisolation or as a substitute for financial information provided in\naccordance with GAAP. These financial measures may not be computed in the\nsame manner as similarly titled measures used by other companies. We expect\nto continue to incur expenses similar to the financial adjustments\ndescribed above and investors should not infer from our presentation of\nthese non-GAAP financial measures that these costs are unusual, infrequent\nor non-recurring.\n\n     Conference Call Details Date/Time:\n\n     Minim will host a conference call today, November 2, 2021, at 8:30\na.m. ET to discuss these results. To participate, please access the live\nwebcast at <a href=\"https://ir.minim.co\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://ir.minim.co</a>/, or by dialing (866) 393-7958 (US) or (706)\n643-5255 (international) and referencing code 7983699.\n\n     A slide presentation will accompany management's remarks and will be\naccessible five minutes prior to the start of the call via the following\nlink: <a href=\"https://ir.minim.co\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://ir.minim.co</a>. A recording of the call will also be made\navailable afterwards through the investor information section of the\ncompany's website.\n\n     About Minim\n\n     Minim, Inc. (NASDAQ: MINM) is the creator of intelligent networking\nproducts that dependably connect people to the information they need and\nthe people they love. Headquartered in Manchester, NH, the company delivers\nsmart software-driven communications products under the globally recognized\nMotorola brand. Minim end users benefit from a personalized and secure WiFi\nexperience, leading to happy and safe homes where things just work.  To\nlearn more, visit <a href=\"https://www.minim.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.minim.com</a>.\n\n     MOTOROLA and the Stylized M Logo are trademarks or registered\ntrademarks of Motorola Trademark Holdings, LLC and are used under license.\n\n     About Motorola Strategic Brand Partnerships\n\n     For over 90 years the Motorola brand has been known around the world\nfor high quality, innovative and trusted products. Motorola's Strategic\nBrand Partnership program seeks to leverage the power of this iconic brand\nby teaming with dynamic companies who offer unique, high quality products\nthat enrich consumers' lives. Strategic brand partners work closely with\nMotorola engineers while developing and manufacturing their products,\nensuring that their products meet the exacting safety, quality, and\nreliability standards that consumers have come to expect from Motorola. To\nlearn more about Motorola strategic brand partnerships, follow us\n@ShopMotorola.\n\n     Forward-Looking Statements\n\n     This press release contains \"forward-looking statements\", within the\nmeaning of the safe harbor provisions of the U.S. Private Securities\nLitigation Reform Act of 1995. Such forward-looking statements relate to\nMinim's plans, expectations, and intentions. Actual results may be\nmaterially different from expectations as a result of known and unknown\nrisks, including: risks associated with Minim's potential inability to\nrealize intended benefits of the acquisition by merger of Zoom\nConnectivity, Inc.; the potential increase in tariffs on the company's\nimports; the potential difficulties and supply interruptions from moving\nthe manufacturing the company's products in Vietnam; risks relating to\nglobal semiconductor shortages; potential changes in NAFTA; the potential\nneed for additional funding which Minim may be unable to obtain; declining\ndemand for certain of Minim's products; delays, unanticipated costs,\ninterruptions or other uncertainties associated with Minim's production and\nshipping; Minim's reliance on several key outsourcing partners; uncertainty\nof key customers' plans and orders; risks relating to product\ncertifications; Minim's dependence on key employees; uncertainty of new\nproduct development, including certification and overall project delays,\nbudget overruns; the risk that newly introduced products may contain\nundetected errors or defects or otherwise not perform as anticipated; costs\nand senior management distractions due to patent related matters; risks\nfrom a material weakness in our internal control over financial reporting;\nthe impact of the COVID-19 pandemic; risks associated with macroeconomic\nfactors including supply chain issues, inflation, tightening of money\nmarkets and labor shortages; and other risks set forth in Minim's filings\nwith the Securities and Exchange Commission. Minim cautions readers not to\nplace undue reliance upon any such forward-looking statements, which speak\nonly as of the date made. Minim expressly disclaims any obligation or\nundertaking to release publicly any updates or revisions to any such\nstatements to reflect any change in Minim's expectations or any change in\nevents, conditions or circumstance on which any such statement is based.\n\n Contact Information:\n\nContact:\n   Grace McElroy\n\n   grace@minim.com\n\n   (914) 643-5260\n\n   Investor Relations Contact:\n\n   James Carbonara\n\n   james@haydenir.com\n\n   (646) 755-7412\n\n   -- Tables Follow -\n\n//st\n\nMINIM, INC.\n\nConsolidated Balance Sheet\n\n(Unaudited) (in thousands, except share data)\n\nASSETS                  September 30,              December 31,\n                        2021                       2020\n\n                        (Unaudited)\n\nCurrent assets\n\nCash and cash           $               18,864     $              772\nequivalents\n\nRestricted cash                         500                       800\n\nAccounts receivable,                    11,579                    9,203\nnet\n\nInventories, net                        23,242                    16,505\n\nPrepaid expenses and                    452                       399\nother current assets\n\nTotal current assets                    54,637                    27,679\n\nEquipment, net                          819                       455\n\nOperating lease                         75                        87\nright-of-use assets\n\nGoodwill                                59                        59\n\nIntangible assets,                      305                       389\nnet\n\nOther assets                            644                       942\n\nTotal assets            $               56,539     $              29,611\n\nLIABILITIES AND\nSTOCKHOLDERS' EQUITY\n\nCurrent liabilities\n\nBank credit line        $               7,025      $              2,442\n\nAccounts payable                        11,042                    11,745\n\nCurrent maturities                      60                        65\nof long-term debt\n\nCurrent maturities                      77                        66\nof operating lease\nliabilities\n\nAccrued expenses                        5,111                     7,465\n\nDeferred revenue,                       429                       --\ncurrent\n\nTotal current           $               23,744     $              21,783\nliabilities\n\nLong-term debt, less                    --                        15\ncurrent maturities\n\nOperating lease                         --                        22\nliabilities, less\ncurrent maturities\n\nDeferred revenue                        747                       --\nnoncurrent\n\nTotal liabilities       $               24,491     $              21,820\n\nStockholders' equity\n\nCommon stock:                           459                       351\nAuthorized:\n60,000,000 shares at\n$0.01 par value;\nissued and\noutstanding:\n45,856,351 shares at\nSeptember 30, 2021\nand 35,074,922\nshares at December\n31, 2020,\nrespectively\n\nAdditional paid in                      89,075                    64,527\ncapital\n\nAccumulated deficit                     (57,486)                  (57,087)\n\nTotal stockholders'                     32,048                    7,791\nequity\n\nTotal liabilities       $               56,539     $              29,611\nand stockholders'\nequity\n\n//et\n\n//st\n\nMINIM, INC.\n\nConsolidated Statements of Operations\n\n(Unaudited) (in thousands, except per share data)\n       Three Months Ended September 30,   Twelve Months Ended September 30,\n\n       2021       2020    2021       2020\n\nNet sales    $     15,036 $  12,028 $     44,947 $  34,256\n\nCost of sales      10,543    8,151      30,872    25,160\n\nGross profit       4,493     3,877      14,075    9,096\n\nOperating\nexpenses:\n\nSelling and      3,500     2,012      9,883     6,650\nmarketing\n\nGeneral and      1,371     1,468      3,775     3,012\nadministrative\n\nResearch and       1,789     729      4,564     2,025\ndevelopment\n\nTotal        6,660     4,209      18,222    11,687\noperating\nexpenses\n\nSale of        3,956     --       3,956     --\ntrademark, net\n\nOperating        1,789     (332)      (191)     (2,591)\nincome (loss)\n\nOther income\n(expense):\n\nInterest       (81)    (5)      (188)     (13)\nincome\n(expense), net\n\nOther, net       --      (1)      20      (1)\n\nTotal other      (81)    (6)      (168)     (14)\nincome\n(expense)\n\nIncome (loss)      1,708     (338)      (359)     (2,605)\nbefore income\ntaxes\n\nIncome taxes       8     3        41      16\n\nNet loss   $     1,700  $  (341)  $     (400)  $  (2,621)\n\nNet income\n(loss) per\nshare:\n\nBasic    $     0.04   $  (0.01) $     (0.01) $  (0.12)\n\nDiluted    $     0.04   $  (0.01) $     (0.01) $  (0.12)\n\nBasic        42,301    23,888     37,705    22,420\nweighted\naverage\ncommon and\ncommon\nequivalent\nshares\n\nDiluted        43,437    23,888     37,705    22,420\nweighted\naverage\ncommon and\ncommon\nequivalent\nshares\n\n//et\n\n//st\n\nMINIM, INC.\n\nReconciliation of GAAP to Non-GAAP Measures\n\n(Unaudited) (in thousands, except per share data)\n\n                             Three Months Ended September 30,\n\n                             2021                             2020\n\nGAAP net loss to Non-GAAP Adjusted EBITDA reconciliation:\n\nGAAP-based net income        $                      1,700     $      (341)\n(loss)\n\nAdd: Other income and                               89               9\ntaxes\n\nAdd: Depreciation and                               412              43\nAmortization\n\nGAAP-based EBITDA                                   2,201            (289)\n\nAdjustments to GAAP-based\nEBITDA:\n\nAdd: GAAP sales net to                              174              --\nrevenue bookings\n\nLess: Sale of trademark,                            (3,956)          --\nnet\n\nAdd: Tariffs and air                                --               678\nfreight\n\nAdd: Merger deal costs                              --               324\n\nAdd: Stock-based                                    158              88\ncompensation expense\n\nTotal adjustments                                   (3,624)          1,090\n\nNon-GAAP-based Adjusted      $                      (1,423)   $      801\nEBITDA\n\n//et\n\n//st\n\n                            Nine Months Ended September 30,\n\n                            2021                            2020\n\nGAAP net loss to Non-GAAP Adjusted EBITDA reconciliation:\n\nGAAP-based net income       $                     (400)     $      (2,621)\n(loss)\n\nAdd: Other income and                             209              29\ntaxes\n\nAdd: Depreciation and                             750              140\nAmortization\n\nGAAP-based EBITDA                                 559              (2,452)\n\nAdjustments to\nGAAP-based EBITDA:\n\nAdd: GAAP sales net to                            1,176            --\nrevenue bookings\n\nLess: Sale of trademark,                          (3,956)          --\nnet\n\nAdd: Tariffs and air                              --               4,092\nfreight\n\nAdd: Merger deal costs                            --               324\n\nAdd: Stock-based                                  774              282\ncompensation expense\n\nTotal adjustments                                 (2,006)          4,698\n\nNon-GAAP-based Adjusted     $                     (1,447)   $      2,246\nEBITDA\n\n//et\n\nTel   : 617-423-1072    MINIM INC\nWWW   : <a href=\"https://www.minim.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.minim.com</a>\n\n                     ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2130500722.MNPRE2130502669-07492920211102</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}