{"date": "2021-11-08 05:34:57+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The author is a Reuters Breakingviews columnist.  The opinions expressed are his own.</p><p class=\"tr-by\">By Pete Sweeney</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">HONG KONG, Nov 8 (Reuters Breakingviews)</span><span class=\"tr-dl-sep\"> - </span>Newspapers have been rocky places to invest, and Alibaba’s <a href=\"reuters://REALTIME/Verb=FullQuote/ric=BABA.N\" data-type=\"ric\" data-ric=\"BABA.N\" translate=\"no\" dir=\"ltr\">BABA.N</a> <a href=\"reuters://REALTIME/Verb=FullQuote/ric=9988.HK\" data-type=\"ric\" data-ric=\"9988.HK\" translate=\"no\" dir=\"ltr\">9988.HK</a> $266 million acquisition of Hong Kong’s South China Morning Post is proving no exception. It says it’s not up for sale following a report that Beijing-backed buyers are circling. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2RW317\" data-type=\"storyId\" data-story-id=\"nL4N2RW317\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> Offloading it would be good news for Alibaba, but bad news for the financial hub it covers. </p><p>Ownership by benevolent tech billionaires can be good for broadsheet balance sheets and online nous. An investment by Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> founder Jeff Bezos has served The Washington Post well, while backing by the Chinese e-commerce giant under co-founder Jack Ma’s watch helped the SCMP upgrade systems, recruit experienced journalists and <a href=\"https://advertising.scmp.com/about-scmp\" data-type=\"url\" class=\"tr-link\" translate=\"no\">expand its readership overseas</a>. </p><p>Such projects are, as a rule, more about idealism or vanity than profit given the industry’s low margins and slow growth. Revenue in the global print division at Breakingviews parent company Thomson Reuters, which sells news and photographs to other media, <a href=\"https://ir.thomsonreuters.com/static-files/d9dc33b9-c57e-4668-8be9-7c89e50ca009\" data-type=\"url\" class=\"tr-link\" translate=\"no\">contracted 1%</a> in the first nine months in 2021 from a year earlier.</p><p>Unlike Bezos, however, Alibaba operates in a political system where officials control news narratives. That makes some of SCMP’s coverage awkward for Alibaba. SCMP’s solid reporting on Hong Kong’s 2019 protest movement largely contrasted with mainland media that described demonstrators as separatists and terrorists. To China hawks, the newspaper’s stable of pro-Beijing columnists and favourable China stories make it a de facto propaganda outlet. It is near-impossible to strike a balance that satisfies both sides.</p><p>Alibaba, which originally encouraged SCMP to expand its overseas influence without worrying about profit, appeared to tighten the purse strings in 2020. SCMP restored its paywall as advertising revenue fell, and executives took pay cuts. That roughly coincided with Ma’s intensifying political problems, which torpedoed the initial public offering of his financial technology outfit Ant and led to regulatory fines on the e-commerce empire for monopolistic behaviour. </p><p>Selling SCMP to a government-backed entity would remove the financial distraction and political risk for Alibaba management and shareholders. As occurred when brokerage CLSA was acquired by state-owned CITIC, however, it also would send staff for the exits and quash editorial independence. The bigger headline would be a sad one for Hong Kong. </p><p>Follow <a href=\"https://twitter.com/petesweeneypro\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@petesweeneypro</a> on Twitter</p><p><br/></p><p>CONTEXT NEWS</p><p>- Alibaba co-founder Joe Tsai said the company has no plans to sell Hong Kong’s South China Morning Post in a letter seen by Reuters, following a Bloomberg report on Nov. 5 that Bauhinia Culture, a Chinese state-owned enterprise, was considering an offer to buy the newspaper. </p><p><br/></p><p class=\"tr-signoff\"> (Editing by Jeffrey Goldfarb and Katrina Hamlin)</p><p class=\"tr-contactinfo\">((For previous columns by the author, Reuters customers can click on <a href=\"reuters://REALTIME/verb=Headlines/ric=SWEENEY/\" data-type=\"newsExpression\" data-expression=\"SWEENEY/\" translate=\"no\" dir=\"ltr\">SWEENEY/</a> <br/> SIGN UP FOR BREAKINGVIEWS EMAIL ALERTS <a href=\"https://bit.ly/BVsubscribe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://bit.ly/BVsubscribe</a> | <a href=\"mailto:pete.sweeney@thomsonreuters.com\" data-type=\"email\" translate=\"no\">pete.sweeney@thomsonreuters.com</a> ; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://pete.sweeney.thomsonreuters.com@reuters.net\">pete.sweeney.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SCMP-ALIBABA/BREAKINGVIEWS</p></div>"}