{"date": "2021-12-07 16:30:12.056000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MAMAMANCINI'S HOLDINGS INC (\"MMMB-Q\")\n- to Host Third Quarter 2022 Earnings Call on Tuesday, December\n- 14th at 4:30 p.m. Eastern Time\n\n     MamaMancini's Holdings, Inc., a marketer of specialty pre-prepared,\nfrozen and refrigerated food products, will release financial results for\nthe fiscal third quarter ended October 31, 2021, after market close on\nTuesday, December 14, 2021.\n\n     Management will host an investor conference call at 4:30 p.m. Eastern\ntime on Tuesday, December 14, 2021 to discuss the Company's third quarter\nfiscal 2022 financial results, provide a corporate update, and conclude\nwith a Q&amp;A from participants. To participate, please use the following\ninformation:\n\n     Q3 Fiscal 2022 Earnings &amp; Corporate Update Conference Call\nDate: Tuesday, December 14, 2021\nTime: 4:30 p.m. Eastern time\nU.S. Dial-in: 1-844-889-4326\nInternational Dial-in: 1-412-317-9264\nConference ID: 10162267\nWebcast:\n<a href=\"https://services.choruscall.com/mediaframe/webcast.html?webcastid=uExPphHP\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://services.choruscall.com/mediaframe/webcast.html?webcastid=uExPphHP</a>\n\n     Please dial in at least five minutes before the start of the call to\nensure timely participation.\n\n     A playback of the call will be available through December 21, 2021. To\nlisten, call 1-877-344-7529 within the United States or 1-412-317-0088 when\ncalling internationally. Please use the replay pin number 10162267.\n\n     About MamaMancini's Holdings, Inc.\n\n     MamaMancini's Holdings, Inc. (NASDAQ: MMMB) is a marketer and\ndistributor of specialty prepared, refrigerated and frozen all-natural\nItalian foods. MamaMancini's product portfolio consists of over 40 products\nincluding meatballs, meat loaf, chicken parmesan, sausages and pasta bowl\nkits, with beef, turkey, chicken and pork varieties. The Company's products\nare sold in over 45,000 locations nationwide, including at well-known\nretailers such as Sam's Club, Whole Foods, Publix, Costco and Albertsons,\nas well as through national distributors such as Sysco and United Natural\nFoods. The Company also regularly maintains a direct-to-consumer presence\nthrough presentations on QVC. For more information, please visit\nwww.mamamancinis.com.\n\n     Forward-Looking Statements\n\n     This press release may contain \"forward-looking statements\" within the\nmeaning of Section 27A of the Securities Act of 1933, as amended, and\nSection 21E of the Securities Exchange Act of 1934. \"Forward-looking\nstatements\" describe future expectations, plans, results, or strategies and\nare generally preceded by words such as \"may,\" \"future,\" \"plan\" or\n\"planned,\" \"will\" or \"should,\" \"expected,\" \"anticipates,\" \"draft,\"\n\"eventually\" or \"projected.\" You are cautioned that such statements are\nsubject to a multitude of risks and uncertainties that could cause future\ncircumstances, events, or results to differ materially from those projected\nin the forward-looking statements, including the risks that actual results\nmay differ materially from those projected in the forward-looking\nstatements as a result of various factors, and other risks identified in\nthe Company's 10-K for the fiscal year ended January 31, 2021 and other\nfilings made by the Company with the Securities and Exchange Commission.\n\nContact Information:\n\nLucas A. Zimmerman\nDirector\nMZ Group - MZ North America\n(949) 259-4987\nMMMB@mzgroup.us\nwww.mzgroup.us\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134000380.MNPRE2134002396-08283820211207</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}