{"date": "2022-02-24 13:12:36+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n                  <strong>JERSEY CITY, NJ</strong>\n                  <strong>-</strong>\n                  <strong>February 24, 2022</strong>\n                  <strong>-</strong> Amdocs (NASDAQ: DOX), a leading provider of software and services to communications and media companies, announced a significant milestone in its program of successful implementations of its real-time online charging solution on Amazon Web Services (AWS).\n      </p>\n                <p>\n        In recent tests, Amdocs and AWS have demonstrated a scale capacity target of 12 billion complex charging transactions per day, which will be an essential part of a proposed business support system (BSS) transformation for a top-tier service provider. Amdocs believes that all service providers will need to comfortably achieve such milestones to fully monetize the different business models enabled by 5G moving forward.\n      </p>\n                <p>\n        This performance breakthrough builds upon advancements Amdocs has made in cloud-native, service-based architecture design and optimization required for the 5G market. Previously, Amdocs achieved a one trillion events-per-day benchmark in the cloud, and this recent achievement handled much more complex online and offline transactions. These volumes support real-world business requirements that would touch hundreds of millions of customers and devices.\n      </p>\n                <p>\n        Separately, Amdocs built a proof of concept for a service provider concerned about roundtrip latency impacts due to the distance between their core network running on-premises and the Amdocs Convergent Charging system on an AWS Region more than 930 miles apart. Using the customer's backbone network and AWS Direct Connect, Amdocs' deployment proved that the overall solution enabled on AWS would meet the customer's service level agreement (SLA) requirements while benefiting from the cloud's improved flexibility, resiliency, and security.\n      </p>\n                <p>\n        Through implementations such as these, Amdocs' charging and policy control products will further accelerate the modernization of the industry's information technology (IT) into an open and dynamic infrastructure, improving time-to-market for new innovative services.\n      </p>\n                <p>\n        Anthony Goonetilleke, Group President of Technology and Head of Strategy at Amdocs said: \"With 5G expected to drive diverse monetization models across a plethora of connected experiences, this benchmark on AWS showcases the benefits of Amdocs' charging platform leveraging the scalability and power of public cloud. This is a critical milestone in our <a href=\"https://www.amdocs.com/news-press/amdocs-collaborates-aws-accelerate-telecommunications-industrys-move-cloud\" data-type=\"url\" class=\"tr-link\" translate=\"no\">relationship</a> with AWS that showcases our ability to process a leading volume of real-time, low-latency transactions on public cloud infrastructure.\"\n      </p>\n                <p>\n                  <strong>Supporting Resources</strong>\n                </p>\n                <p>\n                  <strong>About Amdocs</strong>\n                  <br/>\n         Amdocs helps those who build the future to make it amazing. With our market-leading portfolio of software products and services, we unlock our customers' innovative potential, empowering them to provide next-generation communication and media experiences for both the individual end user and enterprise customers. Our 29,000 employees around the globe are here to accelerate service providers' migration to the cloud, enable them to differentiate in the 5G era, and digitalize and automate their operations. Listed on the NASDAQ Global Select Market, Amdocs had revenue of $4.3 billion in fiscal 2021. For more information, visit Amdocs at <a href=\"http://www.amdocs.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amdocs.com</a></p>\n                <p>\n                  <strong>Amdocs' Forward-Looking Statement</strong>\n                  <br/>\n         This press release includes information that constitutes forward-looking statements made pursuant to the safe harbor provision of the Private Securities Litigation Reform Act of 1995, including statements about Amdocs' growth and business results in future quarters. Although we believe the expectations reflected in such forward-looking statements are based upon reasonable assumptions, we can give no assurance that our expectations will be obtained or that any deviations will not be material. Such statements involve risks and uncertainties that may cause future results to differ from those anticipated. These risks include, but are not limited to, the effects of general economic conditions, Amdocs' ability to grow in the business markets that it serves, Amdocs' ability to successfully integrate acquired businesses, adverse effects of market competition, rapid technological shifts that may render the Company's products and services obsolete, potential loss of a major customer, our ability to develop long-term relationships with our customers, and risks associated with operating businesses in the international market. Amdocs may elect to update these forward-looking statements at some point in the future; however, the Company specifically disclaims any obligation to do so. These and other risks are discussed at greater length in Amdocs' filings with the Securities and Exchange Commission, including in our Annual Report on Form 20-F for the fiscal year ended September 30, 2021 filed on December 10, 2021, and our Form 6-K furnished for the first quarter of fiscal 2022 on February 14, 2022.\n      </p>\n                <p>\n                  <strong>Media Contact:</strong>\n                </p>\n                <p>\n        Michael Zema<br/>\n         Amdocs Public Relations<br/>\n         E-mail: Michael.Zema@amdocs.com\n      </p>\n                <p>\n        Emily Holt<br/>\n         PAN Communications for Amdocs<br/>\n         Email: Amdocs@pancomm.com\n      </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.amdocs.com/news-press/amdocs-showcases-amazing-charging-capacity-enabling-12-billion-complex\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amdocs Ltd.</strong> published this content on <strong>24 February 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>24 February 2022 13:12:36 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - Amdocs Ltd.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amdocs-Ltd.</p></div>"}