{"date": "2021-11-30 19:45:00.507000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p align=\"left\">HERZLIYA, Israel and SAN JOSE, Calif. and LAS VEGAS, Nov.  30, 2021  (GLOBE NEWSWIRE) --  at AWS re:Invent,  <a href=\"https://www.globenewswire.com/Tracker?data=RrtV92mW0E4UXQa9Z0sm31VITHYFwj92det5Ift8ZHDnNwElR27jKXs-CunJn-0vWlfgG5wtCaf2tNjaOHF1BRNAVeXz720nYYWs96yCyuc=\"><u>Otonomo Technologies Ltd.</u></a> (Otonomo), (Nasdaq: <a href=\"https://www.globenewswire.com/Tracker?data=9utnE58tu7tK55AFfruc5r9lEBTXZabVZYbKZsBvoqS5_yM-7pPwTfp1h2bvtchdnEOzhS5iv_VJ7_MOj0V68A==\"><u>OTMO</u></a>), a leading mobility intelligence platform provider, today announced its plans for building on its Amazon Web Services (AWS) Partner Network (APN) membership and existing integration with AWS Connected Mobility Solution by adding support for AWS IoT FleetWise, a new AWS service launching today.<br/></p><p>“Today’s connected cars are already data centers on wheels, each generating GBs of data per hour,” said <strong>Mike Tzamaloukas, GM IoT Automotive, AWS</strong>. “The collaboration between Otonomo and AWS Kaleidoscope will accelerate automakers and their partners capabilities to put this massive amount of data to use creating new and innovative solutions that will advance the entire mobility industry.” </p><p>AWS IoT FleetWise’s advanced capabilities include the efficient collection and transfer of select automotive data to the cloud in near real-time from any vehicle. These capabilities, combined with AWS IoT FleetWise’s intelligent filtering capabilities, will make it even easier for Otonomo to process and deliver the massive quantities of vehicle data it manages daily into AWS workloads. Otonomo expects the resulting, increased velocity to enable its customers to build the next-generation of connected car applications.</p><p>“At Otonomo, we’re committed to driving smarter decisions and services for our customers through the utilization of connected vehicle data,” said <strong>Ben Volkow, CEO and Co-Founder, Otonomo</strong>. “Today’s Kaleidoscope announcement helps automakers collect and transfer data to the cloud more easily and efficiently than ever before. We are thrilled to expand our work leveraging AWS and are excited about the additional capabilities made possible through Kaleidoscope.”</p><p>For more information about Otonomo’s vehicle data platform and marketplace, visit <a href=\"https://www.globenewswire.com/Tracker?data=HYMePUU1j5h80aS4XWnV2bXQX22V-M_iYugcUStyq2KbbZ9scb995tPPh9aVTLNlCVUj41Vu2DRcC8VqEpQVZw==\"><u>www.otonomo.io</u></a>.</p><p><strong>About Otonomo</strong></p><p>Otonomo fuels a data ecosystem of OEMs, fleets, and more than 100 service providers spanning the transportation, mobility, and automotive industries. Our platform securely ingests more than 4 billion data points per day globally from over 40 million vehicles licensed on the platform as well as mobility demand data from multimodal sources, then reshapes and enriches it to accelerate time to market for new services that improve the mobility and transportation experience. We provide deeper visibility and actionable insights to empower strategic data-driven decisions – taking the guesswork out of mobility and transportation planning, deployment and operations. Privacy by design and neutrality are at the core of our platform, which enables GDPR, CCPA, and other privacy-regulation-compliant solutions using both personal and aggregate data. Use cases include emergency services, mapping, traffic management, EV management, subscription-based services, micro-mobility, parking, predictive maintenance, insurance, media, in-vehicle services, and dozens of smart city solutions. Otonomo has an R&amp;D center in Israel and a presence in the United States and Europe.</p><p>More information is available at <a href=\"https://www.globenewswire.com/Tracker?data=Mhl24C53pdRw63yAbSWpVuUQlKnt30OVWaZWfr2gFh53rbN985zoyxXCo3DG2rlBNSkBRNAy4LK_qg4boku7eQ==\"><u>otonomo.io</u></a></p><p><strong>Otonomo on Social Media</strong><br/>● Follow Otonomo on <a href=\"https://www.globenewswire.com/Tracker?data=WWTsL5VnDy-CGUOM23qHZbDrXu_2RzX73u8y4hwd-LyxEl5WKOYqB3x4gW3NUi3nh0IM1m1QLAUWUhNlUnMXYrObFaMucvIyFi_fdBNseak=\"><u>LinkedIn</u></a><br/>● Like Otonomo on <a href=\"https://www.globenewswire.com/Tracker?data=8p_3lmYd03vX6jvBHtg85iDOkMbHJEVVNMtushKiglKsV-ksUzJWWFOun9uj9wWwcGJ3TCQsW6cmYuYYTHDhbko-wTNXAXW2lAk9NbJCeDU=\"><u>Facebook</u></a><br/>● Follow Otonomo in <a href=\"https://www.globenewswire.com/Tracker?data=oguuNzZgu9skAZB1UBFKo12O-cHe3YggbxWBmnoWEU2v2mWhA1IDTC3oqk9GacXIW64g3uvevU7uZQY5GKPxbQ==\"><u>Twitter</u></a></p><p><strong>For press inquiries, please contact:</strong><br/><strong>Otonomo</strong><br/>Jodi Joseph Asiag<br/>Head of Content and Communications<br/><a href=\"https://www.globenewswire.com/Tracker?data=ff0rV8ZSi38nR41vL5IhmvIW0f1-s-dBIufIJuQ55iRmp83G418diEc3qfR3ttd4J6KnKdEeWLjBKkMJeK7_vUgO-pgkwSkgYgLa1cSwjgk=\"><u>jodija@otonomo.io</u></a></p><p><strong>For investment  inquiries, please contact:</strong><br/><strong>MS- IR for Otonomo</strong><br/>Miri Segal<br/>msegal@ms-ir.com</p><p><strong><span>Forward Looking Statements</span></strong></p><p><span>This announcement contains certain forward-looking statements within the meaning of the federal securities laws, including statements regarding the services offered by Otonomo, the anticipated technological capability of Otonomo, the anticipated benefits of the partnership with AWS, the markets in which Otonomo operates and Otonomo’s projected future financial and operational results. These forward-looking statements generally are identified by the words “believe,” “project,” “expect,” “anticipate,” “estimate,” “intend,” “strategy,” “future,” “opportunity,” “plan,” “may,” “should,” “will,” “would,” “will be,” “will continue,” “will likely result,” and similar expressions. Forward-looking statements are predictions, projections and other statements about future events that are based on current expectations and assumptions and, as a result, are subject to risks and uncertainties. Many factors could cause actual future events to differ materially from the forward-looking statements in this announcement, including but not limited to, the ability to implement business plans, forecasts, and other expectations, the ability to identify and realize additional opportunities, the ability to successfully integrate Neura, and potential changes and developments in the highly competitive data marketplace. The foregoing list of factors is not exhaustive. You should carefully consider the foregoing factors and the other risks and uncertainties described in Otonomo’s final prospectus filed with the SEC on Nov 3, 2021 and other documents filed by Otonomo from time to time with the SEC. These filings identify and address other important risks and uncertainties that could cause actual events and results to differ materially from those contained in the forward-looking statements. Forward-looking statements speak only as of the date they are made. Readers are cautioned not to put undue reliance on forward-looking statements, and Otonomo assumes no obligation and does not intend to update or revise these forward-looking statements, whether as a result of new information, future events, or otherwise. Otonomo gives no assurance that it will achieve its expectations.</span></p><p> <br/></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=MTAwMDU4MTE0NCM0MDExMTM1ODIjMjIwOTU1MQ==\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9TVRBd01EVTRNVEUwTkNNME1ERXhNVE0xT0RJak1qSXdPVFUxTVE9PQ==&amp;key=73e1b9c4f1772956fa4bdd06ee971d90f0d080f507045ae1374897dc12918ace915b28c78ba34d8bec68964ae6c80f6adfd4fd6e9bfb13c995b8b73ce667a8c7\"/></div></div><br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml-eu.globenewswire.com/media/MTVkYTMzYzYtYzYxMC00ZThhLWIxZTEtYjkxNGM2NDE2MmZlLTEyMjExMDQ=/tiny/OTONOMO-TECHNOLOGIES-LTD.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC1ldS5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9NVFZrWVRNell6WXRZell4TUMwMFpUaGhMV0l4WlRFdFlqa3hOR00yTkRFMk1tWmxMVEV5TWpFeE1EUT0vdGlueS9PVE9OT01PLVRFQ0hOT0xPR0lFUy1MVEQucG5n&amp;key=56da4f12dc73f7fe9ac2122d3a2a0ab6a147f925a5dccfbe7152bf50268dc58bf8348421e7766cd2dc18e6e718ca8e7409c38545d712068ae2bb1e7190d701a2\"/></div></div><p><a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/a98280d2-b98f-404e-aff3-58dd5fcc058c\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Primary Logo\" border=\"0\" src=\"https://ml-eu.globenewswire.com/media/a98280d2-b98f-404e-aff3-58dd5fcc058c/small/logo-corpblue-png.png\" style=\"max-height:113px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC1ldS5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9hOTgyODBkMi1iOThmLTQwNGUtYWZmMy01OGRkNWZjYzA1OGMvc21hbGwvbG9nby1jb3JwYmx1ZS1wbmcucG5n&amp;key=2ab4968a3f9ee9c6e64fb9f701b13f0afce7e8709f7135638de9557262dc80aa42f82178d2d6f8033b54d3e4f6a33135a26216e1d207a542e413c09a5bfb277d\"/></div></div></a></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">GlobeNewswire, Inc. 2021</p></div>"}