{"date": "2021-12-10 13:58:09.375000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.16, "close": 3444.24}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>PLAYGON GAMES INC (\"DEAL-V;PLGNF-0\")\n- Laser Focused on B2B iGaming Market\n\n     Playgon Games Inc. announces its placement in an editorial published\nby NetworkNewsWire (\"NNW\"), one of 50+ trusted brands within the\nInvestorBrandNetwork (\"IBN\"), a multifaceted financial news and publishing\ncompany for private and public entities.\n\n     To view the full publication, \"Digitization Reshaped Ecommerce First,\nNow Moving to Online Gaming,\" please visit: <a href=\"https://nnw.fm/KY9FT\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://nnw.fm/KY9FT</a>\n\n     The early days of ecommerce can be traced back decades, sluggish until\nthe 2000s, then accelerating rapidly over the last 10-plus years. Online\ngaming is on a similar trajectory. Analogous to what Amazon and Alibaba did\nfor ecommerce, online gaming has deep roots that go back decades and now\nhas entered a growth stage that many believe will chart like a hockey\nstick.\n\n     There are different approaches to capitalizing on what appears to be\nparabolic growth across the industry. More merchants than miners became\nmillionaires during the California gold rush, and servicing the companies\nthat provide consumer gaming just might be one of the best ways to cash a\nticket. Playgon Games Inc. (TSX.V: DEAL) (OTCQB: PLGNF), a\nSoftware-as-a-Service (SaaS) technology company, is laser focused on that\nbusiness-to-business (B2B) market, developing and licensing unique digital\ncontent for the iGaming market.\n\n     About Playgon Games Inc.\n\n     Playgon is a SaaS technology company focused on developing and\nlicensing digital content for the growing iGaming market. The company\nprovides a multitenant gateway that allows online operators the ability to\noffer their customers innovative iGaming software solutions. Its current\nsoftware platform includes live-dealer casino, eTable games and daily\nfantasy sports, which, through a seamless integration at the operator\nlevel, allows customer access without having to share or compromise any\nsensitive customer data. As a true business-to-business digital content\nprovider, Playgon products are ideal turnkey solutions for online casinos,\nsportsbook operators, land-based operators, media groups and big database\ncompanies. For more information about the company, please visit\nwww.Playgon.com.\n\n     NOTE TO INVESTORS: The latest news and updates relating to PLGNF are\navailable in the company's newsroom at <a href=\"https://ibn.fm/PLGNF\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://ibn.fm/PLGNF</a>\n\n     About NetworkNewsWire\n\n     NetworkNewsWire (NNW) is an information service that provides (1)\naccess to our news aggregation and syndication servers, (2)\nNetworkNewsBreaks that summarize corporate news and information, (3)\nenhanced press release services, (4) social media distribution and\noptimization services, and (5) a full array of corporate communication\nsolutions. As a multifaceted financial news and content distribution\ncompany with an extensive team of contributing journalists and writers, NNW\nis uniquely positioned to best serve private and public companies that\ndesire to reach a wide audience of investors, consumers, journalists and\nthe general public. NNW has an ever-growing distribution network of more\nthan 5,000 key syndication outlets across the country. By cutting through\nthe overload of information in today's market, NNW brings its clients\nunparalleled visibility, recognition and brand awareness.\n\n     NNW is where news, content and information converge.\n\n     To receive SMS text alerts from NetworkNewsWire, text \"STOCKS\" to\n77948 (U.S. Mobile Phones Only)\nFor more information please visit <a href=\"https://www.NetworkNewsWire.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.NetworkNewsWire.com</a>\n\n     Please see full terms of use and disclaimers on the NetworkNewsWire\nwebsite applicable to all content provided by NNW, wherever published or\nre-published: <a href=\"http://NNW.fm/Disclaimer\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://NNW.fm/Disclaimer</a>\n\n NetworkNewsWire (NNW)\n New York, New York\n www.NetworkNewsWire.com\n 212.418.1217 Office\n Editor@NetworkNewsWire.com\n\n     NetworkNewsWire is part of the InvestorBrandNetwork\n\nTel   : 604-685-9316    PLAYGON GAMES INC\nFax   : 604-683-1585\nEmail : ndemare@chasemgt.com\nWWW   : <a href=\"http://playgon.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://playgon.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134300118.MNPRE2134300520-05562220211210</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}