{"date": "2021-11-30 19:16:24.120000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>AMAZON.COM INC (\"AMZN-Q\")\n- AWS Announces New Serverless Options for Three Analytics Services\n\n    Today, at AWS re:Invent, Amazon Web Services, Inc. (AWS), an\nAmazon.com, Inc. company announced three new serverless options for its\nsuite of analytics services that make it easier to analyze data at any\nscale without having to configure, scale, or manage the underlying\ninfrastructure. A new serverless option for Amazon Redshift automatically\nsets up and scales resources in seconds, giving customers the ability to\nrun high-performance analytics workloads on petabytes of data without\nhaving to manage data warehouse clusters. A new serverless option for\nAmazon Managed Streaming for Apache Kafka (Amazon MSK) quickly scales\nresources to vastly simplify real-time data ingestion and streaming. Amazon\nEMR now provides a serverless option for customers to run analytics\napplications using open-source big data frameworks like Apache Spark, Hive,\nand Presto without having to provision, manage, and scale the underlying\ninfrastructure.\n\n    \"Some customers want fine-grained control over every aspect of their\nworkloads, but other customers have asked AWS to take the guesswork out of\nmanaging their analytics infrastructure so they can move faster and expand\nthe use of analytics in their organizations. Today, we are helping\ncustomers reduce the complexity of managing their analytics infrastructure\nby offering serverless versions of three popular analytics services,\" said\nRahul Pathak, Vice President of Analytics at AWS. \"This makes it\nsignificantly easier and more cost effective for customers to modernize\ntheir infrastructure and unify vast amounts of data from a variety of\nendpoints. Now, customers can run analytics workloads at any scale and\nquickly deliver insights to the people and applications that need\nit--without having to even think about managing infrastructure.\"\n\n    AWS customers use a wide variety of purpose-built analytics services to\nmake data-driven decisions, including Amazon Redshift for data warehousing,\nAmazon MSK for processing real-time data streams, and Amazon EMR for\nrunning Apache Spark, Hive, Presto, and other open-source big data\nframeworks. These services offer powerful analytics capabilities for a\nvariety of use cases, but there is a subset of customers who want to\nbenefit from AWS analytics services and don't want to put in the time\nneeded to learn how to manage the underlying clusters or servers. To remove\nthe complexity of scaling and managing infrastructure, AWS introduced the\nconcept of serverless, event-driven computing in 2014, and many customers\nhave adopted serverless technologies on AWS because it removes the need to\nconfigure, scale, or manage servers or provision compute instances and\nstorage to meet peak capacity for their applications. The new serverless\noptions announced today extend these capabilities to AWS analytics engines\nto automatically add or subtract resources to provide just the right amount\nof capacity to meet the demands of data analytics at any scale, so\ncustomers do not need to worry about constantly right-sizing clusters or\nover provisioning for peak capacity--saving them time and helping them\noptimize costs. With today's announcements, customers can now enjoy the\nautomatic provisioning, on-demand scaling, and pay-as-you-go pricing of\nserverless to lower costs, expand analytics to more users, and quickly and\neasily get started with AWS analytics services, including:\n\n//st\n\n  * Serverless data warehouse with Amazon Redshift Serverless: Today, tens\nof thousands of customers are collectively processing more than two\nexabytes of data with Amazon Redshift every day. Amazon Redshift offers up\nto 3x better price performance and up to 10x better query performance than\nother enterprise cloud data warehouses, providing customers with faster\ndata analytics at lower cost. The new serverless option for Amazon Redshift\nnow makes it even easier to get insights from data quickly without the need\nto set up, manage, or scale clusters. Customers currently managing their\nown Amazon Redshift clusters can easily move them to the new serverless\noption using the Amazon Redshift console or the application programming\ninterface (API) without making changes to their applications. To learn more\nabout the new serverless option for Amazon Redshift, visit\naws.amazon.com/redshift/redshift-serverless.\n  * Serverless data streaming with Amazon MSK Serverless: Today's\norganizations are increasingly adopting Apache Kafka to capture and analyze\nreal-time data streams from IoT devices, website clickstreams, database\nlogs, and many other sources where dynamic data is continuously generated.\nAmazon MSK Serverless now builds, manages, and scales clusters\nautomatically, so customers no longer have to worry about capacity planning\nor unpredictable workloads. To get started with Amazon MSK Serverless,\ncustomers simply create a cluster in the Amazon MSK console, set up a\nprivate and secure Apache Kafka endpoint, and use new or existing Apache\nKafka clients to stream data. To learn more about Amazon MSK Serverless,\nvisit aws.amazon.com/msk/features/msk-serverless.\n  * Serverless big data analytics with Amazon EMR Serverless: Tens of\nthousands of customers use Amazon EMR to run open-source frameworks like\nApache Spark, Hive, and Presto for large-scale distributed data processing\njobs, interactive SQL queries, and machine learning applications. With\nAmazon EMR Serverless, customers simply specify the framework they want to\nrun, and Amazon EMR Serverless provisions, manages, and scales the compute\nand memory resources up and down as workload demands change. Customers can\nget started with Amazon EMR Serverless by simply selecting an open-source\nframework and submitting their job using Amazon EMR APIs, the AWS Command\nLine Interface (AWS CLI), or the AWS Management Console. To learn more\nabout Amazon EMR Serverless, visit aws.amazon.com/emr/serverless.\n\n//et\n\n    Roche is one of the largest pharmaceutical companies in the world and\nthe leading provider of cancer treatments globally. \"Amazon Redshift\nServerless helps us complete our data management without having to manage\nclusters and optimizes our cost by provisioning just the right amount of\ncapacity to meet demand,\" said Dr. Yannick Misteli, Lead Cloud Platform and\nML Engineer at Roche. \"Amazon Redshift Serverless is reducing the\noperational burden, lowering costs, and enabling scale for the Roche\nGo-to-Market domain. This simplification is a game changer, helping us\nrapidly onboard and support a variety of analytics-heavy use cases without\nfriction.\"\n\n    Riot Games is a video game developer and publisher, renowned for\ncreating one of the world's most-played PC games: League of Legends. \"We\ningest about 20 terabytes of data per day using Amazon MSK on AWS, and\nreducing the time to query this data after it is produced is critical for\nus. With Amazon MSK, we now have a mechanism for streaming data into our\necosystem while eliminating the heavy lifting of running Apache Kafka on\nour own,\" said Wesley Kerr, Sr. Principal Data Scientist at Riot Games.\n\"Amazon MSK Serverless will further streamline our operations, as it allows\nus to keep up with changes in demand without having to take scaling\nactions. As a result, our developers can worry less about scaling Apache\nKafka and focus more on offering the best gaming experiences around the\nworld.\"\n\n    Intuit is the global technology platform that helps consumers and small\nbusinesses overcome their most important financial challenges, serving more\nthan 100 million customers worldwide with TurboTax, QuickBooks, Mint,\nCredit Karma, and Mailchimp. \"At Intuit we use Apache Kafka as a central\nevent bus that sits between thousands of decoupled microservices that power\nour products,\" said Ritesh Bansal, Director of Engineering at Intuit. \"We\nrecently migrated our self-managed Apache Kafka clusters to Amazon MSK\nbecause it allows us to redirect engineering talent towards innovations\ncloser to our end customers. We're excited about Amazon MSK Serverless,\nwhich will make managing our scale and capacity much easier.\"\n\n    The Orchard, a Sony Music Entertainment subsidiary, collects,\nprocesses, and distributes music from labels and artists to Spotify, Amazon\nMusic, and other streaming providers and physical retailers. \"Amazon MSK\nhas helped us accelerate the pace at which we are launching production\nready applications that process streaming data for The Orchard Suite,\" said\nFarouk Umar, Engineering Manager at The Orchard. \"Amazon MSK Serverless\nenables teams that are not familiar with Apache Kafka scaling to benefit\nfrom Amazon MSK, allowing us to fully decentralize Apache Kafka in our\norganization and provide a better developer experience. As a result, we are\nable to scale adoption of Apache Kafka faster, which helps us accelerate\nadoption of our event-driven strategy.\"\n\n    Classmethod, Inc. is a leading cloud integrator with expertise in big\ndata, mobile, and artificial intelligence. \"Our data integration platform\nservice, called Customer Story Analytics (CSA), integrates Amazon Redshift,\nAmazon S3, Amazon Aurora, and other services to avoid data silos and\nprovide powerful, unified governance between data services,\" said Satoru\nIshikawa, Solution Architect, Data Integration Division at Classmethod.\n\"Amazon Redshift Serverless automates the sizing of compute and storage and\nquickly scales to meet demand. This elastic serverless experience mitigates\nmanual operational costs, expands data access among departments, and\naccelerates autonomy on data analytics and machine learning, allowing us to\nscale the CSA business in new and exciting ways.\"\n\n    Sedric is an AI risk and compliance excellence platform designed for\nthe new generation of fintech. \"Ease of use and self-service data access is\nkey for our analytics initiatives. With Amazon Redshift Serverless, we\ndon't have to think about managing the data warehouse,\" said Tomer Levi,\nVice President of R&amp;D at Sedric. \"Data from Amazon S3 gets loaded 7x faster\nfor us than our previous solution, helping us get actionable insights from\nmillions of customer events. We are thrilled with the performance\nimprovements and cost optimizations we are seeing with Amazon Redshift\nServerless.\"\n\n    ZS Associates is a global professional services firm that helps\ncompanies develop and deliver products for their customers. \"We leverage\nAWS heavily for our data analytics strategy and have had tremendous success\nover the years. Our SaaS products depend on Amazon EMR versions to upgrade\nSpark reliably and remove the undifferentiated heavy lifting,\" said Anirudh\nVohra, Associate Director of Cloud Architecture at ZS. \"However, some of\nour workloads don't need the level of customization offered by Amazon EMR\non EC2, and we want to simply run certain Apache Spark applications without\nworrying about managing and scaling servers or clusters. We are excited\nabout the launch of Amazon EMR Serverless and look forward to porting our\nworkloads with ad-hoc analytics needs onto Amazon EMR Serverless.\"\n\n    About Amazon Web Services\n\n    For over 15 years, Amazon Web Services has been the world's most\ncomprehensive and broadly adopted cloud offering. AWS has been continually\nexpanding its services to support virtually any cloud workload, and it now\nhas more than 200 fully featured services for compute, storage, databases,\nnetworking, analytics, machine learning and artificial intelligence (AI),\nInternet of Things (IoT), mobile, security, hybrid, virtual and augmented\nreality (VR and AR), media, and application development, deployment, and\nmanagement from 81 Availability Zones within 25 geographic regions, with\nannounced plans for 27 more Availability Zones and nine more AWS Regions in\nAustralia, Canada, India, Indonesia, Israel, New Zealand, Spain,\nSwitzerland, and the United Arab Emirates. Millions of customers--including\nthe fastest-growing startups, largest enterprises, and leading government\nagencies--trust AWS to power their infrastructure, become more agile, and\nlower costs. To learn more about AWS, visit aws.amazon.com.\n\n    About Amazon\n\n    Amazon is guided by four principles: customer obsession rather than\ncompetitor focus, passion for invention, commitment to operational\nexcellence, and long-term thinking. Amazon strives to be Earth's Most\nCustomer-Centric Company, Earth's Best Employer, and Earth's Safest Place\nto Work. Customer reviews, 1-Click shopping, personalized recommendations,\nPrime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career\nChoice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out\ntechnology, Amazon Studios, and The Climate Pledge are some of the things\npioneered by Amazon. For more information, visit amazon.com/about and\nfollow @AmazonNews.\n\n Contact Information:\n\nAmazon.com, Inc.\nMedia Hotline\nAmazon-pr@amazon.com\nwww.amazon.com/pr\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133300573.MNPRE2133302998-10485620211130</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}