{"date": "2021-12-04 10:32:27.708000+00:00", "ticker": "III", "mrkt_info": {"open": 1400.0, "close": 1400.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Friday, Dec  3</p></div><div class=\"tr-npp-lead\"><p>December 3 (Renewables Now) - Britain's 3i Infrastructure Plc (LON:3IN) will acquire the 50% stake it does not already own in offshore wind service operation vessels (SOV) company ESVAGT for GBP 268 million (USD 356.9m/EUR 314.8m), a bourse filing showed on Friday.</p><p>The holding is being purchased from co-investor AMP Capital.</p></div><div class=\"tr-npp-body\"><p>The UK infrastructure investor opted to retain its existing stake in ESVAGT after kicking off a strategic review of options in the first half of 2021. 3i Infrastructure said that it moved to buy out AMP Capital's share of equity after failing to receive binding offers that matched its expected valuation of ESVAGT.</p><p>Denmark-based ESVAGT also provides emergency rescue and response vessels (ERRV) and related services to the offshore energy industry in and around the North Sea and the Barents Sea. Founded in 1981, the business was jointly acquired by 3i Infrastructure and AMP Capital in 2015. The co-investors supported the shipping company's shift of focus towards SOVs, which now represent the bulk of ESVAGT's contracted earnings against just 10% at the time of acquisition.</p><p>In the six months to September 30, ESVAGT brought into operation three new SOVs under a long-term charter with MHI Vestas, taking its operational fleet to eight vessels. In March, the company formed a joint venture with Crowley to support the emerging offshore wind energy market in the US.</p><p>The transaction, which hinges on certain third-party consents, is slated to close in the first quarter of 2022.</p><p>(GBP 1 = USD 1.332/EUR 1.175)</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SeeNews. All rights reserved.</p></div>"}