{"date": "2021-11-05 11:20:29+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3384.0, "close": 3518.99}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        DIA and Amazon extend their fast grocery delivery\n      </p>\n                <p>\n        service to Pamplona\n      </p>\n                <p>\n        Amazon Prime customers in Pamplona and the surrounding area will receive their orders placed at the DIA shop on Amazon.es in the two-hour delivery slot that best suits them.\n      </p>\n                <p>\n        Orders are prepared at local DIA shops and delivered by Amazon.\n      </p>\n                <p>\n                  <span>Pamplona, 4 November 2021.</span> Amazon Prime customers living in Pamplona and the surrounding area can now shop online for grocery products at the DIA shop on Amazon.es and receive their order the same day in the two-hour delivery slot of their choice, free of delivery charges on orders over €50.\n      </p>\n                <p>\n        This fast delivery service, which is already available in fourteen Spanish cities (Madrid, Barcelona, Seville, Malaga, Valencia, Alicante, Bilbao, Zaragoza, Gijón, A Coruña, Murcia, Cádiz, Granada, and now Pamplona), enables DIA customers who subscribe to Amazon Prime to place their order online at the DIA shop on Amazon.es or using the Amazon app and choose the two-hour delivery slot in which they wish to receive their shopping. The orders received will be prepared at a local DIA shop and then delivered by Amazon.\n      </p>\n              </div>\n              <div>\n                <p>\n        \"At DIA, we are committed to our time-saving online shopping service for customers, so that they can spend their time doing other things. Through our alliance with Amazon, we are taking another step forward in our aim to be closer to our customers everyday. DIA's Pamplona customers will now also have the opportunity to access our products on Amazon.es and have them delivered quickly in the two-hour slot of their choice, thus simplifying their daily lives,\" <span>said</span><span>Diego Sebastián de Erice,</span></p>\n                <p>\n        Head of E-commerce Business Development at DIA Spain<span>.</span></p>\n                <p>\n        \"We are very excited to expand our fast grocery delivery service to Pamplona and the surrounding area,\" <span>said</span><span>Camille Bur, Country Manager for Amazon Fresh Amazon.es, Amazon.it, Amazon.fr.</span> \"We are always looking for ways to improve our customers' online shopping experience, and we believe that Amazon Prime customers in Pamplona will be delighted to be able to shop at the DIA shop on Amazon.es,\" <span>she added.</span></p>\n                <p>\n        Amazon Prime customers will now find more than 5,000 items at the DIA shop: private label products, local and branded ranges, including fruit and vegetables, refrigerated items, non- perishables, beauty and personal care, and household and pet supplies.\n      </p>\n                <p>\n        Amazon Prime customers can choose from convenient delivery options, including same day free delivery on orders over €50, in two-hour delivery slots between 10am and 6pm, Monday to Saturday.\n      </p>\n                <p>\n        Cada DIA Más Cerca / Cada DIA Mais Perto\n      </p>\n                <p>\n        DIA (Distribuidora Internacional de Alimentación) is a leading local supermarket chain, with nearly 6,000 stores and franchises in Spain, Portugal, Brazil, and Argentina. With the commitment of its more than 39,000 employees around the world as well as its suppliers, who are primarily local, DIA offers the best product offering and service to its more than 20 million customers.\n      </p>\n                <p>\n        PRESS\n      </p>\n                <p>\n        Rebeca Matilla / Leyla Gallego\n      </p>\n                <p>\n        Telephone: (+34) 609.41.57.21 / (+34) 616.02.51.89\n      </p>\n                <p>\n                  <span>Email:</span>\n                  <span>\n                    <a href=\"mailto:comunicacion@diagroup.com\" data-type=\"email\" translate=\"no\">comunicacion@diagroup.com</a>\n                  </span>\n                </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://diacorporate.com/en/dia-and-amazon-extend-their-fast-grocery-delivery-service-to-pamplona/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>DIA - Distribuidora Internacional de Alimentación SA</strong> published this content on <strong>04 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>05 November 2021 11:20:29 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - DIA - Distribuidora Internacional de Alimentación SA</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: DIA---Distribuidora-Internacional-de-Alimentación-SA</p></div>"}