{"date": "2022-02-21 07:15:14+00:00", "ticker": "AVV", "mrkt_info": {"open": 2460.0, "close": 2474.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Dubai, UAE</strong><strong> </strong>– AVEVA, a global leader in industrial software, driving digital transformation and sustainability, brings its much-anticipated AVEVA PI World conference to the Amsterdam RAI convention center in the Netherlands on May 16-19, 2022. With insights from The Wellcome Institute’s Dr Catherine Green affiliated to Oxford University and companies including Kellogg’s, Cognizant and Microsoft, the in-person event will serve as a hands-on masterclass of how industry leaders are sharing data and AI-infused insights to spark innovation and set new standards of agility and resilience at a time of rapid change.</p>\n<p>At AVEVA PI World, customers will also see first-hand how AVEVA’s solutions can bridge the innovation gap by converting data into actionable insights that drive competitive advantages.</p>\n<p><strong>AVEVA CEO Peter Herweck</strong> said, “We are excited to meet our customers and partners in person at this year’s AVEVA PI World. We look forward to sharing how our expanded portfolio, including the integration of the industry leading PI System, can fuel data-centric growth in the age of performance.</p>\n<p>“Data has become the backbone of business operations over the pandemic. When anchored to human ingenuity, it enables the creation of new products and processes that deliver enhanced economic dividends. Sharing those innovations with other stakeholders in the connected industrial economy elevates achievements across the board, transforming economic growth and delivering sustainable value on every level,” he added.</p>\n<p><strong>Data-Led Innovation in Real Life</strong></p>\n<p>Delegates at AVEVA PI World 2022 will see how data inspires leading enterprises and thinkers to transform disruption into opportunity – and gain a close understanding of how human insight remains essential to unlocking data dividends and furthering automation gains.</p>\n<p>“Data has become central to industrial innovation and is now being collected in greater quantities than ever before. Yet, without human insight to direct and apply that information, the benefits of digital transformation remain limited,” said Michael Dean, Global Director – Power, Controls &amp; Information Systems, Kellogg’s. In a keynote at AVEVA PI World 2022, Dean will outline the role of human ingenuity in the data-driven organization of the future.</p>\n<p>Damien O’Connor, Chief Technology Officer, Cognizant – TQS, and an AVEVA PI World 2022 panelist, added: “Data has the capacity to drive innovation, realize sustainability goals and accelerate the fourth industrial revolution. By unifying data with human insight, companies like AVEVA and Cognizant are enabling industries to drive responsible use of resources and reshape the industrial landscape.”</p>\n<p>Dean and O’Connor are among a select group of thought leaders and business experts at AVEVA PI World 2022 that will share real-life examples of data-led innovation in action. Highlights from the schedule:</p>\n<ul class=\"bulleted-list arrowlist\">\n<li>Herweck’s keynote lays out the business case for data-led operations, using real-life examples to show how connected digital insights generate value for the entire ecosystem.</li>\n<li>Dr Catherine Green of the Wellcome Centre for Human Genetics at Oxford University will explain how data helped develop the Oxford vaccine, an inspiring paradigm for industries.</li>\n<li>Influencer Jahinki Bisselink, former United Nations Youth Representative, will explain the role of Gen Z in provoking digital thinking as it joins the industrial workforce.</li>\n<li>AVEVA’s Executive Vice President of Information Ronan de Hooge and Executive Vice President of Operations Rob McGreevy will share AVEVA’s solutions roadmap, and how the integration of the PI System into the AVEVA Data Hub accelerate values for customers.</li>\n<li>And Lisa Johnston, Chief Marketing Officer and Chief Sustainability Officer, AVEVA, will lead a panel on digital resilience strategies for success in the new normal. She will be joined by speakers from Microsoft and Cognizant.</li>\n</ul>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}