{"date": "2021-12-03 19:32:17.632000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3437.36, "close": 3427.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Developer-led security has earned a much-needed elevation due to a strategic partnership between Secure Code Warrior, an Australian-based start-up and Amazon Web Services, with enterprises now able to ensure enhanced cloud security and compliance.</p><p>Secure Code Warrior is now a part of the AWS Global Startup Program, in addition to being listed on the AWS Marketplace. This partnership is advantageous for both AWS and Secure Code Warrior's customers as it fulfils the need for security to be intrinsic to a developer's workflow and central to a company's culture--meeting the growing market demand and increasing requirements to stop application vulnerabilities from day one.Vikram Ghosh, Senior Vice President of Strategic Alliances at Secure Code Warrior, said the increased backing from AWS will support the business to accelerate its global growth, particularly across North America, and provide customers with the tools they need to be secure in the cloud as cybersecurity becomes critical to companies moving their entire operations to this platform.\"Customers of Secure Code Warrior now know that while AWS is ensuring the security of the cloud, we [SCW] ensure their security within the cloud, thanks to our human-led approach that embeds secure coding into the developer's DNA,\" said Ghosh.This partnership between AWS and Secure Code Warrior also means customers can easily access and use its software through the AWS Marketplace. To date, this software meets AWS' and Secure Code Warrior's shared values around developer-driven security by offering exceptional customer support, keeping aligned software consistently updated, following industry best practices, and facilitating quality, secure code at scale--which aligns with AWS' Shared Responsibility Model.Secure Code Warrior is one of a small number of Australian organizations that have been accepted into the coveted invite-only, Global Startup Program. Through this partnership, AWS came to understand Secure Code Warrior's vision for human-driven secure coding, which ensures organizations are able to release quality, compliant code to customers with confidence.Now available for purchase on the AWS Marketplace, Secure Code Warrior is granting customers the opportunity to scale in their respective markets by elevating code quality, empowering developers, and delivering secure software, faster.Ghosh added, \"We're excited by this evolution in Secure Code Warrior's partnership with AWS, which through its Global Startup Program has a proven track record of driving company visibility and powering growth at speed. Through this partnership, we see a great opportunity for Secure Code Warrior to continue achieving growth at scale, while working to ensure software security is intrinsic to both developer and customer.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}