{"date": "2022-01-10 14:40:48.344000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>GODADDY INC (\"GDDY-N\")\n- Spotlights Small Businesses Overcoming Obstacles in Renewed\n- 'Unstoppable' Campaign\n\n     GoDaddy Inc., the company that empowers everyday entrepreneurs,\nlaunched the second phase of its marketing campaign that highlights the\nunstoppable spirit of small business owners. The new campaign features\nthree new Canadian small business owners who have overcome obstacles in\ntheir competitive industries, and aims to inspire other entrepreneurs with\nthe tagline 'Don't Stop Being Unstoppable'.\n\n     Part two of the 'Don't Stop Being Unstoppable' campaign features\nCanada's fastest man and six-time Olympic medalist Andre De Grasse. Like\nprofessional athletes, small business owners have demonstrated dedication\nand perseverance through the many obstacles thrown their way - and many of\nthem are unfortunately bracing themselves through a new season of the\nCOVID-19 pandemic. With new public health measures and more lockdowns\nacross parts of the country, small businesses who have struggled to stay\nafloat over the last two years continue to be impacted. Their perseverance\ncomes with empowerment of online solutions whether through an online store,\nappointment bookings, marketing tools or simply the ability to communicate\nregularly with their customers.\n\n     \"This campaign is an empowering tribute to the small businesses that\nmake up our communities across Canada and the entrepreneurs that GoDaddy is\nhonoured to support across the country,\" said Anne De Aragon, Vice\nPresident and Country Manager of GoDaddy Canada. \"The move to digitization\nby small businesses has helped them stay active and connected with their\ncustomers during these challenging times. At GoDaddy we're proud to support\nCanadian small business owners and entrepreneurs by offering easy and\naffordable ecommerce solutions, along with customer care guidance to help\nthem continue to adapt and strengthen their presence online.\"\n\n     Meet More Unstoppable Small Business Owners\n\n     \"Early on in the pandemic, Canadians were a bit wary of going to the\ndentist, but as we focused our efforts on expanded safety measures, we were\nable to communicate these procedures to our patients on our GoDaddy site,\nassuring them that our office was safe,\" said Dr. Dev Vohra a dentist in\nBurlington, Ontario. \"Today, our operations function hand-in-hand with our\nGoDaddy website, which has improved efficiency for sharing information with\npatients, booking appointments and completing COVID-19 screening forms.\"\n\n     \"My business could not have survived the last two years without my\nGoDaddy website,\" said Jasmine Branderhorst, founder of Toronto-based\ndesign and home goods store The Underline. \"My website has kept the\nbusiness alive through everchanging public health measures and a major\nshift in shopping habits across the country. Online shopping has never been\nmore important and I'm grateful that GoDaddy has helped to make my\necommerce website so easy to build and operate, serving customers here in\nthe Toronto area and across Canada.\"\n\n     \"Canadians have never stopped craving pizza and it's been an honour to\nfeed our communities in Brampton, North York and Etobicoke over the last\ntwo years,\" said Harpreet Banwait of Pizza Hub. \"The pizza market got\npretty competitive during the pandemic, so having a website with\neasy-to-use tools and powerful SEO capabilities has been super important to\nkeeping us on page-one search results.\"\n\n     GoDaddy's suite of integrated products and services, including its\nWebsite Builder tool enables all comfort levels, helping Canadian\nentrepreneurs and small business owners reach their goals online. GoDaddy\nWebsite Builder offers a large selection of modern ready-to-go templates\nthat suit unique business needs and includes built-in digital marketing\ntools, such as search engine optimization, and marketing content creation\ntools to help businesses grow online. Businesses can now sell their\nproducts on marketplaces like Amazon and eBay with GoDaddy Online Store,\nmaking it easier for small business owners to expand their offerings and\nfind new customers to grow their business.\n\n     For Canadians interested in a more flexible advanced option, GoDaddy\nManaged WordPress is a streamlined, optimized hosting platform that helps\ncustomers build and manage a WordPress site, one of the world's most\npopular and user-friendly content management systems, with over 50,000\nplug-in features and 10,000 themes available to help create a unique\nwebsite for a business.\n\n     When Canadian small business owners and entrepreneurs need assistance\nalong the way, GoDaddy Guides are available 24/7 through free phone support\nto answer questions and offer guidance.\n\n     About Burlington Dentist\n\n     Dr. Dev Vohra is a dentist in Burlington, Ontario offering a\nbest-in-class patient experience. With more than 15 years of experience,\nDr. Dev ensures every appointment is comfortable, relieves any discomfort\nand keeps patients smiling. Learn more at BurlingtonDentist.co.\n\n     About The Underline\n\n     The Underline is a Toronto-based design and home goods business\nfounded by Jasmine Branderhorst. The brand delivers bespoke or\nready-to-enjoy pieces that bring comfort, beauty and joy into peoples'\nhomes. Learn more at TheUnderline.ca.\n\n     About Pizza Hub\n\n     Pizza Hub is a pizzeria created by Harpreet Banwait with Ontario\nlocations in Brampton, North York and Etobicoke. Offering personalized\ntaste and a variety of options, Pizza Hub pizzas are made with time-tested\nrecipes and pair well with delicious sides. Learn more at PizzaHub.ca.\n\n     About GoDaddy\n\n     GoDaddy is empowering everyday entrepreneurs around the world by\nproviding all of the help and tools to succeed online. GoDaddy is the place\npeople come to name their idea, build a professional website, attract\ncustomers, sell their products and services and manage their work. Our\nmission is to give our customers the tools, insights and the people to\ntransform their ideas and personal initiative into success. To learn more\nabout the company, visit GoDaddy.ca.\n\n     For more information, visit GoDaddy.ca and check out the full ad spot\nhere.\n\n     Connect with GoDaddy on Facebook, Twitter &amp; Instagram.\n\nContact Information:\n\nMeg Sharpley, meg.sharpley@northstrategic.com, 905-517-9390\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200900378.MNPRE2200901290-05393620220110</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}