{"date": "2021-01-21 13:22:46+00:00", "ticker": "AVV", "mrkt_info": {"open": 3770.0, "close": 3893.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>ENPNEWSWIRE-(C)2021 ENPUBLISHING</p><p>Release date- 20012021 - AVEVA World Digital Conference Convenes Industry leaders to Discuss Emerging Trends, Meeting Sustainability and Business Goals, and The Role of the Connected Workforce in Accelerating the Digital Journey.</p></div><div class=\"tr-npp-body\"><p>AVEVA, a global leader in engineering and industrial software, today announced its third AVEVA World Digital (AWD) conference, themed 'Accelerate Your Digital Intelligence' which will take place from 26-28 January 2021.</p><p>The online event will explore how leading companies are embracing innovation and applying intelligent software to reshape their industrial operations. It will demonstrate how emerging technologies such as AI, Cloud, Digital Twin, Visualization and data &amp; analytics are supporting advancements in sustainability, and enabling organizations to make significant changes to improve the environment.</p><p>Technology is playing a vital role in achieving real-time optimization, improving decision-making, and digitally enabling business operations, supported by an often-remote workforce to drive substantial cost reductions. Furthermore, with COVID-19 exposing pressures on the industrial sector, sustainable business strategies have come to the forefront with CTOs now seeing sustainability as part of the transformation imperative. As a result, organizations, are adopting real-time environmental monitoring to reduce the carbon emissions of heavy industries. Visualization, Digital Twin, Machine Learning and AI are technologies that are helping to manage these priorities.</p><p>As part of AWD's sustainability driven agenda:</p><p>Jean-Pascal Tricoire, Chairman &amp; CEO, Schneider Electric, will discuss how the quest for a more sustainable future is driving organizational innovation and opportunity in 2021</p><p>Lisa Johnston, CMO &amp; CSO, AVEVA, will focus on how forward-thinking organizations can accelerate their sustainability agendas</p><p>Jan Shumate, Director, Eastman Chemical Company, will discuss how digital transformation at Eastman Chemical Company is driving sustainable innovation</p><p>An Executive Sponsor Forum, led by Lisa Johnston, CMO &amp; CSO, hosted by Lisa Wee, Sustainability Director, AVEVA, will feature speakers from Microsoft, Accenture &amp; Verdantix focussing on 'Partnerships for a Sustainable Future.'</p><p>Craig Hayman CEO, AVEVA commented, 'Digitalization and sustainability are two sides of the same coin. AVEVA's industrial software solutions support sustainable outcomes by plumbing our broad and deep specialist capabilities into the scale and scope of the Cloud, enabling our customers to deliver diverse environmental benefits via optimized engineering, operations and performance. As more of our customers demand it, we are working with them to innovate to drive sustainability. A clear digital strategy drives environmental outcomes, social improvements, and ethical governance, which ultimately enhances culture and improves long-term business sustainability.'</p><p>The most Ambitious AWD Yet</p><p>With more than 50 training sessions as well as live networking, AWD attendees will receive in-depth insights into how to transform operations, level up digitalization, and stay competitive. An Interactive Virtual Expo will provide a forum for live chat with AVEVA experts through 10 strategic demo success stories across Asset Performance, Unified Engineering, Value Chain Optimization, AVEVA Connect, Edge to Enterprise Operations, industrial AI, the connected worker, and more.</p><p>Register for AVEVA World Digital today at: <a href=\"https://sw.aveva.com/aveva-world-digital\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://sw.aveva.com/aveva-world-digital</a></p><p>About AVEVA</p><p>AVEVA is a global leader in engineering and industrial software driving digital transformation across the entire asset and operations life cycle of capital-intensive industries. The company's engineering, planning and operations, asset performance, and monitoring and control solutions deliver proven results to over 16,000 customers across the globe. Its customers are supported by the largest industrial software ecosystem, including 4,200 partners and 5,700 certified developers. AVEVA is headquartered in Cambridge, UK, with over 4,400 employees at 80 locations in over 40 countries. For more details visit: www.aveva.com</p><p>Copyright 2020 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and products names are the trademarks of their respective companies.</p><p>Enquiries:</p><p>AVEVA Media Contacts</p><p>Rose Bambi</p><p>Senior Director Global PR and External Communications</p><p>Tel: +44 (0) 208 323 2789</p><p>rose.bambi@aveva.com</p><p>Caroline Stephens</p><p>Global External Communications PR Manager</p><p>caroline.stephens@aveva.com</p><p>Lena Ahad</p><p>Senior Director, Strategic Communications</p><p>FTI Consulting</p><p>Tel: +44 (0) 7790 366 997</p><p>lena.ahad@fticonsulting.com</p><p>[Editorial queries for this story should be sent to newswire@enpublishing.co.uk]</p><p>((Comments on this story may be sent to info@enpublishing.co.uk))</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 M2 Communications Ltd.</p></div>"}