{"date": "2021-12-09 16:11:11.682000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.16, "close": 3444.24}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>IPOWER INC (\"IPW-Q\")\n- Launches its First Nutrient Product Line \"Flourish\" on Amazon\n\n   iPower Inc. (\"iPower\" or the \"Company\"), one of the leading online\nhydroponic equipment suppliers and retailers in the United States, is\nannouncing the launch of its new \"Flourish\" line of advanced nutrient\nproducts, now available on Amazon (NASDAQ:AMZN). The initial line includes\nsix SKUs across both nutrient and fertilizer categories with products\nranging from cloning gels and plant supplements to plant and vegetable\nfertilizer, among others.\n\n   \"We are thrilled to launch our highly-anticipated nutrient product\nline,\" said iPower CEO Lawrence Tan. \"We expect this to be the first set of\nmany new SKUs that we introduce within the nutrient and fertilizer\ncategory. Nutrient and fertilizer sales represent approximately 20% of our\ntotal revenue and, until now, have only included third-party branded\nproducts. As such, the launch of our very own branded products presents a\nstrong opportunity for both revenue growth and margin expansion.\n\n   \"In addition to the financial benefit, we believe our Flourish suite of\nproducts will provide significant value to the home grower as our products\nare specifically designed for their needs, which are unique in comparison\nto the needs of commercial growers. We look forward to continue serving our\ncustomers with high-value hydroponic products at an affordable price.\"\n\n   The Company plans to ramp advertising on Amazon's marketplace in\naddition to mainstream social media platforms to promote brand awareness\nfor Flourish. iPower also anticipates offering the new Flourish line of\nproducts across other channel partners as well as its own captive site,\nZenyhdro.com.\n\n   About iPower Inc.\n\n   iPower Inc. is one of the leading online retailers and suppliers of\nhydroponics equipment and accessories in the United States. iPower offers\nthousands of stock keeping units from its in-house brands as well as\nhundreds of other brands through its website, www.zenhydro.com, and its\nonline platform partners. All orders are fulfilled from its two fulfillment\ncenters in Southern California. iPower has a diverse customer base that\nincludes both commercial businesses and individuals. For more information,\nplease visit iPower's website at <a href=\"https://ir.meetipower.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://ir.meetipower.com</a>/.\n\n   Forward-Looking Statements\n\n   All statements other than statements of historical fact in this\nannouncement are forward-looking statements. These forward-looking\nstatements involve known and unknown risks and uncertainties and are based\non current expectations and projections about future events and financial\ntrends that iPower believes may affect its financial condition, results of\noperations, business strategy and financial needs. Investors can identify\nthese forward-looking statements by words or phrases such as \"may,\" \"will,\"\n\"expect,\" \"anticipate,\" \"aim,\" \"estimate,\" \"intend,\" \"plan,\" \"believe,\"\n\"potential,\" \"continue,\" \"is/are likely to\" or other similar expressions.\niPower undertakes no obligation to update forward-looking statements to\nreflect subsequent occurring events or circumstances, or changes in its\nexpectations, except as may be required by law. Although iPower believes\nthat the expectations expressed in these forward-looking statements are\nreasonable, it cannot assure you that such expectations will turn out to be\ncorrect, and iPower cautions investors that actual results may differ\nmaterially from the anticipated results and encourages investors to review\nother factors that may affect its future results in iPower's registration\nstatement and in its other filings with the SEC.\n\nSean Mansouri, CFA\nElevate IR\n(949) 200-4603\nIPW@elevate-ir.com\n\nAsia Investor Relations Contact:\nSherry Zheng\nWeitian Group LLC\n(718) 213-7386\nshunyu.zheng@weitian-ir.com\n\nTel   : 626-863-7344    IPOWER INC\nWWW   : <a href=\"http://www.meetipower.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.meetipower.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134200411.MNPRE2134202007-07502420211209</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}