{"date": "2022-01-25 19:42:36.046000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon just released its Valentine's Day gift guide with the most popular Valentine's Day gifts of 2022 for her and for him, like Ugg slippers and jewelry.</p><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p></div><div class=\"tr-npp-body\"><p>Whether you're shopping for your significant other, your friends or your family, trying to find the perfect Valentine's Day gift to express just how much you love someone can be difficult. If you're looking for inspiration before February 14, Amazon just released its guide of the most-loved Valentine's Day gifts of 2022.</p><p>There are nearly 100 products on Amazon's carefully curated list, which is a lot to sift through. To save you time—and help you pick out the right present—our experts have rounded up 10 of the best Valentine's Day gifts worth buying from Amazon this year. Some of our top picks? Cozy Ugg slippers, a set of Olaplex haircare and the Sony noise-canceling headphones everyone loves.</p><p><span><span>Get deals and shopping advice delivered straight to your phone.</span> Sign up for text message alerts from the experts at Reviewed.</span> </p><p class=\"tr-npp-section-title\">1. Ugg Slippers</p><p>The coziest of cozy, Ugg slippers make a great gift for almost anyone and everyone. While there's a number of silhouettes to choose from, the OG Scuff and Scuffette slippers remain some of the most beloved styles among shoppers. Fans love how soft and warm the shearling interior is and that the slippers will last for years and years thanks to their high quality craftsmanship.    </p><ul class=\"bulleted-list arrowlist\"><li><span>Get the Ugg Women's Scuffette II Slipper from Amazon starting at $88.99</span> </li><li><span>Get the Ugg Men's Scuff Slipper from Amazon for $79.99</span> </li> </ul><p class=\"tr-npp-section-title\">2. Olaplex Shampoo and Conditioner</p><p>Give your loved one the gift of better hair days with Olaplex shampoo or conditioner (or both!). The haircare brand has thousands of fans, with many people especially obsessed with the Bond Maintenance line. It's designed to repair already damaged strands and prevent new breakage, along with moisturizing and hydrating your giftee's hair, leaving them with a shiny, bouncy mane.</p><ul class=\"bulleted-list arrowlist\"><li><span>Get the Olaplex No.4 Bond Maintenance Shampoo from Amazon for $28</span> </li><li><span>Get the Olaplex No.5 Bond Maintenance Conditioner from Amazon for $28</span> </li> </ul><p class=\"tr-npp-section-title\">3. Capri Blue Candle</p><p>No matter who you're shopping for, you can't go wrong with a nice candle. One of the most-recommended candles with nearly 9,000 glowing reviews on Amazon is the Capri Blue Volcano candle. With a burn time of up to 85 hours, the trendy candle's scent includes notes of citrus and tropical fruit. It comes in a recognizable jar that's pretty enough for your giftee to use well after the candle burns out.</p><p><span>Get the Capri Blue Candle from Amazon for $34</span> </p><p class=\"tr-npp-section-title\">4. Zimasilk Silk Pillowcase</p><p>Make your Valentine's everyday life a little more luxurious with a super soft silk pillowcase. According to beauty experts, sleeping on a silk pillowcase can help prevent wrinkles and hair damage—a win-win. This one from Amazon has more than 33,000 rave reviews for its slippery smooth texture and it's available in nearly 40 gorgeous colors and prints.</p><p><span>Get the Zimasilk Mulberry Silk Pillowcase from Amazon for $23.99</span> </p><p class=\"tr-npp-section-title\">5. Sony Noise-Canceling Headphones</p><p>Our experts at Reviewed have long been big fans of these Sony noise-canceling headphones. Available in black, silver and a deep navy blue, the plush overhead headphones are comfortable enough to wear for hours on end and have amazing sound quality. Even better? They have adjustable levels of noise-canceling technology, so your Valentine can choose how much of the outside world they do—or don't—hear.</p><p><span>Get the Sony WH-1000XM4 Wireless Noise-Canceling Overhead Headphones from Amazon for $348</span> </p><p class=\"tr-npp-section-title\">6. Kendra Scott Elisa Pendant Necklace</p><p>Jewelry is one of the most popular Valentine's Day gifts for a reason—it's romantic, thoughtful and, well, beautiful. More than 3,000 Amazon shoppers recommend the Elisa pendant necklace from trusted jewelry brand Kendra Scott. Available in 32 eye-catching designs and colors, the dainty necklace is adjustable, looks much more expensive than it is and comes in a pretty gift box that's ready to be handed to your loved one.</p><p><span>Get the Kendra Scott Elisa Pendant Necklace from Amazon for $68</span> </p><p class=\"tr-npp-section-title\">7. Sunday Riley C.E.O. Glow Face Oil</p><p>People who love skincare really love skincare. If your giftee falls into the above category—or if they're always lusting after the shiny bottles at Sephora—get them a bottle of Sunday Riley C.E.O. Glow. With more than 2,000 5-star reviews on Amazon, the face oil is praised for how well it moisturizes and brightens your skin. Made with golden turmeric, ginger, raspberry, Vitamin C and primrose, it works on even the most sensitive of skin.</p><p><span>Get the Sunday Riley C.E.O. Glow Vitamin C &amp; Turmeric Face Oil from Amazon for $40</span> </p><p class=\"tr-npp-section-title\">8. Citizen Watch</p><p>In case you haven't heard, \"old-school\" watches are one of the biggest trends of 2022, according to Pinterest. While there are plenty of brands and styles to shop, Amazon's pick is this unisex watch from Citizen, which is one of the most trusted (and most popular) watch brands. It looks cool and it's water-resistant, but the most impressive feature is that it's powered by any type of light, so your giftee will never have to change or charge a battery again.</p><p><span>Get the Citizen Eco-Drive GarrisonQuartz Unisex Watch from Amazon for $168.75</span> </p><p class=\"tr-npp-section-title\">9. Le Creuset Dutch Oven</p><p>Right up there with the KitchenAid stand mixer, the Le Creuset Dutch oven is a top player in the luxury kitchen product world. One of our experts' favorite Dutch ovens, the cast iron pan is very versatile—your giftee can use it for everything from searing meat to simmering stew—and consistently performs well time after time. It comes in eight pretty colors on Amazon, including cherry red and Caribbean blue. </p><p><span>Get the Le Creuset Enameled Cast Iron Signature Round Dutch Oven, 5.5-Qt. from Amazon starting at $359.95</span> </p><p class=\"tr-npp-section-title\">10. Jade Face Roller and Gua Sha</p><p>If your giftee is into self-care—or could use a little more of it in their lives—they'll love this jade face roller and gua sha set, which has more than 34,000 positive reviews on Amazon. People rave that both pieces can do everything from relieve puffiness and tension to reduce wrinkles to wake up and energize your skin. Even more appropriate for the season? The gua sha is in the shape of a heart.</p><p><span>Get the Jade Face Roller and Gua Sha from Amazon for $16.99</span> </p><p class=\"tr-npp-section-title\">Shop the most-loved Valentine's Day gifts at Amazon</p><p><span><span>There's a lot more where this came from.</span> Sign up for our twice-weekly newsletter to get all our reviews, expert advice, deals and more.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Amazon just announced the most popular Valentine's Day gifts—here's what to buy</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}