{"date": "2021-02-01 20:23:36.190000+00:00", "ticker": "AAF", "mrkt_info": {"open": 82.3, "close": 83.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_rx79spi7&amp;referenceId=tag:reuters.com,2021:newsml_OVDXTJ3AR_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_rx79spi7&amp;referenceId=tag:reuters.com,2021:newsml_OVDXTJ3AR_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: The chief executive of Airtel Africa says the telecoms company is focusing on growth in its existing markets and will not bid for licenses in Ethiopia, where the sector is being opened up. Julian Satterthwaite reports.<br/>Short Link: <a href=\"https://refini.tv/3tasZnH\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3tasZnH</a><br/><br/>Video Transcript:<br/><br/>While some of Africa's telecoms chief executives are planning a foray into Ethiopia - one of the continent's last closed telecoms markets - Raghunath Mandava is not one of them.<br/><br/>The CEO of Airtel Africa says they'll be focusing on countries where they already operate.<br/><br/>We have a lower market share in Nigeria, Congo, DRC, Tanzania and Kenya and our entire current focus is on these countries in order to grow, we are not looking at bidding for Ethiopia at this stage.<br/><br/>Ethiopia, Africa's second most populous nation, plans to sell a minority stake in state-owned Ethio Telecoms within nine months and is tendering for two new licenses.<br/><br/>On Monday, Ethiopia's telecoms regulator said it was extending the period to bid for the license by another month, citing requests by interested companies.<br/><br/>But Mandava said Airtel Africa sees more room to grow in the 14 countries where it's already invested.<br/><br/>I think we all need to work towards reducing this interconnect costs in some countries, which are high like Kenya. Ensuring the people will talk more.<br/><br/>He said the big focus for the company was Kenya and Tanzania where they are rolling out, quote, \"huge networks\".<br/><br/>In Kenya, a merger between Airtel's local subsidiary and Telkom fell through last year but Mandava said Airtel was now going at it alone in its efforts to take on market leader Safaricom.<br/><br/>As you know, we are consistently gaining market share over the last few years, and we are growing quite handsomely in Kenya.<br/><br/>On Friday, Airtel Africa reported an increase in nine-month revenue by 13.8% to $2.87 billion.<br/><br/>Though it also saw a slight decline in pretax profits to $482 million for the period to the end of December.<br/></span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}