{"date": "2022-01-24 20:46:43+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Jan 24 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> on Monday reported injury figures for 2020 showing worse-than-average safety rates in its U.S. warehouses but a better record than peers in delivery.</p><p>The online retailer also said staff injuries and illnesses globally that resulted in time away from work dropped by 43% in 2020, to 2.3 per 100 employees from 4.0 the prior year. Amazon has not reported worldwide incident figures before.</p><p>The disclosures follow growing public scrutiny of the Seattle-based company's labor practices.</p><p>Reports in recent years by <a href=\"https://revealnews.org/article/behind-the-smiles\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Reveal</a> from the Center for Investigative Reporting and the <a href=\"https://www.washingtonpost.com/technology/2021/06/01/amazon-osha-injury-rate\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Washington Post</a> found serious injury rates at many Amazon facilities to be around double industry standards. Legislation has targeted employers like Amazon around the use of productivity quotas, and a U.S. Labor Department office recently began auditing how the government has responded to rising warehouse injuries in the pandemic.</p><p>Amazon invested $300 million in safety improvements last year, it said.</p><p>In the company's new safety report, Amazon said there were 6.4 injuries at its U.S. warehouses for every 200,000 working hours in 2020. According to government figures, the industry average was 5.5, the report said.</p><p>For Amazon's U.S. transportation and logistics arm, which includes workers at Amazon's delivery depots and air hubs, the company's injury rate was 7.6. That was better than the industry average of 9.1, the report said. (Amazon <a href=\"https://www.propublica.org/article/inside-documents-show-how-amazon-chose-speed-over-safety-in-building-its-delivery-network\" data-type=\"url\" class=\"tr-link\" translate=\"no\">has faced scrutiny</a> for deadly incidents involving its contracted delivery firms, not part of its tally.)</p><p>Amazon's report highlighted, among other safety initiatives, technology it developed with partners so forklifts can avoid collisions by discerning their distance from people and structures.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting By Jeffrey Dastin in Palo Alto, Calif.; Editing by Nick Zieminski)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Jeffrey.Dastin@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Jeffrey.Dastin@thomsonreuters.com</a> ; +1 424 434 7548; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-INJURIES/ (PIX)</p></div>"}