{"date": "2021-11-04 13:50:34.744000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>There hasn't been an update to the Kindle paperwhite since 2018, and if you've used one before you'll understand why.</p><p>The existing Kindle is as near to a perfect <a href=\"https://www.independent.co.uk/extras/indybest/gadgets-tech/best-ereader-ebook-reader-amazon-kindle-kobo-a9377031.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">ereader</a> as you can get, and so Amazon has sensibly adopted an \"if it ain't broke\" attitude to refreshing its market-leading device. Hardware updates have been iterative rather than transformative, tinkering around the edges of a purpose-built gadget that's already incredibly good at what it's been designed to do.</p></div><div class=\"tr-npp-body\"><p>The most recent version of the mid-range <a href=\"https://www.independent.co.uk/extras/indybest/gadgets-tech/amazon-kindle-paperwhite-10-gen-review-b1937756.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Kindle paperwhite</a> introduced waterproofing, for anxiety-free reading by the pool. Meanwhile the high-end Kindle oasis accumulated nice-to-have features such as optional mobile data for downloading books when you're out of range of wi-fi.</p><p>Now, Amazon has treated its best-selling Kindle to a proper makeover. The 2021 version of the Kindle paperwhite features a larger 6.8in screen, smaller bezels, an adjustable warm light, increased LED backlighting for more even illumination, and USB-C charging. Smart features such as audiobook integration through Amazon-owned Audible are left untouched.</p><p><span>Read more:</span> </p><ul class=\"bulleted-list arrowlist\"><li><a href=\"https://www.independent.co.uk/extras/indybest/gadgets-tech/headphones-earphones/best-wireless-earbuds-earphones-headphones-true-noise-cancelling-running-working-out-mic-b422237.html\"><span>10 best wireless earbuds for 2021</span> </a> </li><li><a href=\"https://www.independent.co.uk/extras/indybest/gadgets-tech/headphones-earphones/best-gaming-headsets-wireless-bluetooth-microphone-ps4-xbox-pc-headphones-a9664276.html\"><span>8 best gaming headsets: Enhanced audio for PS5, Xbox, and more</span> </a> </li><li><a href=\"https://indy-web-prod.brightsites.co.uk/extras/indybest/gadgets-tech/laptops-tablets/best-laptop-uk-laptops-b1883320.html\"><span>Best laptops 2021: Top-rated devices for working from home</span> </a> </li><li><a href=\"https://www.independent.co.uk/extras/indybest/gadgets-tech/audio/best-bluetooth-speaker-portable-uk-b1775584.html\"><span>12 best Bluetooth speakers for every budget</span> </a> </li><li><a href=\"https://www.independent.co.uk/extras/indybest/gadgets-tech/airpods-max-vs-airpods-pro-review-compare-b1816380.html\"><span>Apple AirPods max vs AirPods pro: Which should you buy?</span> </a> </li> </ul><p>It's available in a version that displays ads on the home screen for £129.99, and one without ads for £10 more. There's also the Kindle paperwhite signature edition for £179.99, which is the same as the standard version, with no ads, wireless charging, more storage, and a warm light that doesn't need to be toggled on and off.How we testedWe've been using the Kindle paperwhite since it launched, taking the device to bed for some late night reading sessions and outdoors to read in what little sunshine is available. The operating system is largely unchanged. So once we'd transferred our existing library of Kindle books by logging into our Amazon account – which is made simpler with the Kindle app for smartphones – the user experience was identical. An interface redesign is planned in a future update.Amazon Kindle paperwhite: £129.99, <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2Fdp%2FB08N3TCP2F%3Fascsubtag%3DIN%7C1949017%7CB08N3TCP2F\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.co.uk</a></p><ul class=\"bulleted-list arrowlist\"><li><span>Dimensions:</span> 174mm x 125mm x 8.1mm</li><li><span>Resolution:</span> 300ppi</li><li><span>Storage:</span> 8GB</li><li><span>Screen size:</span> 6.8in</li><li><span>Front light:</span> 17 LEDs</li> </ul><p>The larger screen takes up more of the front of the device, but the all-new Kindle paperwhite is also considerably bigger overall than its predecessor. Crucially it can still be used one-handed and, because the touchscreen controls are designed sensibly, it can be used in either hand too. This makes the Kindle ideal for anyone who can't reliably get a seat on their morning commute and needs a free hand to brace themselves while reading.Despite expanding by almost a full inch, the matte e-ink display retains its crisp and paper-like 300ppi density, which looks and behaves like actual dead trees even in direct sunlight. By keeping the density as is, you can fit more text on each page without sacrificing pixel sharpness, which, over extended reading sessions, theoretically means less strain on your eyes and less page turning for your thumbs. In practice, it just feels nicer to have a screen that's closer to the size of an actual paperback, but still compact and light enough to feel comfortable in the hand. The previous Kindle paperwhite wasn't quite small enough for a pocket anyway, so the move to a larger form factor makes sense here. <span>Read more:</span><a href=\"https://www.independent.co.uk/extras/indybest/gadgets-tech/laptops-tablets/best-laptop-uk-laptops-b1883320.html\"><span>Best laptops 2021 – top-rated devices for WFH</span> </a> Also improved is the Kindle paperwhite's performance in the dark. The new model has 17 LEDs compared to the older model's five, producing a more even illumination across the entire page. There are no hotspots or distracting gradients – though if you were distracted in the past by uneven lighting across a page, we suggest you read something more engaging. The option to adjust the screen to be more blue or more amber also makes reading in bed more comfortable on the eyes.Battery life has always been enormous on the Kindle. The specialist e-ink screen doesn't require any power to display a static page of text, only drawing energy when it needs to refresh what's on the screen. The stated battery life of the all-new Kindle paperwhite is in the region of 10 weeks, which seems about right based on our testing, but it's all moot when the Kindle lasts this long. Unless you're planning a one-way trip into the desert, there's more than enough battery life here to last your entire holiday. The move to USB-C charging might seem like the most inconsequential update here, but it's easily the best upgrade of the lot. The previous model used micro-USB – an ancient type of connection from prehistoric times – which meant you had to carry around a special cable just for a gadget that only very rarely needed to charge. Now, when you inevitably realise your Kindle's run out of battery minutes before getting on an 11-hour flight, the same cable that charges your phone, tablet and laptop can juice up your Kindle too.The verdict: Amazon Kindle paperwhite (2021)The <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2Fdp%2FB08N3TCP2F%3Fascsubtag%3DIN%7C1949017%7CB08N3TCP2F\" data-type=\"url\" class=\"tr-link\" translate=\"no\">all-new Kindle paperwhite</a> is the best Kindle Amazon has made, narrowing the feature gap between the mid-range Kindle paperwhite and the high-end Kindle oasis enough that we can't recommend the most expensive Kindle over the newest one. The only feature we miss from the Kindle oasis are those physical page-turning buttons, which we'd love to see introduced to the paperwhite.The improvements don't rock the boat, but address some mild annoyances with the 2018 version. Chiefly, the long-awaited arrival of USB-C charging makes the new model feel like a modern device at last. The bigger screen is a quality of life improvement that's hard to excited about, but has a tangible, immediate benefit to readability.Should you rush out to upgrade your existing Kindle paperwhite today? Only if your old ereader is knackered. The improvements here iron out some kinks, but they're incremental changes and don't amount to anything that would entice us to upgrade from the 2018 version.Amazon Kindle paperwhite (2021) <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2Fdp%2FB08N3TCP2F%3Fascsubtag%3DIN%7C1949017%7CB08N3TCP2F\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Buy now</a> £129.99, Amazon.co.ukVoucher codesFor the latest discounts on ereaders and other tech offers, try the links below:</p><ul class=\"bulleted-list arrowlist\"><li><a href=\"https://www.independent.co.uk/vouchercodes/ao-com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AO discount codes</a> </li><li><a href=\"https://www.independent.co.uk/vouchercodes/very\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Very discount codes</a> </li><li><a href=\"https://www.independent.co.uk/vouchercodes/apple\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Apple discount codes</a> </li> </ul><p><span>Looking for more top-rated tech?</span><span>Check out our round-up of the</span><a href=\"https://www.independent.co.uk/extras/indybest/gadgets-tech/headphones-earphones/best-wireless-headphones-beats-bose-sony-apple-noise-cancelling-a9350946.html\"><span>best wireless headphones</span> </a><span>in 2021</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Independent, The (UK) (Online). All rights reserved.</p></div>"}