{"date": "2022-01-31 12:12:19.315000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Jan. 31 -- The Economic Survey 2022 has said that prices on government e-marketplace (GeM) were lower compared to e-commerce majors such as Flipkart and Amazon.</p><p>The economic survey has done a comparison of prices of various commodities on the GeM portal with those of company websites or other online platforms such as Amazon, Flipkart.</p></div><div class=\"tr-npp-body\"><p>For a close comparison, sample of same commodities as selected last year, is used to the extent possible. In cases where the exact commodity was not available, the newly available models were chosen.</p><p>While in the last year's analysis, GeM prices were on an average 3% lower when compared with other platforms, this time it is around 9.5% lower for the chosen sample.</p><p>10 out of 22 commodities in the sample were cheaper on the GeM portal as compared to other platforms, said the survey.</p><p>The economic survey noted that anecdotal evidence suggested that prior to GeM, government procurement prices were much higher than the prices prevailing in the market and there were constant complaints about inefficiency and rent seeking.</p><p>\"The use of the e-marketplace has resulted in a substantial reduction in prices in comparison to the rates used earlier, with average prices falling by at least 15-20%, up to 56%.\"</p><p>The government in 2016 had set up a dedicated e-market known as government e-Marketplace for purchase of certain standard day to day use goods.</p><p>The Economic Survey 2022-23 was tabled by Finance Minister Nirmala Sitharaman in Lok Sabha today, while the Budget will be presented tomorrow at 11 am.</p><p>The survey details the state of different sectors of the economy as well as reforms that should be undertaken to accelerate growth. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}