{"date": "2022-01-26 06:33:43.169000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_j1g8n5rg&amp;referenceId=tag:reuters.com,2022:newsml_OVFVVMKJV_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_j1g8n5rg&amp;referenceId=tag:reuters.com,2022:newsml_OVFVVMKJV_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: Microsoft on Tuesday forecast revenue for the current quarter broadly ahead of Wall Street targets, driven in part by its Intelligent Cloud unit.  Flora Bradley-Watson reports.<br/>Short Link: <a href=\"https://refini.tv/3H1SWfK\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3H1SWfK</a><br/><br/>Video Transcript:<br/><br/>Microsoft on Tuesday released an upbeat financial outlook for the first months of this year. The strong forecast is in part driven by the company's Intelligent Cloud unit, consisting of Azure and server software. Microsoft offered reassurances to investors that demand in its cloud business remained strong, anticipating revenue of up to $19 billion for its fiscal third quarter. Microsoft delivered strong outlooks in other areas, too. The software company has benefitted from the switch to working and learning from home. The health crisis has forced that shift online, with rivals Amazon and Alphabet also seeing a jump in demand for their services. Following Tuesday's outlook, shares in Microsoft were trading 3% above the closing price. All eyes will now be on Microsoft's proposed deal with games publisher Activision Blizzard. Last week, the company unveiled plans to buy the maker of 'Call of Duty' for $69 billion. Microsoft said the deal would help boost Xbox content and services revenue.<br/></span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}