{"date": "2021-11-09 07:07:50+00:00", "ticker": "III", "mrkt_info": {"open": 1378.0, "close": 1365.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><h4>\n      Results for the six months to 30 September 2021\n    </h4><h4>\n      A strong first half, driven by excellent performance from our resilient portfolio. On track to deliver increased FY22 dividend of 10.45 pence per share.\n    </h4><p><a href=\"https://www.3i-infrastructure.com/media/5505/3in-hy-results-2022_press-releasehighlights.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Download this press release</a><br/><a href=\"https://www.3i-infrastructure.com/media/5504/3in-hy-results-2022_press-release.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Download the full version of this press release</a></p><h4>\n      Performance highlights\n    </h4><div class=\"story-table-container\"><table class=\"story-basic-table\"><tbody><tr><td><p><span>£250m, 10.6%</span><br/>\n               Total return\n            </p><p><span>291.2p</span><br/>\n               NAV per share\n            </p></td><td><p>\n              Strong first half performance driving growth in net asset value ('NAV')\n            </p></td></tr><tr><td><p><span>£56m</span><br/>\n               Total income and non-income cash\n            </p></td><td><p>\n              Good level of income and non-income<br/>\n               cash to support the dividend\n            </p></td></tr><tr><td><p><span>£253m</span><br/>\n               Cash balances\n            </p></td><td><p>\n              Well-funded to make new investments\n            </p></td></tr><tr><td><p><span>5.225p</span><br/>\n               Interim dividend per share\n            </p></td><td><p>\n              On track to deliver the FY22 dividend<br/>\n               target, 6.6% higher than FY21\n            </p></td></tr></tbody></table></div><p><strong><br/>\n       Richard Laing, Chair of 3i Infrastructure plc</strong> (the 'Company')\n    </p><p>\n      \"It has been a strong first half performance from our resilient portfolio. We are well positioned for the second half and are on track to deliver our dividend target, 6.6% higher than last year.\"\n    </p><p><strong>Performance<br/></strong></p><p>\n      The Company generated a total return of 10.6% on opening NAV for the first half of the year, substantially ahead of our target return of 8% to 10% per annum to be achieved over the medium term. The NAV per share increased to 291.2 pence. The portfolio overall is performing ahead of expectations, both financially and operationally, with our Investment Manager driving value growth over the period through active asset management of the portfolio. We were pleased to complete the acquisition of DNS:NET, a leading independent telecommunications provider in Germany, during the period, further improving the diversification of the portfolio.\n    </p><p>\n      The Company delivered a Total Shareholder Return ('TSR') of 4.2% in the period (FTSE 250: 8.4%). Since IPO, the Company's annualised TSR is 12.4%, comparing favourably with the broader market (FTSE 250: 7.9% annualised over the same period). The Company has achieved this long-term outperformance with a low correlation to the broader equity market.\n    </p><p><strong>Interim dividend</strong></p><p>\n      The Board is announcing an interim dividend of 5.225 pence per share, scheduled to be paid on 10 January 2022 to holders of ordinary shares on the register on 26 November 2021. The ex-dividend date will be 25 November 2021. As an investment trust, the Company is permitted to designate dividends wholly or partly as interest distributions for UK tax purposes. The Board is designating 2.0 pence of the 5.225 pence interim dividend as an interest distribution.\n    </p><p><strong>Corporate governance</strong></p><p>\n      The Company's Annual General Meeting was held on 8 July 2021. All resolutions were approved by shareholders, including the re-election of the existing Directors to the Board. Robert Jennings stepped down from the Board on 16 July 2021 and we thank him for his contribution to the Company.\n    </p><p><strong>Richard Laing</strong><br/>\n       Chair\n    </p><p><strong>-Ends-</strong></p><h4>\n      For further information, please contact:\n    </h4><p>\n      Thomas Fodor, investor enquiries<br/>\n       Tel: 020 7975 3469\n    </p><p>\n      Kathryn van der Kroft, press enquiries<br/>\n       Tel: 020 7975 3021\n    </p><p><strong>Notes</strong></p><p>\n      This report contains Alternative Performance Measures ('APMs'), which are financial measures not defined in International Financial Reporting Standards ('IFRS'). These include Total return on opening NAV, NAV per share, Total income and non-income cash and Total portfolio return percentage. More information relating to APMs, including why we use them and the relevant definitions, can be found in the Financial review section and in the Company's Annual report and accounts 2021.\n    </p><p>\n      For further information regarding the announcement of the results for 3i Infrastructure plc, please visit <span><strong><a href=\"http://www.3i-infrastructure.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.3i-infrastructure.com</a></strong></span>. The analyst presentation will be made available on this website.\n    </p><p><strong>Notes to editors</strong></p><p><span>3i Infrastructure plc is a Jersey-incorporated, closed-ended investment company, an approved UK Investment Trust, listed on the London Stock Exchange and regulated by the Jersey Financial Services Commission. The Company's purpose is to invest responsibly in infrastructure, delivering long-term sustainable returns to shareholders and having a positive impact on our portfolio companies and their stakeholders.</span></p><p><span>3i Investments plc, a wholly-owned subsidiary of 3i Group plc, is authorised and regulated in the UK by the Financial Conduct Authority and acts as Investment Manager to 3i Infrastructure plc.</span></p><p><span>This statement has been prepared solely to provide information to shareholders. It should not be relied on by any other party or for any other purpose. It and the Company's Half-yearly report may contain statements about the future, including certain statements about the future outlook for 3i Infrastructure plc. These are not guarantees of future performance and will not be updated. Although we believe our expectations are based on reas</span><span>onable assumptions, any statements about the future outlook may be influenced by factors that could cause actual outcomes and results to be materially different.</span></p><p><strong><span>This press release is not for distribution (directly or indirectly) in or to the United States, Canada, Australia or Japan and is not an offer of securities for sale in or into the United States, Canada, Australia or Japan or in any other jurisdiction. Securities may not be offered or sold in the United States absent registration under the U.S. Securities Act of 1933, as amended (the 'Securities Act'), or an exemption from registration under the Securities Act. Any public offering to be made in the Unite</span></strong><strong><span>d States will be made by means of a prospectus that may be obtained from the issuer or selling security holder and will contain detailed information about 3i Group plc, 3i Infrastructure plc, 3i India Infrastructure Fund and the Investment Manager, as applicable, as well as financial statements. No public offering in the United States is currently contemplated.</span></strong></p><div id=\"public_attachments\"><p><strong>Attachments</strong></p><ul class=\"bulleted-list arrowlist\"><li><a href=\"https://www.3i-infrastructure.com/newsroom/press-releases/2021/results-for-the-six-months-to-30-september-2021/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a></li></ul></div><div id=\"public_disclaimer\"><p><strong>Disclaimer</strong></p><p><strong>3i Infrastructure plc</strong> published this content on <strong>09 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>09 November 2021 07:07:50 UTC</strong></p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - 3i Infrastructure plc</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: 3i-Infrastructure-plc</p></div>"}