{"date": "2022-01-14 19:52:09.404000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3224.28, "close": 3178.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_8gqkwnux&amp;referenceId=1_8gqkwnux&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_8gqkwnux&amp;referenceId=1_8gqkwnux&amp;pageId=RefinitivNewscasts</a></pre>Source: Stocktube<br/><br/>Description: Logiq Inc. co-founder and chairman Brent Suen joined Proactive's Stephen Gunnion with news of changes to the company's senior management team, which sees him also resume the position of CEO. &amp;#xD;&amp;#xD;Suen telling Proactive that the changes position the company to better execute on its strategic goals focused on customer acquisition and opportunistic mergers and acquisitions. And he says the company also currently fulfils all the criteria for a Nasdaq uplisting.<br/>Short Link: <a href=\"https://refini.tv/3ns5CEO\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3ns5CEO</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; You're watching Proactive. Joining me is Brent Suen. He's the co-founder, chairman, and also CEO of Logiq. Brent, it's good to speak with you today. &gt;&gt; Same here, Stephen. &gt;&gt; Brent, you've announced to restructure of the management team, including your appointment as CEO. Take us through the changes and also the rationale. &gt;&gt; Certainly. As a backdrop, I co-founded the company back in late 2014. The way we started out was with a single product, which is a mobile app for small businesses. We operated that business for a number of years and then in 2019, realizing that we were listed in North America on the US market and as the viewers know, we're also listed on the NERO exchange, we did not have a significant North American presence. We took a look around at the industry and we thought, what is a natural evolution of our business and how can we reach a little deeper into the North American market? The conclusion was big data. Big data is a very significant theme that underlies e-commerce, retail sales, pretty much everything nowadays. The first foray into that was the acquisition of Push Interactive, which closed in January of 2020. With that acquisition, we brought over a Chief Technology Officer, Tom Furukawa. Tom, as most read his bio will see, he is a veteran in the AdTech and data industry. He started at IBM, worked at Yahoo and ran their AdTech division. He's worked at Live Ramp, and Magnite. He has a very significant background and experience based in AdTech and data. I asked Tom in January of 2020. I said what do you believe would be the best path forward to reach deeper into the AdTech space? If you believe that this is sound, would you be interested in architecting it and then leading us through that? We we had Tom join us as CEO, middle of 2020. The architect had a plan. We made an acquisition of Fixel AI in the fall of 2020. We made a second acquisition, Rebel AI, in March of 2021. Then Tom set out to integrate Push, Fixel, and Rebel, which was completed a few months ago. Along the way, he also brought in one of his former colleagues, Steve Hartman. Essentially, Tom and Steve led the architecting, the integration and when finished, they were ready for our team that had been running each of those separate business units to roll up our sleeves and take it forward. They came on for a specific purpose, they completed it, and they've gone off to do other things and our management team, as indicated in press release, will take it forward. I'm no stranger to the business as I co-founded it. Our Chief Operating Officer, John, is also a skilled operator. We've got our work cut out for us, but Tom and Steve certainly made it easy. &gt;&gt; The structure of the company looks a bit different going forward as well. You're busy spinning off app Logiq. The shape of the business looks different, doesn't it? &gt;&gt; It certainly does. In order to simplify it even further, we will be known as Logiq and instead of having data Logiq underneath and then the other various business units below that, it will be simply Logiq and then we will have solutions categories from which to choose from. That is primarily data on the top level. With that is AdTech, MarTech. Advertising technology, marketing technology, and lead generation. Everything within that helps companies both online and offline sell more products. We believe that a simpler story will be easier for investors to grasp and understand what we're doing, which is extremely exciting. We also reported that Q4 was a record both on the revenue side and on the margin side. Looking forward for this year, we're starting to become a little more verbal about expectations on revenue guidance and we're talking about numbers exceeding 50 million in revenue with a continuing trend on gross margins up into the 40 percent level. We've also been talking about mergers and acquisitions, which our shareholders and viewers will certainly see some things in the very near future that they can get their arms around and say, I get where this company is going. &gt;&gt; Brent, how does the new platform position you for those opportunistic M&amp;As? &gt;&gt; We're positioned very well. Because if you look at our core business of Logiq now, Push represents lead generation. What is that in simple terms? It's helping customers, which are businesses that are selling things; products and services, find those customers. The lead is a person's name and information about them. The way that we enrich that is we find names of people who have expressed an interest in or have purchased certain products or services in the past. Demographic information that is beneficial to the company that would like to sell them something. Then we sell those leads to the customer. The customer in our case would be insurance companies, companies that do home improvement, companies that are looking for students to go to trade schools or colleges. A number of other verticals where those customers are looking for in customers themselves who have a willingness to purchase and in-purchase now or in the very near future. The second level, which is an area called AdTech or advertising technology has experienced a significant boom this past, call it two to five years with leaders such as Trade Desk, Palin Tier, Datadog. These are companies with 20 to $50 billion market caps. But you look at what e-commerce has done and the spend on advertising, which has generated the huge revenue growth and huge gross margin profile for those companies, the Rebel acquisition puts us firmly in that sphere. However, we're not going after the Amazon to the eBay's of the world. We're focused around small businesses that need that technology to better sell and better purchase ads. Marketing technology or MarTech is helping develop campaigns for customers that use either the lead generation or the AdTech platform. What that does, that just encompasses a suite of solutions to small businesses and medium-sized businesses to just sell better and better identify customers. On the acquisition side, we will be making acquisitions of companies that are a perfect fit and are also revenueing profitable. We'll also look at some tuck-in acquisitions of what we call future proofing; things that ensure that our products and services stay relevant. A lot of what investors see out there are a lot of buzzwords, things like Blockchain and NFT and influence your platforms. Those are themselves, those are highlights. They are buzzwords that people will latch onto and say, I'd love to invest in a company that does that. I think it's important for us to focus around that, work from the perspective of how do these things fit into our underlying business? Rather than trying to be a hot topic, we look at these and say, what elements of NFTs or blockchain or cryptography fit into our business model in a less hot, if you will, but a lot more tangible. We expect to be talking a lot about acquisitions that fit into that and investors can say, I get it. It's not just a buzzword, Logiq is really doing something with those underlying themes. &gt;&gt; Well, I hope you'll keep us posted as those acquisitions come through. You mentioned your fourth quarter revenue guidance, and we'll be getting more news on that soon, what other news flow should investors be looking up for, Brent? &gt;&gt; Without giving away too much, I think our shareholders are certainly people who watch us. I've been eager to hear about a NASDAQ uprising. I can say that we currently fulfill all the criteria on a quantitative basis. Currently with our share price at two, we also qualify on a share price in market cap basis. I'd also point out that we've been talking a lot about mergers and acquisitions. I think the next step that investors should be looking for would be binding letters of intent, driving towards a definitive acquisition agreement. Those two things I believe are certainly on the forefront. &gt;&gt; Well, I'm sure I will be chatting with you soon, but thanks very much for speaking with us today, Brent. &gt;&gt; Thank you, Stephen. &gt;&gt; That's Brent Suen. He's the co-founder, chairman, and CEO of Logiq.<br/></span></div></div></div></div>"}