{"date": "2021-08-17 14:14:27+00:00", "ticker": "AVV", "mrkt_info": {"open": 4036.0, "close": 4053.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <h4>\n        Schneider Electric and AVEVA Unify Vale Mining Operations to Improve Safety and Sustainability\n      </h4>\n                <div>\n                  <p>\n                    <span>Rueil-Malmaison, France</span>\n                  </p>\n                  <p>\n                    <span>17/08/2021</span>\n                  </p>\n                </div>\n                <div>\n                  <a href=\"https://www.se.com/ww/en/about-us/newsroom/keyword/details/press-release-5d80c7d91416ef11790cc664\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Press Release</a>\n                  <a href=\"https://www.se.com/ww/en/about-us/newsroom/keyword/details/sustainable-mining-60efc8401601707f9d2ccfbc\" data-type=\"url\" class=\"tr-link\" translate=\"no\">sustainable mining</a>\n                  <a href=\"https://www.se.com/ww/en/about-us/newsroom/keyword/details/industries-of-the-future-60efc8401601707f9d2ccfba\" data-type=\"url\" class=\"tr-link\" translate=\"no\">industries of the future</a>\n                </div>\n              </div>\n              <a href=\"https://www.wiztopic.com/download-pdf/611b4ff4c83c882c9813ebce\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Download PDF</a>\n              <div>\n                <div>\n                  <ul class=\"bulleted-list arrowlist\">\n                    <li>\n                      <span>Partners integrate operations across 15 distinct sites, at two major complexes</span>\n                    </li>\n                    <li>\n                      <span>Operational safety, sustainability and efficiency all increased</span>\n                    </li>\n                  </ul>\n                </div>\n                <div>\n                  <p>\n                    <a href=\"https://www.se.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Schneider Electric</a>, the leader in the digital transformation of energy management and automation, and <a href=\"https://www.aveva.com/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AVEVA</a>, a global leader in industrial software, driving digital transformation and sustainability, are powering the unification of operations for <a href=\"http://www.vale.com/en/pages/default.aspx\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Vale</a>, a global natural resources and mining company.\n        </p>\n                  <p>\n          The combination of AVEVA and Schneider Electric software, technology and mining domain expertise is providing Vale with the ability to integrate, centralize, and remotely monitor operations across its Mariana and Itabira complexes in Brazil.\n        </p>\n                  <p>\n          Vale ranks among the top five largest mining companies in the world. Headquartered in Rio de Janeiro, the world's leading producer of iron ore, pellets and nickel employs a global workforce of over 170,000 people in 38 countries. The Mariana Complex and Itabira Complex are two of Vale's major iron ore production sites, located in Minas Gerais, Brazil. Together, the complexes are responsible for more than 75% of the production data from Vale's Minas Gerais mining operations.\n        </p>\n                  <p>\n          While primarily implemented to improve safety through remote operations, digitalization is critically important to driving efficiency and sustainability in mining. Through the partnership, Vale can unify operations across multiple sites and upgrade its old system to one capable of remotely controlling all the diverse technologies operating across each mining facility. Crucially, the remote management solution enables Vale to have fewer professionals onsite, increasing safety and reducing operational expenditures while also vastly improving energy efficiency, and therefore, sustainability.\n        </p>\n                  <p>\n          Vale chose Schneider Electric and AVEVA for the technological performance and visibility offered by their solutions. These provide an extremely high level of flexibility due to their vendor-agnostic nature, making it easy to integrate disparate technologies across multiple sites.\n        </p>\n                  <p>\n                    <span>'We are constantly looking to improve safety, efficiency and sustainability, not just now but also for the future,'</span> said Paulo Henrique Fontes Coura, Senior Automation Leader, Vale. <span>'Schneider Electric and AVEVA have become an integral part of that journey. Rather than simply offering the software, they provided a complete, bespoke end-to-end service helping us optimize at every turn. This included training, support, and advice throughout.'</span></p>\n                  <p>\n                    <span>'The collaboration between our companies has created something much greater than the sum of its parts,'</span> said Gilberto da Cunha Vieira, Electrical and Automation Engineer Leader, Vale. <span>'We are enormously grateful to Schneider Electric and AVEVA for bringing our facilities together.'</span></p>\n                  <p>\n          Schneider Electric deployed <a href=\"https://shop.exchange.se.com/en-US/apps/67767/ecostruxure-control-expert---asset-link\" data-type=\"url\" class=\"tr-link\" translate=\"no\">EcoStruxure™ Control Expert - Asset Link</a>, combining <a href=\"https://www.aveva.com/en/products/system-platform/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AVEVA™ System Platform</a><span>and Schneider</span><a href=\"https://www.se.com/ww/en/product-range/62098-modicon-m580/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Modicon M580</a><span>,</span> to provide visibility and unify operations for Vale. The technology enables data to be integrated directly into the system, so Vale's managers have granular insights without having to manually transfer any intelligence. By bringing this data together, Vale can now create a master operations center and remotely manage everything. This greatly improves operational efficiency and means less people are onsite, providing a significant boost to safety.\n        </p>\n                  <p>\n          Other results include:\n        </p>\n                  <ul class=\"bulleted-list arrowlist\">\n                    <li>\n            Cost savings with faster data to make decisions\n          </li>\n                    <li>\n            Full visibility and compatibility for all plants, providing a single holistic view\n          </li>\n                    <li>\n            Better coordination in operations, and increased efficiency and productivity by unifying multiple disciplines at the same place\n          </li>\n                    <li>\n            Complete standardization through one platform, with multiple device manufacturers\n          </li>\n                    <li>\n            Greater sustainability through resource optimization\n          </li>\n                  </ul>\n                  <p>\n                    <span>'In today's world, information is imperative,' said Rob Moffitt, President - Mining, Minerals and Metals, Schneider Electric. 'It drives safety, sustainability, and profitability for those able to use it successfully. Iron production is essential to all our lives, providing steel for the automotive and construction industries around the world. It is vital that a sector upon which we rely can run efficiently, safely and sustainably. The system we have created for Vale alongside AVEVA is vital to this process. We look forward to seeing Vale unlock its potential to understand, manage and enhance its operations across Brazil.'</span>\n                  </p>\n                  <p>\n                    <span>'</span>\n                    <span>Mining operations are data-rich environments where digital transformation can drive sustainability and productivity gains for improved asset utilization and enhanced value optimizat<span>ion,' commented Marc Ramsay, Vice President, Global Strategic Partners, AVEVA.</span> 'Together with Schneider Electric EcoStruxure, AVEVA System Platform supports Vale in realizing the mines of the future through contextualized operations built on a collaborative, standards-based foundation that unifies people, processes, and assets across all of Vale's facilities for continuous operational improvement and real-time decision assistance.'</span>\n                  </p>\n                </div>\n              </div>\n              <div>\n                <a href=\"https://www.wiztopic.com/download-pdf/611b4ff4c83c882c9813ebce\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Download PDF</a>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.se.com/ww/en/about-us/newsroom/news/press-releases/schneider-electric-and-aveva-unify-vale-mining-operations-to-improve-safety-and-sustainability-611b4e0bdebda6437f2337c8\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Schneider Electric SE</strong> published this content on <strong>17 August 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>17 August 2021 14:14:27 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Schneider Electric SE</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Schneider-Electric-SE</p></div>"}