{"date": "2022-01-18 23:32:00.826000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The family of a delivery driver killed in December when a tornado ripped through an Amazon distribution center in central Illinois has sued the retail giant, saying in a wrongful-death lawsuit that it should have done more to keep workers safe.</p><p>The parents of Austin McEwen filed a lawsuit in Madison County, Ill., on Monday, saying Amazon's decisions contributed to the 26-year-old man's death on Dec. 10, 2021. Among them was the decision to call employees and contractors such as McEwen to work during the holiday rush despite more than 24 hours of severe-weather warnings for the area. McEwen was among six people killed at the facility Dec. 10. (Amazon co-founder Jeff Bezos owns The Washington Post.)</p></div><div class=\"tr-npp-body\"><p>\"Sadly, it appears that Amazon placed profits first during this holiday season instead of the safety of our son and the other five,\" Alice McEwen, Austin's mother, said during a Monday news conference.</p><p>The McEwen's lawsuit says that Amazon \"carelessly\" required their son and others to continue to work even as the tornado approached, and that there was no proper tornado shelter or alarm at the 1.1-million-square-foot facility. The Washington Post previously reported that Amazon confirmed the lack of loudspeaker system; in the moments before the tornado hit, managers went through the building with megaphones, ordering people to take shelter.</p><p>The suit alleges negligence by Amazon and the companies that built the Edwardsville, Ill., warehouse.</p><p>A spokesperson for Amazon disputed those characterizations, saying in a statement that the lawsuit \"misunderstands key facts, such as the difference between various types of severe weather and tornado alerts, as well as the condition and safety of the building.\"</p><p>\"The local teams were following the weather conditions closely,\" Amazon spokesperson Kelly Nantel said. \"Severe weather watches are common in this part of the country and, while precautions are taken, are not cause for most businesses to close down. We believe our team did the right thing as soon as a warning was issued, and they worked to move people to safety as quickly as possible.\"</p><p>Nantel added that the warehouse was less than four years old and complied with building codes.</p><p>Attorney Jack J. Casciato of Clifford Law Offices, a Chicago-based personal injury firm, said he has heard from workers in warehouses near the Edwardsville Amazon facility who were sent home based on the severe-weather warnings.</p><p>\"Would it have been difficult to say, 'We don't know if a tornado is hitting the area, but it could, so we want people to go home and get out of the Edwardsville area?' \" Casciato said. \"And if packages get delivered a day late, they get delivered a day late. Someone's life is worth more than that.\"</p><p>At Monday's news conference, Alice and Randy McEwen lamented the future they said has been lost.</p><p>\"Austin was a wonderful son. He was only 26 years old,\" Alice McEwen said. \"We looked forward to seeing him get married, have children of his own and celebrate life's milestones in the years to come. This was all taken from us.\"</p><p>Alice McEwen added that her family and those of the five other deceased workers deserve answers, and that they can only hope to get them through a lawsuit.</p><p>The lawsuit seeks a judgment of more than $50,000 for each of four allegations of negligence, though Casciato said they anticipate the ultimate judgment to be in the \"millions.\"</p><p>The Occupational Safety and Health Administration is investigating the warehouse collapse and whether the building had violated safety codes. The warehouse did not have a basement because the area is prone to flooding; most of the 46 workers in the building during the collapse were gathered on the north side, where there were few windows.</p><p>McEwen and the five other people who died were on the south side of the building outside the shelter area \"because of the work they were doing at the time,\" Nantel said in December.</p><p>Labor advocates have criticized Amazon for what they say are unfair and unsafe working conditions, and the December collapse attracted scrutiny from members of Congress who have demanded answers about the company's safety practices.</p><p>Baby Hebb, stepmother of Etheria Hebb, who was killed in the collapse, wondered why such a large building appeared to have only one shelter area.</p><p>\"It was so many square feet. I mean, you should have more than one safety spot for all those workers,\" Baby Hebb told The Post in December.</p><p>The tornado that struck the Edwardsville Amazon facility was part of a powerful storm system that tore more than 250 miles through several states in December.</p><p>In Mayfield, Ky., eight people died after an EF-4 tornado struck a candle factory. The building collapse and resulting injuries and deaths prompted a similar round of workplace safety investigations at the Mayfield Consumer Products candle factory.</p><p>On Jan. 10, the plant manager announced that the company was permanently closing the Mayfield facility and laying off about 250 employees; the rest would be offered transfers to another plant 275 miles away.</p><p><span>Read more:</span> </p><p>East Coast storm leaves more than 100,000 without power, at least two dead</p><p>Cracker Barrel served a cleaning agent to a customer. A jury ordered it to pay $9.3 million.</p><p>Microsoft to buy Activision Blizzard — embattled publisher of Call of Duty, Warcraft — for $68.7 billion</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 The Washington Post</p></div>"}