{"date": "2021-12-01 04:48:04.691000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>AMAZON.COM INC (\"AMZN-Q\")\n- AWS Announces AWS IoT FleetWise\n\n    Today, at AWS re:Invent, Amazon Web Services, Inc. (AWS), an\nAmazon.com, Inc. company announced AWS IoT FleetWise, a new service that\nmakes it easier and more cost-effective for automakers to collect,\ntransform, and transfer vehicle data to the cloud in near-real time. With\nAWS IoT FleetWise, automakers can easily collect and organize data in any\nformat present in their vehicles (regardless of make, model, or options)\nand standardize the data format for easy data analysis in the cloud. AWS\nIoT FleetWise helps automakers efficiently transfer data to the cloud in\nnear-real time using the service's intelligent filtering capabilities that\nallow developers to reduce network traffic by selecting the data to\ntransfer and defining rules for when to transfer it based on parameters\nlike weather conditions, location, or vehicle type. Once the data is in the\ncloud, automakers can use it for applications that remotely diagnose issues\nin individual vehicles, analyze vehicle fleet health to help prevent\npotential recalls or safety issues, or improve advanced technologies like\nautonomous driving and advanced driver assistance systems with analytics\nand machine learning. There are no upfront commitments or fees to use AWS\nIoT FleetWise, and customers only pay for the underlying services used. To\nlearn more about AWS IoT FleetWise, visit aws.amazon.com/iot-fleetwise.\n\n    Automakers have been collecting data from standard vehicle sensors for\nover a decade to evaluate operational and safety indicators like engine\ntemperature and vehicle stability. However, automakers today are building\ncars with new classes of advanced sensors like radar and cameras that\nimprove vehicle safety but also generate exponentially increasing amounts\nof data. For example, advanced vehicle sensors can generate up to 2\nterabytes of data hourly per vehicle, making the cost of transferring this\ntype of data to the cloud prohibitive. Automakers want to collect,\nstandardize, and transfer this data to the cloud more cost-effectively, so\nthey can use it to generate insights that help improve vehicle quality,\nsafety, and autonomy. However, the ever-increasing variety of vehicle\nmakes, models, and options that generate data in different proprietary\nformats creates a complex array of data across the vehicles on the road.\nCollecting and transforming all of this vehicle data so that it can be\nanalyzed in the cloud requires automakers to build custom data collection\nsystems that standardize the data across the wide variety of data formats,\nwhich is difficult and time-consuming. Instead, automakers want to select\nthe data to collect and transfer to the cloud in near-real time based on\ntheir specific use case, but this type of intelligent data filtering\ndoesn't exist today. As a result, automakers are unable to put data to work\nto help solve common problems like diagnosing issues with individual\nvehicle performance, spotting fleet-wide issues before they become a\ngrowing problem, and using the data to improve vehicle performance and\nautonomy.\n\n    AWS IoT FleetWise provides automakers a managed service that makes it\neasier and more cost-effective to collect and transfer data from millions\nof vehicles to the cloud in near-real time. AWS IoT FleetWise can access\nthe unique data format of a vehicle and then structure and standardize the\ndata so automakers don't have to develop custom data collection systems.\nAutomakers start in the AWS Management Console by defining and modeling\nvehicle attributes (e.g. a two-door coupe) and the sensors associated with\nthe car's make, model, and options (e.g. engine temperature, front-impact\nwarning, parking assist system, etc.) for individual vehicle types or\nmultiple vehicle types across their entire fleet. After vehicle modeling,\nautomakers install the AWS IoT FleetWise application on the vehicle gateway\n(an in-vehicle communications hub that monitors and collects data), so it\ncan read, decode, and transmit information to and from AWS. With AWS IoT\nFleetWise's intelligent filtering controls, automakers can select the exact\ndata they need for their use cases and help reduce costs by limiting the\namount of data transferred to the cloud by creating conditional rules to\nfilter the data they want to collect and analyze (e.g. sensor data from\nhard-braking events associated with a vehicle make and model). Once data is\ntransferred to the cloud with AWS IoT FleetWise, automakers can use AWS's\nbreadth and depth of services to extract value from vehicle data. For\nexample, automakers can use intelligent filtering to collect camera data\nfrom vehicles traveling on newly built highways when an autonomous driving\nsystem identifies text in road signage with less than 90% confidence. When\nthat data is sent to the cloud, automakers can label the data for accuracy\nto improve the machine learning models powering autonomous driving systems.\nOr, automakers can use intelligent filtering to collect data from electric\nvehicle batteries when the temperature drops below freezing and then\nanalyze it and run simulations in the cloud to improve battery performance\nin cold weather.\n\n    \"While automakers have collected, stored, and analyzed vehicle data for\nyears, they are not equipped to manage the explosion of data generated by\nadvanced vehicle safety and autonomous driving systems, nor have they had\naccess to the near-real-time data needed to help proactively address\nvehicle problems,\" said Mike Tzamaloukas, General Manager of IoT Automotive\nat AWS. \"With AWS IoT FleetWise, automakers can now efficiently collect\nthis data, transform it, and gain deep, actionable insights on the\ncondition and usage of vehicles on the road. Automakers can now use the\npower of AWS to help maintain millions of vehicles, increase vehicle\nsafety, and improve customer service.\"\n\n    AWS IoT FleetWise is a new service that is part of AWS for Automotive,\na comprehensive offering of AWS services and AWS Partner Network (APN)\nsolutions used by automotive and mobility customers globally to help\nautomotive customers digitally transform their business for connected\nmobility, digital customer engagement, product design and engineering,\nmanufacturing, and supply chain. For more information on AWS for\nAutomotive, visit aws.com/automotive.\n\n    AWS IoT FleetWise with standard vehicle data collection is available in\npreview today in US East (N. Virginia) and Europe (Frankfurt), with\navailability in additional AWS Regions coming soon.\n\n    NXP Semiconductors is the leader in secure vehicle network processors,\nenabling secure connections for a smarter world. \"We are driving automotive\nindustry innovations, including our new S32G vehicle network processors for\nservice-oriented gateways,\" said Ray Cornyn, Vice President and General\nManager of Vehicle Control and Networking Solutions at NXP. \"The\ncollaboration with AWS on AWS IoT FleetWise is one that will enable smart\ndata collection from every corner of the vehicle. With AWS IoT FleetWise\nand NXP's automotive gateway solutions, OEMs will be able to leverage\ndeeper vehicle insights to improve vehicles over time and enable\ncompelling, new vehicle capabilities and business opportunities.\"\n\n    WirelessCar has a 20+ year history of developing, delivering, and\noperating secure digital solutions and products for connected cars. \"As our\nautomotive services and solutions have continued to grow and establish us\nas a leader in the connected vehicle industry, we continue to enjoy the\nscale, availability, and resilience of AWS services as a foundation of our\nsolutions,\" said Jessica Nymark, CTO at WirelessCar. \"With the arrival of\nAWS IoT FleetWise as an AWS for Automotive service, we look forward to a\nfurther expansion of our portfolio around efficient vehicle data collection\nand of our data ecosystem.\"\n\n    Otonomo is a mobility intelligence platform that fuels a network of\noriginal equipment manufacturers (OEMs), fleets, and over 100 service\nproviders, ranging from mobility as a service (MaaS), electric vehicles\n(EV), and transportation to insurance. The platform is powered daily by\nover 4 billion data points. \"At Otonomo, we're committed to driving smarter\ndecisions and services for our customers through the use of connected\nvehicle data and mobility intelligence,\" said Ben Volkow, CEO at Otonomo.\n\"Today's AWS IoT FleetWise announcement helps automakers collect and\ntransfer data to the cloud more easily and efficiently than ever before.\nWe're thrilled to continue to collaborate with AWS and are excited about\nthe additional capabilities made possible through AWS IoT FleetWise.\"\n\n    About Amazon Web Services\n\n    For over 15 years, Amazon Web Services has been the world's most\ncomprehensive and broadly adopted cloud offering. AWS has been continually\nexpanding its services to support virtually any cloud workload, and it now\nhas more than 200 fully featured services for compute, storage, databases,\nnetworking, analytics, machine learning and artificial intelligence (AI),\nInternet of Things (IoT), mobile, security, hybrid, virtual and augmented\nreality (VR and AR), media, and application development, deployment, and\nmanagement from 81 Availability Zones within 25 geographic regions, with\nannounced plans for 27 more Availability Zones and nine more AWS Regions in\nAustralia, Canada, India, Indonesia, Israel, New Zealand, Spain,\nSwitzerland, and the United Arab Emirates. Millions of customers--including\nthe fastest-growing startups, largest enterprises, and leading government\nagencies--trust AWS to power their infrastructure, become more agile, and\nlower costs. To learn more about AWS, visit aws.amazon.com.\n\n    About Amazon\n\n    Amazon is guided by four principles: customer obsession rather than\ncompetitor focus, passion for invention, commitment to operational\nexcellence, and long-term thinking. Amazon strives to be Earth's Most\nCustomer-Centric Company, Earth's Best Employer, and Earth's Safest Place\nto Work. Customer reviews, 1-Click shopping, personalized recommendations,\nPrime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career\nChoice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out\ntechnology, Amazon Studios, and The Climate Pledge are some of the things\npioneered by Amazon. For more information, visit amazon.com/about and\nfollow @AmazonNews.\n\n Contact Information:\n\nAmazon.com, Inc.\nMedia Hotline\nAmazon-pr@amazon.com\nwww.amazon.com/pr\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133300572.MNPRE2133302997-10485520211130</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}