{"date": "2021-12-19 10:45:11.746000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3400.35, "close": 3408.34}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>DEWA/Arabic services/Amazon's Alexa</p><p>DUBAI, 19th December, 2021 (WAM) -- Dubai Electricity and Water Authority (DEWA) has started providing its smart services on Amazon Alexa in Arabic, becoming the first government utility in the world to do this.</p></div><div class=\"tr-npp-body\"><p>Customers can now review their monthly bills in Arabic, check past statements, details of electricity and water consumption, their carbon footprint, as well as connect their DEWA account to other Amazon accounts. They can also benefit from Rammas, DEWA's virtual employee, which uses Artificial Intelligence (AI) on Amazon's Alexa devices in Arabic to answer their enquiries.</p><p>Moreover, customers can benefit from the Smart Living initiative, which enables them to make smart decisions to reduce their consumption proactively and digitally as well as solve problems and causes for increased consumption or waste on their own; without contacting DEWA.</p><p>Saeed Mohammed Al Tayer, MD &amp; CEO of DEWA, said, \"We are proud that DEWA is the first government utility in the world that provides its services in Arabic on Amazon Alexa. This reflects DEWA's continuous efforts to achieve the maximum benefit from AI and disruptive technologies to provide the best smart services to its customers. DEWA was the first government entity in the UAE to add Rammas to this innovative technology since 2017 to enable customers to enquire about their bills anytime. Moreover, DEWA enables its customers to complete their transactions anytime and anywhere easily and safely on its website and smart app as well as other smart and digital channels. This saves their time and efforts and enhances their happiness as well as contribution to protecting the environment, natural resources and reducing carbon emissions.\" Eric Saarnio, VP Devices &amp; Services, Amazon, said, \"We're very excited to see DEWA making their services available to its customers on Alexa, introducing an innovative and more sustainable way of engaging with government utilities. Just by using their voice, customers benefit from a broad range of innovative DEWA services that not only save time and resources but also provide inspiration to lead a more sustainable life.\"</p><p>© Copyright 2021 Emirates News Agency (WAM) Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SyndiGate. All Rights Reserved.</p></div>"}