{"date": "2022-01-21 01:29:30.106000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3125.98, "close": 2852.86}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>With the aim of prioritizing the eradication of corruption in the Amazon Region, a conviction was achieved for the defendants Enma Neylit Alberca Salazar and Rosanita Cruz Rubio, and the co-defendant Alver Alfredo Terrones Sepulveda, for the crime against the public administration, in the modality of aggravated collusion, to the detriment of the State - Regional Directorate of Transport and Communications of the Regional Government of Amazonas, obtained by Provincial Deputy Prosecutor Jorge Apaza Ancco of the Provincial Prosecutor's Office Specialized in Corruption Crimes of Officials of Amazonas based in Chachapoyas.</p><p>?In the development of the diligence, it was concluded that the defendants, for the contracting of the acquisition of a professional drone, violated the provisions of numeral 8.4.4 of Directive No. 0009-2016-AMAZONAS REGIONAL GOVERNMENT/GGR, in such a way that way that they transgressed their functional duties, with a clear purpose of directing the hiring in favor of their co-defendant.</p></div><div class=\"tr-npp-body\"><p>The officials intervened directly in favor of the supplier, who issued the invoice and delivered the good before being selected as a supplier and issuing the purchase order or signing the contract, their actions were limited to trying to regularize and give the appearance of legality, to a contracting procedure with the presumed concurrence of suitable bidders, for the acquisition of a good.</p><p>Which reveals the existence of a collusive agreement between the defendants Enma Neylit Alberca Salazar in her capacity as Director of Communications of the Regional Directorate of Transport and Communications of the Regional Government of Amazonas, Rosanita Cruz Rubio as head of the Procurement Area and the defendant Alver Alfredo Terrones Sepulveda, to defraud the State of assets in the contract for the acquisition of a professional drone.</p><p>The defendants would have committed the crime of aggravated collusion by preventing the participation of bidders, which allows a better economic and functional perspective, by having determined a reference value in an amount greater than the sum of S/ 3,127.12, when it should have been the reference value without IGV is S / 17,372.88 soles, but also when the good was not delivered according to the terms of the aforementioned contract, not having corresponded to grant the conformity, and therefore, cancel the entire contractual amount as if the provision had been fully fulfilled.</p><p>Therefore, the judiciary decided to sentence the two officials as authors and the co-accused as an accomplice of the crime against the public administration, crimes committed by public officials, in its figure of aggravated collusion, provided for and sanctioned in the second paragraph of article 384 of the Penal Code, ordering six years of effective deprivation of liberty for each one, and taking into account that they are at liberty, the sentence is not provisionally executed, but the following restrictions are imposed in accordance with the provisions of article 402 numeral 41 of the Criminal Procedure Code consisting of the obligation not to be absent from the locality where he resides.</p><p>They must submit to the virtual criminal control of defendants and sentenced free on a fortnightly basis; the payment of a deposit of three thousand and 00/100 soles (S/ 3,000.00), which must be paid by each one within three days of the issuance of this sentence, and in case of not complying with the restrictions imposed, the pain; ordering his internment in the Huancas Penitentiary Establishment.</p><p>In addition, the sentenced and the co-defendant are incapacitated or prevented from obtaining a mandate, position, employment or commission of a public nature, under warning in case the sentenced do not comply with this sentence, if they are denounced for the crime of disobedience or resistance to the authority foreseen. in article 368? of the Penal Code.</p><p>A three hundred and sixty-five (365) day fine is imposed, equivalent to the sum of two thousand eight hundred and twenty-eight with 75/100 soles (S/ 2,828.75), which the convicts must pay within a period of ten business days after the sentence is pronounced in accordance with what is established in article 44 of the Penal Code.</p><p>The civil compensation is set at the sum of twelve thousand seventeen and 12/100 soles (S/ 12,017.12) that must be paid jointly and severally by those sentenced in favor of the aggrieved party.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Euclid Infotech Pvt Ltd.</p></div>"}