{"date": "2022-02-04 17:07:07+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2776.91, "close": 3158.71}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>COLOR STAR TECHNOLOGY CO LTD (\"CSCW-Q\")\n- How Color Star Brings Fans Into the Metaverse with Color World\n\n     In order to keep people connected with their favorite stars and\nathletes in this increasingly digital world, Color Star Technology Co.,\nLtd. is debuting their Color World application, which is best described as\na combination of Amazon, YouTube and the Metaverse. The launch is set to\ntake place later this month.\n\n     Color Star was founded in 2007 and is known for connecting top-tier\ninstructors with students eager to learn through real-world applications.\nAny user can watch or listen to various courses through the application,\nand the range of instructors is elite: from Asian entertainment stars to\nWestern mega-celebrities.\n\n     The Color World platform will link two entities that society is\nconstantly alternating between: real-world versus digital. This immersive\nonline experience will give users the feeling of being at an actual event,\nrather than simply watching from a device. Events will be viewed in\nhigh-definition 3-D.\n\n     Color Star intends to create an environment in which users can live\nout their biggest dreams, whether attending their favorite musician's\nconcert or attending their favorite sports team's big game. This artificial\nintelligence-powered technology will be a first-of-its-kind innovation. \"I\nwant to give people the stage and the platform to let their dreams come\ntrue,\" said Color Star CEO Lucas Capetian.\n\n     The growing popularity of the Metaverse certainly cannot be ignored,\nand Color Star Technology is eager to expand its digital presence through\nColor World once it launches in late January 2022 with a series of online\nand offline events that will enable members to get in on the action.\n\n     Media Contacts\n\n     Kelin Dillon\n     (C) +52 (1) 55 8802 2861\n     433 North Camden Drive, Suite 400\n     Beverly Hills CA 90210\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203400242.MNPRE2203401030-09054320220204</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}