{"date": "2021-12-20 04:19:59+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The author is a Reuters Breakingviews columnist.  The opinions expressed are her own. Refiles to remove extraneous word in final paragraph.</p><p class=\"tr-by\">By Robyn Mak</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">HONG KONG, Dec 20 (Reuters Breakingviews)</span><span class=\"tr-dl-sep\"> - </span>Alibaba's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=BABA.N\" data-type=\"ric\" data-ric=\"BABA.N\" translate=\"no\" dir=\"ltr\">BABA.N</a> <a href=\"reuters://REALTIME/Verb=FullQuote/ric=9988.HK\" data-type=\"ric\" data-ric=\"9988.HK\" translate=\"no\" dir=\"ltr\">9988.HK</a> big climate splash could have ripple effects on its valuation. The Chinese e-commerce titan at its annual investor day on Friday <a href=\"https://www.alibabagroup.com/en/news/article?news=p211217\" data-type=\"url\" class=\"tr-link\" translate=\"no\">unveiled</a> bold carbon-neutrality goals for 2030 and beyond. Longer term, the efforts could bolster shareholder returns.</p><p>   The company wheeled out top executives for the event including boss Daniel Zhang and outgoing finance chief <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2SR00X\" data-type=\"storyId\" data-story-id=\"nL1N2SR00X\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> Maggie Wu. But the latter, alongside her successor Toby Xu, failed to present a compelling financial case for Alibaba amid regulatory crackdowns, China's sputtering economy and intensifying competition.</p><p>A near-50% plunge this year leaves Alibaba’s stock trading at less than 15 times forecast 2022 adjusted earnings for its core e-commerce business, per JPMorgan estimates. That's well below rival JD.com's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=JD.O\" data-type=\"ric\" data-ric=\"JD.O\" translate=\"no\" dir=\"ltr\">JD.O</a> <a href=\"reuters://REALTIME/Verb=FullQuote/ric=9618.HK\" data-type=\"ric\" data-ric=\"9618.HK\" translate=\"no\" dir=\"ltr\">9618.HK</a> 33 times, and trails American retailers like Walmart <a href=\"reuters://REALTIME/Verb=FullQuote/ric=WMT.N\" data-type=\"ric\" data-ric=\"WMT.N\" translate=\"no\" dir=\"ltr\">WMT.N</a> and Target <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TGT.N\" data-type=\"ric\" data-ric=\"TGT.N\" translate=\"no\" dir=\"ltr\">TGT.N</a>. The beat-up valuation implies shareholders ascribe zero worth to other units, including Alibaba’s international operations and a fast-growing cloud-computing division, which together constitute a fifth of annual revenue.</p><p>That makes Zhang's big climate reveal even more conspicuous. Besides a lone environmental, social and governance report in 2018 and a half-hearted attempt <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2RH02Z\" data-type=\"storyId\" data-story-id=\"nL1N2RH02Z\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> to make this year's Singles' Day shopping festival greener, the company has largely stayed on the sustainability sidelines. </p><p>Its latest pledge, though, sets a high standard for global peers. By 2030, Alibaba wants to achieve carbon neutrality in its own operations and energy use, known as Scope 1 and Scope 2 emissions. Last year, these totalled 4.2 million tons, mostly due to electricity-hungry data centres.  </p><p>Moreover, the company is pushing an ambitious programme to reduce greenhouse gases that do not fall into Scopes 1, 2 and even 3, which includes supply chains, investments and other indirect sources. These Scope 3+ emissions, as Alibaba dubs them, belong to the millions of consumers and merchants that use the e-commerce giant as a middleman. </p><p>Zhang wants to reduce 1.5 gigatons of these by 2035 by focusing on encouraging greener consumer and corporate habits, like buying eco-friendly products and using less packaging. It's a laudable attempt that companies like Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> can emulate.</p><p>Besides scoring much-needed political points, Alibaba's green pivot may even give its valuation a boost over time. <a href=\"https://www.stern.nyu.edu/sites/default/files/assets/documents/NYU-RAM_ESG-Paper_2021%20Rev_0.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">A recent study</a> analysing over 1,000 companies over a five-year period found positive correlations between ESG know-how and a firm's financial and stock performance. Getting the details of Alibaba’s climate push right will be key, but so far it seems to check the right boxes.  </p><p>Follow <a href=\"https://twitter.com/mak_robyn\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@mak_robyn</a> on Twitter </p><p><br/></p><p>CONTEXT NEWS</p><p>- Chinese e-commerce company Alibaba on Dec. 17 announced a pledge to achieve carbon neutrality in its own operations by 2030. As part of the plan, the company will also target a 50% carbon intensity reduction for so-called Scope 3, or emissions indirectly generated by Alibaba, from 2020 levels. In addition, Alibaba has developed the concept of Scope 3+, which it defines as “emissions generated by a wider range of participants in a platform’s ecosystem, currently outside of the Scopes 1, 2 and 3.” It aims to cut a total of 1.5 billion tons of Scope 3+ carbon emissions by 2035.</p><p>- Alibaba held its annual investor day virtually on Dec. 16 and 17.</p><p><br/></p><p class=\"tr-signoff\"> (Editing by Antony Currie and Katrina Hamlin)</p><p class=\"tr-contactinfo\">((For previous columns by the author, Reuters customers can click on <a href=\"reuters://REALTIME/verb=Headlines/ric=MAK/\" data-type=\"newsExpression\" data-expression=\"MAK/\" translate=\"no\" dir=\"ltr\">MAK/</a> <br/> SIGN UP FOR BREAKINGVIEWS EMAIL ALERTS <a href=\"https://bit.ly/BVsubscribe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://bit.ly/BVsubscribe</a> | <a href=\"mailto:robyn.mak@thomsonreuters.com\" data-type=\"email\" translate=\"no\">robyn.mak@thomsonreuters.com</a> ; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://robyn.mak.thomsonreuters.com@reuters.net\">robyn.mak.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: CHINA-ALIBABA/BREAKINGVIEWS</p></div>"}