{"date": "2022-02-24 23:59:39.854000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2896.54, "close": 3075.77}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_rpw650s9&amp;referenceId=tag:reuters.com,2022:newsml_OV989224022022RP1_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_rpw650s9&amp;referenceId=tag:reuters.com,2022:newsml_OV989224022022RP1_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: U.S. stocks ended sharply higher on Thursday, led by a 3% gain in the Nasdaq, in a dramatic market reversal as U.S. President Joe Biden unveiled harsh new sanctions against Russia after Moscow began an all-out invasion of Ukraine. This report produced by Chris Dignam.<br/>Short Link: <a href=\"https://refini.tv/36tck7M\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/36tck7M</a><br/><br/>Video Transcript:<br/><br/>After an early morning selloff following Russia's all-out invasion of Ukraine, all three major indexes roared back on Thursday, with the NASDAQ closing up more than 3%, after US President Joe Biden unveiled harsh new sanctions against Moscow for launching an assault on its neighbor. The Dow was the last to turn positive on Thursday, closing up more than 0.25% after an initial 800-point slide. The S&amp;P 500, which earlier this week slid into correction territory, gained 1.5% by the end of the day, after falling more than 2.5% in early trading. And the NASDAQ soared after Biden's speech, finishing up a whopping 3.3% after losing about as much at the start of the session. WealthWise Financial CEO, Loreen Gilbert, said given the escalation in Europe, it's possible the US Federal Reserve might take a softer approach to raising interest rates.<br/><br/>Pundits have been talking about what would it take to have this Fed put, and for the Federal Reserve to change their course from raising rates. And, so, the question here is, does this escalation cause the Fed to change their course? I think, a couple weeks ago, we were sitting at a very high probability of a 50 basis point increase in March and, now, that probability is going way down, and more towards that 25 basis points. So, that is going to appease the markets if, in fact, we do see either no rate increase, which I doubt that that's going to happen, but even a 25 basis point increase at this point would appease the markets.<br/><br/>The whipsaw session reversed the fortunes of Tesla, shares of which were down as much as 8.4% but closed up nearly 5%. Earlier, the Wall Street Journal reported that the US Securities and Exchange Commission is investigating whether recent stock sales Elon Musk and his brother violated insider trading rules. Shares of Apple were down more than 5% at its lows, but recovered to close up more than 1.5%, climbing along with other megacaps including Amazon, Microsoft and Meta Platforms, which all saw big early losses but then finished up well over 4%. Microsoft closed up 5%. But perhaps the most spectacular percentage spread during Thursday's wild session belonged to DraftKings, which started the day down more than 7% only to finish the session up more than 11%.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}