{"date": "2021-11-28 23:26:36.140000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Future Retail, which is litigating with American retail major, Amazon, has claimed that Amazon officials walked out of a Competition Commission of India (CCI) hearing in an attempt to browbeat the CCI.</p><p>In a letter to the stock exchanges, Future said it believes that the CCI will not be intimidated by Amazon's' arrogance' and that it will take action on its show cause notice against Amazon in accordance with law and regulations.</p></div><div class=\"tr-npp-body\"><p>\"The counsels to Amazon, in utter disregard to the norms and in utter disrespect to the Indian statutory regulatory authority, refused to argue the matter and walked out of the proceedings in an attempt to browbeat the CCI,\" the FRL said in a communication to the stock exchanges.</p><p>On November 24, at the CCI hearing, Amazon tried to stall the personal hearing on the plea that they had filed a petition in the Supreme Court against the Delhi High Court order dated November 16.</p><p>\"The CCI refused to postpone the hearing and continued with the same. Amazon's counsels chose to stay on and participate in the hearing during the submissions by Future Coupons Pvt Ltd. However, when their turn came for making the submissions, Amazon's counsel stated that Amazon has not been given as much time as FCPL and hence more time should be given to Amazon. The CCI, after internal consultation, told Amazon that postponement cannot be given and to make their oral submissions,\" the FRL said. FCPL is a promoter entity in which Amazon had picked up a 49 per cent stake.</p><p>In a letter to Future Coupons, CCI said the Commission heard the learned counsel appearing on behalf of FCPL and CAIT at length. Thereafter, the Commission called upon the learned counsel appearing on behalf of Amazon to make its submissions on merits whereupon the learned counsel expressed its inability to argue the matter stating that making submissions may compromise the SLP and render it infructuous, which was stated to come up before the Supreme Court.</p><p>\"The learned counsel also made a grievance that Amazon did not get sufficient time to file its rejoinder. Accordingly, despite grant of opportunity, the learned counsel did not make oral submissions. Having heard the counsel(s), the Commission decided to pass an appropriate order in due course,\" the CCI said.</p><p>In a letter to the CCI after the hearing, Future Coupons through its lawyers said: \"The conduct of Amazon smacks of arrogance. It has shown scant respect to the Delhi High Court, the Supreme Court and to this commission. It could have moved the Delhi High Court for an extension of time or for a suspension of the order, but it perhaps did not find it necessary to do so.\"</p><p>Instead, it moved the Supreme Court by an interim application relating to the arbitration proceedings, establishing its mistaken belief that the Supreme Court would not deny relief to Amazon, throwing established rules of cause of action to the winds.</p><p>\"When it failed to get relief from the Supreme Court, it then sought an adjournment from the CCI, and when that was refused, in a display of outright contempt for an Indian statutory authority, this trillion dollar American company walked out of the hearing. We invite the Commission to deal with this conduct of Amazon appropriately,\" it said.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}