{"date": "2021-12-22 19:12:22.093000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.34, "close": 3421.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>EAT WELL INVESTMENT GROUP INC (\"EWG-Z\")\n- Appoints president Marc Aneed as CEO\n\n     Marc Aneed brings over 20 years experience from some of the worlds\nmost renowned CPG brands including PepsiCo, Quaker Oats, Gatorade and more.\nMarc has led many iconic consumer brands and enabled $1B in growth across\ndozens of product categories.\n\n     Eat Well Investment Group Inc., (the Company or Eat Well Group or\nEWG) is pleased to announce that current President and Director, Marc\nAneed has been appointed Chief Executive Officer of Eat Well Group,\nreplacing David Doherty who has retired.\n\n     Mr. Aneed is an award-winning natural/wellness consumer products\nexpert with a 20-year career in CPG, starting at The Quaker Oats\nCompany/PepsiCo and working on iconic brands such as Gatorade and more.\nPrior to Eat Well Group, Mr. Aneed was at Glanbia PLC, a global nutrition\ncompany where he led Amazing Grass, a leading plant nutrition &amp; supplement\ncompany with over $100M in retail sales, winning multiple corporate and\nindustry awards for brand growth. Mr. Aneed also led Glanbias Sports\nNutrition brands in North America, including Optimum Nutrition and Isopure,\nwith over $750M in retail sales. He has launched dozens of successful\nconsumer products driving over $1B in retail sales collectively, with scale\nin eCommerce where he oversaw the #1 portfolio of fast-growing Sports\nNutrition brands and the #1 Greens Superfood on Amazon.\n\n     In addition, Mr. Aneed has worked on multiple M&amp;A transactions with a\ncumulative value over $400MM, and excels at creating cultural fusion and\nstrategic discipline in many different operating environments, while\ndriving significant market share gains and financial outcomes in his\nvarious roles. Mr. Aneed holds an MBA from the Kellogg School at\nNorthwestern University and a BA from the University of Pennsylvania.\n\n     We would like to thank David for his many years of leadership. As Eat\nWell Group continues to identify and invest in leading plant-based\nnutrition companies, we are confident in a smooth transition and remain\nfocused on driving shareholder value into 2022 and beyond, stated Marc\nAneed, CEO and Director, Eat Well Group.\n\n     To learn more, join Eat Well Groups mailing list for important\nupdates.\n\n     ABOUT EAT WELL GROUP\n\n     Eat Well Group is a publicly-traded investment Company primarily\nfocused on high-growth companies in the agribusiness, food tech,\nplant-based and ESG (environmental, social and governance) sectors. Eat\nWell Groups management team has an extensive record of sourcing, financing\nand building successful companies across a broad range of industries and\nmaintains a current investment mandate on the health/wellness industry. The\nteam has financed and invested in early-stage venture companies for greater\nthan 25 years, resulting in unparalleled access to deal flow and the\nability to construct a portfolio of opportunistic investments intended to\ngenerate superior risk-adjusted returns.\n\n     The Canadian Securities Exchange has neither approved nor disapproved\nthe information contained herein and does not accept responsibility for the\nadequacy or accuracy of this news release.\n\nView source version on businesswire.com:\n<a href=\"https://www.businesswire.com/news/home/20211222005172/en\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211222005172/en</a>/\n\nContacts:\n\nEat Well Investment Group Inc.\nMarc Aneed, CEO\n\nir@eatwellgroup.com\nwww.eatwellgroup.com\n\nSource: Eat Well Investment Group Inc.\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2135500774.MNPRE2135501817-09392020211222</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}