{"date": "2021-11-09 14:51:04.622000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>LUCIRA HEALTH INC (\"LHDX-Q\")\n- CHECK IT PCR Quality, at Home Molecular COVID-19 Test\n- Kit Now Available on Amazon\n\n     Lucira Health, Inc. (\"Lucira Health\" or \"Lucira\") a medical technology\ncompany focusing on the development and commercialization of transformative\nand innovative infectious disease test kits, announced that its LUCIRA(TM)\nCHECK IT COVID-19 Test Kit, a self-administered PCR quality, single-use, at\nhome molecular diagnostic test for COVID-19, is available for purchase by\nAmazon U.S.-customers.\n\n     \"We are delighted that our LUCIRA(TM) CHECK IT COVID-19 test kit is\nonce again available to Amazon U.S.-customers,\" said Erik Engelson, Chief\nExecutive Officer. \"Access to a COVID-19 test with the PCR-level accuracy\nand early detectability that you get from a lab test combined with the\nspeed and simplicity of our test kit can help Americans confidently return\nto work or school and to get back to gathering live with family and friends\nthis upcoming holiday season. Amazon's reach enables more people in the\nUnited States access to this innovative and unique testing solution.\n\n     The test kit, authorized for emergency use by FDA under EUA, is\navailable over the counter (\"OTC\"), and can produce a positive result in as\nlittle as 11 minutes, or a negative result within 30 minutes. Immediately\nafter testing, users can access a free, text based digital LUCI PASS(TM)\nverified test result on their phone for work, travel, and leisure.\n\n     Accurate, easy to use\n\n     The LUCIRA(TM) CHECK IT COVID-19 test kit is designed to deliver PCR\nquality molecular accuracy in 30 minutes or less at home. Each single-use\ntest kit contains everything needed to conduct one COVID-19 test. It was\ndesigned and tested extensively for individuals to use independently and\ndoes not require a physician's prescription or supervised assistance. There\nis no additional equipment such as a reader or instrument to purchase.\n\n     In clinical trials, 100% of users successfully performed the test at\nhome in about two minutes using Lucira's easy-to-use 'swab, stir and\ndetect' CHECK IT test kit.\n\n     Molecular tests are more sensitive than antigen tests because they\namplify critical parts of the viral target. The targeted, molecular\namplification that LUCIRA(TM) CHECK IT and PCR tests employ makes them\ndemonstrably more reliable than \"rapid\" antigen tests, which can miss\nactive COVID-19 infections.\n\n     In a Community Trial setting, LUCIRA(TM) CHECK IT results were\ncompared with the Hologic Panther Fusion, considered a high-sensitivity\nmolecular test due to its low Limit of Detection (\"LOD\"). Lucira's accuracy\nwas 98%, detecting 385 out of 394 positive and negative samples correctly\nwhen compared to the Hologic Panther Fusion, and excluding ten samples with\nvery low levels of virus (those with very high PCR cycle thresholds of 37.5\nor greater) that possibly no longer represented active infection.\nComparative positive results agreed 97% of the time among this sample, and\nnegative results agreed 98% of the time.\n\n     LUCIRA(TM) CHECK IT Test Kit\n\n     The LUCIRA(TM) CHECK IT test kit fits in the palm of a hand, extracts\ngenetic material from the virus and amplifies it similar to PCR lab tests.\nEach Lucira test kit contains everything needed to run one COVID-19 test.\nUsers get the test device, two AA batteries, sample vial, swab and simple\none-page instructions. The batteries are inserted into the device and the\nsample vial is placed in the test unit. The user then opens the test swab\npacket and rotates the swab in each nostril five times. The swab is then\nstirred in the sample vial, which is then gently pressed into the test unit\nto start the test. The \"ready\" light will blink until a \"positive\" or\n\"negative\" green light is illuminated within 30 minutes. Lucira also offers\na free LUCI PASSTM digital verified test result back to a user's phone.\nLUCI is accessed via text and does not require downloading an app. There is\nalso an opt-in for public health reporting for users who wish to transmit\ntheir results to the relevant public health authorities.\n\n     Lucira's identical, prescription product is also available for sale to\nhealthcare providers at lucirahealth.com\n\n     About Lucira Health\n\n     Lucira is a medical technology company focused on the development and\ncommercialization of transformative and innovative infectious disease test\nkits. Lucira's testing platform produces lab quality molecular testing in a\nsingle-use, consumer-friendly, palm-size test kit powered by two AA\nbatteries. Lucira designed its test kits to provide accurate, reliable, and\non-the-spot molecular test results anywhere and at any time. The LUCIRA(TM)\nCHECK IT COVID-19 Test Kit (OTC) and LUCIRA(TM) COVID-19 All-In-One Test\nKit (Rx) are designed to provide a clinically relevant COVID-19 result\nwithin 30 minutes from sample collection. For more information, visit\nwww.lucirahealth.com.\n\n     Forward Looking Statements\n\n     Statements contained in this press release regarding matters that are\nnot historical facts are \"forward-looking statements\" within the meaning of\nthe Private Securities Litigation Reform Act of 1995. Because such\nstatements are subject to risks and uncertainties, actual results may\ndiffer materially from those expressed or implied by such forward-looking\nstatements. Words such as \"can,\" \"plans,\" \"will,\" \"may,\" \"anticipates,\"\n\"expects,\" \"potential,\" and similar expressions are intended to identify\nforward-looking statements. These forward-looking statements are based upon\nLucira's current expectations and involve assumptions that may never\nmaterialize or may prove to be incorrect. Actual results could differ\nmaterially from those anticipated in such forward-looking statements as a\nresult of various risks and uncertainties, including our ability to\nincrease production, streamline operations and increase product\navailability; the success of our test platform with COVID-19, the impact to\nour business of the ongoing COVID-19 pandemic; our ability to successfully\ncontinue to expand internationally; any impact on our ability to market our\nproducts; demand for our products due to deferral of procedures using our\nproducts or disruption in our supply chain; our ability to achieve or\nsustain profitability; our ability to gain market acceptance for our\nproducts and to accurately forecast and meet customer demand; our ability\nto compete successfully; our ability to enhance our product offerings;\ndevelopment and manufacturing problems; capacity constraints or delays in\nproduction of our products; maintenance of coverage and adequate\nreimbursement for procedures using our products; and product defects or\nfailures. These and other risks and uncertainties are described more fully\nin the \"Risk Factors\" section and elsewhere in our filings with the\nSecurities and Exchange Commission and available at www.sec.gov, including\nin our most recent Annual Report on Form 10-K and Quarterly Reports on Form\n10-Q. Any forward-looking statements that we make in this announcement\nspeak only as of the date of this press release, and Lucira assumes no\nobligation to update forward-looking statements whether as a result of new\ninformation, future events or otherwise after the date of this press\nrelease, except as required under applicable law.\n\nInvestor Contact\nGreg Chodaczek\nInvestorrelations@lucirahealth.com\n347-620-7010\n\nTel   : 510-350-8071    LUCIRA HEALTH INC\nEmail : investors@lucirahealth.com\nWWW   : <a href=\"https://www.lucirahealth.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.lucirahealth.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2131200606.MNPRE2131202463-06491820211109</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}