{"date": "2021-11-03 05:39:52.616000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Meituan has decided to shift its strategic focus to \"retailing plus technology\" from \"food plus platform\" in a major change of business direction, as China's largest on-demand delivery services provider adjusts to fit a changing business and regulatory environment, according to a report published by local media outlet <span>LatePost</span> on Wednesday.</p><p>Wang Xing, the founder and chief executive of Meituan, announced the changes in an internal meeting this week. As part of the shift, the Beijing-based company has set up a special five-member team as the supreme decision-making body for retail business operations, which includes Wang and two senior vice presidents – Wang Puzhong and Chen Liang – according to the report. The other two members are Guo Wanhui, the head of restaurant supply chain service platform Kuailv, and Li Shubin, who is in charge of the Meituan app.</p></div><div class=\"tr-npp-body\"><ul class=\"bulleted-list arrowlist\"><li>The creation of such a special team can be compared with a phase in the development of Amazon, when founder Jeff Bezos created a D-team in 2008</li><li>Meituan's overhaul comes after a tumultuous year for the company and Chinese internet platforms in general, after Beijing updated regulations</li></ul><p>The creation of such a special team can be compared with a phase in the development of Amazon, when founder Jeff Bezos created a D-team in 2008 inside the US e-commerce giant to focus on digital sales.</p><p>Do you have questions about the biggest topics and trends from around the world? Get the answers with<a href=\"https://www.scmp.com/knowledge\" data-type=\"url\" class=\"tr-link\" translate=\"no\">SCMP Knowledge</a>, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team.</p><p>Meituan declined to comment on Thursday.</p><p>Meituan's overhaul comes after a tumultuous year for the company and Chinese internet platforms in general, after Beijing embarked on a regulatory crackdown. It was fined 3.44 billion yuan (US$533 million) by China's antitrust watchdog, the State Administration for Market Regulation (SAMR), earlier this month for forcing merchants to pick its platform exclusively to conduct business.</p><p>Meituan, which has created millions of delivery jobs in the country, is also under pressure from Chinese labour authorities to pay mandatory social insurance to at least some of its standard deliverymen, a move that could weigh heavily on the company's bottom line in future.</p><p>In July, SAMR and six other government agencies also ordered Meituan to pay its delivery riders more than the country's minimum wage, and to free them from unreasonable demands made by algorithms that predetermine the number and timing of their deliveries.</p><p>Meanwhile, Wang, the 42-year-old founder of Meituan, raised eyebrows earlier this year by publishing a 1,000-year-old poem criticising China's first emperor for burning books and massacring scholars, a gesture that fanned speculation Wang was expressing his displeasure with the Chinese authorities. Wang later explained that the poem was about business competition.</p><p>Wang has hid nearly 18,000 of his social media posts over the last decade from public view, according to<a href=\"https://www.scmp.com/tech/big-tech/article/3151949/meituan-founder-wang-xing-locks-down-social-media-posts-chinas-food\" data-type=\"url\" class=\"tr-link\" translate=\"no\">previous online checks</a>by the <span>South China Morning Post.</span> </p><p>In comments made during Meituan's recent earnings call, Wang praised the concept of common prosperity, a strategic priority for the Chinese government, and claimed the concept is embedded in the genes of his company.</p><p>Under the new business structure, Chen Liang, who joined the company 10 years ago and is Wang Xing's classmate from high school, will become more powerful. He will oversee the company's group buying business Meituan Select, restaurant supply chain platform Meituan Kuailu, as well as grocery business Meituan Maicai. Guo Wanhuai, vice-president at Meituan, who is also a member of the special team, will assist Chen to manage the businesses, the <span>LatePost</span> report said.</p><p>In the second quarter, Meituan's revenue rose 77 per cent from a year earlier to 43.8 billion yuan (US$6.8 billion), but it fell to a net loss of 3.4 billion yuan in the quarter from a profit of 2.2 billion yuan a year earlier.</p><p>The company's stock price closed 1.3 per cent higher at HK$272.20 in Hong Kong on Thursday.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 South China Morning Post Publishers Ltd. All rights reserved.</p></div>"}