{"date": "2021-12-23 19:01:24.677000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3420.74, "close": 3393.39}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon has reached a settlement with the National Labor Relations Board, agreeing to make it easier for workers to engage in union organizing at its warehouses.</p><p>The e-commerce giant must allow employees who are done with their shifts but working on union activities to access nonwork areas of the facilities, such as break rooms, if other off-duty workers are also allowed there, according to the agreement, which was finalized Wednesday. Workers had filed complaints with the agency, saying that Amazon did not allow them to be on-site outside 15 minutes on either side of their shifts, making it difficult to organize.</p></div><div class=\"tr-npp-body\"><p>The agreement also protects workers who are participating in union activities outside the facilities, such as in the parking lots, from getting kicked off the premises.</p><p>As part of this week's agreement with the NLRB, Amazon must send notices informing workers of their rights to current and past warehouse workers who were employed at the company since March 22, encompassing hundreds of thousands of workers.</p><p>Amazon did not immediately respond to a request for comment. The New York Times first reported news of the settlement. Amazon founder Jeff Bezos owns The Washington Post.</p><p>Amazon has faced increased union pressure from employees at its vast network of warehouses in the past two years. A union effort in Bessemer, Ala., failed in the spring when workers rejected the effort. But the Retail, Wholesale and Department Store Union will get a second shot after the NLRB called for a revote last month, finding that Amazon improperly interfered in the first election.</p><p>In New York, the Amazon Labor Union, an independent group of workers at a Staten Island facility that isn't connected to a major national union, this week refiled an application with the federal government to hold a vote on unionization.</p><p>The NLRB's agreement finalized with Amazon on Wednesday makes it easier to enforce the settlement — allowing the agency to skip a step to judgment if it finds Amazon has not followed the agreement.</p><p>\"This settlement agreement provides a crucial commitment from Amazon to millions of its workers across the United States that it will not interfere with their right to act collectively to improve their workplace by forming a union or taking other collective action,\" NLRB General Counsel Jennifer Abruzzo said in a statement. \"Working people should know that the National Labor Relations Board will vigorously seek to ensure Amazon's compliance with the settlement and continue to defend the labor rights of all workers.\"</p><p>The settlement does not include a \"non-admission\" clause, which are common ways for companies to avoid admitting guilt.</p><p>\"WE WILL NOT tell you that you cannot be on our property, or that you need to leave our property 15-minutes after the end of your shift, or threaten you with discipline or that we will call the police, when you are exercising your right to engage in union or protected concerted activities by talking to your co-workers in exterior nonwork areas during nonwork time,\" Amazon's required notice to workers says.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 The Washington Post</p></div>"}