{"date": "2022-01-05 16:00:00.206000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3350.44, "close": 3265.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p align=\"left\">SAN ANTONIO, Jan.  05, 2022  (GLOBE NEWSWIRE) -- Onica by Rackspace Technology, the Amazon Web Services (AWS) focused business group of <a href=\"https://www.globenewswire.com/Tracker?data=nBxOhJ398YWxN6Gjs8YeFPO3jKc-w508aCv2pw4fe7uujVq_rz7CVpo3UgJWo778tIp8Awrw0g5Xbwhauf2X-O59mwg7lefeZIRouSm78F0=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Rackspace Technology</a>® (NASDAQ: RXT), a leading end-to-end, multicloud technology solutions company, today announced its deployment relationship with AWS on Emissions Monitoring and Surveillance (EMS). EMS is a new solution to help facility engineers, operations general managers, and environmental teams see direct measurements of emissions (initially methane) so they can quickly act (maintain, operate, design), driving down per-unit-volume carbon intensity (kgCO2e/bbl), reducing equipment failures and safety incidents, retaining product volume, and curtailing environmental impacts through Leak Detection and Repair.<br/></p><p><strong>How EMS works:</strong><br/>1. Adds new direct observations where needed (including a selection of pre-integrated 3<sup>rd</sup> party options for satellite, airplane, unmanned aerial vehicle, stationary continuous monitoring systems, and internet of things sensors) <br/>2. Combines those and existing sensors and supervisory control and data acquisition systems to provide a continuous, comprehensive view of emissions reality <br/>3. Integrates that emissions data with disparate industrial data sources within a facility or enterprise, connecting localized operational technology data, plant technical data and business information systems in a single repository so customers can optimize emissions alongside production and uptime</p><p>Having this data all together lets customers analyze it faster and get it into the applications and workflows where it is most needed. This enables the repairs and optimizations needed to meet methane emission reduction goals and reduce overall carbon intensity.</p><p>“We’re proud to work alongside AWS to help energy companies drive down per-unit-volume carbon intensity, reduce equipment failures, safety incidents, retain product volume, and curtail environmental impacts through Leak Detection and Repair,” said Mike Melanson, Vice President, Strategic Alliance Partnerships for Rackspace Technology. “A solution that addresses climate change is especially timely, compelling, and increases our scope and industry expertise in this area.”</p><p>The EMSsolution automates integration of methane emissions data sources from disparate third parties (and operational data) into the tools and workflows where it is most needed, providing geospatial views of emissions, alerts, and advanced analytics. These capabilities enable the repairs and optimizations needed to meet methane emission reduction goals, and reduce overall emissions intensity.</p><p>EMS shows engineers emissions data so they can fix leaks faster and optimize operations to minimize unnecessary emissions. It shows emissions on a continuous basis, consolidating multiple sources, and alongside equipment operational data, breaking down the data silos impeding emissions analysis today. It also dramatically accelerates the deployment of new sensor inputs, analytic tools, and workflow integrations through its scalable technical and commercial framework, making many new component deployments possible in a matter of days.</p><p>As an official Deployment Partner, Onica by Rackspace Technology can help customers assess their readiness for, plan for, and execute the implementation of the EMS solution.</p><p>For more information on AWS Emissions Monitoring and surveillance visit: aws.amazon.com/energy/solutions/emissions-monitoring-surveillance/</p><p>About Rackspace Technology<br/><a href=\"https://www.globenewswire.com/Tracker?data=nBxOhJ398YWxN6Gjs8YeFHvTsvdZBICfpDBUXRynnuy_H7Vcu8jdd2iUuDvWnrBZD5HR6tF0lbaWv6v6nKvJPtLsMaIf9wP9tERrYRF2e3A=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Rackspace Technology</a> is a leading end-to-end multicloud technology services company. We can design, build, and operate our customers’ cloud environments across all major technology platforms, irrespective of technology stack or deployment model. We partner with our customers at every stage of their cloud journey, enabling them to modernize applications, build new products and adopt innovative technologies.</p><p>Media Contact<br/>Natalie Silva<br/>Rackspace Technology Corporate Communications<br/><a href=\"https://www.globenewswire.com/Tracker?data=UvZ7_Z2zEx6TpUeH0y8_OO0eQP9cy7GxC-lVoVho4CAlMN_hLDFM-kqojywzZcX0wn_zRznjk4MT7JdTVPi0dVEBQola-uQkZ14Q1t35x71NboK-RMPVvcPxYDrQwB_P\" data-type=\"url\" class=\"tr-link\" translate=\"no\">publicrelations@rackspace.com</a></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODQyMTY3NSM0NjQwOTI2IzIwMDU3MjQ=\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RReU1UWTNOU00wTmpRd09USTJJekl3TURVM01qUT0=&amp;key=08f17a5a03cfe799a2e7ec584ffd5f922d1627d08ef547857992f9f0bf08c96b61b7b41988ae4f4d977b19b25eb40cd0501528b66767de6eb7eeb779cc734107\"/></div></div><br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/OTY5MGJjNzEtZGY3MC00NzY2LWJmMmEtMTQ4Njk2NmYxMjE1LTEwMTcyOTc=/tiny/Rackspace-Technology-Inc-.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9PVFk1TUdKak56RXRaR1kzTUMwME56WTJMV0ptTW1FdE1UUTROamsyTm1ZeE1qRTFMVEV3TVRjeU9UYz0vdGlueS9SYWNrc3BhY2UtVGVjaG5vbG9neS1JbmMtLnBuZw==&amp;key=beb8104ed7e7c0f69449613d503d50eee783bf022d00cdd3bc7e2c8cdbdbb76ece99e05e1fffc2486c89e39ef43f897129879a56c61f9f0512e73cf111649904\"/></div></div><p><a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/3397ed0c-def0-4eb1-a4f0-1408e03161e0\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Primary Logo\" border=\"0\" src=\"https://ml.globenewswire.com/media/3397ed0c-def0-4eb1-a4f0-1408e03161e0/small/rackspace-technology-logo-black-aspect-640-png.png\" style=\"max-height:46px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS8zMzk3ZWQwYy1kZWYwLTRlYjEtYTRmMC0xNDA4ZTAzMTYxZTAvc21hbGwvcmFja3NwYWNlLXRlY2hub2xvZ3ktbG9nby1ibGFjay1hc3BlY3QtNjQwLXBuZy5wbmc=&amp;key=541a5d68037854562d4b5eba9ef0a186431b79f278279986a69d00354c275c43d054e4601dcff7f17febfa0c07d6c67f5e764afe49fd2e8b6016b03cfeef4ad7\"/></div></div></a></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">GlobeNewswire, Inc. 2022</p></div>"}