{"date": "2022-02-18 05:30:45.750000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3162.01, "close": 3052.03}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Contract couriers in NSW who deliver packages for FedEx, Toll, Amazon and others have secured a pay rise.</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>The NSW Industrial Commission on Friday ruled to phase in enforceable rates of pay for couriers who use their own vehicles.</p>\n<p>The Transport Workers' Union had claimed multinational logistics giants have been classifying such workers as independent contractors to avoid giving them fair pay and conditions.</p>\n<p>The commission's decision closes that loophole, they say, giving many of these drivers their first increase in rates for more than 15 years, TWU NSW secretary Richard Olsen said.</p>\n<p>\"It is shameful that could occur, but it has, and today we have succeeded in the NSW (Industrial Relations) Commission in putting forward a plan for the next three years moving those rates by more than 40 per cent,\" Mr Olsen said.</p>\n<p>Rates will rise over three years, beginning in March.</p>\n<p>Drivers with vans that have a load capacity between 1.5 and three tonnes will be entitled to $43.74 an hour at the end of the phased pay increases.</p>\n<p>At the other end of the scale, drivers who use their own cars to deliver packages for services such as Amazon Flex will eventually be entitled to $37.80 per hour.</p>\n<p>Mr Olsen said the pay rise will go towards helping independent contractor drivers recoup extra costs including insurance, maintenance and fuel.</p>\n<p>Amazon Flex driver Jatinderpal Singh said he hopes the decision will ensure the company's workers can keep up with the costs of running their business.</p>\n<p>However, in a statement a spokeswoman for Amazon said its Flex drivers already earn competitive pay, with the added benefit of the flexibility to work when it suits them.</p>\n<p>\"Amazon Flex delivery partners in NSW driving a sedan earn an average of over $128 for a four-hour block which already exceeds the new rate that will come into effect from 1 March.\"</p>\n<p>However once the full pay increase is phased in, drivers would be entitled to a minimum of $151 for four hours of work.</p>\n<p>Former courier Chris Turner said his experience in the industry showed the independent contractor model \"just does not work\".</p>\n<p>\"You have to set up as a company but you get paid like an employee,\" he said.</p>\n<p>\"You're basically going to be set up for financial and emotional disaster.\"</p>\n<p>He said he's watched couriers signing bankruptcy forms, seen others have their vans repossessed by creditors, and previously lived in his van \"to keep my head afloat\".</p>\n<p>The TWU wants the federal government to legislate similar pay requirements at a national level.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 Australian Associated Press</p></div>"}