{"date": "2021-11-30 22:38:43+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Jonathan Stempel</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW YORK, Nov 30 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>New York state's attorney general on Tuesday asked a state judge to appoint a monitor to oversee worker safety at an Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> fulfillment center in New York City, citing the retailer's alleged rollbacks of COVID-19 safety measures that were \"already inadequate.\" </p><p>Letitia James, the attorney general, also wants a court order requiring the rehiring of Christian Smalls, who Amazon fired for allegedly violating a paid quarantine by leading a March 2020 protest over conditions at the Staten Island facility.</p><p>Amazon did not immediately respond to requests for comment.</p><p>James, a Democrat running to become New York governor, <a href=\"https://www.reuters.com/article/us-amazon-com-complaint/new-york-attorney-general-sues-amazon-over-covid-19-shortfalls-idUSKBN2AH0C2\" data-type=\"url\" class=\"tr-link\" translate=\"no\">sued</a> Amazon in February in a New York state court in Manhattan over its safety protocols for thousands of workers at the Staten Island facility and a distribution center in the New York City borough of Queens.</p><p>She said Amazon is valuing profit over safety and \"acting as if the pandemic is over\" by rolling back safety protocols even as the <a href=\"https://www.reuters.com/business/healthcare-pharmaceuticals/omicron-variant-could-outcompete-delta-south-african-disease-expert-says-2021-11-30\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Omicron variant</a> of the COVID-19 virus threatens to increase transmission rates.</p><p>The alleged rollbacks include making the Staten Island facility \"mask-optional\" for vaccinated workers while not requiring masks for unvaccinated workers, and failing to enforce social distancing.</p><p>In her motion for a preliminary injunction, James said the proposed monitor would oversee upgraded cleaning, hygiene and social distancing procedures.</p><p>\"While case rates, hospitalizations, and deaths rise, Amazon rescinds protections and packs in more workers for its holiday rush,\" James said in her motion. \"Amazon's ongoing - and worsening - failure to protect workers must be halted.\" </p><p>The Seattle-based company is appealing a New York state judge's refusal in October to dismiss James' lawsuit.</p><p>Amazon on Nov. 15 reached a separate <a href=\"https://www.reuters.com/legal/government/amazon-settles-california-claims-it-concealed-covid-19-cases-workers-2021-11-15\" data-type=\"url\" class=\"tr-link\" translate=\"no\">settlement with California</a> to resolve claims it violated a state \"right-to-know\" law by concealing from warehouse workers and local health agencies the numbers of workers being infected with COVID-19.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Jonathan Stempel in New York<br/>Editing by Matthew Lewis)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:jon.stempel@thomsonreuters.com\" data-type=\"email\" translate=\"no\">jon.stempel@thomsonreuters.com</a> ; +1 646 223 6317; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://jon.stempel.thomsonreuters.com@reuters.net\">jon.stempel.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-NEW YORK/ (PIX)</p></div>"}