{"date": "2022-01-05 12:59:00.220000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwuline{text-decoration:underline;text-decoration-color:inherit;}</style><p class=\"bwalignc\">\n<b>Amazon and Stellantis Collaborate to Introduce Customer-Centric Connected Experiences Across Millions of Vehicles, Helping Accelerate Stellantis’ Software Transformation</b>\n</p><p class=\"bwalignc\">\n<span>Amazon and Stellantis will collaborate to deliver software solutions for Stellantis’ new digital cabin platform, STLA SmartCockpit, starting in 2024</span>\n</p><p class=\"bwalignc\">\n<span>Stellantis selects AWS as its preferred cloud provider for vehicle platforms to deliver on its long-term, software-focused vision</span>\n</p><p class=\"bwalignc\">\n<span>AWS and Stellantis to launch collaborative engineering and innovation initiatives and tools to accelerate time to market for new digital products and upskill Stellantis’ global workforce</span>\n</p><p class=\"bwalignc\">\n<span>Amazon to be the first commercial customer for the new Ram ProMaster Battery Electric Vehicle (BEV) in 2023, further expanding Amazon’s sustainable delivery network</span>\n</p><p>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2F&amp;esheet=52558217&amp;newsitemid=20220105005609&amp;lan=en-US&amp;anchor=Amazon&amp;index=1&amp;md5=1de484db4bc714af50b4fe92b99051ad\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> (NASDAQ: AMZN) and <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.stellantis.com%2Fen&amp;esheet=52558217&amp;newsitemid=20220105005609&amp;lan=en-US&amp;anchor=Stellantis+N.V.&amp;index=2&amp;md5=7bdff5a4f90f0908a5093da8047a5979\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Stellantis N.V.</a> (NYSE/MTA/Euronext Paris: STLA), a leading global automaker and mobility provider, today announced a series of global, multi-year agreements that will transform the in-vehicle experience for millions of Stellantis customers and advance the mobility industry’s transition to a sustainable, software-defined future.\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: <a href=\"https://www.businesswire.com/news/home/20220105005609/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220105005609/en/</a></p><div id=\"bwbodyimg\" style=\"width:480px;float:left;padding-left:0px;padding-right:20px;padding-top:0px;padding-bottom:0px\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Amazon and Stellantis today announced a series of global, multi-year agreements that will introduce new connected experiences across millions of vehicles. (Graphic: Business Wire)\" src=\"https://mms.businesswire.com/media/20220105005609/en/1319271/4/Amazon_Stellantis.jpg\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbXMuYnVzaW5lc3N3aXJlLmNvbS9tZWRpYS8yMDIyMDEwNTAwNTYwOS9lbi8xMzE5MjcxLzQvQW1hem9uX1N0ZWxsYW50aXMuanBn&amp;key=0b1944e51cb733f1011b0120ab1cc8918f90189e1a6798dd7b37951cc2afc9434c0283278e476b89bb83daf29451b584eaf16272f4843d2e07c6006ffb329e34\"/></div></div><p style=\"font-size:85%\">Amazon and Stellantis today announced a series of global, multi-year agreements that will introduce new connected experiences across millions of vehicles. (Graphic: Business Wire)</p></div><p>\nStellantis will accelerate its shift to becoming a sustainable mobility tech company through this relationship, which involves Amazon Devices, Amazon Web Services (AWS), and Amazon Last Mile. Stellantis and Amazon will collaborate to deploy Amazon’s technology and software expertise across Stellantis’ organization, including vehicle development, building connected in-vehicle experiences, and training the next generation of automotive software engineers. Together, the two companies will create a suite of software-based products and services that seamlessly integrate with customers’ digital lives and add value over time through regular over-the-air (OTA) software updates.\n</p><p>\n\"Over the past two decades, Amazon has built the technology, expertise, and culture of innovation to be a world leader in cloud computing, artificial intelligence, and machine learning. We’ve used these capabilities to make life better for customers around the world through products and services like Alexa, Kindle, and Fire TV, and with AWS we’ve helped thousands of companies transform themselves and their industries. We’re excited to collaborate with Stellantis to transform the automotive industry and re-invent the in-vehicle experience,” said Andy Jassy, CEO of Amazon. “We are inventing solutions that will help enable Stellantis to accelerate connected and personalized in-vehicle experiences, so that every moment in motion can be smart, safe, and tailored to each occupant. Together, we will create the foundation for Stellantis to transform from a traditional automaker into a global leader in software-driven development and engineering.\"\n</p><p>\n“Working together with Amazon is an integral part of our capability building roadmap, based on both developing internal competencies and decisive collaborations with tech leaders, and it will bring significant expertise to one of our key technology platforms, STLA SmartCockpit,” said Carlos Tavares, CEO of Stellantis. “By leveraging artificial intelligence and cloud solutions, we will transform our vehicles into personalized living spaces and enhance the overall customer experience, making our vehicles the most wanted, most captivating place to be, even when not driving.”\n</p><p>\nThe collaboration brings together Amazon's leadership and innovation in digital experiences, cloud computing, artificial intelligence (AI), and machine learning with Stellantis’ automotive engineering excellence and portfolio of 14 iconic vehicle brands. Stellantis outlined its software strategy during its <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.stellantis.com%2Fen%2Finvestors%2Fevents%2Fsw-day-2021&amp;esheet=52558217&amp;newsitemid=20220105005609&amp;lan=en-US&amp;anchor=Software+Day&amp;index=3&amp;md5=157557aa283d699939c04a52a7ff469a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Software Day</a> program in December 2021.\n</p><p>\nThe collaboration will focus on several areas.\n</p><p>\n<b>STLA SmartCockpit\n<br/></b>Amazon and Stellantis will collaborate to deliver software for STLA SmartCockpit, which will run in millions of Stellantis vehicles globally starting in 2024. The software-defined platform will seamlessly integrate with customers’ digital lives to create personalized, intuitive in-vehicle experiences through AI-enhanced applications for entertainment, Alexa-enabled voice assistance, navigation, vehicle maintenance, ecommerce marketplaces, and payment services.\n</p><p>\nThe STLA SmartCockpit platform will use Amazon products and solutions that are purpose-built for vehicles, and Stellantis will have the flexibility to create custom, brand- and vehicle-specific capabilities. The software will offer curated services and experiences through an app store—all displayed through an intelligent, adaptive user interface design that presents timely, relevant information and features suited to each occupant’s individual needs and preferences.\n</p><p>\nSTLA SmartCockpit will adapt to customers’ behaviors and interests, wherever their passions take them–from the start of a journey at home, on the road, or off. For example, Chrysler Pacifica vehicles could offer a family-trip planner that recommends media content, points of interest, restaurants, and other fun stops along the route. Jeep® vehicles could come with a digital off-road “coach” to help customers calibrate the vehicle and optimize performance before tackling tough terrain.\n</p><p>\nIntegration with Amazon's leading smart home and security services will allow customers to proactively monitor and manage their homes while on the go. Stellantis customers will also be able to manage their vehicles from their Alexa-enabled devices at home or their Alexa smartphone app, including using custom Alexa skills to set the in-cabin temperature before getting into their vehicle, schedule service, or order accessories.\n</p><p>\nThe development work on STLA SmartCockpit will leverage <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.stellantis.com%2Fen%2Fnews%2Frecent-events%2Fmobile_drive_joint_venture&amp;esheet=52558217&amp;newsitemid=20220105005609&amp;lan=en-US&amp;anchor=Mobile+Drive%2C+the+joint+venture+formed+by+Stellantis+and+Foxconn&amp;index=4&amp;md5=f04aee0278c678fee6438ffac4fb9b62\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Mobile Drive, the joint venture formed by Stellantis and Foxconn</a> in 2021, to develop breakthrough digital cockpits and personalized connected services.\n</p><p>\n<b>Collaborative Engineering and Innovation\n<br/></b>As part of this multi-year engagement, Stellantis has selected AWS as its preferred cloud provider for vehicle platforms. Together, Stellantis and Amazon plan to build the next generation of cloud-enabled infrastructure for vehicle platforms, including for STLA SmartCockpit.\n</p><p>\nStellantis plans to migrate its current vehicle data pipeline across its brands and geographies into a cloud-based data mesh, making use of AWS’ advanced capabilities for scalable and durable real-time data streaming. By moving to an AWS-powered data mesh, Stellantis engineers can use the tools and interface that best suit each project. Stellantis also aims to accelerate the time to market for new digital products that leverage AWS machine learning to deliver greater personalization and more accurate predictive maintenance.\n</p><p>\nBoth companies are creating a cloud-based product development environment called the “Virtual Engineering Workbench,” which provides automated workflows to manage software development and testing, high-performance simulations, machine learning model training, and data collection and analysis.\n</p><p>\n<b>Innovation Hubs</b> <b>and Agile-Auto Software and Data Academy\n<br/></b>Stellantis recently announced the <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.stellantis.com%2Fcontent%2Fdam%2Fstellantis-corporate%2Fnews%2Fpress-releases%2F2021%2Fdecember%2F07-12-2021%2F8-00%2Fen%2F20211207_SWDay2021_Overview_EN.pdf&amp;esheet=52558217&amp;newsitemid=20220105005609&amp;lan=en-US&amp;anchor=launch+of+a+Software+Academy&amp;index=5&amp;md5=2cbeaf7a00f12e65a5e18b6e462b36ed\" data-type=\"url\" class=\"tr-link\" translate=\"no\">launch of a Software Academy</a> for the upskilling and reskilling of existing and new employees. As part of this, Stellantis and AWS also plan to launch a new global learning curriculum, called the Agile-Auto Software and Data Academy, which will cover software, data and cloud technology. Stellantis will also train more than 5,000 developers and engineers by 2024 in AWS-related cloud technologies to accelerate its transformation into a data-driven enterprise in the cloud.\n</p><p>\nTo further speed development activities and reduce time to market for new capabilities, Stellantis and AWS will launch a global network of AWS-powered Innovation Hubs where experts from both companies will innovate using the breadth and depth of AWS cloud services.\n</p><p>\n<b>Expanding Amazon’s Sustainable Delivery Network\n<br/></b>Stellantis has provided tens of thousands of Light Commercial Vehicles (LCVs) to Amazon since 2018 to support its last mile operations in North America and Europe with vehicles including Ram ProMaster, Fiat Ducato, and Peugeot and Citroën LCVs.\n</p><p>\nIn support of The Climate Pledge and its commitment to be net-zero carbon by 2040, Amazon is transforming its last-mile operations with new sustainable solutions. As part of a separate agreement with Stellantis, Amazon will be the first commercial customer for Stellantis’ new Ram ProMaster Battery Electric Vehicle (BEV) launching in 2023. Stellantis, with input from Amazon, designed the vehicle with unique last mile delivery features and Amazon will deploy the vehicles to routes across the United States. Building on the current relationship and as part of the long-term agreement, Stellantis and Amazon will be putting thousands of BEV ProMasters on the road every year.\n</p><p>\n<b>Building from a Strong Foundation\n<br/></b>Today’s announcement expands on existing areas of collaboration between Stellantis and Amazon. Stellantis was the first automaker to integrate the <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fmedia.stellantisnorthamerica.com%2Fnewsrelease.do%3Fid%3D22562%26mid%3D1&amp;esheet=52558217&amp;newsitemid=20220105005609&amp;lan=en-US&amp;anchor=Amazon+Fire+TV+experience&amp;index=6&amp;md5=c6258fc77e867f337605f675e22fa44e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Fire TV experience</a><span class=\"bwuline\"> </span>with the release of the all-new 2022 Wagoneer and Grand Wagoneer, and will bring this same in-vehicle entertainment experience to Jeep Grand Cherokee and Chrysler Pacifica. Stellantis was also the first automotive OEM to announce plans to implement <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fmedia.stellantisnorthamerica.com%2Fnewsrelease.do%3Fid%3D22452%26mid%3D&amp;esheet=52558217&amp;newsitemid=20220105005609&amp;lan=en-US&amp;anchor=Alexa+Custom+Assistant&amp;index=7&amp;md5=5398d8bbefba507e5f14854f8fd36ee7\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Alexa Custom Assistant</a><span class=\"bwuline\">, </span>a solution which makes it possible to create custom, intelligent AI and voice-driven experiences built on Alexa technology. Today, Stellantis also offers the Alexa Built-in voice experience in its vehicles around the world, making it easy to navigate, play music, listen to podcasts and audiobooks, make calls, manage calendars, hear the news, check the weather, control smart home devices, and more—just by asking Alexa.\n</p><p>\n<b>About Amazon\n<br/></b>Amazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2F&amp;esheet=52558217&amp;newsitemid=20220105005609&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=8&amp;md5=d68a9412ccfcca9ff09875daeba24ed1\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p>\n<b>About Amazon Web Services\n<br/></b>For over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 84 Availability Zones within 26 geographic regions, with announced plans for 24 more Availability Zones and eight more AWS Regions in Australia, Canada, India, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com&amp;esheet=52558217&amp;newsitemid=20220105005609&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=9&amp;md5=e81ff91998c0933a413e9c980c1fe6e5\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<b>About Stellantis\n<br/></b>Stellantis (NYSE / MTA / Euronext Paris: STLA) is one of the world’s leading automakers and a mobility provider, guided by a clear vision: to offer freedom of movement with distinctive, affordable and reliable mobility solutions. In addition to the Company’s rich heritage and broad geographic presence, its greatest strengths lie in its sustainable performance, depth of experience and the wide-ranging talents of employees working around the globe. Stellantis leverages its broad and iconic brand portfolio, which was founded by visionaries who infused the marques with passion and a competitive spirit that speaks to employees and customers alike. Stellantis aspires to become the greatest, not the biggest while creating added value for all stakeholders as well as the communities in which it operates. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.stellantis.com%2Fen&amp;esheet=52558217&amp;newsitemid=20220105005609&amp;lan=en-US&amp;anchor=stellantis.com&amp;index=10&amp;md5=99156b06de3fc76526276e7ed0859b30\" data-type=\"url\" class=\"tr-link\" translate=\"no\">stellantis.com</a>.\n</p><p>\n<b>Forward-Looking Statements\n<br/></b><span>This communication contains forward-looking statements. In particular, statements regarding future events and anticipated results of operations, product and business strategies, the anticipated benefits of the proposed collaboration, future financial and operating results, the anticipated dates for product introductions and other anticipated aspects of our operations or operating results are forward-looking statements. These statements may include terms such as “may”, “will”, “expect”, “could”, “should”, “intend”, “estimate”, “anticipate”, “believe”, “remain”, “on track”, “design”, “target”, “objective”, “goal”, “forecast”, “projection”, “outlook”, “prospects”, “plan”, or similar terms. Forward-looking statements are not guarantees of future performance. Rather, they are based on the parties’ current state of knowledge, future expectations and projections about future events and are by their nature, subject to inherent risks and uncertainties. They relate to events and depend on circumstances that may or may not occur or exist in the future and, as such, undue reliance should not be placed on them.</span>\n</p><p>\n<span>Actual results may differ materially from those expressed in forward-looking statements as a result of a variety of factors, including: uncertainties as to whether the benefits of the proposed collaboration discussed in this document will be realized or as to the timing thereof; the satisfaction of the conditions precedent to consummation of proposed transactions, at all or in a timely manner; the risk that the businesses of the parties will be adversely impacted during the pendency of the proposed collaboration; the ability of Stellantis to successfully integrate the Amazon and AWS’ offerings; business disruptions; the ability to retain and hire key personnel and maintain relationships with customers, suppliers and others with whom the companies do business; the impact of the COVID-19 pandemic, the ability of Stellantis to launch new products successfully and to maintain vehicle shipment volumes; changes in the global financial markets, general economic environment and changes in demand for automotive products, which is subject to cyclicality; changes in local economic and political conditions, changes in trade policy and the imposition of global and regional tariffs or tariffs targeted to the automotive industry, the enactment of tax reforms or other changes in tax laws and regulations; Stellantis’ ability to expand certain of their brands globally; its ability to offer innovative, attractive products; its ability to develop, manufacture and sell vehicles with advanced features including enhanced electrification, connectivity and autonomous-driving characteristics; various types of claims, lawsuits, governmental investigations and other contingencies, including product liability and warranty claims and environmental claims, investigations and lawsuits; material operating expenditures in relation to compliance with environmental, health and safety regulations; the intense level of competition in the automotive industry, which may increase due to consolidation; exposure to shortfalls in the funding of Stellantis’ defined benefit pension plans; the ability to provide or arrange for access to adequate financing for dealers and retail customers and associated risks related to the establishment and operations of financial services companies; the ability to access funding to execute Stellantis’ business plans and improve its businesses, financial condition and results of operations; a significant malfunction, disruption or security breach compromising information technology systems or the electronic control systems contained in Stellantis’ vehicles; Stellantis’ ability to realize anticipated benefits from joint venture arrangements; disruptions arising from political, social and economic instability; risks associated with Stellantis’ relationships with employees, dealers and suppliers; increases in costs, disruptions of supply or shortages of raw materials, parts, components and systems used in Stellantis’ vehicles; developments in labor and industrial relations and developments in applicable labor laws; exchange rate fluctuations, interest rate changes, credit risk and other market risks; political and civil unrest; earthquakes or other disasters; and other risks and uncertainties.</span>\n</p><p>\n<span>Any forward-looking statements contained in this communication speak only as of the date of this document and Stellantis and Amazon disclaim any obligation to update or revise publicly forward-looking statements. Further information concerning the companies and their businesses, including factors that could materially affect their financial results, is included in their respective reports and filings with the U.S. Securities and Exchange Commission and, with respect to Stellantis, AFM.</span>\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20220105005609r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjIwMTA1MDA1NjA5cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=eba92dbc6c968b1d1551a1814a6862135d8faba2269d54abc85b58427fc949983b225fbfc125bdb7b8c9bd4196b057e1e61460840fc68c6d23ba1665d3adc7c4\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20220105005609/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220105005609/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52558217&amp;newsitemid=20220105005609&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=11&amp;md5=12086f13d5b35ee929cffd73ef865267\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2022</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON</p></div>"}