{"date": "2021-11-16 18:51:26.595000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Mumbai</p></div><div class=\"tr-npp-lead\"><p>Mumbai, Nov. 17 -- A key part of a Singapore tribunal's order will be the mainstay of Amazon.com Inc.'s legal defence against allegations by directors of Future Retail Ltd (FRL) that the e-commerce giant hid facts to secure antitrust approval for a 2019 deal to buy a stake in a Future Group company that gave it an indirect stake in FRL.</p><p>The US online retailer is looking to present its case before the Supreme Court during a scheduled hearing on 23 November, two people familiar with Amazon's latest plan said on condition of anonymity, adding that the legal team is drafting a fresh argument over the Competition Commission of India's (CCI's) approval.</p></div><div class=\"tr-npp-body\"><p>Amazon's legal strategy to prove that its purchase of a 49% stake in Future Coupons Pvt. Ltd (FCPL) in November 2019 is above board is crucial to its plan to block Future Group's Rs.24,713 crore sale of retail and wholesale assets to Reliance Industries Ltd.</p><p>On Tuesday, the Delhi high court ruled that CCI has two weeks to decide whether Amazon misled authorities while seeking approval for a 2019 deal with India's Future Group. That gives the antitrust regulator time till the end of November.</p><p>According to the two people cited above, Amazon may use a key point in Singapore International Arbitration Centre's (SIAC's) latest ruling as a \"critical\" part of its argument before the Supreme Court to refute Future Group's plea to revoke the CCI approval given to Amazon for its deal with FCPL.</p><p>Following a hearing before CCI in August on the allegations mentioned above, the independent directors of Future Retail wrote to CCI on 8 November, demanding revocation of the approval given to Amazon for the FCPL stake acquisition worth Rs.1,431 crore.</p><p>The people cited above said since FCPL is a promoter entity in FRL, Amazon's 49% stake in FCPL gives Amazon preventive rights in FRL, especially regarding any possible alliance between FRL and other retail players, including those owned by Reliance Industries. However, Future Group claims that by interfering in the Future-RIL deal, Amazon is trying to act as the controller of FRL.</p><p>Mint has seen a copy of the SIAC ruling, whose details are confidential.</p><p>SIAC has held two weeks ago in a detailed ruling that Amazon's acquisition of 49% stake in FCPL cannot be construed as an intention by Amazon to gain control in FRL and, hence, Future Group is wrong in questioning the CCI approval given to Amazon in 2019. \"Rather than writing to CCI, Amazon has chosen the Supreme Court as appropriate platform,\" said the first person.</p><p>The SIAC ruling, which is kept private so far, reads, \"...significant emphasis has also been placed by FRL on various filings made by Amazon before the CCI, particularly two responses filed by Amazon on 15 November 2019....The proceedings before the CCI were concerned with public policy issues, particularly on whether or not the transaction would cause an appreciable adverse effect on competition in the relevant market in India...Considering the context of Amazon's submissions before the CCI...the tribunal considers that FRL has not established that Amazon has been speaking inconsistently before the CCI and in this arbitration. In the circumstances, the tribunal does not accept FRL's contentions. What Amazon has acquired in the present case are negative and protective rights. They do not amount to control.\"</p><p>\"As the Indian Supreme Court has explained in ArcelorMittal India (P) Ltd v Satish Kumar Gupta (2019), control, according to the definition, is a proactive and not a reactive power. It is a power by which an acquirer can command the target company to do what he wants it to do,\" said the SIAC ruling.</p><p>\"In the tribunal's view, the rights that Amazon has acquired do not put it in the metaphorical driving seat,\" reads the SIAC ruling.</p><p>The two people cited above said this part of the SIAC ruling would form the basis of Amazon's argument before the Supreme Court, which had earlier held that SIAC's ruling is valid and enforceable in India as per the country's arbitration and reconciliation laws.</p><p>A Future Group spokesman said the \"purported facts are grossly untrue\", in response to Mint's queries on the SIAC ruling. The Future Group spokesman said an internal email from Rakesh Bakshi, head, legal and assistant general counsel, Amazon India, to Jeff Bezos (founder of Amazon) reveals how Amazon viewed and planned to enforce its agreements.</p><p>\"The documents lay bare how Amazon's intended to circumvent Indian laws that restrict it from having any rights in retail entities in India through a 'twin-entity structure'. This disclosure can result in cancellation of approvals given for Amazon's transactions with Future Group companies, acquisition of More retail network and other networks and commensurate fines and penalties can be levied by Enforcement Directorate and other bodies. It also shows how-for a measly value of $41 million (about Rs.280 crore) as detailed by its own calculations-Amazon is holding ransom a Rs.24,500 crore Future Group -Reliance transaction that can bring relief to banks, lenders, operational creditors and employees of Future Group,\" said the Future Group spokesman.</p><p>An Amazon spokesperson did not respond to a query seeking comment.</p><p>On 8 November, Future Retail filed a special leave petition before the Supreme Court against Delhi high court's 29 October interim order on the SIAC verdict.</p><p>On 29 October, the Delhi high court rejected Future Retail's plea to stay the 21 October interim order passed by SIAC, the Singapore arbitration court. The high court has asked Amazon to respond to the matter and has scheduled the next hearing for 4 January. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}