{"date": "2022-02-03 13:43:04+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3023.87, "close": 2776.91}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>WONDR GAMING CORP (\"WDR-Z;WDRGF-0\")\n- And Toronto Raptors Fred VanVleet &amp; Chris Boucher partner with\n- Samsung to showcase Samsung Odyssey monitor and SSD for gamers\n\n     Wondr Gaming Corp. (the \"Company\" or \"Wondr Gaming\") and Toronto\nRaptors Fred VanVleet and Chris Boucher partner with Samsung to host a Call\nof Duty Warzone Plunder challenge on Twitch, facing off with Wondr C.O.D.\nstreamers to promote the Samsung Odyssey monitor and SSD (solid state\ndrive) for gamers.\n\n     As part of the strategic partnership, Samsung also leverages Wondr's\nShorty Awards nominated production studio, with distribution across\nGamelancer, the fastest growing gaming network on social media and the\nlargest global gaming network on TikTok, with 20+ owned and operated\nchannels, featuring over 1 billion monthly views and 25,000,000+ followers.\nWondr recently signed a non-binding LOI to acquire Gamelancer.\n\n     Key terms of the activation include:\n\n//st\n\n  * 2 1/2 hour live stream on Twitch\n  * Unboxing videos on Instagram, Facebook, and YouTube\n  * Social posts on TikTok, Instagram, and Facebook\n  * Custom videos across Gamelancer's TikTok and Instagram channels\n\n//et\n\n     \"It's an honor to welcome Samsung to the Wondr family and to pair them\nwith Wondr brand ambassadors Fred VanVleet and Chris Boucher,\" said Rob\nFrohling, Wondr Gaming's Chief Revenue Officer. \"As we push ourselves every\nday to discover new and disruptive ways to reach Millennial and Gen Z\ngamers, this opportunity allows us to emotionally connect our audience of\n25,000,000+ gamers with Samsung, the world's leader in gaming monitors.\"\n\n     About Wondr Gaming\n\n    Wondr Gaming Corp, a publicly traded entertainment company on the Canadian\nSecurities Exchange builds partnerships and fosters community within the\nesports, professional sports, and music industries through loyalty &amp;\nrewards, NFTs, and media business. Wondr Gaming generates revenue through\nbrand partnerships hosted on its loyalty platform, the sale of NFTs focused\non esports, professional sports and the music industry, and through direct\nmedia and programmatic sales hosted on GameLancer's 20+ owned and operated\nchannels, featuring over 1 billion monthly views and 25,000,000+ followers.\n\n     Neither the Canadian Securities Exchange nor its Market Regulator (as\nthat term is defined in the policies of the Canadian Securities Exchange)\naccepts responsibility for the adequacy or accuracy of this release.\n\n     Forward Looking Information\n\n    This news release contains forward-looking statements and forward-looking\ninformation within the meaning of applicable securities laws. These\nstatements relate to future events or future performance. All statements\nother than statements of historical fact may be forward-looking statements\nor information. More particularly and without limitation, this news release\ncontains forward-looking statements and information relating to the\ncompletion of the potential transaction and other matters. The\nforward-looking statements and information are based on certain key\nexpectations and assumptions made by management of the Company. Although\nmanagement of the Company believes that the expectations and assumptions on\nwhich such forward-looking statements and information are based are\nreasonable, undue reliance should not be placed on the forward-looking\nstatements and information since no assurance can be given that they will\nprove to be correct.\n\n     Forward-looking statements and information are provided for the\npurpose of providing information about the current expectations and plans\nof management of the Company relating to the future. Readers are cautioned\nthat reliance on such statements and information may not be appropriate for\nother purposes, such as making investment decisions. Since forward-looking\nstatements and information address future events and conditions, by their\nvery nature they involve inherent risks and uncertainties. Actual results\ncould differ materially from those currently anticipated due to a number of\nfactors and risks.  Risks that may have an impact on the ability for these\nevents to be achieved include completion of due diligence, negotiation of\ndefinitive agreements and receipt of applicable approvals.  Accordingly,\nreaders should not place undue reliance on the forward-looking statements\nand information contained in this news release. Readers are cautioned that\nthe foregoing list of factors is not exhaustive. The forward-looking\nstatements and information contained in this news release are made as of\nthe date hereof and no undertaking is given to update publicly or revise\nany forward-looking statements or information, whether as a result of new\ninformation, future events or otherwise, unless so required by applicable\nsecurities laws. The forward-looking statements or information contained in\nthis news release are expressly qualified by this cautionary statement.\n\nFor further information: Jon Dwyer, Chairman and Chief Executive Officer,\nBill Mitoulas, Investor Relations, (416) 479-9547.\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203300160.MNPRE2203301031-05405220220203</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}