{"date": "2022-02-24 05:55:36+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds comment from Smalls and Amazon</p><p class=\"tr-by\">By Jeffrey Dastin and Julia Love</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Feb 23 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> labor organizer Christian Smalls was arrested on Wednesday, accused of trespassing when he delivered warehouse workers food as part of a high-profile union campaign he is leading.</p><p>Smalls, a former Amazon employee, and two other individuals have been charged with obstructing governmental administration, said Lt. John Grimpel of the New York City Police Department, adding that Smalls was also charged with resisting arrest and trespassing.</p><p>The other two individuals were Amazon workers, an advocacy group said. Smalls said all three were later released, adding that he disputed the charges and would continue his battle in court.</p><p>Amazon spokesperson Kelly Nantel said Smalls has \"repeatedly trespassed despite multiple warnings.\" The company had not contacted the police about its own employees.</p><p>Thirty-three year-old Smalls' quest to make Amazon's JFK8 Staten Island warehouse a unionized facility will come to a head when workers vote starting March 25.</p><p>A second closely watched election is currently occurring at Amazon's Bessemer, Alabama warehouse, with vote-by-mail being accepted until March 25 and the vote count starting March 28. Last year, workers at that warehouse voted against unionizing.</p><p>A majority vote to unionize at either facility would mark Amazon's first organized workplace in the United States and a milestone for those seeking to invigorate the American labor movement.</p><p>Reached by phone, Smalls said he brought food on Wednesday afternoon for current employees to distribute, something he has done for months. The break-room meals are the ALU's chance to share literature and build relationships with workers, he said.</p><p>But this time, Smalls said the Amazon manager who had fired him two years ago told him to leave, later calling the police.</p><p>\"I'm literally a visitor. Do y'all call police on taxi drivers and Uber drivers who wait for associates?\" Smalls said, adding Amazon wanted to \"increase the intimidation factor\" through his arrest. Amazon had no immediate comment on Smalls' claim.</p><p>His clashes with Amazon date back to March 2020 when the company terminated him for protesting at JFK8 despite being on a paid quarantine. Smalls then sued Amazon, alleging it fired him because he is Black and had opposed discriminatory COVID-19 policies. A federal judge dismissed the complaint this month. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2UJ00Y\" data-type=\"storyId\" data-story-id=\"nL1N2UJ00Y\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Sienna Fontaine, general counsel for advocacy organization Make the Road New York, said: \"The people that Amazon is throwing in jail are fighting for better working conditions and should be treated with respect and dignity.\"</p><p>Smalls said the arrest would not stop him from organizing at the warehouse.</p><p>\"I’m on my way there now,\" he said, shortly before 10 p.m. Eastern Time. \"I’m going to bring more food for the night shift.\"</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Jeffrey Dastin in Palo Alto, Calif., and Julia Love in San Francisco; Editing by Kenneth Maxwell and Shivani Singh)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Jeffrey.Dastin@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Jeffrey.Dastin@thomsonreuters.com</a> ; +1 424 434 7548; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-UNION/ARRESTS (UPDATE 1, PIX)</p></div>"}