{"date": "2022-02-01 07:10:41.661000+00:00", "ticker": "III", "mrkt_info": {"open": 1370.0, "close": 1396.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 2272A3i Infrastructure PLC01 February 2022</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>1 February 2022</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>3i Infrastructure plc - Q3 Performance update</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>A busy period of investment activity; portfolio continues to perform well.</p>\n<p>3i Infrastructure plc ('3i Infrastructure' or the 'Company') is an investment company whose purpose is to invest responsibly in infrastructure, delivering long-term sustainable returns to shareholders and having a positive impact on our portfolio companies and their stakeholders. This statement relates to the period from 1 October 2021 to 31 December 2021 (the 'Period').</p>\n<p>\n<span>Highlights</span>\n</p>\n<p>\n<span>·</span>\n<span>New investment commitments of c.£850m:</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>-</span> On 17 November 2021, 3i Infrastructure agreed to invest c.£376 million to acquire 100% of Global Cloud Xchange ('GCX'). GCX is a leading global data communications service provider and owns one of the world's largest private subsea fibre optic networks</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>-</span> On 3 December 2021, the Company agreed to acquire the 50% stake in ESVAGT owned by its co-investor AMP Capital for c.£258 million. 3i Infrastructure will hold 100% of the equity in ESVAGT upon completion which is expected to take place on 1 February 2022</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>-</span> On 14 December 2021, 3i Infrastructure completed the c.£191 million acquisition of a 92% stake in SRL Traffic Systems ('SRL'), the market leading traffic management equipment rental company in the UK</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>-</span> On 16 December 2021, the Company agreed to invest a further c.£21 million into Valorem through a capital increase to fund its growth, raising the Company's stake in Valorem to c.33%</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>Successful realisation of Oystercatcher's four European terminals:</span> On 29 October 2021, the Company completed the sale of its 45% stakes in four European liquid storage terminals for proceeds of c.€55 million after debt repayment. 3i Infrastructure continues to hold a 45% stake in Oiltanking Singapore</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>Portfolio performing well against the expectations we set in September 2021</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>Income as expected in the Period:</span> Total income and non-income cash was in line with expectations at £26 million. This compares with £24 million of income and non-income cash received in the same period last year</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>On-track to meet FY22 dividend target</span> of 10.45 pence per share, a year-on-year increase of 6.6%</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>Increase in credit facilities</span> : In December, the Company received lender approval to increase its existing Revolving Credit Facility ('RCF') by £200 million to £600 million. In January 2022, the Company obtained an additional one-year credit facility of £400 million from existing lenders. Aggregate credit facilities now total £1 billion.</p>\n<p>\n<span>Phil White, Managing Partner and Head of Infrastructure, 3i Investments plc, Investment Manager of the Company, commented: \"This was a very busy period of investment activity. We are delighted with our new investments in GCX and SRL, both in growth sectors with strong market positions. Increasing our stake in ESVAGT to 100% and our injection of additional capital into Valorem will benefit the Company from further growth in those platforms.</span>\n<span>Overall, the portfolio has seen</span>\n<span>strong performance since the beginning of the financial year, and has met our income expectations. We have increased our credit facilities to ensure that we continue to have ample liquidity to make further new investments.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Portfolio update</span>\n</p>\n<p>Overall the portfolio has performed well in the Period <span>, meeting or exceeding the expectations we set in September 2021.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>On 29 October 2021, the Company completed the sale of its 45% stakes in four European liquid storage terminals to Evos who also acquired the 55% stakes in the terminals held by co-shareholder Oiltanking GmbH. The proceeds from the transaction were used to repay debt and related break costs of the holding company, Oystercatcher. The balance of the proceeds of c.€55 million was distributed to the Company.</p>\n<p>\n<span>On 17 November 2021, the Company agreed to invest c.£376 million to acquire a 100% stake in GCX and partner with GCX's management team to invest in a leading platform in the sector, with the ambition to increase the utilised capacity on GCX's existing routes as well as to add new routes and customers. GCX provides high-bandwidth connectivity, an essential service to a range of blue-chip customers including hyperscalers, telecommunications operators, new media providers and enterprises. Its 66,000km of cables span 46 countries from North America to Asia, with a particularly strong position on the Europe-Asia and Intra-Asia routes. Co</span> mpletion is subject to certain regulatory approvals and is expected mid-2022.</p>\n<p>\n<span>\n</span></p>\n<p>On 3 December 2021, the Company agreed to acquire the 50% stake in ESVAGT owned by its co-investor AMP Capital for c.£258 million. Upon completion, which is expected to occur on 1 February 2022, 3i Infrastructure will hold 100% of the equity in ESVAGT. The acquisition will allow the Company to benefit from the rapid growth in the offshore wind market as many European governments and US states have set ambitious offshore wind build-out targets as part of their wider net-zero emissions plans.</p>\n<p>On 14 December 2021, 3i Infrastructure completed the acquisition of a 92% stake in SRL for c.£191 million. Management has re-invested to acquire the remaining 8% stake. The Company has provided a further £83 million of debt financing to SRL with the intention of replacing this with third party debt in due course. SRL is the market leading traffic management equipment rental company in the UK and is headquartered in Cheshire. It owns a fleet of almost 13,000 items of traffic management equipment, which it rents to local authorities, utilities, contractors and traffic management companies from a nationwide network of depots.</p>\n<p>On 16 December 2021, 3i Infrastructure announced that it had agreed to invest a further c.€25 million into Valorem through a capital increase to fund its growth, raising the Company's stake in Valorem to c.33%. This funding will support the continued growth in Valorem's installed base of operational assets and development pipeline. Valorem is well positioned to benefit from France's ambition to increase renewable energy generation to 40% (from 27% currently) by 2030 and from ambitious renewable power development programmes in Finland and Greece. This investment completed on 17 December 2022.</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Balance sheet</span>\n</p>\n<p>At 31 December 2021, the Company's cash balance was £86 million, with drawings of £70 million under the RCF. This cash balance was subsequently reduced by payment of the interim dividend of £47 million in January 2022.</p>\n<p>In December 2021, 3i Infrastructure received lender approval to increase the RCF by £200 million to £600 million. In January, the Company obtained an additional one-year credit facility of £400 million from existing lenders. Aggregate credit facilities therefore total £1 billion today.</p>\n<p>We have rolled the outstanding balance on the vendor loan note due from the sale of WIG in 2019. The Company received £12 million of accrued interest in December 2021, leaving £98 million of deferred proceeds due in December 2023 and callable on 6 weeks' notice.</p>\n<p>- Ends -</p>\n<p>For information, please contact:</p>\n<p>\n<span>\n</span></p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>Thomas Fodor</p>\n</td>\n<td>\n<p>Shareholder enquiries</p>\n</td>\n<td>\n<p>+44 20 7975 3469</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Kathryn van der Kroft</p>\n</td>\n<td>\n<p>Media enquiries</p>\n</td>\n<td>\n<p>+44 20 7975 3021</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>About 3i Infrastructure plc</p>\n<p>\n<span>3i Infrastructure plc is a Jersey-incorporated, closed-ended investment company, an approved UK Investment Trust, listed on the London Stock Exchange and regulated by the Jersey Financial Services Commission.</span>\n<span>The Company's purpose is to invest responsibly in infrastructure, delivering long-term sustainable returns to shareholders and having a positive impact on our portfolio companies and stakeholders.</span>\n</p>\n<p>\n<span>3i Investments plc, a wholly-owned subsidiary of 3i Group plc, is authorised and regulated in the UK by the Financial Conduct Authority and is the investment manager of 3i Infrastructure plc.</span>\n</p>\n<p>\n<span>This press release is not for distribution (directly or indirectly) in or to the United States, Canada, Australia or Japan and is not an offer of securities for sale in or into the United States, Canada, Australia or Japan. Securities may not be offered or sold in the United States absent registration under the U.S. Securities Act of 1933, as amended (the \"Securities Act\"), or an exemption from registration under the Securities Act. Any public offering to be made in the United States will be made by means of a prospectus that may be obtained from the issuer or selling security holder and will contain detailed information about 3i Group plc, 3i Infrastructure plc, 3i India Infrastructure Fund and management, as applicable, as well as financial statements. No public offering in the United States is currently contemplated.</span>\n</p>\n<p>\n<span>This statement aims to give an indication of material events and transactions that have taken place in the period from 1 October 2021 to 31 December 2021 and their impact on the financial position of 3i Infrastructure plc. These indications reflect the Board's current view. They are subject to a number of risks and uncertainties and could change. Factors which could cause or contribute to such differences include, but are not limited to, general economic and market conditions and specific factors affecting the financial prospects or performance of individual investments within the portfolio of 3i Infrastructure plc.</span>\n</p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>UPDWPUBGGUPPGBG</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}