{"date": "2022-02-15 16:11:34.529000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">Vitech Releases Next-Generation ClaimsCenter Solution For Future-Focused Claims Management</p>\n<p>NEW YORK, Feb. 15, 2022</p>\n<p>\n<span>NEW YORK</span> , <span>Feb. 15, 2022</span> /CNW/ -- Vitech Systems Group, a leading provider of cloud-native administrative software, today announced the release of its next-generation ClaimsCenter solution, a cloud-native, customer-centric claims application for future-focused, end-to-end claims management.</p>\n<p>\n\n</p>\n<p>ClaimsCenter includes optimized capabilities to streamline claims operations and provides an efficient, intuitive experience with out-of-the-box support for the full range of group benefits products. ClaimsCenter leverages the robust enterprise features of V3locity, Vitech's cloud-native administration, engagement, and analytics platform, to modernize claims administration.</p>\n<p>\"To elevate stakeholder satisfaction and significantly impact profitability, insurers must expedite claims turnaround and incorporate real-time data and omnichannel capability for the heightened customer journeys today's consumers expect,\" said <span>Ali Kheirolomoom</span> , Vitech's Chief Product Officer. \"Designed with decades of group benefits knowledge, ClaimsCenter uses advanced analytics and configurable technology to adapt quickly and optimize outcomes for different claims scenarios.\"</p>\n<p>ClaimsCenter is part of V3locity's transformative suite of complementary applications that offers full life-cycle business functionality and robust enterprise capabilities. V3locity combines modern and proven core administration with a revolutionary digital experience. Its modular design enables flexible, agile deployment strategies. V3locity employs an advanced, cloud-native architecture that leverages the unique capabilities of AWS to deliver a solution with unparalleled security, scalability, and resiliency.</p>\n<p>\n<span>About Vitech</span>\n<span>\n<span>®</span>\n</span>\n</p>\n<p>Vitech is a global provider of cloud-native benefit and investment administration software. We help our Insurance, Retirement, and Investment clients expand their offerings and capabilities, streamline their operations, gain analytical insights, and transform their engagement models. Vitech employs over 1,600 professionals, serving the world's most successful insurance, retirement, and investment organizations. An innovator and visionary, Vitech's market leadership has been recognized by industry experts, such as Gartner, Celent, Aite-Novarica, and ISG. For more information, please visit <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3444480-1&amp;h=1509700986&amp;u=http%3A%2F%2Fwww.vitechinc.com%2F&amp;a=www.vitechinc.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.vitechinc.com</a>\n</span> .</p>\n<p>View original content to download multimedia: <a href=\"https://www.prnewswire.com/news-releases/vitech-releases-next-generation-claimscenter-solution-for-future-focused-claims-management-301482743.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/vitech-releases-next-generation-claimscenter-solution-for-future-focused-claims-management-301482743.html</a>\n</p>\n<p>SOURCE Vitech Systems Group</p>\n<p>View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/February2022/15/c2274.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/February2022/15/c2274.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}