{"date": "2022-01-24 17:11:26.626000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>LEANLIFE HEALTH INC (\"LLP-Z;LNLHF-0\")\n- Closes First Tranche of Private Placement\n\n     LeanLife Health Inc. (the \"Company\" or \"LeanLife\"), is pleased to\nannounce that it has closed a first tranche of a Non-Brokered private\nplacement up to $1,000,000 (the \"Offering\") issuing a total of 7,300,000\nUnits at a price of $0.05 per Unit for aggregate proceeds of $365,000.\n\n     Each Unit is comprised of one common share (a \"Share\") and one-half a\ntransferrable Share purchase warrant (a \"Warrant\") of the Company. Each\nFull Warrant will entitle the holder to purchase an additional Share at a\nprice of $0.075 per for a 2-year period after the Closing Date. All the\nsecurities issued are subject to a four month and a day hold period from\nthe date of issuance (the \"Warrant Expiry Date\").\n\n     Following the expiry of the resale restrictions on the Units, If the\ndaily volume weighted average price of the Company's Shares on the Canadian\nSecurities Exchange (\"CSE\") is C$0.20 per share or greater for any 10\nconsecutive trading days during the period where the Warrants are\noutstanding, the Company may, by written notice to the holder or by issuing\na news release, accelerate the Warrant Expiry Date of the Warrants to be 30\ndays following the date of such notice or news release.\n\n     In connection with the closing of the first tranche of the Offering,\nthe Company will pay finder's fees totalling $27,000 in cash, and will\nissue 540,000 finders warrants.  Each Finders Warrant shall be exercisable\nfor a Common share at a price of Cdn$0.075 for a period of two years from\nthe issue date and will be subject to an accelerated expiry provision.\n\n     This news release does not constitute an offer of securities for sale\nin the United States. The securities &amp;#8206;being offered have not been,\nnor will they be, registered under the United States Securities Act of\n&amp;#8206;&amp;#8206;1933, as amended, and such securities may not be offered or\nsold within the United States absent U.S. &amp;#8206;registration or an\napplicable exemption from U.S. registration requirements.&amp;#8206;\n\n     The Company intends to use the proceeds raised from the Offering for\nGeneral capital purposes &amp;  towards the Licensing agreement/product\npurchase orders with Foodcare for Mike Tyson Endorsed Iron Energy Drinks.\n\n     About LeanLife Health Inc.\n\n     We are excited to be rolling out the Mike Tyson endorsed Iron Energy\nDrinks into the soft drink market across the United States in 2022.\n\n     Our team is working diligently to launch Amazon and convenience store\nsales of Iron Energy Drinks (endorsed by Mike Tyson) across the\nUniPlacements.\n\n     New initiatives have driven our team to incorporate more products to\ndiversify our offerings and enrich shareholder value.\n\n     The Company also has engaged a team with global expertise in Omega-3\nscience and production, energy drink sales, and direct-to-consumer\nmarketing. Our professionals are working to ensure our Omega-3 flaxseed oil\nis the healthiest, most stable, and the most convenient available today.\n\n     LeanLife Health Inc. was born from a desire to offer high-quality\nOmega-3 plant-based oils to the world. Evidence of over 50 years supports\nthe numerous health benefits of flaxseed Omega-3 alpha-linolenic acid.\nLeanLife Health recognized that over 50% of North Americans do not consume\nenough Omega-3 fats and eat far too many Omega-6 fats. Our Omega-3 flaxseed\nformulation is stable for 2 years which will allow more food companies to\nadd the oil to their products and more consumers to meet their nutritional\nneeds. Proprietary methods initially developed at a Polish University in\n2007 have been continuously improved upon to result in the most\nnutritionally stable plant-based Omega-3 oils that are on the market today.\n\nFor more information, visit our website at <a href=\"https://www.leanlifehealth.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.leanlifehealth.com</a>/\nor contact:\n\n     Anis Barakat, CEO\n(416) 669-4303\nanis@leanlifehealth.com\n\n     Neither the Canadian Securities Exchange nor its Regulation Services\nProvider (as that term is defined in the policies of the CSE) accepts\nresponsibility for the adequacy or accuracy of this news release.\n\n     Cautionary Note Regarding Forward-Looking Statements\n\n     This release contains certain \"forward looking statements\" and certain\n\"forward-looking information\" as defined under applicable Canadian\nsecurities laws. Forward-looking statements and information can generally\nbe identified by the use of forward-looking terminology such as \"may\",\n\"will\", \"expect\", \"intend\", \"estimate\", \"upon\" \"anticipate\", \"believe\",\n\"continue\", \"plans\" or similar terminology. Forward-looking statements and\ninformation include, but are not limited to, statements with respect to the\ngross proceeds anticipated to be received under the First Tranche Private\nPlacement; the future exercise of any Warrants issued under the First\nTranche Private Placement; the future price of the Company's common shares\non the CSE; the future exercise by the Company of its right to accelerate\nthe Warrant Expiry Date; the approval of the CSE of the First Tranche\nPrivate Placement.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2202300502.MNPRE2202301541-06245220220124</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}