{"date": "2021-11-29 22:05:25.063000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Fake survey scams have been cropping up as shoppers pounce on Black Friday and Cyber Monday deals, the Better Business Bureau warns.</p><p>Scammers send you a text message that appears to be from a well-known chain store offering a free product, discount or gift card to anyone who completes a survey, according to a news release by the BBB. Many of them state that it is a limited-time offer so you'll need to act fast if you want to receive your gift, the BBB says.</p></div><div class=\"tr-npp-body\"><p>If you click the link, instead of going onto the store's official website, it will take you to a third-party website where you'll be asked to fill out a form with personal information, such as your full name, address, email and more, the BBB adds.</p><p>By clicking on the link, you may even download malware onto your device, giving scammers access to even more personal information.</p><p>While this scam has a Black Friday and Cyber Monday twist, the BBB advises that you watch out for similar survey scams this entire holiday season. <span> </span></p><p class=\"tr-npp-section-title\">Amazon shoots to the top of most impersonated brands in BBB rankings</p><p>A 2020 report by the BBB found a massive spike in online scams as COVID-19 accelerated the move toward online shopping.</p><p>Scams didn't just affect older people – for the first time, adults ages 18 to 24 reported the highest median losses of $150, the same as adults over 65 years old, the BBB report found.</p><p>Of all the different kinds of scamming techniques, the ones involving \"online purchase\" were ranked as the riskiest by the BBB. </p><p>Amazon shot up to the No. 2 spot for most impersonated brands, with 771 reported scams related to Amazon in 2020, according to data from the BBB. The only organization to top Amazon was the Social Security Administration, which was used 1,467 times by scammers in 2020.</p><p><span><span>More online scams during the holidays:</span> Here's how to spot them before it's too late</span> </p><p><span><span>News? Check. Sass? Check.:</span> Sign up for the only evening news roundup you'll ever need.</span> </p><p>Other organizations that the BBB identified in common scams include Publishers Clearing House, Apple, Microsoft, PayPal, Medicare and Walmart.</p><p>\"Scammers use a combination of tactics, including scarcity and source credibility, to trick us into making emotional, impulse decisions,\" said Gerri Walsh, president of the FINRA Investor Education Foundation.</p><p class=\"tr-npp-section-title\">Tips from the BBB to avoid fake survey scams</p><p>To avoid getting duped, the BBB has released a series of tips for identifying these kinds of survey scams:</p><ol><li>Unsolicited text messages are usually not from trustworthy sources. Reputable businesses will get your permission to send you a text before sending anything to your inbox. Fake texts often contain suspicious-looking links and contain typos and other errors too. <br/>  </li><li>Watch out for rewards that sound too good to be true. If someone offers you a valuable product or gift card in exchange for completing a two-minute survey, it's probably a scam. <br/>  </li><li>Limited-time offers could be a red flag. Scammers often use a sense of urgency to get their victims to hand over valuable information without thinking. <br/>  </li><li>Remember that scammers conceal their identity. Many scam surveys are very vague about their purpose and who is running them. If you can't figure out who or where the survey is coming from, don't take it. <br/>  </li><li>Do some research. If you aren't sure about a survey, do an internet search to find out more information. Look for links to the survey on a business's official website.</li> </ol><p>\"Your best defense is to ignore the pitch—and your second best defense is to slow down and take time to look for third-party validation that the offer and the sender are legitimate. One quick way to verify is to search using the string 'Is [XYZ survey or discount] a scam?' before you give out any information about yourself,\" Walsh says.</p><p><span><span>Michelle Shen is a Money &amp; Tech Digital Reporter for USA TODAY. You can reach her @michelle_shen10 on Twitter. </span> </span> </p><p><span>This article originally appeared on USA TODAY: Scammers are sending fake 'store' surveys and impersonating Amazon: Here's what to watch out for</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}