{"date": "2022-02-10 21:21:57.445000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3223.79, "close": 3065.87}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The former owner of Patozon, one of the biggest \"made in China, sold on Amazon\" merchants, has slapped online fast-fashion retailer Shein and another firm with a lawsuit for non-payment of the stakes in the business they had agreed to buy.</p><p>Global Top E-commerce announced the legal action in a filing to the Shenzhen Stock Exchange on Wednesday, indicating the company had not yet received 53 million yuan (HK$64  million) in overdue payment from Shein and Xiamen Yiwei Yihang Investment Partners since it entered into a 2 billion yuan sale of Patozon to a group of investors early last year.</p></div><div class=\"tr-npp-body\"><p>Shein and Patozon did not immediately respond to a request for comment yesterday.</p><p>TikTok owner ByteDance and Chinese smartphone giant Xiaomi Corporation were the major investors in the Patozon deal.</p><p>A cross-border trading ­company based in the Jianghua E-Commerce Industrial Park near Shenzhen, Patozon was once a high-flyer in the \"made in China, sold on Amazon\" community with the potential to dominate the global market for electronics accessories such as headphones and keyboards.</p><p>The firm's business, however, took a nosedive after its flagship online store on Amazon.com, Mpow, was shut down by the US e-commerce giant in April last year over suspected abuses of its customer review system.</p><p>The ban on Mpow came a month after Patozon's acquisition was announced.</p><p>Global Top warned in August last year that Mpow's predicament was expected to \"slow down the collection of payment\". At  the time, the Shenzhen-listed company already received nearly 1.4 billion yuan from the sale of Patozon.</p><p>The trading firm's lawsuit shows there may be more signs of trouble in the \"made in China, sold on Amazon\" community following the US e-commerce giant's extensive crackdown that has seen the removal of thousands of Chinese sellers from the platform.</p><p>A total of 615 million yuan from the Patozon sale remains unpaid, according to Global  Top's filing on Wednesday. That includes 326 million yuan from investment firms representing Patozon's founders and senior management team, as well as  236 million yuan from Achiever Ventures III (Hong Kong), which wanted to pull out of the deal.</p><p>Achiever Ventures requested to terminate its deal because of \"a material adverse change\" in the business of Patozon, according to Global Top.</p><p>It said legal action against  the Hong Kong firm would be considered if the two sides failed to reach an agreement.</p><p>Amazon, meanwhile, said in January that the \"made in China, sold on Amazon\" community continued to grow in 2021 despite its crackdown on paid reviews and other violations.</p><p>However, a report in the same month by business intelligence firm Marketplace Pulse showed Chinese merchants made up  33 per cent of Amazon's top  sellers by the end of 2021, down from 40 per cent at the start of  the year.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 South China Morning Post. All rights reserved.</p></div>"}