{"date": "2022-02-03 11:34:51.374000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3023.87, "close": 2776.91}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_kq7sy9uz&amp;referenceId=1_kq7sy9uz&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_kq7sy9uz&amp;referenceId=1_kq7sy9uz&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: The European Commissioner for Competition Margrethe Vestager speaks with Breakingviews about the year ahead. Few commissioners have their 2022 agendas as jam-packed as Vestager, whose challenge is to balance the need for Europe to foster the creation of new businesses and startups while keeping emerging digital and industrial monopolies in check. She sits down with Breakingviews to set the stage for antitrust and competition policy in the coming year.<br/>Short Link: <a href=\"https://refini.tv/3nKnb34\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3nKnb34</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; Good afternoon everyone. My name is James Cliffe and I lead the sales and account management teams in EMEA, for the data and analytics division of LCEG. &gt;&gt; I'm delighted to welcome you to Reuters Breaking Views, annual predictions event series, which Refinitiv an else-if business is proud once again to sponsor. Refinitiv relationship with Reuters and Breaking Views goes back many years and there's a key data provided to the world's financial markets. We're especially happy to code-breaking views the leading provider of agenda setting financial common tree one of our partners. With that in mind, allow me to turn the virtual stage over to Margrethe Vestager European Commissioner on the Reuters Breaking news team, for what I'm sure will be a fascinating session for all of us. Liam, over to you. &gt;&gt; Thank you, James. Hello and welcome to another Reuters Breaking Views 2022 perdition event. Thank you very much for joining us. My name is Liam and I'm in the voices office in London and joined by my colleague, Lisa Joker who is in Milan. We have had some marvelous heavy hitters so far in this series. We've had the Boston Morgan Stanley of Unit Credit, a senior official at the Federal Reserve, and now we have another real heavyweight in a Margrethe Vestager who is the Executive Vice President of the European Commission with responsibility for digital and competition policy. I don't think he needs much more of an introduction than that, so let's just get down to it. But I will say first of all, we're very interested in your audience questions. You can post them through the chat forum and my colleague Lisa will pick them up and ask them later on. So Ms. Vestager. Welcome. &gt;&gt; Thank you very much. It's great to meet you. &gt;&gt; Brilliant. I'd like to start by asking a broader question about future of competition policy. Now you've unveiled quite a big piece of legislation recently called Digital Markets Act. It has rules about the way technology joins are supposed to behave. But how will they interact with the cases we're used to seeing you pursue, which is much more of a legalistic \" article 102\" approach with a legislative and DG comp. How will these processes work with each other in the future? &gt;&gt; Well, I've learned a lot from this specific competition cases that I've been responsible for now, not one, not two, but three Google cases, a couple of Amazon cases now, another Google investigation, three Apple investigation, Facebook investigation. And from what I have seen is that in some of the issues there are systemic, and when things are systemic, I think it's only right to call in regulation to work hand in hand with the case-specific approach that we have. What we have learned and also inspired for some unfair trading practices in the marketplace, rebuilt the Digital Markets Act, basically saying that responsibility have to be placed where responsibility is due. If you grow in market power, you also grow in responsibility. And this is why the Digital Markets Act will designate what we call gatekeepers. So really big companies with a lot of market power. If you're a designated a gatekeeper, you have a set of obligations and a set of prohibitions that you will have to live up to in order for the market to be open and contestable. We will, of course, continue to enforce the treaty, we will have cases of a unilateral behavior, we can have cases of more parties colluding. Probably they will be different and we will learn more from that and then we hope that we can refresh the Digital Markets Act as we learn so that it will be future-proof. &gt;&gt; We're not going to see this cases that you've pursued in recent years. We're not going to see them disappear and be replaced by \" This person has violated the DMA\". That stuff will still go on and they'll strengthen each other. &gt;&gt; Yeah. That will still go on. Also, to some degree, of course, it is thought provoking that we could continue to use the same illegal behavior. Because there ought to be a learning curve in the marketplace, also the digital marketplace. That once something has been seen as illegal, then everyone learns and the market moves on. If that is not the case, then of course, the regulation now comes in, designates gatekeepers to say,\" Well, this is the framework within which you will lift your responsibility.\" And of course, it will be a very important part of the enforcement of the Digital Markets Act to see if gatekeepers indeed do live up to the obligations like, for instance, sharing data, and the prohibitions not to prevent yourself compared to smaller competitors. &gt;&gt; That's really useful. I wanted to ask you about something that has been in the news more recently. There was a court case that came to the conclusion of source last week involving Intel. Obviously you were in office when this thing was launched, it's very ancient thing, but it's not the first time that we've seen European Commission Competition thing go through the courts and the courts have actually disagreed with the original findings of the Commission, having quite a few times in recent years, I'm really interested to know what you learned from those court losses and if it's going to change your approach to the way that we prosecute these cases. I guess one theory is that if there's a greater probability of losing in court that would increase your incentive to settle earlier on and accept remedy rather than pushing this through right through to the bitter end. What are your reflections on that? &gt;&gt; First and foremost, as a citizen, I'm really comforted and happy that I live in a union based on the rule of law. That authorities can lose, is not a given that an authority is right. Because it's a real thing that you can go to court and you can challenge the finding of an authority like ours when we do law enforcement. And that. I think, is exactly how things should work. In every case, we should do our work so that we really do believe that it can stand up in court, but we cannot be so risk averse that we will only do cases where we think that there is almost a guarantee that we will win in court. Because then we will not be able to do cases with a noble interpretation of the case law that may be prone for a noble market situation. And if we want to win every time. &gt;&gt; I think we will never get the feedback from the court in a way that will establish a jurisprudence, which is of course important. We have the treaty, we have guidelines, we have regulations, but we also need the court to tell us how the court sees things. So it's an opportunity to learn how to push things forward. And of course, every time, no matter if we win or we lose, we analyze the ruling very carefully in order to learn from it. And one of the things I've learned over these seven years, not being a lawyer myself, is that it's really important to be prudent on procedures because it's quite rare that we lose some substance of a case. It's much more often that we lose on procedural points. So, of course, this is one of the things where we're very specific that things must be done also procedurally by the book, which is why I appreciate that we have the advice from our legal service, we have the independent hearing officers where parties can go raise complaints if they find that things are not sufficiently dealt with. &gt;&gt; Well, could you help our audience understand what you mean by procedural? When these cases have fallen down for procedural reasons, what things are we talking about? Are there any examples? &gt;&gt; Well, it could be that, for instance, we have had stay day case that has fallen because the courts thought that we should have opened a formal investigation instead of finding a solution with the member state in question, that we should have more doubts. It could be issues of access to file not being handled in what should be the proper way. So it is the procedural steps, how to move things forward. Should this have been a supplementary statement of objection rather than a literal fact? Sometimes we have also cases during an investigation, questioning basically every step we take. So the procedure takes up a lot of our efforts as it should, of course, because that is part of the party's right to defend themselves. &gt;&gt; Great. And so onto another newsy topic, I'm going to ask you about one of the few big European tech platforms, Spotify, which is a Swedish music streamer. It's obviously been in the news recently because it's got a fairly controversial podcast host, Joe Rogan, who has been spreading vaccine misinformation through his very large audience. This has similarities to the types of complaints that the commissioners had with some of the big American platforms. So do you see Spotify coming squarely under the scope of the DMA, I guess and it would fall within your purview, I guess and can you assure the American groups that you're going to pursue one of Europe's own companies as aggressively as you would an American one? &gt;&gt; But our legislation doesn't know your home country, it knows your market behavior in the European market where we have jurisdiction. That's the important point. And I think you'd have to see that some US companies, they're more successful in Europe than in the US, when you look at their market share. So Europe is open for business no matter where you come from, as long as you're following the European rulebook. And that of course goes for Spotify as well. I think the issue in question here, it would be more obvious for Spotify to be part of the code of conduct. We have strengthened the code of conduct where all big platforms have signed up in order to police what is unlawful or illegal online, to be taken down. And of course, all of that to be strengthened with another piece of legislation called the Data Services Act, which addresses how services should be provided within the European Union and what responsibility you have, as a platform, to have a system on the one hand side to take down what has flagged to you to be illegal, while at the same time having a system where people can complain about to say, \"Well, I may have hurt you, but this is not hate speech. So this is actually legal for me to say it.\" And that balance to have those systems in place. I think that would be more the question that could be asked for Spotify because the Data Services Act would not only be for gatekeepers, that would be also for foreign larger platforms to oblige to these different obligations. &gt;&gt; Great. Somewhat broader question, you have a web station's screen being very tough on big tech, but if you look at the track record, there is actually quite a few acquisitions by the really big US players, the new Google Fitbit, Microsoft Nuance. Recently, Facebook, now called Meta, was allowed to buy a small company with the customer. Someone who's not following the anti-trust ins and outs very closely and isn't reading all these cases might be a bit surprised the commissioner of [inaudible 00:37:15] is allowing these things to happen. Could you explain what is it? Are you totally relaxed about these types of deals or is it that your hands are tied? And ideally, you might not like me to go ahead, but you don't have the proper legal instruments or legal standing in order to stop them? &gt;&gt; Well, actually in these cases, we have found solutions to the concerns that we would have and we have gone into great detail. So not only the first phase of our medical procedures, but in our in-depth analysis. And if you take the Google Fitbit case, so Fitbit, I think it's 4% of the European markets, so a very small player when it comes to health tracking. And here, we took commitments to solve the concerns that we had because it could be a concern when a giant buys a health tracker that they would foreclose that no one else could use the Android operating system of the phone. So that concern was solved by saying \"We will keep an open API for other health trackers.\" Another concern could be that, while a powerful advertising you can do if you combine health data with other data that you have on people, their search pattern, what else they do, localization, and that was solved by saying \"You need to put health data in a silo. They cannot be used for advertising purposes.\" &gt;&gt; So what we're doing is to try to find also novel solutions to competition problems in order to be able for this market to move ahead. So that we are balanced, that we do not see a market consolidation where there is no market consolidation, but enables the markets to move on. I think that the Google Fitbit, with a data silo. With an open API, with the necessary belt and braces for that open API to be really open, I think it is possible to find a solution. &gt;&gt; Famously hard to monitor these kind of behavioral remedies right? Presumably you do, but do you feel like you have enough window into these companies after the fact? There was a famous example where Facebook told you they'll do something but then you subsequently found that they haven't kept their promises basically. &gt;&gt; No. The Facebook case was a case of misleading information. They wouldn't combine data in a way that we thought they might have done, and for that misleading information, we fined them a â\u0082¬110 million. But misleading information is different from taking commitments that are legally binding on you, and where there will be someone to monitor them. I think it's important to look at solutions to competition problems more in a spectrum instead of just two boxes, either structural or behavioral, because when you are in data issues, well, having a Data Silo is a semi-structured remedy. Having real open API, that will be tested every day when those who needs an open API will be trying to get it. So, we get immediate feedback from the market if this doesn't work. &gt;&gt; Okay there was an idea, just speaking about where is the bar in clearing deals, there was no deal doing around for awhile about flipping the burden of proof in these kinds of deals. I think it might have been in a big digital competition policy report that you commissioned by some experts. This idea of saying, actually if you wanted to do a deal, you have to prove to us that it's not anti-competitive, rather than us having to prove this investive. What do you think of that idea? &gt;&gt; Well I don't necessarily think that it's a bad idea, but that is [inaudible 00:41:28], the back-and-forth that we have. When we look into a deal, we analyze it, we look at what is the market situation, we may have concerns that this will harm competition, then of course the company can say no, no, no, no, no, there will be efficiencies, it will not work as you say, you've got the facts wrong. So, there is this back-and-forth. And even if you turn to table, we would still have to assess the arguments. &gt;&gt; You may end up having the same conversation anyway, just [inaudible 00:41:58]. &gt;&gt; I don't think it's a silver bullet. &gt;&gt; Okay, [inaudible 00:42:03]. I just want to remind the audience, you can ask questions. I think we've had some good ones through, but don't forget about the questions. I'm sticking on the big tech theme for a second. For a really long time, I was writing about your cases, and it was in a global vacuum almost, you were already doing something different. That global competition and anti-trust context has completely changed in the past few years. We've seen huge crackdown in China, and perhaps more relevant for what you're doing, you've seen enormous amount of investigation launched out of the US. How is that context going to change your job and the job of the people that do your job after you do it? Will you have to communicate with these for regulators, would it be so as if you would leave to the Americans? Is anything off the table, or do you just keep going on blink eye as if nothing has changed? &gt;&gt; Well, first and foremost, this is a great development because we don't have a global competition law, we don't have global competition law enforcement. But if you are to make sure that consumers all over this planet has the benefit of competitive markets, well then of course we need a lot of jurisdictions to do things that supplement and complement one another. So I think that when I draw my map, I have a map, I put a little red dot when another investigation is opening by the Australians, by the South Koreans, by the Canadians, by the Americans, by the South Africans, also here in Europe, by the Italians, or the Germans. I'd say we getting there because the market situation is different in different jurisdictions. We have slightly different legislation in different jurisdictions, but we're in it with the same mission, to keep markets open, contestable, that there's a drive for report innovation, for affordable prices. Of course it changes how we work, and it changes also our discussions. From the very first days, I have been discussing our cases with colleagues all over the planet, and the better way was we have, of course the more we can exchange and learn from one another, which I think is beneficial not only for us as law enforcers, but also for the businesses in question so that there is a learning from everyone. So of course it changes, but we still have the obligation in our jurisdiction to make sure that we vigilantly apply a competition law. &gt;&gt; You wouldn't not pursue something because you saw the Americans starting a similar case, for example? &gt;&gt; But it is really difficult to answer in general, because it would depend on the market situation. That is really tricky to say it as a general remark. &gt;&gt; I am just speaking of this global patchwork of investigations. Is there a danger of maybe it'll be more efficient if everyone moved in lockstepand you have this slightly messy picture sometimes whereas it's hard someone is doing something on whatever App Store features over there, and someone else is thinking more big picture about whether so-and-so should be broken up? Do you worry about that legal fragmentation of anti-trust? Well, I'm sure you welcome the fact that more regulators are like-minded now. &gt;&gt; Is there a downside and not that possible everyone's doing something different? &gt;&gt; Well, I think we are very far from over enforcement. I think we're just in the process of correcting under reinforcement. Because of course, we have all had to learn about digital markets, how data works., take our traditional theories of harm, update those to see what is really going on in this marketplace. And I don't see it as fragmentation. Actually I see it as a puzzle coming together to say that with different market situations, there is a coming together of more aligned global approach to what should be the rules of the game in more and more digitalized markets. And it's really important that it happens now when everything digitalizes. So you have the digitalization outside of what was natively digital in agriculture, in transport, in energy. Of course, we had it in finance for a long time. It's really important that competition authorities is then up to speed. I think here we were helping each other and we're learning from one another. &gt;&gt; Great. I just ask you a little bit about something a bit closer to industrial policy which touches on your digital remote. You often hear as a problem that Europe doesn't have many $100 billion tech companies. What do you think about that? I mean, every day we use American software which runs on the American design chips and devices made in Asia. But the premise of the box industrial policy is almost that we need to change this. How are Europeans losing from the status quo? &gt;&gt; Well, on a day-to-day basis we get excellent products and prices have come down on hardware to degree that many, many people can afford it. That is what has happened over the last 10, 15 years, where digitalization was exclusively for the few who could afford it. It was tricky, it was unapproachable to the situation today where smartphones is in the hands of everyone. You have a lot of much more intuitive systems for people to use. You're going to completely different level of convenience in your daily life because of technology. I don't think that could have happened without the market dynamics that we have seen over the last 10-15 years. I think it's a different thing that is at stake here and we have seen it during the pandemic and with the follow-on chip shortage. In Europe, we have a wish of having a bigger footprint in the global value chain when it comes to technology. Not to exclude anyone, but to be a much more assertive part of it. Because important assets are I helped in Europe, in the chips industry, world-class research, and also essential chip producing machines are produced in Europe to be more assertive about what we would do, but still take what is the best of all worlds while establishing coalitions so that we can prevent chip shortage like the one we had. And at the same time enabling what is our goal when it comes to industrial policy, which is that European industry is leading when it comes to digitization and fighting climate change. &gt;&gt; Great. I'm going to hand over to Lisa and may be often one or two more questions. So if anyone has any more questions, do submit them? You've got about five or seven minutes. Can ask you about state aid during the pandemic. Obviously, you paused a little restrictions for a few years to allow governments to help companies through this quite extraordinary situation. You can phasing out these temporary state aid things you laid out, most like a tapering I think up to the middle of 2022 and then there'll be a slightly different regime for six months or so. Even since I read that back in November, you've seen new variant flare up. Maybe there'll be another one walk. If this thing becomes, we have a cycle of strict lockdowns, new variance, what does state aid policy look like in that scenario when we have recurrent flare-ups? Is there such thing as going back to normal or would you support a further extension if that was necessary? &gt;&gt; First and foremost, I think the teams who have been taken with us in the commission more than 900 decisions on state would be very sad if they heard you say that it has been paused because we have used the flexibility that we have in the treaty when we have a crisis like this, to enable member states to give absolutely necessary support when the state asked you to close your door, basically to hyphenate. Of course, they should also support you through these hibernation in order for healthy companies to survive. But the reason why we are still doing state aid control is to make sure that aid is not given in an unbalanced manner so that someone can just outspend others. Because then we would wake up after the pandemic, after this hibernation to completely fragmented single market. We had taken many, many decisions to make sure that everyone is online. Second, we've been following what kind of a budget are we dealing with here. And I think for the European business community, it is really good to see that state has been willing to step up support. I think the total budget of approved eight is more than â\u0082¬3 trillion. And outside of that comes wage support and all stuff. So that is the bucket, that's the willingness to give support. &gt;&gt; But the situation has not been as bad as the budget would reflect. So actually, I think basically, no more than a third of this budget has been used, which means that actually member-states have not outspend each other. So we do think that we have a functioning single market to help us recover from the crisis. And I think you see it because you have seen a very strong rebounce in the European economy over the last year. &gt;&gt; [inaudible 00:53:28] pull me up on the web pools, this is absolutely no oppose. &gt;&gt; They have been working from home, the teams and they have been incredibly vigilant and productive in order to make sure that aid could get out there where it was needed. So I really admire the work that have been done. &gt;&gt; I feel like I get a release in my inbox every other day with [inaudible 00:53:52]. I want to just press you on that point about the level playing field though. Because I mean, you mentioned the three trillion figure was just to put it into context with the audience. I think it was the notional possible amount of state aid that could have been granted based on member-states, the leeway they'd give them themselves in the budget. It's difficult to use those numbers, but I was just doing a quick exercise based on some figures from the commission. Based on that three trillion, it looked like Germany, France, Italy, and Spain were 84 percent of that roughly. Now, as you said all of that three trillion was used, but there are other studies that suggest that Germany and France have accounted for an outsized proportion, whereas it to GDP, particularly Germany, that stand to reason they have a lot of fiscal space in order to help companies. When you look at the numbers, do you really feel confident that there hasn't been some people who are spending each other here? &gt;&gt; Well, of course we will keep following because I don't think one should be confident in this mass is also because of the pandemic is not completely over even though my own country, Denmark as from today, have seized every restriction. What we have seen when we look at the aid actually paid out based on the numbers from the member states themselves. Germany is not in the leads. I think Italy is in the lead with France close by. &gt;&gt; [inaudible 00:55:25] was pretty big as well. &gt;&gt; That we said you're right to say that the bigger countries they have spent more than smaller countries. But so far still we don't see big discrepancies, and since European industry is indeed European, having your customers in one maybe bigger member states, being in good shape also helps you if you're the supplier to that customer. Aid given in one member states may actually also indirectly help others because it makes sure that the value chains and supply chains, that they stay dynamic, and in full function. &gt;&gt; That's great. Thank you. I'm going to hand over to Lisa now who's been scrutinizing the audience questions and may have some of her own as well. Lisa, take it away. &gt;&gt; Thank you, Liam. There's been a few questions coming through and few more also appear in my inbox. But I'd like Vice President to start if I can, on a topic that we haven't discussed yet and this is competition policy in telecommunication and the telecommunications sector. What is the commissioners view on further consolidation? In the past Brushless has been opposed to in-country consolidation that would reduce service providers from 4-3. Has that view changed, particularly after the O2 Hutchinson judgment? &gt;&gt; Well, we do not do magic numbers. We do market analysis, and we have seen a lot of consolidation from fixed to mobile to fiber coming together. Where we get a bit nervous is if we see that there will be very limited choice for people within a national market because that's a thing as one of the real pain points. The European single market, that when it comes to Telcos, the market are still quite national due to regulatory barriers, culture or habit. It's quite rare that people would have a subscription from a supplier in a neighboring market. We would very much want to have Pan-European consolidation to see if that can be a push for a more European market when it comes to the Telcos. Because that I think would give that kind of muscle that is indeed needed for the investments. That is also prone to happen in the telco industry, for instance, in 5D. &gt;&gt; But [inaudible 00:58:28], if I can just do a follow-up to this, I take your point that the sector is still very much divided along national lines, but wouldn't be possible to consider slightly more consolidation at a point in time where telecom providers have to spend a lot to upgrade their networks and extend the use of fiber and they will suspend quite a lot on 5G technology. Wouldn't that be a fair trade off in a way, I mean, the consumers get the new technology, but the operators are able to merge so that they can sustain the cost of that development? &gt;&gt; Well, one of the things that has been really tricky is that so far, our experience still holds true that it's competition that pushes for investments rather than consolidation pushing for investments. What we have done because obviously, I take part of your point is, for instance, to try to encourage member-states to do beauty contest when you frequencies are released for 5D. Instead of asking how much will you pay me, asking how fast and how broad will you deploy this frequency in order for the funding to remain in the company's winning the auctions. On that we have not been very successful, but that would be one of the ways actually to have your cake and eat it. &gt;&gt; To have competition as a driver for more investment, for some funds still to remain in the company is actually having the frequencies and having to do the investment. &gt;&gt; I understand. Thanks for this explanation. Just maybe moving on to another topic, there's also some viewers who are asking you your view on a very interesting legal case, and that's the one that involves Epic and Apple in the United States. So are there any conclusions or insights that can be drawn from that situation which is still alive that could be of interest to Europe? &gt;&gt; It is indeed still alive since both parties have appeal the judgment. We follow it with interest because it is indeed important to see how this question of hosting more app stores can be dealt with the payment systems to do so. You will know that we have our own cases when it comes to this, both a general case on the Apple App store, the Spotify case, where Apple have an app competing on music streaming. Their app does not have to pay the fee and they don't have the rules that they cannot tell people that could actually get the subscription cheaper if they took another venue. So we follow this with great interest. And last but not least, we will be now in the negotiations of the Digital Markets Act that would oblige you to be opened for more app stores than your own if you were an operating system supplier. So we look with great interest of the US developments. But of course now, it's difficult to say because the appeal would now be ongoing from both sides. &gt;&gt; Understood. Obviously, still alive case. Maybe also touching on a slightly different topic. And this is the issue relating to the global corporate tax, which was finally agreed after long discussions by OECD member states. So two questions may be linked to this topic. Has the commission carried out an evaluation of how that would impact the European Union? For instance, the commission has gone after very aggressive tax deals, especially with tech giants, remember, one in Ireland just to mention one. So is there an assessment of how this minimum tax changes things for Europe's coffers? And the second question linked to that is, does it mean that maytbe we don't need digital taxes anymore because we have the global minimum tax? &gt;&gt; We've been really active in order to get to this global compromise. And you know there are two sides to it. One is this 15% minimum effective taxation, and I think the word effective is really important here, and the second, which is the distribution of taxing rights in different trenches depending on company size. And both these sides together would solve a lot of things. And most obviously, the sense that taxation should be more fair. That's big accompanies should not escape contributing to the countries where they do their business and create value. And to also put a limit to really aggressive tax competition. So we're really stern supporters of these compromise and we'll do what we can to implement it for a sense of fairness when it comes to taxation. I don't know if colleagues have calculated what it would bring to EU coffers or member-states coffers, but I consider it a great progress. I think it's a historic deal. And of course, it would be even better if it was also globally implemented. &gt;&gt; Indeed. And on the digital tax, my second question on whether the global corporate tax, the minimum corporate tax, somehow takes off the shine with a need, let's say, to have digital taxes. &gt;&gt; I think, to a very large degree, some member-states had indeed digital taxes and it is part of the agreement to seize these taxes once these taxes have been implemented. So I think there is a balancing thing here but that's a separate consideration of own income for the European Union. And we made two proposals, but what we have proposed all our considerations about digital levy, which is a different kind of tax. Because now, actually, we might be able to implement this global compromise and that would indeed be really good. &gt;&gt; Indeed. Thank you. Maybe just another question or two as we're getting to the end of our conversation. There's a lot of interest also in the consolidation from our views in the consolidation that we're seeing in the gaming industry, the latest Microsoft deal is, of course, what people have in mind. Is that something that will come under your radar screen? Clearly you have explained to us that the commission doesn't look like as the home base of the companies involved. Is that something the commission will review and how do you assess, let's say, consolidation in the video gaming industry? &gt;&gt; I don't think we know if it will be directly notifiable to us. That being said in general, we worked with member states in order to be able to see a transaction that do not meet our thresholds for turnover. An example of that would be the Facebook customer that was referred to us. So we tried to broaden our view to see more deals in order to see what is happening in these markets. &gt;&gt; We will have no specific view of the gaming industry, we want competition between gaming platforms as well as in any other markets. But find it of course, very interesting because gaming is probably what is getting closer and closer to what is a real metaverse where you can have a presence. So both from a market consolidation point of view and from a learning point of view about conditions of the metaverse. These are very interesting developments. &gt;&gt; Indeed. Thank you. So we're getting close to the end, maybe a final question, again, which came from the readers. We have seen action obviously from the European Commission against some of these big tech companies, but individual EU states have also gone against. We had a recent case in Italy against Amazon, which was started. Germany, I think the anti-trust authority there are investigating Apple and the Apple store in particular. Is this action coordinated by the European Commission? I do understand that there are slight legal differences between the countries, but isn't there a risk that if this is not coordinated then there are mixed messages in a way given to consumers and to everyone who was working in these segments. &gt;&gt; This is a very good point, we have always encouraged strong national competition authorities because we work together to enforce European competition law. Actually, I think in numbers 85% of decisions based on European competition law is taken by national competition authorities. And in the last mandate, we passed the legislation actually to strengthen national competition authorities so that every citizen in Europe would have the same minimum when it comes to strengths of their national competition authorities to please the market. Actually, we really appreciate the strengths of authorities and we have a system to coordinate what we're doing. Because in some member states, on top of European competition law they also have national specificities and here, of course, it's really important that we are well-coordinated. And for instance, in the Italian Amazon case, we have an Amazon case which is not just about distribution of goods but also has a data side to it. But we have then carved out the Italian part of the European market in order to make sure that they could do their case. But also that in all fairness, that we would not investigate Amazon behavior also in the Italian market when the Italian authorities were doing it. &gt;&gt; I see. Well, thank you for this explanation. I think on this note I'm going to give back the floor to my colleague Liam. &gt;&gt; Thank you very much, Lisa. Thanks for your questions, audience members. So I think we'll wrap it up there. I'm actually going to say thank you very much for your time. Commissioner Vestager is really good to hear your voice. &gt;&gt; It was my pleasure. It's really encouraging because competition law enforcement and competition in the marketplace is one of the solutions to digitalization, to fighting climate change. But of course also to have resilient supply chains so that if one supplier has an issue then you can turn to someone else. So it's indeed a pleasure to discuss it with you. &gt;&gt; Great. Thank you very much. See you soon. Bye. &gt;&gt; Thank you. Bye bye.<br/></span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}