{"date": "2021-11-30 18:41:00.183000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>AWS Announces Three New Amazon EC2 Instances Powered by AWS-Designed Chips</b>\n</p><p class=\"bwalignc\">\n<span>Amazon EC2 C7g instances powered by new AWS Graviton3 processors provide up to 25% better performance for compute-intensive workloads over current generation C6g instances powered by AWS Graviton2 processors</span>\n</p><p class=\"bwalignc\">\n<span>Amazon EC2 Trn1 instances powered by AWS Trainium chips provide the best price performance and the fastest time to train most machine learning models in Amazon EC2</span>\n</p><p class=\"bwalignc\">\n<span>Amazon EC2 Im4gn/Is4gen/I4i instances feature new AWS Nitro SSDs for the best storage performance for I/O-intensive workloads</span>\n</p><p>\nToday, at AWS re:Invent, <b>Amazon Web Services</b>, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), announced three new Amazon Elastic Compute Cloud (Amazon EC2) instances powered by AWS-designed chips that help customers significantly improve the performance, cost, and energy efficiency of their workloads running on Amazon EC2. New C7g instances powered by next-generation AWS Graviton3 processors deliver up to up to 25% better performance than current generation C6g instances powered by AWS Graviton2 processors. New Trn1 instances powered by AWS Trainium chips provide the best price performance and the fastest time to train most machine learning models in Amazon EC2. New storage-optimized Im4gn/Is4gen/I4i instances based on AWS-designed AWS Nitro SSDs (solid-state drives) offer the best storage performance for I/O-intensive workloads running on Amazon EC2. Together, these instances herald the arrival of new Amazon EC2 instances based on AWS-designed chips that help customers power their most business-critical applications.\n</p><p>\n“With our investments in AWS-designed chips, customers have realized huge price performance benefits for some of today’s most business-critical workloads. These customers have asked us to continue pushing the envelope with each new EC2 instance generation,” said David Brown, Vice President, Amazon EC2 at AWS. “AWS’s continued innovation means customers are now getting brand new, game changing instances to run their most important workloads with significantly better price performance than anywhere else.”\n</p><p>\n<b>C7g instances powered by new AWS Graviton3 processors deliver up to 25% better performance compared to current generation C6g instances powered by AWS Graviton2 processors</b>\n</p><p>\nCustomers like DirecTV, Discovery, Epic Games, Formula 1, Honeycomb.io, Intuit, Lyft, MercardoLibre, NextRoll, Nielsen, SmugMug, Snap, Splunk, and Sprinklr have seen significant performance gains and reduced costs from running AWS Graviton2-based instances in production since they launched in 2020. The Graviton2 instance portfolio offers 12 different instances that include general purpose, compute optimized, memory optimized, storage optimized, burstable, and accelerated computing instances, so customers have the deepest and broadest choice of cost-effective and power-efficient compute in the cloud. As customers bring more compute intensive workloads like high performance computing (HPC), gaming, and machine learning inference to the cloud, and as their compute, storage, memory, and networking demands grow, they are looking for even better price performance and energy efficiency to run these demanding workloads.\n</p><p>\nC7g instances, powered by next generation AWS Graviton3 processors, provide up to 25% better performance for compute-intensive workloads compared to current generation C6g instances powered by Graviton2 processors. AWS Graviton3 processors also deliver up to 2x higher floating point performance for scientific, machine learning, and media encoding workloads, up to 2x faster performance for cryptographic workloads, and up to 3x better performance for machine learning workloads compared to previous generation AWS Graviton2 processors. AWS Graviton3 processors are also more energy efficient, using up to 60% less energy for same performance than comparable EC2 instances. C7g instances are the first in the cloud to feature the latest DDR5 memory, which provides 50% higher memory bandwidth versus AWS Graviton2-based instances to improve the performance of memory-intensive applications like scientific computing. C7g instances also deliver 20% higher networking bandwidth compared to AWS Graviton2-based instances. C7g instances support Elastic Fabric Adapter (EFA), which allows applications to communicate directly with network interface cards, providing lower and more consistent latency, to enhance the performance of applications that require parallel processing at scale like HPC and video encoding. C7g instances are available today in preview. To learn more about C7g instances, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fec2%2Finstance-types%2Fc7g%2F&amp;esheet=52542549&amp;newsitemid=20211130005974&amp;lan=en-US&amp;anchor=aws.amazon.com%2Fec2%2Finstance-types%2Fc7g&amp;index=1&amp;md5=5bc7dde42e44d890184bef47ae511fb0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com/ec2/instance-types/c7g</a>.\n</p><p>\n<b>Trn1 instances powered by AWS Trainium</b> <b>chips provide the best price performance and the fastest time to train most machine learning models in Amazon EC2</b>\n</p><p>\nMore and more customers are building, training, and deploying machine learning models to power applications that have the potential to reinvent their businesses and customer experiences. However, to ensure improved accuracy, these machine learning models must consume ever-growing amounts of training data, which causes them to become increasingly expensive to train. This dilemma can have the effect of limiting the number of machine learning models that customers are able to deploy. AWS provides the broadest and deepest choice of compute offerings for machine learning, including the EC2 P4d instances featuring NVIDIA A100 Tensor Core GPUs and EC2 DL1 instances featuring Gaudi accelerators from Habana Labs. But even with the fastest accelerated instances available today, it can still be prohibitively expensive and time consuming to train ever-larger machine learning models.\n</p><p>\nTrn1 instances powered by AWS Trainium chips offer the best price performance and the fastest machine learning model training in Amazon EC2, providing up to 40% lower cost to train deep learning models compared to the latest P4d instances. Trn1 instances offer 800 Gbps EFA networking bandwidth (2x higher than the latest EC2 GPU-based instances) and integrate with Amazon FSx for Lustre high performance storage—enabling customers to launch Trn1 instances with EC2 UltraClusters capability. With EC2 UltraClusters, developers can scale machine learning training to 10,000+ Trainium accelerators interconnected with petabit-scale networking, giving customers on-demand access to supercomputing-class performance to cut training time from months to days for even the largest and most complex models. Trn1 instances are available today in preview. To learn more about Trn1 instances, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fec2%2Finstance-types%2Ftrn1&amp;esheet=52542549&amp;newsitemid=20211130005974&amp;lan=en-US&amp;anchor=aws.amazon.com%2Fec2%2Finstance-types%2Ftrn1&amp;index=2&amp;md5=b6157bf1329c46577bbae00f9e55c089\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com/ec2/instance-types/trn1</a>.\n</p><p>\n<b>Im4gn/Is4gen/I4i instances</b> <b>featuring new AWS Nitro SSDs deliver the best storage performance for I/O intensive-workloads</b>\n</p><p>\nToday, customers use I3/I3en storage-optimized instances for applications that require direct access to data sets on local storage like scale-out transactional and relational databases (e.g. MySQL and PostgreSQL), NoSQL databases (e.g. Cassandra, MongoDB, Redis, etc.), big data (e.g. Hadoop), and data analytics workloads (e.g. Spark, Hive, Presto, etc.). I3/I3en instances offer Non-Volatile Memory Express (NVMe) SSD-backed instance storage optimized for low latency, high I/O performance, and throughput at a low cost. Customers appreciate the fast transaction times I3/I3en instances provide, but as they evolve their workloads to process even more complex transactions on larger data sets, they need even higher compute performance and faster access to data, without higher costs.\n</p><p>\nIm4gn/Is4gen/I4i instances are architected to maximize the storage performance of I/O-intensive workloads. Im4gn/Is4gen/I4i instances offer up to 30 TB of NVMe storage from AWS-designed AWS Nitro SSDs, delivering up to 60% lower I/O latency and 75% lower latency variability compared to previous generation I3 instances to maximize application performance. AWS Nitro SSDs are tightly integrated with the AWS Nitro System via optimizations in the storage stack, hypervisor, and hardware. Because AWS is managing both the hardware and firmware of the AWS Nitro SSDs, customers benefit from improved functionality because SSD updates are delivered more quickly compared to using commercial SSDs. Im4gn instances (available today) feature AWS Graviton2 processors and provide up to 40% better price performance and up to 44% lower cost per TB of storage compared to I3 instances. Is4gen instances (available today) also use AWS Graviton2 processors and provide up to 15% lower cost per TB of storage and up to 48% better compute performance compared to I3en instances. To get started with Im4gn/Is4gen instances, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Faws.amazon.com%2Fec2%2Finstance-types%2Fi4g&amp;esheet=52542549&amp;newsitemid=20211130005974&amp;lan=en-US&amp;anchor=aws.amazon.com%2Fec2%2Finstance-types%2Fi4g&amp;index=3&amp;md5=967b67c1552129d5ea493f8e81af92b7\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com/ec2/instance-types/i4g</a>. I4i instances (available soon) feature 3rd generation Intel Scalable processors (Ice Lake), delivering up to 55% better compute performance than current generation I3 instances. To learn more about I4i instances, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fec2%2Finstance-types%2Fi4i&amp;esheet=52542549&amp;newsitemid=20211130005974&amp;lan=en-US&amp;anchor=aws.amazon.com%2Fec2%2Finstance-types%2Fi4i&amp;index=4&amp;md5=59201b1c03e23d358df8677152834b17\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com/ec2/instance-types/i4i</a>.\n</p><p>\nSAP HANA is a world’s leading in-memory database that serves as the foundation of the SAP Business Technology Platform. “Over the past decade, SAP HANA has helped customers manage their most mission critical transactional and analytics workloads,” said Irfan Khan, President of HANA Database &amp; Analytics at SAP. “AWS investments and innovations on ARM-based AWS Graviton processors and SAP HANA Cloud are a great match with potential to deliver step-wise operation and performance improvement benefits to our enterprise customers, and to SAP’s cloud analytics and data management solutions powered by SAP HANA Cloud.”\n</p><p>\nTwitter is what’s happening and what people are talking about right now. “Twitter is working on a multi-year project to leverage the AWS Graviton-based EC2 instances to deliver Twitter timelines. As part of our ongoing engineering to drive further efficiencies, we tested the new Graviton3-based C7g instances,” said Nick Tornow, Head of Platform at Twitter. “Across a number of benchmarks that we've found to be representative of the performance of Twitter workloads, we found Graviton3-based C7g instances deliver 20%-80% higher performance versus Graviton2-based C6g instances, while also reducing tail latencies by as much as 35%. We are excited to utilize Graviton3-based instances in the future to realize significant price performance benefits.”\n</p><p>\nFormula 1 (F1) racing began in 1950 and is the world’s most prestigious motor racing competition, as well as the world’s most popular annual sporting series. “We had already seen that Graviton2-based C6gn instances provided us the best price performance for some of our CFD workloads. We have now found Graviton3 C7g instances to be 40% faster than the Graviton2 C6gn instances for those same simulations,” said Pat Symonds, CTO at Formula 1 Management. “We’re excited that EFA will be standard on this instance type, and given this much improved price performance, we expect Graviton3-based instances to become the optimal choice to run all of our CFD workloads.”\n</p><p>\nFounded in 1991, Epic Games is the creator of Fortnite, Unreal, Gears of War, Shadow Complex, and the Infinity Blade series of games. Epic’s Unreal Engine technology brings high-fidelity, interactive experiences to PC, console, mobile, AR, VR, and the Web. “As we look to the future and building increasingly immersive and compelling experiences for players, we are excited to use AWS Graviton3-based EC2 instances,” said Mark Imbriaco, Senior Director of Engineering at Epic Games. “Our testing has shown they are suitable for even the most demanding, latency-sensitive workloads while providing significant price performance benefits and expanding what is possible within Fortnite and any Unreal Engine created experience.”\n</p><p>\nHoneycomb develops an observability platform that enables engineering teams to visualize, analyze, and improve cloud application quality and performance. “We're excited to have tested our high-throughput telemetry ingestion workload against early preview instances of AWS Graviton3 and have seen a 35% performance increase for our workload over Graviton2,” said Liz Fong-Jones, Principal Developer Advocate at honeycomb.io. “We were able to run 30% fewer instances of C7g than C6g serving the same workload, and with 30% reduced latency. We are looking forward to adopting AWS Graviton3-powered C7g instances in production once they are generally available.”\n</p><p>\nAnthropic builds reliable, interpretable, and steerable AI systems that will have many opportunities to create value commercially and for public benefit. “Our research interests span multiple areas including natural language, human feedback, scaling laws, reinforcement learning, code generation, and interpretability. A major key to our success is access to modern infrastructure that allows us to spin up very large fleets of high-performance deep learning accelerators,” said Tom Brown, Co-founder at Anthropic. “We are looking forward to using Trn1 instances powered by AWS Trainium, as their unprecedented ability to scale to tens of thousands of nodes and higher network bandwidth will enable us to iterate faster while keeping our costs under control.”\n</p><p>\nSplunk is a leading data platform provider and is designed to investigate, monitor, analyze, and act on data at any scale. “We run C/C++ based workloads for indexing and searching event data. Our workload is CPU bound and benefits from high capacity and low latency SSD storage,” said Brad Murphy, Vice President, Cloud Platform &amp; Infrastructure at Splunk. “When evaluating the new Im4gn/Is4gen instances powered by AWS Graviton2, we observed an up to 50% decrease in search runtime compared to I3/I3en instances, which we currently use. This makes Im4gn and Is4gen instances a great choice for running our storage-intensive workloads with significant price performance improvement and lower TCO.”\n</p><p>\nSprinklr helps the world's biggest companies make their customers happier across 30+ digital channels—using the most advanced, sophisticated AI engine built for the enterprise to create insight-driven strategies and better customer experiences. “We benchmarked our Java-based search workloads on Amazon EC2 Im4gn/Is4gen instances powered by AWS Graviton2 processors. Smaller Is4gen instances offer similar performance compared to larger I3en instances, presenting an opportunity to meaningfully reduce the TCO,” said Abhay Bansal, Vice President of Engineering at Sprinklr. “We also saw a significant 50% reduction in latency for queries when moving our workloads from I3 to Im4gn instances, indicating a significant 40% price performance benefit. Moving to AWS Graviton2-based instances was easy, taking two weeks to complete benchmarking. We are very happy with our experience and look forward to running these workloads in production on Im4gn and Is4gen instances.”\n</p><p>\nRedis Enterprise powers mission critical apps and services for over 8,000 organizations globally by enabling software teams to create a high-performance data layer for the real-time world. “We're thrilled to see the Amazon EC2 I4i instances using the new low latency AWS Nitro SSDs that deliver better transaction speed than the previous generation instances,” said Yiftach Shoolman, Co-Founder and CTO at Redis. “We expect the faster storage performance and higher networking and processor speeds of the I4i instances will deliver significant improvements at an even more attractive total cost of ownership for our customers who use Redis-on-Flash on I4i instances.”\n</p><p>\n<b>About Amazon Web Services</b>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2F&amp;esheet=52542549&amp;newsitemid=20211130005974&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=5&amp;md5=bbf8e07968957e106a5b45768c4a848e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<strong>About Amazon</strong>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Famazon.com%2Fabout&amp;esheet=52542549&amp;newsitemid=20211130005974&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=6&amp;md5=c81ae4dccc05bc9986ff4acfc9261318\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211130005974r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTMwMDA1OTc0cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=d6d33365d9f5f765a79a038bd958be69c76a3355c109e39018423c7b2df39ae4fcd18ae9c78f1d826660fbb10860f6ee7cd6c52f699f74a182fb8e29aa4c57e6\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211130005974/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211130005974/en/</a></span></p><p>\nMedia Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52542549&amp;newsitemid=20211130005974&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=7&amp;md5=647d94ffaf472581251177f8decc940d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NV-AMAZON-WEB-SERVICES</p></div>"}