{"date": "2022-01-27 17:02:14.958000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2777.45, "close": 2879.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>NEW YORK (AP) — Amazon workers have lined up enough support to vote on whether to unionize a New York City warehouse, federal labor officials said this week in a big step forward after a setback this fall for one of the first organizing drives at the nation's largest online retailer.</p><p>The National Labor Relations Board confirmed Thursday that the nascent Amazon Labor Union gathered enough signatures to hold an election, on a date to be set after a Feb. 16 court hearing on such particulars as what workers the union would represent. The workers withdrew a similar request in November after running into snags over the number of current employees who had signed on.</p></div><div class=\"tr-npp-body\"><p>\"We quickly bounced back\" and kept gathering more signatures, organizer Christian Smalls said Thursday, a day after getting the green light from the NLRB. \"That was the celebratory moment for us yesterday, the fact that we were able to achieve that even after facing the withdrawal.\"</p><p>Smalls — who was fired after organizing a March 2020 protest over coronavirus safeguards at the warehouse — said the would-be union submitted over 2,500 signatures in favor of a vote, comfortably clearing the NLRB threshold of 30% of workers the potential union would cover. That's 5,000 employees, in this case.</p><p>Still, Seattle-based Amazon Inc. continued to question whether the union drive has enough backing.</p><p>\"We're skeptical that there are a sufficient number of legitimate signatures, and we're seeking to understand how these signatures were verified,\" spokesperson Kelly Nantel said. She argued that the turn of events in the fall showed that most workers at the Staten Island warehouse don't want to unionize.</p><p>Smalls countered that the company's doubts don't hold water, noting that the NLRB gave the OK after getting the signatures.</p><p>The developments come as Amazon faces a do-over union vote among warehouse workers in Bessemer, Alabama, during the next two months.</p><p>Workers there rejected the proposed union last spring. It was a rare unionization vote within Amazon, which aggressively campaigned against the push for collective bargaining in Bessemer.</p><p>The NLRB ordered a new election after saying the company destroyed trust in the election by putting a mailbox at the employee entrance — a move the board said gave a false impression that the company was conducting the mail-in vote. Amazon maintained it was trying to make voting easier.</p><p>In a settlement with the NLRB last month, Amazon promised to let its 750,000 U.S. workers organize freely and not to retaliate.</p><p>The company is the nation's second-largest private employer, after Walmart.</p><p>Workers at a number of big U.S. companies have been pressing for better pay and working conditions amid the pandemic and the labor shortage that emerged after shutdowns ended.</p><p>In one example, workers OK'd unionizing in two of three recent votes at Starbucks shops in and around Buffalo, New York.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.</p></div>"}