{"date": "2022-02-23 08:30:22.439000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p> <br/>   By Monika Asthana<br/>NewsRise<br/>   MUMBAI (Feb 23) -- Here's a roundup of latest news from India so far on Wednesday:<br/><br/>*India Top Court Asks Amazon, Future To Get Quick NCLAT Decision On CCI Case<br/><br/>India’s Supreme Court today urged Amazon and Future Group to approach the National Company Law Appellate Tribunal to quickly decide on the U.S. company’s appeal that challenged the antitrust watchdog’s order for suspension of the Future Coupons stake buy deal. “We ask both the parties to approach NCLAT for expeditious disposal of the case,” a bench led by Chief Justice N.V. Ramana said. <br/><br/>*India Bikaji Foods Files For IPO, May Raise Up To $134 Million - Analysts<br/><br/>Bikaji Foods International has filed a draft prospectus with the Securities and Exchange Board of India to launch an initial public offering. The Indian snacks maker may raise up to 10 billion rupees ($134.12 million) via its maiden share sale, according to analysts.<br/><br/>=BAZAAR BUZZ: Edelweiss Ups Kalpataru Power; JMC Merger Good Value Proposition<br/><br/>Edelweiss Research upgrades Kalpataru Power Transmission to Buy from Hold, as company's proposed move to merge 68% owned subsidiary JMC Projects with itself is a good value proposition. \"In our view, i) the merger is a meaningful opportunity to scale up the combined entity’s revenue led by geographical expansion, entry into big-ticket projects and other business synergies. ii) Operational/ financial savings could add up to INR1bn in synergies (6% EBITDA), iii) merger is 3% EPS-accretive (post-8% dilution) on FY24E earnings for KPTL,\" house says. <br/><br/>*BAZAAR BUZZ: Weak 3Q Drives Estimate Cuts For India Cement Sector - Jefferies<br/><br/>Jefferies cuts EBITDA estimates for all coverage companies in India cement sector post 3Q results. Operating EBITDA declined around 25% on-year in 3Q, net earnings dropped 32%, volumes fell 2% and unit costs jumped 19%, house notes. “The jury is still out on what is deferring industry price hikes despite sharp run up in costs - weak demand or complacency in discipline,” Jefferies says.<br/>   - By Monika Asthana; monika.asthana@newsrise.org; +91-2261353300<br/>- Edited by Gurdev Singh Virk<br/>- Send Feedback to feedback@NewsRise.org<br/>- Copyright (c) 2022 NewsRise Financial Research &amp; Information Services Pvt. Ltd.<br/>    </p></div>"}