{"date": "2022-02-03 12:04:10+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3023.87, "close": 2776.91}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Foo Yun Chee</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">BRUSSELS, Feb 3 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Cloud services providers such as Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and Microsoft <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MSFT.O\" data-type=\"ric\" data-ric=\"MSFT.O\" translate=\"no\" dir=\"ltr\">MSFT.O</a> and other data processing service providers must set up safeguards against illegal data transfers to non-EU governments, according to the European Commission's Data Act to be published this month.</p><p>The proposed rule, seen by Reuters, sets out rights and obligations on the use of EU data such as smart machinery and consumer goods, and is part of a raft of legislations aimed at reining in U.S. tech giants and helping the bloc meet its green and digital objectives.</p><p>EU concerns about data transfers have been growing ever since former U.S. intelligence contractor Edward Snowden's revelations in 2013 of mass U.S. surveillance.</p><p>Europe's top court in 2020 scrapped a transatlantic data transfer deal relied on by thousands of companies for services ranging from cloud infrastructure to payroll and finance because of similar concerns. The United States and the EU have been trying to come up with a new deal.</p><p>The Data Act goes further than current curbs on the transfer of personal data outside the 27-country bloc by extending such restrictions to non-personal data.</p><p>\"Concerns around unlawful access by non-EU/EEA governments have been raised. Such safeguards should further enhance trust in the data processing services that increasingly underpin the European data economy,\" the EU document said.</p><p>It said that providers of data processing services will have \"to take all reasonable technical, legal and organisational measures to prevent such access that could potentially conflict with competing obligations to protect such data under EU law, unless strict conditions are met\".</p><p>The Data Act seeks to develop interoperability standards for data to be used between sectors following concerns of barriers to data sharing within and between industries.</p><p>It also aims to make it easier for companies to switch between cloud and edge services by setting out minimum regulatory contractual, commercial and technical requirements on providers of cloud, edge and other data processing services to  enable switching between such services.</p><p>The Commission has set a tentative date of Feb. 23 for publishing the Data Act.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Foo Yun Chee<br/>Editing by Bernadette Baum)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:foo.yunchee@thomsonreuters.com\" data-type=\"email\" translate=\"no\">foo.yunchee@thomsonreuters.com</a> ; +32 2 287 6844; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://foo.yunchee.thomsonreuters.com@reuters.net\">foo.yunchee.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: EU-TECH/DATAACT</p></div>"}