{"date": "2021-12-17 20:18:59.657000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3377.42, "close": 3341.58}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Dec. 18 -- The Competition Commission of India (CCI) on Friday kept Amazon group's 2019 purchase of 49% stake in a Future group entity in abeyance and ordered a penalty of Rs.202 crore for allegedly not being upfront about the actual scope and purpose of the deal.</p><p>The CCI referred to various agreements between the entities of Amazon and the Future group and said that Amazon allegedly failed to notify certain shareholder agreements and commercial arrangements involving Future group as part of the combination between the parties and allegedly suppressed the actual purpose and particulars of the deal.</p></div><div class=\"tr-npp-body\"><p>Amazon's investment in Future Coupons Pvt. Ltd (FCPL) has been at the centre of a bitterly fought legal battle between the two groups about Future group's sale of retail business to Reliance Retail Ventures Ltd (RRVL) for about Rs.24,700 crore.</p><p>The CCI's penalties on Amazon, Rs.200 crore and Rs.2 crore, are imposed separately under different sections of the law relating to reporting obligations of parties involved in a transaction. The regulator pointed to a \"deliberate design on the part of Amazon to suppress the actual scope and purpose of the combination\" and that it did not find any mitigating factor. Amazon has 60 days to pay the penalty. While keeping the 2019 deal in abeyance, the CCI also directed Amazon to file fresh notice about the transactions within 60 days.</p><p>Amazon said it was looking into the CCI order. \"We are reviewing the order passed by the Competition Commission of India and will decide on next steps in due course,\" said an emailed statement from the company spokesperson. Emails sent to Reliance and Future group remained unanswered at the time of publishing.</p><p>CCI had cleared the deal in November 2019 after assessing the overlapping businesses of Amazon, FCPL and their group entities, concluding that the deal is not likely to adversely affect competition in the market. However, in March, FCPL said Amazon initiated arbitration proceedings relating to the transfer of assets of Future Retail Ltd, in which FCPL holds a 9.82% stake, alleging that Amazon has contradicted its stand in the arbitration proceedings about its investments in FCPL compared to its submissions before CCI. The regulator said the FCPL petition said such contradictions established false representation and suppression of material facts before the commission.</p><p>In sum, Amazon ought to have notified the combination consisting of the interconnected steps and the Future Retail Ltd shareholders' agreement to acquire strategic rights over FRL through FCPL shareholder agreement, and the commercial agreements between Amazon and Future groups, the order said. Meanwhile, the Confederation of All India Traders said CCI's order against Amazon and the imposition of penalty was a \"landmark order\". Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}