{"date": "2021-11-11 13:00:00.675000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3576.23, "close": 3472.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>DENVER, Nov.  11, 2021  (GLOBE NEWSWIRE) --  <a href=\"https://www.globenewswire.com/Tracker?data=c2rcKdhsdYUbM583t9sLsJfhbs0rNQ96GUWDFafOkr5BdsBRBqIE9nlFa6ccklcNIa56Gi3C9M5hHridWbva-g==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AllCloud</a>, a leading, global provider of cloud professional and managed services, announces an expanded strategic collaboration with Amazon Web Services (AWS). The collaboration, which began last year in Germany, Austria, Switzerland and Israel, will now include North America. Through the collaboration, AllCloud will provide clients with professional and managed services to accelerate their cloud migration and digital transformation.</p><p>In December 2020, AllCloud and AWS announced <a href=\"https://www.globenewswire.com/Tracker?data=gbBoW0VtcGmmKCXx1S6XAgV2P_dQe5Yw3GpqIaPqLviYGGgQu2iFBQSqGIFKU8LJ8H_YmrlNoZ7LHX-rmDHcYQIcZg4k3OB_2nRMegoPt87UU9xYt8ucCQKOGgD1-LNurb-vnXM4oaFuLPSQVRdojLYKSjTdXsuuun-kybHwKSiREphRWQb0aPd-8JYANsbI\"><u>a strategic collaboration</u></a> to support Medium and Large Enterprise clients in EMEA. The new agreement expands the scope of work to include ISVs, manufacturing and consumer goods clients in the North American market. AllCloud will provide these organizations with services and solutions built around its expertise in cloud migration, Microsoft workloads, DevOps, security, data, analytics and AI/ML.</p><p>Since signing the initial agreement with AWS, AllCloud increased its investment in data and analytics business solutions <a href=\"https://www.globenewswire.com/Tracker?data=XPbeGRq041B2er9gqYzL8uOtWI7HisQvjfeUrJTQdzGNmTnQEt4JFzwDd9oLxNGZwsGtGDCw8kpfpAAV0ncoIdHt7zETZgE086RStX1VI2-5qFBTByP6Eu1TaYuhY1TzricbP-HWumdfLim5g8q1UptlY-kwcbeGCVf910gjjm4=\"><u>through the acquisition of Integress</u></a>. AllCloud also <a href=\"https://www.globenewswire.com/Tracker?data=QRrB-Yid-O5_GdC0m3nz4Daku-PZJyY0E_C0Z5POIWHDyrmCVnioiaDu7GSJMeutFobmVhrSetfY6cFiLL-qCtzTx-DdJNW3rlb6ZDwiBuEFwKbuyaHLkkqr6JlgWcv-93y6_FPJUvPSdGwVIEXFO6AXas9vCXF_hHSSO_KAKUZUkxO2y0Szx5bQYFyQS0H38ztt4IgoJaHaucqXpW-yGfePvOzwjXNvnSz2jeYm_VSv39WcStBvoFCvpxM9bdLJLlHdYko6M6I_RtVuk3oSMA==\"><u>launched the Solutions Factory</u></a>, a collection of fully automated, ready-to-deploy AWS CloudFormation architecture blueprints, to help clients expedite or expand their use of AWS.</p><p>“The expansion of our relationship with AllCloud into North America is a welcome addition to the work we’ve been doing in EMEA. We have collaborated with AllCloud to help our customers experience a smoother cloud integration, leveraging AllCloud's expertise in cloud security to lower risks and costs, and raise system productivity,” said Doug Yeum, Head of Global Partner Organization, AWS. “We share a commitment to helping our customers innovate for a more digital, resilient future, and look forward to seeing how our partnership with AllCloud will continue to evolve.”</p><p>“AllCloud has been instrumental in helping us increase our revenue,” said Jamie Miller, President and CEO at Mission Innovate. “Its unparalleled level of subject matter expertise in the AWS environment, along with its enduring collaboration, partnership and engaging communication, has been a foundational driver of our continued success. We plan to continue our partnership with AllCloud as we further expand our cloud adoption and transition more of our product offerings from on-premises to a SaaS model.”</p><p>“We are extremely proud of the work we’ve been doing in EMEA with our clients and AWS, and look forward to extending this success to our clients in North America,” said Eran Gil, CEO of AllCloud. “AllCloud offers the widest array of services and solutions in cloud migration and management to streamline clients’ transformation on AWS. The expansion of the strategic collaboration is a natural next step in this journey.”</p><p><strong>About AllCloud</strong></p><p>AllCloud is a global professional services company providing organizations with the tools for cloud enablement and transformation. Through a unique combination of expertise and agility, AllCloud accelerates cloud innovation and helps organizations fully unlock the value received from cloud technology and data and analytics.</p><p>As an AWS Premier Consulting Partner, a Salesforce Platinum Partner and Snowflake Select Partner, AllCloud helps clients connect their front office and back office by building a new operating model that allows them to harness the benefits of cloud technology and data and analytics. AllCloud is supported by a robust ecosystem of technology partners, proven methodologies, and well-documented best practices. Thereby, elevating customers by achieving operational excellence on the cloud, within a secure environment, at every milestone of the journey to becoming cloud first.</p><p>With over 13 years of experience and a portfolio of thousands of successful cloud deployments, AllCloud serves clients across the globe. AllCloud has offices in Israel, Europe and North America. <a href=\"https://www.globenewswire.com/Tracker?data=PIQ5CvOREjjLUeW92D4SDvqXKpFJPdZwDuE38Gd17dMeE0-4mEo6jNjyeUN1n8t_Ku0WmlJpSmL6tIPx9a4Jmw==\"><u>www.allcloud.io</u></a></p><p>Media Contact:<br/>Kevin Wolf<br/>Owner - TGPR<br/><a href=\"https://www.globenewswire.com/Tracker?data=rWTQGhQyPacVzL3e3IEW4xzML3uJvVrMiecw5v4Ej0x96_oJrZZV3mVriBa1LuvNaRdbQYmQZNoJNpBZWXh-YQ==\"><u>kevin@tgprllc.com</u></a></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODM5MTY5MyM0NTQ1NTM1IzIxMjI4Mzg=\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RNNU1UWTVNeU0wTlRRMU5UTTFJekl4TWpJNE16Zz0=&amp;key=8c6160869c762463e3331a18e639546a8e8720c87ef0ea938bee174e1be8401e926990f856baddf6f0b03b7e88585b4a1d5ac062ee495486be31d3eaf9bfae53\"/></div></div><br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/MGJlM2UzYzctZWJkYS00NmFjLWI0ZGYtNGNjNmE4MmY1YmZhLTExMzQ0MDk=/tiny/AllCloud.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9NR0psTTJVell6Y3RaV0prWVMwME5tRmpMV0kwWkdZdE5HTmpObUU0TW1ZMVltWmhMVEV4TXpRME1Eaz0vdGlueS9BbGxDbG91ZC5wbmc=&amp;key=dadcac1073b999bae30e4a589d577a1a20a8d9455835dcf7dbf894d6d37be957cf257739bbe531b5c944b4705d1341e8c16921363b29c6a01b59cf839afddeee\"/></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">GlobeNewswire, Inc. 2021</p></div>"}