{"date": "2021-04-12 19:00:24.486000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3757.0, "close": 3809.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Read Article Petroliam Nasional Berhad (PETRONAS), Malaysia's fully integrated oil and gas multinational, has partnered with AVEVA, a global leader in industrial software, driving digital transformation and sustainability, to provide a modern enterpris...</p><p>Petroliam Nasional Berhad (PETRONAS), Malaysia's fully integrated oil and gas multinational, has partnered with AVEVA, a global leader in industrial software, driving digital transformation and sustainability, to provide a modern enterprise solution that promotes integration across the entire value chain.</p></div><div class=\"tr-npp-body\"><p>PETRONAS selected AVEVATM Unified Supply Chain in the cloud to enable simplified business processes and deeper collaboration, while reducing value leaks and sustaining productivity. As the only industrial software company that offers unified design applications across all supply chain activities, AVEVA's solution uses Enterprise Crude Knowledge Management, to drive Value Chain Optimization for the oil and gas industry.</p><p>Delivering Intuitive Software with Cloud High Performance Computing The AVEVA solution will provide easy data management to deliver a single source of crude oil information that is easily shared across different teams and locations. The modern and intuitive software will eliminate the requirement for specific coding, drastically reducing the learning curve delivering high-performance computing and advanced data processing that will enable PETRONAS to run complex planning models at speed using the latest cloud technology.</p><p>\"At PETRONAS, we are continuously looking to create value with disruptive technologies that offer optimum solutions. Utilizing AVEVA Unified Supply Chain software, we have been able to adopt a more integrated business process, that optimizes our productivity, allowing us to deliver with less,\" said Yusri Yusof, Vice President of Refining and Trading at PETRONAS.</p><p>Transforming Organizational Operations and Improving the bottom line AVEVA solutions have helped more than 4 PETRONAS refinery and petrochemical sites improve safe operations while finding the best utilization for feedstock. The technology also ensures the resulting production plan matches the real plant optimization and reduces the gap between planning and scheduling, as well as actual refinery operations.</p><p>\"AVEVA Unified Supply Chain software, part of AVEVA's Value Chain Optimization solution, presents a unique opportunity for organizations like PETRONAS to synchronize all business and operations activities across the supply chain from feedstock selection to planning, scheduling, operations and distribution,\" said Harpreet Gulati, SVP Planning and Operations, AVEVA. \"Our solutions are helping organizations to change the way they work and operate. We are delivering the digital transformation of PETRONAS' supply chain, by empowering its workforce to make better, more agile decisions with next-generation software that is enhancing the user experience as well as providing built-in collaboration, interactivity and advanced analytics.\"</p><p>AVEVA's strategy is to help forward-thinking organizations like PETRONAS create a collaborative environment enabling the business to be managed in a comprehensive, flexible, and connected manner that brings transparency to the decision-making process across the value chain.</p><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}