{"date": "2021-11-17 16:17:05.613000+00:00", "ticker": "III", "mrkt_info": {"open": 1446.5, "close": 1450.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 7305S3i Infrastructure PLC17 November 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>\n</span></p>\n<p class=\"tr-npp-section-title\">\n<span>\n</span></p>\n<p class=\"tr-npp-section-title\">\n<span>\n</span></p>\n<p class=\"tr-npp-section-title\">\n<span>3i Infrastructure plc agrees to invest in GCX to support future growth</span>\n</p>\n<p class=\"tr-npp-section-title\">\n<span>17 NOVEMBER 2021</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>3i Infrastructure plc (\"3i Infrastructure\" or the \"Company\") has agreed to invest c.$512m to acquire a 100% stake in Global Cloud Xchange (\"GCX\"). GCX is a leading global data communications service provider and owns one of the world's largest private subsea fibre optic networks.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>GCX provides high-bandwidth connectivity to a range of blue-chip customers including hyperscalers, telecommunications operators, new media providers and enterprises. Its 66,000km of cables span 46 countries from North America to Asia, with a particularly strong position on the Europe-Asia and Intra-Asia routes. 3i Infrastructure is partnering with GCX's management team to invest in a leading platform in the sector, with the ambition to increase the utilised capacity on GCX's existing routes as well as to add new routes and customers.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Global data traffic is growing rapidly, with data usage forecast to grow in excess of 25% per annum. Technological advances, the digitalisation of the economy and regulatory developments are causing a proliferation of data generation and usage across all industries. This data is increasingly being stored and shared via the cloud and relies on data carrier infrastructure, including GCX's extensive network, to flow between hubs across the world.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Richard Laing, Chair of 3i Infrastructure, commented: \"GCX provides</span> an essential service to its customers and operates in an industry with high barriers to entry. <span>GCX</span> is a great addition to the Company's portfolio, in a sector we have been keen to invest further into, and will provide an attractive yield to 3i Infrastructure.\"</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Phil White, Managing Partner and Head of Infrastructure, 3i Investments plc, Investment Manager of the Company, added:</span> \"GCX is one of the most comprehensive subsea cable networks globally, with a unique network on strategically important routes. We are delighted to be backing Carl Grivner and his <span>experienced management team to continue GCX's growth</span> .\"</p>\n<p>\n<span>Carl Grivner, CEO GCX, said: \"We are very excited to have 3i Infrastructure's backing. We will benefit from the team's experience of investing in telecommunications infrastructure as well as their international network and experience of supporting companies to grow. We look forward to partnering with 3i Infrastructure to accelerate our growth and strengthen our platform.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Completion is conditional upon certain regulatory approvals and is expected in the middle of 2022.</span>\n</p>\n<p>\n<span>-ENDS-</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>For further information, contact:</span>\n</p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>\n</span></p>\n<p>\n<span>Thomas Fodor</span>\n</p>\n<p>\n<span>Investor enquiries</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Kathryn van der Kroft</span>\n</p>\n<p>\n<span>Media enquiries</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n<p>\n<span>Tel: +44 207 975 3469</span>\n</p>\n<p>\n<span>Email:</span>\n<span>\n<a href=\"mailto:thomas.fodor@3i.com\" data-type=\"email\" translate=\"no\">thomas.fodor@3i.com</a>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Tel: +44 20 7975 3021</span>\n</p>\n<p>\n<span>Email:</span>\n<span>\n<a href=\"mailto:kathryn.vanderkroft@3i.com\" data-type=\"email\" translate=\"no\">kathryn.vanderkroft@3i.com</a>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Notes to editors:</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>3i Infrastructure plc</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>3i Infrastructure plc is a Jersey-incorporated, closed-ended investment company and an approved UK Investment Trust, listed on the London Stock Exchange and regulated by the Jersey Financial Services Commission. The Company's purpose is to invest responsibly in infrastructure, delivering long-term sustainable returns to shareholders and having a positive impact on its portfolio companies and their stakeholders.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>3i Investments plc, a wholly-owned subsidiary of 3i Group plc, is authorised and regulated in the UK by the Financial Conduct Authority and acts as Investment Manager of 3i Infrastructure plc.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>GCX</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Global Cloud Xchange (\"GCX\") offers network services which power digital transformation for enterprises, new media providers, and telecoms carriers. We cover all aspects of cloud-centric connectivity from managed SD-WAN and hybrid networks, to direct Cloud connections and 100 Gbps+ waves. With a pedigree going back 30+ years, GCX are experts in providing connectivity throughout the Emerging Markets Corridor into Asia via the vast GCX subsea network (the world's largest private submarine cable network), with extensions available into more than 200 countries worldwide.</span>\n</p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>AGRDKOBKABDDQDD</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}