{"date": "2021-06-02 13:06:40.583000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3496.0, "close": 3441.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>ENPNEWSWIRE-(C)2021 ENPUBLISHING</p><p>Release date- 01062021 - Two Organizations to Collaborate on Innovation of New Technologies, Sustainable Digital Solutions and Services for The Maritime Industry.</p></div><div class=\"tr-npp-body\"><p>AVEVA, a global leader in industrial software, driving digital transformation and sustainability, and International Maritime Industries (IMI), today announced that they have extended their existing long-term collaboration with a new strategic partnership.</p><p>The partnership will further advance IMI's engineering solutions to include production and manufacturing processes, developing best-in-class products and services for the maritime sector in the Middle East and Africa (MEA). The new a joint venture involves Saudi Aramco, Lamprell Plc, Bahri and Hyundai Heavy Industries and spans a 10-year period, to optimize digitalization across the maritime lifecycle utilizing AVEVA Unified Engineering and AVEVA Digital Ship and Shipyard Operations.</p><p>Set to be fully operational by 2023, IMI is driving an accelerated and advanced digital program to ensure it is able to commence yard operations using the most advanced technology innovations. This will help IMI to deliver agile and efficient newbuild project execution, a connected, digitally-enabled workforce to ensure safe and effective ship production, and a smart connected shipyard to continuously optimize the operational efficiency of its facility. The partnership will see all parties collaborating on enhancing digital transformation for IMI's core business processes and facilities. AVEVA and IMI will also join forces to power futuristic developments and co-innovation of new technologies, including digital solutions and services for the maritime industry.</p><p>Fathi K. Al-Saleem, CEO at IMI, said: 'The maritime industry is increasingly prioritizing and integrating the digitalization and automation of operations. IMI will offer a range of technologically advanced, high-quality sustainable products and innovative lifecycle management services for customers at internationally competitive prices. As the largest full-service yard in the MENA region, IMI will help shape the maritime industry as a global leader and disruptor in applying digital solutions to manage, monitor and operate our innovative smart yard.'</p><p>AVEVA is helping maritime sector organizations globally to transform their shipbuilding, utilizing its end-to-end solutions. Increasingly, organizations are examining energy-efficient digital transformation technologies as they focus on automating processes, optimizing operations, and enhancing efficiencies for a sustainable future. With AVEVA's broad software portfolio addressing all aspects of design, engineering and operation, IMI is now well positioned to realize its digital goals.</p><p>Peter Herweck, CEO, AVEVA, commented: 'AVEVA has a comprehensive portfolio of cutting-edge solutions for large-scale digital transformational projects for the maritime industry. We provide an integrated, data- management platform that spans IMI's core business processes. We are also committed to being a strong partner for co-innovating on transformational technologies and services. We aim to play a key role in delivering data solutions for IMI, enabling them to offer smart digital products to customers. Using insights from advanced AI-infused analytics will enable IMI to continuously optimize its operational agility and engineering efficiency. We look forward to further building this partnership and taking it to new heights over the coming years.'</p><p>About IMI</p><p>Located at Ras Al-Khair on Saudi Arabia's eastern seaboard, International Maritime Industries (IMI) will be the MENA region's largest maritime facility, offering a globally unique product range. IMI aspires to be a world-leading 'Shipyard of the Future', an advanced and sustainable maritime hub providing ship and rig companies with state-of-the-art infrastructure, products, and high-quality solutions. IMI is a Saudi Aramco sponsored joint venture (JV) with partners Hyundai Global Services, Bahri and Lamprell. Find out more: www.imi-ksa.com</p><p>About AVEVA</p><p>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence. AVEVA's comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries. Learn more at www.aveva.com.</p><p>Copyright 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</p><p>Enquiries:</p><p>AVEVA Media Contacts</p><p>Rose Bambi</p><p>Senior Director Global PR and External Communications</p><p>Tel: +44 (0) 208 323 2789</p><p>rose.bambi@aveva.com</p><p>Caroline Stephens</p><p>Senior Global PR Manager</p><p>caroline.stephens@aveva.com</p><p>Catherine Singh</p><p>Global PR/Social Media Coordinator</p><p>catherine.singh@aveva.com</p><p>External Communications Alias</p><p>external.communications@aveva.com</p><p>[Editorial queries for this story should be sent to newswire@enpublishing.co.uk]</p><p>((Comments on this story may be sent to info@enpublishing.co.uk))</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 M2 Communications Ltd.</p></div>"}