{"date": "2021-12-14 07:17:18.370000+00:00", "ticker": "III", "mrkt_info": {"open": 1396.0, "close": 1400.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 5103V3i Group PLC14 December 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>Appointment of Chief Operating Officer</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>3i Group PLC (\"3i Group\" or the \"Company\") announces that Ms Jasi Halai, currently Group Financial Controller, will join the Group Board as Chief Operating Officer in May 2022. She will also join the Executive Committee.</p>\n<p>Ms Halai joined 3i in 2005 and has held a variety of posts in the business, most recently as Group Financial Controller and Operating Officer.</p>\n<p>David Hutchison, Chairman of 3i Group, said:</p>\n<p>\"We are delighted to announce Jasi's promotion to the Board as Chief Operating Officer She has played an important Group role for a number of years managing the Group's central financial operations and we look forward to her contribution to the Board over the coming years.\"</p>\n<p>Simon Borrows, CEO of 3i Group, said:</p>\n<p>\"I am very pleased that Jasi is being appointed to the Board as Chief Operating Officer. As well as continuing her role managing the Group's central finance and operations functions she will also take on responsibility for the Group's IT, property and procurement activities. Jasi will work closely with James Hatchley when he succeeds Julia Wilson as Group Finance Director in May next year.\"</p>\n<p>-Ends-</p>\n<p>For further information, contact:</p>\n<p>\n<span>\n</span></p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>Kathryn van der Kroft Communications Director</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>020 7975 3021</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Silvia Santoro Group Investor Relations Director</p>\n<p>\n</p></td>\n<td>\n<p>020 7975 3258</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>Notes to Editors</p>\n<p>About 3i Group</p>\n<p>3i is a leading international investment manager focused on mid-market Private Equity and Infrastructure. Its core investment markets are northern Europe and North America. For further information, please visit: <span>\n<a href=\"http://www.3i.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.3i.com</a>\n</span>\n</p>\n<p>Additional information - Jasi Halai</p>\n<p>\n<span>Prior to joining 3i Jasi Halai held positions at CDC and Actis</span> . <span> She is also a non-executive director at Porvair Plc, and <span>is a member of the Chartered Institute of Management Accountants and holds an MSc in investment management from the CASS Business School.</span>\n</span></p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>BOATJBMTMTMBTRB</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}