{"date": "2021-12-20 20:27:34.995000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Still shopping for Christmas gifts? If you'll be attending a gift swap, we're here to help you find the perfect present that arrives before Christmas. We've put together the best last-minute white elephant gifts you can buy from Amazon for less than $25. </p></div><div class=\"tr-npp-body\"><p><span><span>Tackle your holiday shopping with deals and expert advice delivered straight to your phone.</span> Sign up for text message alerts from the deal-hunting team at Reviewed.</span> </p><p>From portable phone chargers to AirPods carrying cases, all of the white elephant gift ideas below should arrive before Christmas. A lot of holiday shipping speeds have come and gone, but many of the best last-minute white elephant gifts from Amazon we've found are eligible for Prime shipping, ensuring a timely delivery if you have an Amazon Prime membership. </p><p class=\"tr-npp-section-title\">1. For the person who loves cute stuff: Manatea Silicone Tea Infuser</p><p>Don't let its adorable looks fool you: The Manatea tea infuser from Fred &amp; Friends is more than just a novelty gift. When we set out to test and rank  <a href=\"https://www.reviewed.com/cooking/best-right-now/the-best-tea-infusers\" data-type=\"url\" class=\"tr-link\" translate=\"no\">the best tea infusers on the market, the Manatea topped our list thanks to its easy-to-clean silicone body, its secure grip, and of course, its undeniable charm. If your Secret Santa recipient is a tea-loving soul who appreciates the cuter things in life, the Manatea tea infuser is sure to please. </a> </p><p><span><a href=\"https://www.amazon.com/Fred-MANATEA-Silicone-Tea-Infuser/dp/B00B5EE0A6/ref=as_li_ss_tl?ots=1&amp;slotNum=0&amp;imprToken=88bee50e-ea8a-a146-6e3&amp;ascsub&amp;cv_ct_id=amzn1.osp.1a481d1f-227b-40e5-a609-220a7d8973e1&amp;cv_ct_pg=search&amp;cv_ct_wn=osp-search&amp;keywords=manatea&amp;pd_rd_i=B00B5EE0A6&amp;pd_rd_r=34e73616-06d4-4b70-a94e-d9a22ec566ec&amp;pd_rd_w=objbp&amp;pd_rd_wg=vgGZC&amp;pf_rd_p=53eff971-6e12-4016-9864-b6dfd929b2b3&amp;pf_rd_r=C651QGMRD3KE9H9G9JWC&amp;qid=1573158538&amp;linkCode=ll1&amp;tag=usatgiftguide-20&amp;linkId=fc1663caff585e67041b0e030bd141a5&amp;language=en_US\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the Manatea Silicone Tea Infuser at Amazon for $9</a> </span> </p><p class=\"tr-npp-section-title\">2. For the one who needs some pampering: Aztec Secret Indian Healing Clay Mask</p><p>We all wash our face, so why not do it with this Amazon cult-favorite clay mask? It has over 15,000 reviews and a 4.6-star rating, making it a great choice for anyone. One of our reviewers has been using <a href=\"https://www.reviewed.com/lifestyle/features/this-11-aztec-clay-mask-has-more-than-15000-reviews-on-amazon-is-it-worth-buying?utm_source=usat&amp;utm_medium=referral&amp;utm_campaign=collab\">this mask for years <span> and loves how it instantly brightens up their skin. </span> </a> </p><p><a href=\"https://www.amazon.com/Aztec-Secret-Cleansing-Original-Bentonite/dp/B081FK6L1G/ref=as_li_ss_tl?ots=1&amp;slotNum=5&amp;imprToken=3ebee4db-a5d3-1594-c35&amp;ie=UTF8&amp;linkCode=ll1&amp;tag=usatgiftguide-20&amp;linkId=f2a98110304870afd4663b358a3cdd94&amp;language=en_US\"><span>Get the Aztec Secret Indian Healing Clay from Amazon for $14.95</span> </a> </p><p class=\"tr-npp-section-title\">3. For the one who likes their privacy: CloudValley Webcam Cover </p><p>As the world becomes a more flexible place to work, more and more of us are relying on video calls to keep up with our meetings. These days, many laptops come with built-in cameras, making it quick and easy to hop on a Zoom call. However, when not in use, it's always a good idea to cover the camera for an extra layer of security, bringing peace of mind to your white elephant giftee. This ultra-slim cover comes in four colors and is designed to fit a variety of phones, tablets, MacBooks and PCs. </p><p><span><a href=\"https://www.amazon.com/Laptop-CloudValley-Ultra-Thin-MacBook-Protect/dp/B079MCPJGH?tag=usatgiftguide-20\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the CloudValley Webcam Cover on Amazon for $6.99</a> </span> </p><p class=\"tr-npp-section-title\">4. For the one who can never find their keys: Tile Mate tracker</p><p>We all lose our keys every now and then, which is why the iOS and Android-friendly Tile Mate tracker is a hot white elephant gift to give. The Tile Mate is so popular because it can be used with commonly forgotten items like keys, wallets and purses. The next time they lose their keys, they can just use an app to ping the Tile and quickly find them to actually meet you on time.</p><p><a href=\"https://www.amazon.com/Tile-RE-19001-Mate-1-Pack/dp/B09998MBFM/r?ots=1&amp;slotNum=2&amp;imprToken=a2bee511-ca7a-0744-abb&amp;tag=usatgiftguide-20\"><span>Get the Tile Mate at Amazon for $17.99</span> </a> </p><p class=\"tr-npp-section-title\">5. For the one who shares a bathroom: Poo-Pourri</p><p>Look, 142,000 reviewers don't lie. Poo-Pourri may have a hilarious name, but it didn't gain its cult following on titles alone. Poo-Pourri is a shared bathroom game-saver (which I do, unfortunately, know from personal experience). Your giftee will laugh, jokingly test it out, then fall quickly and deeply in love with the Poo-Pourri experience. You can opt for a standalone bottle or this snazzy gift set, perfect for homes with multiple bathrooms. </p><ul class=\"bulleted-list arrowlist\"><li><span>Get a 4-ounce bottle of Poo-Pourri at Amazon for $12.98</span> </li><li><span>Get a 5-pack of Poo-Pourri at Amazon for $17.99 </span> </li> </ul><p class=\"tr-npp-section-title\">6. For the one who loves selfies: QIAYA Selfie Light Ring</p><p>Whether they've been mastering TikTok dances or are always trying to find the best lighting for their photos, a ring light will ensure they always have the perfect lighting for selfies. With three light settings, this one from QIAYA can brighten up self-portraits taken at night or in a dark room. The light is rechargeable, simply clips to the top of a phone, and is small enough to carry in a backpack, purse, or pocket.</p><p><span><a href=\"https://www.amazon.com/QIAYA-Selfie-Photography-Lighting-Rechargeable/dp/B07QKRXTWJ/ref=as_li_ss_tl?ots=1&amp;slotNum=13&amp;imprToken=1ebee511-bbad-33f8-c24&amp;ie=UTF8&amp;linkCode=ll1&amp;tag=usatgiftguide-20&amp;linkId=30beaabccd035ebaec2fba4b9d374fcb&amp;language=en_US\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the QIAYA Selfie Light Ring at Amazon for $11.99</a> </span> </p><p class=\"tr-npp-section-title\">7. For the nerd: <span>ZUSONUD B-Best Guardians of The Galaxy Groot Pen Pot</span> </p><p>Life is too short to be boring and this \"Guardians of The Galaxy\" Groot Pen Pot is anything but dull. Your coworker will get a kick out of using the 6-inch pot to hold markers, small plants and other trinkets like this <a href=\"https://www.amazon.com/Pilot-Retractable-Premium-Assorted-31300/dp/B0058NNACE/?tag=usatgiftguide-20\" data-type=\"url\" class=\"tr-link\" translate=\"no\">highly-rated Pilot G2 pens.</a> </p><p><span>Get the ZUSONUD B-Best Guardians of The Galaxy Groot Pen Pot on Amazon for $10.94</span> </p><p class=\"tr-npp-section-title\">8. For the egg aficionado: Dash Rapid Egg Cooker</p><p>An egg cooker is the gift that everybody wants but nobody has. They will love opening the Dash Rapid Egg cooker so they can make poached eggs on their avocado toast and more tasty breakfast egg dishes. It can soft boil, hard boil, scramble, and poach—all in one machine. Plus, <a href=\"https://www.reviewed.com/ovens/features/dash-rapid-egg-cooker-review\" data-type=\"url\" class=\"tr-link\" translate=\"no\">we tried it and it actually works, and it's something your giftee will use for mornings to come.</a> </p><p><span><a href=\"https://www.amazon.com/gp/product/B00DDXWFY0/ref=as_li_ss_tl?ots=1&amp;slotNum=9&amp;imprToken=94bacd20-dd67-5f54-880&amp;ie=UTF8&amp;linkCode=ll1&amp;tag=usatgiftguide-20&amp;linkId=09110dd8b3e88772e7c929c39a262fd0&amp;language=en_US\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the Dash Rapid Egg Cooker at Amazon for $16.99 </a> </span> </p><p class=\"tr-npp-section-title\">9. For the one who loves cold coffee: Takeya Patented Deluxe Cold Brew Coffee Maker</p><p>Cold brew is a morning staple, and if you live in a warm climate (or your secret santa recipient loves cold brew coffee even in the dead of winter), this well-priced cold brew carafe would make a great gift. With a fine-mesh, cleanable filter and a carafe large enough for four cups of coffee, as well as a sleek design for in-fridge storage, this <a href=\"https://www.amazon.com/Takeya-10310-Patented-Airtight-Silicone/dp/B00FFLY64U/?ots=1&amp;slotNum=18&amp;imprToken=f0bedaba-09b2-1d90-40e&amp;tag=usatgiftguide-20\">cold brew maker i <span>s perfect for the person in need of a caffeine fix.</span> </a> </p><p><a href=\"https://www.amazon.com/Takeya-10310-Patented-Airtight-Silicone/dp/B00FFLY64U/?ots=1&amp;slotNum=18&amp;imprToken=f0bedaba-09b2-1d90-40e&amp;tag=usatgiftguide-20\"><span>Get the Takeya Patented Deluxe Cold Brew Coffee Maker from Amazon for $19.99</span> </a> </p><p class=\"tr-npp-section-title\">10. For the work bestie: A mug with an honest message</p><p>If you're hunting for a cheap and fun gift that's guaranteed to get a laugh, go for this mug with a message that rings true for many of us. Your giftee will enjoy drinking from this mug every day and, let's be honest, showing it off during virtual meetings. More than 1,700 reviewers give this one a solid 4.8 stars. Bonus: It arrives well before Christmas. </p><p><span>Get the \"I survived another meeting\" mug at Amazon for $17.99</span>  </p><p class=\"tr-npp-section-title\">11. For book lovers who read in the dark: Perfectday Rechargeable Reading Light</p><p>Any bookworm who shares a bed or room with someone but needs to plow through a book as their companion sleeps will appreciate an old-school reading light. This one from Perfectday is slim, reliable and rechargeable, and shines a small but intense beam on the page to ensure the reader sees the words but others close by aren't disturbed by a glare. The light also has three brightness settings, each with its own color temperature.</p><p><a href=\"https://www.amazon.com/PERFECTDAY-Rechargeable-Reading-Brightness-Protection/dp/B07VZXKYXW/ref=as_li_ss_tl?ots=1&amp;slotNum=7&amp;imprToken=8abecd50-4a04-960e-dde&amp;keywords=book+light&amp;qid=1570209244&amp;sr=8-5&amp;linkCode=ll1&amp;tag=usatgiftguide-20&amp;linkId=15c445e7768bcbde8f4e6ab65cab1838&amp;language=en_US\"><span>Get the Perfectday Rechargeable Reading Light from Amazon for $9.99</span> </a> </p><p class=\"tr-npp-section-title\">12. For the one who has AirPods: AirPods case cover</p><p>It seems like everyone has AirPods these days and one thing all AirPods owners have in common: They're worried about losing them. With more than 43,000 reviews and a 4.6-star rating on Amazon, people love this silicone carrying case and say it doesn't rip and that it makes them feel more secure. It's inexpensive and the perfect white elephant gift.</p><p><span><a href=\"https://www.amazon.com/dp/B077187F2R/ref=as_li_ss_tl?ots=1&amp;slotNum=12&amp;imprToken=06bacd27-83eb-e67e-f9f&amp;th=1&amp;linkCode=ll1&amp;tag=usatgiftguide-20&amp;linkId=8f2c17241c97b0a3513f32d6e290fc8d&amp;language=en_US\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the AhaStyle AirPods Case Cover at Amazon for $4.39</a> </span> </p><p class=\"tr-npp-section-title\">13. For the one who wears their staple jewelry: Diamond Dazzle Stik</p><p>A jewelry cleaning sticker that make earrings, necklaces and rings sparkle is the gift they will go back to buy for themselves. Amazon reviewers swear by this jewelry cleaning stick designed to re-sparkle diamonds, saying it's very easy to use and that they saw significant improvement upon their jewels. </p><p><span><a href=\"https://www.amazon.com/Connoisseurs-1050-Diamond-Dazzle-Stick/dp/B00459VM6I/?ots=1&amp;slotNum=30&amp;imprToken=b0becd15-7cef-a0e6-d42&amp;tag=usatgiftguide-20\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the Diamond Dazzle Stik at Amazon for $9.39</a> </span> </p><p class=\"tr-npp-section-title\">14. For the one who's always asking for a charger: Anker Portable phone charger</p><p>Anker makes some of the best portable phone chargers we've ever tested. Your white elephant giftee will love how useful this high-speed on-the-go phone charger is—especially if they're always asking to borrow yours. The charger is slim and lightweight and can be used with iPhones, Samsung Galaxy phones and more.</p><p><span>Get the Anker Portable Charger on Amazon for $22.99</span> </p><p class=\"tr-npp-section-title\">15. For the new baker: Rachael Ray Yum-o! Oven Lovin' Loaf Pan</p><p>This popular baking pan from Rachael Ray is  <a href=\"https://www.reviewed.com/cooking/best-right-now/the-best-loaf-pans\" data-type=\"url\" class=\"tr-link\" translate=\"no\">the best loaf pan we've ever tested thanks to its nonstick surface and even heating. The firm handles with silicone inserts are easy to handle, and the pan is safe up to 500 degrees, making it a great addition to the lucky recipient's kitchen. </a> </p><p><a href=\"https://www.amazon.com/Rachael-Ray-Nonstick-Bakeware-Handles/dp/B002CXEW1G/ref=as_li_ss_tl?ots=1&amp;slotNum=2&amp;imprToken=3ebee4db-a5d3-1594-c35&amp;ie=UTF8&amp;linkCode=ll1&amp;tag=usatgiftguide-20&amp;linkId=7df49d8129b0c60fc1073257ec289f0a&amp;language=en_US\"><span>Get the Rachael Ray Yum-o! Oven Lovin' Loaf Pan from Amazon for $11.99</span> </a> </p><p><span><span>Don't get thwarted by shipping delays or sold-out favorites this holiday season.</span> Sign up for our free weekly newsletter and get shopping tips, deals, product reviews, gift guides and more.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: The 15 best last-minute white elephant gifts you can snag on Amazon for less than $25</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}