{"date": "2022-02-04 00:23:12.101000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3012.25, "close": 3152.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Ansys has launched a strategic collaboration with Amazon Web Services (AWS), identifying the CSP as the preferred and recommended partner for Ansys Gateway powered by AWS.</p><p>The collaboration will enable deployment of Ansys products on AWS -- making simulation workloads more user-friendly, while offering scalability and flexibility with easy access to software and storage solutions from anywhere with a web browser. By leveraging connected ecosystem applications in a cloud environment, Ansys customers will reduce time to market, reduce costs, and innovate faster.Building on a longstanding relationship, the newly formed collaboration will provide a browser-based, location-independent solution for Ansys customers -- particularly product developers, designers, and engineers that have traditionally utilized on-prem HPC resources. Customers will manage and advance their complete CAE, EDA, and Computer-aided design (CAD) product development in the cloud by leveraging scale, flexibility, elasticity, and global reach of AWS.AWS offers an extensive framework, including products ranging from compute, storage, internet of things (IoT), Digital Twin, analytics and machine learning that Ansys can integrate.With Ansys Gateway powered by AWS customers will be able to access Ansys applications, enabling faster, flexible, and highly-scalable engineering simulations. In addition to reducing time to market, customers will be able to reduce costs by paying for cloud resources only when they are being used. Ansys Gateway powered by AWS will be available in the AWS Marketplace, allowing customers to access their existing Ansys software applications and will be able to create, customize, and connect Ansys software with 3rd party applications using minimal technical skills via a user-friendly interface.\"This is an exciting opportunity to combine the forces of Ansys and AWS to help customers innovate faster. This work will make it easier for customers to use Ansys's comprehensive portfolio of engineering simulation products leveraging a secure, reliable and agile cloud. It will remove barriers to scale globally for customers and they can perform more simulations and they can do so earlier in the design process,\" said Bill Vass, Vice President of Engineering at AWS.The benefits of cloud computing are far reaching with the ability to deploy globally in minutes to all target platforms. As an added benefit, customers maintain full control of their data throughout all projects, ensuring security.\"Cloud computing accelerates and expands simulation by removing hardware barriers and computer restrictions, streamlining all processes and workflows,\" said Shane Emswiler, Senior Vice President of Products at Ansys. \"By leveraging Ansys Gateway powered by AWS customers will have a stronger, three-layered approach to boost their innovation and efficiency by doing more simulations, faster, and with more flexibility on AWS.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}