{"date": "2021-12-19 05:54:55+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3400.35, "close": 3408.34}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Dubai, UAE:</strong> Dubai Electricity and Water Authority (DEWA) has started providing its smart services on Amazon Alexa in Arabic, becoming the first government utility in the world to do this. Customers can now review their monthly bills in Arabic, check past statements, details of electricity and water consumption, their carbon footprint, as well as connect their DEWA account to other Amazon accounts. Customers can also benefit from Rammas, DEWA’s virtual employee, which uses Artificial Intelligence (AI) on Amazon’s Alexa devices in Arabic to answer their enquiries. Moreover, customers can benefit from the Smart Living initiative, which enables them to make smart decisions to reduce their consumption proactively and digitally as well as solve problems and causes for increased consumption or waste on their own; without contacting DEWA.</p>\n<p>“We strive to shape the future, keep pace with global developments and smart technologies to develop work mechanisms in order to enrich the customer experiences and make them happier. This supports the vision and directives of His Highness Sheikh Mohammed bin Rashid Al Maktoum, Vice President and Prime Minister of the UAE and Ruler of Dubai, to develop the Government of Dubai and make it ten years ahead of other cities. We are proud that DEWA is the first government utility in the world that provides its services in Arabic on  Amazon Alexa. This reflects DEWA’s continuous efforts to achieve the maximum benefit from AI and disruptive technologies to provide the best smart services to its customers. DEWA was the first government entity in the UAE to add Rammas to this innovative technology since 2017 to enable customers to enquire about their bills anytime. Moreover, DEWA enables its customers to complete their transactions anytime and anywhere easily and safely on its website and smart app as well as other smart and digital channels. This saves their time and efforts and enhances their happiness as well as contribution to protecting the environment, natural resources and reducing carbon emissions,” said <strong>HE Saeed Mohammed Al Tayer, MD &amp; CEO of DEWA</strong>.</p>\n<p>“We’re very excited to see DEWA making their services available to its customers on Alexa, introducing an innovative and more sustainable way of engaging with government utilities. Just by using their voice, customers benefit from a broad range of innovative DEWA services that not only save time and resources but also provide inspiration to lead a more sustainable life,” said <strong>Eric Saarnio, VP Devices &amp; Services, Amazon</strong>.</p>\n<p>Smart adoption of DEWA’s services reached 98.9% in the third quarter of 2021. DEWA received the 100% Paperless Stamp from Dubai Digital Authority, recognising its efforts in completing the digital transformation of all its services and operations by 100%. DEWA also provides Rammas services round the clock in Arabic and English on its website, smart app, Facebook, Google Assistant, robots, and WhatsApp Business on 046019999.</p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}