{"date": "2021-12-14 13:17:18.887000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">AXIS REPORTS RECORD SECOND QUARTER FINANCIAL RESULTS</p>\n<p>TORONTO, Feb. 16, 2022</p>\n<ul class=\"bulleted-list arrowlist\">\n<li>\n<span>Record originations and loan portfolio balance drive record revenue</span>\n</li>\n<li>\n<span>Strong balance sheet in place to support growth momentum and strategy</span>\n</li>\n</ul>\n<p>\n<span>TORONTO</span> , <span>Feb. 16, 2022</span> /CNW/ - Axis Auto Finance Inc. (\"Axis\" or the \"Company\") (TSXV: AXIS), a financial technology company changing the way Canadians purchase and finance used vehicles, is pleased to announce its fiscal second quarter results for the period ending <span>December 31</span> , 2021.</p>\n<p>\n\n</p>\n<p>\n<span>Q2 Financial and Business Highlights:</span>\n</p>\n<ul class=\"bulleted-list arrowlist\">\n<li>Auto loan originations increased 21% to a record <span>$36.7 million</span> ;</li>\n<li>Record auto loan portfolio balance of <span>$197 million</span> , up 29% year over year;</li>\n<li>Revenues at record levels at <span>$10.1 million</span> ;</li>\n<li>Adjusted Earnings of <span>$1.6 million</span> ;</li>\n<li>21% year-over-year reduction in annualized credit losses to 7.77%;</li>\n<li>Launched Direct-To-Consumer (\" <span>D2C</span> \") platform DriveAxis.ca;</li>\n<li>Increased senior credit facility to <span>$120 million</span> while reducing borrowing cost;</li>\n<li>Completed a <span>$15 million</span> equity investment by Westlake Financial.</li>\n</ul>\n<p>Auto loan originations were <span>$36.7 million</span> in the quarter, a 21% year-over-year increase. <span>$20.6 million</span> were owned and on balance sheet assets and <span>$16.1 million</span> were loans managed for Westlake Financial Services ( <span>\"Westlake\"</span> ). These record origination volumes resulted in Axis' owned and managed auto loan portfolio assets rising to <span>$197 million</span> , consisting of <span>$131.4 million</span> of owned and <span>$65.6 million</span> in managed assets.</p>\n<p>Equipment finance origination volumes in the quarter were <span>$24.5 million</span> , <span>$5.4 million</span> in owned and on balance sheet assets, and <span>$19.1 million</span> brokered to third parties. In aggregate, the Axis on balance sheet portfolio balance was <span>$138.1 million</span> at quarter-end.</p>\n<p>Revenues for the quarter rose to a record <span>$10.1 million</span> , an increase of 4% year-over-year.</p>\n<p>Adjusted earnings for the quarter was <span>$1.6 million</span> , or <span>$0.014</span> per share, as compared to <span>$1.5 million</span> or <span>$0.015</span> per share for the second quarter of fiscal 2021. Net income for the quarter was <span>$0.2 million</span> or <span>$0.002</span> per share, as compared to net income of <span>$0.4 million</span> or <span>$0.004</span> per share in the second quarter of fiscal 2021. Adjusted shareholder equity was <span>$59.6 million</span> as at <span>December 31, 2021</span> , or <span>$0.47</span> per share.</p>\n<p>Annualized credit losses for the quarter were 7.77%, down from 9.88% last year, representing a 21% improvement. Furthermore, the Company concluded the quarter with reportable delinquency of 3.65%.</p>\n<p>During the quarter, Axis launched DriveAxis.ca, its D2C platform. This 100% digital retail solution allows consumers to purchase/finance a used vehicle from anywhere at any time and get it delivered to their home. The pilot, which was launched in the <span>Ontario</span> market, featured 5 dealers listing approximately 500 vehicles on the platform.</p>\n<p>In <span>October 2021</span> , Axis' senior secured credit facility was expanded to a maximum committed funding amount of <span>$120 million</span> , while borrowing costs decreased to Prime Rate plus 1.90%. The maximum advance rate on the facility was increased to 77%.</p>\n<p>In <span>November 2021</span> , Axis closed a non-brokered private placement of common shares at a price of <span>$0.50</span> per common share, for total gross proceeds of <span>$15 million</span> . The investment was made by NowLake Technology, LLC, the fintech parent company of Westlake Financial.</p>\n<p>\n<span>About Axis Auto Finance</span>\n</p>\n<p>Axis is a financial technology company changing the way Canadians buy and finance used vehicles. Through our direct-to-consumer portal, DriveAxis.ca, customers can choose their next used vehicle, arrange financing and get the car delivered to their home. Through its indirect loan origination channels, Axis continues to provide alternative used vehicle financing options to roughly 30% of Canadians (Source: Equifax) that have credit scores in the non-prime range. All Axis auto loans report to Equifax, resulting in over 70% of customers seeing a significant improvement of their credit scores. Further information on the Company can be found at <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3445385-1&amp;h=737313422&amp;u=https%3A%2F%2Fshared.outlook.inky.com%2Flink%3Fdomain%3Dwww.axisfinancegroup.com%26t%3DeyJ0eXAiOiJKV1QiLCJhbGciOiJFUzI1NiJ9.eJx1UF1rwjAU_S95ViuuPqwgKAx9akZni0YKcm2vJjVNQ5K207H_vmTsdW8Xzj2fX8QhtKImCYFPYcmECOXQKJAkuYK0OCHoMQ5Golp3Gg040bVg7uiEus2qrvWcQP8P640MAs5pm5RRGY3jOAtWV6FAVXgzXa_DaxkJNaB1nbFTbdDaqUGJYNGWkZd5L0iieiknxHGD4M4SB_TKc5842LMj19XjVV92mme7bQxHyuvjx3BqZc8Oy-a0XzaXxXygb5vHKecNW2QP2mwFa4tFeijiNOcyfWYv7EDv7LmJ_T2kORvTPItpU8zpPo7pbbUKjSyaM7Yg5BnqOkT1_kI2sA69oHfdX7ffBb5_AMryfHQ.MEQCIG1Qkg-2J2G2JUQem-h1r-_5R81W0hDCS51jh9LUBl2TAiAx98yopvF6m-w3rWpMHtL_rBAHfES9wjxAQrGLS08OMw&amp;a=https%3A%2F%2Fwww.axisfinancegroup.com%2Finvestors-press-releases%2F\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.axisfinancegroup.com/investors-press-releases/</a> .</p>\n<p>\n<span>\n<span>Non-IFRS Measures</span>\n</span>\n</p>\n<p>\n<span>The Company's interim unaudited consolidated financial statements have been prepared in accordance with International Financial Reporting Standards (\"IFRS\") as issued by the International Accounting Standards Board (\"IASB\") and the accounting policies we adopted in accordance with IFRS. The Company believes that certain Non-IFRS Measures can be useful to investors because they provide a means by which investors can evaluate the Company's underlying key drivers and operating performance of the business, exclusive of certain adjustments and activities that investors may consider to be unrelated to the underlying economic performance of the business of a given period. A full description of these measures can be found in the Management Discussion &amp; Analysis that accompanies the financial statements for the corresponding period.</span>\n</p>\n<p>\n<span>The TSX Venture Exchange has neither approved nor disapproved the contents of this press release. Neither the Exchange nor its Regulation Services Provider (as that term is defined in the policies of the Exchange) accepts responsibility for the adequacy or accuracy of this release.</span>\n</p>\n<p>SOURCE Axis Auto Finance Inc.</p>\n<p>View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/February2022/16/c6941.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/February2022/16/c6941.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}