{"date": "2021-09-09 18:00:23.269000+00:00", "ticker": "AVV", "mrkt_info": {"open": 4146.0, "close": 4036.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Read Article Aramco, one of the world's largest integrated energy and chemicals companies, and AVEVA, a global leader in industrial software, driving digital transformation and sustainability, have announced their intention to form a strategic alliance...</p><p>Aramco, one of the world's largest integrated energy and chemicals companies, and AVEVA, a global leader in industrial software, driving digital transformation and sustainability, have announced their intention to form a strategic alliance. Focused on driving sustainability in the region through digital transformation, the partnership will help enable AVEVA to establish their largest digital hub, with an R&amp;D capability, in the Middle East, headquartered in Saudi Arabia. This partnership will represent a significant investment for AVEVA which is also looking to create up to 300 high skill new jobs in the Kingdom by 2030. <br/><br/> This transformative and groundbreaking partnership is designed to foster a working relationship between the two companies in the deployment of various digital technologies including Artificial Intelligence (AI), Machine Learning (ML), and Data Management.  AVEVA and Aramco aim to work together to unlock the benefits of these technologies in line with the Kingdom's move towards industrial sustainability. One of the key focus areas of the partnership would be to utilize digital technologies to support the development and implementation of blue hydrogen and decarbonization facilities in Saudi Arabia in line with the Kingdom's energy transition strategy.  Another area in which the companies intend to work together is in the implementation of cutting-edge predictive analytics technology across Aramco's operating facilities.  This would be one of the largest deployments of such technology in the region and the main goal is to further improve the reliability, performance, and safety of Aramco's operation. <br/><br/> A key offering for customers in the region through this new hub is intended to be AVEVA's trademark Digital Twin technology which combines asset design and predictive analytics in order to create a fully integrated, real-time data visualization center that reveals functional insights, unlocks efficiencies, and identifies new pathways to optimize performance. The new hub, through its R&amp;D capability, would contribute to enriching Saudi Arabia's knowledge economy incorporating world-class research at prominent universities across the Kingdom. <br/><br/> Commenting on the initiative, Ahmad Al-Sa'adi, Senior Vice President of Technical Services, Aramco, said \"One of the key pillars for realizing the Kingdom's Vision 2030 is Digital Transformation. Digital technologies have the potential to accelerate the transformation of the industrial sector and drive it towards more efficient and sustainable operations. Establishing partnerships with leaders in industrial digital software, such as AVEVA, is one of the main elements in our digital transformation strategy and we believe will help us realize our mission of leveraging digital solutions to deliver tomorrow's energy more sustainably, efficiently, and safely. The regional hub that would be established by AVEVA would contribute to Aramco's 'In Kingdom Total Value Add' (IKTVA) program goals and will facilitate Saudi Arabia's path to realizing the benefits of a digital economy.\" <br/><br/> AVEVA's CEO Peter Herweck also commented, \"AVEVA is proud to be working with Aramco towards an agreement to facilitate its digital transformation journey.  Through this partnership the vision of our companies is to play a fundamental role in industrial sector decarbonization within Saudi Arabia and the delivery of its sustainable goals, bringing capabilities to optimize every aspect of the value chain with sophisticated imaging, data analytics and deep-learning technologies that this initiative would bring. Through this initiative AVEVA aims to contribute to creating job opportunities in the Kingdom and throughout the Middle East region.\"</p></div><div class=\"tr-npp-body\"><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}