{"date": "2021-11-14 19:45:19.951000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Omron Healthcare has revealed a new interactive feature for Amazon Alexa devices that is capable of taking blood pressure readings.</p><p>The feature will allow Amazon Alexa users to find out about their cardiovascular health at home if they ask simple questions like, \"Alexa, what was my blood pressure average this month?\"Omron is referring to the new technology as a skill for Alexa, which works through the Omron Connect app. This can sync with all of Omron's connected blood pressure monitors. The new skill enables Alexa to compare a user's readings across different dates and times of the day, and judge the latest reading against the last highest or lowest recorded reading. It can also provide average readings upon request and locate and read back the latest blood pressure readings.With this feature Alexa can also provide guidelines and tips to ensure accurate blood pressure measurement. Users can receive updates on their recent blood pressure readings and insights on the state of their health, whenever they ask.Omron said it is aiming to equip people with innovative technology that makes daily blood pressure monitoring easier.Research has shown that patients who self-monitor their blood pressure at home might be associated with decreased blood pressure levels because this behaviour is linked to treatment compliance.Omron Healthcare European president and CEO André Van Gils said: \"At Omron, we're focused on helping people live active and comfortable lives, without any compromises on health. Adding our Omron skill for Alexa is a major stride in that direction.\"Your blood pressure provides important health insights. Monitoring it regularly empowers you with knowledge, helps you act on your numbers sooner, and can even save your life.\"He added: \"It's more important than ever for us to find new ways to help people simplify and ease their blood pressure monitoring habits, so that they can understand and manage their condition more efficiently.\"To use the Omron skill on Alexa, users will need the Alexa app and the Omron Connect mobile app, which are both available for free download from the Apple iOS or Google Play stores. Each time users want to access information about their heart health they will need to ask Alexa to open Omron connect.The Omron Alexa skill is available as of January 2019 in the UK and will be available in the rest of Europe in the coming months.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}