{"date": "2021-12-01 19:51:04.411000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwlistdisc{list-style-type:disc;}</style><p class=\"bwalignc\">\n<b>Presidio, CrowdStrike and AWS Team Up to Reduce Ransomware Attacks with New Ransomware Mitigation Kit</b>\n</p><p class=\"bwalignc\">\n<span> Organizations Can Now Predict, Identify, Protect, Detect, and Respond </span><span>to Ransomware Attacks in Real-time</span>\n</p><p>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.presidio.com%2F&amp;esheet=52542792&amp;newsitemid=20211201005633&amp;lan=en-US&amp;anchor=Presidio%2C+Inc.&amp;index=1&amp;md5=8c1b34b8aab2b1c7767e9230f7e8e553\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Presidio, Inc.</a>, a global digital services and solutions provider accelerating business transformation through security technology modernization, today announced a new solution to address the increasing prevalence of ransomware attacks, the <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fmarketplace%2Fpp%2Fprodview-73xl7ehjqihz6%3Fsr%3D0-1%26ref_%3Dbeagle%26applicationId%3DAWSMPContessa&amp;esheet=52542792&amp;newsitemid=20211201005633&amp;lan=en-US&amp;anchor=Ransomware+Mitigation+Kit&amp;index=2&amp;md5=a1e981994db86b517c58874f2a968b20\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Ransomware Mitigation Kit</a>. The new platform defends against ransomware and sophisticated cyberattacks through a comprehensive service combining leading security capabilities of Presidio, CrowdStrike, and CloudEndure, an Amazon Web Services (AWS) company.\n</p><p>\nGlobal cybercrime is expected to grow by 15 percent year-over-year the next five years -- reaching $10.5 trillion USD annually by 2025, up from $3 trillion USD in 2015 according to Cybersecurity Ventures. Through the new Ransomware Mitigation Kit, organizations are armed with unprecedented protection against cyber events to address all five pillars of the NIST Cybersecurity Framework. The Ransomware Mitigation Kit gives organizations an end-to-end white glove service to identify and protect against cyber threats, detect, and respond to risks as they occur and recover all critical data and applications prior to the breach.\n</p><p>\nThe Ransomware Mitigation Kit combines Presidio’s industry-leading services with CrowdStrike and CloudEndure’s technologies to establish a strong cloud security foundation for organizations to defend against ransomware and sophisticated adversaries:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\nComprehensive visibility and breach protection across all digital assets\n</li>\n<li>\nA strong cloud security foundation to defend against ransomware and sophisticated cyber events\n</li>\n<li>\nDetection and attack prevention, leveraging community immunity\n</li>\n<li>\nSwift response and attack mitigation, preventing lateral spread of ransomware to other devices within or outside of the organization\n</li>\n<li>\nBackup recovery that allows an organization to reclaim and restore all lost or compromised data and applications prior to the attack\n</li>\n</ul><p>\n“There is no one silver bullet when it comes to mitigating ransomware attacks and other cyber incidents,” said Sandy Carter, Vice President, Worldwide Public Sector Partners and Programs at AWS. “Protection requires a layered approach and a team that is on top of emerging threats and capable of maximizing the benefits of industry-leading security technology such as the combination of Presidio, CrowdStrike and AWS.”\n</p><p>\nPrevious approaches to ransomware mitigation and cyber protection were bifurcated, disjointed, and required reliance on mutable backups. As attacks and malicious activity become more sophisticated, prevention, detection and response to attacks must become more agile. Leveraging AI and automation, the Ransomware Mitigation Kit eliminates most manual effort, dramatically cutting down on the time, money and resources needed to combat bad actors.\n</p><p>\n“The ability for an organization to identify and respond to cybersecurity incidents could mean the difference between a minor disruption and a potential catastrophic event. Tens of thousands of cybersecurity events occur on a daily basis that have the potential to cripple an organization for weeks or months at a time,” said David Trader, Field CISO at Presidio. “It’s not a matter of if your organization will experience a crippling cyber event, it’s a matter of when. Preparation is critical. Our new solution can stop ransomware in its tracks, saving immeasurable time, resources and money.”\n</p><p>\nThe Presidio Cybersecurity Practice covers a broad security services portfolio. Highly skilled and tenured cybersecurity practitioners maintain leading industry certifications, provide thought leadership and practical industry experience. The team has conducted thousands of engagements across all major industry segments.\n</p><p>\n<b>About Presidio</b>\n</p><p>\nPresidio is a global digital services and solutions provider accelerating business transformation through secured technology modernization. Extensive teams of engineers and solutions architects with deep expertise across cloud, security, networking, and modern data center infrastructure help customers acquire, deploy and operate technology that delivers impactful business outcomes. Presidio is a trusted strategic advisor with a flexible full life cycle model of professional, managed, and support and staffing services to help execute, secure, operationalize and maintain technology solutions. For more information visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.presidio.com%2F&amp;esheet=52542792&amp;newsitemid=20211201005633&amp;lan=en-US&amp;anchor=www.presidio.com&amp;index=3&amp;md5=c071324f57dc27cad02b37a9d52d979b\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.presidio.com</a>.\n</p><p><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211201005633/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211201005633/en/</a></span></p><p>\nPress:\n</p><p>\nStephanie Siano\n<br/><a href=\"mailto:presidio@shiftcomm.com\" data-type=\"email\" translate=\"no\">presidio@shiftcomm.com</a><br/>646-756-3712\n</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NY-PRESIDIO</p></div>"}