{"date": "2021-12-17 15:00:18.496000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3466.3, "close": 3400.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NEXTECH AR SOLUTIONS CORP (\"NTAR-Z;NEXCF-0\")\n- Event Hosted by the VRARA\n\n  Nextech AR Solutions Corp. (\"Nextech\" or the \"Company\"), a Metaverse\nCompany and leading provider of augmented reality (\"AR\") experience\ntechnologies and services is pleased to announce that CEO Evan Gappelberg\nwill present the Company's Metaverse solutions at the \"Metaverse Platforms\n&amp; Avatars\" virtual event today, December 17.\n\n  Hosted by the VR/AR Association (VRARA), the event will showcase a full\nday of disruptive ideas and ground-breaking insights, innovations, and\ntechnologies by bringing together the most revolutionary minds and\ncompanies. Featuring representatives from Microsoft, Snap, HTC Vive,\nGoogle, and more, this high-profile event will provide Nextech with the\nopportunity to present its end-to-end Metaverse offering to a substantial\nattendee list as well as the opportunity for 1-on-1 networking with other\nspeakers and VIP attendees.\n\n  Event DetailsDate: Friday, December 17, 2021Speaker: Nextech AR CEO, Evan\nGappelbergPresentation time: 1:00pm ESTRegistration Link:\n<a href=\"https://hopin.com/events/metaverses-and-avatars/registration\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://hopin.com/events/metaverses-and-avatars/registration</a>\n\n  Nextech has undergone transformative growth in 2021, ultimately\nrebranding as a Metaverse company to better align with its vision and\ntechnology stack. With a full suite of integrated products, Nextech is\npositioned to capitalize on the Metaverse economy as one of the only\nend-to-end Metaverse solutions. The Company's notable ARitize Metaverse\nStudio is the platform that allows customers to not only create a\nmini-metaverse environment through spatial mapping, but also populate that\nmini-metaverse with AR content including human holograms, 3D AR products,\nAR wayfinding, AR advertisements, and more.\n\n  Announced in a recent press release, Nextech's ARitize Metaverse Studio\nis currently available as a managed service but is expected to be launched\nas a SaaS solution in early Q1 2022, bringing all of Nextech's solutions\ntogether into one, easy to use, web-based studio. Nextech's customers can\naccess all their 3D assets, compose AR experiences, and publish them into\nthe Metaverse in any format. In ARitize Metaverse Studio, customers can\nmanage 3D/AR content and point cloud maps, which are used for localization.\nIt also gives users the ability to update these point cloud maps and 3D/AR\ncontent in their application in real-time. ARitize Metaverse Studio will\nassist in managing and creating mini-metaverse environments such as\nshopping malls, airports, museums, university campuses, and more.\n\n  Nextech AR CEO Evan Gappelberg commented, \"The Metaverse is a trillion\ndollar opportunity that big tech has recognized. Countless companies have\nall joined the Metaverse revolution and are looking for innovative\ncompanies like Nextech and others to provide 3D and AR solutions. I'm\nlooking forward to presenting at the VRARA event and showcasing our unified\nMetaverse platform that integrates Nextech's entire suite of AR solutions.\nWe are a small cap company that has the tech stack of a large cap - and I\nbelieve we are one of the only, if not the only true end-to-end Metaverse\nsolutions, giving us a first mover advantage.\"\n\n  Nextech is currently a member of the VRARA, along with notable companies\nsuch as Microsoft, Unity, Meta, Intel, Google and many more.\n\n  About the VRARAThe VR/AR Association (VRARA) is an international\norganization designed to foster collaboration between solution providers\nand end-users that accelerates growth, fosters research and education,\nhelps develop industry best practices, connects member organizations and\npromotes the services of member companies.\n\n  Latest News from Nextech:\n\n  Dec 9 - Nextech AR, Microsoft, and Ryerson to Present at \"The Metaverse &amp;\nAugmented Reality Labs\" Event with Technology And Edtech Partners Dec 8 -\nNextech AR Integrates with Coinbase Commerce, Now Accepting Cryptocurrency\nas Payment Method Nov 30 - Nextech AR Launches ARitize 3D SaaS Offering For\nEcommerce Nov 18 - Nextech AR Launches Major 3D Metaverse Upgrade To Its\nEvents Platform Nov 16 - Nextech AR Rebrands as a Metaverse Company\n\n  To learn more, please follow us on Twitter, YouTube, Instagram, LinkedIn,\nandFacebook, or visit our website: <a href=\"https://www.Nextechar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.Nextechar.com</a>.\n\n  On behalf of the Board of Nextech AR Solutions Corp.Evan GappelbergCEO\nand Directorinfo@nextechar.com 866-274-8493\n  About Nextech ARNextech AR Solutions is a Metaverse company that develops\nand operates augmented reality (\"AR\") platforms, transporting\nthree-dimensional (\"3D\") product visualizations, human holograms and 360\nportals to its audiences altering e-commerce, digital advertising, hybrid\nvirtual events (events held in a digital format blended with in-person\nattendance) and learning and training experiences.\n\n  Nextech focuses on developing AR solutions for the Metaverse, however\nmost of the Company's revenues are derived from three e-Commerce platforms:\nvacuumcleanermarket.com (\"VCM\"), infinitepetlife.com (\"IPL\") and\nTrulyfesupplements.com (\"TruLyfe\"). VCM and product sales of residential\nvacuums, supplies and parts, and small home appliances sold on Amazon.\n\n  Forward-looking StatementsThe CSE and the NEO have not reviewed and do\nnot accept responsibility for the adequacy or accuracy of this release.\n\n  Certain information contained herein may constitute \"forward-looking\ninformation\" under Canadian securities legislation. Generally,\nforward-looking information can be identified by the use of forward-looking\nterminology such as, \"will be\" or variations of such words and phrases or\nstatements that certain actions, events or results \"will\" occur.\nForward-looking statements regarding the completion of the transaction are\nsubject to known and unknown risks, uncertainties and other factors. There\ncan be no assurance that such statements will prove to be accurate, as\nfuture events could differ materially from those anticipated in such\nstatements. Accordingly, readers should not place undue reliance on\nforward-looking statements and forward-looking information. Nextech will\nnot update any forward-looking statements or forward-looking information\nthat are incorporated by reference herein, except as required by applicable\nsecurities laws.\n\nInvestor Relations\nLindsay Betts\ninvestor.relations@Nextechar.com\n866-ARITIZE (274-8493) Ext 7201\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2135000190.MNPRE2135000969-06591320211217</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}