{"date": "2022-01-12 08:00:27.227000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">LONDON, Jan. 12, 2022</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">LONDON</span>, <span class=\"xn-chron\">Jan. 12, 2022</span> /PRNewswire/ -- Net4, a UK-based technology service provider, has today launched its video analytics platform, known as Net4.Vision, which is powered by AWS Wavelength.</p>\n<p><span>About Net4.Vision</span></p>\n<p>Net4.Vision is a scalable and flexible platform for video analytics with advanced security features. </p>\n<p>The Net4.Vision solution is built upon SeeWare, the physical recognition platform from SeeChange. It enables a wide variety of analytic models to be deployed across a wide range of industries and uses cases.  Net4.Vision can be used with both new and existing video cameras, extending the life and increasing the value provided by an organisation's existing cameras.</p>\n<p><span class=\"xn-person\">Alex Taylor</span>, Net4's CEO said, \"We are excited that Net4.Vision is now available to our customers. It is powered by AWS Wavelength and uses the 5G network, enabling our customers to reduce the cost of ownership of video analytics solutions whilst simultaneously enabling a scale-on-demand capability.\"</p>\n<p><span>Customer solutions</span></p>\n<p>Net4 and SeeChange, have joined forces to deliver smart building and health &amp; safety solutions as the initial customer propositions.</p>\n<p>Smart buildings: In the last few years the way our buildings and workplaces are used has changed. It is important for businesses and building owners to understand the changing use of workspaces. Net4's smart building solution provides detailed insights into workplace utilisation, driving optimisation and more efficient building usage.</p>\n<p>Health &amp; safety: Alongside this, Net4 has made available its health &amp; safety solution that focuses on increasing safety in the workplace. Accidents in the workplace not only cost money and impact operations but they also affect staff, visitors, and customers alike. The Net4 solution automatically monitors key areas for hazards such as spillages and obstructions, providing alerts and improving safety management.</p>\n<p>The Net4.Vision platform is available immediately on AWS Wavelength, enabling video analytics as a service on any 5G network where AWS Wavelength zones have been enabled. AWS Wavelength zones are already available in UK, <span class=\"xn-location\">Germany</span>, <span class=\"xn-location\">USA</span>, <span class=\"xn-location\">South Korea</span>, and <span class=\"xn-location\">Japan</span>. Net4 is inviting interested channel partners and customers to get in touch and find out how Net4.Vision can help improve their operations.</p>\n<p>About Net4 Ltd – <a href=\"http://www.net4.io/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.net4.io</a> </p>\n<p>Net4 is a technology solutions provider, delivering flexible &amp; scalable solutions that deliver value for its customers and partners.           </p>\n<p>We demystify the Internet of Things and build our solutions around your business need – taking care of the technology so you can focus on outcomes and benefits. Net4 is unique in delivering an end-to-end service - we source, install, connect and launch each product and provide support and system upscaling as your business evolves. Visit <a href=\"http://www.net4.io/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.net4.io</a> to learn more.</p>\n<p>About SeeChange Technologies</p>\n<p>SeeChange is a leader in AI-powered physical recognition software, enabling businesses to optimise operations, improve staff &amp; customer experience, and increase safety and compliance. Visit <a href=\"http://www.seechange.ai/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.seechange.ai</a> to learn more.</p>\n</div>\n<div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 PR Newswire Association,LLC. All Rights Reserved.</p></div>"}