{"date": "2021-12-02 16:41:20.910000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3443.72, "close": 3389.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>EZFILL HOLDINGS INC (\"EZFL-Q\")\n- Launches Holiday Gift Of Fuel To Help Customers Combat\n- Rising Fuel Prices This Winter\n\n     EzFill Holdings, Inc. (\"EzFill\" or the \"Company\") a pioneer and\nemerging leader in the fast-growing on-demand mobile fuel industry,\nannounced the launch of its holiday EzFill Gift of Fuel to help snowbirds,\ncollege students, and full-time residents in the Miami area save on gas and\nreduce or eliminate visits to the gas station this winter. In the spirit of\ngiving, and to help offset the rising cost of gas, the Company is enabling\nexisting customers to gift a free credit of $10 to new customers. EzFill\nwill then credit the gift giver $10 in appreciation for the referral.\n\n     EzFill, the largest on-demand fuel delivery provider in Florida,\nthrough the EzFill App, empowers people to fill up their cars without\nleaving the comfort and safety of the home or work. Customers simply need\nto open the app on their mobile device, provide their location, and\nschedule a delivery time for one of the Company's technicians to fuel their\nvehicle.\n\n     \"Instead of sending or being on the receiving end of another sweater\nor useless gadget, or falling victim to delivery snafus, we encourage\npeople this holiday season to send the Gift of Fuel to their friends and\nfamily members living in the Miami area. Whether they're snowbirds, college\nstudents or full-time residents, everyone can benefit from eliminating\ntrips to the gas station,\" said Mike McConnell, CEO of EzFill. \"Similar to\nwhat Amazon and DoorDash have done for household shopping and meal\ndelivery, EzFill is doing for car owners through the convenience of our\non-demand technology. We are committed to doing our part to help customers\nsave time and money, which we hope encourages them to take to the road to\nvisit friends and family, get to work on time and ultimately simplify their\nlives.\"\n\n     About EzFill\n\n     EzFill is a leader in the fast-growing mobile fuel industry, with the\nlargest market share in its home state of Florida. Its mission is to\ndisrupt the gas station fueling model by providing consumers and businesses\nwith the convenience, safety, and touch-free benefits of on-demand fueling\nservices brought directly to their locations. For commercial and specialty\ncustomers, at-site delivery during downtimes enables operators to begin\ntheir daily operations with fully fueled vehicles. For more information,\nplease visit <a href=\"https://getyourezfill.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://getyourezfill.com</a>.\n\n     Forward Looking Statements\n\n     This press release contains \"forward-looking statements\"\nForward-looking statements reflect our current view about future events.\nWhen used in this press release, the words \"anticipate,\" \"believe,\"\n\"estimate,\" \"expect,\" \"future,\" \"intend,\" \"plan,\" or the negative of these\nterms and similar expressions, as they relate to us or our management,\nidentify forward-looking statements. Such statements, include, but are not\nlimited to, statements contained in this press release relating to our\nbusiness strategy, our future operating results and liquidity and capital\nresources outlook. Forward-looking statements are based on our current\nexpectations and assumptions regarding our business, the economy and other\nfuture conditions. Because forward-looking statements relate to the future,\nthey are subject to inherent uncertainties, risks and changes in\ncircumstances that are difficult to predict. Our actual results may differ\nmaterially from those contemplated by the forward-looking statements. They\nare neither statements of historical fact nor guarantees of assurance of\nfuture performance. We caution you therefore against relying on any of\nthese forward-looking statements. Important factors that could cause actual\nresults to differ materially from those in the forward-looking statements\ninclude, without limitation, our ability to raise capital to fund\ncontinuing operations; our ability to protect our intellectual property\nrights; the impact of any infringement actions or other litigation brought\nagainst us; competition from other providers and products; our ability to\ndevelop and commercialize products and services; changes in government\nregulation; our ability to complete capital raising transactions; and other\nfactors relating to our industry, our operations and results of operations.\nActual results may differ significantly from those anticipated, believed,\nestimated, expected, intended or planned.\n\n     Factors or events that could cause our actual results to differ may\nemerge from time to time, and it is not possible for us to predict all of\nthem. We cannot guarantee future results, levels of activity, performance\nor achievements. The Company assumes no obligation to update any\nforward-looking statements in order to reflect any event or circumstance\nthat may arise after the date of this release.\n\n Contact Information:\n\nContact:\n\n     Investor and Contact:KCSA Strategic Communications\nKathleen Heaney / Joshua Greenwald\nEzFill@kcsa.com\n\nTel   : 305-791-1169    EZFILL HOLDINGS INC\nWWW   : <a href=\"https://www.getyourezfill.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.getyourezfill.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133500488.MNPRE2133502101-08123720211202</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}