{"date": "2021-12-15 03:02:31+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n        Amazon and Arlington County are providing capital to support a landmark preservation deal to create long-term affordability for over 1,300 apartment homes for a period of 99 years.\n      </div>\n                <div>\n                  <p>\n          Amazon commits $160 million commitment to help preserve more than 1,300 affordable apartment homes at the 60-acre Barcroft Apartment community located less than 3 miles from Amazon's new headquarters campus in Arlington, Virginia. Amazon will provide a low-rate loan to fill financing gaps and preserve the multi-family housing property to ensure rents stay within reach of the current tenants. Once the transaction is complete, the Barcroft Apartments preservation will be among the largest affordable preservation efforts in the region. It will create and maintain long-term affordability for 1,300 affordable homes specifically for families earning up to 60% area median income (AMI). According to Virginia Housing, 60% AMI in 2021 for a family of four in Arlington County is $77,400.\n        </p>\n                  <p>\n          To deliver on this initiative, Amazon will provide $160 million in low-rate loans, and Arlington County will secure $150 million in loans. The capital will support Jair Lynch Real Estate Partners' acquisition of the property and, with Amazon's support, ensure that more than 1,300 apartment homes at the 60-acre Barcroft Apartment site are preserved and maintained as affordable. The funding will also support the developer in making additional investments in the property, including adding amenities, making property upgrades, and taking other steps to improve residents' overall living environment. A portion of the funds will also be set aside to address any deferred maintenance and make immediate critical repairs to the units.\n        </p>\n                  <p>\n          \"The shortage of affordable housing has been a chronic challenge for this region. By teaming up with Arlington County, Amazon can help be a part of the solution,\" said Catherine Buell, director of the Amazon Housing Equity Fund. \"Joining forces with a diverse group of public and private housing partners ensures that moderate- to low-income families are supported with access to opportunity and long-term financial stability. These families are the heart of our community and include teachers, law enforcement, construction, and transit workers, just to name a few.\"\n        </p>\n                  <p>\n          Arlington County has lost approximately 13,100 privately owned, affordably priced housing units since 2000, according to the county's government data. Between 2010 and 2018, the median home value climbed approximately 20% (after adjusting for inflation), and median rents climbed 11%, while median household incomes climbed only 7%.\n        </p>\n                  <p>\n          \"Arlington County is committed to safe, stable affordable housing for Arlington residents,\" said County Board Chair Matt de Ferranti.\" This is a once-in-a-generation opportunity to preserve the largest neighborhood of privately owned, naturally occurring affordable housing in the County. By our actions today, we take a big step toward ensuring that the 1,100 current families living in this community are able to stay in their homes and have safe and affordable housing for the foreseeable future.\"\n        </p>\n                  <p>\n          In January 2021, Amazon announced the Housing Equity Fund, a more than $2 billion commitment to preserve and create over 20,000 affordable housing units in Washington state's Puget Sound region; Arlington, Virginia; and Nashville, Tennessee. Through low-rate loans and grants to housing partners, traditional and non-traditional public agencies, and minority-led organizations, the Fund prioritizes the equitable and inclusive development of resource-rich communities with easy access to neighborhood services, amenities, and jobs.\n        </p>\n                  <p>\n          Amazon's first Housing Equity Fund commitment in Arlington included below-market loans and grants to the Washington Housing Conservancy to preserve affordable homes on the Crystal House property in Arlington. The commitment also included a <span><a href=\"https://www.aboutamazon.com/news/community/amazon-to-donate-land-to-arlington-county-for-affordable-housing\" data-type=\"url\" class=\"tr-link\" translate=\"no\">donation of vacant land to Arlington County</a></span>to create new affordable units on the property. And in June, Amazon announced a new partnership with the Washington Metropolitan Area Transit Authority as part of Amazon's <span><a href=\"https://www.aboutamazon.com/news/community/amazons-2-billion-housing-equity-fund-announces-new-investments\" data-type=\"url\" class=\"tr-link\" translate=\"no\">$300 million total transit commitment</a></span>for equitable transit-oriented affordable housing development in communities it calls home. Most recently, the Fund announced the launch of the <span><a href=\"https://www.aboutamazon.com/news/community/amazon-launches-21m-program-for-real-estate-developers-of-color\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Housing Equity accelerator program</a></span>, a professional training, mentorship, and capital funding program to increase the number of professional real estate developers of color who are focused on affordable housing and inclusive community building.\n        </p>\n                  <p>\n          Since announcing its selection of Arlington as the site of its second headquarters three years ago, Amazon has donated more than $30 million to local nonprofits, community groups, and small businesses. These commitments are in addition to the over $500 million in commitments already made by <span><a href=\"https://www.aboutamazon.com/news/community/amazon-launches-2-billion-housing-equity-fund-to-preserve-and-create-over-20-000-affordable-homes\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Housing Equity Fund</a></span>in the form of low-rate loans and grants to create or preserve up to 2,300 affordable homes in the Arlington region, with more investments to come.\n        </p>\n                </div>\n                <div>\n                  <div>\n          Related Tags\n        </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/community\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Community</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/housing-equity\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Housing equity</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/arlington\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Arlington</a>\n                    </span>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/community/amazon-commits-160-million-to-preserve-housing-affordability-in-arlington-virginia\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>15 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>15 December 2021 03:02:31 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}