{"date": "2022-02-10 15:43:36.898000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3228.27, "close": 3180.07}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_5u9ntdyx&amp;referenceId=1_5u9ntdyx&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_5u9ntdyx&amp;referenceId=1_5u9ntdyx&amp;pageId=RefinitivNewscasts</a></pre>Source: Stocktube<br/><br/>Description: Feedback PLC (AIM:FDBK)'s (Feedback PLC (AIM:FDBK)) Tom Oakley talks to Proactive London about their interim results for the full-year outlook which is expected to be ahead of market expectations.&amp;#xD;&amp;#xD;&amp;#xD;Revenues in the six months to the end of November were up 9% on the same period of 2020 at £179,000 (2020: £165,000), despite revenues from legacy products such as Cadran and Texrad declining.&amp;#xD;&amp;#xD;&amp;#xD;Operating expenses increased by 25% in the reporting period to £1.36mln from £1.08mln, primarily due to increased headcount to drive the development and rollout of Bleepa.<br/>Short Link: <a href=\"https://refini.tv/3Ba0F9g\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3Ba0F9g</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; Hello, there. A very good morning. You're watching Proactive London and Tom Oakley is here from Feedback because today we are discussing your interim results in the six months period which ended on the 30th of November 2021. We're going to discuss your operations and much more. But of course, before we do talk about those important results just maybe remind the audience who Feedback are and what you do Tom. &gt;&gt; So Feedback is a medical device company. We specialize in bringing medical imaging into mainline clinical communication for doctors both in the NHS, but also internationally connecting clinical teams around, individual patient discussions, and bringing in the data that you need in order to make decisions as part of that conversation. So we have two co-products Bleepa, which is our communication platform and then CareLocker, which is a patient-specific Cloud architecture that lies underneath the Bleepa application. &gt;&gt; Okay. You mentioned those two there. How do you think the company is expected to benefit from the recent fundraise? I know it is all CareLocker and the Bleepa box as well? &gt;&gt; So the 11.2 million that we raised in November is absolutely critical to us being able to drive two huge opportunities for our technology. One here in the domestic market in the NHS space and one we saw in India around TB screening. The opportunity here in the NHS is around something called the community diagnostic center initiative. And this is how the government is trying to reduce elective care backlog in the NHS. And they're doing that by moving diagnostic capabilities out of hospital settings into the community closer to patients. And we need our infrastructure, our Bleepa communication solution to connect both primary and secondary care around that individual patient journey, and then to bring in all of the diagnostic data that the community diagnostic centers are generating, and centralize that into that patient record. So it's an opportunity both for Bleepa and for CareLocker. The second part of that is around TB screening. And this is where we're using our communication platform to take an X-ray in very remote locations within India, send that straight up into the Cloud in a CareLocker for that individual patient, and then to share that image with either AI tools or special clinical partners who can then give us a diagnostic results there and then while the patient is in the facility. So we should get real point-of-care TB screening from any location in India. Again, that's a huge scalable opportunity. But we needed that degree of funding in order to get off to both of those opportunities in parallel. And I'm very pleased to report that we have already now undertaken the technical deployments of the solutions in both settings and should very soon have our first patients going through. &gt;&gt; Fantastic. Well, let's talk more about India. Because we'll get you to explain the significance of CVS contract in these memorandum of understanding in India for future expansion outside of the NHS? &gt;&gt; Yes. So when you're looking at market opportunity, like in India it's really important to understand that as a relatively small company you aren't going to scale fast enough pace to deliver that opportunity in that market. Coupled with also the fact that a lot of the contracts we're going after will be government controlled contracts and they will preferentially get those contracts to Indian partners. And therefore, we've spent a lot of time trying to work out who are the right partners are in the Indian territories in order to actually deploy this at scale. We've already announced a couple of these. So the first of which was Qure.ai. And this is an AI provider who can analyze a chest x-ray and give us a diagnostic result and that will allow us to really provide very fast pace diagnostic input into those TB screening centers. But the other ones that we've announced to date are our partnerships with companies like Quest, Teleradiology who are provider who have radiologists who can provide a definitive report to those studies. But the most significant one and I think the one that our shareholders were most keen to here is we have Amazon Web Services, so AWS obviously are a provider of Cloud hosting capabilities. And they are the perfect provider for us department with because it is their Cloud that we'll be using to host the entire opportunity. And AWS have very generously provided funding to support us to roll this out the initial pilot stages and they will therefore be covering the hosting cost of us providing these pilots. &gt;&gt; And how does Feedback plan on further developing your products would you say Tom? &gt;&gt; So the cool product of Bleepa is buy and large now pretty defined and complete. There are always additional features that we will need to add to maintain the competitive advantage of a product, particularly around our image handling capabilities. Certainly in the community diagnostic space as we are handling a broader range of diagnostic tests we're also having to expand our capabilities of presenting those results into the communication stream. But most of the development is really around upgrading security, fixing any bugs in the system to make sure that our user journey is as smooth as possible. And then we also have to spend some work developing the architecture around CareLocker to make sure that it is really scalable in a very secure, robust way that maintains uptime in the system. We want it to be fundamentally reliable, and safe, and secure. &gt;&gt; You have alluded to some of this. But what can we expect from your various memorandums of understandings and pilots that are going on right now? &gt;&gt; So I think it's very important in healthcare that the shareholders and the wider market understand that a lot of his customers they like to pilot and test solutions. Every healthcare environment is a very different environment to one even just down the road. And so it's always necessary for us to put these in, set it up, get users onto it, and make sure that it works in that environment before customers will pay for it. It is just the nature of doing business in a healthcare setting. The MOUs and the pilots that we've pronouns are the first step in gaining a commercial contract with those organizations and therefore, they are very significant announcement and a key part of that progression from acquiring a customer. &gt;&gt; To summarize, what are your key near term milestones here? &gt;&gt; So our near-term milestones are really around getting these pilots live in both the community diagnostic setting and also in India because these are the legal opportunities that face us within the next 12-18 months. So that's where we're really focusing. &gt;&gt; Tom, before we let you go, of course, we got to talk about the results themselves. Maybe just give us a flavor of the top-line results if you're with them? &gt;&gt; No, absolutely. So I'm very pleased to report that in the period we've actually seen an increase in revenue by 9% to 179 K, which is obviously going up from last year as we had anticipated. And that also reflects the beginning of Bleepa revenue recognition in that period as we transition away from the legacy products into our new product, which are Bleepa and CareLocker. And also we have a very healthy cash position now. Closing out in November is 11.4 million, which is significantly higher than the previous year. &gt;&gt; Tom Oakley, thank you very much indeed from Feedback this morning here on Proactive London.<br/></span></div></div></div></div>"}