{"date": "2021-11-18 13:08:56+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n      Amazon Web Services (AWS) Skills Center offers interactive exhibits and free classes designed to engage and train anyone with a desire to learn.\n    </div>\n              <div>\n                <p>\n        \"We've designed it be a really open, welcoming space,\" said Maureen Lonergan, vice president of Training and Certification for AWS, of the company's new Skills Center in downtown Seattle. \"We recognize that the concept of cloud computing can be intimidating for many people, but we're here to show how the cloud powers so much of the world around us and why anyone can develop a basic understanding of it.\"\n      </p>\n                <p>\n        The Skills Center, which opens to the public on Monday, November 22, is just one component of AWS's ongoing investment in providing anyone with a desire to learn with access to free cloud computing skills training-part of a larger commitment to <span><a href=\"https://www.aboutamazon.com/news/workplace/amazon-to-help-29-million-people-around-the-world-grow-their-tech-skills-with-free-cloud-computing-skills-training-by-2025\" data-type=\"url\" class=\"tr-link\" translate=\"no\">train 29 million people</a></span>globally by 2025.\n      </p>\n                <p>\n        Amazon's first dedicated, in-person cloud learning space, it is designed for anyone curious about cloud computing, career possibilities in the industry, and how to gain the skills to achieve their career goals-especially for those with little or no technology background.\n      </p>\n                <p>\n        The Skills Center's expansive, open-plan Cloud Discovery Space brings the practical applications of cloud computing to life through a series of interactive exhibits. People can get hands-on with technology designed to showcase real-world uses of the cloud in familiar contexts such as video games, smart home technology, space, and sports. They can also find more information about cloud computing careers and ways to get started with skills training to pivot into such roles.\n      </p>\n                <p>\n        While the exhibits are intended to be an inspiring experience in their own right, Lonergan hopes that, for the majority of visitors, they will be a stepping stone to something more meaningful.\n      </p>\n                <p>\n        \"Basic cloud knowledge is increasingly critical in so many jobs,\" said Lonergan. \"And I'm not just talking about in tech. It's the case in almost every field, from manufacturing to financial services, consumer goods to academic research. We want to help as many people as possible access these opportunities by upskilling or reskilling in areas they may never have thought were for them.\"\n      </p>\n                <div>\n                  <div>\n                    <div>\n            Photo by JORDAN STEAD\n          </div>\n                    <div>\n            The center features six interactive exhibits to engage learners.\n          </div>\n                  </div>\n                  <div>\n                    <div>\n            Photo by JORDAN STEAD\n          </div>\n                    <div>\n            The center features computer-equipped classrooms.\n          </div>\n                  </div>\n                  <div>\n                    <div>\n            Photo by JORDAN STEAD\n          </div>\n                    <div>\n            The space exhibit showcases different displays from the moon, to Mars, to airplane air traffic on Earth.\n          </div>\n                  </div>\n                  <div>\n                    <div>\n            Photo by JORDAN STEAD\n          </div>\n                    <div>\n            An AWS DeepRacer exhibit gives individuals a fun, hands-on way to grasp machine learning concepts.\n          </div>\n                  </div>\n                  <div>\n                    <div>\n            Photo by JORDAN STEAD\n          </div>\n                    <div>\n            The robotics display demonstrates how various cloud technologies power smart robots.\n          </div>\n                  </div>\n                </div>\n                <h4>\n        Immediate access to opportunity\n      </h4>\n                <p>\n        Visitors whose interest is piqued by the Cloud Discovery Space can scan a QR code with their smart phone or one of the onsite tablets and sign up to take a short course-potentially there and then.\n      </p>\n                <p>\n        \"Depending on the timetable that day, someone could literally walk off the exhibition floor straight into one of our classrooms,\" said Lonergan.\n      </p>\n                <p>\n        The courses offered are \"bite-sized\" and require little commitment. Just enough, according to Lonergan, to \"start people on a path so they can see if it's something for them.\"\n      </p>\n                <p>\n        \"We've deliberately made this as flexible as possible,\" she said. \"Some courses are a couple of hours; some are a couple of sessions broken up across a few days. There are different entry points for people at different levels, so no one needs to feel as if they're biting off more than they can chew.\"\n      </p>\n                <p>\n        The entry points Lonergan describes include one course specifically for people who have never really used a computer and want to start by understanding the basics. Another is aimed at those who may be very familiar with computers but have no knowledge or previous experience of the cloud.\n      </p>\n                <p>\n        All learners will be supported by the center's full-time staff of AWS-certified trainers, as well as a range of guest AWS ambassadors, including solutions architects and volunteers from other technical and training departments.\n      </p>\n                <div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/workplace/amazon-to-help-29-million-people-around-the-world-grow-their-tech-skills-with-free-cloud-computing-skills-training-by-2025\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon to help 29 million people grow their tech skills with free cloud skills training</a>\n                    </span>\n                  </div>\n                  <div>\n          We will provide training opportunities through existing AWS-designed programs, as well as develop new courses to meet a wide variety of schedules and learning goals.\n        </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/workplace/amazon-to-help-29-million-people-around-the-world-grow-their-tech-skills-with-free-cloud-computing-skills-training-by-2025\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read more</a>\n                    </span>\n                  </div>\n                </div>\n                <p>\n        Those who enjoy their initial taste of the cloud will receive help navigating the range of AWS Training and Certification programs available to them beyond the center-and explore cloud career possibilities. The center will also host networking events with local employers and organizations to connect people with career information and job opportunities.\n      </p>\n                <p>\n        \"Many people excel from the get-go in self-paced, remote learning environments, but others need guidance-especially when they are taking on a completely new topic,\" said Lonergan on the rationale behind building an in-person training center, with plans for more in 2022. \"Sometimes it takes just one session, where someone can see something in action, for them to be able to go away and feel confident about continuing to learn by themselves.\"\n      </p>\n                <p>\n        \"Even if people don't want to sign up for one of our courses, at the very least we hope they will leave with a broader understanding of what cloud computing is,\" said Lonergan. \"Not to mention a real sense of excitement about the possibilities it holds for all of our futures.\"\n      </p>\n                <p>\n        The new AWS Skills Center opens to the public on Monday, November 22. See more details on <span><a>available events and classes</a></span>.\n      </p>\n                <p>\n        Learn more about AWS's other <span><a href=\"http://www.aboutamazon.com/29million\" data-type=\"url\" class=\"tr-link\" translate=\"no\">free skills training programs</a></span>and how to get started.\n      </p>\n              </div>\n              <div>\n                <div>\n        Related Tags\n      </div>\n                <div>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/aws\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS</a>\n                  </span>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/puget-sound-region\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Puget Sound region</a>\n                  </span>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/aws/aws-opens-free-cloud-computing-training-center-for-seattle-community\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>18 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>18 November 2021 13:08:56 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}