{"date": "2021-11-19 07:04:02.379000+00:00", "ticker": "III", "mrkt_info": {"open": 1434.0, "close": 1443.0}, "html": "<div class=\"storyContent\" lang=\"fi\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>Eltel Networks</div>\n<p>Eltelin rakentamat verkkoyhteydet toteuttavat uuden puhtaamman energian tuotannon ja kysynnän kohtaamista. Eltel ja tuuli- ja aurinkovoimapuistoja kehittävä OX2 ovat allekirjoittaneet sopimukset 400 kV voimajohdon sekä 110 kV voimajohdon rakentamisesta OX2:n uuteen Lestijärven tuulipuistoon Keski-Pohjanmaalla. Sopimusten yhteisarvo on noin 22 miljoonaa euroa.</p>\n<p style=\"margin-top:12px\"><span>Lestijärven tuulipuistosta tulee valmistuessaan Suomen suurin tuulipuisto 69 turbiinillaan ja noin 455 MW kokonaisteholla. Valmistuttuaan tuulipuiston vuosittainen energiantuotanto on noin 1,3 terawattituntia, joka vastaa noin kahta prosenttia koko Suomen sähköntuotannosta. Eltelillä on merkittävä rooli osana uusiutuvan ja kestävän energian ratkaisua hankkeen edetessä.</span></p>\n<p><span>Eltelin kokonaisuus koostuu kahdesta avaimet käteen -toimituksesta. Ensimmäinen kokonaisuus käsittää 58 km mittaisen 400 kV voimajohdon rakentamisen OX2:n uudelta Eltonevan sähköasemalta Fingridin Alajärven sähköasemalle, jonka kautta tuulisähkö syötetään kantaverkkoon. Toinen kokonaisuus sisältää 24 km 110 kV voimajohtoa, jolla tuulipuiston osa-alueet puolestaan liittyvät Eltonevan sähköasemaan. </span></p>\n<p><span>Juha Luusua, toimitusjohtaja, Eltel Networks Oy: ”OX2 on Euroopassa merkittävä tuulivoiman kehittäjä ja on hienoa tehdä heidän kanssaan yhteistyötä tässä merkittävässä uusiutuvan energian hankkeessa. Hankkeen kokoluokka on hyvä esimerkki siitä, kuinka suuri vaikutus tuulivoiman rakentamisella on ja tulee olemaan Suomen alue- ja kantaverkkoon. Eltelillä on Suomen sähkön jakelu- ja siirtoverkkojen rakentamisen ja ylläpidon suurimpana toimijana kyky vastata tuulipuistoissa kaapeloinnista, sähköasemista, voimajohto- ja kunnossapitopalveluista.”</span></p>\n<p><span>Teemu Loikkanen, maajohtaja, OX2: ”Liittymisjohto on keskeinen osa tuulivoimapuiston infraa. Eltelillä on kovan luokan osaamista ja kokemusta voimajohtojen rakentamisesta, jonka takia valitsimme heidät kumppaniksemme tähän hankkeeseen. Nyt rakennettavalla 400 kV liittymisjohdolla voimme siirtää Lestijärven projektin lisäksi noin 800 MW tuulisähköä muista hankkeista kantaverkkoon.”</span></p>\n<p><span>Projekti alkaa vuoden 2022 ensimmäisellä neljänneksellä ja puisto valmistuu vuoden 2025 alussa.</span></p>\n<p><strong><span>Lisätietoja:</span></strong></p>\n<p><span>Juha Luusua<br/>\ntoimitusjohtaja, Eltel Networks Oy<br/>\nPuh. 040 311 3005, juha.luusua@eltelnetworks.com</span></p>\n<p><span>Teemu Loikkanen<br/>\nMaajohtaja &amp; PPA, OX2<br/>\nPuh. 050 373 6243, teemu.loikkanen@ox2.com</span></p>\n<p><strong><span>Eltel</span></strong></p>\n<p><span>Eltel on johtava pohjoiseurooppalainen teknisten palveluiden toimittaja sähkö- ja tietoliikenneverkkotoimialalla. Tarjoamme laajan valikoiman palveluita ulottuen suunnittelu-, rakentamis- ja ylläpitopalveluista aina kokonaisvaltaisiin projektitoimituksiin saakka. Haluamme osallistua kestävän ja vastuullisen huomisen rakentamiseen nykyisille ja tuleville sukupolville. Eltelissä työskentelee noin 5,100 työntekijää, joista Suomessa noin 1,500. Liikevaihtomme vuonna 2020 oli 938 miljoonaa euroa. Osakkeemme on listattu Nasdaq Tukholmassa.</span></p>\n<p><a href=\"https://news.cision.com/fi/eltel-networks/r/eltelille-22-miljoonan-euron-sopimukset-ox2-tuulipuiston-voimajohtojen-rakentamisesta%2Cc3456587\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://news.cision.com/fi/eltel-networks/r/eltelille-22-miljoonan-euron-sopimukset-ox2-tuulipuiston-voimajohtojen-rakentamisesta%2Cc3456587</a></p>\n<p><a href=\"https://news.cision.com/fi/eltel-networks/i/eltel-van-in-winter-forest%2Cc2982123\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Eltel van in winter forest</a></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Waymaker BIT News - Cision 2021</p></div>"}