{"date": "2022-02-10 06:00:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3228.27, "close": 3180.07}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-story-p1\"><span class=\"tr-dateline\">OSLO, Feb 10 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>The unprecedented energy price volatility seen at the end of 2021 will have a lasting impact on the green energy power purchase agreement (PPA) market, <span class=\"tr-strong\">including a decline in long term contracts</span>, Pexapark said in a report published on Thursday.</p><p>PPAs have become a key part of renewable energy project development, providing a reliable revenue stream for asset owners outside of governments subsidy schemes by selling their output to utilities or corporate end-users.</p><p>A total of 11.2 gigawatts (GW) worth of PPAs were concluded in 2021 in Europe, with corporate clients, topped by U.S. retailer Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, taking the lead for the first time, contracting 6.5 GW compared with 4.63 GW from utility buyers, <span class=\"tr-strong\">the pricing platform and advisory firm </span>said in its European PPA Market Outlook 2022 report.</p><p>Utilities tend to sell on the production and need to manage price risks by breaking down long-term PPAs into shorter wholesale market trades, known as \"stack and roll hedging\", Pexapark said.</p><p>For them, the surge in energy prices in the fourth quarter resulted in significant mark-to-market losses and cash drains on margin payments, which could result in a future decline of traditional PPAs with 10-year maturities, it added. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2TR1GO\" data-type=\"storyId\" data-story-id=\"nL1N2TR1GO\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Corporate clients, on the other hand, typically procure PPA volumes to power their own operations and are willing to pay a higher PPA price, a trend Pexapark expected to continue in 2022.</p><p>In fact, it predicted the emergence of corporate \"mega buyers\" that needed to cover large energy needs, such as global data centre operators, chemical companies and green hydrogen producers, who would seek out offshore wind farm PPAs as well as equity investments.</p><p>Last year saw a first such deal, when German chemicals company BASF <a href=\"reuters://REALTIME/Verb=FullQuote/ric=BASFn.DE\" data-type=\"ric\" data-ric=\"BASFn.DE\" translate=\"no\" dir=\"ltr\">BASFn.DE</a> acquired a 49.5% stake in a Dutch 1.5 GW offshore wind farm being built by Sweden's Vattenfall. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL5N2O62M4\" data-type=\"storyId\" data-story-id=\"nL5N2O62M4\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Pexapark also expected the launch of new large funds out of the renewable investment capitals such as Hamburg, London and Copenhagen, that possess the risk management skills of a trading house and by actively managing shorter-term PPAs could become \"next generation utilities\".</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Nora Buli<br/>Editing by Marguerita Choy)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Nora.Buli@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Nora.Buli@thomsonreuters.com</a> ; (+47) 21 04 05 56; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://nora.buli.thomsonreuters.com@reuters.net\">nora.buli.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: EUROPE-POWER/PPA</p></div>"}