{"date": "2021-12-02 14:31:55.409000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Read Article Siemens Digital Industries Software and Amazon Web Services (AWS) announces an expansion of their collaboration, which combines Siemens' deep industry expertise with cloud services from AWS to help industrial companies accelerate digital t...</p><p>Siemens Digital Industries Software and Amazon Web Services (AWS) announces an expansion of their collaboration, which combines Siemens' deep industry expertise with cloud services from AWS to help industrial companies accelerate digital transformation in the cloud. Together, AWS and Siemens plan to drive adoption of Siemens' Xcelerator as a Service and make Siemens' Xcelerator portfolio of integrated software, services, and application development platform more accessible, scalable, and flexible. Xcelerator as a Service acts as a catalyst for fast and predictable digital transformation-including by gaining new manufacturing insights, automating processes, and deploying connected services-and offers customizable solutions for any starting point on the digital journey. <br/><br/> \"Siemens and AWS are coming together to help companies speed engineering efforts, optimize factory operations, and enhance customer experiences from chip to edge to cloud,\" said Tony Hemmelgarn, President and Chief Executive Officer at Siemens Digital Industries Software. \"We're excited to combine our proven cloud and industrial experience in this expanded partnership and simplify the journey for our mutual customers to become digital enterprises.\" <br/><br/> The strategic collaboration agreement between AWS and Siemens will see the companies cooperate to support customers; expand cloud capabilities in Siemens' Xcelerator as a Service portfolio; explore opportunities for innovation; and develop and take to market new solutions. One area of collaboration is digital twin technology, where Siemens and AWS will accelerate adoption and democratize new digital twin solutions using AWS IoT TwinMaker, a newly launched AWS service that makes it faster and easier to create digital twins that incorporate multiple data sources. Siemens' Xcelerator portfolio is already integrated with over 60 AWS services, and with the addition of AWS IoT TwinMaker, customers can apply AWS IoTTwinMaker to develop increasingly powerful digital twin solutions that are compatible with Siemens' design, simulation and manufacturing software. <br/><br/> \"Working together, Siemens and AWS will make it easier for industrial customers to use Siemens' comprehensive digital twin technology and AWS's cloud services to deliver new manufacturing insights, automation, and connected services,\" said Bill Vass, Vice President of Engineering at AWS. \"Together, we'll bring new cloud-based digital transformation solutions to market that will help companies of any size address industrial complexity and turn it into competitive advantage\". <br/><br/> Siemens Digital Industries Software is driving transformation to enable a digital enterprise where engineering, manufacturing, and electronics design meet tomorrow. The Xcelerator portfolio helps companies of all sizes create and leverage digital twins that provide organizations with new insights, opportunities, and levels of automation to drive innovation. For more information on Siemens Digital Industries Software products and services, visit siemens.com/software or follow us on LinkedIn, Twitter, Facebook, and Instagram. Siemens Digital Industries Software – Where today meets tomorrow. <br/><br/> Siemens Digital Industries (DI) is an innovation leader in automation and digitalization. Closely collaborating with partners and customers, DI drives the digital transformation in the process and discrete industries. With its Digital Enterprise portfolio, DI provides companies of all sizes with an end-to-end set of products, solutions and services to integrate and digitalize the entire value chain. Optimized for the specific needs of each industry, DI's unique portfolio supports customers to achieve greater productivity and flexibility. DI is constantly adding innovations to its portfolio to integrate cutting-edge future technologies. Siemens Digital Industries has its global headquarters in Nuremberg, Germany, and has around 76,000 employees internationally. <br/><br/> Siemens AG (Berlin and Munich) is a technology company focused on industry, infrastructure, transport, and healthcare. From more resource-efficient factories, resilient supply chains, and smarter buildings and grids, to cleaner and more comfortable transportation as well as advanced healthcare, the company creates technology with purpose adding real value for customers. By combining the real and the digital worlds, Siemens empowers its customers to transform their industries and markets, helping them to transform the everyday for billions of people. Siemens also owns a majority stake in the publicly listed company Siemens Healthineers, a globally leading medical technology provider shaping the future of healthcare. In addition, Siemens holds a minority stake in Siemens Energy, a global leader in the transmission and generation of electrical power.</p></div><div class=\"tr-npp-body\"><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}