{"date": "2021-11-19 10:46:42.671000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3549.0, "close": 3676.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>November 19, 2021</p></div><div class=\"tr-npp-lead\"><p>Starbucks and Amazon are collaborating on a new type of store where customers can pick up their favorite drinks or snacks without ever having to interact with other people.</p><p>On Thursday, the two companies opened a new location in New York City called Starbucks Pickup with Amazon Go, which combines the coffee chain's \"order ahead\" technology with the retailer's cashierless tools.</p></div><div class=\"tr-npp-body\"><p>The store will also feature a modern lounge with individual workspaces as well as larger tables with power outlets and USB ports.</p><p>Katie Young, Starbucks senior vice president of global growth and development, told USA TODAY the store is part of the chain's strategy of meeting customers where they are.</p><p>\"We know there will be differentstores for different purposes,\" saidYoung. \"We're really interested to see what role this type of store has to play.\"</p><p>With Starbucks Pickup, customers can place their orders within the app then swing by the store to pick them up, just like with regular mobile ordering, only with a a large digital screen in-store.</p><p>But they can also enter the Amazon Go market to grab other kinds of snacks using the Amazon app, a credit card, or Amazon One, which lets you scan your palm to gain access. Similar to other Amazon Go stores, customers can take the items they want and are charged once they leave.</p><p>Dilip Kumar, Amazon vice president of physical retail and technology, told USA TODAY that Starbucks Pickup with Amazon Go will have a variety of breakfast, lunch, dinner and snack items, including fresh salads and sandwiches, local brands and Starbucks items like protein boxes.</p><p>\"It caters to what customers are looking for throughout the day,\" said Kumar.</p><p>The Starbucks-Amazon partnership is the latest showcase of the retailer's cashierless tech.</p><p>In September, Amazon revealed it will open two Whole Foods Market stores next year featuring their \"Just Walk Out Technology.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Gannett</p></div>"}