{"date": "2022-01-25 09:27:03.446000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Jan. 25 -- In a significant turn of events, debt-laden Future Group on Tuesday rejected Amazon's offer of financial support, citing lower asset valuation than that offered by Reliance Industries Ltd.</p><p>It also raised objections that the timelines on when the financial aid would come were not clear. The independent directors have decided not to engage in any further discussions on the proposed offer, Future Retail (FRL) said in a letter to Amazon.</p></div><div class=\"tr-npp-body\"><p>Mint has reviewed a copy of the letter.</p><p>\"We have always been clear that we would assess any proposal, which provides a comprehensive solution for banks, employees, shareholders, vendors, and other stakeholders of FRL.\"</p><p>\"Your proposal does not meet this basic criteria on speed and timing of funding, legal compliance and adherence with the regulatory rulings, which you have simply chosen to ignore. This makes it apparent that your offer is more by way of posturing for extraneous reasons and not to address the crisis in which FRL finds itself. We had also made it clear that assessment of any proposal would be subject to FRL's legal obligations\".</p><p>On 21 January, the independent directors of Future Group asked Amazon whether it can arrange emergency funding of Rs.3,500 crore by Monday, in a positive response to the multinational retailer's overtures to financially support the Kishore Biyani-led company.</p><p>FRL, which failed to repay loans by 31 December, needs this amount urgently to avoid being declared a non-performing account (NPA). The directors had said FRL will use the money to repay loans. They also said Amazon is free to engage with FRL's lenders so that it does not fall foul of its obligations.</p><p>Future directors cited that the company needs Rs.12,027 crore for honoring its debt to lender and vendors upto March 2022.</p><p>\"Your proposal that FRL sells all its retail assets to Samara for a total consideration of Rs.7,000 crores is a sorry attempt to buy FRL's assets on the cheap, leaving FRL in a hopeless situation facing bankruptcy proceedings - all causing public injury and public harm,\" said Ravindra Dhariwal, independent director for FRL. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}