{"date": "2022-02-17 16:22:53.781000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3162.01, "close": 3052.03}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Every day, we scour Amazon to find the best deals available. Whether it's something for your kitchen or top-rated tech to give your smart home an upgrade, the online shopping giant offers some of the best prices on a  <span>very</span> wide range of items. Whatever you need, Amazon has you covered.</p></div><div class=\"tr-npp-body\"><p><span><span>Get deals and shopping advice delivered straight to your phone.</span> Sign up for text message alerts from the experts at Reviewed.</span> </p><p>Below, you'll find our top Amazon deals today, including a smart robot vacuum, some of our favorite fitness trackers and a sunrise alarm clock, all of which have been vetted by our team of deals experts to make sure they're \"best of web\" prices. If you're looking for N95 and KN95 masks right now, Amazon also has plenty of choices on sale today, too.</p><p>► <span>Presidents' Day: </span> Shop the best deals on mattresses, furniture and everything in between</p><p>► <span>Solo Stove sale:</span>  Stay warm and cozy in the cold with 35% off the fire pits we love</p><p>If you're not already an Amazon Prime subscriber, you can sign up for a 30-day membership for free. An Amazon Prime subscription gets you free two-day shipping and tons of other benefits for $12.99 a month ($6.49 for students and $5.99 for those receiving qualifying government assistance).</p><p>Better still, right now, shoppers can receive a $5 discount on their first $10-or-more Amazon app purchase. </p><p class=\"tr-npp-section-title\">The best Amazon deals of the day</p><p><big>1. Up to 35%: These best-in-class fitness trackers</big> </p><p>If you want to keep an eye on your fitness, Amazon has a variety of Fitbit devices on sale today for as much as 35% off. For instance, the Fitbit Charge 5, normally priced at $179.95, is now down to $119.25 thanks to a 34% discount. The Charge 5 is the best fitness tracker we've ever tested for many reasons, one of them being the compact size meant for maximum comfort, and a large-enough screen for easy reading. There's also the Fitbit Sense, typically listed for $299.95 but now available for $199.95, or 33% off, which is also one of the best fitness trackers we've ever tried for its emphasis on tracking and managing stress via an electrodermal activity sensor and an ECG app that measures the electrical activity of the heart to detect irregular rhythms.</p><p><span>Save up to 35% on Fitbit fitness trackers</span> </p><p><big>2. Less than $80: This sleek air purifier</big> </p><p>There are plenty of air purifiers to choose from, but some of the best ones are too large to be easily moved move around the house. Fortunately, the Levoit Core 200S is ultra-portable and can be yours for $79.98. Usually listed for $89.99, this 6.6-pound appliance is now on sale at a discount of $10.01. Levoit says the 200S can filter 99.97% of airborne contaminants in rooms as large as 183 square feet five times an hour. It also promises a quiet run while filtering and has a \"Display Off\" button for nighttime. </p><p><span>Get the Levoit Core 200S Air Purifier for $79.98 (Save $10.01)</span> </p><p><big>3. 28% off: This self-navigating robot vacuum </big> </p><p>Cover all ground in your next home cleaning with the Eufy RoboVac G30. Normally priced at $319.99, you can get this smart home appliance for $90 off at $229.99. Eufy said the G30 features Smart Dynamic Navigation 2.0 technology, which lets it plan logical route planning throughout your home instead of just approaching random spots. You can also control the G30 on your smartphone through the Eufy app, which also lets schedule cleaning times and even review cleaning history.</p><p><span>Get the Eufy RoboVac G30 for $229.99 (Save $90)</span> </p><p><big>4. Less than $40: One of our favorite alarm clocks</big> </p><p>The JALL Wake Up Light Sunrise alarm clock can make your morning's a bit easier. Typically listed for $45.98, this clock is now marked down to $39.08. The JALL device is our favorite affordable sunrise alarm clock for its impressive light and range of intensities that create a special type of ambiance. The accompanying tones of its alarm were a bit muffled, but the relaxing light is a great thing to have on your nightstand (especially at this price). </p><p><span>Get the Wake Up Light Sunrise Alarm Clock for $39.08 (Save $6.90)</span> </p><p><big>5. Save $20: This powerful blender</big> </p><p>Whether you need a fruit smoothie or a tasty milkshake, the Ninja BL660 blender can help make your favorite treats. You can get this 1100-watt kitchen appliance normally priced at $119.99 for just $99.99 right now on Amazon. Ninja says the blender has three speeds as well as pulse and a single-serve function to quickly crush ice. The blender also comes with a 72-ounce pitcher and two 16-ounce cups to take your treats on the go. </p><p><span>Get the Ninja BL660 Professional Countertop Blender for $99.99 (Save $20)</span> </p><p class=\"tr-npp-section-title\">The best Amazon deals from this week</p><p><big>1. Amazon Fire HD 10 Tablet</big> </p><p>The Amazon Fire HD 10 tablet usually starts from $149.99, but you can get one for 27% off right now, bringing the price down to $109.99. We ranked the Fire HD 10 as one of the best tablets we've ever tested thanks to its large display, which is capable of playing 1080p-resolution videos with reasonably true colors and black levels, and the relatively quick charging time. Though it doesn't have the strongest app collection compared with the competition from Apple and Google, it's hard to beat its current discounted price.</p><p><span>Get the Amazon Fire HD 10 from $109.99 (Save $40)</span> </p><p><big>2. Cosori 5.8-Quart Max XL Air Fryer</big> </p><p>Air fryers make the daily kitchen workload a whole lot easier, but some of the best models can be pretty pricey. Fortunately, the Cosori Max XL is a quality kitchen appliance at a more wallet-friendly price. Typically listed for $119.99, you can get this 5.8-quart fryer for as low as $107.94. The Max XL is our pick for the best affordable air fryer thanks to its digital controls with preset cooking programs for whatever you're in the mood for. Not only does it prepare crispy french fries, but its parts are also dishwasher safe.</p><p><span>Get the Cosori 5.8-Quart Max XL Air Fryer from $107.94 (Save $12.05)</span> </p><p><big>3. Waterpik WF 05 Whitening Water Flosser</big> </p><p>Bring some extra shine to your teeth with the Waterpik WF 05 water flosser. Normally priced at $119.99, this powerful dental tool is now available for 33% off at $79.81, and it comes with 30 of the brand's teeth-whitening tablets. Waterpik says you can insert one tablet into the top infuser of the flosser and it helps remove stains from hard-to-reach areas between the tooth and gum line. The brand says the use of the flosser with whitening tablets can restore your smile's natural whiteness within four weeks.</p><p><span>Get the Waterpik WF 05 Whitening Water Flosser for $79.81 (Save $40.18)</span> </p><p><big>4. Logitech C920x Pro HD Webcam</big> </p><p>Upgrade the quality of your home Zoom calls with the Logitech C920x Pro webcam. Typically listed for $69.99, this HD computer accessory is now $59.99, or $10 off. We picked the C920x as one of the best webcams we've ever tried for its display of sharp images and video quality, with our tester saying she could see the rims of her glasses in crisp focus. It's also got a hard plastic shell that we felt to be strong and durable, along with a layer of glass protecting its lens. </p><p><span>Get the Logitech C920x Pro HD Webcam for $59.99 (Save $10)</span> </p><p><big>5. Bose SoundLink Micro</big> </p><p>Taking your favorite songs on the go with you is now easier (and more affordable!) then ever with the Bose SoundLink Micro. Normally priced at $119, this palm-sized speaker is now just $99 thanks to a $20 price cut. The SoundLink Micro is one of the best portable Bluetooth speakers we've ever tested, having impressed us with its surprisingly soft silicone finish and waterproof material. Despite its lightweight and smaller size, the Micro still provides impeccable sound expected from the SoundLink line.</p><p><span>Get the Bose SoundLink Micro for $99 (Save $20)</span> </p><p class=\"tr-npp-section-title\">Other noteworthy Amazon deals we found </p><ul class=\"bulleted-list arrowlist\"><li>Save up to 36% on select Blink smart home security devices</li><li>HotHand Hand Warmers Value Pack for $5.79 (Save $7.16)</li><li>One month of Amazon Music Unlimited with an Echo Dot (3rd Generation) for $14.98 (Save $35)</li><li>Hertzko Self-Cleaning Slicker Brush for Dogs and Cats for $14.99 (Save $15.29)</li><li>Bella 17288 Double Cooker from $16.98 with coupon (Save $3.49 to $5)</li><li>Venus Visage Teeth Whitening Pen for $16.99 with coupon (Save $10)</li><li>Lement KN95 Face Mask 50-Pack for $19.99 (Save $40)</li><li>H&amp;R Block Tax Software Deluxe + State 2021 PC Download for $25.83 (Save $19.16)</li><li>Hilife HL7 Steamer for $29.99 (Save $6)</li><li>MySmile Powerful Cordless Water Dental Flosser from $47.59 (Save $33 to $36.40)</li><li>Philips Hue White and Color Ambiance A19 E26 LED Smart Bulb 3-Pack for $80.74 with coupon (Save $54.25)</li><li>Logitech G Pro Wireless Gaming Mouse for $78.17 (Save $51.82)</li><li>Bissell Power Fresh Steam Mop for $82.69 (Save $10)</li><li>Keurig K-Slim Coffee Maker from $89.99 (Save $20 to $40)</li><li>All-Clad D3 Stainless-Steel 12-Inch Fry Pan with Lid for $129.95 (Save $90.05)</li><li>Ultimate Ears BOOM 3 Portable Waterproof Speaker for $129.99 (Save $20)</li><li>Apple AirPods Pro for $174.98 (Save $74.02)</li><li>Tineco iFLOOR3 Cordless Wet Dry Vacuum from $249.99 with coupon (Save $50 to $60)</li><li>Amazon Fire TV Omni Series from $284.99 (Save $125 to $230)</li><li>Tuft &amp; Needle Mint Queen Mattress for $956 (Save $239)</li> </ul><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Updated daily: Here are the 10 best Amazon deals today</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}