{"date": "2022-01-12 22:19:11.429000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3307.24, "close": 3224.28}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>WONDERFI TECHNOLOGIES INC (\"WNDR-V;WONDF-0\")\n- $35 Million Bought Deal Public Offering\n\n     WonderFi Technologies Inc. (the \"Company\" or \"WonderFi\") is pleased to\nannounce that it has entered into an agreement with Canaccord Genuity\nCorp., as lead underwriter and sole bookrunner and on behalf of a syndicate\nof underwriters (collectively, the \"Underwriters\"), pursuant to which the\nUnderwriters have agreed to purchase, on a bought deal basis by way of a\nshort form prospectus, an aggregate of 14,584,000 units (the \"Units\") at a\nprice of $2.40 per Unit (the \"Offering Price\") for aggregate gross proceeds\nto the Company of approximately $35 million (the \"Offering\").\n\n     Each Unit shall consist of one common share (each a \"Common Share\")\nand one-half of one common share purchase warrant of the Company (each\nwhole warrant, a \"Warrant\"). Each Warrant shall be exercisable to acquire\none Common Share for a period of 24 months from closing of the Offering\n(the \"Closing Date\") at an exercise price of C$3.10 per share.\n\n     The Company has granted the Underwriters an option (the\n\"Over-Allotment Option\") to purchase up to an additional 2,187,600 Units at\na price of C$2.40 per Unit, exercisable at any time, for a period of 30\ndays after and including the Closing Date, which, if exercised in full,\nwould result in additional gross proceeds of approximately $5.3 million.\nThe Over-Allotment Option is exercisable to acquire Units, Common Shares\nand/or Warrants (or any combination thereof) at the discretion of the\nUnderwriters.\n\n     The Units will be offered by way of a short form prospectus to be\nfiled in all provinces and territories of Canada except Quebec. The\nOffering is expected to close on or before February 8, 2022 and is subject\nto certain conditions including, but not limited to, the receipt of all\nnecessary regulatory and stock exchange approvals, including the approval\nof the NEO Exchange (\"NEO\") and the applicable securities regulatory\nauthorities.\n\n     The Company will use best efforts to obtain the necessary approvals to\nlist the Common Shares, Warrants, and the Common Shares issuable upon\nexercise of the Warrants on the NEO.\n\n     In a separate transaction that is expected to close concurrently with\nthe Offering, certain officers and directors of the Company (collectively\nthe \"Selling Shareholders\") will be selling to the Underwriters an\naggregate of 500,000 common shares of the Company, on a block trade,\nprospectus-exempt basis, at the Offering Price for total gross proceeds to\nthe Selling Shareholders of approximately $1.2 million (the \"Concurrent\nBlock Trade\"). The Concurrent Block Trade will not be upsized. The\ncompletion of the Concurrent Block Trade is conditional upon the completion\nof the Offering.\n\n     The Company intends to use the net proceeds of the Offering to\npartially fund the purchase of the Company's previously announced\nacquisition of First Ledger Corp., fund growth initiatives and for general\ncorporate purposes.\n\n     In connection with the Offering, the Underwriters will receive a cash\ncommission equal to 6.5% of the gross proceeds raised pursuant to the\nOffering (including on exercise of the Over-Allotment Option, but subject\nto reduction to 3.25% on sales of up to $5,000,000 to investors on a\npresident's list, and 2% on any order greater than $10,000,000). The\nUnderwriters shall also receive that number of broker warrants equal to\n6.5% of the number of Units sold pursuant to the Offering (including on\nexercise of the Over-Allotment Option, but subject to reduction to 3.25% on\nsales of up to $5,000,000 of Units to investors on a president's list, and\n2% on any order greater than $10,000,000). Each broker warrant shall\nentitle the holder to acquire one common share in the capital of the\nCompany at a price $3.10 for a period of 24 months following the completion\nof the Offering.\n\n     The securities being offered have not been, nor will they be,\nregistered under the United States Securities Act of 1933, as amended, and\nmay not be offered or sold in the United States or to, or for the account\nor benefit of, U.S. persons absent registration or an applicable exemption\nfrom the registration requirements. This press release shall not constitute\nan offer to sell or the solicitation of an offer to buy nor shall there be\nany sale of the securities in any State in which such offer, solicitation\nor sale would be unlawful.\n\n     Additional Information For additional information, please contact:\n\n     WonderFi Technologies Inc. Ben Samaroo, CEO ben@wonder.fi (778)\n843-9637\n\n     ABOUT WONDERFI\n\n     WonderFi is a leading technology company with the mission of creating\nbetter access to DeFi through the core principles of simplicity and\neducation. WonderFi has a multi-pronged business strategy which includes a\nhigh-growth consumer finance app which will serve as a trusted gateway to\nthe new financial system, and a digital asset portfolio which consists of\nleading crypto and DeFi assets. WonderFi's executive team and Board of\nDirectors have an established track record in finance and crypto, with\nprevious experience at Amazon, Shopify, PayPal, Galaxy Digital and Hut 8.\nWonderFi's core team of engineers and technologists believe that everyone\nshould have equal access to finance, and are aligned in the mission to\nempower people around the world to access DeFi in a simple, smart and\nsecure way.\n\n     For more information, visit www.wonder.fi.\n\n     Forward-Looking Information and Statements\n\n     This press release contains certain \"forward-looking information\"\nwithin the meaning of applicable Canadian securities legislation and may\nalso contain statements that may constitute \"forward-looking statements\"\nwithin the meaning of the safe harbor provisions of the United States\nPrivate Securities Litigation Reform Act of 1995. Such forward-looking\ninformation and forward-looking statements are not representative of\nhistorical facts or information or current condition, but instead represent\nonly the Company's beliefs regarding future events, plans or objectives,\nmany of which, by their nature, are inherently uncertain and outside of the\nCompany's control. In this news release, forward looking-statements relate\nto, among other things, statements relating to the timing for the\ncompletion of the Offering and Concurrent Block Trade, the expected use of\nproceeds from the Offering, and the ability of the Company list the\nWarrants. Generally, such forward-looking information or forward-looking\nstatements can be identified by the use of forward-looking terminology such\n\"could\", \"intend\", \"expect\", \"believe\", \"will\", \"projected\", \"estimated\",\nor variations of such words. By identifying such information and statements\nin this manner, the Company is alerting the reader that such information\nand statements are subject to known and unknown risks, uncertainties and\nother factors that may cause the actual results, level of activity,\nperformance or achievements of the Company to be materially different from\nthose expressed or implied by such information and statements. In addition,\nin connection with the forward-looking information and forward-looking\nstatements contained in this press release, the Company has made certain\nassumptions. Among the key factors that could cause actual results to\ndiffer materially from those projected in the forward-looking information\nand statements are the following: the ability of the Company to work\neffectively with strategic investors; and changes in general economic,\nbusiness and political conditions, including changes in the financial\nmarkets, changes in applicable laws, and compliance with extensive\ngovernment regulation. Should one or more of these risks, uncertainties or\nother factors materialize, or should assumptions underlying the\nforward-looking information or statements prove incorrect, actual results\nmay vary materially from those described herein. Although the Company\nbelieves that the assumptions and factors used in preparing, and the\nexpectations contained in, the forward-looking information and statements\nare reasonable, undue reliance should not be placed on such information and\nstatements, and no assurance or guarantee can be given that such\nforward-looking information and statements will prove to be accurate, as\nactual results and future events could differ materially from those\nanticipated in such information and statements. The forward-looking\ninformation and forward-looking statements contained in this press release\nare made as of the date of this press release, and the Company does not\nundertake to update any forward-looking information and/or forward-looking\nstatements that are contained or referenced herein, except in accordance\nwith applicable securities laws. All subsequent written and oral\nforward-looking information and statements attributable to the Company or\npersons acting on its behalf is expressly qualified in its entirety by this\nnotice.\n\n     Neither NEO Exchange nor its Regulation Services Provider (as that\nterm is defined in policies of the NEO Exchange) accepts responsibility for\nthe adequacy or accuracy of this news release.\n\n Contact Information:\n\nInvestor Relations Contact: invest@wonder.fi; Media Contact:\npress@wonder.fi\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201100566.MNPRE2201102628-14160420220112</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}