{"date": "2022-02-22 17:11:00.132000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Amazon Sues ‘Fake Review Brokers’ Who Attempt to Profit From Generating Misleading and Fraudulent Reviews</b>\n</p><p class=\"bwalignc\">\n<span>Amazon seeks to shut down sites that threaten the authenticity of customer reviews</span>\n</p><p>\nAmazon (NASDAQ: AMZN) has filed lawsuits against fake review brokers who orchestrate the posting of incentivized and misleading product reviews, in exchange for money or free products.\n</p><p>\nThe lawsuits aim to shut down two major fake review brokers, AppSally and Rebatest, who helped mislead shoppers by having their members try to post fake reviews in stores such as Amazon, eBay, Walmart, and Etsy. This legal action is one part of Amazon’s comprehensive and proactive efforts to ensure a safe and trustworthy shopping experience for its customers and extensive opportunities to create thriving businesses.\n</p><p>\n“Fake review brokers attempt to profit by deceiving unknowing consumers and creating an unfair competitive advantage that harms our selling partners,” said Dharmesh Mehta, VP of WW Customer Trust &amp; Partner Support, Amazon. “We know how valuable trustworthy reviews are to our customers. That is why we are holding these review fraudsters accountable. While we prevent millions of suspicious reviews from ever appearing in our store, these lawsuits target the source.”\n</p><p>\nAmazon strictly prohibits incentivized or fake reviews and uses a combination of machine learning technology and skilled investigators to detect, prevent, and remove them. In 2020, Amazon stopped more than 200 million suspected fake reviews before they were ever seen by a customer. A nefarious industry has emerged in recent years, in which fraudsters facilitate fake or inflated reviews in exchange for money or free products.\n</p><p>\nAmazon’s legal action comes after an in-depth investigation into these review brokers, which taken together claim to have more than 900,000 members willing to write fake reviews. Fake review brokers attempt to hide their activity and evade detection. For example, the fake review site AppSally sells fake reviews for as low as at $20 and instructs bad actors to ship empty boxes to people willing to write fake reviews, and to provide AppSally with photos to be uploaded alongside their reviews. The fraudulent scheme run by Rebatest will only pay people writing 5-star reviews after their fake reviews are approved by the bad actors attempting to sell those items.\n</p><p>\nToday’s legal action shows Amazon’s determination to shut down fake review brokers. Amazon has previously won dozens of injunctions against fake review brokers, compelling them to provide information about who is paying for these fraudulent services. Most recently in late 2021, two major fake review sites in Germany and the UK were closed down following successful legal action by Amazon in those countries.\n</p><p>\nAmazon has more than 10,000 employees around the world protecting its store from fraud and abuse, including fake reviews. Amazon receives more than 30 million reviews each week, and uses a combination of machine learning technology and skilled investigators to analyze each review before it is displayed. Amazon actively monitors social media sites and regularly reports abusive groups to the companies that run them. In 2021, Amazon reported over 16,000 abusive groups to social media sites such as Facebook, Twitter, and Instagram, resulting in groups with over 11 million members being taken down.\n</p><p>\nAmazon was an early pioneer of product reviews, having introduced them in 1995 to help customers make more informed shopping decisions. Amazon continues to innovate and partner with others across the industry and law enforcement to ensure a trustworthy shopping experience for our customers and selling partners.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20220222005994r1&amp;sid=ny6r1&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjIwMjIyMDA1OTk0cjEmc2lkPW55NnIxJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=b67aecf519485aa7ef915c99633807502a0dfea0b2b86f7f3413165ccc834ba6a6a228702951c35fa51cb7bb5607e325859408662d88d5fae0019dcff26e25e0\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20220222005994/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220222005994/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52583426&amp;newsitemid=20220222005994&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=1&amp;md5=ae8e719d726a9a45277e53aedc998509\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2022</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON</p></div>"}