{"date": "2022-02-08 20:41:00.505000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_t8ty60m4&amp;referenceId=1_t8ty60m4&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_t8ty60m4&amp;referenceId=1_t8ty60m4&amp;pageId=RefinitivNewscasts</a></pre>Source: IG Group<br/><br/>Description: With four names being bandied about, Dan Ives, from Wedbush Securities, in NY, says Amazon would be a defensive play just avoid Apple getting its hands on Peloton, Nike would be a good sports play and Disney may be left field.<br/>Short Link: <a href=\"https://refini.tv/35NGMJs\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/35NGMJs</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; One of the market downings of the COVID lockdown was Peloton. Demand for its fitness machines outstripped supply, the stock rose almost 1,800%. Company ramped up production , then the market turned. Between the January 2021 highs and the recent lows, the stock lost 86% of those initial gains. As of the time of this recording, those lows in Peloton stock seemed to be steering an interest in the business from outside. Dan Ives, Tech Analyst and Managing Director at Wedbush Securities in New York joins us now on the line. Dan, good to talk to you. Thanks indeed for joining us on the pod today. &gt;&gt; Great to be here. Thank you. &gt;&gt; Now look, is this market talk or do you think this will lead to an offer for Peloton? &gt;&gt; I think there's more than market talk. Peloton is a unique asset, stocks, 80% parts off of the ties. And there's more and more pressure from activists and others for Peloton to potentially explore strategic alternatives. And I think there's going to be a number of bidders from Apple, to Amazon, to Nike, and others going for those unique asset. &gt;&gt; Before we take a look at those individually, do the recent lows in Peloton, do you think which are below the IPO price reflect the business, or do you see any bid having to price in a substantial premium from here? &gt;&gt; We likely think any deal would probably happen in the 12-15 billion range, called three times revenues. Definitely a premium to these prices. They've been in execution growth, brick wall Peloton and I think now, it's a premium brand, but they clearly have troubles as a stand-alone company, I think trying to accelerate growth. &gt;&gt; And so far as the names that have been mentioned, you mentioned a few of them. We're talking amongst the chatter today's being Amazon, Disney, Nike, Apple. What do you think is a good fit? Do you think all those potentially could be interested or do you think this is market chatter? &gt;&gt; Well, I think any assets such as Peloton, any health tech company is going to have to look at it. Especially given we're talking price points that can easily be absorbed by tech giants who are consumer stores with the likes of Nike. Health and streaming, that's not going away. And if you look what Peloton's built, 3 million subscribers and they've been growing unique brands, especially in the high end of the market premium brand, which I believe the best fit would probably be Apple in terms of a pure acquisition. Even though they historically have not done deals, it would fit extremely well into their ecosystem, 1.8 billion iOS devices in healthcare. But Apple is forced into an acquisition if Amazon went after it. Defensively, they would have to get into this because this could not end up with Amazon from the likes of Apple. &gt;&gt; That's an interesting point, actually, this idea about a defensive play. Do you see there for a possible bid coming in as well, left field from the likes of Alphabet, which owns Google? &gt;&gt; I wouldn't see that as much. I think Apple and Amazon are the ones that made the most sense from a tech play. Of course, Nike and other consumers, Star Wars could go after it. Nike, makes a ton of sense in terms of the consumer brand, health care, what they could do from a subscription perspective, cross-sell. And that's why right now It's a fork in the road for Peloton. Do they ultimately go down the process or try to do it themselves and turn this around. And I think there's also cautionary tales for companies that have been in this juncture, Fitbit, GoPro, and others, where ultimately if they hit the bid when they could have, it would've been a much different story. &gt;&gt; Absolutely. Do you think in that case, this is a fork in the road for Peloton that if it takes a wrong route, is a goodbye Peloton, or is it just to reform Peloton at a lower level? Do you think the good times are going to return to Peloton and with or without a bid? &gt;&gt; I think it's moderated growth, and I think it's going to be hard for them as a stand-alone to significantly accelerate especially given so many challenges they have, which is why if they hit another execution speed bump, activism would further build up, and then any potential acquire would be able to acquire it 30, 40% cheaper. &gt;&gt; What challenges does Peloton have down the road? As I said at the top, it did have this qualification of being a stock market darling during the COVID lockdown because we all needed to exercise. That situation is unlikely to arise again, unless of course we know not what's going to happen about COVID, but I mean, where does a company like this go? Is it ever going to achieve those highs again? &gt;&gt; No. I think they're no different than the Zooms and others. I think their highs are in the review mirror. It's a new normal that they're going to have to adjust to. And I think for them to expand their growth, they tried to go down to the treadmill path, it was a disaster. Subscriptions is going to be too. They obviously have a unique brand especially into clothing and what they've been able to establish globally. But it's going to be hard to hit the next wave of growth without a larger, accurate system running Peloton. &gt;&gt; Dan look, it's a pleasure to catch up with you. Thanks indeed for your time. I know you're a busy man and we welcome you on the show today to talk about Peloton. It's good to have you on. &gt;&gt; Thanks for having me. &gt;&gt; Dan Ives, Technical Analyst and MD at Wedbush Securities in New York.<br/></span></div></div></div></div>"}