{"date": "2021-11-23 10:25:47.462000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 1890TLift Global Ventures PLC23 November 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>\n<span>NOT FOR RELEASE, PUBLICATION OR DISTRIBUTION, IN WHOLE OR IN PART, DIRECTLY OR INDIRECTLY, IN OR INTO OR FROM THE UNITED STATES, AUSTRALIA, CANADA, JAPAN, OR SOUTH AFRICA OR ANY OTHER JURISDICTION WHERE IT IS UNLAWFUL TO DISTRIBUTE THIS ANNOUNCEMENT.</span>\n</span>\n</p>\n<p>\n<span>This announcement is not a prospectus and does not constitute an offer of securities for sale in any jurisdiction, including in or into the United States, Australia, Canada, Japan or South Africa.</span>\n</p>\n<p>\n<span>Neither this announcement, nor anything contained in it, shall form the basis of, or be relied upon in connection with, any offer or commitment whatsoever in any jurisdiction. Investors should not subscribe for or purchase any ordinary shares (the \" <span>Ordinary Shares</span> \") referred to in this announcement or in any final admission document except solely on the basis of the information contained in any such admission document including the risk factors set out in it, that may be published by Lift Global Ventures PLC in due course in connection with a possible placing of Ordinary Shares in the Company and the possible admission of the Company's entire issued ordinary share capital to the Access segment of the AQSE Growth Market operated by Aquis Stock Exchange Limited. A copy of any admission document published by the Company will, if so published, be available for inspection from the Company's registered office and on the Company's website at</span>\n<span>\n<span>www.</span>\n</span>\n<span>liftgv.com</span>\n</p>\n<p>\n<span>LIFT GLOBAL VENTURES PLC</span>\n</p>\n<p>\n<span>(\"Lift\" or the \"Company\")</span>\n</p>\n<p>\n<span>Intention to Float on AQSE Growth Market</span>\n</p>\n<p>\n<span>Lift, a financial media and technology-focused investment company led by well-known stock market commentator Zak Mir, is pleased to announce its intention to apply for admission of its Ordinary Shares to trading on the Access segment of Aquis Stock Exchange Growth Market (AQSE) in London, UK.</span>\n</p>\n<p>\n<span>The Company plans to raise approximately <span>£1.7m before expenses by way of a placing of 56,666,667 ordinary shares at 3p each through Novum Securities Limited, the Company's AQSE corporate adviser and broker. First d</span> ealings in the shares are expected to commence in December 2021. The flotation is expected to value Lift at approximately £2.7m.</span>\n</p>\n<p>\n<span>\n<span>Investment Strategy</span>\n</span>\n<span>:</span>\n</p>\n<p>\n<span>Lift seeks to build a portfolio of complementary businesses operating within the financial media and related technology sectors, for example:</span>\n</p>\n<p>\n<span>·</span>\n<span>Financial news websites and other forms of \"new media\"</span>\n</p>\n<p>\n<span>·</span>\n<span>Investment research providers</span>\n</p>\n<p>\n<span>·</span>\n<span>Financial PR, IR, design and marketing agencies</span>\n</p>\n<p>\n<span>·</span>\n<span>Production studios and visual content providers</span>\n</p>\n<p>\n<span>·</span>\n<span>Technology platforms which facilitate capital raising and/or lending</span>\n</p>\n<p>\n<span>Lift's Board aims to leverage its vast sector experience and extensive network of contacts to not only identify compelling acquisition and investment opportunities but also to advise and add value to portfolio companies on an ongoing basis.</span>\n</p>\n<p>\n<span>Board members:</span>\n</p>\n<p>\n<span>Paul Gazzard, <span>Non-Executive Chairman</span>\n</span>\n</p>\n<p>\n<span>Paul started working in the City of London in the early 1990s, initially in private banking asset management then with Panmure Gordon Asset Management for 8 years until August 2002. Over the next decade, he was involved with a number of AIM-listed companies, operating at the senior Executive level within each. Paul's primary focus since 2012 has been founding and operating private companies in the Financial Services and Technology sectors. He has also been a non-Executive Director of Amur Minerals since 2016 and a non-Executive Director of Dukemount Capital since 2017.</span>\n</p>\n<p>\n<span>Zak Mir, <span>Chief Executive Officer</span>\n</span>\n</p>\n<p>\n<span>Zak's career started in the City of London in the 1990s as a derivatives broker and markets strategist for the likes of Sucden and Union Cal, later part of Man Group. From the 2000s he entered financial journalism writing for Yahoo! Finance, The Investors Chronicle, Shares Magazine and Spectator Money. Zak is a well-known technical analyst and stock market commentator in the UK. He has published several books on his specialism, including a former number 1 on the Amazon UK Investing Bestsellers list. Zak has also amassed a Twitter following of over 20,000 people, who come to Zak for interviews and analysis of small cap companies.</span>\n</p>\n<p>\n<span>Tim Daniel, <span>Executive Director</span>\n</span>\n</p>\n<p>\n<span>Tim began his career at KPMG in Australia where he qualified as a Chartered Accountant. Upon moving to the UK in 2006, Tim worked as an Investment Analyst at a boutique hedge fund, ILEX Asset Management, focusing on European high-yield credit markets and later also receiving his CFA designation. From 2010, he gained almost 5 years of public company experience as the Chief Financial Officer of AIM-listed Equatorial Palm Oil Plc. More recently, he has worked as a FinTech Consultant with a focus on alternative lending platforms. He has been invited to speak on the UK's R&amp;D Tax Credit lending industry on several occasions, highlighting his credentials in this field.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>For further information please contact:</span>\n</p>\n<p>\n<span>Lift Global Ventures plc</span>\n</p>\n<p>\n<span>Zak Mir, Chief Executive Officer (+44 7867 527659)</span>\n</p>\n<p>\n<span>Novum Securities Limited, AQSE Corporate Adviser and Broker</span>\n</p>\n<p>\n<span>David Coffman / Colin Rowbury (+44 207 399 9400)</span>\n</p>\n<p>\n<span>ENDS</span>\n</p>\n<p>This information is provided by Reach, the non-regulatory press release distribution service of RNS, part of the London Stock Exchange. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .Reach is a non-regulatory news service. By using this service an issuer is confirming that the information contained within this announcement is of a non-regulatory nature. Reach announcements are identified with an orange label and the word \"Reach\" in the source column of the News Explorer pages of London Stock Exchange's website so that they are distinguished from the RNS UK regulatory service. Other vendors subscribing for Reach press releases may use a different method to distinguish Reach announcements from UK regulatory news.RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>NRABTBPTMTJTBMB</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}