{"date": "2021-12-05 23:37:47.507000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company, announced that United Airlines has selected AWS as its preferred cloud provider. AWS will support United?s digital innovation, providing machine learning, Internet of Things (IoT), analytics, databases, computing, storage, and security capabilities to advance United?s industry-leading efforts to transform the travel journey for customers through digital technology.</p><p>?AWS?s superior portfolio of products and services, and its focus on continuous innovation for its customers, is a complement to United?s approach to technology,? said Linda Jojo, Executive Vice President, Technology and Chief Digital Officer at United Airlines. ?United has an established track record of developing new ways to use technology to improve the customer experience. Naming AWS as our preferred cloud provider helps us to even further accelerate how we innovate and deliver even more personalized and scalable services for our customers and employees.?</p></div><div class=\"tr-npp-body\"><p>The airline is using a wide range of AWS capabilities as it leverages technology to transform the way their customers interact with the airline. Working with AWS, United has already introduced a number of industry-first enhancements for travelers, at an incredible pace, including new features in United?s app and digital channels to help customers understand and easily navigate COVID-19 travel restrictions.</p><p>Through United?s Travel-Ready Center, travelers can now easily access testing or vaccine requirements needed for their specific destination, upload testing and vaccination records, schedule a COVID-19 test and complete country-specific required forms in United?s app and on United.com. Using machine learning technology from AWS and Amazon Elastic Kubernetes Service (Amazon EKS), a managed container service to run and scale Kubernetes applications, United customers can have critical travel documents reviewed in near real-time before they arrive at the airport, making the journey easier. United was the first airline to offer its customers these services as part of an integrated experience in its app and website.</p><p>United is also applying AWS technology, including analytics, IoT, and machine learning, to optimize airport operations and help airport employees drive nimble and scalable operations. Central to this effort is United?s companywide analytics and machine learning program, which uses AWS to innovate new services, drive efficiencies, and respond faster to potential delays, allowing United to scale to meet demand. For instance, United uses Amazon SageMaker (AWS?s service that helps data scientists build, train, and deploy machine learning models quickly) to predict irregular operations and uncover insights to optimize customer service, baggage routing, and flight scheduling.</p><p>?United Airlines operates one of the world?s largest airline networks with more than 4,900 daily flights moving people and goods across six continents, and it uses technology to reinvent the customer experience. AWS provides proven reliability, breadth and depth of services, and travel-industry expertise to United Airlines as it delivers outstanding experiences across its business,? said Matt Garman, Senior Vice President of Sales and Marketing at Amazon Web Services, Inc. ?Together, we are working to support United?s vision of making air travel more seamless through digital solutions to help improve the way people travel the world.?</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}