{"date": "2022-02-23 15:41:02.460000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>KNOWBE4 INC (\"KNBE-Q\")\n- Kontra Partner to Educate Application Developers on Best\n- Practices for Improved Application Security\n\n     KnowBe4, the provider of the world's largest security awareness\ntraining and simulated phishing platform, today announced a new partnership\nwith Kontra to add security application development courseware to its\nmassive training library of security awareness training content.\n\n     The application layer remains a prime target for cybercriminals\nlooking to breach an organization's security defenses. Recent security\nthreats like the Log4j incident show that secure development practices are\nincreasingly important to prevent breaches.\n\n     \"We studied the development teams of several global organizations and\nlearned that while their offerings to the marketplace are as secure as\nreasonable, often it's because of security being bolted on later in the\ndevelopment process,\" Dr. Keri Pearlson, executive director at the research\nconsortium Cybersecurity at MIT Sloan. \"This is a costly approach to\nbuilding secure products. Our findings indicate that if managers of product\ndesigners and developers encouraged a culture of 'design for cybersecurity'\nand followed that up with managerial mechanisms such as training,\nawareness, rewarding for secure designs, and other motivations, product\ndevelopment would bake in cybersecurity at earlier stages of their offering\ndesign. Read more about our research in Sloan Management Review or Harvard\nBusiness Review.\"\n\n     \"More emphasis needs to be placed on application security best\npractices for developers to help prevent security breaches,\" said Stu\nSjouwerman, CEO, KnowBe4. \"KnowBe4 has a sizeable library of security\nawareness training. Kontra's interactive developer training is an ideal fit\nfor our customers' growing needs as the security threat landscape continues\nto evolve.\"\n\n     \"KnowBe4 is the perfect partner to expand the reach of our courses,\nand, in turn, help thousands of organizations build security from the\nground up,\" said Gyan Chawdhary, founder and CEO of Kontra. \"At Kontra, we\ntake pride in creating the world's best application security and secure\ncode training, and we're honored that KnowBe4 recognizes Kontra application\nsecurity training as the best offering on the market for its global\nnetwork.\"\n\n     The training courses included in this new partnership cover:\n\n             *  Front End: Vue.js\n     *  OWASP Top 10 Web: Java, C#\n     *  Cloud Top 10: AWS for Java\n\n          This highly interactive training is simple to deploy through the\nKMSAT platform to upskill development teams. These new courses are\navailable to KnowBe4 Diamond level customers. More information on these\ncourses is available at <a href=\"https://application.security\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://application.security</a>/.\n\n     About KnowBe4\nKnowBe4, the provider of the world's largest security awareness training\nand simulated phishing platform, is used by more than 44,000 organizations\naround the globe. Founded by IT and data security specialist Stu\nSjouwerman, KnowBe4 helps organizations address the human element of\nsecurity by raising awareness about ransomware, CEO fraud and other social\nengineering tactics through a new-school approach to awareness training on\nsecurity. Kevin Mitnick, an internationally recognized cybersecurity\nspecialist and KnowBe4's Chief Hacking Officer, helped design the KnowBe4\ntraining based on his well-documented social engineering tactics. Tens of\nthousands of organizations rely on KnowBe4 to mobilize their end users as\nthe last line of defense.\n\nTel   : 855-566-9234    KNOWBE4 INC\nWWW   : <a href=\"https://www.knowbe4.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.knowbe4.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2205300404.MNPRE2205301983-07204420220223</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}