{"date": "2021-11-22 14:41:19.787000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">BEIJING, Nov. 22, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">BEIJING</span>, <span class=\"xn-chron\">Nov. 22, 2021</span> /PRNewswire/ -- Dreame Technology, a global leader in tech innovation and household cleaning appliances, is officially releasing the Dreame W10 self-cleaning robot vacuum and mop on Amazon. Dreame has announced a launch period from November 22–November 30, 2021.</p>\n<p>Combining mopping and vacuuming functions, W10 easily cleans dirt, dust, wet messes, and dried-on dirt. Picking up debris, cleaning up grime, or mopping up spills are tasks handled with ease by a single automatic cleaning robot.</p>\n<p>With 2-in-1 vacuuming and mopping functions in addition to multiple cleaning modes to clean carpets and hard floors, the Dreame W10 Robot Vacuum and Mop ensures that wet messes, dry dirt, grime, and dried on stains can be effectively dealt with via automatic cleaning. W10 automatically returns to the charging base to clean the mops before returning to the spot it left off to continue vacuuming and mopping. </p>\n<p>Separate 4L water tanks, one for clean water and one for dirty water, ensure floors are always mopped with clean water while prolonging cleaning time. concludes, the mops are automatically cleaned and then dried with hot air so they are always clean and fresh for the next cleaning session.</p>\n<p>Additionally, a high-capacity battery provides up to 300m² (3,229ft²) on a single charge. After the entire home has been cleaned, the W10 returns to the base for one last cleaning that concludes with the mops being blow-dried to prevent mildew and bacteria growth. </p>\n<p>W10 also updates a map of its surroundings 12x faster than previously possible thanks to an upgraded LiDAR-based SLAM navigation system, allowing it to avoid obstacles intelligently. It maps rooms (even in the dark), creates systematic cleaning paths, and can store up to 3 different floor plans. With this advanced navigation, and a D-shaped design that ensures remarkable edge and corner cleaning, W10 effectively cleans homes from corner to corner.</p>\n<p>By effectively mitigating all of these issues with self-cleaning and hot air drying, the Dreame W10 self-cleaning robot vacuum and mop will be available on Amazon Dreame with a launch campaign running from <span class=\"xn-chron\">November 22 to November 30, 2021</span><b>. </b></p>\n<div id=\"prni_dvprnejpg2470left\" style=\"WIDTH:100%;TEXT-ALIGN:left\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img align=\"middle\" alt=\"Dreame to Offer Big Discounts for Black Friday and Cyber Monday\" border=\"0\" id=\"prnejpg2470left\" src=\"https://mma.prnewswire.com/media/1693807/Dreame.jpg\" style=\"HEIGHT:200px;WIDTH:400px\" title=\"Dreame to Offer Big Discounts for Black Friday and Cyber Monday\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMTY5MzgwNy9EcmVhbWUuanBn&amp;key=eca0ee98da944ecceb9a69f6d942ab80ea8e3d88aee9a8e38deb93f893c50e344a2bc9c3da1f07afa62f2af0061e52f8fc151c7d124094a629342698f1235609\"/></div></div></div><p><b>Dreame to Offer Big Discounts for Black Friday</b></p>\n<p>Dreame has announced plans for a Black Friday and Cyber Monday sale on their products. Various discounts on their stick vacuums, combination vacuum and mops, and robot vacuum and mops will be offered on Amazon ranging from <span class=\"xn-chron\">November 22 to November 29</span>. </p>\n<p>Discounted stick vacuums include Dreame's T10, T20, T30, P10, and P10 Pro vacuums. The versatile stick vacuums all have powerful suction, multi-layer filtering, long runtimes, and versatile attachments and will be on sale for 15–25% off.</p>\n<p>The H-Series of wet and dry vacuums will also be discounted. The H11 and H11 Max both feature a 900ml clean water tank, a 500ml dirt water tank, a one-press self-cleaning mode, an intuitive LED screen, and intelligent voice prompts. However, H11 Max also boasts a longer runtime, advanced dirt sensor, and automatic suction power adjustment. Both will be on sale for up to <span class=\"xn-money\">$100</span> off.</p>\n<p>Rounding out the sale, Dreame is offering specials on several robot vacuum and mops. Available models include the D9, D9 Pro, D9 Max, L10 Pro and Z10 Pro. All of Dreame's robots can vacuum and mop and come equipped with powerful suction, LiDAR navigation, suction boost on carpet, and anti-tangle brushes. Z10 Pro additionally has an auto-empty feature to automatically empty dirt and dust into a 4L bag within the docking station. They will be on sale for 20–25% off.</p>\n<p>The campaign will run on Amazon with the earliest discounts beginning on <span class=\"xn-chron\">November 22</span> and the last discounts ending on <span class=\"xn-chron\">November 30</span>. Stick vacuums, vacuum and mops, and robot vacuum and mops will be on sale for up to 25% off while the sale lasts.</p>\n<p><b>About Dreame Technology</b></p>\n<p>Established in 2015, Dreame Technology is an innovative consumer product company that focuses on smart home cleaning appliances with the vision to empower lives through technology. Follow us on<a href=\"https://www.facebook.com/dreametechnology\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> </a><u><a href=\"https://www.facebook.com/dreametechnology\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Facebook</a></u>,<a href=\"https://www.instagram.com/dreame_tech/\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> </a><u><a href=\"https://www.instagram.com/dreame_tech/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Instagram</a></u>, and<a href=\"https://twitter.com/Dreame_tech\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> </a><u><a href=\"https://twitter.com/Dreame_tech\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Twitter</a></u>. For more information, please visit:<a href=\"https://www.dreame-technology.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> </a><u><a href=\"https://www.dreame-technology.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.dreame-technology.com</a></u>.</p>\n<p>Photo - <a href=\"https://mma.prnewswire.com/media/1693807/Dreame.jpg\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://mma.prnewswire.com/media/1693807/Dreame.jpg</a></p>\n<p> </p>\n</div>\n<div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p></div>"}