{"date": "2022-02-22 16:22:11.574000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>HIGH WIRE NETWORKS INC (\"HWNI-0\")\n- Technology and Cybersecurity Veteran Drives Engagement for\n- Overwatch Partner Program\n\n   High Wire Networks Inc. (the \"Company\" or \"High Wire\"), a leading global\ntechnology systems integrator and managed cybersecurity solutions provider,\nhas named a former IT Manager of two Fortune 500 companies, Bob Roberts, as\nPartner Success Manager, overseeing the sales enablement program for\nOverwatch Managed Security, the Company's managed security division.\n\n   Roberts joins High Wire after spending a combined 23 years at Price\nWaterhouse Cooper (PwC) and International Business Machines (IBM). He\noversaw global service delivery and vendor management teams. He also\nmanaged data center operations at multiple locations and hybrid cloud\noperations for AWS and Azure. In his roles, Roberts worked with clients to\nmeet their business challenges through IT and cybersecurity tools.\n\n   \"Our partners are fortunate to have Bob lead the charge to help them\nsell and deliver managed security in a strategic yet simplistic way,\" said\nHigh Wire Executive Vice President Don Schmidt. \"He has the breadth of\nexperience, from technical mastery to customer-first service delivery, that\nI have seen few to possess.\"\n\n   \"I am excited to be at High Wire to build the best customer-focused\nteam,\" said Roberts. \"With my technical experience, passion for success,\nand undeterred transparency, I believe our partners will see the benefits\nof working with Overwatch to reach their customers and win opportunities\nquicker and more effectively.\"\n\n   About High Wire Networks\nFor 20 years, High Wire Networks has been a trusted partner to VARs, MSPs,\ndistributors, integrators, manufacturers, and telecom providers by enabling\nthem to minimize overhead while extending delivery capabilities around the\nworld. Our flexible workforce delivers vendor-agnostic technical field,\nprofessional and security services in more than 180 countries. Our services\ninclude design, installation, configuration, and support for unified\ncommunications, wired and wireless networks, cabling and infrastructure,\nand electrical systems. Our award-winning Overwatch Managed Security\nMarketplace enables our partners to deliver comprehensive cybersecurity\nthat's easy to sell and easy to buy for an affordable subscription. We also\noffer a variety of on-demand, rapid-response solutions with service levels\nranging from two hours to the next business day for onsite break-fix and\nremote technical support. With High Wire Networks, partners Get Work Done.\nFor more information about the Company and its technologies visit the\nCompany's public filings at www.SEC.gov or the Company's website at\n<a href=\"http://www.highwirenetworks.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.highwirenetworks.com</a>/\n\n   Forward-Looking Statements:\nThe above news release contains forward-looking statements. The statements\ncontained in this document that are not statements of historical fact,\nincluding but not limited to, statements identified by the use of terms\nsuch as \"anticipate,\" \"appear,\" \"believe,\" \"could,\" \"estimate,\" \"expect,\"\n\"hope,\" \"indicate,\" \"intend,\" \"likely,\" \"may,\" \"might,\" \"plan,\"\n\"potential,\" \"project,\" \"seek,\" \"should,\" \"will,\" \"would,\" and other\nvariations or negative expressions of these terms, including statements\nrelated to expected market trends and the Company's performance, are all\n\"forward-looking statements\" within the meaning of the Private Securities\nLitigation Reform Act of 1995 and involve a number of risks and\nuncertainties. These statements are based on assumptions that management\nbelieves are reasonable based on currently available information, and\ninclude statements regarding the intent, belief or current expectations of\nthe Company and its management. Prospective investors are cautioned that\nany such forward-looking statements are not guarantees of future\nperformances and are subject to a wide range of external factors,\nuncertainties, business risks, and other risks identified in filings made\nby the company with the Securities and Exchange Commission. Actual results\nmay differ materially from those indicated by such forward-looking\nstatements. The Company expressly disclaims any obligation or undertaking\nto update or revise any forward-looking statement contained herein to\nreflect any change in the company's expectations with regard thereto or any\nchange in events, conditions or circumstances upon which any statement is\nbased except as required by applicable law and regulations.\n\nInvestor Relations\ninvestors@highwirenetworks.com\n\nSusanna Song\nVice President, Marketing and Communications\nHigh Wire Networks\n630-635-6717\nsusanna.song@highwirenetworks.com\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2205200618.MNPRE2205202583-08194920220222</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}