{"date": "2021-12-08 14:16:30.641000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Happy Wednesday! Today we'll be counting how many times senators refer to Facebook as Meta without scoffing or trying to turn it into a zinger. We suspect not many.</p><p>Below: Amazon faces a new FTC complaint and the Senate reconfirms the chair of the FCC. First, we get you ready for today's big hearing:</p></div><div class=\"tr-npp-body\"><p>Instagram's chief is testifying. Here's what child safety advocates want answered.</p><p>Instagram chief Adam Mosseri will testify on Capitol Hill for the first time Wednesday at a hearing slated to focus on claims the platform hasn't done enough to protect young users, an issue that has inflamed frustrations and forged some rare unity in Congress.</p><p>Lawmakers are expected to bombard the tech executive with questions about Facebook whistleblower Frances Haugen's disclosures, Instagram's algorithms and more. While Meta, formerly Facebook, has testified before Congress dozens of times, it's the first appearance by any official directly from Instagram. That dynamic has child privacy advocates raring to get the company on the record about its plans, policies and practices.</p><p>We asked leading advocates what senators should press Mosseri on. Here's what they said:</p><p>So you say you want new regulations. Tell us more.</p><p>Instagram parent company Meta has been peppering decision-makers in Washington with ads declaring its support for new Internet regulations for months now. But senators fumed at a recent hearing that tech companies are too often reluctant to weigh in on their specific proposals.</p><p>Advocates said they hope lawmakers press Mosseri for answers about which proposals about boosting child safety the company actually backs, both in the U.S. and abroad.</p><p>5Rights founder Beeban Kidron, a filmmaker and advocate who testified at an earlier Senate hearing on child safety in May, said she wants to know whether Mosseri thinks new child safety protections enacted in the United Kingdom \"should extend\" to the United States. </p><p>Under the Age-Appropriate Design Code, digital services that are likely to be used by children have to follow 15 rules aimed at boosting kids' safety, including enhanced privacy protections. </p><p>Meta spokesman Andy Stone said the company has \"expressed support\" for the framework in the past, including in a blog post where the company said it and other rules on age verification \"underpin the work we're doing to create privacy and safety standards for building youth products.\" The company has also previously backed the CAMRA Act, a bill to authorize the National Institutes of Health to study how technology affects kids' development.</p><p>Will Instagram commit to greater transparency and more disclosures?</p><p>The Wall Street Journal's report revealing that Facebook, since renamed Meta, had internal research showing Instagram made body image issues worse for some teen users ignited a wave of congressional calls for the company to make more of its data public. </p><p>In response, Facebook released heavily annotated slide decks of some of the research revealed by the Journal ahead of another hearing where one of its executives testified to Congress. Lawmakers scoffed at the disclosures and called for the company to make its full data sets public and to release any additional research on how Instagram may harm kids and teens.</p><p>Advocates want senators to keep up the pressure and secure greater transparency commitments from Mosseri, including making more data public on how Instagram affects kids and making its products more accessible to external experts. </p><p>Angela Campbell, chair of the board of directors for Fairplay, said it's also imperative they \"let outside researchers and auditors review Instagram's data and algorithms.\" Stone said Mosseri plans to highlight Instagram's data-sharing initiatives in his testimony.</p><p>Will Instagram make algorithmic changes to boost safety?</p><p>Some of the most damaging revelations from Haugen's disclosures revolve around how the company's platforms amplify harmful content. Advocates want the issue to be front-and-center at Wednesday's hearing.</p><p>Jim Steyer, founder and CEO of Common Sense, said Instagram's algorithms can \"quickly take users down dangerous rabbit holes that expose them to increasingly harmful content, such as how healthy eating quickly leads to content promoting disordered eating.\" </p><p>Rep. Lori Trahan (D-Mass.), a top child safety advocate in Congress, said she hopes senators press Mosseri \"on how he plans to make Instagram safe by design and end the practice of growth at all costs.\"</p><p>Meta's Stone noted the company announced Tuesday it plans to take a \"stricter approach to what we recommend to teens on Instagram.\"</p><p>Other design choices may also get scrutiny. Kidron said Mosseri should also have to answer for how Instagram filters can exacerbate body image issues for young girls, including whether they are considering deprioritizing \"beautification filters and emphasizing comedic, artistic\" and other filters.</p><p>Is Instagram putting too much of the onus on parents?</p><p>Ahead of Wednesday's hearing, Instagram unveiled a slate of new features aimed at keeping children and teens safer and healthier online, including offering \"take a break\" reminders for users who have been logged on too long. Mosseri said the company also plans to launch new parental controls.</p><p>Advocates questioned whether Instagram was passing the buck on securing the platform by putting more responsibility in the hands of young users and their parents.</p><p>Jeffrey Chester, executive director of the Center for Digital Democracy, said he wants to know whether Mosseri really thinks \"that parents and guardians have the ability to address the impact of Instagram on their children given Instagram's sophisticated use of marketing algorithms, data analysis and product engagement testing.\"</p><p>\"Aren't you really trying to shift responsibility from Meta's top management to parents?\" he asked.</p><p>Meta's Stone noted Tuesday's announcements included design changes like the more stringent recommendation limits.</p><p><span>Our top tabs</span> </p><p>A coalition of labor unions filed an FTC complaint over paid advertising on Amazon</p><p>The Strategic Organizing Center (SOC) argues that the paid ads on platforms aren't clearly labeled and many consumers could click them without knowing that they're ads, Cat Zakrzewski and Jay Greene report. The SOC is a coalition of labor unions that includes the International Brotherhood of Teamsters and the Service Employees International Union.</p><p>The SOC wants the Federal Trade Commission (FTC) to probe the e-commerce giant's advertising practices and \"take swift and forceful action\" against what it calls deceptive advertising practices. </p><p>It \"adds to the increased scrutiny of the company's practices in Washington, just months after Lina Khan (D), a prominent critic of Amazon and other major tech companies, took over the agency, and after the FTC has broadly probed the company's business for years,\" Cat and Jay write.</p><p>The Senate confirmed Jessica Rosenworcel, clearing the path for her to permanently lead the FCC</p><p>Nearly 50 Democrats and 19 Republicans voted to confirm Jessica Rosenworcel. It's a win for Democrats, who narrowly avert a GOP majority on the Federal Communications Commission by the end of the year. But it's still not clear whether they'll be able to secure a Democratic majority on the regulator by the end of the year.</p><p>The Senate still has to confirm net neutrality advocate Gigi Sohn, who Biden nominated in October along with Rosenworcel for spots on the commission. Sohn's nomination has faced opposition by Senate Republicans, who raised concerns about whether she could be unbiased. Sohn defended her record at a hearing last week.</p><p>Equifax will no longer sell sensitive utility information</p><p>The National Consumer Telecom &amp; Utilities Exchange (NCTUE) told Equifax — one of America's major credit-reporting bureaus — to stop selling sensitive information from Americans' cable, phone and power bills, Drew Harwell reports. Sen. Ron Wyden (D-Ore.) called on the Consumer Financial Protection Bureau to further rein in data brokers and investigate how their data is ending up in the hands of U.S. law enforcement agencies without warrants.</p><p>The move comes after The Washington Post found that Immigration and Customs Enforcement (ICE) officers tapped a database with the records to pursue immigration violations.</p><p>\"The personal privacy of hundreds of millions of people should not depend upon the goodwill of corporations worried about negative headlines,\" Wyden wrote.</p><p>\"We're committed to following the law and we routinely revisit our policies and practices to strike the right balance between consumer privacy and those seeking credit,\" the NCTUE said in a statement. Equifax said NCTUE had for years let it license the data \"for law enforcement purposes in compliance with all laws.\" The change will \"hinder our efforts to expand access to credit and protect against fraud,\" Equifax said. ICE did not respond to requests for comment.</p><p><span>Rant and rave</span> </p><p>Apple is backing and distributing a film about Theranos and Elizabeth Holmes starring Jennifer Lawrence, Deadline's Mike Fleming Jr. reports. NPR's Stacey Vanek Smith:</p><p>Twitter users also had a fair bit of snark about Apple. The Wall Street Journal's Eliot Brown:</p><p>Apple blogger and iOS developer Benjamin Mayo:</p><p><span>Inside the industry</span> </p><p>Inside Tim Cook's secret $275 billion deal with Chinese authorities (The Information)</p><p>EU antitrust regulator seeks input on Microsoft's Nuance deal (Reuters)</p><p><span>Workforce report</span> </p><p>U.S. settles with Microsoft over immigration-related discrimination claims (Reuters)</p><p>Uber, Deliveroo could be hit by draft EU rules for gig workers (Reuters)</p><p><span>Mentions</span> </p><p>Ten companies have joined the Global Data Alliance as members. They include Abbott Laboratories, Cognizant, EY, FedEx, General Motors, Ikea, Lumen Technologies, MetLife, NTT and Relx.</p><p><span>Trending</span> </p><p>I'm the TikTok couch guy. Here's what it was like being investigated on the Internet. (Slate)</p><p>Amazon's cloud-computing unit problems take down websites, services (Jay Greene)</p><p><span>Daybook</span> </p><p>Heather Boushey, a member of the White House's Council of Economic Advisers, participates in a Brookings Institution event on technology and inequality today at 11 a.m.</p><p>The Senate Commerce Committee's communications, media and broadband subcommittee holds a hearing on algorithmic harms on Thursday at 10 a.m.</p><p>The House Energy and Commerce Committee holds a hearing on legislation targeting Big Tech on Thursday at 10:30 a.m.</p><p>Intel CEO Pat Gelsinger speaks at the Economic Club of Washington D.C. on Thursday at noon.</p><p><span>Before you log off</span> </p><p>That's all for today — thank you so much for joining us! Make sure to tell others to subscribe to The Technology 202 here. Get in touch with tips, feedback or greetings on Twitter or email. </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 The Washington Post</p></div>"}