{"date": "2021-09-01 06:22:14+00:00", "ticker": "AVV", "mrkt_info": {"open": 4136.0, "close": 4190.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>Dubai, United Arab Emirates:- AVEVA, a global leader in industrial software, driving digital transformation and sustainability, announced today that it will be making its Operations Control solutions available as a single subscription for the first time. This redefines the industrial software experience, going beyond HMI and SCADA, enabling industrial organizations of all sizes to develop collaborative workforces, scale effectively, and optimize operations for agility and efficiency.</p>\n<p>From IIoT architectures and cloud-driven remote edge management to multi-site supervisory control, AVEVA™ Operations Control software will be available via a flexible user-centric model, through the AVEVA™ Flex Subscription program in three core packages: Edge, Supervisory and Enterprise. These core solutions provide all the necessary tools for plant, field, control room, and enterprise teams to drive actionable information, collaborate effectively, and accelerate operational excellence. The program also offers access to add-on functionality with AVEVA Manufacturing Execution, and AVEVA Insight for advanced AI and workflow management. AVEVA’s new Operations Control software subscriptions now allow end customers to use all of its products, the way they want to use them.</p>\n<p>AVEVA Operations Control offers an infinite range of possibilities for companies to connect operations and workers via the cloud, web and mobile to drive efficiency through collaboration and standardization. It delivers supervisory, visualization, collaboration, and analytics software in a single combined subscription providing unlimited access to actionable information.  Every team, whether on the plant floor, in the control room, or operating across the enterprise, is empowered to do more, in collaborative alignment. Customers can build a reliable foundation towards operational excellence with AVEVA Operations Control.</p>\n<p>AVEVA offers the first single subscription program on that market that spans edge-to-cloud solutions for plant operations. The AVEVA Flex subscription program is designed to provide access to the entire AVEVA portfolio – enabling customers to flexibly drive sustainable growth. It allows companies to achieve a faster return-on-investment, removing traditional barriers to software adoption and revolutionizing the purchase and consumption of industrial software. The subscription model enables simplicity in license purchasing, usage and management – aiding organizational digital transformation.</p>\n<p>In the FY21 fiscal year, AVEVA recorded strong subscriptions growth as businesses sought access to transformational technology on a flexible, agile basis. According to ARC Advisory Group, subscription-based models are predicted to grow at a pace nearly four times that of traditional software over the next five years in the industrial automation markets.</p>\n<p>Craig Resnick, Vice President at ARC Advisory Group commented: “ARC anticipates that the subscription model growth rate will be significantly higher than the traditional licensing model growth rate for purchasing HMI/SCADA solutions going forward. This shift towards the subscription model is driven by a number of factors, including the market seeking single converged solutions, such as HMI/SCADA and asset performance management, that deliver great flexibility together with edge-to-cloud integration, a capability that AVEVA can deliver today as part of its AVEVA Flex subscription program.”</p>\n<p>Rashesh Mody, SVP Monitoring and Control, AVEVA said: “Our solution is enabling teams in different physical locations to organize their operations, collaborate, and leverage vast internal knowledge. Most importantly, customers can now accelerate their digital transformation journey through one simple, agnostic subscription package.”</p>\n<p>\"Industrial organizations are increasingly aiming to utilize technology environments that will provide them with a comprehensive view of their field, control room and enterprise operational facilities. With AVEVA Operations Control they can now view end-to-end processes with an unlimited offering through the edge, enterprise and supervisory core functions,” Mody added.<br/>\n<br/></p>\n<p>\"With AVEVA Operations Control available via the AVEVA Flex subscription program, channel partners can now offer outcome-based solutions and services to their customers. AVEVA’s offering is unique because it enables simple and flexible pricing – allowing our channel partners to differentiate themselves in the market and stay ahead of the competition,\" said Kerry Grimes, Head of Global Partners at AVEVA.</p>\n<p>-Ends- </p>\n<p><strong>About AVEVA</strong></p>\n<p><span>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence. AVEVA’s comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries. Learn more at www.aveva.com.</span></p>\n<p><span>Copyright © 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</span></p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}