{"date": "2021-11-01 18:26:54+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds more from Amazon, background on SpaceX fight</p><p class=\"tr-by\">By David Shepardson</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">WASHINGTON, Nov 1 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> o<span class=\"tr-strong\">n Monday </span><a href=\"https://apps.fcc.gov/els/GetAtt.html?id=285359&amp;x=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">asked the</a> U.S. Federal Communications Commission for approval to launch and operate two prototype <span class=\"tr-strong\">internet satellites by </span>the end of 2022 <span class=\"tr-strong\">as part of the company's effort to create a space-based satellite network</span>.</p><p>Amazon, which has pledged t<span class=\"tr-strong\">o spend at least </span>$10 billion <span class=\"tr-strong\">to build 3,236 such satellites </span>t<span class=\"tr-strong\">hrough its Project Kuiper program</span>, said the testing and demonstration launch is \"an important step toward Amazon’s goal of delivering high-capacity, low latency broadband communications services to tens of millions of unserved and underserved consumers and businesses.\"</p><p><span class=\"tr-strong\">Amazon said on Monday it \"continues to invest in Project Kuiper as we approach full production launches and prepare to serve tens of millions of customers around the world.\"</span></p><p><span class=\"tr-strong\">I</span>n <span class=\"tr-strong\">2020, the FCC approved the Project Kuiper plan for the constellation of low-Earth orbit satellites to compete with the Starlink network being built out by Elon Musk’s SpaceX.</span></p><p><span class=\"tr-strong\">Amazon has sparred with Musk, recently accusing the billionaire of ignoring a variety of government-imposed rules, including several Federal Aviation Administration (FAA) requirements.</span></p><p><span class=\"tr-strong\">\"The conduct of SpaceX and other Musk-led companies makes their view plain: rules are for other people, and those who insist upon or even simply request compliance are deserving of derision and ad hominem attacks,\" Amazon wrote. \"If the FCC regulated hypocrisy, SpaceX would be keeping the commission very busy.\"</span></p><p><span class=\"tr-strong\">Amazon founder Jeff Bezos and Musk are rivals in the private space launch business. Bezos' Blue Origin has challenged the National Aeronautics and Space Administration's decision to award a $2.9 billion lunar lander contract to SpaceX.</span></p><p><span class=\"tr-strong\">SpaceX has accused Amazon in its own filing with the FCC of seeking to delay SpaceX's plan: \"While SpaceX has proceeded to deploy more than 1,700 satellites, Amazon has yet to even attempt to address the radiofrequency interference and orbital debris issues that must be resolved before Amazon can deploy its constellation.\"</span></p><p><br/></p><p class=\"tr-signoff\"> (Reporting by David Shepardson<br/>Editing by Chris Reese and Paul Simao)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:David.Shepardson@thomsonreuters.com\" data-type=\"email\" translate=\"no\">David.Shepardson@thomsonreuters.com</a> ; 2028988324; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON-INTERNET/ (UPDATE 1)</p></div>"}