{"date": "2021-11-02 15:13:04+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Stephen Nellis</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Nov 2 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Microsoft Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MSFT.O\" data-type=\"ric\" data-ric=\"MSFT.O\" translate=\"no\" dir=\"ltr\">MSFT.O</a> on Tuesday announced a new round of technologies aimed at making its cloud computing services work in data centers it does not own - including the cloud data centers of its rivals.</p><p>The strategy, Microsoft executives and analysts say, has been key to the company's rise in the cloud computing infrastructure market, which research firm Gartner estimates hit $64.3 billion and where Microsoft is second only to market leader Amazon.com's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> Amazon Web Services. Microsoft last week said revenue from Azure, its flagship cloud offering, grew 48%, results that helped it overtake Apple Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a> as the <a href=\"https://www.reuters.com/technology/apple-set-hand-crown-worlds-most-valuable-company-microsoft-2021-10-29\" data-type=\"url\" class=\"tr-link\" translate=\"no\">world's most valuable publicly</a> traded company.</p><p>Microsoft's strategy has involved constructing its most lucrative cloud software services, such as database tools, so that they can run inside its own data centers, those owned by customers or even those of rivals like Amazon.</p><p>Microsoft's cloud and artificial intelligence chief Scott Guthrie told Reuters that the move has persuaded some customers to use its services when they cannot always use Microsoft's data centers. Royal Bank of Canada, Guthrie said, faces legal requirements to keep some of its computing work in its own data centers and uses a technology called Azure Arc to connect those facilities to Microsoft's cloud.</p><p>\"The challenge with higher-level services historically has been the concern of 'lock in' - what happens if I can only use them in your data center?\" Guthrie said. \"That freedom of movement causes customers to feel much more comfortable using those services.\"</p><p>Ed Anderson, a vice president distinguished analyst with Gartner, said the approach does open doors for Microsoft with customers, but it also forces the company to compete on the quality of its software services rather than by packaging them with cheap computing power.</p><p>\"To be honest, that's a better way to compete,\" Anderson said. \"Customers are suspicious of rhetoric. They look for evidence of capabilities and are cautious of things where in principle technology is multi-cloud but maybe the software licensing doesn't support it.\"     </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Stephen Nellis in San Francisco)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Stephen.Nellis@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Stephen.Nellis@thomsonreuters.com</a> ; (415) 344-4934; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: MICROSOFT-TECH/ (PIX)</p></div>"}