{"date": "2021-11-29 18:59:24+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>\n      Moving critical workloads to Amazon Web Services (AWS) means significant cost savings and real productivity increases for your organization. But how safe is your infrastructure exactly? Did you know, for example, that the number of recent cybersecurity incidents involving external cloud assets has nearly tripled?<sup>1</sup></p>\n              <p>\n      Maximizing the benefits of AWS is important, but not at the expense of allowing your organization to be exposed to increased risk. Cybercriminals today are relentlessly looking to infect corporate systems with malware so they can steal valuable data, hijack resources, or even shut down critical services. What if your company was the next victim of a ransomware attack?\n    </p>\n              <p>\n      What this means is you can no longer count on a conventional, perimeter-based security model to stay safe, since this strategy relies on network location to manage resources, devices, and users. With the new, hybrid workplace paradigm taking hold - where workers access resources from any device, anywhere - network location no longer matters.\n    </p>\n              <p>\n      So what's the best way to protect the vital assets in your AWS Cloud? The answer is to consider any person, device, or application that requests access as \"untrustworthy until proven otherwise.\" Specifically, this means:\n    </p>\n              <ul class=\"bulleted-list arrowlist\">\n                <li>\n        Never trust - always verify access requests\n      </li>\n                <li>\n        Deliver just enough, timely access\n      </li>\n                <li>\n        Continuously monitor, analyze, and adapt\n      </li>\n              </ul>\n              <p>\n      These are three principles of a strategy known as Zero Trust. And the foundation of Zero Trust is identity security, as the right Identity security solution can add strong, flexible, and fine-grained access controls to native AWS network controls.\n    </p>\n              <p>\n      To help you evaluate options, here's a quick checklist of key questions to ask when vetting an identity security solution's ability to enforce Zero Trust:\n    </p>\n              <ul class=\"bulleted-list arrowlist\">\n                <li>\n        Is the solution certified to work in an AWS Cloud?\n      </li>\n                <li>\n        Does it give visibility into all users, devices, and applications seeking access to assets in your AWS Cloud, including their existing permissions, entitlements, attributes, and roles?\n      </li>\n                <li>\n        How automated is the maintenance of identity security in the AWS Cloud? Can you be confident you are dealing with a source-of truth that can automatically:\n      </li>\n                <li>\n        Refresh and update identity records continuously?\n      </li>\n                <li>\n        Grant, update, and revoke access as users come on board, change roles, or leave?\n      </li>\n                <li>\n        Deprovision unused access and accounts?\n      </li>\n                <li>\n        Does it help prevent giving users more access rights than they need (i.e. enforcing \"least privilege\"), therefore minimizing your attack surface area?\n      </li>\n                <li>\n        Does it help you avoid non-compliance penalties by detecting potential policy violations (e.g. Separation of Duties)?\n      </li>\n                <li>\n        How \"smart\" is the solution in dynamically adapting as changes and threats are detected across your AWS Cloud?\n      </li>\n              </ul>\n              <p>\n                <a href=\"https://www.sailpoint.com/integrations/amazon-web-services/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">SailPoint and Amazon Web Services are working together</a> to deliver Zero Trust identity security for your AWS Cloud. As the leader in identity, SailPoint offers AI-driven identity security that automates the identity lifecycle, enforces least privilege using roles and dynamic policy logic, and continuously monitors AWS environments for changes and threats using AI/ML.\n    </p>\n              <p>\n      To learn more, download our new eBook, <span>Identity Security Enforces Zero Trust in Your AWS Cloud,</span> or visit <a href=\"https://www.sailpoint.com/integrations/amazon-web-services\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a>.\n    </p>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.sailpoint.com/blog/how-well-can-you-protect-your-aws-cloud/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>SailPoint Technologies Holdings Inc.</strong> published this content on <strong>29 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>29 November 2021 18:59:24 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - SailPoint Technologies Holdings Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SailPoint-Technologies-Holdings-Inc.</p></div>"}