{"date": "2021-04-05 17:27:59.589000+00:00", "ticker": "AAF", "mrkt_info": {"open": 82.25, "close": 84.7}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Apr 05, 2021</p></div><div class=\"tr-npp-lead\"><p><span>Mastercard Inc.</span><a href=\"http://www.zacks.com/stock/quote/MA\" data-type=\"url\" class=\"tr-link\" translate=\"no\">MA</a> will be acquiring a minority stake in Airtel Mobile Commerce BV (AMC BV), the subsidiary of Airtel Africa.With this, Mastercard will be investing $100 million for a 3.75% stake in AMC BV through the secondary purchase of shares in the same from Airtel Africa. This fund infusion will be done in two tranches with the first being a $75-million investment, which will be upon the transfer of specified mobile money business assets and contracts to AMC BV. The remaining $25 million will be invested on further transfers.According to Airtel, alongside the aforementioned investment, the Airtel Africa and Mastercard extended their commercial agreements and signed a new commercial framework, which will deepen their partnerships across geographies. Business involvement will further grow in the areas including card issuance, payment gateway, payment processing, merchant acceptance and remittance solutions.This tie-up will complement Mastercard's business since AMC BV operates under the brand Airtel Money, overseeing one of the largest financial services in the continent. Airtel Money caters to Africa and includes mobile wallet deposit and withdrawals, merchant and commercial payments, benefits transfers, loans and savings, virtual credit card and international money transfers. With this investment, Mastercard will be able to participate and provide these services in South Africa.Mastercard already has business relations with Airtel. Back in 2019, both struck a deal, giving Airtel Africa's 100 million subscribers in 14 nations an access to Mastercard's global network.This deal will help Mastercard reap opportunities from the growing market in Africa. Mobile internet connections are expected to grow rapidly in Africa owing to low-cost smartphones and high-speed GSM networks, which are being rolled out by Mobile Network Operators like Airtel.  This growth in internet connections is spurring demand for digital content, social media, m-commerce, even online education and a need to make online payments easily and securely by both banked and unbanked consumers.MasterCard network extends the company's presence to 48 of the 55 markets that cover the continent. Economic development, population growth and an improving political situation create the need for innovative and secure payment solutions. Given the utmost strategic importance that this continent holds for MasterCard, the company is committed to invest in infrastructure, people and the know-how in this part of the world. This has been the fastest growing area for MasterCard over the past few years and is expected to continue making a laudable progress.MasterCard is collaborating with governments, central banks, financial institutions, mobile network operators, large retailers and other stakeholders across Africa to understand the economic outlooks of its countries, their unique demographics, infrastructure challenges and hidden opportunities.Year to date, the stock has inched up 1.8% compared with the <a href=\"https://www.zacks.com/stocks/industry-rank/industry/financial-transaction-services-282\" data-type=\"url\" class=\"tr-link\" translate=\"no\">industry</a> 's growth of 0.7%.</p><p>Other stocks in the same space, namely<span>American Express Co.</span><a href=\"http://www.zacks.com/stock/quote/AXP\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AXP</a> and<span>Discover Financial Services</span><a href=\"http://www.zacks.com/stock/quote/DFS\" data-type=\"url\" class=\"tr-link\" translate=\"no\">DFS</a> have also rallied 19.6% and 7.4%, respectively, but<span>Visa Inc.</span><a href=\"http://www.zacks.com/stock/quote/V\" data-type=\"url\" class=\"tr-link\" translate=\"no\">V</a> has lost 0.8% over the same time period.Mastercard currently has a Zacks Rank #4 (Sell).</p></div><div class=\"tr-npp-body\"><p>You can see<span><span><a href=\"https://www.zacks.com/stocks/buy-list/?ADID=zp_1link&amp;ICID=zpi%20_1link\" data-type=\"url\" class=\"tr-link\" translate=\"no\">the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.</a> </span></span></p><p class=\"tr-npp-section-title\">Bitcoin, Like the Internet Itself, Could Change Everything</p><p>Blockchain and cryptocurrency has sparked one of the most exciting discussion topics of a generation. Some call it the \"Internet of Money\" and predict it could change the way money works forever. If true, it could do to banks what Netflix did to Blockbuster and Amazon did to Sears. Experts agree we're still in the early stages of this technology, and as it grows, it will create several investing opportunities.</p><p>Zacks' has just revealed 3 companies that can help investors capitalize on the explosive profit potential of Bitcoin and the other cryptocurrencies with significantly less volatility than buying them directly. </p><p><span><a href=\"https://www.zacks.com/registration/ultimatetrader/welcome/eoffer/3b9f?add=1424&amp;adid=ZCOM_ZU_CryptocurrencyReport_A_ANALYSTBLOG_IND_CRYPTO_A_040521&amp;icid=EOAC-ANALYSTBLOG-tx-ZU040521\" data-type=\"url\" class=\"tr-link\" translate=\"no\">See 3 crypto-related stocks now &gt;&gt;</a> </span></p><p> </p><p> </p><p>Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.</p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=RPT_7BST_LP194&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYST_BLOG_255&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_finance_sector-1349471\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Click to get this free report</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZR_LINK&amp;d_alert=rd_final_rank&amp;t=AXP&amp;ADID=NEWSTEX_CONTENT_ZR_ARTCAT_ANALYST_BLOG_255&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_finance_sector-1349471\" data-type=\"url\" class=\"tr-link\" translate=\"no\">American Express Company (AXP): Free Stock Analysis Report</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=MA&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYST_BLOG_255&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_finance_sector-1349471\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Mastercard Incorporated (MA): Free Stock Analysis Report</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=V&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYST_BLOG_255&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_finance_sector-1349471\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Visa Inc. (V): Free Stock Analysis Report</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=DFS&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYST_BLOG_255&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_finance_sector-1349471\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Discover Financial Services (DFS): Free Stock Analysis Report</a></p><p> </p><p><a href=\"http://www.zacks.com/stock/news/1349471/mastercard-ma-to-invest-%24100-million-in-airtel-africa?cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_finance_sector-1349471\" data-type=\"url\" class=\"tr-link\" translate=\"no\">To read this article on Zacks.com click here.</a></p><p>The views expressed in any and all content distributed by Newstex and its re-distributors (collectively, the \"Newstex Authoritative Content\") are solely those of the respective author(s) and not necessarily the views of Newstex or its re-distributors. Stories from such authors are provided \"AS IS,\" with no warranties, and confer no rights. The material and information provided in Newstex Authoritative Content are for general information only and should not, in any respect, be relied on as professional advice. Newstex Authoritative Content is not \"read and approved\" before it is posted. Accordingly, neither Newstex nor its re-distributors make any claims, promises or guarantees about the accuracy, completeness, or adequacy of the information contained therein or linked to from such content, nor do they take responsibility for any aspect of such content. The Newstex Authoritative Content shall be construed as author-based content and commentary. Accordingly, no warranties or other guarantees are offered as to the quality of the opinions, commentary or anything else appearing in such Newstex Authoritative Content. Newstex and its re-distributors expressly reserve the right to delete stories at its and their sole discretion.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Zacks Investment Research</p></div>"}