{"date": "2021-12-19 08:03:11.916000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3400.35, "close": 3408.34}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon may take legal action against the Competition Commission of India\u0092s (CCI) suspension of the US e-commerce giant\u0092s 2019 deal with Future Retail (FRL). Its legal teams plan file appealing before the National Company Law Appellate Tribunal (NCLAT) and the Delhi High Court and may approach the Supreme Court, said people familiar with the Amazon\u0092s strategy.</p><p>The CCI on Friday suspended Amazon\u0092s 2019 deal with Future Retail (FRL), citing the company\u0092s alleged deliberate design to suppress information about the scope and purpose of the deal. The antitrust regulator has imposed a penalty of Rs 200 crore on Amazon to be paid within 60 days of receipt of order.</p></div><div class=\"tr-npp-body\"><p>\u0093This Amazon-Future deal was like a marriage where the janam kundali (birth chart) of the boy and girl was exchanged. The records clearly showed that the boy is a Manglik (mars defect). After a few years of marriage, the other family comes back and says that \u0091the information about the boy being Manglik was not given verbally, so the marriage cannot continue\u0092,\u0094 said a person familiar with the matter, referring to horoscope practices followed in some Hindu weddings.</p><p>\u0093Similarly when Amazon submitted the document to CCI, it clearly mentioned that the company\u0092s investment in Future Coupons is a strategic investment as the government at some point in time may allow investment into the multi-brand retail sector in the country. Amazon\u0092s legal team is expected to make the argument that there was no misrepresentation of facts and all the information had been clearly mentioned.\u0094</p><p>An Amazon spokesperson on Friday had said that the firm is reviewing the order passed by the CCI, and will decide on the next steps in due course.</p><p>This issue goes back to August 2019, when Amazon acquired 49 per cent stake in Future Coupons, the promoter entity of FRL (Future Retail), for around Rs 1,500 crore. One year later, in August 2020, Future Group struck a $3.4-billion asset-sale deal with Reliance Industries (RIL).</p><p>In October 2020, Amazon had sent a legal notice to Future for striking a deal with RIL. It alleged that Future\u0092s $3.4-billion asset sale deal with RIL breached an agreement with Amazon. It cited its non-compete agreement with the Kishore Biyani-led chain. The deal specified any disputes would be arbitrated under the Singapore International Arbitration Centre (SIAC) rules. The same month, Amazon got a favourable ruling for its plea in SIAC against the deal.</p><p>In November 2020, Future moved the Delhi High Court (HC) against Amazon, alleging interference by the US firm in the deal with RIL. Since then, Amazon has been fighting a legal battle with FRL to stop Future\u0092s $3.4-billion deal with RIL.</p><p>Legal experts said CCI\u0092s order against Amazon is unprecedented. \u0093It also reiterates established jurisprudence that all the transactions, which may in any manner be interconnected or related or known in advance, are to be disclosed to the CCI,\u0094 said</p><p>Rahul Goel, Partner, at law firm AnantLaw. \u0093Amazon will have a right to file an appeal against the said order before the National Company Law Appellate Tribunal and must exercise so judiciously.\u0094</p><p>The CCI order is novel in many ways. Firstly, it is the first case since the introduction of the merger control regime in June 2011, the CCI has suspended its approval. \u0093Whether the CCI has the power to do that under the scheme of the Competition Act will be tested before the appellate court i.e., NCLAT,\u0094 said Vaibhav Choukse, Partner, at law firm JSA.</p><p>The CCI has also directed Amazon to notify the transaction afresh in Form II (long form), which will enable the CCI to conduct the competition assessment with all material information.</p><p>\u0093Secondly, it\u0092s the highest penalty ever imposed by the CCI in a case of Combination. There are two sets of penalties levied by the CCI (i) for suppression/ omission of material facts and (ii) for failure to notify combination i.e., gun-jumping,\u0094 said Choukse of JSA.</p><p>Legal experts also said that Amazon is likely to appeal against the CCI order before the appellate tribunal i.e National Company Law Appellate Tribunal (NCLAT). \u0093Given the track record of NCLAT, it is likely to stay the CCI order with a condition to deposit 10 per cent of the penalty amount. With respect to suspending the 2019 CCI approval, practically, it won\u0092t hurt Amazon as they have already consummated/ closed the transaction,\u0094 said Choukse.</p><p>Legal experts said the penalty amount of Rs 200 crore on Amazon is the highest so far imposed by the CCI, in case of Combination. They said with CCI flexing its muscles, the companies involved in the M&amp;A activities will be on their toes while undertaking the merger control analysis.</p><p>Amazon has the option to reapply for antitrust clearance. However, Salman Waris, managing partner at technology law firm TechLegis Advocates &amp; Solicitors, said after the CCI's decision, Future Group, is unlikely going to cooperate in this regard and for further bolstering its argument that Amazon has no legal basis to challenge its asset sale with RIL.</p><p>\u0093Future Group is likely going to take CCI's decision before various legal forums. The suspension of the approval is absolutely unprecedented,\u0094 said Waris. \u0093The order seems to have found new power for CCI to keep the combination approval in abeyance. This could dent Amazon's legal position and retail ambitions while making it easier for Reliance to acquire Future Group.\u0094</p><p>This is crucial as only 7 per cent of India\u0092s $1.2-trillion retail market is online, and Amazon and its rivals including Reliance\u0092s JioMart and Walmart-owned Flipkart are aggressively eyeing the remaining 93 per cent. Also, the Indian e-commerce market is expected to grow to $200 billion by 2026 from $38.5 billion in 2017.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}