{"date": "2022-01-11 23:33:45.594000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_w23y7fj5&amp;referenceId=1_w23y7fj5&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_w23y7fj5&amp;referenceId=1_w23y7fj5&amp;pageId=RefinitivNewscasts</a></pre>Source: Stocktube<br/><br/>Description: EMQQ founder Kevin T Carter joined Proactive to discuss the launch of HANetf and EMQQ's second emerging markets exchange traded fund that exposes investors to e-commerce and internet companies in developing markets excluding China.&amp;#xD;&amp;#xD;Cartere says the FMQQ Next Frontier Internet &amp; Ecommerce ESG-S UCITS ETF will provide investors with targeted exposure to the non-Chinese companies that are in EMQQ Emerging Markets Internet and Ecommerce UCITS ETF, seeking to harness “the incredible growth potential” of internet and e-commerce companies in frontier and emerging markets economies other than China, such as India, Brazil, Mexico, Russia, Turkey, Nigeria and Indonesia.<br/>Short Link: <a href=\"https://refini.tv/3GiJe8p\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3GiJe8p</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; Hello, and welcome back to Proactive New York. Joining me today is Kevin Carter from EM QQ. Kevin, good to see you. How are you? &gt;&gt; Great. Great to see you. &gt;&gt; Kevin, today we are talking about a new fund that has begun trading in London today. Together with Han ETFU, you've introduced the FMQQ next frontier Internet and e-commerce ETF. Tell me a bit about this new fund. &gt;&gt; Sure. Well, as you know our flagship fund, EMQQ, is an emerging markets Internet and e-commerce ETF and attracts a universe of all emerging and frontier markets. Historically been heavily dominated by China. China has been about 65 percent of EMQQ since inception. It's been about 80 percent of the fundamental story of the revenues. The reason is that China's Internet and e-commerce market is the most developed in the world, and in fact, China's e-commerce market, which is considerably bigger than the United States e-commerce market, it's four times larger than the other 45 emerging and frontier markets combined. It's really on its own level, but the story in all of these countries is what we call the great confluence, which is there's three very big and important megatrends happening all over the world. They're happening at the same time and we are involved, except we were the first people involved and we lose sight of the fact that the rest of the world wants to be like us and slowly but surely they're getting there. That means three things, first of all, consumption. We've had a consumer economy for a couple of generations now. I've got a couple of pairs of shoes and a couple of coats and a car and I take vacations. Most of the world is just now becoming consumers and they want more and better food and clothing, they want appliances, they want vacations, and entertainment, and cars. That's the story and it's a big deal and it's what McKinsey calls the biggest growth opportunity in the history of capitalism. It's what I've been focused on for the last 15 years, is tapping into that story. But the two other parts of the story that have quickly emerged are first to the computer. I've had a computer for about 30 years now. But most of the world is getting their first computer today and it's not on their desk, it's a smartphone made in China and it costs 50 or $60 running on Android. The computer which has gotten better and evolved into this amazing smartphone products. We've taken it for granted, but most of the world's just now getting that computer. They're getting with that, their first ever Internet access, something I've had for 25 years, first over a telephone line and then over a cable and now it just shows up in my pocket. Well, most of the world has never been wired, 85 percent of the world's people are becoming consumers, are getting the first computer, their first Internet access. The result is what I think is the fastest growing sector in the world ever. The sector has grown its revenue by about 38 percent a year over the last decade. Now that's slowing down, and will be in the 20s this year, but it's still a huge growth story. Why the FMQQ part of the story is so compelling is, as I said, China's e-commerce market is pretty well-developed. If you look into e-commerce as a percentage of retail, China's about the 25 percent and going to 30 percent fast. The rest of the emerging and frontier markets, the FMQQ countries, their e-commerce penetration is less than 5 percent. It's about a fifth the penetration, but there's four times as many people in FMQQ countries, in India, in Indonesia, in Bangladesh, in Brazil, and all over Africa. There are entrepreneurs, many of them educated at Harvard or Stanford or having worked for Google or Facebook. They're starting their own localized version of all of these apps that we have learned to use and have changed our lives. &gt;&gt; Mexico, Russia, Turkey, are also included in this as well. What are some companies that are included in the fun that really stand out to you? &gt;&gt; Well, the two ones that I think are most important, first is Mercado Libre, which trades on the NASDAQ, with the ticker ME ALI. This is a company that's headquartered in Argentina. The fact sheets and database will show you an Argentina weight. But that company is the e-commerce and Fintech leader in all of Central and South America. Brazil, the biggest market in South America is about half of Mercado Libre's business, but it's operating in Mexico, it's operating in places like Nicaragua and Honduras, which aren't even considered markets in terms of investing. That's one that really stands out. It's been a very strong performer for us and it's also the company that showed us how big the Fintech story is in the developing world. This is an area where I think U.S. and European investors may not appreciate how big and powerful the story is, as all of these billions of people skip the bank account and go straight to digital consumption and digital payments and they're way more advanced than we are. Mercado Libre, one of the standouts. Then the other one is Sea Limited. S-E-A Limited, which trades on the New York Stock Exchange with the ticker SE. Now, here again, the fact sheet will show you Singapore, which is where they're headquartered. But this company is operating all over Southeast Asia in the Indonesia, the Philippines, Vietnam, It's also in South America and going to Europe and it has three different apps. It's really unlike any other company that I think most investors would be familiar with. It's a gaming company. It's partnered with and it's partially owned by Tencent. It is an e-commerce company. The Shopee app is actually also in the distance in Southeast Asia. It's got a very good market share in Brazil, and it's also in financial services. Again, the financial services part, I can't overstate it. In fact, one of the other interesting companies, it hasn't come public yet, that is an FMQQ country. All of the FMQ companies are also in the MQQ, but half of VMQQ remains China. There's a company called GoTo, which is a recent merger of two Indonesian companies, the Uber of Indonesia, GoJek, which is also the DoorDash of Indonesia and the FedEx ground of Indonesia. All of that happening on scooters and mopeds is merging with Tokopedia, which is the Amazon, the e-commerce leader of Indonesia, which is a fourth largest country in the world by population. Both of these companies have very well-established Fintech businesses as well. The reason they have those is that when they started their businesses the ride hailing in the case of Gojek, nobody had electronic payment mechanism so it was happening in cash. These companies put in place a payments platform that itself, as the tens of millions of customers came on became financial services companies that are getting spun off into their own independent companies. I guess one other company that I would highlight is a recent IPO from Brazil called Nubank. It's trading on the New York Stock Exchange with the ticker symbol NU. This is the largest online bank in the world, out of Brazil. Berkshire Hathaway is one of its cornerstone investors. It's an IPO that's actually come down a little bit and I think it was a very fairly priced IPS. I think valuations right now in both EMQQ and FMQQ are very attractive. &gt;&gt; Well, Kevin, always super interesting to speak with you. Thank you so much. Appreciate it. &gt;&gt; Thanks, Christine.<br/></span></div></div></div></div>"}