{"date": "2021-12-20 11:00:39.891000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The shares of Future Group companies surged up to 20 per cent on on Monday after the Competition Commission  of India (CCI) suspended its over two-year-old approval for Amazon's deal with Future Coupons and imposed a Rs 202-crore penalty on the e-commerce giant.</p><p>The shares of Future Lifestyle Fashions hit a 20 per cent upper circuit, while Future Supply Chain Solutions climbed 19.99 per cent. Future Retail surged 19.92 per cent, Future Enterprises rose 19.93 per cent and Future Consumer zoomed 19.91 per cent on the BSE. All these companies hit their upper circuit limits.</p></div><div class=\"tr-npp-body\"><p>In a major development, the CCI on Friday suspended its nod to Amazon's 2019 investment in Future Coupons Private Ltd (FCPL), after finding that Amazon had concealed significant information while seeking regulatory approval.</p><p>The suspension, termed \"unprecedented\" by experts, may hit Amazon's efforts to block Reliance Industries' (RIL) acquisition of Future Retail's assets.</p><p>The CCI ruling assumes significance amid the long-drawn bitter legal battle between Amazon and Future Group over the Indian entity's proposed Rs 24,713 crore-deal with Reliance Retail Ventures (RRVL).</p><p>Deals beyond a certain threshold require a nod by the CCI and it is rare for the watchdog to suspend an approval.</p><p>The CCI said suppression of key information arose \"from a deliberate design on the part of Amazon to suppress the actual scope and purpose of the Combination,\" and imposed a fine of Rs 202 crore on the company.</p><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}