{"date": "2021-11-29 12:51:15+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>\n      A Stream Battle: Celebs vs Streamers has premiered on <a href=\"https://www.twitch.tv/tnt_online\" data-type=\"url\" class=\"tr-link\" translate=\"no\">TNT TV's Twitch channel</a>. Scheduled to have thirteen streams, the new show is hosted by Vika Mccline and Jack Looney, the new digital stars of TNT, and invites Twitch, TV, and Internet stars as guests to battle in video games, both new and old titles, but still captivating ones.\n    </p>\n              <p>\n      Sber is the partner of the show. Its viewers can affect the stream outcome by voting for one of the teams in the SberBank Online application's <a href=\"https://www.sberbank.ru/sms/new-didl/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Dialogues section</a>. The team with the most votes gets a difficulty increase.\n    </p>\n              <p>\n      The final stream is scheduled for December 11. This special project has been co-implemented with the SberMarketing agency.\n    </p>\n              <p>\n                <strong>\n                  <span>Artem Mogilin, director, Special Solutions, Sberbank:</span>\n                </strong>\n              </p>\n              <p>\n                <span>\"The functionality of the SberBank Online application is thought through to the extent that it facilitates finance management for millions of young people every day. Moreover, it can be used in completely different life scenarios. In the Dialogues section of SberBank Online, you can transfer money to friends, send postcards or donations to your favorite streamers. We have used the transfer function to make the stream even more exciting.\"</span>\n              </p>\n              <p>\n                <strong>\n                  <span>Alina Efimova, deputy CEO for sales, Gazprom Media sales house:</span>\n                </strong>\n              </p>\n              <span>\"Today, streaming platforms are a promising territory for advertisers. We are glad that Sber has supported this bold idea and became a partner to this unique project. Our integration on the TNT Twitch channel is the next level of advertising opportunities.\"</span>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.sberbank.com/news-and-media/press-releases/article?newsID=5a65eb73-5eb6-420b-b732-009e4feaaed4&amp;blockID=7&amp;regionID=77&amp;lang=en&amp;type=NEWS\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Sberbank of Russia</strong> published this content on <strong>29 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>29 November 2021 12:51:15 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Sberbank of Russia</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Sberbank-of-Russia</p></div>"}