{"date": "2021-11-26 13:22:32+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3580.41, "close": 3561.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\"><li class=\"tr-summaryitem\">Climate activists target 13 Amazon depots in UK</li><li class=\"tr-summaryitem\">Amazon says working to minimise potential customer disruption </li><li class=\"tr-summaryitem\">Workers strike in Germany, France and Italy </li></ul><p class=\"tr-advisory\">Adds Amazon comment on potential disruption</p><p class=\"tr-by\">By Henry Nicholls and James Davey</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">TILBURY, England, Nov 26 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Climate activists targeted 15 Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> depots across Europe on \"Black Friday\" and the world's biggest e-commerce company also faced protests by workers and delivery drivers in Germany, France and Italy.</p><p>Amazon, based in Seattle, is facing criticism from climate activists who say excessive consumption harms the environment while an alliance of trade unions say the company does not pay workers enough nor enough tax to governments.</p><p>\"Black Friday epitomises an obsession with overconsumption that is not consistent with a liveable planet,\" the Extinction Rebellion group said after blocking 13 Amazon depots across the United Kingdom.</p><p>\"Amazon and companies like it have capitalised on our desire for convenience and stoked rampant consumerism at the expense of the natural world,\" it said.</p><p>Reuters reporters at an Amazon depot at Tilbury docks in eastern England said protesters had blocked the entrance, meaning no vehicles could enter or exit. The group also said it had blocked Amazon depots in Germany and the Netherlands. </p><p>Banners read: \"Black Friday exploits people and planet\" and \"Infinite growth, finite planet\".</p><p>Extinction Rebellion said Amazon's \"crimes\" included activities which emitted more carbon dioxide than a medium sized country, helping fossil fuel companies.</p><p>\"We have a large network of sites across the UK and are working to minimise any potential disruption to customers,\" said a spokesperson for Amazon, which brought the traditional U.S. Black Friday discount day to Britain in 2010.</p><p>Amazon also said it takes its responsibilities \"very seriously\".</p><p>\"That includes our commitment to be net zero carbon by 2040 - 10 years ahead of the Paris Agreement - providing excellent pay and benefits in a safe and modern work environment, and supporting the tens of thousands of British small businesses who sell on our store.\"</p><p>\"We know there is always more to do,\" it said.</p><p>Trade unions across Europe's biggest economies also called out warehouse workers and delivery drivers to strike against what they said were Amazon's unfairly low wages and tax payments. </p><p>In Germany, the company's biggest market after the United States, the Verdi union said around 2,500 employees went on strike at Amazon shipping centres in Rheinberg, Koblenz and Graben.</p><p>In France, one of the country's top labour unions, CGT, called for Amazon workers in the country to go on strike. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nS8N28S046\" data-type=\"storyId\" data-story-id=\"nS8N28S046\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span>. The union coalition also reported a strike in Italy. </p><p>\"The coalition demands Amazon pays its workers fairly and respects their right to join unions, pays its fair share of taxes and commits to real environmental sustainability,\" the \"Make Amazon Pay\" coalition said in a statement.</p><p><br/></p><p class=\"tr-signoff\"> (Writing by Guy Faulconbridge, Paul Sandle and James Davey; additional reporting by Riham Alkousaa and Matthias Inverardi in Berlin and Mathieu Rosemain and Silvia Aloisi in Paris; editing by Kirsten Donovan)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:guy.faulconbridge@thomsonreuters.com\" data-type=\"email\" translate=\"no\">guy.faulconbridge@thomsonreuters.com</a> ; 07825218698; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: RETAIL-HOLIDAYSHOPPING/CLIMATE (UPDATE 4, PIX, TV)</p></div>"}