{"date": "2022-01-05 14:21:03+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Amazon and Stellantis Collaborate to Introduce Customer Centric Connected Experiences Across Millions of Vehicles, Helping Accelerate Stellantis' Software Transformation</p>\n</div>\n<div class=\"tr-npp-body\">\n<pre>AMAZON (\"AMZN-Q\")\nSTELLANTIS N V (\"STLA-N\")\n- Amazon and Stellantis Collaborate to Introduce Customer-Centric\n- Connected Experiences Across Millions of Vehicles, Helping\n- Accelerate Stellantis' Software Transformation\n\n     Amazon and Stellantis will collaborate to deliver software solutions\nfor Stellantis' new digital cabin platform, STLA SmartCockpit, starting in\n2024\n\n     Stellantis selects AWS as its preferred cloud provider for vehicle\nplatforms to deliver on its long-term, software-focused vision\n\n     AWS and Stellantis to launch collaborative engineering and innovation\ninitiatives and tools to accelerate time to market for new digital products\nand upskill Stellantis' global workforce\n\n     Amazon to be the first commercial customer for the new Ram ProMaster\nBattery Electric Vehicle (BEV) in 2023, further expanding Amazon's\nsustainable delivery network\n\n     Amazon and Stellantis N.V., a leading global automaker and mobility\nprovider, today announced a series of global, multi-year agreements that\nwill transform the in-vehicle experience for millions of Stellantis\ncustomers and advance the mobility industry's transition to a sustainable,\nsoftware-defined future.\n\n     Stellantis will accelerate its shift to becoming a sustainable\nmobility tech company through this relationship, which involves Amazon\nDevices, Amazon Web Services (AWS), and Amazon Last Mile. Stellantis and\nAmazon will collaborate to deploy Amazon's technology and software\nexpertise across Stellantis' organization, including vehicle development,\nbuilding connected in-vehicle experiences, and training the next generation\nof automotive software engineers. Together, the two companies will create a\nsuite of software-based products and services that seamlessly integrate\nwith customers' digital lives and add value over time through regular\nover-the-air (OTA) software updates.\n\n     \"Over the past two decades, Amazon has built the technology,\nexpertise, and culture of innovation to be a world leader in cloud\ncomputing, artificial intelligence, and machine learning. We've used these\ncapabilities to make life better for customers around the world through\nproducts and services like Alexa, Kindle, and Fire TV, and with AWS we've\nhelped thousands of companies transform themselves and their industries.\nWe're excited to collaborate with Stellantis to transform the automotive\nindustry and re-invent the in-vehicle experience,\" said Andy Jassy, CEO of\nAmazon. \"We are inventing solutions that will help enable Stellantis to\naccelerate connected and personalized in-vehicle experiences, so that every\nmoment in motion can be smart, safe, and tailored to each occupant.\nTogether, we will create the foundation for Stellantis to transform from a\ntraditional automaker into a global leader in software-driven development\nand engineering.\"\n\n     \"Working together with Amazon is an integral part of our capability\nbuilding roadmap, based on both developing internal competencies and\ndecisive collaborations with tech leaders, and it will bring significant\nexpertise to one of our key technology platforms, STLA SmartCockpit,\" said\nCarlos Tavares, CEO of Stellantis. \"By leveraging artificial intelligence\nand cloud solutions, we will transform our vehicles into personalized\nliving spaces and enhance the overall customer experience, making our\nvehicles the most wanted, most captivating place to be, even when not\ndriving.\"\n\n     The collaboration brings together Amazon's leadership and innovation\nin digital experiences, cloud computing, artificial intelligence (AI), and\nmachine learning with Stellantis' automotive engineering excellence and\nportfolio of 14 iconic vehicle brands. Stellantis outlined its software\nstrategy during its Software Day program in December 2021.\n\n     The collaboration will focus on several areas.\n\n     STLA SmartCockpit\nAmazon and Stellantis will collaborate to deliver software for STLA\nSmartCockpit, which will run in millions of Stellantis vehicles globally\nstarting in 2024. The software-defined platform will seamlessly integrate\nwith customers' digital lives to create personalized, intuitive in-vehicle\nexperiences through AI-enhanced applications for entertainment,\nAlexa-enabled voice assistance, navigation, vehicle maintenance, ecommerce\nmarketplaces, and payment services.\n\n     The STLA SmartCockpit platform will use Amazon products and solutions\nthat are purpose-built for vehicles, and Stellantis will have the\nflexibility to create custom, brand- and vehicle-specific capabilities. The\nsoftware will offer curated services and experiences through an app\nstore--all displayed through an intelligent, adaptive user interface design\nthat presents timely, relevant information and features suited to each\noccupant's individual needs and preferences.\n\n     STLA SmartCockpit will adapt to customers' behaviors and interests,\nwherever their passions take them-from the start of a journey at home, on\nthe road, or off. For example, Chrysler Pacifica vehicles could offer a\nfamily-trip planner that recommends media content, points of interest,\nrestaurants, and other fun stops along the route. Jeep(R) vehicles could\ncome with a digital off-road \"coach\" to help customers calibrate the\nvehicle and optimize performance before tackling tough terrain.\n\n     Integration with Amazon's leading smart home and security services\nwill allow customers to proactively monitor and manage their homes while on\nthe go. Stellantis customers will also be able to manage their vehicles\nfrom their Alexa-enabled devices at home or their Alexa smartphone app,\nincluding using custom Alexa skills to set the in-cabin temperature before\ngetting into their vehicle, schedule service, or order accessories.\n\n     The development work on STLA SmartCockpit will leverage Mobile Drive,\nthe joint venture formed by Stellantis and Foxconn in 2021, to develop\nbreakthrough digital cockpits and personalized connected services.\n\n     Collaborative Engineering and Innovation\nAs part of this multi-year engagement, Stellantis has selected AWS as its\npreferred cloud provider for vehicle platforms. Together, Stellantis and\nAmazon plan to build the next generation of cloud-enabled infrastructure\nfor vehicle platforms, including for STLA SmartCockpit.\n\n     Stellantis plans to migrate its current vehicle data pipeline across\nits brands and geographies into a cloud-based data mesh, making use of AWS'\nadvanced capabilities for scalable and durable real-time data streaming. By\nmoving to an AWS-powered data mesh, Stellantis engineers can use the tools\nand interface that best suit each project. Stellantis also aims to\naccelerate the time to market for new digital products that leverage AWS\nmachine learning to deliver greater personalization and more accurate\npredictive maintenance.\n\n     Both companies are creating a cloud-based product development\nenvironment called the \"Virtual Engineering Workbench,\" which provides\nautomated workflows to manage software development and testing,\nhigh-performance simulations, machine learning model training, and data\ncollection and analysis.\n\n     Innovation Hubs and Agile-Auto Software and Data Academy\nStellantis recently announced the launch of a Software Academy for the\nupskilling and reskilling of existing and new employees. As part of this,\nStellantis and AWS also plan to launch a new global learning curriculum,\ncalled the Agile-Auto Software and Data Academy, which will cover software,\ndata and cloud technology. Stellantis will also train more than 5,000\ndevelopers and engineers by 2024 in AWS-related cloud technologies to\naccelerate its transformation into a data-driven enterprise in the cloud.\n\n     To further speed development activities and reduce time to market for\nnew capabilities, Stellantis and AWS will launch a global network of\nAWS-powered Innovation Hubs where experts from both companies will innovate\nusing the breadth and depth of AWS cloud services.\n\n     Expanding Amazon's Sustainable Delivery Network\nStellantis has provided tens of thousands of Light Commercial Vehicles\n(LCVs) to Amazon since 2018 to support its last mile operations in North\nAmerica and Europe with vehicles including Ram ProMaster, Fiat Ducato, and\nPeugeot and Citroen LCVs.\n\n     In support of The Climate Pledge and its commitment to be net-zero\ncarbon by 2040, Amazon is transforming its last-mile operations with new\nsustainable solutions. As part of a separate agreement with Stellantis,\nAmazon will be the first commercial customer for Stellantis' new Ram\nProMaster Battery Electric Vehicle (BEV) launching in 2023. Stellantis,\nwith input from Amazon, designed the vehicle with unique last mile delivery\nfeatures and Amazon will deploy the vehicles to routes across the United\nStates. Building on the current relationship and as part of the long-term\nagreement, Stellantis and Amazon will be putting thousands of BEV\nProMasters on the road every year.\n\n     Building from a Strong Foundation\nToday's announcement expands on existing areas of collaboration between\nStellantis and Amazon. Stellantis was the first automaker to integrate the\nAmazon Fire TV experience with the release of the all-new 2022 Wagoneer and\nGrand Wagoneer, and will bring this same in-vehicle entertainment\nexperience to Jeep Grand Cherokee and Chrysler Pacifica. Stellantis was\nalso the first automotive OEM to announce plans to implement Alexa Custom\nAssistant, a solution which makes it possible to create custom, intelligent\nAI and voice-driven experiences built on Alexa technology. Today,\nStellantis also offers the Alexa Built-in voice experience in its vehicles\naround the world, making it easy to navigate, play music, listen to\npodcasts and audiobooks, make calls, manage calendars, hear the news, check\nthe weather, control smart home devices, and more--just by asking Alexa.\n\n     # # #\n\nAbout Amazon\nAmazon is guided by four principles: customer obsession rather than\ncompetitor focus, passion for invention, commitment to operational\nexcellence, and long-term thinking. Amazon strives to be Earth's Most\nCustomer-Centric Company, Earth's Best Employer, and Earth's Safest Place\nto Work. Customer reviews, 1-Click shopping, personalized recommendations,\nPrime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career\nChoice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out\ntechnology, Amazon Studios, and The Climate Pledge are some of the things\npioneered by Amazon. For more information, visit amazon.com/about and\nfollow @AmazonNews.\n\n     About Amazon Web Services\nFor over 15 years, Amazon Web Services has been the world's most\ncomprehensive and broadly adopted cloud offering. AWS has been continually\nexpanding its services to support virtually any cloud workload, and it now\nhas more than 200 fully featured services for compute, storage, databases,\nnetworking, analytics, machine learning and artificial intelligence (AI),\nInternet of Things (IoT), mobile, security, hybrid, virtual and augmented\nreality (VR and AR), media, and application development, deployment, and\nmanagement from 84 Availability Zones within 26 geographic regions, with\nannounced plans for 24 more Availability Zones and eight more AWS Regions\nin Australia, Canada, India, Israel, New Zealand, Spain, Switzerland, and\nthe United Arab Emirates. Millions of customers--including the\nfastest-growing startups, largest enterprises, and leading government\nagencies--trust AWS to power their infrastructure, become more agile, and\nlower costs. To learn more about AWS, visit aws.amazon.com.\n\n     About Stellantis\nStellantis (NYSE / MTA / Euronext Paris: STLA) is one of the world's\nleading automakers and a mobility provider, guided by a clear vision: to\noffer freedom of movement with distinctive, affordable and reliable\nmobility solutions. In addition to the Company's rich heritage and broad\ngeographic presence, its greatest strengths lie in its sustainable\nperformance, depth of experience and the wide-ranging talents of employees\nworking around the globe. Stellantis leverages its broad and iconic brand\nportfolio, which was founded by visionaries who infused the marques with\npassion and a competitive spirit that speaks to employees and customers\nalike. Stellantis aspires to become the greatest, not the biggest while\ncreating added value for all stakeholders as well as the communities in\nwhich it operates. For more information, visit stellantis.com.\n\n     Amazon\namazon-pr@amazon.com\n\n     Stellantis\nNorth America Communications\nShawn Morgan\n+1 248 760-2621\nshawn.morgan@stellantis.com\n\n     Technology\nNick Cappa\n+1 248 202-8039\nnick.cappa@stellantis.com\n\n     Forward-Looking Statements\nThis communication contains forward-looking statements. In particular,\nstatements regarding future events and anticipated results of operations,\nproduct and business strategies, the anticipated benefits of the proposed\ncollaboration, future financial and operating results, the anticipated\ndates for product introductions and other anticipated aspects of our\noperations or operating results are forward-looking statements. These\nstatements may include terms such as \"may\", \"will\", \"expect\", \"could\",\n\"should\", \"intend\", \"estimate\", \"anticipate\", \"believe\", \"remain\", \"on\ntrack\", \"design\", \"target\", \"objective\", \"goal\", \"forecast\", \"projection\",\n\"outlook\", \"prospects\", \"plan\", or similar terms. Forward-looking\nstatements are not guarantees of future performance. Rather, they are based\non the parties' current state of knowledge, future expectations and\nprojections about future events and are by their nature, subject to\ninherent risks and uncertainties. They relate to events and depend on\ncircumstances that may or may not occur or exist in the future and, as\nsuch, undue reliance should not be placed on them.\n\nActual results may differ materially from those expressed in\nforward-looking statements as a result of a variety of factors, including:\nuncertainties as to whether the benefits of the proposed collaboration\ndiscussed in this document will be realized or as to the timing thereof;\nthe satisfaction of the conditions precedent to consummation of proposed\ntransactions, at all or in a timely manner; the risk that the businesses of\nthe parties will be adversely impacted during the pendency of the proposed\ncollaboration; the ability of Stellantis to successfully integrate the\nAmazon and AWS' offerings; business disruptions; the ability to retain and\nhire key personnel and maintain relationships with customers, suppliers and\nothers with whom the companies do business; the impact of the COVID-19\npandemic, the ability of Stellantis to launch new products successfully and\nto maintain vehicle shipment volumes; changes in the global financial\nmarkets, general economic environment and changes in demand for automotive\nproducts, which is subject to cyclicality; changes in local economic and\npolitical conditions, changes in trade policy and the imposition of global\nand regional tariffs or tariffs targeted to the automotive industry, the\nenactment of tax reforms or other changes in tax laws and regulations;\nStellantis' ability to expand certain of their brands globally; its ability\nto offer innovative, attractive products; its ability to develop,\nmanufacture and sell vehicles with advanced features including enhanced\nelectrification, connectivity and autonomous-driving characteristics;\nvarious types of claims, lawsuits, governmental investigations and other\ncontingencies, including product liability and warranty claims and\nenvironmental claims, investigations and lawsuits; material operating\nexpenditures in relation to compliance with environmental, health and\nsafety regulations; the intense level of competition in the automotive\nindustry, which may increase due to consolidation; exposure to shortfalls\nin the funding of Stellantis' defined benefit pension plans; the ability to\nprovide or arrange for access to adequate financing for dealers and retail\ncustomers and associated risks related to the establishment and operations\nof financial services companies; the ability to access funding to execute\nStellantis' business plans and improve its businesses, financial condition\nand results of operations; a significant malfunction, disruption or\nsecurity breach compromising information technology systems or the\nelectronic control systems contained in Stellantis' vehicles; Stellantis'\nability to realize anticipated benefits from joint venture arrangements;\ndisruptions arising from political, social and economic instability; risks\nassociated with Stellantis' relationships with employees, dealers and\nsuppliers; increases in costs, disruptions of supply or shortages of raw\nmaterials, parts, components and systems used in Stellantis' vehicles;\ndevelopments in labor and industrial relations and developments in\napplicable labor laws; exchange rate fluctuations, interest rate changes,\ncredit risk and other market risks; political and civil unrest; earthquakes\nor other disasters; and other risks and uncertainties.\n\nAny forward-looking statements contained in this communication speak only\nas of the date of this document and Stellantis and Amazon disclaim any\nobligation to update or revise publicly forward-looking statements. Further\ninformation concerning the companies and their businesses, including\nfactors that could materially affect their financial results, is included\nin their respective reports and filings with the U.S. Securities and\nExchange Commission and, with respect to Stellantis, AFM.\n\n     ####\n\n    Attachment\n\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200400244.MNPRE2200401354-06202620220105</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}