{"date": "2021-11-02 15:41:37.030000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SFLMAVEN CORP (\"SFLM-0\")\n- Kicks Off 2021 Holiday Shopping Season with Huge Week as\n- Sales Top $264k\n\n   SFLMaven Corp., (\"SFLMaven\" or the \"Company\"), a leading provider of\nhigh-end luxury goods, is pleased to announce that the Company recorded\nbreakout sales during the final week of October - traditionally considered\nto be the start of the holiday shopping season - with its famous Thursday\nNight Auction event delivering over $244k in revenues in one night, and\ntotal sales for the week exceeding $264k.\n\n   \"We may already be seeing a bump in our demand from supply chain issues\nat retail designer jewelers,\" noted Joseph Ladin, CEO of SFLMaven. \"As we\nhave noted recently, global logistics are playing a huge role in\ndetermining outcomes in the high-end luxury goods marketplace right now,\nand primary jewelers, based on our understanding and analysis, may be\nhaving problems meeting roaring customer demand. At the same time, we have\nno manufacturing process and no supply chain, so we are here, very ready\nand very willing to capture migrating demand at strong margins.\"\n\n   The Company's Thursday Night Auction event was a big success, with total\nsales for the evening exceeding $244k. The feature sale of the evening was\na bracelet designed by famed jewelry designer, Andrew Grima, which went for\n$15,800.\n\n   Management notes that the Company anticipates the rest of the year will\ndeliver a higher average pace of sales than the preceding months of 2021\nbased on seasonal factors as well as situational factors involved in supply\nchain problems currently being faced by primary jewelry dealers. This\nfollows last week's announcement that SFLMaven's sales, year to date, are\nup on a year-over-year basis nearly 34% in 2021.\n\n   The Company hopes to augment that strong glide path with further\nmaterial developments in its new Collectibles Marketplace strategy, which\nfocuses on non-fungible tokens (NFTs), baseball cards, coins, comic books,\nhandbags, sneakers, and other collectible memorabilia.\n\n   Ladin added, \"We are looking to become something like the Amazon of the\ncollectibles marketplace over the next half decade. It's important to\nremember that we have two decades of success in auctioning unique and rare\nitems. We have amassed over 100k positive reviews in that time for a\nreason. The expansion from luxury goods to collectibles and NFTs is\nrelatively simple.\"\n\n   Follow SFLMaven on social media:\n\n   Twitter: @sflmaven\n Instagram: sflmaven\n\n   About SFLMaven\n\n   SFLMaven Corp. (OTC PINK: SFLM), is a premium provider of high-end\nluxury goods to discerning clientele globally. SFLMaven has driven over\n$130 million in sales and more than 100k positive reviews since inception,\nfamous for its Thursday Night Auction events on its top-rated eBay store.\n\n   For more information, please visit the Company's website at\nwww.sflmaven.com.\n\n   FORWARD-LOOKING STATEMENTS:\n\n   This press release may contain forward-looking statements, including\ninformation about management's view of SFLMaven Corp.'s future\nexpectations, plans and prospects. In particular, when used in the\npreceding discussion, the words 'believes,' 'expects,' 'intends,' 'plans,'\n'anticipates,' or 'may,' and similar conditional expressions are intended\nto identify forward-looking statements. Any statements made in this news\nrelease other than those of historical fact, about an action, event or\ndevelopment, are forward-looking statements. These statements involve known\nand unknown risks, uncertainties and other factors, which may cause the\nresults of SFLMaven, its subsidiaries and concepts to be materially\ndifferent than those expressed or implied in such statements. Unknown or\nunpredictable factors also could have material adverse effects on\nSFLMaven's future results. The forward-looking statements included in this\npress release are made only as of the date hereof. SFLMaven cannot\nguarantee future results, levels of activity, performance or achievements.\nAccordingly, you should not place undue reliance on these forward-looking\nstatements. Finally, SFLMaven undertakes no obligation to update these\nstatements after the date of this release, except as required by law, and\nalso takes no obligation to update or correct information prepared by third\nparties that are not paid for by SFLMaven.\n\nCorporate Contact\ninfo@sflmaven.com\n\nPublic Relations\nEDM Media, LLC\n<a href=\"https://edm.media\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://edm.media</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2130500753.MNPRE2130502827-08222120211102</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}