{"date": "2021-12-14 13:11:06+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n        Amazon signs the United Nations Women's Empowerment Principles and makes $1 million donation to the Resilience Fund for Women in Global Value Chains.\n      </div>\n                <div>\n                  <p>\n          Amazon has a long-standing commitment to gender equity. From the Amazon employees serving customers each day, to the individuals working for suppliers and other partners as part of the global retail supply chain, our commitment to gender equity is ingrained in our governance framework and decision making.\n        </p>\n                  <p>\n          As part of that commitment, Amazon has signed the <span><a href=\"https://www.weps.org/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">United Nation's Women's Empowerment Principles</a></span>(WEPs). Supported by more than 5,000 corporate signatories, the WEPs were established by the United Nations Global Compact and UN Women to offer businesses guidance on ways to promote gender equity and to empower women in the workplace and global community.\n        </p>\n                  <p>\n          \"Diversity, equity, and inclusion are good for business-and more fundamentally-simply right,\" said Andy Jassy, Amazon CEO. \"Our support of the United Nations Women's Empowerment Principles underscores our long-standing work to promote gender equality and empowerment in the workplace, marketplace, and communities, and we are encouraged to see other like-minded businesses coming together to drive positive change.\"\n        </p>\n                  <p>\n          Separately, Amazon is making a $1 million contribution to the <span><a href=\"https://www.resiliencefundforwomen.org/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Resilience Fund for Women in Global Value Chains.</a></span>The Resilience Fund pools corporate investments to drive local, women-led solutions to the toughest problems facing women in global value chains. Established by Business for Social Responsibility (BSR), the UN Foundation, and Women Win, the Resilience Fund aims to raise at least $10 million to make strategic, long-term investments in the economic resilience, health, and well-being of women who are foundational to global value chains. Amazon's donation will be invested in local organizations in Asia and other regions serving women in manufacturing, apparel, and agricultural supply chain communities.\n        </p>\n                  <p>\n          \"It's more important than ever that leading retailers help ensure a safe, supportive work environment for women throughout the global retail value chain, and our contribution to the Resilience Fund for Women underscores our commitment to these working women everywhere,\" said Kara Hurst, vice president and head of Worldwide Sustainability at Amazon. \"We're pleased to join other businesses focused on supporting the long-term health and economic resilience of women and making sure they have a work environment where they can thrive.\"\n        </p>\n                  <h4>\n          Social responsibility and gender equality at Amazon\n        </h4>\n                  <p>\n          Caitlin Harren is Amazon's director of social responsibility and sustainable solutions. She leads a team of supply chain and social responsibility experts that helps to ensure Amazon's suppliers and partners provide a safe, positive working environment for women across our global value chain.\n        </p>\n                  <p>\n          Below, Harren answers two questions and shares more about Amazon's commitments and work in this space.\n        </p>\n                  <h4>\n          How would you describe the role of the social responsibility team and its work on gender equity?\n        </h4>\n                  <p>\n          Our team helps ensure that Amazon conducts business responsibly. Our customers expect our products and services to be produced in a way that respects human rights. Delivering on this customer expectation is essential to our long-term success as a business. My team does this by establishing industry-leading responsible business standards, embedding respect for human rights across the business, and developing innovative tools to deliver protections for workers in our supply chain, including women.\n        </p>\n                  <p>\n          Bolstering gender equity is one of our company's existing <span><a href=\"https://sustainability.aboutamazon.com/people/supply-chain/commitments\" data-type=\"url\" class=\"tr-link\" translate=\"no\">five public Key Commitments</a></span>for responsible sourcing; the other four are Safe Workplaces, Freely Chosen Employment, Fair Wages, and Environmental Protection. Gender equity is also an important part of our work to strengthen the resiliency and sustainability of our broader global value chain.\n        </p>\n                  <h4>\n          What progress has Amazon made in this space?\n        </h4>\n                  <p>\n          In 2019, we codified our Human Rights Principles, which reflect how we embed respect for human rights throughout our business. It's an approach that we're constantly evolving. We regularly update our <span><a href=\"https://sustainability.aboutamazon.com/people/supply-chain?workerCount=true&amp;engagementProgram=true&amp;productCategory=true\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Supply Chain Standards</a></span>, which are a condition of doing business with us, and set a high bar for both Amazon and our suppliers to uphold principles of inclusivity and supply chain accountability.\n        </p>\n                  <p>\n          Finally, we're partnering with groups including <span><a href=\"https://herproject.org/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">BSR's HERproject</a></span>, which brings together global brands, suppliers, and partners to implement workplace-based interventions on health, financial inclusion, and gender equality. The project has reached more than 12,000 women in China, Bangladesh, Vietnam, and India. We have recently partnered with the <span><a href=\"https://www.icrw.org/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">International Center for Research on Women</a></span>'s advisory practice and <span><a href=\"http://www.themarapartners.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Mara Partners</a></span>to help Amazon develop a multiyear gender equity strategy for our global value chain that seeks to provide systemic, scalable solutions for women workers in factories and farms as well as women entrepreneurs.\n        </p>\n                  <p>\n          Learn more about our commitment to <span><a href=\"https://sustainability.aboutamazon.com/people/supply-chain?workerCount=true&amp;engagementProgram=true&amp;productCategory=true\" data-type=\"url\" class=\"tr-link\" translate=\"no\">social responsibility</a></span>and the communities where we operate in our latest <span><a href=\"https://sustainability.aboutamazon.com/about/report-builder\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Sustainability Report</a></span>.\n        </p>\n                </div>\n                <div>\n                  <div>\n          Related Tags\n        </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/public-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Public policy</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/sustainability\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Sustainability</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/diversity\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Diversity, equity, and inclusion</a>\n                    </span>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/policy-news-views/amazon-further-strengthens-commitment-to-gender-equity\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>14 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>14 December 2021 13:11:06 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}