{"date": "2021-11-23 22:00:24.991000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> founder and executive chairman <a href=\"https://www.independent.co.uk/topic/jeff-bezos\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Jeff Bezos</a> announced his latest philanthropic gestures on Monday: a pair of donations to the <a href=\"https://www.independent.co.uk/topic/obama-foundation\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Obama Foundation</a> and New York University's medical centre.</p><p>Mr Bezos's gift to the Obama Foundation was first reported on Monday morning by <span>The New York Times</span> – $100m in total.</p></div><div class=\"tr-npp-body\"><p>A spokesperson for the former president's foundation told <span>The Independent</span> in an emailed statement that the funds will be used to scale existing leadership programmes launched by the charity to benefit young people across several continents.</p><p>\"The generous gift from Jeff Bezos will help the Foundation scale our existing domestic and global leadership training programs. We currently have leadership programs in <a href=\"https://www.independent.co.uk/topic/africa\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Africa</a> , Europe, and <a href=\"https://www.independent.co.uk/topic/asia\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Asia</a> -Pacific through our Obama Leaders. This is a non-residential leadership development and community engagement program that seeks to inspire, empower, and connect emerging leaders in their region,\" said the spokesperson.</p><p>The Obama Foundation official indicated that the former president's My Brothers' Keeper initiative, which seeks to improve opportunities for Black men and boys in the US, would also see funding from the donation.</p><p>\"Domestically our My Brothers' Keeper Initiative is working to address persistent opportunity gaps facing boys and young men of color. Our Girls Opportunity Alliance helps empower girls around the world through education to help them fulfill their full potential,\" they said.</p><p>The spokesperson added: \"Through the gift from Bezos the next generation of emerging leaders will be provided the necessary tools, resources, and training needed to be the change they want to see in the world, just as Congressman [John] Lewis did.\"</p><p>As part of Mr Bezos's donation, a plaza outside former President <a href=\"https://www.independent.co.uk/topic/barack-obama\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Barack Obama</a> 's presidential library on Chicago's South Side will be renamed in honour of John Lewis, the pioneering civil rights champion and Georgia congressman who died in 2020.</p><p>The Amazon founder's gift came alongside a simultaneous donation of $166m to NYU Langone, the hospital part of New York University's medical school, according to local media reports.</p><p>Mr Bezos's spending habits and the luxury enjoyed by the wealthiest American business leaders have come under increased criticism from progressives in recent years and many figures on the US left have taken shots at him and others for their recent pursuit of private space travel flights and other gimmicks while calls grow for the wealthy to pay more under the American tax system.</p><p>CBS late night host Stephen Colbert quipped earlier this year after Mr Bezos returned from his first sub-orbital flight and marked the occasion by thanking Amazon customers: \"It's funny because he doesn't pay taxes or his employees.\"</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/news/ceo-q-a-new-york-amazon-microsoft-b1959074.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Q&amp;A: Binance CEO on bubbles, meme coins and crypto's swings</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/glen-de-vries-death-shatner-b1956864.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Blue Origin rocket passenger dies in plane crash</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/glen-de-vries-plane-crash-space-b1956861.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Man who flew to space with Shatner dies in plane crash -latest</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Independent, The (UK) (Online). All rights reserved.</p></div>"}