{"date": "2022-02-14 18:11:13.594000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>WAY OF WILL INC (\"WAY-Z\")\n- Introduction of 50+ Product SKUs on Walmart Marketplace\n- Through Third-Party Agency, SellCord\n\n     Way of Will Inc. (\"Way of Will\" or the \"Company\"), an alternative\nwellness company specializing in plant-based goods, announces they will be\nworking with third-party agency, SellCord, to introduce over 50 product\nSKUs across multiple categories on Walmart Marketplace.\n\n     Walmart Marketplace is an ecommerce platform that enables third-party\nmerchants to sell their products on Walmart.com, which is separate from\nWalmart's own inventory of goods. The Walmart Marketplace online platform\nis growing at a rapid pace, with 2021 fiscal ecommerce sales growing by\n79%, ranked second only to the leading online retailer, Amazon, in terms of\necommerce market share.1 In addition to selling on the retail giant's\nWalmart Marketplace platform, Way of Will is pleased to announce it has\nbeen approved for Walmart Fulfillment Services (WFS), which is granted to\nonly a small selection of sellers on their marketplace platform. The\nprogram is similar to and in direct competition with Amazon's Fulfilled by\nAmazon (FBA) services.\n\n     SellCord is an approved agency partner of Walmart.com. SellCord has a\nsuccessful track record of assisting brands in becoming best sellers in a\nwide range of categories and with high year-over-year growth. \"Walmart.com\nis a fast-growing marketplace and it's the only real competitor to Amazon,\"\ncommented Michael Lebhar, CEO of SellCord. \"As an online retailer, they\nhave already surpassed other industry giants such as Target, eBay, and\nCostco. We believe that there's great room for growth, and that brands who\nestablish themselves early on will have a significant competitive advantage\nas the Walmart Marketplace platform continues to expand. We have a deep\nunderstanding of Walmart's best practices, and how to leverage them for\noptimal growth.\"\n\n     \"We're thrilled to be working with SellCord to launch over 50 product\nSKUs on Walmart.com,\" said Willie Tsang, CEO and founder of Way of Will.\n\"SellCord not only possesses expert and exclusive knowledge about the\nplatform, but their partnership with Walmart.com gives them special access\nto new Walmart programs and offers that we otherwise wouldn't have. We can\nleverage this advantage for much faster growth. We're excited to see how\nthese exclusive partnership advantages that Mr. Lebhar and his team will\nbring can propel our brand to the forefront and enable us to become a\nleading seller on Walmart Marketplace.\"\n\n     SellCord is projecting a higher sales growth percentage for the\nCompany month-over-month in the initial few quarters, followed by a\nconsistent 15-20% sales growth month-over-month as Way of Will continues to\ngrow along with the platform and introduce additional new products and\nbundles.\n\n     Sources:\n\n     1.\n<a href=\"https://www.forbes.com/sites/forbesagencycouncil/2022/01/03/the-benefits-of\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.forbes.com/sites/forbesagencycouncil/2022/01/03/the-benefits-of</a>\n-selling-on-walmart-marketplace-and-how-to-get-started/\n\n     About Way of Will Inc.\n\n     Way of Will is a Canadian CPG manufacturer and retailer offering a\nfull range of natural, plant-based wellness products. Way of Will currently\noffers a total of 191 SKUs of natural skin care and wellness products\nthrough its main brand and sub-brands, Nude &amp; Crude and GUNKNOWN(363)\nSociety. To learn more, please visit: www.wayofwill.com\n\n     ON BEHALF OF THE BOARD OF DIRECTORS\n\n     Way of Will Inc.\n\n     Willie Tsang\n\n     CEO and Director\n\n     For further information please contact:\n\n     Willie Tsang at business@wayofwill.com\n\n     The CSE does not accept responsibility for the adequacy or accuracy of\nthis release.\n\n     Cautionary Statement Regarding Forward-Looking Information\n\n     This news release contains certain statements that may constitute\nforward-looking information under applicable securities laws. All\nstatements, other than those of historical fact, which address activities,\nevents, outcomes, results, developments, performance or achievements that\nthe Company anticipates or expects may or will occur in the future (in\nwhole or in part) should be considered forward-looking information. Such\ninformation may involve, but is not limited to, statements with respect to:\nthe Company's business and business plans; the Company's strategy and\ncurrent focus on developing brands and new products, including in respect\nof anticipated growth. Often, but not always, forward-looking information\ncan be identified by the use of words such as \"plans\", \"expects\", \"is\nexpected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\",\n\"anticipates\", or \"believes\" or variations (including negative variations)\nof such words and phrases, or statements formed in the future tense or\nindicating that certain actions, events or results \"may\", \"could\", \"would\",\n\"might\" or \"will\" (or other variations of the forgoing) be taken, occur, be\nachieved, or come to pass. Forward-looking information is based on\ncurrently available competitive, financial and economic data and operating\nplans, strategies or beliefs as of the date of this news release, but\ninvolve known and unknown risks, uncertainties, assumptions and other\nfactors that may cause the actual results, performance or achievements of\nthe Company to be materially different from any future results, performance\nor achievements expressed or implied by the forward-looking information.\nSuch factors may be based on information currently available to the\nCompany, including information obtained from third-party industry analysts\nand other third-party sources, and are based on management's current\nexpectations or beliefs regarding future growth, results of operations,\nfuture capital (including the amount, nature and sources of funding\nthereof) and expenditures. Any and all forward-looking information\ncontained in this press release is expressly qualified by this cautionary\nstatement and the Company expressly disclaims any intention or obligation\nto update or revise any forward-looking statements whether as a result of\nnew information, future events or otherwise, except as required by\napplicable law.\n\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204400707.MNPRE2204402204-09584220220214</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}