{"date": "2021-11-18 15:56:09.017000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Independent Pilot Research Survey Demonstrates Else Products Dramatically Improved Major Feeding Related Disorders &amp; Symptoms in Large Majority of Children</p>\n</div>\n<div class=\"tr-npp-body\">\n<pre>ELSE NUTRITION HOLDINGS INC (\"BABY,BABY.WT.A-V\")\n- Independent Pilot Research Survey Demonstrates Else Products\n- Dramatically Improved Major Feeding Related Disorders &amp; Symptoms in\n- Large Majority of Children\n\n     ELSE NUTRITION HOLDINGS INC. (\"Else\" or the \"Company\") the Plant-Based\nbaby, toddler and children nutrition company, is pleased to announce highly\nfavorable results from an independent pilot study conducted with U.S. mom\ncustomers of its Plant-Based Nutrition for Toddlers and Kids.\n\n     *  Conducted independently by third party global market research firm,\nGetWizer, the study revealed over three quarters of Parents whose children\nsuffered from gastrointestinal problems (vomiting, reflux, spit ups) whilst\nusing another formula or supplement, reported these symptoms improved after\nusing Else Toddler or Else Kids\n     *  The pilot study reveals major improvement in disorders and symptoms\nrelated to feeding problems such as:      *  Weight gain - poor weight gain\nand growth problem was resolved in over 82% of the cases\n     *  GI related symptoms (spit up, vomit, etc) - were improved in over\n85% and about half of them reported significant to 100% complete\nimprovement\n     *  Bowel movements were improved in over 79% of the cases and almost\n100% reported change in stool consistency from too hard or too loose to a\nmore \"normal\" stool\n     *  Rash symptoms were improved in over 86% (improvement was reported\nin severity, frequency and length of symptoms)\n\n     \"These results are extremely encouraging and provide independent\nvalidation as to the potentially significant difference clean label, whole\nplant food-based Else products are making with children across the\ncountry,\" stated Hamutal Yitzhak, CEO and Co-Founder of Else Nutrition.\n\"Improving lives and providing a real alternative to dairy for early\nchildhood nutrition was the spark for starting Else and it is reassuring to\nsee validation from moms that Else products are truly helping to make their\nfamilies' lives better,\" she added.\n\n     The pilot study indicated top reported reasons for starting the child\non Else Drink were: 1. Plant-Based diet or healthy lifestyle; 2. Else\nproducts natural ingredients; 3. To help address a clinical condition (i.e.\nfood sensitivities, allergies, etc.)\n\n     Additionally, 75% chose Else based on plant-based/healthy lifestyle\nand preferred ingredients and 25% to address medical reasons such as poor\ngrowth, intolerances and allergies. Over 70% of the kids loved the taste\nand are happy and enjoy drinking it and 97% of parents intend to continue\ngiving their child Else nutritional products. Of those surveyed, 90% of\nparents said they would recommend using Else products to their friends.\n\n     The GetWizer pilot study was independently conducted via electronic,\nonline survey among randomly selected customers using Else Plant-Based\nNutrition for Toddlers and Kids. The survey will now be expanded to more\nmothers to ensure a larger sample size.\n\n     About GetWizer\n\n     GetWizer provides the technology framework for consumer-centric\norganizations. The company integrates consumer intelligence into both\ntactical and strategic product and marketing decision-making at scale.\nGetWizer's unique technology is easily tailored. The company provides a\ncomplete solution for preparing, analyzing and visualizing consumer data.\n\n     About Else Nutrition Holdings Inc.\n\n     Else Nutrition GH Ltd. is an Israel-based food and nutrition company\nfocused on developing innovative, clean and plant-based food and nutrition\nproducts for infants, toddlers, children, and adults. Its revolutionary,\nplant-based, non-soy, formula is a clean-ingredient alternative to\ndairy-based formula. Else Nutrition (formerly INDI) won the \"2017 Best\nHealth and Diet Solutions\" award at the Global Food Innovation Summit in\nMilan. Else Plant-Based Complete Nutrition for Toddlers was recently ranked\nas the #1 Top seller in the baby and toddler formula category on Amazon.\nThe holding company, Else Nutrition Holdings Inc., is a publicly traded\ncompany, listed as TSX Venture Exchange under the trading symbol BABY and\nis quoted on the US OTC Markets QX board under the trading symbol BABYF and\non the Frankfurt Exchange under the symbol 0YL. Else's Executives include\nleaders hailing from leading infant nutrition companies. Many of Else\nadvisory board members had past executive roles in companies such as Mead\nJohnson, Abbott Nutrition, Plum Organics and leading infant nutrition\nSocieties, and some of them currently serve in different roles in leading\nmedical centers and academic institutes such as Boston Children's Hospital,\nPediatrics at Harvard Medical School, USA, Tel Aviv University, Schneider\nChildren's Medical Center of Israel, Rambam Medical Center and Technion,\nIsrael and University Hospital Brussels, Belgium.\n\n     For more information, visit: elsenutrition.com or @elsenutrition on\nFacebook and Instagram.\n\n Contact Information:\n\nContact:Erin Jundef\nBrilliant PR\nErinj@brilliantprm.com\n\n     Contact:\nMrs. Hamutal Yitzhak, CEO, Co-Founder &amp; Director\nELSE Nutrition Holdings Inc.\nE: hamutaly@elsenutrition.com\nP: +972(0)3-6445095\n\n     Mr. Sokhie Puar, Lead Director of Else Nutrition\nEmail: sokhiep@elsenutrition.com\nP : 604-603-7787\n\n     US Investor Relations Contact:\n\n     Lytham Partners, LLC\nMr. Ben Shamsian\nNew York | Phoenix\nE: shamsian@lythampartners.com\nP: 646-829-9701\n\n     TSX Venture Exchange\n\n     Neither the TSX Venture Exchange nor its regulation services provider\n(as that term is defined in the policies of the TSX Venture Exchange)\naccepts responsibility for the adequacy or accuracy of this release.\n\n     Caution Regarding Forward-Looking Statements\n\n     This press release contains statements that may constitute\n\"forward-looking statements\" within the meaning of applicable securities\nlegislation. Forward-looking statements are typically identified by words\nsuch as \"will\" or similar expressions. Forward-looking statements in this\npress release include statements with respect to the anticipated dates for\nfiling the Company's financial disclosure documents. Such forward-looking\nstatements reflect current estimates, beliefs and assumptions, which are\nbased on management's perception of current conditions and expected future\ndevelopments, as well as other factors management believes are appropriate\nin the circumstances. No assurance can be given that the foregoing will\nprove to be correct. Forward-looking statements made in this press release\nassume, among others, the expectation that there will be no interruptions\nor supply chain failures as a result of COVID 19 and that the\nmanufacturing, broker and supply logistic agreement with the Company do not\nterminate. Actual results may differ from the estimates, beliefs and\nassumptions expressed or implied in the forward-looking statements. Readers\nare cautioned not to place undue reliance on any forward-looking\nstatements, which reflect management's expectations only as of the date of\nthis press release. The Company disclaims any obligation to update or\nrevise any forward-looking statements, whether as a result of new\ninformation, future events or otherwise, except as required by law.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132100474.MNPRE2132102368-07543720211118</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}