{"date": "2021-11-10 14:04:00.249000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwuline{text-decoration:underline;text-decoration-color:inherit;}</style><p class=\"bwalignc\">\n<b>Dr. Kellyann Petrucci Launches Exclusive Ready-to-Drink Bone Broth at Whole Foods Market Stores Nationwide</b>\n</p><p class=\"bwalignc\">\n<span>Creator of the bone broth revolution, Dr. Kellyann Petrucci, M.S., N.D., board-certified naturopathic physician, and celebrity nutritionist launches her bone broth at Whole Foods Market</span>\n</p><p>\nDr. Kellyann Petrucci, M.S., N.D., board-certified naturopathic physician, celebrity nutritionist, and <span>New York Times</span> bestselling author, launches into the retail channel with her first ready-to-drink bone broth sold exclusively at Whole Foods Market nationwide. Available in savory Classic Chicken Bone Broth and Low-Sodium Classic Chicken Bone Broth, these functional foods are packaged in 16.9 fl oz cartons and made to warm and enjoy.\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: <a href=\"https://www.businesswire.com/news/home/20211110005447/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211110005447/en/</a></p><div id=\"bwbodyimg\" style=\"width:360px;float:left;padding-left:0px;padding-right:20px;padding-top:0px;padding-bottom:0px\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Celebrity nutritionist and NYT best-selling author Dr. Kellyann Petrucci, M.S., N.D. (Photo: Business Wire)\" src=\"https://mms.businesswire.com/media/20211110005447/en/925597/4/Dr-Kellyann-Headshot.jpg\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbXMuYnVzaW5lc3N3aXJlLmNvbS9tZWRpYS8yMDIxMTExMDAwNTQ0Ny9lbi85MjU1OTcvNC9Eci1LZWxseWFubi1IZWFkc2hvdC5qcGc=&amp;key=4b4d4d6b25f10480b2c69757d1c2bf89f255a4ee5be85959363127fd83e5a96e2c8533f43973b2536761555a624a286e3bf43fd4eac0659fa4a761ffff732fc7\"/></div></div><p style=\"font-size:85%\">Celebrity nutritionist and NYT best-selling author Dr. Kellyann Petrucci, M.S., N.D. (Photo: Business Wire)</p></div><p>\nCrafted with the highest quality ingredients and mirroring her at-home recipes, Dr. Kellyann’s Bone Broths feature slow-simmered chicken bones, veggies, and natural herbs. Thanks to their low-calorie, low-fat, and zero sugar ingredient profiles, these nutritional bone broths are ideal for Keto and Paleo diets, intermittent fasting, and for anyone wanting to maintain a healthy lifestyle. Powered by 15 grams of protein and 5.5 grams of collagen per serving, the Dr. Kellyann broths can be a meal replacement, snack, or stock alternative for the entire family to enjoy.\n</p><p>\n“I learned the powerful effects of incorporating collagen and bone broth into a daily routine years ago while studying biological medicine at the Marion Institute and Paracelsus Klinik, which is why I advise my patients to enjoy bone broth. I can’t stress how important bone broth is to support whole-body health,\" shared Dr. Kellyann Petrucci. “I am so proud that our first launch into the retail space is with Whole Foods Market. Our relationship supports me empowering women and men from all walks of life to take control of their lives with easy access to products that can truly transform their bodies and minds, helping them feel younger, healthier, and happier.”\n</p><p>\n“We are thrilled to see Dr. Kellyann’s brand with its first entry into the retail space, and what better retailer to launch at than Whole Foods Market. It’s so important now more than ever to take control of your whole-body health, and we’ve made that easy for today’s busy consumer,” said Megan Brown, CMO of Veyl Ventures. “From the beginning, we have stood behind Dr. Kellyann’s mission and belief in the gut-supporting benefits of bone broth. We are honored to have such a valuable relationship with the team at Whole Foods Market to help us provide a unique product for their consumers.”\n</p><p>\nTo find your local Whole Foods Market, search for the store locator on <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fdrkellyann.com%2F&amp;esheet=52527348&amp;newsitemid=20211110005447&amp;lan=en-US&amp;anchor=drkellyann.com&amp;index=1&amp;md5=d5dad7897234ab814776e2475024ca7b\" data-type=\"url\" class=\"tr-link\" translate=\"no\">drkellyann.com</a>, where you can also discover the extended Dr. Kellyann product line available for purchase. For more information, or to join the gut-health conversation, follow <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.instagram.com%2Fdrkellyannpetrucci%2F&amp;esheet=52527348&amp;newsitemid=20211110005447&amp;lan=en-US&amp;anchor=%40drkellyannpetrucci&amp;index=2&amp;md5=364e3f30cb6fb8a11486a47ab4a37fb6\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@drkellyannpetrucci</a> across social.\n</p><p>\n<b><span class=\"bwuline\">ABOUT DR. KELLYANN</span></b>\n</p><p>\nDr. Kellyann Petrucci, M.S., N.D., is a board-certified naturopathic physician, weight-loss and anti-aging expert, and concierge doctor for celebrities in New York City and Los Angeles. She discovered the gut-healing power of collagen and bone broth and their ability to slow the aging process while studying biological medicine at the Marion Institute and Paracelsus Klinik in Switzerland. As an accredited global leader and educator in the health and wellness community, Dr. Kellyann educates and empowers patients and consumers everywhere to take control of their whole-body health. By changing the traditional relationship with food, her practice positions food as medicine, offering a variety of functional food solutions as lifestyle choices and effective alternatives to unsustainable fad diets and trends. She serves as a notable expert contributor on <span>Good Morning America</span> and <span>Dr. Oz</span>, while also hosting numerous TV specials including the PBS broadcasts <span>21 Days to a Slimmer, Younger You,</span> and <span>The 10-Day Belly Slimdown</span>. She is a <span>New York Times</span> bestselling author, releasing <span>Dr. Kellyann’s Bone Broth Diet</span>, <span>Dr. Kellyann’s Bone Broth Cookbook</span>, and <span>The 10-Day Belly Slimdown</span>, along with a new book scheduled to launch later this year.\n</p><p>\n<b><span class=\"bwuline\">ABOUT VEYL VENTURES</span></b>\n</p><p>\nVeyl Ventures partners with leading experts across the health, beauty, and wellness industries to develop some of today’s most innovative lifestyle-focused and sustainably minded brands. The Veyl portfolio and culture prioritizes people, planet, and pets - making up a community of 100+ passionate and committed CPG leaders across the globe. By reinventing the traditional business model, Veyl efficiently scales brands with proven accelerated success. For more information, please visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fveyl.com&amp;esheet=52527348&amp;newsitemid=20211110005447&amp;lan=en-US&amp;anchor=veyl.com&amp;index=3&amp;md5=33a3a83c6ef13a8c0440111f0e1d30ed\" data-type=\"url\" class=\"tr-link\" translate=\"no\">veyl.com</a>.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211110005447r1&amp;sid=ny6r1&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTEwMDA1NDQ3cjEmc2lkPW55NnIxJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=77fc7077587e9a49e00cd37716bbc4bbb7a79887ed5aac83a666f9d55ce989486dbde29fd34fb29617f528ce2fbc3266317c83a79f864377265d1e72f6f8d668\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211110005447/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211110005447/en/</a></span></p><p>\n<b>Chapman Communications Group \n</b><br/>Samantha Chapman, <a href=\"mailto:Samantha@chapmancommunicationsgroup.com\" data-type=\"email\" translate=\"no\">Samantha@chapmancommunicationsgroup.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NY-VEYL-VENTURES</p></div>"}