{"date": "2021-11-24 14:02:11.230000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SOLAR INTEGRATED ROOFING CORP. (\"SIRC-0\")\n- Partners with Solar Integrated Roofing Corp. for Clean Energy\n- Blockchain Development Project\n\n   Rx SeedCoin, Inc. (RxSeedCoin.io:WSOW) an advanced Blockchain technology\norganization that strives to uplift humanity, and provide solutions for\npressing problems facing the world today announced that Solar Integrated\nRoofing Corp., an integrated, single-source solar power and roofing systems\ninstallation company, has become a stake holder in Rx SeedCoin and entered\ninto an agreement in order to integrate existing and develop new Blockchain\ntechnology that is already being used to innovate virtually every aspect of\nthe renewable energy businesses and systems around the world.\n\n   Rx SeedCoin is an advanced Blockchain technology organization that\nstrives to provide solutions to meet the growing problems of hunger,\nhomelessness, health, provision of clean energy solutions as well as\ndisaster relief and temporary emergency housing. Rx SeedCoin has created a\nCrypto Currency Coin called SOW-Coin (aka \"the Coin of Compassion\") to\ncapitalize their projects by creating a community of people who help each\nother by buying, holding and transacting in the SOW-Coin which will soon be\nable to be converted to ordinary fiat currencies. The concept of the coin\nis that when SOW-Coin holders buy and transact in SOW-Coin they help\nfinance Rx SeedCoin's relief projects and SOW-Coin holders have a benefit\nfor helping others because they can sell their coins back into the\ncommunity in order to cover the costs of any emergencies that may arise in\ntheir own lives. In this way people \"reap what they sow.\" SOW-Coin has been\nmet with such warm reception that the Coin has been accepted to be traded\non Bitmart which is a major Crypto Currency Exchange. The coin is the first\never Stellar Coin wrapped into the Binance Smart Chain (BSC) by Rx SeedCoin\nengineers yielding WSOW. SOW-Coin is tentatively scheduled for listing on\nthe Bitmart Exchange on December 15, 2021. For more information visit the\ncompanies website at RxSeedCoin.io.\n\n   Jeff Richfield and David Miller from Rx SeedCoin approached Solar\nIntegrated in late September of 2021 in order to conduct a feasibility\nstudy to install and manage the provision of Solar power in a promising Rx\nSeedCoin project in the Caribbean. One of the unique requirements of this\nand many other Solar projects around the world is the need for the power to\nbe provided, measured and paid for using Blockchain technology which\nprovides for superior automation, lower cost, corporate governance,\ntransparency, measurement, payment processing and extraordinary benefits\nand liquidity for stake holders that has never been available prior to the\nexistence of Blockchain technology.\n\n   \"In Rx SeedCoin projects involving renewable energy supply we are\ndirectly experiencing the welcoming of our own SOW-Coin and other Crypto\ncurrencies, as the most convenient way to pay for goods and services and\nallow for the automation through Blockchain technology that tracks the flow\nof energy and payments received in an automated way that saves money and is\ntransparent and minimizes the potential for waste and fraud,\" says Jeff\nRichfield of Rx SeedCoin. \"We are a Blockchain technology based project and\nour developers are highly skilled, as evidenced by our recent creation of a\nfirst ever bridge that wraps Stellar Coin into the Binance Smart Chain\n(BSC) and we have strong renewable energy hardware and software\npartnerships to help complete our current projects. One partner is\nCandelacoin.com with their IoT device interface that uploads telemetry from\npower supply systems to the Blockchain for purposes of automatic\nmeasurement, billing of clients, facilitation of payments, paying\noperators, stake holders, taxes and regulators.\"\n\n   \"We are happy to engage our rare engineering capabilities in cooperation\nwith Solar Integrated whose products and services we also need. We believe\nthat we can add extraordinary value to Solar Integrated Roofing and we\nreally appreciate their capacity to deliver on the Solar projects that we\nalready have underway,\" adds David Miller the founder Rx SeedCoin.\n\n   \"According to industry analysts, Blockchain investment in the energy\nsector is expected to reach more than $5.8 billion by 2025 for Microgrids\nalone and other related technology that is becoming dependent on Blockchain\nto lower costs including, management of Smart Meters and Renewable Energy\nCertificates (RECs),\" says Pablo Diaz President of Solar Integrated\nTechnology. \"According to organizations such as Global Market Insights Inc,\nBlockchain technology in the energy market is predicted to hike to $18\nBillion by 2025. Today we are witnessing market capitalization of Trillions\nof dollars in the Crypto Currency markets because using these types of\ncurrencies have utility in payment systems and transparency and fraud\nprevention for delivery of power. For all these reasons we are compelled to\nengage with Blockchain technology.\"\n\n   \"With hardware like Candelacoin's IoT device becoming popular, and\norganizations like Rx SeedCoin bringing projects to us we are seeing the\nuse of Blockchain technology rising within the energy sector just like it\nhas everywhere from Amazon, Apple and Facebook to Walmart and Starbucks\nCoffee. Our experience with Rx SeedCoin has only confirmed that we have to\nengage with this technology in order to stay on the leading edge of the\nprovision of energy and also to gain access capital and finance that is\nbecoming available through the popularity Decentralized Financing (DeFi)\nand convenience of instruments like Non-Fungible Tokens (NFTs) that are\nbased on Blockchain technology,\" says David Massey, CEO of SIRC. \"In Rx\nSeedCoin we believe that we have found the financial and engineering\nexpertise to help us engage in this important technology and we couldn't be\nmore happy to become a stake holder of SOW-Coin and help support the great\nwork that Rx SeedCoin is doing to help people in the US and around the\nworld.\"\n\nMedia Contact\n307-222-9867\n\nTel   : 858-437-5330    SOLAR INTEGRATED ROOFING CORP\nWWW   : <a href=\"http://www.solarintegratedroofingcorp.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.solarintegratedroofingcorp.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132700318.MNPRE2132701049-05594520211124</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}