{"date": "2021-11-06 17:57:32.532000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3518.99, "close": 3576.23}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon Pay, the digital payments arm of the e-commerce giant and MakeMyTrip India, a fully owned subsidiary of MakeMyTrip Limited (MMYT), India\u0092s leading travel group, have announced a strategic long-term partnership to offer travel services on Amazon.in which includes its suite of mobile apps and websites. The partnership will help Amazon Pay create a convenient experience and provide greater value for its customers with access to MakeMyTrip\u0092s best in class travel offerings.</p><p>\u0093Our partnership with MakeMyTrip, will benefit millions of our customers,\u0094 said Mahendra Nerurkar, CEO and Vice-President, Amazon Pay India. \u0093It would allow them to choose from the best-in-class offerings and services across the country, followed by the ease of using Amazon Pay, facilitating a seamless journey.\u0094</p></div><div class=\"tr-npp-body\"><p>With this partnership, MakeMyTrip will be able to extend its distribution further via Amazon Pay\u0092s large customer base, especially in smaller cities and towns and accelerate online booking of travel services across the country.</p><p>\u0093We are excited to partner with Amazon, the company that has revolutionized online purchase behaviour of people world over,\u0094 said Rajesh Magow, co-founder and Group CEO of MakeMyTrip. \u0093There is an accelerated digital shift happening as a result of the pandemic and through this partnership, we look forward to making travel bookings extremely convenient for new adopters, thereby increasing the online penetration of travel bookings.</p><p>Amazon Pay aims at smoothening the booking and travelling experience for customers, extending the convenience of making online transactions from anywhere to anyone instantly. With Amazon Pay ICICI Co-branded credit card customers will earn unlimited cashback rewards on every flight, hotel or bus bookings and with Amazon Pay Later customers can book tickets and pay next month with no interest. Customers can also use different payment modes on Amazon Pay, including Amazon Pay Balance and Amazon Pay UPI to make their payments frictionless. Booking of bus services via Redbus is already live on Amazon.in and other travel services powered by MakeMyTrip will be going live over the next few months.</p><p>In 2019, Amazon.in, announced the launch of domestic flight bookings. Customers could find the flights icon on the Amazon Pay page in the Amazon mobile app and on the website. The firm had said that in a few simple steps, customers can complete their flight bookings and avail rewards. The firm had said that delighted by the shopping experience, there has been a growing demand from customers for more services offered by Amazon. This launch enables customers to book their domestic flight tickets in addition to shopping, money transfers, utility bill payments, mobile recharges \u0096 all in one single app.</p><p>Amazon Pay\u0092s partnership with MakeMyTrip comes at a time when Adani Group recently invested in Cleartrip, deepens strategic ties with Flipkart. The Adani Group, India\u0092s fastest-growing diversified conglomerate, recently said that it is investing in Cleartrip Private Limited, an online travel aggregator (OTA) and part of the e-commerce firm Flipkart Group. As part of this investment, the Adani Group will acquire a significant minority stake in Cleartrip. Through this investment, the Adani Group and the Flipkart Group will benefit from synergies that will deliver superior travel experiences to consumers as the travel industry in India sees a resurgence.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}