{"date": "2021-11-22 05:57:06+00:00", "ticker": "AVV", "mrkt_info": {"open": 3388.0, "close": 3229.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>Dubai, UAE– AVEVA, a global leader in industrial software, driving digital transformation and sustainability, joined companies across the technology and energy spectrum to underscore the multifaceted role of digitalization in helping to achieve net-zero carbon emissions across the ecosystem. Delegates at the recent landmark conference, AVEVA PI World, heard how data-led innovation can help unlock sustainability benefits at every level. The unanimous message was delivered by sustainability and environment leaders from Schneider Electric, Ørsted, Neste, Microsoft and AVEVA on a Sustainability Panel.</p>\n<p>Nine in 10 companies expect to accelerate their sustainability activities over the coming year as businesses recognize their role in tackling climate change, an AVEVA-commissioned survey of over 850 c-suite and digital transformation experts shows. Four in five leading industries want to increase their digital investments to drive sustainable business models, demonstrating the enormous potential of advanced technologies such as smart data, artificial intelligence (AI) and cloud computing in enabling net zero and lower carbon industrial operations, explained Lisa Johnston, Chief Marketing Officer and Chief Sustainability Officer at AVEVA.</p>\n<p>“Companies around the world have committed to reducing their environmental footprint. AVEVA believes the business community must now go further, by way of positive contributions to sustainability through our activities and partnerships – or in other words, our sustainability handprint. Given the nature of the capabilities AVEVA provides to our customers, our solutions make a constructive impact on environmental sustainability. Data infrastructure management solutions such as the AVEVA PI System, delivered in partnership with Microsoft’s Azure Cloud, can help thousands of very different businesses find innovative routes to achieving their sustainability goals and becoming climate positive,” Johnston added.</p>\n<p><strong>Digitalization strategies to achieve net-zero commitments</strong></p>\n<p>Data-led innovation plays a significant part in achieving net-zero goals, panelists said. Panel attendees learned actionable strategies towards building climate-positive organizations.</p>\n<ul class=\"bulleted-list arrowlist\">\n<li><strong>Incorporate sustainability into your KPIs:</strong> Olivier Blum, Chief Strategy &amp; Sustainability Officer at Schneider Electric, ranked the world’s most sustainable company, said companies should develop sustainability strategies in the same way they have strategies for other areas, such as finance or human resources. Potential CO2 emissions should be factored into the design of new assets, for example, to improve sustainability and accelerate the climate transition, he said. Mapping sustainability KPIs to the rest of the business can deliver the critical results required. “Sustainability is like any area of business,” Blum said. “You should have a sustainability strategy. It should be fully integrated with your business strategy.”</li>\n<li><strong>Use data to predict innovation:</strong> The application of predictive analytics to industrial data collected across the value chain can reveal new routes to innovation. Energy major Ørsted operates an extensive fleet of 1,000 offshore wind turbines. Continuous data monitoring means that fleet represents 1,000 different experiments providing feedback to produce future assets, said Jesper Skov Gretlund, Senior Manager, Numerical Competence Centre, Ørsted. Innovation is a continuous process of refinement, and advanced technologies such as AI and big data facilitate that process. Ørsted is on track to becoming carbon-neutral by 2025.</li>\n<li><strong>Extend your handprint with partnerships:</strong> Neste works with suppliers that share its sustainability commitments on its path to achieving carbon neutrality in production by 2035. The company uses data collected across its value chain to improve its operations and to help other companies reduce their emissions, said Salla Ahonen, Vice-President of Sustainability, Neste. “We are looking at how we can actually transform our whole value chain and how we can help others transform,” she said. Data can offer positive routes to improving a company’s handprint, she added. In the process, the whole ecosystem can realize its net-zero goals.</li>\n<li><strong>Measure everything for sustainability at scale:</strong> Thousands of companies are setting net-zero targets, but achieving them requires better measurement tools, said Lucas Joppa, Chief Environment Officer at Microsoft. The software leader has committed to becoming a carbon-negative company by 2030. “You can’t manage what you can’t measure,” he said. Since carbon is the building block of life, measuring it requires monitoring every aspect of the business. “Digital technology is that tool in the [corporate] toolbox that lets us go at the kind of scale that sustainability requires, and at the scope that sustainability requires,” Joppa said.</li>\n</ul>\n<p>The panel concluded that industries are no longer forced to compromise competitiveness in the short term to pursue a more sustainable future. The thought leadership forum for AVEVA’s partner executives was open to all registered delegates at AVEVA PI World.</p>\n<p>The event is part of a series of AVEVA initiatives to support an inclusive, net-zero economy in line with a 1.5°C pathway as the world works to hold off the worst impacts of the climate crisis.</p>\n<p>-Ends-</p>\n<p><strong>About AVEVA</strong></p>\n<p><span>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence. AVEVA’s comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries. Learn more at www.aveva.com</span></p>\n<p><span>Copyright © 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</span></p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}