{"date": "2022-01-25 19:11:32.660000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>AMERICAN GREEN INC (\"ERBB-0\")\n- CBD Water with Vessl (R) Cap Technology Launched on eBay,\n- Groupon and AmericanGreenCBD.com\n\n     American Green, Inc.  announced that it has launched Axis brand\nbottled Hemp water made with CBD isolate, on eBay, Groupon, and in its\nonline store at AmericanGreenCBD.com. The Hemp is infused into the water by\nVessl(r) Corporation's patented Nitrogen-Pressurized Cap With Sonic, Nano-\nEmulsification which provides the body faster and more absorption of the\ningredients, thus providing more relief. When the closure is twisted, the\ningredients are propelled from the chamber under pressure from nitrogen and\ninstantly mixed with the water inside the bottle.\n\n     American Green has been analyzing the Vessl(r) patented cap delivery\nsystem for more than a year and the company has also been working to\ndevelop flavors for its own CBD water. During the R&amp;D stages, we found that\nthe Axis brand incorporated the patented Vessl(r) technology in delivering\ntheir tasty line of Four drinkable CBD products.\n\n(iframe width=\"560\" height=\"315\"\nsrc=\"https://www.youtube.com/embed/NIfBavu4skE?rel=0\" frameborder=\"0\"\nallow=\"autoplay; encrypted-media\" allowfullscreen)(/iframe)\n\nCannot view this video?  Visit:\n<a href=\"https://www.youtube.com/watch?v=NIfBavu4skE\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.youtube.com/watch?v=NIfBavu4skE</a>\n\n     Kevin Davis, Vice President of Online Sales for American Green, said,\n\"We are excited to distribute all four of the Axis products because, from\nour research, we found out that it is very difficult to make a CBD infused\ndrink that tastes great and is delivered to the body scientifically to\nprovide maximum absorption. All four of Axis brands' CBD waters have\namazing taste and performance. CBD is naturally bitter so it takes the\nproper blend of a great delivery system, multiple high-end ingredients, and\npurified water to get it right and Axis has done it. Each 6 oz water bottle\ncontains 25 mg of CBD isolate derived from a USDA-certified organic\nindustrial hemp plant. Each bottle is infused with electrolytes and is\ngluten and dairy-free.\"\n\n     Ja-nice Johnson, Axis founder, said, \"I have been looking for a\ndistribution partner for a long time and I have finally found one that I\nlove. American Green has the experience and the track record of selling\nonline in their own CBD store as well as on Amazon, eBay, and Groupon. They\nhave been very easy to work with and I expect great success with our\nproduct distribution through American Green. I would also like to add that\na portion of all sales goes to the American Cancer Society.\"\n\n     Special introductory Axis Launch Offer 4 pack\n\n     Axis Hemp Drink is available in 4 flavors: Berry, Lemon, Mango, and\nStrawberry. We are currently offering a special introductory 4 pack through\nFebruary 28th.\n\n     Shareholders and interest holders may also stay current with American\nGreen Updates:\n\n     American Green's Main Website at www.americangreen.com\n\n     Sweet Virginia Grow Cannabis Operation <a href=\"https://americangreen.com/live\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://americangreen.com/live</a>/\n\n     Twitter: @American__Green (two underscores), or\n\n     Facebook: <a href=\"https://www.facebook.com/americangreenusa\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.facebook.com/americangreenusa</a>\n\n     Instagram: <a href=\"https://www.instagram.com/americangreenusa\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.instagram.com/americangreenusa</a>/\n\n     About American Green, Inc.\n\n     In 2009, American Green, Inc. became America's second publicly-traded\ncompany in the cannabis sector. American Green now, with its more than\n50,000 certified beneficial shareholders, is one of the largest (in\nshareholder count) in the cannabis sector. American Green's mission is to\nlead the cannabis and premium CBD industry.\n\n     Leveraging our team of professionals in cultivation management,\nmanufacturing, extraction, wholesale, retail, and community outreach, we\nstrive to develop sustainably initiatives in the cannabis-adjacent and CBD\nindustries, laser-focused on adding company and shareholder value.\n\n     For more information -\n\n     Contact:\n\n     American Green, Inc.\n     Investor Relations\n     2902 W. Virginia Ave\n     Phoenix, AZ 85009\n     480-443-1600 X555\n     investor@americangreen.com\n\n     NOTES ABOUT FORWARD-LOOKING STATEMENTS\n\n     Except for any historical information contained herein, the matters\ndiscussed in this press release contain forward-looking statements that\ninvolve risks and uncertainties, including those described in the Company's\nSecurities and Exchange Commission reports and filings. Certain statements\ncontained in this release that are not historical facts constitute\nforward-looking statements, within the meaning of the Private Securities\nLitigation Reform Act of 1995, and are intended to be covered by the safe\nharbors created by that Act. Reliance should not be placed on\nforward-looking statements because they involve unknown risks,\nuncertainties and other factors, which may cause actual results,\nperformance or achievements to differ materially from those expressed or\nimplied. Forward-looking statements may be identified by words such as\nestimates, anticipates, projects, plans, expects, intends, believes, be\nshould and similar expressions and by the context in which they are used.\nSuch statements are based upon current expectations of the Company and\nspeak only as of the date made. The Company undertakes no obligation to\nupdate any forward-looking statements to reflect events or circumstances\nafter the date on which they are made.\n\nTel   : 480-443-1600    AMERICAN GREEN INC\nWWW   : <a href=\"https://www.americangreen.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.americangreen.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2202400501.MNPRE2202402737-10461320220125</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}