{"date": "2021-12-26 23:51:52.185000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3393.39, "close": 3384.02}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Got an Amazon gift card for Christmas 2021? Here are the best things to buy on Amazon right now, from Apple AirTag to Ember mug to air fryers and throw blankets.</p><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p></div><div class=\"tr-npp-body\"><p>If Santa brought you a shiny new Amazon gift card this year, you may be struggling with what to buy. That's understandable: There are thousands if not millions of different items for sale on the site, making it a veritable cornucopia of possibilities. </p><p>Don't worry, though: We've handpicked a number of very solid options and put together a guide to the 20 best things you can buy with an Amazon gift card. Whether you're looking to spend $10 or $200, there's something for everyone, from the popular Apple AirTag to a light-up beanie.</p><p><span><span>Start off the New Year with deals and shopping advice delivered straight to your phone.</span> Sign up for text message alerts from the experts at Reviewed.</span> </p><p class=\"tr-npp-section-title\">1. Apple AirTag</p><p>Wallet-losers and key-misplacers, take note: You can grab a pack of four Apple AirTags right now on Amazon. The quarter-sized devices can fit anywhere from a wallet to a piece of luggage and will help you find almost anything after pairing it to your iPhone. If the AirTag is close, you can make it ring out loud. If it's farther away, you can use your phone to track the item. Throw one inside your phone case, under your bike seat or put one inside your kid's backpack. You'll never regret it. </p><p><span>Get the Apple AirTag (4-Pack) from Amazon for $116</span> </p><p class=\"tr-npp-section-title\">2. Ember Mug</p><p>It's easy to see how a temperature-controlled smart mug could be considered a frivolous purchase. After all, for years now we've dealt with our hot drinks getting colder over time, and it's been fine. But then you actually get a smart mug and you realize that having your drink be your preferred temperature at all times is pretty incredible. Take the plunge with the Ember smart mug, which uses an app to control your beverage's temperature. One sip and you'll be won over, just like the almost 5,000 Amazon buyers who have given the mug an average 4.5 stars.</p><p><span>Get the Ember Smart Mug from Amazon for $99.95</span> </p><p class=\"tr-npp-section-title\">3. Maxsoft Scalp Massager Shampoo Brush</p><p>If you love getting your hair washed at a salon (who doesn't, right?), consider picking up this massaging scalp brush, which has more than 82,000 glowing reviews on Amazon. At under $8, it's much less expensive than a trip to the spa and Amazon buyers say it's well worth the money, writing that it's great for itchy scalps, root stimulation and just general relaxing. It works on all hair types, including natural hair. </p><p><span>Get the Maxsoft Scalp Massager Shampoo Brush from Amazon for $7.58</span> </p><p class=\"tr-npp-section-title\">4. Cosori Max XL Air Fryer</p><p>Our pick for the best value air fryer on the market, the Cosori Max XL is a third of the price of other premium appliances of its kind. But it performs impressively well. \"Even a large load of two pounds of frozen crinkle fries came out well browned and crispy,\" our experts noted in testing. Over 70,000 Amazon ratings agree, with buyers giving the Cosori Max XL an average 4.7 stars and landing it atop Amazon's top selling air fryers list. If you're new to the air frying trend, the Max XL is a great place to start, and at just around $100, it's not that expensive a risk.</p><p><span>Get the Cosori Max XL Air Fryer from Amazon for $117.99</span> </p><p class=\"tr-npp-section-title\">5. Barefoot Dreams Throw Blanket</p><p>Wildly popular and much adored, the Barefoot Dreams throw blanket has been an internet sensation since Chrissy Teigen raved about it in late 2019. Our reviewer said the blanket's reputation is well-deserved, saying it ruined all other blankets for her. \"It's truly one of the softest throws I've ever owned (and I've owned a lot),\" she explained, noting it \"hits just the right balance of cozy and warm yet breathable and not too heavy.\" Amazon buyers agree, writing in their reviews that it's \"super soft,\" the \"best blanket ever\" and \"worth every penny.\" </p><p><span>Get the Barefoot Dreams Throw Blanket from Amazon for $180</span> </p><p class=\"tr-npp-section-title\">6. 3-in-1 Apple Charging Station</p><p>For anyone whose bedside table or desk is a mess of cords and devices, snag this well-reviewed 3-in-1 charging stand, which can charge your AirPods, Apple Watch and iPhone all at the same time. Made of aviation aluminum, it's sleek and sturdy, and fits a variety of different models of each of the products. An anti-scratch silicone pad keeps all your devices nice and clean, too. Amazon buyers say it's a game-changer, saying it \"does exactly what it's supposed to do.\" </p><p><span>Get the 3-in-1 Apple Charging Station from Amazon for $19.99</span> </p><p class=\"tr-npp-section-title\">7. Rechargeable Lighted Beanie</p><p>Here's an item you never knew you needed: a hat with a built-in head lamp. The rechargeable LED light on this beanie makes it perfect for early-morning dog walks, late-night snow shoveling and everything in between. Get it if you love fishing! Get it if you adore your headlamp but just wish it wasn't so bulky! Get it if you like grilling out with buddies but hate the part of the night when you have to clean up in the dark! </p><p><span>Get the Etsfmoa Rechargeable Lighted Beanie from Amazon for $16.99</span> </p><p class=\"tr-npp-section-title\">8. Amazon Echo Dot</p><p>If you're interested in diving into smart home technology but don't want to invest a ton of money just yet, you can pick up an Echo Dot for just under $20. The voice-controlled speaker uses Alexa to make calls, answer questions, play music, set alarms and control all sort of smart home devices, from door locks to thermostats. It also plays games, orders pizza and calls an Uber, all at your command. </p><p><span>Get the Amazon Echo Dot (3rd Generation) from Amazon for $19.99</span> </p><p class=\"tr-npp-section-title\">9. Papillon Heated Back and Neck Massager</p><p>For those with aches and pains, there's this heated back and neck massager, which Amazon buyers call \"addictive.\" (One even wrote in their on-site review, \"I would like to write more about how wonderful this is, but I am too relaxed to keep writing.\") The rotating nodes can deeply knead aches and pains in your neck, shoulder, back, abdomen, calf and thigh areas, and there's a gentle heating function that can be turned on or off depending on what kind of sensation you're looking for. It even comes with a car adapter, lest you find yourself stuck in traffic with a knot in your neck. </p><p><span>Get the Papillon Heated Back and Neck Massager from Amazon for $39.99</span> </p><p class=\"tr-npp-section-title\">10. Tourit Cooler Backpack</p><p>It might be winter now, but it'll be summer soon enough, and you might find yourself with sore arms from lugging coolers all over the place. Why not pick up this leak-proof cooler backpack, which can store up to 30 cans at a time? Amazon buyers have given it 4.7 stars with almost 15,000 reviews, making it the number one item in the site's sports fan cooler section. It comes in a variety of colors, and even has a built-in beer opener on the backpack's strap. </p><p><span>Get the Tourit Cooler Backpack from Amazon for $36.99</span> </p><p class=\"tr-npp-section-title\">11. The Comfy</p><p>Introduced to the world on Shark Tank, the Comfy is the combination sweatshirt-blanket that's taken the snuggle-crazed world by storm. It isn't the most flattering thing you'll ever wear it may be the most comfortable. Take it from our reviewer, who said it's \"exactly what every person needs to survive the hellish, frigid months that are January, February and March. If they're anything like me, they'll never want to take it off.\" Over 50,000 Amazon buyers agree, giving the item an average 4.8 stars. </p><p><span>Get The Comfy Sweatshirt Blanket from Amazon for $44.99</span> </p><p class=\"tr-npp-section-title\">12. Ovalware Iced Coffee Maker</p><p>Iced coffee is great, but a Starbucks addiction can also get expensive. Invest a little in your future caffeine cravings and pick up Ovalware's handy iced coffee maker for your own kitchen. At just under $30, it'll cost you less than 10 Starbucks runs and is very easy to use: Just fill the reservoir with ground coffee, run water through to fill the pitcher and let it steep for eight or so hours. Boom! Coffee. You can use it to make tea as well, so if you're a fan of either, this is a must-have. </p><p><span>Get the Ovalware Iced Coffee Maker from Amazon for $29.99</span> </p><p class=\"tr-npp-section-title\">13. Spikeball</p><p>Looking for your new recreation obsession? It could be Spikeball. Described by the company as \"if volleyball and foursquare had a baby,\" Spikeball is easy to pick up, super portable and can be played almost anywhere. It's perfect for parties and for beach BBQs, though the company also insists it can be played in your living room \"if you're careful enough.\" (Don't send us the repair bills.) The starter kit includes everything you'll need to learn the game, including a ball, netting, the Spikeball set and a carrying bag for easy transport. Just pop it up and get playing. </p><p><span>Get the Spikeball Game Set from Amazon for $64.99</span> </p><p class=\"tr-npp-section-title\">14. S-Zone Oversized Canvas Weekender Bag</p><p>Don't be the person who takes their old gym bag on a weekend trip. You're an adult, so act like one and use your gift card to pick up a nice new leather-trimmed duffel bag. Beloved by Amazon buyers, the canvas S-Zone bag comes in nine chic colors, and is both big enough to hold all sorts of stuff and small enough that you could carry it on a flight. Amazon buyers say it's well-made and high quality, and that it looks more expensive than it is. Who could ask for more? </p><p><span>Get the S-Zone Oversized Canvas Weekender Bag from Amazon for $67.99</span> </p><p class=\"tr-npp-section-title\">16. Thermoflask Stainless Steel Water Bottle</p><p>If you're trying to drink more water in the new year, a shiny new water bottle can really help ease you into that routine. Thermoflask's 24-ounce bottle is made of double-insulated stainless steel and keeps beverages ice cold for 24 hours. (It can also keep hot drinks hot for up to 12 hours.) Best of all, it comes with two different lids: A leak-proof \"chug\" lid with a bigger hole for drinking, and a straw lid in case you're just looking for a little sip. Amazon buyers love it, calling it the \"perfect bottle\" in some reviews, and awarding it 4.8 stars with over 30,000 ratings.</p><p><span>Get the Thermoflask Double Stainless Steel Insulated Water Bottle from Amazon for $19.99</span> </p><p class=\"tr-npp-section-title\">17. Jensen 3-Speed Turntable Music System</p><p>In the past year and a half, vinyl LPs and record players have benefitted from yet another sales uptick. Perhaps it's because we're spending more time at home, or perhaps it's because more and more people waking up to the richness of sound you can get from a record player. Either way, if you're looking to break into the world of vinyl yourself, consider spending your gift card on a modern record player. Jensen's shelf system boasts not just a turntable, but also a CD player, a set of speakers, AM/FM radio and an aux input. It's not the sleekest looking player but it's got everything and is well-reviewed and well-priced. You can't go wrong with that.</p><p><span>Get the Jensen 3-Speed Turntable Music System from Amazon for $199.99</span> </p><p class=\"tr-npp-section-title\">18. Polaroid Instant Camera Bundle</p><p>Take inspiration from Outkast's \"Hey Ya\" and use your gift card to pick up a cool retro Polaroid camera, complete with film. The Polaroid Holiday bundle comes with a Polaroid Now Black i-Type instant camera, plus a double pack of Golden Moments Film, meaning you can start snapping as soon as you open the box. The camera has autofocus and even comes with a cool double exposure option—which allows you to frame two moments in one shot or run to get yourself in a group photo that was missing you the first time around. Who can put a price on memories, really? </p><p><span>Get the Polaroid Instant Camera Bundle from Amazon for $169.99</span> </p><p class=\"tr-npp-section-title\">19. TRX Go Suspension Trainer</p><p>The TRX Go Suspension Trainer would be a great addition to any home gym. If you've worked out with a trainer, chances are you've had a dalliance with the TRX system, which basically challenges you to hang from straps in an attempt to work against your own body weight for a series of lifts. It seems simple enough, but it's deceptively challenging, and also kind of fun. Weighing less than a pound, the GO sets up in less than a minute and can anchor easily to any door. The system also comes with 90 days of access to TRX Training Club On-Demand, which features hundreds of strength, cardio and yoga workouts, all available anytime. </p><p><span>Get the TRX Go Suspension Trainer from Amazon for $129.95</span> </p><p class=\"tr-npp-section-title\">20. Alaska Bear Silk Sleep Mask</p><p>Struggling to get enough sleep every night? Wake up every morning with pillow crinkles across your face and crusty drool all over the place? This very affordable silk sleep mask could help turn things around. The friction-free texture protects the delicate skin around your eyes while you sleep, and the mask's organic silk hydrates skin while you're sleeping, easing dark circles. The mask is hypoallergenic and offers full coverage, so you can ease into blackout darkness even in the middle of the day. It's a great option for frequent travelers, people who work night shifts or just anyone who likes to catch a few z's in the afternoon.</p><p><span>Get the Alaska Bear Silk Sleep Mask from Amazon for $9.99</span> </p><p><span><span>Make 2022 the year of good decisions.</span> Start by signing up for our newsletter for twice-weekly tips, reviews and more from our experts.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: 20 of the best things you can buy with an Amazon gift card</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}