{"date": "2021-11-28 21:48:32.061000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-abstract\"><p>Future Retail said on Sunday that it firmly believes that the Competition Commission of India (CCI) will not be intimidated by the arrogance of Amazon. Future hopes that instead, CCI will take action on its show cause notice against the US-based e-commerce company, in accordance with the law.</p></div><div class=\"tr-npp-lead\"><p>This statement comes after Amazon walked out of CCI proceedings on Nove­mber 24. \u0093The counsels to Amazon, in utter disregard to the norms and utter disrespect to the Indian statutory regulatory authority, refused to argue the matter. They walked out of the proceedings in an attempt to browbeat the CCI,\u0094 the Indian retailer said in a stock exchange filing.</p><p>In a letter addressed to Future Coupons, CCI said it heard the counsels appearing on behalf of Future Coupon and Confederation of Indian Traders (CAIT) at length. It also called Amazon\u0092s counsel to make its submissions on merits and learned about its inability to argue the matter and stated that making submissions may compromise its special leave petition (SLP) and render it infructuous. Its SLP was to come up before the Supreme Court on November 25.</p></div><div class=\"tr-npp-body\"><p>CAIT had filed a public interest litigation in Delhi High Court against CCI, asking it not to delay its ruling in the Amazon-Future Coupons deal. The high court then asked CCI, on November 16, to rule on revoking its approval to the Amazon-Future Coupons deal within two weeks.</p><p>\u0093The learned counsel also made a grievance that Amazon did not get sufficient time to file its rejoinder. Accordingly, despite grant of opportunity, the learned counsel did not make oral submissions,\u0094 CCI said in its letter to Future Coupons.</p><p>Future Coupons lawyer responded to CCI in a letter stating, \u0093The conduct of Amazon smacks of arrogance. It has shown scant respect to the Delhi High Court, the Supreme Court and to this commission.\u0094 Future Coupons also said, in its letter, that the e-commerce major could have moved the Delhi High Court for an extension of time or for a suspension of the order. But it moved the Supreme Court by an interim application relating to the arbitration proceedings, establishing its mistaken belief that the Supreme Court would not deny relief to Amazon.</p><p>\u0093When it failed to get relief from the Supreme Court, it then sought an adjournment from the CCI. When that was refused, in a display of outright contempt for an Indian statutory authority, this trillion-dollar American company walked out of the hearing,\u0094 the letter said.</p><p>It also asked the CCI to deal with the conduct of Amazon appropriately.</p><p>According to a PTI report, the Enforcement Directorate (ED) summoned senior executives of Amazon, including its country head Amit Agarwal, and that of the Future group, for questioning in a foreign exchange violation probe. The report said the executives have been summoned along with documents for the coming week under the provisions of the Foreign Exchange Management Act (FEMA).</p><p>Investigation is being conducted under various sections of the FEMA after the ED received a communication from the commerce ministry earlier this year seeking \u0093necessary action\u0094 against e-commerce players like Amazon and Flipkart. .</p><p>In a statement to Business Standard, an Amazon spokesperson said, \u0093We are in receipt of the summons issued by the ED in connection with the Future Group. As we have just received the summons, we are examining it and will respond within the given time frame.\u0094</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}