{"date": "2021-03-18 10:33:15.252000+00:00", "ticker": "AAF", "mrkt_info": {"open": 82.2, "close": 87.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, March 18 -- Bharti Airtel's African arm, Airtel Africa, on Thursday announced that investment firm TPG's Rise Fund will invest $200 million in telco's mobile money business at a valuation of $2.65 billion.</p><p>Airtel Mobile Commerce BV is currently the holding company for several of Airtel Africa's mobile money operations, and is now intended to own and operate the mobile money businesses across Airtel Africa's 14 operating countries.</p></div><div class=\"tr-npp-body\"><p>The Rise Fund will hold a minority stake in AMC BV upon completion of the transaction, with Airtel Africa continuing to hold the remaining majority stake, the telco said in a regulator filing.</p><p>\"The transaction is the latest step in the Group's pursuit of strategic asset monetization and investment opportunities, and it is the aim of Airtel Africa to explore the potential listing of the mobile money business within four years,\" Airtel said.</p><p>Airtel Africa Group is also in discussions with other potential investors in relation to possible further minority investments into Airtel Money, up to a total of 25 per cent of the issued share capital of AMC BV.</p><p>\"The proceeds from the transaction will be used to reduce Group debt and invest in network and sales infrastructure in the respective operating countries,\" the statement said.</p><p>Raghunath Mandava, CEO of Airtel Africa, commented, \"In line with our vision of enhancing financial inclusion, Airtel Africa offers a unique digital mobile financial services platform under the Airtel Money brand. With today's announcement we are pleased to welcome The Rise Fund as an investor in our mobile money business and as a partner to help us realise the full potential from the substantial opportunity to bank the unbanked across Africa.\"</p><p>Bharti Airtel's scrip on BSE closed 1.50% higher at Rs.530.75 apiece on Thursday. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}