{"date": "2022-01-19 23:12:50.204000+00:00", "ticker": "III", "mrkt_info": {"open": 1406.0, "close": 1412.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENBRIDGE INC (\"ENB-TN\")\n- Closing of $750 Million Subordinated Notes Offering\n\n     Enbridge Inc. (Enbridge or the Company) announced that it has closed\nits previously announced offering (the \"Offering\") of $750 million\naggregate principal amount of 5.00% Fixed-to-Fixed Rate Subordinated Notes\nSeries 2022-A due January 19, 2082 (the \"Notes\").\n\n     Enbridge intends to use the net proceeds of the Offering to redeem its\nissued and outstanding Cumulative Redeemable Minimum Rate Reset Preference\nShares, Series 17 (TSX: ENB.PF.I) in accordance with their terms and,\npending such redemption, to repay short-term indebtedness, as well as for\ngeneral corporate purposes.\n\n     The Notes were offered in Canada through a syndicate of underwriters,\nco-led by RBC Capital Markets, BMO Capital Markets, and CIBC Capital\nMarkets, on a private placement basis in reliance upon exemptions from the\nprospectus requirements under applicable securities legislation.\n\n     The Notes have not been and will not be registered under the United\nStates Securities Act of 1933, as amended, or any state securities law, and\nmay not be offered or sold within the United States.\n\n     About Enbridge Inc.\n\n     Enbridge Inc. is a leading North American energy infrastructure\ncompany. We safely and reliably deliver the energy people need and want to\nfuel quality of life. Our core businesses include Liquids Pipelines, which\ntransports approximately 25 percent of the crude oil produced in North\nAmerica; Gas Transmission and Midstream, which transports approximately 20\npercent of the natural gas consumed in the U.S.; Gas Distribution and\nStorage, which serves approximately 3.8 million retail customers in Ontario\nand Quebec; and Renewable Power Generation, which owns approximately 1,766\nMW (net) in renewable power capacity in North America and Europe. The\nCompany's common shares trade on the Toronto and New York stock exchanges\nunder the symbol ENB. For more information, visit www.enbridge.com.\n\n     Forward-Looking Information\n\n     Forward-looking information, or forward-looking statements, have been\nincluded in this news release to provide information about Enbridge Inc.\n(\"Enbridge\" or the \"Company\") and its subsidiaries and affiliates,\nincluding management's assessment of Enbridge and its subsidiaries' future\nplans and operations. This information may not be appropriate for other\npurposes. Forward-looking statements are typically identified by words such\nas \"anticipate\", \"expect\", \"project\", \"estimate\", \"forecast\", \"plan\",\n\"intend\", \"target\", \"believe\", \"likely\", \"will\" and similar words\nsuggesting future outcomes or statements regarding an outlook.\nForward-looking information or statements in this news release include\nstatements with respect to the expected use of the net proceeds from the\nOffering.\n\n     Although Enbridge believes these forward-looking statements are\nreasonable based on the information available on the date such statements\nare made and processes used to prepare the information, such statements are\nnot guarantees of future performance and readers are cautioned against\nplacing undue reliance on forward-looking statements. By their nature,\nthese statements involve a variety of assumptions, known and unknown risks\nand uncertainties and other factors, which may cause actual results, levels\nof activity and achievements to differ materially from those expressed or\nimplied by such statements. Assumptions regarding the expected supply of\nand demand for crude oil, natural gas, NGL and renewable energy, and the\nprices of these commodities, are material to and underlie all\nforward-looking statements, as they may impact current and future levels of\ndemand for the Company's services. Similarly, energy transition, including\nthe drivers and pace thereof, the COVID-19 pandemic, exchange rates,\ninflation and interest rates impact the economies and business environments\nin which the Company operates and may impact levels of demand for the\nCompany's services and cost of inputs, and are therefore inherent in all\nforward-looking statements. Due to the interdependencies and correlation of\nthese macroeconomic factors, the impact of any one assumption on a\nforward-looking statement cannot be determined with certainty.\n\n     Enbridge's forward-looking statements are subject to risks and\nuncertainties, including, but not limited to those risks and uncertainties\ndiscussed in this news release and in the Company's other filings with\nCanadian and United States securities regulators. The impact of any one\nrisk, uncertainty or factor on a particular forward-looking statement is\nnot determinable with certainty as these are interdependent and Enbridge's\nfuture course of action depends on management's assessment of all\ninformation available at the relevant time. Except to the extent required\nby applicable law, Enbridge assumes no obligation to publicly update or\nrevise any forward-looking statements made in this news release or\notherwise, whether as a result of new information, future events or\notherwise. All subsequent forward-looking statements, whether written or\noral, attributable to Enbridge or persons acting on the Company's behalf,\nare expressly qualified in their entirety by these cautionary statements.\n\n     This news release does not constitute or form part of, and should not\nbe construed as, an offer to purchase or an invitation to sell securities\nof Enbridge, or the solicitation of an offer to purchase securities of\nEnbridge, and nothing contained herein shall form the basis of or be relied\non in connection with any contract or commitment.\n\n     FOR FURTHER INFORMATION PLEASE CONTACT:\n\n     Media Toll Free: (888) 992-0997 Email: media@enbridge.com\n\n     Investment Community Toll Free: (800) 481-2804 Email:\ninvestor.relations@enbridge.com\n\nTel   : 403-231-3900    ENBRIDGE INC\nFax   : 403-231-5929\nWWW   : <a href=\"https://www.enbridge.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.enbridge.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201800622.MNPRE2201802978-15053220220119</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}