{"date": "2022-01-19 19:34:13.332000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>E-commerce firm Amazon has halted its plan to stop customers using Visa's credit cards issued in the UK, as it is working to resolve the dispute over payment fees.</p><p>The ban on Visa's credit cards was set for 19 January. However, the e-commerce firm has emailed its UK customers on Monday that the ban will no longer take place on the date announced.The email to customers reads: \"We are working closely with Visa on a potential solution that will enable customers to continue using their Visa credit cards on Amazon.co.uk.\"A Visa spokesperson told CNBC by email: \"Amazon customers can continue to use Visa cards on Amazon.co.uk after January 19 while we work closely together to reach an agreement.\"Amazon had first revealed its plan to block Visa credit cards in November last year due to the increasing cost of accepting credit card payments.Card fees have been a point of dispute between merchants, banks and payment firms.The payment firms set the rates that merchants are required to pay as swipe fees. Although banks issuing cards take the major part of that fee, Visa been facing criticism from merchants over increasing payment costs, reported BBC.Amazon had accused Visa's high payment fees as an obstacle in providing the best pricing deal for its customers, while Visa had accused Amazon of restricting payment choice for its customers.\"When consumer choice is limited, nobody wins,\" Visa had stated then.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}