{"date": "2021-11-25 10:59:21+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3580.04, "close": 3504.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Foo Yun Chee</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">BRUSSELS, Nov 25 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>EU countries on Thursday agreed on a common position on new rules to curb the power of U.S. tech giants and force them to do more to police their platforms for illegal content.</p><p>However, they will have to iron out the final details with EU lawmakers, who have proposed tougher rules and higher fines.</p><p>Frustrated by the slow pace of antitrust investigations, EU competition chief Margrethe Vestager has proposed two sets of rules known as the Digital Markets Act and the Digital Services Act targeting Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, Apple <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a>, Alphabet <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a> unit Google and Facebook <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a>.</p><p>The DMA has a list of dos and don'ts for online gatekeepers - companies that control data and access to their platforms - reinforced by fines of up to 10% of global turnover.</p><p>The Digital Services Act (DSA) forces the tech giants to do more to tackle illegal content on their platforms, with fines of up to 6% of global turnover for non-compliance.</p><p>The common position adopted by EU countries follows the main points proposed by Vestager, with some tweaks, with the European Commission as the main enforcer of the new rules despite an initial French proposal to give national watchdogs more power.</p><p>Negotiations are expected to start next year, with the rules likely to be adopted in 2023.</p><p>\"The proposed DMA shows our willingness and ambition to regulate big tech and will hopefully set a trend worldwide,\" Zdravko Počivalšek, Slovenian Minister for Economic Development and Technology, said in a statement. </p><p>The changes agreed by the EU countries include a new obligation on tech companies that enhances the right of end users to unsubscribe from core platform services and shortens the deadlines and improves the criteria for designating gatekeepers.</p><p>Luxembourg, where Amazon has its European headquarters, welcomed the agreement which designates national watchdogs as the lead DSA enforcer for companies based in their countries.</p><p>\"Luxembourg is pleased that in general the country in which the intermediary is established remains responsible for the enforcement of the harmonised rules of the DSA, in particular thanks to closer cooperation with the other Member States and the Commission – apart from when it comes to the very big  players,\" it said in a statement.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Foo Yun Chee; Editing by Angus MacSwan)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:foo.yunchee@thomsonreuters.com\" data-type=\"email\" translate=\"no\">foo.yunchee@thomsonreuters.com</a> ; +32 2 287 6844; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://foo.yunchee.thomsonreuters.com@reuters.net\">foo.yunchee.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: EU-TECH/</p></div>"}