{"date": "2022-02-03 14:00:20.867000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3023.87, "close": 2776.91}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">Lucira Health's rapid accurate molecular at-home test is available for purchase nationwide with fast, free delivery through Amazon Prime</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">EMERYVILLE, Calif., Feb. 3, 2022</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">EMERYVILLE, Calif.</span>, <span class=\"xn-chron\">Feb. 3, 2022</span> /PRNewswire/ -- Lucira Health, Inc. (\"Lucira Health\" or \"Lucira\") (Nasdaq: LHDX), a medical technology company focusing on the development and commercialization of transformative and innovative infectious disease test kits, announced more than two million Lucira<sup><span>™</span></sup> Check-It COVID-19 tests, a rapid at-home test with PCR-quality accuracy, are available on <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3432942-1&amp;h=3369118924&amp;u=https%3A%2F%2Fwww.amazon.com%2FLucira-COVID-19-Single-use-Quality-Molecular%2Fdp%2FB092KGQT2Y%2F%3F_encoding%3DUTF8%26pd_rd_w%3DbZYnH%26pf_rd_p%3D29505bbf-38bd-47ef-8224-a5dd0cda2bae%26pf_rd_r%3D5CTWH08ZXC0PKD8ENWPB%26pd_rd_r%3D9e9845b9-9537-40c2-981e-c77bf21e8bdb%26pd_rd_wg%3DmCq8U%26ref_%3Dpd_gw_ci_mcx_mr_hp_atf_m&amp;a=Amazon.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com</a>. Lucira's tests are available with 1-2 day Prime delivery nationwide.</p>\n<div id=\"divReleaseHighlight7d76\" style=\"BORDER-TOP:gray 1px solid;WIDTH:200px;BORDER-BOTTOM:gray 1px solid;FLOAT:left;TEXT-ALIGN:justify;MARGIN:5px 10px\">Lucira Health announces more than two million of its molecular COVID-19 at-home tests are available on Amazon.com </div><p>Nationwide surges of COVID-19 cases have resulted in overwhelmed testing sites and processing labs, making accurate at-home test options more critical than ever. Lucira's innovative tests uniquely combine the speed and at-home usability of rapid antigen tests and the accuracy and early detection of PCR. Lucira's tests are amplification tests, meaning they amplify virus genetic material, just like PCR tests, but are miniaturized to fit in the palm of your hand and were shown to be 98% accurate in a head-to-head comparison to one of the most sensitive lab-based PCR tests. Results are available in 30 minutes and the test works in three easy steps with no prescription required. At <span class=\"xn-money\">$75</span>, the Check-It COVID-19 test kit is priced less than most lab-based PCR tests and mail-in PCR kits, both of which can take up to 2-4 days to receive results. Lucira Check-It tests are also eligible for the recently announced at-home test reimbursement from private insurers.  </p>\n<p>\"We have worked tirelessly to ensure Lucira Check-It COVID-19 tests are more accessible to the public,\" said <span class=\"xn-person\">Erik Engelson</span>, Lucira Health's Chief Executive Officer. \"Access to a COVID-19 test with PCR-level accuracy and early detectability, previously only available from a lab test, in 30 minutes without leaving your home can help Americans confidently return to work or school and get back to gathering in-person with family and friends. Amazon's distribution network enables more people in <span class=\"xn-location\">the United States</span> to access this innovative and unique testing solution.\"</p>\n<p>The test kit, the first and only single-use at-home amplification test authorized for emergency use by FDA, is available over the counter (\"OTC\") and can produce a positive result in as little as 11 minutes, or a negative result within 30 minutes. Immediately after testing, users can access a free, text-based digital LUCI PASS™ verified test result on their phone.</p>\n<p>The Check-It COVID-19 test kit costs <span class=\"xn-money\">$75</span> for a single test. The list price is <span class=\"xn-money\">$89</span> with a <span class=\"xn-money\">$14</span> coupon available on amazon.com. Tests are also available on <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3432942-1&amp;h=16811694&amp;u=http%3A%2F%2Fwww.lucirahealth.com%2F&amp;a=www.lucirahealth.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.lucirahealth.com</a>.</p>\n<p>The Lucira Check-It COVID-19 test kit has emergency authorization by FDA under EUA.</p>\n<p><b><span>LUCIRA™ Check-It Test Kit</span></b></p>\n<p>The Lucira™ Check-It (OTC) test is a Nucleic-Acid Amplification Tests (referred to as NAAT). The test fits in the palm of your hand, extracts genetic material from the virus and amplifies it, similar to PCR lab tests, to detect the presence of virus earlier and more accurately than antigen tests. The test uses an approach called reverse transcriptase loop-mediated isothermal amplification (RT-LAMP). It was designed and tested extensively for individuals to use independently and does not require a physician's prescription or supervised assistance. There is no additional equipment to purchase, such as a reader or instrument.</p>\n<p>In a community trial setting, Lucira™ Check-It results were compared with the Hologic Panther Fusion, which is considered a high-sensitivity molecular test due to its low Limit of Detection (\"LOD\"). Lucira's accuracy was 98%, correctly detecting 385 out of 394 positive and negative samples in comparison to the Hologic Panther Fusion, excluding ten samples with very low levels of virus (those with very high PCR cycle thresholds of 37.5 or greater) that likely no longer represented active infection. Comparative positive results agreed 97% of the time among this sample, and negative results agreed 98% of the time.</p>\n<p>Lucira has announced confirmation that its COVID-19 Check-It molecular self-test kits can detect 100% of Omicron variant genome sequences analyzed, including sub-variant BA.2, as of <span class=\"xn-chron\">January 11, 2022</span>. Lucira assays target viral sequence regions unaffected by the spike protein mutations found in Omicron, Delta and other Variants of Concern, allowing it to maintain its accuracy in the face of an evolving virus.</p>\n<p>Each Lucira test kit contains everything needed to run a single COVID-19 test. Users get the test device, two AA batteries, sample vial, swab, and simple instructions. The batteries are inserted into the device and the sample vial is placed in the test unit. The user then opens the test swab packet and rotates the swab five times in each nostril. The swab is then stirred in the sample vial, which is then gently pressed into the test unit to start the test. The \"ready\" light will blink until a \"positive\" or \"negative\" green light is illuminated within 30 minutes. In the US, Lucira also offers a free LUCI Pass™ digital verified test result back to a user's phone. LUCI Pass is accessed via text and does not require downloading an app. There is also an opt-in for public health reporting for users who wish to transmit their results to the relevant public health authorities.</p>\n<p>In clinical trials, 100% of users successfully performed the test at home in about two minutes using Lucira's easy-to-use \"swab, stir and detect\" Check-It test kit.</p>\n<p><b><span>About Lucira Health</span></b></p>\n<p>Lucira is a medical technology company focused on the development and commercialization of transformative and innovative infectious disease test kits. Lucira's testing platform produces lab quality molecular testing in a single-use, consumer-friendly, palm-size test kit powered by two AA batteries. Lucira designed its test kits to provide accurate, reliable, and on-the-spot molecular test results anywhere and at any time. The Lucira™ Check-It COVID-19 Test Kit (OTC) and Lucira™ COVID-19 All-In-One Test Kit (Rx) are designed to provide a clinically relevant COVID-19 result within 30 minutes from sample collection. For more information, visit <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3432942-1&amp;h=16811694&amp;u=http%3A%2F%2Fwww.lucirahealth.com%2F&amp;a=www.lucirahealth.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.lucirahealth.com</a>.</p>\n<p><b><span>Forward Looking Statements</span></b></p>\n<p>Statements contained in this press release regarding matters that are not historical facts are \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Because such statements are subject to risks and uncertainties, actual results may differ materially from those expressed or implied by such forward-looking statements. Words such as \"can,\" \"plans,\" \"will,\" \"may,\" \"anticipates,\" \"expects,\" \"potential,\" and similar expressions are intended to identify forward-looking statements. These forward-looking statements are based upon Lucira's current expectations and involve assumptions that may never materialize or may prove to be incorrect. Actual results could differ materially from those anticipated in such forward-looking statements as a result of various risks and uncertainties, including Lucira's ability to increase production, streamline operations and increase product availability; the success of Lucira's test platform with COVID-19 including its variants; the extent and duration of the COVID-19 pandemic and Lucira's expectations regarding customer and user demand for its COVID-19 test kit; Lucira's ability to obtain and maintain regulatory approval for its test kits, including Lucira's existing Emergency Use Authorization for its COVID-19 test kits; the performance of, and Lucira's reliance on, third parties in connection with the commercialization of its test kits, including Jabil Inc. and Lucira's single-source suppliers; Lucira's ability to successfully continue to expand internationally; any impact on Lucira's ability to market its products; demand for Lucira's products due to deferral of procedures using its products or disruption in its supply chain; Lucira's ability to achieve or sustain profitability; Lucira's ability to gain market acceptance for its products and to accurately forecast and meet customer demand; Lucira's ability to compete successfully; Lucira's ability to enhance and expand its product offerings; Lucira's ability to accurately predict continued expansion; Lucira's ability to accurately forecast revenue; development and manufacturing problems; capacity constraints or delays in production of Lucira's products; maintenance of coverage and adequate reimbursement for procedures using Lucira's products; and product defects or failures. These and other risks and uncertainties are described more fully in the \"Risk Factors\" section and elsewhere in Lucira's filings with the Securities and Exchange Commission and available at <a href=\"http://www.sec.gov\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.sec.gov</a>, including in its most recent Annual Report on Form 10-K and Quarterly Reports on Form 10-Q. Any forward-looking statements that we make in this announcement speak only as of the date of this press release, and Lucira assumes no obligation to update forward-looking statements whether as a result of new information, future events or otherwise after the date of this press release, except as required under applicable law.</p>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=LA51251&amp;sd=2022-02-03\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1MQTUxMjUxJnNkPTIwMjItMDItMDM=&amp;key=00e3097fe33ab02c5d4279ce746136151dc79839349a1e69fb91351d9cbd686d70a4b7498187b3d51ff9c9d6465254f1d2bd5238a958ddfca19cda089b3e4f59\"/></div></div> View original content:<a href=\"https://www.prnewswire.com/news-releases/lucira-health-commits-2-million-at-home-molecular-covid-19-test-kits-on-amazon-301474800.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/lucira-health-commits-2-million-at-home-molecular-covid-19-test-kits-on-amazon-301474800.html</a><p></p>\n<p>SOURCE  Lucira Health</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: LuciraHealth-CovidKit</p></div>"}