{"date": "2021-12-13 16:00:02.049000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">Nick Tostenrude will lead product strategy and development for Vesta, the leader in e-commerce Fraud Prevention &amp; Approval Enhancement</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">PORTLAND, Ore., Dec. 13, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">PORTLAND, Ore.</span>, <span class=\"xn-chron\">Dec. 13, 2021</span> /PRNewswire/ --<b> </b><u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3385881-1&amp;h=3513167724&amp;u=https%3A%2F%2Fwww.vesta.io%2F&amp;a=Vesta\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Vesta</a></u>, a leading end-to-end transaction guarantee platform for online purchases, today announced the hiring of industry veteran <span class=\"xn-person\">Nick Tostenrude</span> as Chief Product Officer. In this role, Nick will oversee all of Vesta's product management, from ideation through launch, with a focus on enhancing and broadening Vesta's suite of merchant protection and approval solutions. </p>\n\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/1444406/Vesta_Logo.html\">\n                    <div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Vesta (PRNewsfoto/Vesta)\" src=\"https://mma.prnewswire.com/media/1444406/Vesta_Logo.jpg\" title=\"Vesta (PRNewsfoto/Vesta)\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMTQ0NDQwNi9WZXN0YV9Mb2dvLmpwZw==&amp;key=00897e94e6eeb360136b8446ac538cc0f1728ccd5576bc9da9946f6ab8d78b29a7abdf2a15f351d9d125dee48e660811b444274151c2f3fb431eb13341bebdbf\"/></div></div>\n                        </a>\n                </p>\n\n    </div>\n<p>Tostenrude brings more than 20 years of product management and e-commerce experience to his role, most recently serving as General Manager (GM) for the Amazon Fraud Detector service at Amazon Web Services (AWS). As GM, Nick worked closely with senior leaders across the organization to deliver innovative solutions that enable AWS customers to identify potentially fraudulent activities in real time. Before that, Nick led product management for the AWS Fraud Prevention organization, helping to build internal systems to protect AWS from fraud attacks.</p>\n<p>Prior to AWS, Nick served as a Senior Manager of Product Management in Amazon's Kindle and Devices organizations, leading teams responsible for defining the product strategy and roadmap for Amazon's device management and bulk content distribution platform, Whispercast, and for the company's Accessibility efforts, ensuring Amazon's devices and Kindle reading apps were easy to use for customers with disabilities.</p>\n<p>\"As online fraud continues to rise and fraudsters become more sophisticated with their attacks, businesses across a range of industries are looking for effective solutions they can deploy at scale.\" said <span class=\"xn-person\">Ron Hynes</span>, CEO of Vesta. \"Nick's deep understanding of product management combined with his experience building fraud prevention solutions to protect Amazon and Amazon's enterprise customers make him the ideal person to drive our product roadmap and development efforts. Under his leadership we can continue to iterate our existing solutions to consistently add more value for our customers, while simultaneously developing entirely new products that help them stay ahead of the curve and keep fraudsters at bay for years to come.\" </p>\n<p>As Chief Product Officer, Tostenrude will set Vesta's global product strategy and oversee its entire product portfolio. He will build and lead a team of customer-focused product managers who will identify new business opportunities, expand Vesta's suite of solutions, and execute Vesta's product strategy. Tostenrude will also be responsible for fostering a culture of innovation and collaboration across the entire organization. </p>\n<p>\"I've listened to leaders from hundreds of companies over the past five years tell me about the challenges they face in building adequate protections against sophisticated fraud attacks. It's a big investment for them that often distracts from their primary business,\" said <span class=\"xn-person\">Nick Tostenrude</span>. \"I'm impressed with how Vesta's solutions help customers eliminate fraud and increase approval rates for legitimate transactions so they can put focus back on their primary business. I look forward to working with the team to build upon Vesta's strategy and further solidify Vesta's position as the global leader in fraud prevention and transaction approvals.\"</p>\n<p>In addition to his experience at Amazon, Tostenrude co-founded EnableMart, a provider of assistive technology devices for people with disabilities. EnableMart was acquired by MRN, Inc., where Nick served as President, E-Commerce. He holds an MBA from <span class=\"xn-org\">University of Oxford's</span> Saïd Business School and a bachelor's degree in Electrical Engineering from <span class=\"xn-org\">University of Portland</span>.</p>\n<p>For more information on Vesta and its solutions please visit <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3385881-1&amp;h=1654129198&amp;u=http%3A%2F%2Fwww.vesta.io%2F&amp;a=www.vesta.io\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.vesta.io</a></u>.  </p>\n<p><b>About Vesta Corporation<br/></b>Vesta is the only instant, end-to-end transaction guarantee platform for online purchases, delivering unparalleled approval rates, a better customer experience and eliminating fraud for leading brands in telco, e-commerce, travel, and financial services. Using machine learning backed by 25 years of transactional data history, Vesta increases approvals of legitimate sales for its customers, while eliminating chargebacks and other forms of digital fraud, driving the true cost of fraud to zero and transferring 100% of the liability for fraud, including chargeback processing, so merchants can focus on increasing sales. The company is headquartered in <span class=\"xn-location\">Portland, OR</span>, with offices in <span class=\"xn-location\">Atlanta</span>, <span class=\"xn-location\">Miami</span>, <span class=\"xn-location\">Ireland</span>, <span class=\"xn-location\">Mexico</span>, and <span class=\"xn-location\">Singapore</span>. For more information visit<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3385881-1&amp;h=219859237&amp;u=http%3A%2F%2Fwww.vesta.io%2F&amp;a=%C2%A0\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> </a><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3385881-1&amp;h=1654129198&amp;u=http%3A%2F%2Fwww.vesta.io%2F&amp;a=www.vesta.io\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.vesta.io</a>.</p>\n<p><b>Media Contact: <br/></b><span class=\"xn-person\">Abby Rieflin</span> <br/>216-870-1835<br/><a href=\"mailto:abby@clarity.pr\" data-type=\"email\" translate=\"no\">abby@clarity.pr</a> </p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n</div>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=NY03385&amp;sd=2021-12-13\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1OWTAzMzg1JnNkPTIwMjEtMTItMTM=&amp;key=ee1ef182492a97de88b2c30035da6a511ad7c7e8078a17f73d166b918d928e7f2ad319fd5471495e801f6847f07e8a69422e4a4f03eef20c78bcc9cf58884726\"/></div></div> View original content to download multimedia:<a href=\"https://www.prnewswire.com/news-releases/former-amazon-leader-joins-vesta-as-chief-product-officer-301441941.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/former-amazon-leader-joins-vesta-as-chief-product-officer-301441941.html</a><p></p>\n<p>SOURCE  Vesta</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: VESTA-New-Personnel</p></div>"}