{"date": "2022-02-18 13:41:00.091000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3162.01, "close": 3052.03}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>WONDERFI TECHNOLOGIES INC (\"WNDR-V\")\n- Appointment of John Rim as Chief Financial Officer\n\n     WonderFi Technologies Inc. (the \"Company\" or \"WonderFi\") announced the\nappointment of John Rim as Chief Financial Officer of the Company,\neffective February 22, 2022. WonderFi's previous CFO, Steven Krause, will\ncontinue to work with WonderFi as an advisor.\n\n     John has close to 25 years of experience as a business executive in\nvaried finance and leadership roles across multiple industries, including\nthe cryptocurrency industry. He previously served as Chief Financial\nOfficer at Bitfarms Ltd. which is listed on the NASDAQ, where he led\nefforts to have Bitfarms become the first cryptocurrency company to have a\nCanadian listing approved by the Ontario Securities Commission. John helped\nlay the foundation for Bitfarms to become one of the largest publicly\ntraded cryptocurrency mining companies globally.\n\n     John has also held leadership and professional roles with Brookfield\nResidential Property Services, Philips Electronics Ltd.,\nPricewaterhouseCoopers LLP, BMW Canada Inc. and KPMG LLP. Mr. Rim has an\nHonours Bachelor of Business Administration degree from Royal Military\nCollege of Canada and is a Chartered Professional Accountant. He was most\nrecently the Chief Financial Officer at Quarterhill Inc., a publicly listed\ntechnology company, where he helped raise over $140 million of financing\nand execute multiple acquisitions over the past 14 months to pivot the\ncompany into the infrastructure technology industry.\n\n     \"We're very pleased to welcome John to our growing team at WonderFi,\"\ncommented Ben Samaroo, CEO of WonderFi. \"John's background and experience\nin finance leadership and capital markets, as well as in the crypto\nindustry, will be invaluable to WonderFi as we continue to grow the\nCompany.\"\n\n     John Rim commented, \"I am extremely excited to be joining WonderFi and\nhaving the opportunity to work with such a passionate team of founders and\nemployees. WonderFi is incredibly well-positioned to achieve its mission to\nhelp grow adoption of digital assets. I look forward to working with the\nwhole team in advancing this mission.\"\n\n     Additional Information\nFor additional information, please contact:\n\n     WonderFi Technologies Inc.\nBen Samaroo, CEO\nben@wonder.fi\n(778) 843-9637\n\n     Investor Relations Contact: invest@wonder.fi\nMedia Contact: press@wonder.fi\n\n     ABOUT WONDERFI\n\n     WonderFi is a leading technology company with the mission of creating\nbetter access to digital assets through compliant centralized and\ndecentralized platforms. WonderFi has a multi-pronged business strategy\nwhich includes a high-growth consumer finance app which will serve as a\ntrusted gateway to the new financial system, and a digital asset portfolio\nwhich consists of leading crypto and DeFi assets. WonderFi's executive team\nand Board of Directors have an established track record in finance and\ncrypto, with previous experience at Amazon, Shopify, PayPal, Galaxy Digital\nand Hut 8. WonderFi's core team of engineers and technologists believe that\neveryone should have equal access to finance, and are aligned in the\nmission to empower people around the world to access DeFi in a simple,\nsmart and secure way. For more information, visit www.wonder.fi.\n\n     Forward-Looking Information and Statements\n\n     This press release contains certain \"forward-looking information\"\nwithin the meaning of applicable Canadian securities legislation and may\nalso contain statements that may constitute \"forward-looking statements\"\nwithin the meaning of the safe harbor provisions of the United States\nPrivate Securities Litigation Reform Act of 1995. Such forward-looking\ninformation and forward-looking statements are not representative of\nhistorical facts or information or current condition, but instead represent\nonly the Company's beliefs regarding future events, plans or objectives,\nmany of which, by their nature, are inherently uncertain and outside of the\nCompany's control. Generally, such forward-looking information or\nforward-looking statements can be identified by the use of forward-looking\nterminology such \"could\", \"intend\", \"expect\", \"believe\", \"will\",\n\"projected\", \"estimated\", or variations of such words.\n\n     By identifying such information and statements in this manner, the\nCompany is alerting the reader that such information and statements are\nsubject to known and unknown risks, uncertainties and other factors that\nmay cause the actual results, level of activity, performance or\nachievements of the Company to be materially different from those expressed\nor implied by such information and statements. In addition, in connection\nwith the forward-looking information and forward-looking statements\ncontained in this press release, the Company has made certain assumptions.\nAmong the key factors that could cause actual results to differ materially\nfrom those projected in the forward-looking information and statements are\nthe following: the ability of the Company to work effectively with\nstrategic investors; and changes in general economic, business and\npolitical conditions, including changes in the financial markets, changes\nin applicable laws, and compliance with extensive government regulation.\nShould one or more of these risks, uncertainties or other factors\nmaterialize, or should assumptions underlying the forward-looking\ninformation or statements prove incorrect, actual results may vary\nmaterially from those described herein.\n\n     Although the Company believes that the assumptions and factors used in\npreparing, and the expectations contained in, the forward-looking\ninformation and statements are reasonable, undue reliance should not be\nplaced on such information and statements, and no assurance or guarantee\ncan be given that such forward-looking information and statements will\nprove to be accurate, as actual results and future events could differ\nmaterially from those anticipated in such information and statements. The\nforward-looking information and forward-looking statements contained in\nthis press release are made as of the date of this press release, and the\nCompany does not undertake to update any forward-looking information and/or\nforward-looking statements that are contained or referenced herein, except\nin accordance with applicable securities laws. All subsequent written and\noral forward- looking information and statements attributable to the\nCompany or persons acting on its behalf is expressly qualified in its\nentirety by this notice.\n\n     Neither NEO Exchange nor its Regulation Services Provider (as that\nterm is defined in policies of the NEO Exchange) accepts responsibility for\nthe adequacy or accuracy of this news release.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204800074.MNPRE2204800420-05192020220218</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}