{"date": "2022-01-11 18:43:38.096000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_m7zsouv8&amp;referenceId=1_m7zsouv8&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_m7zsouv8&amp;referenceId=1_m7zsouv8&amp;pageId=RefinitivNewscasts</a></pre>Source: Stocktube<br/><br/>Description: Cenntro Electric Group Ltd Chief Marketing Officer Marianne McInerney tells Proactive the Freehold, New Jersey-based electric vehicle manufacturer, which recently merged with lingerie group Naked Brand Group, has given 2021 financial guidance of $25.3 million, with more than 1,500 vehicle sales. &amp;#xD;&amp;#xD;What's more, McInerney says the group is 'ramping up quickly,' expecting to meet its goal of selling around 21,000 vehicles in 2022, forecasting top line growth of $506 million. The group is in the process of scaling its production capability in the US and in Europe.<br/>Short Link: <a href=\"https://refini.tv/3GugPwh\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3GugPwh</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; Hello and welcome back to Proactive New York. Joining me today from Cenntro Electric Group is Chief Marketing Officer, Marianne Mcinerney. Marianne, good to meet you. how are you today? &gt;&gt; I'm great, thanks for having us in. &gt;&gt; Of course. Marianne lots to get to today but first off, give us a quick introduction to the company. &gt;&gt; Sure. Cenntro is a leading commercial stage EV technology company. We are an early pioneer in AI, artificial intelligence and autonomous driving, and a leading designer and manufacturer of electric vehicles, both from class 1 or light, to class 4 medium duty commercial vehicles. So that's anywhere from your UPS to your Amazon delivery trucks. Over time we have sold and delivered more commercial electric vehicles than any other EV company. Our customers have traveled over time about 20 million miles on our drive system. Our vehicles are delivered to more than 20 countries, and so we're really proud of what we've been able to bring to market. &gt;&gt; Before we talk more about what you've achieved here in terms of vehicle production, can you just rewind a bit and just tell us a bit about your merger with Naked. &gt;&gt; Of course. Well, basically, I would say Naked was similar to a spark transaction, meaning that they had 250 million in cash on their balance sheet and after disposing their core business, which was lingerie business or businesses. From their standpoint, Cenntro was the next evolution of their company. They had a great desire to go green, and they provided the capital to fund our organic growth through allowing us to expand our capacity and they provided the working capital to allow us to address our backlog. With less than 10 million in liabilities, we're in a great position to succeed. Our combined company now has a truly robust financial profile, a strong balance sheet, and not to mention, we've got some really strong main characteristics of the Naked brand position. That along with substantial liquidity and good trading volume will allow us to really build. &gt;&gt; Speaking of financials, you have given guidance on your 2021 financial, so talk about what you have achieved here. &gt;&gt; Well, we expect the 2021 revenue of about 25.3 million with over 1,500 vehicles sales year to date. And about 506 million on about 21,000 plus vehicle sales in 2022, and 2.1 billion on about 74,000 vehicle sales in 2023. So we're really ramping up quite quickly. &gt;&gt; You talk about the 21,000 number, you're still on track to make that many vehicles by year end this year? &gt;&gt; Yes, we are. &gt;&gt; And you have, from my understanding, ramped up production facilities to do so. &gt;&gt; We have. We're in the process of quickly scaling our production ability. We've just announced and we'll be standing up a facility in Jacksonville, Florida and that will be followed by an additional facility in Europe, which is a truly big footprint of the company. &gt;&gt; What else should we expect for the remainder of the year, for 2022? &gt;&gt; I think what's exciting about Cenntro is that we have purpose-built solutions for the market, and we have a rich history in producing and delivering vehicles. Over 4,000 commercial vehicles have been delivered by the company to customers in over 20 countries for about a five-year period. We had a backlog, there continues to be great demand for our product, they've truly performed. And I think as we bring on the facilities in both Florida and in Germany, we truly expect to be able to scale quickly and deliver these products in line. I think the other thing that's exciting about Cenntro is that we came out with a very clear vision that with our IP and our ability to design and produce innovative solutions, we would be able to address growing market demand. We're really well positioned to scale our products. We've got a decentralized production model which I think checks every box we need, and we really expect that we have the right position and the right people to grow production at a lower than average cost than any other EV company that's currently out there. &gt;&gt; Well it's definitely an exciting space and we look forward to following your progress here. Marianne, thanks so much. &gt;&gt; Thanks for having me.<br/></span></div></div></div></div>"}