{"date": "2022-02-07 18:11:30+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The author is a Reuters Breakingviews columnist.  The opinions expressed are her own.</p><p class=\"tr-by\">By Lauren Silva Laughlin</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW YORK, Feb 7 (Reuters Breakingviews)</span><span class=\"tr-dl-sep\"> - </span>When workout results are coming too slowly, one option is to find a new trainer. Peloton Interactive <a href=\"reuters://REALTIME/Verb=FullQuote/ric=PTON.O\" data-type=\"ric\" data-ric=\"PTON.O\" translate=\"no\" dir=\"ltr\">PTON.O</a> shares surged as much as 29% on Monday after Reuters reported <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2UF2UY\" data-type=\"storyId\" data-story-id=\"nL4N2UF2UY\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> that Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> could buy the beleaguered workout firm. The two companies aren’t an obvious match, but there’s potentially value in selling Peloton’s high-octane workouts to Amazon’s massive user base. Doing so could significantly beef up Peloton’s value.</p><p>Peloton’s business model is in flux <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2U13I5\" data-type=\"storyId\" data-story-id=\"nL4N2U13I5\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span>] after a surge in bike sales during 2020 and 2021 came to a halt, and the company experienced a backup in its warehouses. The company’s operations consumed $561 million more cash than they made in the last-reported quarter. Chief Executive John Foley <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2SN3BT\" data-type=\"storyId\" data-story-id=\"nL4N2SN3BT\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> has said the environment is only getting harder. </p><p>Amazon might not be an expert at making connected exercise bikes, but it could offer customer growth on steroids. Andy Jassy’s firm has more than 200 million Prime members, compared to the 3 million who plug into Peloton. Its users already pay monthly for movies, books, and rapid retail gratification. Amazon could layer on Peloton’s products while trimming its marketing and sales budget, which ate up almost a quarter of its $3.1 billion in sales last year. </p><p>Say Amazon can sell more of Peloton’s digital subscriptions, which go for $12.99 monthly. That’s less than the $39 paid by those who also take Peloton’s bikes and treadmills. But digital customers don’t come with high costs, which makes that business scalable. Overall subscriptions have gross profit margins of around 62% while the gross profit for Peloton’s connected fitness products is around 29%. </p><p>If 10 million Amazon subscribers took a Peloton subscription, with a 50% margin, it would bring Foley’s firm an extra $800 million a year in pre-tax profit. Halving sales and marketing costs adds on another $365 million. Taxed and capitalized, it’s equivalent to $8 billion of value, double Peloton’s market capitalization based on Friday’s close. In fitness lingo, that’s probably the fastest way to bulk up.</p><p>Follow <a href=\"https://twitter.com/thereallsl\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@thereallsl</a> on Twitter</p><p><br/></p><p>CONTEXT NEWS</p><p>- Peloton Interactive has received interest from potential buyers including Amazon.com, according to a Reuters report on Feb. 4 citing a person familiar with the matter. The Financial Times reported on the same day that Nike might be a potential bidder. </p><p>- Shares of Peloton were up 25% to $30.83 at 9:49 a.m (1449 GMT).</p><p><br/></p><p class=\"tr-signoff\"> (Editing by John Foley and Sharon Lam)</p><p class=\"tr-contactinfo\">((For previous columns by the author, Reuters customers can click on <a href=\"reuters://REALTIME/verb=Headlines/ric=SILVA/\" data-type=\"newsExpression\" data-expression=\"SILVA/\" translate=\"no\" dir=\"ltr\">SILVA/</a> <br/> SIGN UP FOR BREAKINGVIEWS EMAIL ALERTS <a href=\"https://bit.ly/BVsubscribe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://bit.ly/BVsubscribe</a> | <a href=\"mailto:Lauren.SilvaLaughlin@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Lauren.SilvaLaughlin@thomsonreuters.com</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: PELOTON-STOCK/TAKEOVER-BREAKINGVIEWS</p></div>"}