{"date": "2021-12-06 16:07:50+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        Co-authored by <a href=\"http://www.linkedin.com/in/vishjakka/?dtid=oblgzzz000659\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Vishwanath Jakka</a></p>\n                <p>\n        Applications are integral to our customers' businesses. Applications allow them to deliver many of their offerings and services. Delivering the best possible user experience can make their businesses, while a less-than-optimal experience can break them. Among other things, this means that it is critical to optimize underlying infrastructure, so applications have the power they need to deliver great user experiences.\n      </p>\n                <p>\n        One key tool Cisco provides to help our customers deliver optimal application experiences is <a href=\"https://www.cisco.com/c/en/us/products/cloud-systems-management/intersight-workload-optimizer/index.html?dtid=oblgzzz000659\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Cisco Intersight Workload Optimizer</a> (IWO). IWO delivers application resource optimization, providing a unified view of customer application environments. IWO continuously enables applications to get the resources they need to perform well-whether the application is running in public, private, or hybrid cloud environment-while also helping reduce costs.\n      </p>\n                <p>\n        Of course, to run their applications, many customers utilize Amazon Web Services' (AWS) public cloud infrastructure, whether deploying cloud-native or hybrid-cloud architectures. In fact, many AWS infrastructure customers buy software and services through AWS Marketplace. This marketplace provides a curated digital catalog that customers can use to find, buy, deploy, and manage third-party software, data, and services to build the applications and solutions they need to run their businesses.\n      </p>\n                <p>\n        Given all this, it made perfect sense for Cisco to make <a href=\"https://aws.amazon.com/marketplace/pp/prodview-vweajejerzptc?sr=0-1&amp;ref_=beagle&amp;applicationId=AWSMPContessa&amp;dtid=oblgzzz000659\" data-type=\"url\" class=\"tr-link\" translate=\"no\">IWO available</a> to AWS users through the AWS Marketplace.\n      </p>\n                <p>\n                  <strong>AWS Marketplace</strong>\n                </p>\n                <p>\n        Back in 2012, AWS launched its marketplace in response to customer needs for additional third-party software, data, and services to support applications and workloads running on AWS' public cloud infrastructures. Today, the <a href=\"https://aws.amazon.com/marketplace?dtid=oblgzzz000659\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Marketplace</a> lists more than 10,000 products- including AppDynamics, ASAv, CSR1Kv, Firepower NGFW Virtual, Secure Cloud Analytics, Thousand Eyes, and many others from Cisco-that span 50 categories from 1600+ third-party vendors. Currently, AWS Marketplace has more than 310,000 active global customers.<a>[1]</a></p>\n                <p>\n        AWS users buy from AWS Marketplace for two primary reasons: experience and incentives.\n      </p>\n                <p>\n        From an experience perspective, they buy because:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          They can easily buy, provision, and instantly gain value from purchases in areas such as security, application performance monitoring, optimization, and networking.\n        </li>\n                  <li>\n          There is a large and expanding portfolio of available software and services to support their applications and workloads running on AWS cloud.\n        </li>\n                  <li>\n          Public cloud is transforming procurement. With traditional, legacy processes, hardware and software procurement is centralized. With public cloud, procurement is completely decentralized; individual buyers make their purchases independently. AWS Marketplace offers companies a single platform to manage and pay for their software and services purchases.\n        </li>\n                </ul>\n                <p>\n        From an incentive perspective, they buy because:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          It's much easier to stay with AWS and buy on the marketplace, rather than buying somewhere else and trying to bring those licenses to AWS through a BYOL model\n        </li>\n                  <li>\n          AWS offers flexible buying options with different levels of discounts\n        </li>\n                  <li>\n          Software purchases made on AWS Marketplace \"burn down\" customers' committed spends\n        </li>\n                </ul>\n                <p>\n                  <strong>Enterprise Committed Spend Discount Program applies to IWO purchases from AWS Marketplace</strong>\n                </p>\n                <p>\n        This third incentive is especially relevant to enterprise customers. Essentially, when a customer makes a committed spend on the AWS Marketplace through its Enterprise Discount Program (EDP), the customer is eligible for contractually outlined discounts in exchange for the spend commitment.\n      </p>\n                <p>\n        The key point here is that customers can apply purchases they make in the AWS Marketplace- such as buying Cisco IWO-against their spend commitments. In general, for every two dollars spent on the AWS marketplace, one dollar is applied to the committed spend.\n      </p>\n                <p>\n        And Cisco IWO is a great choice for AWS users. Not only does IWO help them ensure that their applications continue to deliver optimal user experiences, but it also delivers credit against their EDP commitments.\n      </p>\n                <p>\n                  <strong>Cisco Full-Stack Observability (FSO)</strong>\n                </p>\n                <p>\n        IWO is part of Cisco's <a href=\"https://www.cisco.com/c/en/us/solutions/full-stack-observability.html?dtid=oblgzzz000659\" data-type=\"url\" class=\"tr-link\" translate=\"no\">full-stack observability</a> (FSO) solution that also includes AppDynamics and ThousandEyes. After all, if you look at newer applications, they often leverage services and data from multiple clouds, SaaS properties, on-premises infrastructure, and the edge. In many ways, today's modern application is no longer a single entity, but rather a mesh of many services. AWS users can utilize Cisco FSO to gain the visibility and insights they need to take action when an application needs help. And better yet, IWO, AppDynamics, and ThousandEyes are all available on AWS Marketplace where purchases can all be applied against EDP commitments.\n      </p>\n                <p>\n        Why do customers want to buy Cisco on AWS marketplace?\n      </p>\n                <p>\n        In general, there are three fundamental reasons why customers should consider buying Cisco products on AWS marketplace:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          As market leaders, Cisco and AWS inspire trust in the quality of the solution a customer buys\n        </li>\n                  <li>\n          By providing solutions that are easily purchased, deployed, and managed through AWS Marketplace, the complexity of deploying solutions in the cloud is significantly reduced\n        </li>\n                  <li>\n          By offering a trusted solution that reduces complexity, we enable customers to further innovate, ultimately supporting their growth and profitability\n        </li>\n                </ul>\n                <p>\n        In other words, Cisco products that are sold in the AWS Marketplace offer a tremendous value proposition to customers who run applications on AWS.\n      </p>\n                <p>\n        And as mentioned earlier, to help optimize resources for your applications, <a href=\"https://aws.amazon.com/marketplace/pp/prodview-vweajejerzptc?sr=0-1&amp;ref_=beagle&amp;applicationId=AWSMPContessa&amp;dtid=oblgzzz000659\" data-type=\"url\" class=\"tr-link\" translate=\"no\">IWO is now available on AWS Marketplace</a>.\n      </p>\n                <p>\n        Cisco is also offering a <a href=\"https://www.cisco.com/c/en/us/solutions/cloud/iwo-trial.html?ccid=cc001268&amp;oid=trlcsm022053&amp;dtid=oblgzzz000659\" data-type=\"url\" class=\"tr-link\" translate=\"no\">45-day free IWO trial on AWS</a>. Also consider <a href=\"https://www.cisco.com/c/en/us/products/cloud-systems-management/intersight-workload-optimizer/index.html?dtid=oblgzzz000659\" data-type=\"url\" class=\"tr-link\" translate=\"no\">learning more about IWO</a>, as well as <a href=\"https://www.cisco.com/c/en/us/solutions/full-stack-observability.html?dtid=oblgzzz000659\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Cisco's Full Stack Observability</a> solution.\n      </p>\n                <p>\n                  <span>We'd love to hear what you think. Ask a Question, Comment Below, and Stay Connected with #CiscoPartners on social!</span>\n                </p>\n                <p>\n                  <strong>Cisco Partners Social Channels<br/></strong>\n                  <a href=\"https://www.facebook.com/CiscoPartners?dtid=oblgzzz001087\">\n                    <span>\n                      <strong>Facebook</strong>\n                    </span>\n                  </a>\n                  <a href=\"https://twitter.com/CiscoPartners?dtid=oblgzzz001087\">\n                    <span>\n                      <strong>Twitter</strong>\n                    </span>\n                  </a>\n                  <a href=\"https://www.linkedin.com/showcase/cisco-partners?dtid=oblgzzz001087\">\n                    <span>\n                      <strong>LinkedIn</strong>\n                    </span>\n                  </a>\n                </p>\n                <p>\n                  <a>[1]</a> AWS Marketplace: <a href=\"https://aws.amazon.com/mp/marketplace-service/overview\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://aws.amazon.com/mp/marketplace-service/overview</a>/\n      </p>\n                <p>\n        Share:\n      </p>\n                <br/>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://blogs.cisco.com/partner/cisco-intersight-workload-optimizer-available-on-aws-marketplace\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Cisco Systems Inc.</strong> published this content on <strong>06 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>06 December 2021 16:07:50 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Cisco Systems Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Cisco-Systems-Inc.</p></div>"}