{"date": "2022-01-25 19:33:46.926000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon and PayPal are among the companies best positioned to take advantage of future cybersecurity disruption in the cards &amp; payments industry, our analysis shows.</p><p>The assessment comes from GlobalData's Thematic Research ecosystem, which ranks companies on a scale of one to five based on their likelihood to tackle challenges like cybersecurity and emerge as long-term winners of the cards &amp; payments sector.Amazon, for example, has advertised for 3,168 new cybersecurity jobs from January 2021 to December 2021; has completed three deals related to cybersecurity with other companies; and mentioned cybersecurity in company filings 76 times.PayPal indicated good levels of AI investment, with the company looking for 1,185 new cybersecurity jobs since January 2021; completing two deals; and mentioning cybersecurity in filings 72 times.The table below shows how GlobalData analysts scored the biggest companies in the cards &amp; payments industry on their cybersecurity performance, as well as the number of new cybersecurity jobs, deals, patents and mentions in company reports since January 2021.!function(){\"use strict\";window.addEventListener(\"message\",(function(e){if(void 0!==e.data[\"datawrapper-height\"]){var t=document.querySelectorAll(\"iframe\");for(var a in e.data[\"datawrapper-height\"])for(var r=0;rThe final column in the table represents the overall score given to that company when it comes to their current cybersecurity position relative to their peers. A score of five indicates that a company is a dominant player in this space, while companies that score less than three are vulnerable to being left behind. These can be read fairly straightforwardly.The other datapoints in the table are more nuanced, showcasing recent cybersecurity investment across a range of areas over the past year. These metrics give an indication of whether cybersecurity is at the top of executives' minds now, but high numbers in these fields are just as likely to represent desperate attempts to catch-up as they are genuine strength in cybersecurity.For example, a high number of mentions of cybersecurity in quarterly company filings could indicate either the company is reaping the rewards of previous investments, or it needs to invest more to catch up with the rest of the industry. Similarly, a high number of deals could indicate that a company is dominating the market, or that it is using mergers and acquisitions to fill in gaps in its offering.This article is based on GlobalData research figures as of 13 January 2022. For more up-to-date figures, check the GlobalData website.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}