{"date": "2021-01-29 11:48:13.845000+00:00", "ticker": "AAF", "mrkt_info": {"open": 80.0, "close": 79.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Airtel Africa, an arm of Bharti Airtel, on Friday posted a profit after tax of $116 million in the three months to December, up 13.1 per cent from the corresponding period last year, buoyed by data and mobile money services.</p><p>The company had reported a profit after tax of $103 million in the same period last fiscal. In the nine-month period ended December 31, 2020 Airtel\u0092s Africa operations reported net profit of $261 million, down 21.1 per cent from $331 million reported in the corresponding period previous year.</p></div><div class=\"tr-npp-body\"><p>The underlying revenue during the period, rose 13.8 per cent to $2,870 million.</p><p>\"In part this is due to our continued delivery of strong customer growth in Q3, despite the introduction mid-December of additional customer registration requirements in Nigeria. This has meant a temporary halt to the ability of all operators in the country to onboard new customers. But we are working closely with the government to ensure that all our subscribers provide their valid National Identification Numbers (NINs) and update their SIM registration records, such that disruption is minimized,\" Raghunath Mandava, CEO, Airtel Africa said.</p><p>Mobile money revenue during the quarter grew by 41.1 per cent and data revenue was up by 27 per cent in constant currency terms.</p><p>Constant currencies are exchange rates used to eliminate the effect of fluctuations when calculating financial performance numbers for publication in financial statements.</p><p>Profit after tax for the nine-month period ended 31 December 2020 is lower due to -- higher exceptional benefits of $51 million in the prior period (excluding tax exceptional item), other finance costs in the prior period included a derivative gain of $47 million and higher tax in nine-month period ended 31 December 2020.</p><p>ALSO READ: Airtel steals a march on 5G rivals in India, conducts live testing of service</p><p>It also included a share of gain from joint ventures and associate of $0.5m ($0.1m in the prior period).</p><p>Depreciation and amortisation increase of $51 million is due to investment in capex and additional spectrum in Nigeria.</p><p>Operating exceptional items in December 2020 includes exceptional revenue on account of a one-time settlement in Niger amounting to $20 million.</p><p>Operating profit includes $5.8 million CSR (Corporate social responsibility) expense in the nine-month period ended 31 December 2020 and $3.8 million in the prior period.</p><p>Airtel Africa\u0092s user base across 14 African countries grew 11 per cent to 118.9 million, with increased penetration across mobile data (customer base up 23.5 per cent) and mobile money services (customer base up 29 per cent). 2.5 million customers were added in Q3, the company said.</p><p>Earnings before interest, tax, depreciation and amortisation (EBITDA) for the nine months was $1,297 million, up 22.5 per cent, in constant currency.</p><p>\u0093The opportunities for sustainable profitable growth from our under penetrated markets for both mobile and mobile money services remain hugely attractive, and we are confident of continuing to deliver on our growth strategy,\" Mandava added.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}