{"date": "2021-12-04 15:08:18.495000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3437.36, "close": 3427.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Mumbai (Maharashtra) [India], December 3 (ANI/BusinessWire India): Infor, the industry cloud company, today announced that Amazon Web Services (AWS) has awarded Infor the AWS Industry Solution Independent Software Vendor (ISV) Partner of the Year award.</p><p>Mumbai (Maharashtra) [India], December 3 (ANI/BusinessWire India): Infor, the industry cloud company, today announced that Amazon Web Services (AWS) has awarded Infor the AWS Industry Solution Independent Software Vendor (ISV) Partner of the Year award. Announced at the annual <a href=\"https://reinvent.awsevents.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS re:Invent</a> conference in Las Vegas, Nevada, the award recognizes Infor's performance and commitment to helping customers drive innovation on AWS. Kevin Samuelson, Infor CEO, said, \"We are thrilled to be named as the 2021 AWS Industry Solution ISV Partner of the Year. We believe our distinct competitive advantage centers around our ability to provide deep, industry-specific solutions to our customers, which can help them continuously innovate and grow their businesses. Our work with AWS is critical to our ability to deliver scalable, secure multi-tenant cloud solutions that are designed to help our customers achieve successful business outcomes and sustained operational advantage.\" \"The AWS Industry Solution ISV Partner of the Year award is an opportunity for us to recognize the work of select AWS Partners around the globe who deliver strong results across industries and help our customers transform their businesses,\" said Flemming Kongsberg, director, Global ISV Partner Management, AWS. \"We are excited to award Infor with this award, as they continue to lean into the AWS Partner Network and drive deep partner innovation. Infor drives industry-level focus areas and migrations for long-standing AWS customers, allowing them to focus on modernizing business models to drive customer success. We congratulate them on this well-deserved recognition.\" The 2021 AWS Industry Solution ISV Partner of the Year award acknowledges Infor's work with AWS to deliver strong results and to help customers -- in industries such as manufacturing, distribution, healthcare, food and beverage, automotive, aerospace and defense, and high tech -- leverage cloud technologies to transform their businesses. Infor's innovative cloud technologies, which are designed to work seamlessly with AWS, can give organizations the power and responsiveness to stay ahead in competitive business environments. Infor's cloud solutions deliver industry-specific capabilities without extensive customizations or integrations. These solutions combine Infor's cloud platform, built on infrastructure services from AWS, and Infor Operating Service (OS) -- enabling cloud applications to work collaboratively with each other and with legacy software. Businesses today are actively looking for ways to modernize their value chain to achieve complete digitalization. To help unlock new opportunities and accelerate business growth, Infor in association with AWS have organized a series of summits, featuring key insights from industry leaders and customer interactions. Learn more about each summit and register below to explore how Infor's strategic partnership with AWS is facilitating digital transformations for Indian businesses. Mint Discrete Manufacturing Summit Date: December 13, 2021 Time: 2:00 - 3:30 pm Participating customers: <a href=\"https://www.kent.co.in/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Kent RO Systems</a> and <a href=\"https://www.isgec.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">ISGEC Heavy Engineering Ltd</a> . Registration Link: <a href=\"https://ht4biz.hindustantimes.com/mint-dms\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://ht4biz.hindustantimes.com/mint-dms</a> CNBC TV18 Supply Chain Excellence Summit Date: December 14, 2021 Time: 3:00 - 4:30 pm Participating customers: <a href=\"https://www.stellarvaluechain.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Stellar Value Chain Solutions</a> Registration Link: <a href=\"https://www.cnbctv18.com/ms/supply-chain/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.cnbctv18.com/ms/supply-chain/</a> </p></div><div class=\"tr-npp-body\"><p>This story is provided by BusinessWire India. ANI will not be responsible in any way for the content of this article. (ANI/BusinessWire India)</p><p>Copyright © 2021 aninews.in All rights reserved. Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SyndiGate. All Rights Reserved.</p></div>"}