{"date": "2022-02-07 20:07:58.830000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Peloton has struggled in recent months with lockdown over, negative press and cheaper models coming to the marketPeloton's fortunes race downhill as fitness fans return to gyms</p><p>Peloton is drawing interest from potential suitors including Amazon, the Wall Street Journal <a href=\"https://on.wsj.com/3AVMIf7\" data-type=\"url\" class=\"tr-link\" translate=\"no\">reported</a> on Friday, citing people familiar with the matter.</p></div><div class=\"tr-npp-body\"><p>The at-home exercise bike maker's shares surged 40% in extended trading on Friday.</p><p>Meanwhile, the <a href=\"https://www.ft.com/content/8ae3240b-8c09-48e4-bc2c-b7a9e4c00c51\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Financial Times</a> reported late on Friday that Nike was also evaluating a bid for Peloton, citing people briefed on the matter, who said the considerations were preliminary and Nike had not held talks with Peloton.</p><p>Peloton and Nike did not immediately respond to a Reuters request for comment, while Amazon declined to comment.</p><p>Last month, the activist investor Blackwells Capital called on Peloton's board to remove the company's chief executive, John Foley, and put the company up for sale.</p><p>Peloton's success soared during the pandemic while gyms were closed, attracting a well-heeled clientele who could shell out thousands for its signature stationary bike and live-streamed workouts. (The bikes start at $1,495, while the newest model costs $2,495.)</p><p>But as gyms reopen and after a wave of <a href=\"https://www.nytimes.com/2021/12/11/arts/television/peloton-sex-and-the-city.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">negative press</a> , Peloton has struggled to keep its numbers up. <a href=\"https://www.nytimes.com/2021/03/03/technology/personaltech/peloton-alternatives-at-home-workout.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Less expensive bike models</a> present competition, especially since users can pair them with programming from the Peloton app. And in May, the company was forced to <a href=\"https://www.theguardian.com/us-news/2021/may/05/peloton-recalls-two-treadmills-us-safety-concerns-child-dies\" data-type=\"url\" class=\"tr-link\" translate=\"no\">recall</a> its two popular treadmills after dozens of reported injuries and the death of a child.</p><p>The company has lost roughly $20bn in value since November, when it hinted that demand for its exercise bikes and treadmills was slowing faster than expected. The company's market value is down to about $8bn from its high of $50bn last year.</p><p>Peloton is considering lay offs to recover lost revenue. \"We now need to evaluate our organization structure and size of our team, with the utmost care and compassion,\" John Foley, Peloton's co-founder and chief executive, wrote <a href=\"https://www.onepeloton.com/press/articles/a-note-from-john-foley-co-founder-and-ceo\" data-type=\"url\" class=\"tr-link\" translate=\"no\">in January</a> . \"And we are still in the process of considering all options as part of our efforts to make our business more flexible.\"</p><p>According to the Wall Street Journal report, Amazon has been speaking to advisers about a potential deal. However, there was no guarantee the e-commerce giant will follow through with an offer or that Peloton would be receptive, it added.</p><p>Peloton could be an appealing opportunity for Amazon to expand its health and wellness presence. In 2020, the online retailer made its first major play in the wellness hardware market by launching its <a href=\"https://press.aboutamazon.com/news-releases/news-release-details/introducing-amazon-halo-and-amazon-halo-band-new-service-helps\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Halo</a> band, which tracks users' exercise and sleep.</p><p>Acquiring Peloton could be financially in reach for Amazon, which reported stellar <a href=\"https://www.theguardian.com/technology/2022/feb/03/amazon-profits-surge-cost-increase-prime-membership\" data-type=\"url\" class=\"tr-link\" translate=\"no\">quarterly profits of $14.32bn</a> on Thursday. Amazon's biggest acquisition to date was grocery chain Whole Foods, which it snapped up <a href=\"https://www.theguardian.com/business/2017/jun/16/amazon-buy-whole-foods-market-organic-food-fresh\" data-type=\"url\" class=\"tr-link\" translate=\"no\">for $13.7bn</a> in 2017.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 theguardian.com-NonSyndicated</p></div>"}