{"date": "2022-01-22 16:57:23.370000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2852.86, "close": 2799.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Every day, we scour Amazon to find the best deals available. Whether it's something for your kitchen or top-rated tech to give your smart home an upgrade, the online shopping giant offers some of the best prices on a  <span>very</span> wide range of items. Whatever you need, Amazon has you covered.</p></div><div class=\"tr-npp-body\"><p><span><span>Get deals and shopping advice delivered straight to your phone.</span> Sign up for text message alerts from the experts at Reviewed.</span> </p><p>Below, you'll find our top Amazon deals right now, including our favorite robot vacuum, a convenient kitchen thermometer and a top-rated tablet, all of which have been vetted by our team of deals experts to make sure they're \"best of web\" prices. </p><p>► <span>Valentine's Day gifts: </span> 20 amazing gifts for women that are romantic and thoughtful.</p><p>► <span>Amazon to open its first in-person clothing store.</span> What we know about the new Amazon Style.</p><p>If you're not already an Amazon Prime subscriber, you can sign up for a 30-day membership for free. An Amazon Prime subscription gets you free two-day shipping and tons of other benefits for $12.99 a month ($6.49 for students and $5.99 for those receiving qualifying government assistance).</p><p class=\"tr-npp-section-title\">The best Amazon deals of the day</p><p><big>1. Save up to 39%: These top-rated robot vacuums</big> </p><p>If you're tired of constantly vacuuming up crumbs around your house, a robot vacuum could help. Luckily, right now, you can scoop up some of our favorite iRobot Roombas for deep discounts at Amazon. The iRobot Roomba j7+ is the best robot vacuum we've ever tested, and right now, you can take home the self-emptying Roomba for just $599—$250.99 off the full $849.99 list price and the lowest price we've ever seen. We think this robot vacuum is iRobot's best Roomba yet thanks to its excellent navigation and cleaning capabilities. In testing, the j7+ easily maneuvered around furniture and (yes) dog poop and picked up just as much dirt as a full-sized vacuum. </p><p><span>Save up to 39% on iRobot Roomba j7+ and j7 Robot Vacuums</span> </p><p><big>2. Under $15: This top-rated kitchen thermometer</big> </p><p>Make your next baking project all the easier with the ThermoPro TP19H digital meat thermometer. Normally priced at $24.99, you can get this four-inch tool for $14.53 with the already-active 39% discount and an additional 5% coupon on the product page. ThermoPro makes several of our favorite kitchen thermometers, so we're sure this compact model will please. Designed to deliver fast and accurate readings, this thermometer features a backlit digital display and, according to the brand, can run for up to 3,000 hours on a single battery.  </p><p><span>Get the ThermoPro TP19H Digital Meat Thermometer for $14.53 (Save $10.46)</span> </p><p><big>3. Up to 50% off: Some of our favorite tablets</big> </p><p>The best tablets available don't come cheap, but right now you can get one of our favorites for less than $140. Amazon's Fire HD 10 usually starts from $179.99, but you can get one with a 32 gigabyte capacity for 22% off right now, bringing the price down to $139.99. We ranked the Fire HD 10 as one of the best tablets we've ever tested thanks to its large display, which is capable of playing 1080p-resolution videos with reasonably true colors and black levels, and the relatively quick charging time. Though it doesn't have the strongest app collection compared with the competition from Apple and Google, it's hard to beat its current discounted price. Meanwhile, if you're after even more tablets, you can shop other Amazon models at up to 50% off.</p><p><span>Save up to 50% on Amazon Fire Tablets</span> </p><p><big>4. Under $30: This convenient USB wall charger</big> </p><p>Keep all of your essential electronics fully charged with the Addtam two pack USB wall charger, down from $34.99 to just $29.74 today. Designed to protect your gadgets from power surges, this wall adapter features five outlets, three USB A ports and one USB C port—perfect for powering up to nine devices at once. The 9-in-1 wall adapter easily fits over standard duplex outlets and is outfitted with a surge protected indicator light and fire-resistant casing.</p><p><span>Get the Addtam Two Pack USB Surge Protector Wall Charger for $29.74 (Save $5.25)</span> </p><p><big>5. 15% off: This best-selling bathroom scale</big> </p><p>Keep a close eye on your fitness progress this year by picking up the Etekcity digital body weight bathroom scale available for as much as 15% off, at $16.88. The developer says its device is made with a durable tempered glass and high-precision sensors for the most accurate weight readings. Outfitted with an easy-to-read digital display, the scale can measure up to 400 pounds and display weight in both pounds and kilograms. </p><p><span>Get the Etekcity Digital Body Weight Bathroom Scale from $16.88 (Save $3)</span> </p><p class=\"tr-npp-section-title\">The best Amazon deals from this week</p><p><big>1. Amazon Fire TV Omni Series</big> </p><p>Give your home's media room a major visual upgrade with an Amazon Fire TV. Right now you can shop the Omni series for as much as 30% off at Amazon. For instance, you can take home the 50-inch Amazon Fire Omni series 4K UHD smart TV for just $364.99—$145 off the full $509.99 list price. While we weren't thrilled with the TV's picture performance in testing, we found the TV to be easy to set up and were impressed with its Alexa integration. If you're looking for the latest device to connect to your Alexa, this TV fits the bill. </p><p><span>Save up to 30% on Amazon Fire TV Omni Series</span> </p><p><big>2. Hertzko Self-Cleaning Slicker Brush for Dogs and Cats</big> </p><p>Keep your pet's fur silky smooth with the Hertzko self-cleaning slicker brush, down from $29.99 to just $17.99 right now. An Amazon customer-favorite, this brush can be used on both dogs and cats to gently remove matted fur, tangles and dander. Made with retractable bristles for easy cleaning, the best-selling brush is designed to groom your pet's undercoat without scratching or irritating their skin. </p><p><span>Get the Hertzko Self-Cleaning Slicker Brush for Dogs and Cats for $17.99 (Save $12)</span> </p><p><big>3. Takeya Two-Quart Deluxe Cold Brew Coffee Maker</big> </p><p>Skip the Starbucks line and make fresh and flavorful cups of cold brew from home with the Takeya two-quart deluxe cold brew coffee maker. According to the brand, the brewer makes less acidic coffee than traditional machines and has the capacity to make four servings at once. Better still, the pitcher can also withstand heat, so you can use it to make cold or hot cups of joe. Usually retailing at $34.99, you can take home the top-rated coffee maker for as little as $23.40 today, after a 33% price cut. </p><p><span>Get the Takeya Two-Quart Deluxe Cold Brew Coffee Maker from $23.40 (Save $10.99 to $13)</span> </p><p><big>4. Philips Norelco Shaver 9100</big> </p><p>Keep your stubble in check with the Philips Norelco Shaver 9100 on sale at Amazon today. Normally priced at $149.95, this cordless electric trimmer is now listed for $109.95 thanks to a 27% discount. Philips says the shaver features V-Track Precision Blades in its heads that move in eight directions to catch hair along every curve of your face. The brand also promises 50 minutes of cordless shaving on each charge—and a battery that's ready to go after just one hour of charging.</p><p><span>Get the Philips Norelco Shaver 9100 for $109.95 (Save $40)</span> </p><p><big>5. BalanceFrom 40-Pound All-Purpose Weight Set</big> </p><p>Build some major body strength this year with this BalanceFrom 40-pound weight set on sale at Amazon today. Typically listed for $45.64, you can get this pair of vinyl-coated dumbbells for 49% off at $23.39. The brand says the fitness tools come with four collar locks to help keep the provided weights secure no matter how tough your home fitness routine is. The vinyl coating is also meant to keep the weights from rusting over time. </p><p><span>Get the BalanceFrom 40-Pound All-Purpose Weight Set for $23.39 (Save $22.25)</span> </p><p class=\"tr-npp-section-title\">Other noteworthy Amazon deals we found </p><ul class=\"bulleted-list arrowlist\"><li>Save up to 20% on Shark Vacuums and Air Purifiers</li><li>Save up to 20% on Clorox Cleaning Supplies</li><li>Save up to 50% on select Nintendo Switch games</li><li>Stasher Platinum Silicone Food Grade Reusable Storage Bag 2-Set for $7.93 (Save $6.06)</li><li>iHealth 2020 No Touch Forehead Thermometer for $14.52 (Save $3.94)</li><li>Amazon Fire TV Stick Lite for $18.99 (Save $11)</li><li>Chamberlain myQ Smart Garage Hub and Sensor for $19.98 (Save $10)</li><li>Bodum Melior Gooseneck Electric Water Kettle from $26.99 (Save $8)</li><li>Tribit XSound Go Portable Bluetooth Speaker from $27.74 with coupon (Save $18.25)</li><li>Elechomes EPI081 Air Purifier for $29.99 (Save $30)</li><li>Olay Regenerist Retinol 24 Max Moisturizer for $32.94 (Save $20.05)</li><li>Sporzon! Rubber Encased Hex Dumbbells from $34.99 (Save $9.90 to $67.56)</li><li>Sensyne 10-Inch Ring Light for $38.99 (Save $11)</li><li>JavaPresse Manual Coffee Grinder for $39.99 (Save $6)</li><li>Corsair HS60 Pro Gaming Headset from $39.99 (Save $30)</li><li>Eufy BoostIQ RoboVac 11S Robot Vacuum Cleaner for $159.99 (Save $40 to $70)</li><li>Apple AirPods Pro for $189.99 (Save $59.01)</li><li>Philips Premium Airfryer XXL from $199.95 (Save $100.56 to $150)</li><li>iRobot Roomba i3+ for $399 (Save $200.99)</li><li>Hisense Class H9 Quantum Series Android 4K ULED Smart TV from $499.99 (Save $78.85 to $150)</li><li>Echelon EX-5 Smart Connect Fitness Bike for $800.99 (Save $399)</li><li>2020 Apple 13-Inch MacBook Pro from $1,199 (Save $100)</li> </ul><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Updated daily: Here are the 10 best Amazon deals today</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}