{"date": "2022-01-19 15:11:05.811000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>STELLANTIS N V (\"STLA-N\")\n- Celebrates First Anniversary as it Speeds Transformation\n- to Sustainable Mobility Tech Company\n\n     *  One fast year as a new company, committed to capturing the new era\nof mobility opportunities, offering innovative, agile and efficient\nsolutions that will change the way the world moves\n     *  Building a sound foundation, while delivering impressive H1 results\nand forming strategic partnerships\n     *  A bright future ahead: Long-term strategic plan to be announced on\nMarch 1, 2022\n\n     Born from the bold and visionary spirit of its founding companies,\nStellantis N.V. was created to shape the future of mobility with innovative\nand sustainable solutions. Today, Stellantis marks its first anniversary\nwith a review of the major milestones accomplished during the past 12\nmonths.\n\n     \"Our industry is entering an exciting new era, fueled by our\ncustomers' ever increasing digital lifestyles,\" said Carlos Tavares, CEO of\nStellantis. \"It is no coincidence that Stellantis was born precisely when\nour world requires a new kind of spirit, one that supports this human\nimperative by providing clean, connected, affordable and safe freedom of\nmobility for all. I'm grateful to every Stellantis employee for their daily\ncontributions to building our common community and achieving greatness as\nwe pave the way for a bright future.\"\n\n     In the first year, Stellantis started a journey to lead the way the\nworld moves, building its foundation while achieving impressive milestones.\n\n     *  Defining the Company's Purpose - Powered by our diversity, we lead\nthe way the world moves - and Values, pledging to care for the planet, its\nemployees and the communities in which it operates\n     *  Quickly implementing the operational governance and leadership team\nthat has already demonstrated its efficacy\n     *  Successfully launching more than 10 new products in 2021 including:\nCitroen C4, Fiat Pulse, DS 4, DS 9, Jeep(sub)(R)(/sub) Commander, Grand\nCherokee, Grand Cherokee L, Grand Wagoneer, Wagoneer, Maserati MC20, Opel\nMokka, Rocks-e and Peugeot 308\n     *  Planning investments of more than (euro)30 billion through 2025 to\nexecute electrification and software strategies to support the 14 iconic\nbrands and two mobility brands as the Company shifts to becoming a\nsustainable mobility tech company while building an innovative and powerful\necosystem with strategic partnerships\n     *  Unveiling an ambitious electrification strategy with 33 electrified\nvehicles available now, including fuel cell vans, and eight more battery\nelectric vehicles coming in the next 18 months, and building partnerships\nwith Automotive Cells Company, Factorial Energy, LG Energy Solution,\nSamsung SDI and Vulcan Energy\n     *  Accelerating its software transformation through game-changing\ncollaborations with Amazon, BMW, Foxconn and Waymo\n     *  Strengthening global financing operations in the United States,\nacquiring First Investors Financial Services and partnerships across Europe\nwith BNP Paribas Personal Finance, Credit Agricole Consumer Finance and\nSantander Consumer Finance\n     *  Preparing the long-term strategic plan to be unveiled on March 1\n\n     A bright future ahead\n\"We still have a lot of work ahead of us, but the Stellantis community is\nwell on its way and so the race is on,\" said Carlos Tavares. \"Stellantis\nwill make the difference in the demanding environment in which we operate.\nIt is our duty, and thanks to our competitive mindset, I am confident that\nour stars will continue to shine.\"\n\n     Stellantis' journey started just 12 months ago with a well-established\npresence in three powerful regions - Europe, North America and South\nAmerica - in addition to significant untapped potential in important\nmarkets such as China, Africa, the Middle East, Oceania and India. With\nindustrial operations in nearly 30 countries, the Company has the ability\nto efficiently meet and exceed consumer expectations and deliver vehicles\nand services of unparalleled quality in more than 130 markets.\n\n     The journey to Stellantis\n\n     *  Dec. 18, 2019: Groupe PSA and FCA signed a 50/50 merger agreement\n     *  July 15, 2020: PSA and FCA revealed the name of the future company:\nStellantis\n     *  Sept. 14, 2020: Signed an amendment to the merger agreement, taking\ninto account the economic impact of the COVID-19 pandemic\n     *  Sept. 29, 2020: FCA and PSA announced the composition of the\nStellantis Board membership\n     *  Nov. 9, 2020: Reveal of Stellantis logo\n     *  Jan. 4, 2021: General Meetings of PSA and FCA shareholders approve\nthe merger of the companies\n     *  Jan. 16, 2021: Completed merger of Peugeot S.A. and Fiat Chrysler\nAutomobiles N.V.\n     *  Jan. 17, 2021: Combined company renamed Stellantis N.V.\n(Stellantis)\n     *  Jan. 18, 2021: Stellantis Opening Bell ceremonies on Euronext\nParis, France and Borsa Italiana Milan, Italy\n     *  Jan. 19, 2021: Stellantis Opening Bell ceremony on the New York\nStock Exchange\n\n     About Stellantis\n\n     Stellantis N.V. (NYSE / MTA / Euronext Paris: STLA) is one of the\nworld's leading automakers and a mobility provider. Its storied and iconic\nbrands embody the passion of their visionary founders and today's customers\nin their innovative products and services, including Abarth, Alfa Romeo,\nChrysler, Citroen, Dodge, DS Automobiles, Fiat, Jeep(sub)(R)(/sub), Lancia,\nMaserati, Opel, Peugeot, Ram, Vauxhall, Free2move and Leasys. Powered by\nour diversity, we lead the way the world moves - aspiring to become the\ngreatest sustainable mobility tech company, not the biggest, while creating\nadded value for all stakeholders as well as the communities in which it\noperates. For more information, visit www.stellantis.com.\n\n//st\n\n                                  @Stellantis   Stellantis   Stellantis\nStellantis\n\n Contact Information:\n\nContact: Valerie GILLOT + 33 6 83 92 92 96 -\n  valerie.gillot@stellantis.com communications@stellantis.com\nwww.stellantis.com\n\n//et\n\n     FORWARD-LOOKING STATEMENTS\n\n     This communication contains forward-looking statements. In particular,\nstatements regarding future events and anticipated results of operations,\nbusiness strategies, the anticipated benefits of the proposed transaction,\nfuture financial and operating results, the anticipated closing date for\nthe proposed transaction and other anticipated aspects of our operations or\noperating results are forward-looking statements. These statements may\ninclude terms such as \"may\", \"will\", \"expect\", \"could\", \"should\", \"intend\",\n\"estimate\", \"anticipate\", \"believe\", \"remain\", \"on track\", \"design\",\n\"target\", \"objective\", \"goal\", \"forecast\", \"projection\", \"outlook\",\n\"prospects\", \"plan\", or similar terms. Forward-looking statements are not\nguarantees of future performance. Rather, they are based on Stellantis'\ncurrent state of knowledge, future expectations and projections about\nfuture events and are by their nature, subject to inherent risks and\nuncertainties. They relate to events and depend on circumstances that may\nor may not occur or exist in the future and, as such, undue reliance should\nnot be placed on them.\n\n      Actual results may differ materially from those expressed in\nforward-looking statements as a result of a variety of factors, including:\nthe impact of the COVID-19 pandemic, the ability of Stellantis to launch\nnew products successfully and to maintain vehicle shipment volumes; changes\nin the global financial markets, general economic environment and changes\nin demand for automotive products, which is subject to cyclicality; changes\nin local economic and political conditions, changes in trade policy and the\nimposition of global and regional tariffs or tariffs targeted to the\nautomotive industry, the enactment of tax reforms or other changes in tax\nlaws and regulations; Stellantis' ability to expand certain of their brands\nglobally; its ability to offer innovative, attractive products; its ability\nto develop, manufacture and sell vehicles with advanced features including\nenhanced electrification, connectivity and autonomous-driving\ncharacteristics; various types of claims, lawsuits, governmental\ninvestigations and other contingencies, including product liability and\nwarranty claims and environmental claims, investigations and lawsuits;\nmaterial operating expenditures in relation to compliance with\nenvironmental, health and safety regulations; the intense level of\ncompetition in the automotive industry, which may increase due to\nconsolidation; exposure to shortfalls in the funding of Stellantis' defined\nbenefit pension plans; the ability to provide or arrange for access to\nadequate financing for dealers and retail customers and associated risks\nrelated to the establishment and operations of financial services\ncompanies; the ability to access funding to execute Stellantis' business\nplans and improve its businesses, financial condition and results of\noperations; a significant malfunction, disruption or security breach\ncompromising information technology systems or the electronic control\nsystems contained in Stellantis' vehicles; Stellantis' ability to realize\nanticipated benefits from joint venture arrangements; disruptions arising\nfrom political, social and economic instability; risks associated with our\nrelationships with employees, dealers and suppliers; increases in costs,\ndisruptions of supply or shortages of raw materials, parts, components and\nsystems used in Stellantis' vehicles; developments in labor and industrial\nrelations and developments in applicable labor laws; exchange rate\nfluctuations, interest rate changes, credit risk and other market risks;\npolitical and civil unrest; earthquakes or other disasters; and other risks\nand uncertainties.\n\n      Any forward-looking statements contained in this communication speak\nonly as of the date of this document and Stellantis disclaims any\nobligation to update or revise publicly forward-looking statements. Further\ninformation concerning Stellantis and its businesses, including factors\nthat could materially affect Stellantis' financial results, is included in\nStellantis' reports and filings with the U.S. Securities and Exchange\nCommission and AFM.\n\n    Attachment\n\n\n\n                 *\n        20211219_Stellantis First Anniversary_EN_FINAL4\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201800298.MNPRE2201801713-07051420220119</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}