{"date": "2021-12-01 18:34:00.188000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>AWS Announces Three New Database Capabilities</b>\n</p><p class=\"bwalignc\">\n<span>Amazon RDS Custom gives customers a managed service for business applications that require database and operating system customization</span>\n</p><p class=\"bwalignc\">\n<span>Amazon DynamoDB Standard-Infrequent Access (Standard-IA) table class reduces DynamoDB costs by up to 60% for tables that store infrequently accessed data</span>\n</p><p class=\"bwalignc\">\n<span>Amazon DevOps Guru for RDS uses machine learning to better detect, diagnose, and resolve hard-to-find database-related performance issues in minutes not days</span>\n</p><p class=\"bwalignc\">\n<span>Mercado Libre, NetApp, and Amazon among customers and partners using new database capabilities</span>\n</p><p>\nToday, at AWS re:Invent, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), announced three new database capabilities that make it easier and more cost efficient for customers to scale and run the right databases for their job. Today’s announcements introduce a new managed database service for business applications that allows customers to customize the underlying database and operating system, a new table class for Amazon DynamoDB designed to reduce storage costs for infrequently accessed data, and a service that uses machine learning to better diagnose and remediate database-related performance issues. Together, these innovations make it easier and more cost effective for customers to manage data at scale.\n</p><p>\nAs a growing number of applications need to work with petabytes—or even exabytes—of data with low latency and high performance, a one-size-fits-all database no longer meets the needs of customers who require highly available, reliable, and performant ways to leverage and manage data at scale. To meet these demands, more and more customers are looking to choose the right database for their unique needs. AWS offers the broadest and deepest selection of specialized database engines, including DynamoDB for key-value databases, Amazon Neptune for graph databases, Amazon ElastiCache and Amazon MemoryDB for Redis for in-memory databases, Amazon DocumentDB for document databases, Amazon Keyspaces (for Apache Cassandra) for wide-column databases, Amazon Timestream for time series databases, and Amazon Quantum Ledger Database (Amazon QLDB) for ledger databases. AWS is also the best place to run open-source databases, which is why more than 100,000 customers choose to run their MySQL and PostgreSQL-compatible databases on Amazon Aurora and enjoy the performance and availability of the highest-grade commercial databases at one-tenth the cost. Many customers also choose to run commercial databases on AWS to take advantage of the superior scalability, security, and elasticity AWS provides. Amazon Relational Database Service (Amazon RDS) offers a fully managed relational database service that makes it easy to set up, operate, and scale Oracle and Microsoft SQL Server databases in the cloud. When it comes to databases, AWS offers the right tools for the job, with more than 15 purpose-built database engines that provide customers with high availability, performance, reliability, and security for a wide range of use cases. The three new database capabilities announced today deliver significant new features to give customers even more choice and higher performance at lower costs.\n</p><p>\n“Customers have told us they want databases that are optimized for their most important use cases to deliver flexible, scalable, and reliable user experiences without worrying about the resource-intensive burden of managing infrastructure or incurring excess costs,” said Raju Gulabani, Vice President of Databases and Analytics at AWS. “With today’s announcements, we’re excited to provide customers with even more flexibility and choice to easily improve database performance, optimize cost, and power their most business-critical applications. No one else in the industry can match the depth of capability and breadth of selection in databases offered by AWS, and we’re nowhere close to being done innovating for our customers.”\n</p><p>\n<b><span>Amazon RDS Custom gives customers a managed database service for business applications that require customization of the underlying database and operating system</span></b>\n</p><p>\nCustomers who want to run commercial databases like Oracle and Microsoft SQL Server in the cloud choose Amazon RDS because it is easy to set up, operate, and scale. With Amazon RDS, customers no longer need to worry about time-consuming administrative tasks like provisioning capacity, scaling, and backing up their data. However, some business applications require customization to their underlying Oracle and Microsoft SQL Server database environment and operating system (e.g. Microsoft Dynamics AX, Microsoft SharePoint, and Oracle PeopleSoft). Today, customers often run these applications in a self-managed environment (e.g. on Amazon EC2 or on-premises) so they can have full control over the underlying database environment and operating system. While self-managed deployments are highly configurable, customers must spend time on administrative tasks like hardware provisioning, database setup, patching, and backups. What customers running applications that require database and operating system customization want instead is to automate these undifferentiated administrative tasks to make it easier to run these applications on AWS.\n</p><p>\nAmazon RDS Custom automates the setup, operation, and scaling of the Oracle and Microsoft SQL Server databases that are tightly integrated with common business applications, while allowing customization to the database and underlying operating system these applications require. With Amazon RDS Custom, customers running these types of business applications no longer need to worry about time-consuming administrative tasks like provisioning and scaling hardware, database setup, patching, and backups. Customers can use Amazon RDS Custom to configure their database environment and underlying operating system to modify settings, install custom patches, and integrate third-party software to meet the requirements of their business applications (e.g. custom database minor versions, third-party security and diagnostic software, or specific file system configurations). Amazon RDS Custom automatically monitors the database environment and operating system to detect user-initiated configurations that impact the ability of Amazon RDS Custom to manage the database. If an issue is detected, Amazon RDS Custom will attempt to automatically resolve the issue. For configuration errors that cannot be automatically corrected, Amazon RDS Custom notifies the customer that corrective action is required and provides recommended steps for resolution. Customers can easily move their existing self-managed Oracle and Microsoft SQL Server databases that require specialized customizations to Amazon RDS Custom and no longer worry about having to manage databases themselves. To get started with Amazon RDS Custom, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Frds%2Fcustom%2F&amp;esheet=52543459&amp;newsitemid=20211201005993&amp;lan=en-US&amp;anchor=aws.amazon.com%2Frds%2Fcustom&amp;index=1&amp;md5=596ce7748238799ad47a492be20aec15\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com/rds/custom</a>.\n</p><p>\n<b><span>Amazon DynamoDB Standard-Infrequent Access (Standard-IA)</span></b><span> <b>table class reduces DynamoDB costs by up to 60% for tables that store infrequently accessed data</b></span>\n</p><p>\nCustomers choose DynamoDB for high-volume NoSQL workloads because it offers high throughput with consistent millisecond response times at virtually any scale without having to manage servers or clusters. As the patterns of DynamoDB workloads have become more diverse, there is a set of customers who have workloads where storage is the dominant cost for data that needs to be accessed less frequently over time but still requires fast response times when needed. For example, older social media posts, less recent ecommerce orders, and past video game achievements might represent a significant storage expense for customers due to their growing volume and the relatively high cost of storing this data, but they still require high throughput because when this data is requested it needs to be made immediately available. Today, customers optimize costs in these cases by writing code to move older, less frequently accessed data from DynamoDB to lower cost storage alternatives like Amazon S3.\n</p><p>\nWith the new Amazon DynamoDB Standard-IA table class, customers can reduce DynamoDB costs by up to 60% for tables that store infrequently accessed data. The DynamoDB Standard-IA table class offers up to 60% lower storage costs than Standard DynamoDB tables, making it the most cost-effective option for tables where storage is the dominant table cost. In contrast, the DynamoDB Standard table class offers up to 20% lower throughput costs than the Standard-IA table class and remains the most cost-effective option for tables where throughput is the dominant table cost. Customers can switch between DynamoDB Standard and DynamoDB Standard-IA table classes with no impact to table performance and no code changes required to optimize their spend for the type of data they are storing. To get started with the DynamoDB Standard-IA table class, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fdynamodb%2Fstandard-ia%2F&amp;esheet=52543459&amp;newsitemid=20211201005993&amp;lan=en-US&amp;anchor=aws.amazon.com%2Fdynamodb%2Fstandard-ia&amp;index=2&amp;md5=9337ed4e653213bcfd7e2e0e2fc7c36c\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com/dynamodb/standard-ia</a>.\n</p><p>\n<b><span>Amazon DevOps Guru for RDS uses machine learning to better detect and diagnose hard-to-find database-related performance issues and provides recommendations designed to resolve them in minutes not days</span></b>\n</p><p>\nAmazon DevOps Guru is a machine learning powered service that makes it easier for developers to improve application availability by automatically detecting operational issues and recommending specific actions for remediation. Today, Amazon DevOps Guru alerts customers to operational issues across Amazon RDS engines. However, it can be complicated and time-consuming to determine the exact cause of a database-related issue because developers often need to enlist database administrators to manually run diagnostic tools and queries to determine the factors contributing to the issue. Once the cause of the issue is identified, database experts often need to do additional analysis to fully understand the problem (e.g. analyze database-specific metrics, events, and wait conditions or extract and analyze relevant SQL statements) before providing guidance on how to fix it. As a result, it can take hours or days to uncover and remediate underlying database issues that put application availability or user experience at risk.\n</p><p>\nAmazon DevOps Guru for RDS is a new machine learning powered capability in Amazon DevOps Guru that is designed to automatically detect and diagnose performance bottlenecks and operational issues in a database and provide detailed remediation recommendations, enabling developers to resolve issues in minutes rather than days. Amazon DevOps Guru for RDS builds on the capabilities of Amazon DevOps Guru for detecting database-related issues to include additional performance-related issues in Amazon RDS (e.g. resource over-utilization and misbehavior of certain SQL queries). Amazon DevOps Guru for RDS is designed to immediately notify developers when issues occur and provide diagnostic information on the root cause, details on the extent of the problem, and intelligent remediation recommendations to help customers quickly resolve database-related performance bottlenecks and operational issues. For example, if an application performance issue related to an unexpected high load on a database is detected, Amazon DevOps Guru for RDS conducts a root cause analysis to find the exact SQL statement causing the issue, sends a notification with the cause and scope of the issue, and recommends corrective actions to resolve the issue quickly. Amazon DevOps Guru for RDS currently works with Amazon Aurora and is planned to support additional Amazon RDS database engines in 2022. To get started with Amazon DevOps Guru for RDS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fdevops-guru%2Ffeatures%2Fdevops-guru-for-rds%2F&amp;esheet=52543459&amp;newsitemid=20211201005993&amp;lan=en-US&amp;anchor=aws.amazon.com%2Fdevops-guru%2Ffeatures%2Fdevops-guru-for-rds&amp;index=3&amp;md5=bc0791db8d8a77bbc4f392b2bc637633\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com/devops-guru/features/devops-guru-for-rds</a>.\n</p><p>\nMercado Libre is a leading technology company in e-commerce in Latin America. “Even though our users may not need to check their past orders frequently, they expect to be able to view past orders, re-order items, and get product information at any time,” said Oscar Mullin, Director of IT - Core Services and Cross SRE and DBA Head at Mercado Libre. “Amazon DynamoDB Standard-IA will provide us with the ability to store our users’ infrequently accessed data at a significant cost savings, while continuing to deliver for our users by maintaining the same high performance, accessibility, and reliability we’ve come to expect from Amazon DynamoDB.”\n</p><p>\nNetApp is a cloud-led, data-centric software company that gives companies the freedom to put their data to work in the applications that elevate their business. “NetApp offers cloud services to enable organizations to easily run highly efficient, cost-effective relational database migration and operation programs from on premises to the cloud. However, some organizations running applications that require customization to the database environment and operating system have been unable to move to a fully managed database service in the cloud due to the customizations these applications require,” said Ronen Schwartz, SVP and GM at NetApp Cloud Volumes. “With Amazon RDS Custom, these organizations now have a managed database service for applications that require operating system and database customization. Organizations can run Amazon RDS Custom on NetApp ONTAP to benefit from advanced data protection, autonomous efficiencies, and continuous optimizations.”\n</p><p>\nAmazon Fulfillment Technologies designs, develops, and operates fulfillment technology solutions for Amazon fulfillment centers, including automated Amazon Robotics worldwide. “My team manages a large fleet database. Amazon DevOps Guru for RDS helps us identify a wider range of performance anomalies than our threshold-based monitoring without being overly noisy,” said Brent Bigonger, Principal Database Engineer at Amazon Fulfillment Technologies. “Amazon DevOps Guru for RDS’s machine learning powered insights act as an early warning system that allows us to detect, diagnose, and remediate performance-related issues quickly.”\n</p><p>\nJobvite is a recruiting software platform built to attract, hire, and onboard top talent. “Our usage patterns change time to time and as a result, our application interacts with Amazon Aurora databases in ways we can’t always predict. When we see congestion on our AWS databases it can take us hours to figure out the source and remediate,” said Ron Teeter, VP of Engineering and Chief Architect at Jobvite. “We are excited to use Amazon DevOps Guru for RDS to get alerts as soon as an event like this happens. With Amazon DevOps Guru for RDS, we can quickly locate database queries in our application that are causing the performance or operational issues along with an explanation of why it’s happening.”\n</p><p>\nSingular simplifies marketing data by unifying siloed data, applying attribution, and exposing insights to accelerate growth. “At Singular, we capture, analyze, and refine billions of data points to deliver the most accurate, timely, and actionable cross-platform analytics to our customers. Having immediate access to our data, even if it is infrequently used, is crucial for us to offer our customers the best insights to grow their business fast,” said Ofir Nir, Head of Data Infrastructure at Singular. “The ability to simplify the management and access to our long-term data storage while still benefiting from Amazon DynamoDB performance, durability, and data availability with the Amazon DynamoDB Standard-IA table class could help us further optimize costs and provide an even better user experience to our customers.”\n</p><p>\nNTT DOCOMO, Inc. is a leading mobile phone operator in Japan. “We manage 45 independent applications for our customers and internal teams at NTT DOCOMO. These teams provide underlying components for public services by NTT DOCOMO and business applications for our company staffers,” said Chikara Mitsui, Senior Manager, Service Design Department at NTT DOCOMO, Inc. “We are excited to use Amazon DevOps Guru for RDS and leverage its machine learning powered insights to quickly detect, diagnose, and remediate a wide range of database-related performance issues. Amazon DevOps Guru provides a single view of insights for our application stack and empowers my team to focus on building more reliable services instead of taking time to investigate operational issues.”\n</p><p>\nDelphix provides an automated DevOps data platform, masking data for privacy compliance, securing data from ransomware, and delivering efficient, virtualized data for CI/CD and digital transformation. “With Amazon RDS Custom, Delphix customers can accelerate database migrations to a managed service by eliminating data-related bottlenecks that slow down application development velocity,” says Jason Grauel, VP of Product Management at Delphix. “Now, customers can ensure test data keeps pace with an accelerated DevOps cadence while enjoying the operational benefits of Amazon RDS Custom automation.”\n</p><p>\nJungle Scout is an all-in-one platform for finding, launching, and selling Amazon products. “Data is the most critical component of our business offering at Jungle Scout. We collect and analyze hundreds of petabytes of data to deliver the most accurate marketplace analytics data in the world to our SMB and Enterprise customers,\" said Regan Wolfrom, DevSecOps and Builder Tools manager at Jungle Scout. “The new Amazon DynamoDB Standard-Infrequent Access table class is a massive win for us, allowing us to quickly and efficiently implement cost-effective long-term data storage while still enjoying the benefits of Amazon DynamoDB. The ability to switch between Amazon DynamoDB table classes without any code changes will allow us to easily optimize our costs as we scale and focus our engineering efforts on the features our customers require as they grow their business.”\n</p><p>\n<b>About Amazon Web Services</b>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Faws.amazon.com%2F&amp;esheet=52543459&amp;newsitemid=20211201005993&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=4&amp;md5=ca5eea55f22db82f8cd307348132531d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<b>About Amazon</b>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Famazon.com%2Fabout&amp;esheet=52543459&amp;newsitemid=20211201005993&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=5&amp;md5=ec250a316307bfa38b03dc9ea88c182e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211201005993r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMjAxMDA1OTkzcjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=d102efabb6afc434e21342903511440a2eb4110dc0d66de5ae7c5f75c880814f60a171d21d852c67e828e9e0713b91029fcc747326ab25dd80ea669abb28f7e4\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211201005993/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211201005993/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52543459&amp;newsitemid=20211201005993&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=6&amp;md5=0a731be1171d7d807e225de584149e88\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NV-AMAZON-WEB-SERVICES</p></div>"}