{"date": "2022-02-15 19:41:31.846000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>WINNING BRANDS CORP (\"WNBD-0\")\n- Previews Metaverse Capability of Its New Tech Division\n\n     Winning Brands Corporation www.WinningBrands.com - Company management\nis for the first time revealing the metaverse development capabilities,\nambitions and progress of its new Tech Division, whose pending acquisition\nhad been disclosed in earlier public reporting. WNBD's Current Information\nTier status at OTC Markets and qualification for DWAC eligibility for WNBD\nstock was attained in 2021 as the foundation for a creative growth\nstrategy. Winning Brands management is now starting to pull back the veil\non its plans to build shareholder value through a bold repositioning of the\ncompany's objectives via its Tech Division.\n\n     Quarterly reports during 2021 predicted a pending acquisition by WNBD\nof certain valuable intellectual properties, including patent protection\nrights, trademarks and operating goodwill within the technology sector.\nThis acquisition is scheduled for confirmation by an applicable court in\nApril 2022 and is still covered by certain confidentiality undertakings.\nBefore now, no indication could be given by Winning Brands regarding the\nsector in which the new Tech Division will operate. Management is now\nauthorized to reveal for the first time one of the tech categories in which\nthe new Tech Division will operate - the \"metaverse\". The following preview\ndescribes the degree to which Winning Brands' Tech Division is\ninterconnected with metaverse business trends that are creating immense\nbusiness opportunities for future-oriented companies globally. Winning\nBrands' Tech Division acquisition will confer upon Winning Brands the\nprotection of several dozen U.S. issued patents. The patent awards embody\nknow-how that is anchored in metaverse concepts and go beyond into\nreal-world applications. This patent protection demonstrates that Winning\nBrands' Tech Division possesses development talent of the stature needed to\ncreate successful metaverse operations for enterprise customers. This gives\nWinning Brands unique leverage to become an active participant in the\nmetaverse field, and to leave its mark on it..\n\n     Background\n\n     The concept of the metaverse has been under exploration since the\n1990s in the form of experimentation with connected virtual worlds. The\ngoal was to enable people from different locations around the globe to meet\nand interact with each other in a 3D virtual reality.\n\n     Since the emergence of sites such as Second Life, which found\npopularity in the mid 2000's, interest in 3D virtual reality worlds has\naccelerated. This has been driven in part by a new generation of\nhead-mounted displays that are more affordable and feature-rich (including\nMicrosoft HoloLens, Oculus, Sony, HTC, and Valve), as well as increasingly\nsophisticated desktop computer, laptop, game console display screens and\nmobile devices. The dramatic increase in commercial internet activity\nduring the COVID era has further revealed a willingness by institutions and\nthe public to embrace a new paradigm of where people are when carrying out\ncommunications, shopping, entertainment and social exchanges. This paradigm\nshift includes new forms of self-identity through avatars.\n\n     2020 saw a steepening curve and major ramp-up of interest by \"big\ntech\" players who have started betting on the imminent creation and use by\nconsumers of a worldwide web evolving toward a new \"3D Universe\". Here all\ncan meet, and social engagement and commerce takes place in a hybrid\nreality. Billions of dollars are now being poured into the creation of what\nbig tech is calling the metaverse.\n\n     As examples, big tech has dived into creating and selling non-fungible\ntoken (NFT) digital collectibles, whose aggregate asset value has grown\ninto multi-billion dollar territory. Big tech is also keen to apply\neye-tracking and product placement in the metaverse for profit, and are\nacquiring developers in this field. Big tech have been seeking innovators\nwhose business is to create relevant virtual products and capabilities.\nMajor brands are announcing that they are determined to open stores in the\nmetaverse. The price being paid by big tech for these developer\nacquisitions have also reached the billions of dollars.\n\n     A proven model for resulting huge business growth now exists. When the\nworldwide web emerged into everyday life in the 1990's, organizations\nflocked to the internet to create their own web pages and functionalities.\nOrganizations needed tools and the support of experts to participate,\ncreating the rise of iconic service providers whose rapid ascent was\nunprecedented in business history. Now, again, with the internet's\nanticipated evolution into a metaverse, organizations have no realistic\nchoice other than keeping up with the emerging new norm. The original\ninternet had become a baseline standard for activity across all walks of\nlife. The metaverse is where this is headed, and it will become the new\nnorm. Interestingly, metaverse expertise is not a simple extension of\ninternet expertise. A substantial new realm of knowledge and opportunity is\nemerging that is rooted in metaverse specific knowledge.\n\n     Thus, metaverse experts will need to make it easy for users to enter\n3D space and to navigate, learn about and interact with products and\nservices there, whether those products and services are physical or\nvirtual. The key difference in the new experience is that users will enter\nthe metaverse not with a computer mouse, but rather with an embodiment of\nthemselves; a 3D animated avatar that the user can control and use to\ninteract with the virtual world. There will also be hybrid models wherein\nmuch like a zoom call, users will be able to bring aspects of their live\nvideo image to the metaverse and to interact in a manner that is neither\npurely conference call nor purely personal meeting. This is considered by\nexperts to be the unstoppable direction of the underlying interactive\ntechnology that networks human activity and thus will become the new public\nexpectation.\n\n     Some early real-time 3D virtual world graphic engines that will be\nused to build elements of the 3D virtual world infrastructure already\nexist. These include brands such as UnReal Engine, Unity3D engine, and Xi\nRang (in China). What will be needed for widespread adoption are the tools\nthat will make the creation of each company's own 3D space and 3D objects\nfar more easily achieved by organizations. The creation of the tools needed\nto build, populate and make 3D spaces interactive is the first basis of\nmetaverse activity by Winning Brands' pending Tech Division. Uniquely and\nfortunately for Winning Brands, the patent protection that arises from\nearlier work by its new Tech Division already form a basis for practical\napplications within the metaverse. Winning Brands therefore has a\nspringboard of momentum from the Tech Division's earlier intellectual\nproperty development. Winning Brands will be able to draw upon the Tech\nDivision's existing commercial customer base acquired from the Tech\nDivision's pre-metaverse product and service iterations. Metaverse activity\nwill be a natural extension of the Tech Division's work. Winning Brands'\nTech Division is a logical \"go-to\" supplier to help the existing commercial\ncustomer base make their own transition.\n\n     These Initial commercial clients for Winning Brands' metatools are\nknown early-adopting companies and institutions who need to build out their\n3D space in the metaverse internet. The acquisition of the Tech Division\nallows Winning Brands to get out in front of the coming wave of interest in\nbuilding these 3D spaces for the metaverse. Its Tech Division and 3rd party\ncollaborators are already there. The launch advantage of the Tech\nDivision's unique combination of technology history and technology vision\nincludes a treasure trove of useful tools that can work like widgets and\nbuilding blocks for easily building out a space that will allow 3D space\nowners to have users in the metaverse interact with them and their\nproducts, while also allowing their employees to interact with the users\nwho enter their space. Each space will have unique products and services\nbut the common tools they will need to make it operational are what Winning\nBrands' Tech Division metatool offerings will deliver. The Tech Division\nand its collaborators will also develop the service of building out these\nspaces when clients desire. A busy downtown street and the variety of types\nof establishments represented therein illustrates the variety of types of\n3D spaces there will be.\n\n     The Tech Division's metatools launch will start by concentrating on\ndeveloping the most needed tools that every space will need and the tools\nfor the greatest amount of use. Financial tools that allow companies to\nsell things will be essential. Tools for retail store fronts will be highly\nsought after and used widely.\n\n     There are two types of things that can be purchased in the metaverse;\nproducts and services that exist only in the metaverse, and products and\nservices that are used in the real world. All these products and services\nwill be tracked by blockchain technology that will follow the purchasing\nand potential re-selling/trading of these items. In any case there will be\na representation of these products and services in the metaverse, and each\nimage will act like an NFT (Non Fungible Token). Users may be choosing to\nonly buy an object (an NFT) that is used exclusively in the metaverse. As\nan example, someone may go into a metaverse brand name store to look at 3D\ninteractive images of their favorite name brand object. They might only\nwish to buy the 3D image (NFT) of the item for their avatar to use, or they\nmay desire to own the real thing, and have it delivered to their real world\naddress. They may want both. There are many tools needed to make this type\nof a virtual 3D store, with 3D interactive virtual objects that can be\nexamined and purchased as a block chain tracked NFT or real world product.\n\n     Winning Brands Tech Division and its 3rd party collaborators already\nhave developed suitable building blocks of their first prototype,\npre-launch. Following the completion of the Tech Division acquisition,\nresources will be applied in part to metatools completion and demonstration\nof prototype 3D Metaverse virtual retail store spaces to be navigated and\ninteracted with by avatars, to buy virtual and real objects, and integrate\nthe tools needed to create communication within the store, the 3D NFT\nobjects, make the blockchain tracking sales and other tools required to\noperate the store, such as retail clerk avatars to interact with the\ncustomers avatars.\n\n     The metaverse tools studio that will be built, will enable content\nowners to identify, promote and accelerate the sale of NFT-able content as\nwell as their tangible counterparts in the real world.\n\n     The metaverse tools studio will also enable fast creation of\nbusinesses and stores in the metaverse and offer an immersive 3D experience\nas an intriguingly advanced substitute for real shopping and entertainment\ncontent consumption. The company will focus on leveraging cross\nplatform/technology solutions to effectively bridge heterogeneous metaverse\ninfrastructures in order to unify the metaverse presence for potential\ncustomers.\n\n     In order to remain compatible with current standards, Winning Brands\nTech Division plans to start with auto-scaling Cloud Infrastructure (AWS,\nGC, Azure, DigitalOcean, etc), Epic Games Unreal Engine for 3D experience,\nOpenXR/WebXR for cross platformness, NFT with Ethereum v2.0, Machine\nLearning: Computer Vision, Recommender System, low latency adaptive bitrate\nstreaming, and hardware accelerated computing to deliver true 3D immersive\nshopping and viewing experience, and expand from there, remaining at the\nleading edge, which the team understands well. The company will use modern\nand fast programming languages such as C++20, GoLang, Python 3, Kotlin, as\nwell as various web, ML and streaming frameworks to shorten the time to\nmarket.\n\n     Winning Brands CEO, Eric Lehner, comments: \"The metaverse activity\nthat our Tech Division will undertake is not \"starting from scratch\". This\nis vital for WNBD shareholders to know. The Tech Division acquisition that\nis underway provides a foundation of existing patent protection for a\nvariety of applications of such technology for enterprises and a business\ncustomer base that has already shown satisfaction with the Tech Division's\nwork over the years. We will not be a newcomer. We will start from \"Day\nOne\" as an already trusted partner to meet the needs of some of the world's\nmost discerning organizations. And all of this is only one dimension of\nwhat WNBD will be undertaking with the benefit of the completed Tech\nDivision acquisition. It is a misconception to think that profound\ninnovation only comes from the largest organizations. Instead, the largest\norganizations look with interest to emergent innovators and then either buy\nthem or integrate them into a mutually beneficial business ecosystem.\nThat's where Winning Brands' Tech Division acquisition is located. It is\nperfectly positioned for such symbiosis.\"\n\n     Winning Brands has discussed its business in its various public\ninformation platforms in order to ensure that shareholders understand the\ncompany's business model, its activities, its challenges and its\nopportunities. Such discussion is summarized in a CEO weblog maintained for\nWinning Brands shareholders at www.WinningBrandsCorporation.com/blog. It is\na journal of the company's mission, providing answers to shareholder\nquestions. The weblog is a regular source of public information pertaining\nto Winning Brands, pursuant to SEC Fair Disclosure guidelines. For the same\npurpose, the company also maintains a Twitter presence:\nwww.Twitter.com/WinningCEO.\n\n     ABOUT WINNING BRANDS CORPORATION: Winning Brands is the manufacturer\nof record of a variety of environmentally oriented consumer products.\nWinning Brands has indicated in its public communications that it seeks to\nenhance shareholder value by curating additional business ventures, with\nbroader scope, in due course.\n\n     Safe Harbor: Statements contained in this news release, other than\nthose identifying historical facts, constitute \"forward-looking statements\"\nwithin the meaning of Section 21E of the Securities Exchange Act of 1934\nand the Safe Harbor provisions as contained in the Private Securities\nLitigation Reform Act of 1995. Such forward-looking statements relating to\nthe Company's future expectations, including but not limited to revenues\nand earnings, technology efficacy, strategies and plans, are subject to\nsafe harbors protection. Actual Company results and performance may be\nmaterially different from any future results, performance, strategies,\nplans, or achievements that may be expressed or implied by any such\nforward-looking statements. The Company disclaims any obligation to update\nor revise any forward-looking statements.\n\n(figure class=\"image image_resized\" style=\"width:376px;\")(/figure)\nWinning Brands is revealing more about the business categories that its\npending\nTech Division acquisition will service - previewing its metaverse\ncapabilities and patent support.\n\nEric Lehner\nWinning Brands\n+1 705-737-4062 ext. 8\neric@winningbrands.ca\nVisit us on social media:\nFacebook\nTwitter\n\nTel   : 705-737-4062    WINNING BRANDS CORP\nFax   : 705-737-9793\nWWW   : <a href=\"https://www.winningbrands.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.winningbrands.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204500584.MNPRE2204502785-09324320220215</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}