{"date": "2021-12-08 11:00:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Lisa Baertlein and Richa Naidu</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">LOS ANGELES/CHICAGO, Dec 8 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon.com Inc's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> push to recruit big-rig contractors to haul goods across its web of warehouses is colliding with a trucker shortage as the e-commerce company moves what are expected to be record numbers of packages this holiday season.</p><p>Its project, called Amazon Freight Partners (AFP), enlists independent trucking companies to move goods between Amazon facilities. The companies, or AFPs, all of which are exclusive Amazon contractors, also move packages to and from the company's fleet of 85 <a href=\"https://www.reuters.com/article/us-amazon-com-shipping-insight/amazon-starts-flexing-muscle-in-new-space-air-cargo-idUSKBN14C1K4\" data-type=\"url\" class=\"tr-link\" translate=\"no\">owned or leased</a> North American airplanes.</p><p>Since 2019, Amazon has recruited 250 AFPs around the globe, and made it possible for the companies \"to start and scale their own transportation businesses and create job opportunities for thousands of drivers,\" an Amazon spokeswoman said. This trucking network - separate from the army of home-delivery contractors that drop Amazon packages on shoppers' doorsteps - puts small AFPs in fierce competition for drivers against Walmart Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=WMT.N\" data-type=\"ric\" data-ric=\"WMT.N\" translate=\"no\" dir=\"ltr\">WMT.N</a> and United Parcel Service Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=UPS.N\" data-type=\"ric\" data-ric=\"UPS.N\" translate=\"no\" dir=\"ltr\">UPS.N</a>. </p><p>\"There's a shortage of drivers, especially the good drivers,\" said Ebony McKinley, owner of family-run Seven Strong Trucking. The Phoenix-area firm was among the first to join the AFP program in April 2020. It now has 20 Amazon-branded semi-truck tractors as part of AFP and employs 45 drivers. </p><p>Amazon's logistics unit has bought 1,395 Amazon-branded big-rig tractors to pull trailers of goods in the United States, according to Department of Transportation data seen by Reuters. Filling seats in those vehicles falls largely to independent contractors like McKinley at a time when the industry has a <a href=\"https://www.trucking.org/sites/default/files/2021-10/ATA%20Driver%20Shortage%20Report%202021%20Executive%20Summary.FINAL_.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">record shortfall of 80,000</a> big-rig drivers. \"Everybody's feeling the heat,\" she said.</p><p>Labor woes are particularly acute for big-rig trucking firms because their drivers need more credentials: Government agencies require them to have commercial drivers' licenses, and insurers increasingly demand two years' experience. Skilled drivers can hop to a new job with better compensation amid record demand for consumer goods.    </p><p>   Seattle-based Amazon in October said that higher wages, more worker incentives and inflation in services such as trucking contributed to $2 billion in extra expenses in the prior quarter. <a href=\"https://www.reuters.com/technology/amazons-holiday-quarter-forecast-disappoints-labor-supply-issues-mount-2021-10-28\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon expects those costs to double</a> for the current holiday quarter, threatening to erase profit in its biggest selling period. </p><p>T<a href=\"https://graphics.reuters.com/USA-ECONOMY/lbvgnblxbpq/chart.png\" data-type=\"url\" class=\"tr-link\" translate=\"no\">ruckers' pay</a> has not kept pace with inflation, leaving \"real\" earnings at 70% of what they were in the 1970s, according to the U.S. Bureau of Labor Statistics (BLS). Federal limits on daily working hours, the COVID-19 pandemic and other hurdles prompted many truck drivers to quit.</p><p>   At Seven Strong, new drivers start at $22 an hour. Perks include a $1,500 hiring bonus and overtime pay. Base pay is roughly in line with the median wage for all U.S. truck drivers, which is $47,130 per year, or $22.66 per hour, according to BLS. Owner McKinley said that payments from Amazon cover driver compensation. </p><p>                           </p><p>RECRUIT, RETAIN</p><p>AFPs across the United States advertise pay of $18-$27 per hour before benefits, with many nights at home, according to a Reuters review of dozens of help-wanted postings on Indeed, ZipRecruiter and other online sites. Signing bonuses ranged from $1,000 to $2,000, according to the postings.</p><p>Amazon told Reuters it recommends a minimum contractual wage for AFP drivers, but it also encourages contractors to pay above that to find and retain talent. </p><p>If Amazon were to dictate trucker wages, it could run afoul of rules for independent contractors at a time when some states want such workers <a href=\"https://www.reuters.com/legal/government/no-scotus-review-california-laws-impact-trucking-industry-2021-10-04\" data-type=\"url\" class=\"tr-link\" translate=\"no\">classified as employees</a>, legal and trucking experts said. </p><p>Two current AFPs, who declined to be named for fear of retribution, told Reuters the work is steady and predictable -  although they said other, less-experienced operators could be overwhelmed with overtime and unexpected expenses.</p><p>While stability and reliability offered by established trucking employers like Walmart or UPS may appeal to older, experienced drivers, small trucking company owners may be lured by opportunities to grow with Amazon.</p><p>\"Hitching your wagon to the Amazon train - that's hard to turn down,\" said Page Siplon, chief executive of TeamOne Logistics, a third-party logistics firm with 700 drivers in 43 states that does not work with Amazon.</p><p><br/></p><p>COMPETITION HEATS UP</p><p>Amazon forecast fourth-quarter net sales of $130 billion-$140 billion, up 4-12%, which could translate into a jump in the number of packages it handles. This year, that could mean it handles 32 million packages in the United States on a peak day, said Marc Wulfraat, president of consultancy firm MWPVL International.</p><p>Amazon's former shipping partner FedEx Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FDX.N\" data-type=\"ric\" data-ric=\"FDX.N\" translate=\"no\" dir=\"ltr\">FDX.N</a> also reported a <a href=\"https://www.reuters.com/article/fedex-results-idCNL1N2QN2N8\" data-type=\"url\" class=\"tr-link\" translate=\"no\">quarterly profit hit</a> from unexpected costs - primarily from its Ground delivery unit that depends on contract drivers.     </p><p>Trucker employers UPS and Walmart were not immune to the pressure, but did not report the same level of cost woes. </p><p>UPS, which counts Amazon as its top customer, spent more on its well-paid <a href=\"https://www.reuters.com/business/ups-profit-rises-23-e-commerce-demand-2021-10-26\" data-type=\"url\" class=\"tr-link\" translate=\"no\">unionized workforce that appears to be providing profit-sheltering labor stability</a>.</p><p>Walmart, which has more than 11,000 big-rig drivers on its payroll, said higher <a href=\"https://www.reuters.com/business/retail-consumer/walmart-sets-aside-supply-chain-worries-raise-annual-sales-profit-forecasts-2021-11-16\" data-type=\"url\" class=\"tr-link\" translate=\"no\">supply-chain costs</a> reduced its U.S. gross profit rate by 12 basis points in the latest quarter. </p><p>Walmart is hiking pay and sweetening bonuses for its decades-old in-house trucking operation that uses 8,400 owned and leased tractors to move goods for its more than 5,300 U.S. Walmart and Sam's Club stores. Walmart - which employs mostly long-haul truckers - advertises immediate truck driver jobs with starting salaries of $87,500, not including signing bonuses of $8,000 or $12,000. Peak season bonuses for working an extra day sometimes jump to $250 a day from $150, a Walmart spokesperson said.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Lisa Baertlein in Los Angeles and Richa Naidu in Chicago; Additional reporting by Jeffrey Dastin in Palo Alto, Calif.<br/>Editing by Vanessa O'Connell and Matthew Lewis)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:lisa.baertlein@thomsonreuters.com\" data-type=\"email\" translate=\"no\">lisa.baertlein@thomsonreuters.com</a> ; +1 310-491-7241; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://lisa.baertlein.thomsonreuters.com@reuters.net\">lisa.baertlein.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SUPPLY-CHAIN/TRUCKING-AMAZON.COM (FOCUS, PIX)</p></div>"}