{"date": "2021-12-23 11:00:41.357000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.34, "close": 3421.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon is set to acquire the stake of Catamaran Ventures in Prione Business Services Pvt Ltd, the, the company which houses Cloudtail. What does this mean? Will Cloudtail shut down as a seller?</p><p>E-commerce marketplace platform Amazon is set to acquire the stake of Catamaran Ventures - Infosys co-founder N R Naryana Murthy's investment vehicle - in Prione Business Services Pvt Ltd, the company which houses one of the biggest sellers on Amazon India – Cloudtail.</p></div><div class=\"tr-npp-body\"><p>What does this mean?</p><p>Back in 2014, Amazon signed a joint-venture agreement with Catamaran Ventures to set up Prione Business Services. The arrangement was that Amazon would hold 49 per cent stake in Prione and Catamaran 51 per cent. Prione was the parent company of Cloudtail, which is one of the biggest sellers on Amazon India marketplace.</p><p>Since then, various policy tweaks for foreign direct investment (FDI) in e-commerce made it increasingly tougher for Amazon to have a control over the inventory being sold on its platform.</p><p>In August this year, Amazon and Catamaran announced that the joint venture would end in May 2022 at the completion of its term. Now, Amazon is purchasing Catamaran's stake in Prione to hold 100 per cent of the Cloudtail parent.</p><p>Which policy tweaks impacted this joint-venture?</p><p>India's FDI rules for e-commerce mandate players with foreign funding to operate on a marketplace model, having virtually no control over the inventory sold on the platform. However, the operations of Cloudtail, especially with it becoming the largest seller, was deemed non-compliant with the rules.</p><p>In 2016, the government clarified its existing FDI rules to say that no single seller can have more than 25 per cent of the total sales on an e-commerce platform.</p><p>Shortly after this, in 2017, Amazon announced a new joint-venture with the Patni Group to create Appario Retail.</p><p>Effective early 2019, the Indian government further tightened the screws on foreign funded e-commerce players, saying these entities or their group companies were disallowed from owning stake in seller firms. Following this, in the same year, Amazon reduced its stake in Prione to 24 per cent to comply with the new rules.</p><p>What has Amazon said?</p><p>In a joint statement, Amazon and Catamaran said: \"Prione Business Services Pvt Ltd, the joint venture between Catamaran and Amazon, will be acquired by Amazon subject to requisite regulatory approvals. On August 09, 2021, the Partners had announced their decision to not continue the JV beyond the end of its current term of May 2022. Amazon will acquire Catamaran's shareholding in Prione in compliance with applicable laws including all assets and liabilities. The businesses of the Joint Venture shall continue under the leadership of the current management and on receipt of regulatory approvals, the board of Prione &amp; Cloudtail will take steps to complete the transaction in compliance with applicable laws.\"</p><p>Will Cloudtail shut down as a seller, and what happens with Appario?</p><p>While it is unclear at this point whether Amazon will continue operating Cloudtail, indications are that Amazon has started looking for new vendor partners to carry on with the Prione Business Services venture. The firm is said to be looking for partners with experience in the e-commerce space.</p><p>With regard to Appario, while the company hasn't formally announced any change to business, question marks linger over whether the joint-venture will be extended after its five-year term ends next year.</p><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}