{"date": "2022-01-21 14:58:14.027000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3125.98, "close": 2852.86}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The independent directors of Kishore Biyani-led Future Retail Limited (FRL) have given their willingness to accept US e-commerce giant Amazon\u0092s proposal in addressing any financial concerns of FRL, including the solution proposed in the term sheet between Samara Capital, and FRL, which contemplated an infusion of Rs 7,000 crore in FRL. However, it told Amazon that any assessment of proposals will be subject to FRL\u0092s legal obligations.</p><p>FRL has also sent the letter to the Directorate of Enforcement, Securities and Exchange Board of India (SEBI), Competition Commission of India (CCI) and CCI chairman Ashok K Gupta. It has also sent the letter to top executives at organisations such as Union Bank of India, Bank of India, State Bank of India, Bank of Baroda, Central Bank of India,</p></div><div class=\"tr-npp-body\"><p>Punjab National Bank, UCO Bank and Indian Bank.</p><p>\u0093Thank you for your Letter and your offer to support Future Retail Limited (FRL). While we are willing to assess all proposals, please note that any proposal should be comprehensive and provide a solution for banks, employees, vendors, and other stakeholders. Please also note that any assessment of proposals will be subject to FRL\u0092s legal obligations,\u0094 said FRL\u0092s letter, dated January 21, which Business Standard has reviewed.</p><p>On January 19, 2022, Amazon had written to the independent directors of Future Retail (FRL), including Gagan Singh, Ravindra Dhariwal, and Jacob Mathew, reiterating its willingness and ability to assist FRL in addressing any financial concerns, within the framework of the agreements. This included the solution proposed in the term sheet between Samara Capital, and FRL, which contemplated an infusion of Rs 7,000 crore in FRL.</p><p>According to sources, as early as June 2020, Amazon-backed private equity firm Samara Capital had signed a non-binding term sheet with FRL that entailed a Rs 7,000 crore investment. This was two months prior to Kishore Biyani-led Future Group announcing its Rs 24,713 crore (or $3.4 billion) merger deal with Reliance Industries (RIL) at the end of August 2020.</p><p>\u0093Coming to the specific aspects of your proposal - we note that Your Letter refers to a potential transaction between Samara Capital and FRL, as a \u0093solution\u0094. In this regard, you are requested to confirm if Amazon can act on behalf of Samara Capital and has the authority to negotiate and finalize such transaction on its behalf,\u0094 said FRL letter to Amazon.</p><p>The letter has asked Amazon to confirm the structure for the proposed transaction, and that the manager of Samara Capital is owned-and-controlled by resident Indians. It said FRL is in the multi-brand retail sector, and FDI (foreign direct investment) in this sector is restricted. It said Amazon\u0092s transaction in Future Coupons, has resulted in regulatory scrutiny, including by the Competition Commission of India, as well as enquiries by the Enforcement Directorate. It is therefore critical that any investment being proposed is in compliance with all applicable laws, including FDI laws, CCI regulations and SEBI regulations, and that any such transaction should not raise further regulatory scrutiny. FRL said it has always acted in compliance with applicable laws in letter and spirit and will continue to do so.</p><p>Further, FRL is in need of cash infusion urgently, in order to repay its lenders. FRL is required to pay its lenders Rs. 3500 crores by January 29, 2022, failing which it will be classified as an NPA (non-performing asset). \u0093Since you are objecting to the sale of small-format sales, the proceeds of which were to be used to repay lenders and thereby avoid NPA classification, please confirm that you are willing to fund this amount by Monday (January 24) through an unsecured, long-term loan, subordinated to FRL\u0092s existing lenders or any other mutually suitable and legally acceptable structure,\u0094 said FRL letter. \u0093If you do so, FRL will use such funds in order to repay FRL\u0092s existing lenders. Alternatively, you are also free to engage with the Lenders, so that we do not fall foul of our OTR (one-time restructuring) process or obligations.\u0094</p><p>FRL has requested Amazon to provide the confirmations for the above by tomorrow (January 22, 2022). \u0093Once you have provided these confirmations in writing and agree to infuse Rs. 3500 crores in order to repay FRL\u0092s lenders by January 29, 2022, we would be happy to assess a detailed proposal and meet Mr. Abhijeet Muzumdar,\u0094 said the FRL letter.</p><p>This week, Amazon in its letter to the independent directors of FRL has nominated Abhijeet Muzumdar (head of Amazon Smbhav Venture Fund and corporate development) to lead any and all such engagements with interested stakeholders and decision-makers in FRL, including independent directors, to find a commercial solution for FRL.</p><p>FRL has told Amazon that its letter is lacking in detail and asked it to provide written confirmation on various aspects before meeting Abhijeet Muzumdar. This includes providing clarity on how FRL would actually service its dues and repay lenders. FRL\u0092s liabilities to its lenders aggregates to Rs.9119.31 crore for interest and principal repayments to lenders up to March 2022 (including immediate payment of overdue amount of Rs. 3,494.56 crore) and Rs.2908 crore for operations upto March 2022. \u0093The proposed infusion referred to in Your Letter is significantly below that,\u0094 said the FRL letter.</p><p>Also, the timing of such cash infusion is not clear, despite it being clear that FRL\u0092s cash requirements are immediate. It is not clear on how such infusion will be implemented in a legally-compliant manner.</p><p>FRL letter said the Scheme of Arrangement was approved by the Board of Directors of FRL on August 29, 2020 (Scheme), as that was the only solution available that would enable FRL to monetize its assets and repay lender dues of thousands of crores and make payments to 30,000 employees, and more than 5000 vendors (including SME vendors). The firm alleged that it appears that Amazon has made all attempts to block the Scheme and are now attempting to block the small-store business monetization.</p><p>\u0093Your action has prevented FRL, from repaying its lenders and creditors. Your infusion of Rs 3500 crore can however help FRL meet its present OTR obligation,\u0094 said the letter.</p><p>FRL said it is also important to highlight that the Scheme has received support from lenders of FRL. It is only on account of the Scheme that FRL has been able to enter into a one-time restructuring (OTR) with its lenders and restructure its debt. This OTR has been entered into under the aegis of RBI Circulars, and pursuant to this OTR, FRL is required to sell its small-store format business (i.e. the business under the brands 'Easyday' and 'Heritage Fresh'), by December 31 , 2021, and use the proceeds to repay lenders. If this is not done, FRL will be declared an NPA, and could face coercive steps, including insolvency proceedings.</p><p>While a 30-day grace period has been provided which expires on January 29, 2022, FRL has said that it is unfortunate that Amazon is again attempting to stop such a sale and prevent the lenders from realizing their dues.</p><p>\u0093Your actions have resulted in driving FRL to the ground at enormous cost to the entire ecosystem of its creditors, lenders, vendors, employees and shareholders,\u0094 said the letter. \u0093Please also note that FRL's assets are charged/encumbered in favour of its lenders. Lenders have a right to invoke and enforce security under law, and these cannot be constrained by shareholders' agreements. In fact, given FRL's financial position, it is imperative that shareholders, whether direct or indirect, recognize the superior rights and interests of lenders.\u0094</p><p>FRL has told Amazon that this communication is without prejudice to its rights under law, contract and equity. \u0093We expressly reserve our rights, and this communication is without prejudice to our contentions before the Hon'ble Supreme Court, the Hon'ble Delhi High Court, the Hon'ble National Company Law Tribunal, the Hon'ble Arbitration Tribunal, and any other tribunals, courts or regulatory authorities.\u0094</p><p>A query to Future Group and Amazon remained unanswered till the time of going to press.</p><p>--Ends</p><p>Infographics:</p><p>Conditions set by FRL to accept the proposal Amazon in the letter:</p><p>FRL is required to pay its lenders Rs. 3500 crores by January 29, 2022</p><p>FRL has asked Amazon to confirm the US e-commerce giant\u0092s willingness to pay the amount by Monday, January 24, 2022.</p><p>If Amazon has authority to act on behalf of Samara Capital to finalise the transaction on its behalf.</p><p>The management of Samara Capital should be owned and controlled by resident Indians to avoid any regulatory scrutiny.</p><p>Amazon needs to provide confirmation by January 22, 2022 to accept the conditions including funding.</p><p>Written confirmation by Amazon about how FRL can service its dues and repay its lenders the total amount of about Rs 9,119.31 crore by March 2022.</p><p>FRL has told Amazon that its proposed infusion (of Rs 7,000 crore) for FRL in the letter is significantly less.</p><p>FRL has said that its cash requirements are immediate and Amazon has not given any time period.</p><p>FRL has alleged that Amazon is making attempts to block Future to monetise its assets and repay lenders.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Business Standard Ltd.</p></div>"}