{"date": "2022-01-14 16:07:49+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3224.28, "close": 3178.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Jan 14 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>U.S. holiday sales hit a record $886.7 billion in 2021, data from a trade body showed on Friday, as people rushed to buy gifts online and in stores amid a jump in COVID-19 cases and supply chain issues that threatened to upend the crucial shopping season.</p><p>The National Retail Federation (NRF) said holiday sales, including e-commerce, jumped 14.1% during November and December, marking the highest growth in at least two decades and exceeding its latest forecast of a rise of as much as 11.5%.</p><p>\"Despite supply chain problems, rising inflation, labor shortages and the Omicron variant, retailers delivered a positive holiday experience to pandemic-fatigued consumers and their families,\" NRF Chief Executive Officer Matthew Shay said in a statement.</p><p>The shopping season, the busiest time of the year for retailers, was marked by shipping delays caused by the pandemic and subsequent product shortages. </p><p>To ensure supply over the make-or-break season, some retailers such as Walmart <a href=\"reuters://REALTIME/Verb=FullQuote/ric=WMT.N\" data-type=\"ric\" data-ric=\"WMT.N\" translate=\"no\" dir=\"ltr\">WMT.N</a> and Target <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TGT.N\" data-type=\"ric\" data-ric=\"TGT.N\" translate=\"no\" dir=\"ltr\">TGT.N</a> re-rerouted goods to less congested ports and even chartered their own vessels to get holiday items to their shelves on time.</p><p>An Omicron-led surge in coronavirus cases at the end of the year also added to retailers' woes, limiting staffing and reducing store traffic.    </p><p>That led to retail sales in December, excluding automobile dealers, gasoline stations and restaurants, falling 2.7% from November, according to NRF data. E-commerce and other non-store sales, however, jumped 11.3% in the holiday season. </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Deborah Sophia in Bengaluru; Editing by Ramakrishnan M.)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:DeborahMary.Sophia@thomsonreuters.com\" data-type=\"email\" translate=\"no\">DeborahMary.Sophia@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: RETAIL-HOLIDAYSHOPPING/USA-NRF (PIX)</p></div>"}