{"date": "2021-11-28 23:25:21.186000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Abu Dhabi Investment Office / Amazon / fulfillment centre</p><p>ABU DHABI, 28th November, 2021 (WAM) -- As part of the Abu Dhabi Investment Office's (ADIO) programme to attract investment, Abu Dhabi will become home to Amazon's most technologically advanced fulfillment centre in the region.</p></div><div class=\"tr-npp-body\"><p>Expected to be launched by 2024, the new fulfillment centre comes as part of a wider collaboration between Amazon and ADIO which will also unlock job opportunities over the coming years, as well as provide support to help entrepreneurs, startups and small to medium-sized businesses (SMBs) thrive in the digital economy.</p><p>Mohammed Ali Al Shorafa, Chairman of the Abu Dhabi Department of Economic Development, said, \"Abu Dhabi has established itself as the region's innovation hub and as a nexus for pioneering technology and impactful solutions. The addition of Amazon's new fulfillment centre further boosts the emirate's ecosystem by introducing new capabilities and an enhanced infrastructure that deliver benefits to other businesses. As part of our commitment to creating opportunities for the private sector, ADIO will partner with and support innovation-driven companies to ensure their growth and success in Abu Dhabi.\" Russell Grandinetti, Senior Vice President, International Consumer, Amazon, said, \"Driven by customer-obsession, innovation and long-term thinking, we are very proud to be working alongside the UAE leadership as we contribute to the nation's accelerating digital economy and ambitious growth agenda. We look forward to partnering with the Abu Dhabi Investment Office to bring Amazon's advanced logistics, technology innovations, sustainability initiatives and decades of expertise to the area.\" Following its successful and ongoing collaboration with Amazon Web Services (AWS) to launch cloud data centres in the UAE, ADIO continues to partner with Amazon to advance innovative and technological solutions in Abu Dhabi.</p><p>Ronaldo Mouchawar, Vice President of Amazon Middle East and North Africa (MENA), said, \"This new expansion helps us increase our delivery capabilities and speed, and support a wide range of sellers who offer a rich selection to our customers. We are well-positioned to accelerate their entrepreneurial journey and aspire to help our independent partners grow to their full potential by providing them with logistics, programmes and resources to seamlessly scale their businesses online.\"</p><p>© Copyright 2021 Emirates News Agency (WAM) Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SyndiGate. All Rights Reserved.</p></div>"}