{"date": "2022-02-23 04:44:43.409000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Feb. 23 -- Amazon Prime Video will stream The Rings of Power, a spin-off of The Lord of the Rings franchise, on 2 September. The show will be available in Hindi, Tamil, Telugu and Malayalam.</p><p>The Lord of the Rings is a series of three epic fantasy adventure films directed by Peter Jackson, based on the novel written by J.L.R Tolkien.</p></div><div class=\"tr-npp-body\"><p>American films, television shows and programming in Turkish, German and Korean languages -- including their dubbed versions -- are emerging as a big draw on over-the-top (OTT) video streaming services, making up as much as 30% of overall viewership, said senior executives at several of these platforms.</p><p>While such international content finds ready takers among young urban Indians in the metros, those in small towns benefit from their dubbed versions in both Hindi and regional languages.</p><p>Netflix's Extraction and The Kissing Booth have been popular in Hindi and Tamil as have Amazon's The Boys, The Tomorrow War, Wonder Woman and Parasite. Walt Disney, too, has decided to tap smaller towns by making Disney+ (including Marvel) content available even on its cheaper price plans in India to expand reach.</p><p>\"It is safe to say that today's consumer looks beyond geographical and language barriers and is prioritizing compelling stories and narratives. Localising great international content with dubs and subtitles helps take content viewership to a much wider audience,\" Vijay Subramaniam, former director and head of content, Amazon Prime Video India had said in an earlier interview to Mint.</p><p>While a handful of niche, foreign language TV channels and torrent websites on the Internet had introduced Indians to international content earlier, OTT platforms have helped improve ease of access. While metro audiences are over-saturated with the discovery of such international content on OTT, small towns have recently started acquiring a taste for what may be considered cool, and is part of social media chatter. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}