{"date": "2021-12-13 17:29:25+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The author is a Reuters Breakingviews columnist.  The opinions expressed are her own.</p><p class=\"tr-by\">By Jennifer Saba</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW YORK, Dec 13 (Reuters Breakingviews)</span><span class=\"tr-dl-sep\"> - </span>Walmart <a href=\"reuters://REALTIME/Verb=FullQuote/ric=WMT.N\" data-type=\"ric\" data-ric=\"WMT.N\" translate=\"no\" dir=\"ltr\">WMT.N</a> is trying to automate industry disruption. The giant retailer is making <a href=\"https://uploads-ssl.webflow.com/60aec8c9f7b01772271a622b/61b71efbc9279a4cf968844a_Symbotic%20Press%20Release.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">an investment</a> in a SoftBank-backed <a href=\"reuters://REALTIME/Verb=FullQuote/ric=9984.T\" data-type=\"ric\" data-ric=\"9984.T\" translate=\"no\" dir=\"ltr\">9984.T</a>  special-purpose acquisition company that is merging with Symbotic, a firm that specializes in robotic warehouse distribution. Like rival Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and its stake in Rivian Automotive <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RIVN.O\" data-type=\"ric\" data-ric=\"RIVN.O\" translate=\"no\" dir=\"ltr\">RIVN.O</a>, Walmart is making a low-risk, high reward bet.</p><p>The $391 billion company led by Doug McMillon is committing $150 million private investment in public equity, or PIPE, in SVF Investment Corp 3 <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SVFC.O\" data-type=\"ric\" data-ric=\"SVFC.O\" translate=\"no\" dir=\"ltr\">SVFC.O</a>. That’s a SPAC that said on Monday it will merge with Symbotic in a $5.5 billion deal. Walmart is not only an investor but also a customer, as Symbotic provides retailers with artificial intelligence-based machines and software to unpack and organize distribution warehouses. </p><p>Symbotic has $5 billion in contracts but it’s still finding its legs. In 2019 it generated just $92 million in revenue. Though it expects the top-line to balloon to more than $2 billion in 2026, like other SPAC deals, the trajectory is speculative. That requires revenue to double in each of the next three years and jump another 40% the following year.  </p><p>For Walmart, though, it may not matter. The $150 million PIPE commitment represents approximately 3% of what the company spent on capital expenditures for supply chain, technology and other initiatives during the first nine months ending Oct. 31, and is 0.1% of its operating expenses estimated for its fiscal year ended in January, according to Refinitiv. Meantime public investors and other PIPE partners will shoulder the cash risk of building out the company, and Walmart has offloaded operational risk, too. </p><p>Amazon’s Jeff Bezos took a nearly 20% equity stake <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2S12JJ\" data-type=\"storyId\" data-story-id=\"nL1N2S12JJ\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> in early-stage electric vehicle maker Rivian as the e-commerce giant wrestles with making customer deliveries more efficient and less costly. Like that deal, Walmart benefits from competitors’ transformations: Symbotic counts Walmart rivals Albertsons <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ACI.N\" data-type=\"ric\" data-ric=\"ACI.N\" translate=\"no\" dir=\"ltr\">ACI.N</a> and Target <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TGT.N\" data-type=\"ric\" data-ric=\"TGT.N\" translate=\"no\" dir=\"ltr\">TGT.N</a> as customers. </p><p>If it were fully owned by the behemoth, they would probably never consider using it, much like future owners of Rivian’s trucks. These types of arms-length deals enable giants like Amazon and Walmart to tap into their own future while benefitting from rivals’ transformations, too. Rivian is up more than 13% since it went public in November and is now worth nearly $100 billion. Walmart’s Symbotic interest is smaller but duplicates the wager on a robotic future. </p><p>Follow <a href=\"https://twitter.com/jennifersaba\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@jennifersaba</a> on Twitter</p><p>     </p><p>CONTEXT NEWS </p><p>- Symbiotic, a firm that automates distribution warehouses, agreed on Dec. 13 to merge with SVF Investment Corp 3, a special-purpose acquisition company, sponsored by an affiliate of SoftBank Investment Advisers. The deal has an equity value of $5.5 billion.</p><p>- Walmart is committing $150 million known as a “private investment in public equity,” or PIPE.</p><p><br/></p><p class=\"tr-signoff\"> (Editing by Lauren Silva Laughlin and Sharon Lam)</p><p class=\"tr-contactinfo\">((For previous columns by the author, Reuters customers can click on <a href=\"reuters://REALTIME/verb=Headlines/ric=SABA/\" data-type=\"newsExpression\" data-expression=\"SABA/\" translate=\"no\" dir=\"ltr\">SABA/</a> <br/> SIGN UP FOR BREAKINGVIEWS EMAIL ALERTS <a href=\"https://bit.ly/BVsubscribe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://bit.ly/BVsubscribe</a> | <a href=\"mailto:jennifer.saba@thomsonreuters.com\" data-type=\"email\" translate=\"no\">jennifer.saba@thomsonreuters.com</a> ; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://jennifer.saba.thomsonreuters.com@reuters.net\">jennifer.saba.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SYMBOTIC-M&amp;A/BREAKINGVIEWS</p></div>"}