{"date": "2021-12-07 15:11:08.558000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">World's First Large Freighter Door De Havilland Dash8-300 Goes Into Service</p>\n<p>SAINT-LAURENT, QC, Feb. 9, 2022</p>\n<p>\n<span>SAINT-LAURENT, QC</span> , <span>Feb. 9, 2022</span> /CNW Telbec/ - Air Inuit today announced the world's first large freighter door Dash8-300 aircraft officially joined its fleet. Following more than 36 months of planning, design, retrofitting and safety testing, the custom-modified aircraft received its Supplemental Type Certificate from Transport Canada on <span>February 3</span>\n<span>rd</span> .</p>\n<p>\n\n</p>\n<p>Equipping a Dash8-300 with a custom-built large freighter door is not only a world's first, but also a practical way to improve the essential service Air Inuit provides every day. By eventually facilitating the use of palettes for moving food and other goods, loading and unloading times can be shortened while reducing the risk of damage to fragile cargo such as fresh fruits and vegetables.</p>\n<p>This initiative was achieved thanks to the expert technical support of Rockwell Collins, and aligns with Air Inuit's continuous pursuit of solutions to meet the needs of its customers and those of the northern region while working to improve its environmental footprint.</p>\n<p>\n<span>Innovation to meet unique challenges</span>\n</p>\n<p>A crucial part of Air Inuit's mission serving 14 communities throughout <span>Northern Quebec</span> is the delivery of essential goods and oversized materials. In the absence of road access, Air Inuit provides a vital link ensuring cargo ranging from food to indispensable tools such as ATV's and snowmobiles can be delivered reliably and affordably.</p>\n<p>\n<span>\"The introduction of this innovative design to Air Inuit's fleet is about more than the convenience and reliability the people of Nunavik have come to expect. It is about recognizing the specific challenges of the communities we serve, and finding an innovative new way to support the development of those communities. Hats off to our team and partners for achieving this.\"</span> –Christian Busch, President &amp; CEO, Air Inuit</p>\n<p>Air Inuit selected the reliable, Canadian-made Dash8-300 because it represents the intersection between capacity and adaptability. Well-suited for locations that often have short gravel runways, the Dash8-300 has also proven itself in the challenging weather conditions of Nunavik. This one-of-a-kind addition helps Air Inuit fulfill its mission to serve and develop communities across Nunavik and beyond.</p>\n<p>\n<span>Helping the environment</span>\n</p>\n<p>The development of Air Inuit's first large freighter door Dash8-300 was made possible in part thanks to an important contribution from the Quebec Government's Fonds Vert. This support was crucial in advancing this innovation, which means using a more energy-efficient Dash8-300 in place of other aging cargo planes such as the HS-748, which used 30% more fuel and was retired several years ago from Air Inuit's fleet.</p>\n<p>\n<span>Specifications</span>\n</p>\n<p>\n<span>Aircraft Model: Dash8-300</span>\n<span>Max Weight</span> : 43,000 lbs / 19,500 kgCruising Speed: 328 mph / 530 kmhRange: 968 miles / 1,550 kmLarge Freighter Door - Clear Opening: 108\" x 68\" / 274 cm x 173 cm</p>\n<p>\n<span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3438254-1&amp;h=848554250&amp;u=https%3A%2F%2Fwww.dropbox.com%2Fsh%2Fu4vo5xksrg9gly9%2FAAB-qH53K7syGvvGqixn1aNGa%3Fdl%3D0&amp;a=PHOTO+GALLERY\" data-type=\"url\" class=\"tr-link\" translate=\"no\">PHOTO GALLERY</a>\n</span>\n</p>\n<p>\n<span>About Air Inuit</span>\n</p>\n<p>Founded by the Inuit in 1978, Air Inuit was created to provide air connections between Nunavik's 14 coastal villages, to promote trade and to preserve Inuit culture. The company is also committed to the development of this immense territory and the prosperity of its people by providing support to various community organizations, cultural events, educational and sports programs, as well as the implementation of employment access programs for Inuit people.</p>\n<p>\n\n</p>\n<p>SOURCE Air Inuit</p>\n<p>View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/February2022/09/c5875.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/February2022/09/c5875.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}