{"date": "2022-01-20 07:10:29.885000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 0163ZNetwork International Holdings PLC20 January 2022</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>20 <span>th</span> January 2022: Network International Holdings Plc</span>\n<span>\n<span>\n<span>trading update</span>\n</span>\n</span>\n</p>\n<p>\n<span>Key headlines</span>\n</p>\n<p>\n<span>·</span>\n<span>FY21 total Group revenue of cUSD 351m <span>1</span> ahead of consensus <span>2</span>\n</span>\n<span>, including a cUSD 7m contribution from DPO Group.</span>\n</p>\n<p>\n<span>·</span>\n<span>FY21 Group underlying EBITDA <span>1</span> also anticipated to be slightly ahead of market expectations,</span>\n<span>which includes a positive contribution from DPO Group.</span>\n</p>\n<p>\n<span>·</span>\n<span>2021 saw significant momentum in new business:</span> New merchant signings continued to hit record levels every quarter, and we signed 17 new financial institution customers.</p>\n<p>\n<span>·</span>\n<span>Direct-to-merchant business ahead of pre-pandemic trading levels by the end of the year.</span> Supported by strong sales execution, capability launches and underlying digital payments market growth.</p>\n<p>\n<span>·</span>\n<span>DPO trading strongly</span>\n<span>with FY21</span>\n<span>revenue growth of 45% y/y and 33% in constant currency</span>\n<span>, with growing confidence in the future delivery of revenue synergies.</span>\n</p>\n<p>\n<span>·</span>\n<span>Saudi Arabia market entry on track</span>\n<span>for Q1 2022 launch and a new processing customer signed.</span>\n</p>\n<p>\n<span>·</span>\n<span>Exit of non-core investments in Transguard Cash and Mercury</span>\n<span>to focus on higher growth investments.</span>\n</p>\n<p>\n<span>\n<span>1.</span>\n</span>\n<span>The acquisition of DPO Group was completed on 29 Sept 2021. FY 2021 financials above include a 3-month contribution from DPO and are subject to final audit. 2021 Preliminary financials will be confirmed on March 9th, 2022. <span>2.</span> Consensus expectation of USD 347m includes a 3-month contribution from DPO</span>\n</p>\n<p>\n<span>Fourth quarter trading and business update</span>\n</p>\n<p>\n<span>Q4 trading results detailed below represent the Network International standalone business and do not include DPO, unless otherwise stated.</span>\n</p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n</p></td>\n<td colspan=\"6\">\n<p>\n<span>Growth compared with 2020</span>\n</p>\n</td>\n<td colspan=\"4\">\n<p>\n<span>Growth compared with 2019</span>\n</p>\n</td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n<span>Q1</span>\n</p>\n</td>\n<td>\n<p>\n<span>Q2</span>\n</p>\n</td>\n<td>\n<p>\n<span>Q3</span>\n</p>\n</td>\n<td>\n<p>\n<span>Q4</span>\n</p>\n</td>\n<td>\n<p>\n<span>FY</span>\n</p>\n</td>\n<td>\n<p>\n<span>Q1</span>\n</p>\n</td>\n<td>\n<p>\n<span>Q2</span>\n</p>\n</td>\n<td>\n<p>\n<span>Q3</span>\n</p>\n</td>\n<td>\n<p>\n<span>Q4</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>FY</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Total revenue</span>\n</p>\n</td>\n<td>\n<p>\n<span>1%</span>\n</p>\n</td>\n<td>\n<p>\n<span>36%</span>\n</p>\n</td>\n<td>\n<p>\n<span>19%</span>\n</p>\n</td>\n<td>\n<p>\n<span>30% <span>4</span>\n</span>\n</p>\n</td>\n<td>\n<p>\n<span>21%</span>\n</p>\n</td>\n<td>\n<p>\n<span>1%</span>\n</p>\n</td>\n<td>\n<p>\n<span>4%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(1)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>6%</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>3%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Merchant Solutions revenue</span>\n</p>\n</td>\n<td>\n<p>\n<span>(3)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>86%</span>\n</p>\n</td>\n<td>\n<p>\n<span>38%</span>\n</p>\n</td>\n<td>\n<p>\n<span>58%</span>\n</p>\n</td>\n<td>\n<p>\n<span>40%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(11)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>4%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(3)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>8%</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>0%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>of which direct TPV</span>\n</p>\n</td>\n<td>\n<p>\n<span>(8)% <span>\n<span>3</span>\n</span>\n</span>\n</p>\n</td>\n<td>\n<p>\n<span>69%</span>\n</p>\n</td>\n<td>\n<p>\n<span>22%</span>\n</p>\n</td>\n<td>\n<p>\n<span>36%</span>\n</p>\n</td>\n<td>\n<p>\n<span>25% <span>3</span>\n</span>\n</p>\n</td>\n<td>\n<p>\n<span>(15)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(10)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(3)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>12%</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>(4)%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Issuer Solutions revenue</span>\n</p>\n</td>\n<td>\n<p>\n<span>5%</span>\n</p>\n</td>\n<td>\n<p>\n<span>15%</span>\n</p>\n</td>\n<td>\n<p>\n<span>9%</span>\n</p>\n</td>\n<td>\n<p>\n<span>13%</span>\n</p>\n</td>\n<td>\n<p>\n<span>11%</span>\n</p>\n</td>\n<td>\n<p>\n<span>7%</span>\n</p>\n</td>\n<td>\n<p>\n<span>5%</span>\n</p>\n</td>\n<td>\n<p>\n<span>2%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(2)%</span>\n</p>\n</td>\n<td colspan=\"2\">\n<p>\n<span>3%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n</td><td>\n</td><td>\n</td><td>\n</td><td>\n</td><td>\n</td><td>\n</td><td>\n</td><td>\n</td><td>\n</td><td>\n</td><td>\n</td></tr>\n</tbody>\n</table></div>\n<p>\n<span>\n<span>3.</span>\n</span>\n<span>Growth data presented on a like-for-like basis, removing the impact of one additional day in the calendar month of February 2020 <span>4.</span> Including the three month contribution from DPO, y/y growth is 39%.</span>\n</p>\n<p>\n<span>Merchant Solutions business:</span>\n</p>\n<p>\n<span>·</span>\n<span>Strong direct TPV growth</span>\n<span>, up 12% in Q4 vs 2019. In November and December, Domestic TPV saw mid to high teens growth vs 2019; whilst International TPV rebounded strongly and was up 6% and 12% respectively vs 2019.</span>\n</p>\n<p>\n<span>·</span>\n<span>Performance reflects the broader economic recovery in our regions and the results of our strategy to deliver market leading digital payment services for merchant customers.</span>\n</p>\n<p>\n<span>o</span>\n<span>Merchant signups for Q4 were the highest recorded in the year</span>\n<span>, supported by our recent launch of digital onboarding.</span>\n</p>\n<p>\n<span>o</span>\n<span>Continued strong momentum in online TPV</span>\n<span>, with Q4 up 131% vs 2019 (excl. Government &amp; airline TPV). To enhance our online offer we recently launched 'DPO Pay' to UAE merchants, a convenient solution for SMEs which includes an online store and payment checkout.</span>\n</p>\n<p>\n<span>o</span>\n<span>Rapid SME growth</span>\n<span>supported by dedicated relationship management, referral partnerships and bespoke services such as merchant lending and low cost 'Tap on Phone' acceptance. SME TPV represented</span>\n<span>25% of total direct TPV in 2021, compared with 17% in 2019.</span>\n</p>\n<p>\n<span>o</span>\n<span>We offer the widest range of payment acceptance for UAE merchants</span>\n<span>and will soon expand this further with UPI Payments, a popular App payment method for Indian consumers.</span>\n</p>\n<p>\n<span>o</span>\n<span>Our value-added services continue to expand</span>\n<span>with the launch of Smartview interactive dashboards that provide valuable insights into consumer spending trends for merchants.</span>\n</p>\n<p>\n<span>Issuer Solutions business:</span>\n</p>\n<p>\n<span>·</span>\n<span>Revenue (2)%</span>\n<span>\n<span>vs Q4 2019,</span>\n</span>\n<span>which was a strong comparable. Q4 2021 revenue showed significant growth sequentially from Q3; and FY 2021 revenue was 3% higher overall vs. FY 2019.</span>\n</p>\n<p>\n<span>·</span>\n<span>Three financial institution customer wins</span>\n<span>and four notable contract extensions or renewals.</span>\n</p>\n<p>\n<span>·</span>\n<span>New customer signed in Saudi Arabia</span>\n<span>and a healthy pipeline in place. Market entry on track with the appointment of a new Managing Director and launch of services expected in Q1 2022.</span>\n</p>\n<p>\n<span>·</span>\n<span>\n<span>Signed our first digital platform Issuer Solutions customer</span>\n</span>\n<span>in partnership with Mastercard for</span>\n<span>NBS Bank in Malawi</span>\n<span>.</span>\n</p>\n<p>\n<span>DPO Group:</span>\n</p>\n<p>\n<span>·</span>\n<span>Continued strong growth at DPO group:</span>\n<span>Q4 2021 TPV growth of 40% y/y or 41% in constant FX; and revenue growth of 29% y/y or 30% y/y in constant FX.</span>\n</p>\n<p>\n<span>·</span>\n<span>Confidence in the delivery of revenue synergies</span>\n<span>through the signing of another cross-selling agreement between DPO and our existing financial institution customer, Orabank.</span>\n</p>\n<p>\n<span>Strategic exit of non-core operations:</span>\n</p>\n<p>\n<span>·</span>\n<span>Sold our 70% holding in Mercury Payments Services LLC for cUSD 3m</span>\n<span>, before completion adjustments. Immaterial impact to future Group financials.</span>\n</p>\n<p>\n<span>Nandan Mer, Chief Executive Officer, commented:</span>\n</p>\n<p>\n<span>\"There is much to feel positive about, having ended the year strongly. We have made excellent progress on successfully refocusing our strategy to drive accelerated growth and innovation.</span>\n</p>\n<p>\n<span>The UAE market has seen a significant rebound in consumer spending and international tourism, and it is encouraging to see our merchant business going from strength-to-strength. This has been supported by record levels of merchant signups, reflecting our continued efforts to enhance our sales strategies, improve merchant on-boarding and continually bring new services to customers.</span>\n</p>\n<p>Our market entry to Saudi Arabia is on-track and we have signed a new processing customer that is expected to become a key contributor to long term revenues.</p>\n<p>DPO continues to trade strongly, with their revenue performance for the year representing an acquisition revenue multiple of less than 11x. They have also moved into positive EBITDA generation, ahead of our expectations.</p>\n<p>Overall, we are pleased with the positive momentum across our business, giving us confidence as <span>we enter 2022 and work towards our target of 20%+ revenue growth.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Strategy and business update</span>\n</p>\n<p>\n<span>Record number of new merchant wins and several contract renewals</span>\n</p>\n<p>Our Merchant Solutions business continues to see high levels of new business wins, including record levels of merchant signings in the quarter. Within the new merchant additions, notable wins away from competitors include several hotels such as Double Tree Hilton, Yas Residences and Courtyard by Marriot Al Jaddaf. Merchant wins across the entertainment and food and beverage sectors, remained high. In our data solutions business, we signed an expanded and extended contract with a major UAE tourist authority, as well as a new agreement with a significant UAE government authority. We also secured a new e-commerce contract, cross-selling DPO's capabilities into three West African countries through our partnership with Orabank, which will allow us to grow our merchant footprint across the Cote D'Ivoire, Senegal and the Togolese Republic.</p>\n<p>In Issuer Solutions, we continue to gain traction and secured three new financial institutions and fintechs in the period. This includes two in the Levant region; <span>NeoBank, and Jordan's first licensed fintech</span> MadfooatCom; where we will issue, host and process credentials alongside a range of other services including 3-D Secure for both financial institutions. We also renewed our existing processing agreement with Société General in Ghana for a further five years, extended our partnership with the Bank of Egypt and renewed our contract with the National Bank of Fujairah in the UAE.</p>\n<p>\n<span>New capability launches for merchant customers</span>\n</p>\n<p>\n<span>We continue to innovate and strengthen our direct-to-merchant business to extend our market leading positions in the UAE and Jordan. This business line remains a key strategic focus and we made several enhancements during the quarter, with a healthy pipeline to come.</span>\n</p>\n<p>\n<span>Expanding the range of payment methods which merchants can accept:</span>\n</p>\n<p>\n<span>·</span>\n<span>The acceptance of Unified Payments Interface (UPI), a mobile-based real time payment system which enables Indian consumers to make seamless and secure payments through UPI-based mobile apps across our merchant network in the UAE. This adds to our recent launches of international payment methods, such as the Indian card scheme Rupay; and the Russian card scheme MIR.</span>\n</p>\n<p>\n<span>·</span>\n<span>Partnering with Amazon Payment Services to provide our UAE merchants with a wider selection of local online payment acceptance methods for their e-commerce offering.</span>\n</p>\n<p>\n<span>Enhancing our online and SME payment services:</span>\n</p>\n<p>\n<span>·</span>\n<span>Launching \"DPO Pay\" to merchants in the UAE, a cost effective and convenient online payment solution for SMEs. The offering includes the setup of an online store and payment checkout.</span>\n</p>\n<p>\n<span>Delivering more value-added services to merchants:</span>\n</p>\n<p>\n<span>·</span>\n<span>Launching Smartview interactive dashboards that provide valuable insights on consumer spending trends across merchants' own businesses and the wider marketplace.</span>\n</p>\n<p>\n<span>·</span>\n<span>Enabling our Jordan merchants to facilitate consumer cashback services through Point-of-Sale (POS) terminals.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>New services and solutions for financial institution customers</span>\n</p>\n<p>\n<span>We recently supported the launch of the first-ever digital card offering in the UAE for Al Maryah Community Bank, providing their customers with both digital and physical cards. The collaboration will allow us to support Al Maryah Community Banks' credit and debit card offerings alongside instant issuing, ATM services, digital commerce transactions and e-wallet purchases.</span>\n</p>\n<p>\n<span>We have introduced our 'Pin through SMS' service to a number of financial institutions in Jordan, allowing Bank customers to activate their cards and receive PIN reminders in a more secure and convenient way.</span>\n</p>\n<p>\n<span>Through our partnership with Infobip we will soon be launching Chat banking solutions to our financial institution customers, providing services such as account transaction enquiries, real-time customer service chat and push notifications to their customers.</span>\n</p>\n<p>\n<span>DPO is trading well and generating positive EBITDA</span>\n</p>\n<p>\n<span>DPO continues to trade well, delivering total revenue of c.USD 27 million in 2021, of which cUSD 7 million (three months) will contribute to Network International Group financials following completion of the acquisition at the end of September 2021. On a full year basis, this translates to revenue growth of 45% y/y, and 33% in constant currency terms.</span>\n<span>Q4 2021 saw TPV growth of 40% y/y or 41% in constant FX; and revenue growth of 29% y/y and 30% in constant FX.</span>\n<span>This performance was supported by notable new business wins including Pizza Hut Nigeria, StarTimes Uganda and restaurant chains such as Steers and Debonairs, with the overall active merchant count reaching 64,000 by year end.</span>\n</p>\n<p>\n<span>Kingdom of Saudi Arabia market entry on-track and a new customer signed</span>\n</p>\n<p>We have secured an Issuer Solutions prepaid card processing client win, which is expected to become a meaningful revenue contributor over the long term; with a healthy pipeline of potential future customers. The testing of our technology platform is progressing well and deployment to the cloud environment remains on track. We appointed Abdulaziz Al-Dahmash as Managing Director for our operations in the Kingdom of Saudi Arabia, effective 1st January 2022. Abdulaziz is well known in the Saudi payments industry having joined the Saudi Central Bank in 2003 and played a major role in several payment initiatives. <span> We remain optimistic and committed to launching our full Issuer processing services in Q1 2022.</span></p>\n<p>\n<span>Mastercard partnership continues to strengthen</span>\n</p>\n<p>\n<span>Our strategic partnership with Mastercard continues to progress well and together we are making significant strides in accelerating the acceptance of digital payments across all our markets. We will soon be launching our new 'SME in a box' offering, allowing new merchants and SMEs to accept digital payments using a mobile phone, without the need for a payment terminal. Due to be launched early this year, 'SME in a box' will be powered by Mastercard Payment Gateway Services (MPGS), and will provide SME merchants with a simple, seamless, and convenient platform to accept payments.</span>\n</p>\n<p>\n<span>We will also be accelerating digital payments adoption in Malawi through our recent partnership with Mastercard and NBS Bank Malawi, who are our first digital platform Issuer Solutions customer.</span>\n</p>\n<p>We are in the process of implementing our next-generation authentication solution for UAE financial institutions through 3-D Secure 2.0. The service provides enhanced insights and fraud checking capabilities through data for our processing customers. This is becoming increasingly relevant to our customers as more transactions are taking place online. The new solution is also compatible with biometric and alternative authentication methods, which enhances the consumer experience and leads to high transaction approval rates.</p>\n<p>\n<span>Strategic exit of Mercury investment</span>\n</p>\n<p>\n<span>We have sold our 70% holding in domestic UAE card scheme, Mercury Payments Services LLC; an asset which is considered non-core to our high growth strategy. The consideration is cUSD 3m, before completion adjustments, and the divestment will have an immaterial impact to future Group financials. In 2020, the results for Mercury were fully consolidated in our financial statements, generating revenue of USD 0.6 million and an EBITDA loss of USD (1.3) million.</span>\n</p>\n<p>\n<span>Fourth quarter trading</span>\n</p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n<span>Q4 2021 growth compared with Q4 2020</span>\n</p>\n</td>\n<td>\n<p>\n<span>Q4 2021 growth compared with Q4 2019</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Total revenue</span>\n</p>\n</td>\n<td>\n<p>\n<span>30%</span>\n</p>\n</td>\n<td>\n<p>\n<span>6%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Merchant Solutions revenue</span>\n</p>\n</td>\n<td>\n<p>\n<span>58%</span>\n</p>\n</td>\n<td>\n<p>\n<span>8%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Direct Total Processed Volume (TPV)</span>\n</p>\n</td>\n<td>\n<p>\n<span>36%</span>\n</p>\n</td>\n<td>\n<p>\n<span>12%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Of which domestic TPV</span>\n</p>\n</td>\n<td>\n<p>\n<span>18%</span>\n</p>\n</td>\n<td>\n<p>\n<span>14%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Of which international TPV</span>\n</p>\n</td>\n<td>\n<p>\n<span>168%</span>\n</p>\n</td>\n<td>\n<p>\n<span>5%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Issuer Solutions revenue</span>\n</p>\n</td>\n<td>\n<p>\n<span>13%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(2)%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n<span>Note:</span>\n</span>\n<span>Trading results do not include any contribution from DPO and represent Network International standalone</span>\n</p>\n<p>\n<span>Merchant Solutions</span>\n<span>revenue grew 58% y/y, within which directly acquired TPV was up 36% y/y.</span>\n</p>\n<p>\n<span>Compared with Q4 2019, revenue was up 8% and directly acquired TPV grew 12%. Take rates for Q4 2021 remained sequentially stable compared to those in Q3 2021. Domestic consumer spending with our merchant customers in the UAE and Jordan has improved significantly, having moved into growth versus 2019 as early as August 2021. This trend continued, showing growth of mid to high teens vs 2019 as we exited the final quarter. International spending also continued to improve and moved into growth vs pre-pandemic levels during November 2021, finishing the year very strongly with December spends up 12% compared with 2019. The strong overall Q4 TPV performance is reflective of regional economic recovery from the pandemic, improving travel confidence from international tourists coming to Dubai, and seasonal activities including major sporting events and the Dubai EXPO.</span>\n</p>\n<p>\n<span>Issuer Solutions</span>\n<span>saw 13% revenue growth y/y, with the division less impacted by COVID-19 dynamics in the prior year, when compared with the Merchant Solutions business.</span>\n</p>\n<p>\n<span>In comparison to Q4 2019, revenue was down (2)%, which reflects a strong comparator in 2019 when a number of financial institutions undertook card portfolio renewals and new portfolio issuance; and we saw some one-off revenue streams. However, the Q4 2021 showed a strong absolute improvement in revenue compared with the previous quarter and KPIs across credentials hosted, and transaction numbers, were ahead of pre-pandemic levels. Overall, the rate of new customer wins and contract renewals remain encouraging across the business.</span>\n</p>\n<p>\n<span>Merchant sector trends in directly acquired Total Processed Volume (TPV)</span>\n</p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>Growth in directly acquired TPV, y/y</span>\n</p>\n</td>\n<td>\n<p>\n<span>Jan</span>\n</p>\n</td>\n<td>\n<p>\n<span>Feb</span>\n</p>\n</td>\n<td>\n<p>\n<span>Mar</span>\n</p>\n</td>\n<td>\n<p>\n<span>Apr</span>\n</p>\n</td>\n<td>\n<p>\n<span>May</span>\n</p>\n</td>\n<td>\n<p>\n<span>Jun</span>\n</p>\n</td>\n<td>\n<p>\n<span>Jul</span>\n</p>\n</td>\n<td>\n<p>\n<span>Aug</span>\n</p>\n</td>\n<td>\n<p>\n<span>Sep</span>\n</p>\n</td>\n<td>\n<p>\n<span>Oct</span>\n</p>\n</td>\n<td>\n<p>\n<span>Nov</span>\n</p>\n</td>\n<td>\n<p>\n<span>Dec</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Total</span>\n</p>\n</td>\n<td>\n<p>\n<span>(18)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(17)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>19%</span>\n</p>\n</td>\n<td>\n<p>\n<span>104%</span>\n</p>\n</td>\n<td>\n<p>\n<span>70%</span>\n</p>\n</td>\n<td>\n<p>\n<span>44%</span>\n</p>\n</td>\n<td>\n<p>\n<span>19%</span>\n</p>\n</td>\n<td>\n<p>\n<span>21%</span>\n</p>\n</td>\n<td>\n<p>\n<span>26%</span>\n</p>\n</td>\n<td>\n<p>\n<span>39%</span>\n</p>\n</td>\n<td>\n<p>\n<span>39%</span>\n</p>\n</td>\n<td>\n<p>\n<span>31%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>of which Retail</span>\n</p>\n</td>\n<td>\n<p>\n<span>(7)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>0%</span>\n</p>\n</td>\n<td>\n<p>\n<span>65%</span>\n</p>\n</td>\n<td>\n<p>\n<span>274%</span>\n</p>\n</td>\n<td>\n<p>\n<span>82%</span>\n</p>\n</td>\n<td>\n<p>\n<span>45%</span>\n</p>\n</td>\n<td>\n<p>\n<span>10%</span>\n</p>\n</td>\n<td>\n<p>\n<span>13%</span>\n</p>\n</td>\n<td>\n<p>\n<span>34%</span>\n</p>\n</td>\n<td>\n<p>\n<span>46%</span>\n</p>\n</td>\n<td>\n<p>\n<span>31%</span>\n</p>\n</td>\n<td>\n<p>\n<span>27%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>of which Supermarkets</span>\n</p>\n</td>\n<td>\n<p>\n<span>8%</span>\n</p>\n</td>\n<td>\n<p>\n<span>8%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(17)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(7)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(1)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>0%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(5)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>0%</span>\n</p>\n</td>\n<td>\n<p>\n<span>2%</span>\n</p>\n</td>\n<td>\n<p>\n<span>4%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(2)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>1%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>of which Travel &amp; Entertainment</span>\n</p>\n</td>\n<td>\n<p>\n<span>(44)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(46)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>36%</span>\n</p>\n</td>\n<td>\n<p>\n<span>669%</span>\n</p>\n</td>\n<td>\n<p>\n<span>386%</span>\n</p>\n</td>\n<td>\n<p>\n<span>211%</span>\n</p>\n</td>\n<td>\n<p>\n<span>101%</span>\n</p>\n</td>\n<td>\n<p>\n<span>53%</span>\n</p>\n</td>\n<td>\n<p>\n<span>85%</span>\n</p>\n</td>\n<td>\n<p>\n<span>115%</span>\n</p>\n</td>\n<td>\n<p>\n<span>119%</span>\n</p>\n</td>\n<td>\n<p>\n<span>61%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>of which Other (Government, Healthcare &amp; Education, Other)</span>\n</p>\n</td>\n<td>\n<p>\n<span>(13)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(14)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>16%</span>\n</p>\n</td>\n<td>\n<p>\n<span>87%</span>\n</p>\n</td>\n<td>\n<p>\n<span>57%</span>\n</p>\n</td>\n<td>\n<p>\n<span>30%</span>\n</p>\n</td>\n<td>\n<p>\n<span>11%</span>\n</p>\n</td>\n<td>\n<p>\n<span>21%</span>\n</p>\n</td>\n<td>\n<p>\n<span>16%</span>\n</p>\n</td>\n<td>\n<p>\n<span>23%</span>\n</p>\n</td>\n<td>\n<p>\n<span>28%</span>\n</p>\n</td>\n<td>\n<p>\n<span>28%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Total</span>\n</p>\n</td>\n<td>\n<p>\n<span>(18)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(17)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>19%</span>\n</p>\n</td>\n<td>\n<p>\n<span>104%</span>\n</p>\n</td>\n<td>\n<p>\n<span>70%</span>\n</p>\n</td>\n<td>\n<p>\n<span>44%</span>\n</p>\n</td>\n<td>\n<p>\n<span>19%</span>\n</p>\n</td>\n<td>\n<p>\n<span>21%</span>\n</p>\n</td>\n<td>\n<p>\n<span>26%</span>\n</p>\n</td>\n<td>\n<p>\n<span>39%</span>\n</p>\n</td>\n<td>\n<p>\n<span>39%</span>\n</p>\n</td>\n<td>\n<p>\n<span>31%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>of which Domestic</span>\n</p>\n</td>\n<td>\n<p>\n<span>(7)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(8)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>17%</span>\n</p>\n</td>\n<td>\n<p>\n<span>78%</span>\n</p>\n</td>\n<td>\n<p>\n<span>50%</span>\n</p>\n</td>\n<td>\n<p>\n<span>28%</span>\n</p>\n</td>\n<td>\n<p>\n<span>9%</span>\n</p>\n</td>\n<td>\n<p>\n<span>12%</span>\n</p>\n</td>\n<td>\n<p>\n<span>16%</span>\n</p>\n</td>\n<td>\n<p>\n<span>19%</span>\n</p>\n</td>\n<td>\n<p>\n<span>18%</span>\n</p>\n</td>\n<td>\n<p>\n<span>17%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>of which International</span>\n</p>\n</td>\n<td>\n<p>\n<span>(47)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(47)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>35%</span>\n</p>\n</td>\n<td>\n<p>\n<span>753%</span>\n</p>\n</td>\n<td>\n<p>\n<span>530%</span>\n</p>\n</td>\n<td>\n<p>\n<span>337%</span>\n</p>\n</td>\n<td>\n<p>\n<span>206%</span>\n</p>\n</td>\n<td>\n<p>\n<span>155%</span>\n</p>\n</td>\n<td>\n<p>\n<span>160%</span>\n</p>\n</td>\n<td>\n<p>\n<span>249%</span>\n</p>\n</td>\n<td>\n<p>\n<span>204%</span>\n</p>\n</td>\n<td>\n<p>\n<span>104%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Growth in directly acquired TPV vs 2019</span>\n</p>\n</td>\n<td>\n<p>\n<span>Jan</span>\n</p>\n</td>\n<td>\n<p>\n<span>Feb</span>\n</p>\n</td>\n<td>\n<p>\n<span>Mar</span>\n</p>\n</td>\n<td>\n<p>\n<span>Apr</span>\n</p>\n</td>\n<td>\n<p>\n<span>May</span>\n</p>\n</td>\n<td>\n<p>\n<span>Jun</span>\n</p>\n</td>\n<td>\n<p>\n<span>Jul</span>\n</p>\n</td>\n<td>\n<p>\n<span>Aug</span>\n</p>\n</td>\n<td>\n<p>\n<span>Sep</span>\n</p>\n</td>\n<td>\n<p>\n<span>Oct</span>\n</p>\n</td>\n<td>\n<p>\n<span>Nov</span>\n</p>\n</td>\n<td>\n<p>\n<span>Dec</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Total</span>\n</p>\n</td>\n<td>\n<p>\n<span>(14)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(18)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(14)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(17)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(8)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(5)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(11)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>2%</span>\n</p>\n</td>\n<td>\n<p>\n<span>0%</span>\n</p>\n</td>\n<td>\n<p>\n<span>7%</span>\n</p>\n</td>\n<td>\n<p>\n<span>12%</span>\n</p>\n</td>\n<td>\n<p>\n<span>16%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>of which Retail</span>\n</p>\n</td>\n<td>\n<p>\n<span>4%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(3)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>1%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(5)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>5%</span>\n</p>\n</td>\n<td>\n<p>\n<span>2%</span>\n</p>\n</td>\n<td>\n<p>\n<span>0%</span>\n</p>\n</td>\n<td>\n<p>\n<span>5%</span>\n</p>\n</td>\n<td>\n<p>\n<span>6%</span>\n</p>\n</td>\n<td>\n<p>\n<span>16%</span>\n</p>\n</td>\n<td>\n<p>\n<span>24%</span>\n</p>\n</td>\n<td>\n<p>\n<span>27%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>of which Supermarkets</span>\n</p>\n</td>\n<td>\n<p>\n<span>13%</span>\n</p>\n</td>\n<td>\n<p>\n<span>19%</span>\n</p>\n</td>\n<td>\n<p>\n<span>17%</span>\n</p>\n</td>\n<td>\n<p>\n<span>16%</span>\n</p>\n</td>\n<td>\n<p>\n<span>5%</span>\n</p>\n</td>\n<td>\n<p>\n<span>11%</span>\n</p>\n</td>\n<td>\n<p>\n<span>6%</span>\n</p>\n</td>\n<td>\n<p>\n<span>14%</span>\n</p>\n</td>\n<td>\n<p>\n<span>7%</span>\n</p>\n</td>\n<td>\n<p>\n<span>14%</span>\n</p>\n</td>\n<td>\n<p>\n<span>9%</span>\n</p>\n</td>\n<td>\n<p>\n<span>10%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>of which Travel &amp; Entertainment</span>\n</p>\n</td>\n<td>\n<p>\n<span>(44)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(53)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(48)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(47)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(27)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(30)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(32)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(30)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(22)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(3)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>3%</span>\n</p>\n</td>\n<td>\n<p>\n<span>5%</span>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>of which Other (Government, Healthcare &amp; Education, Other)</span>\n</p>\n</td>\n<td>\n<p>\n<span>(9)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(8)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(3)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(8)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(6)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>4%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(8)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>15%</span>\n</p>\n</td>\n<td>\n<p>\n<span>8%</span>\n</p>\n</td>\n<td>\n<p>\n<span>8%</span>\n</p>\n</td>\n<td>\n<p>\n<span>13%</span>\n</p>\n</td>\n<td>\n<p>\n<span>20%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Total</span>\n</p>\n</td>\n<td>\n<p>\n<span>(14)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(18)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(14)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(17)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(8)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(5)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(11)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>2%</span>\n</p>\n</td>\n<td>\n<p>\n<span>0%</span>\n</p>\n</td>\n<td>\n<p>\n<span>7%</span>\n</p>\n</td>\n<td>\n<p>\n<span>12%</span>\n</p>\n</td>\n<td>\n<p>\n<span>16%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>of which Domestic</span>\n</p>\n</td>\n<td>\n<p>\n<span>(3)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(3)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>0%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(6)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(4)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>2%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(1)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>14%</span>\n</p>\n</td>\n<td>\n<p>\n<span>9%</span>\n</p>\n</td>\n<td>\n<p>\n<span>11%</span>\n</p>\n</td>\n<td>\n<p>\n<span>14%</span>\n</p>\n</td>\n<td>\n<p>\n<span>17%</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>of which International</span>\n</p>\n</td>\n<td>\n<p>\n<span>(44)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(55)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(52)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(49)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(26)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(30)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(48)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(43)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(31)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>(4)%</span>\n</p>\n</td>\n<td>\n<p>\n<span>6%</span>\n</p>\n</td>\n<td>\n<p>\n<span>12%</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n<span>\n</span></span>\n</p>\n<p>\n<span>Upcoming events</span>\n</p>\n<p>\n<span>·</span>\n<span>UAE direct-to-merchant business virtual investor roundtable event: 26th January 2022</span>\n</p>\n<p>\n<span>o</span> Event time: 1pm UK/5pm UAE, Link to the event: <a href=\"https://zoom.us/j/94089827890?pwd=Nnhoc0RMVmhURFkzbSs4ZFMranlCdz09\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://zoom.us/j/94089827890?pwd=Nnhoc0RMVmhURFkzbSs4ZFMranlCdz09</a> ; Passcode: 488044</p>\n<p>\n<span>·</span>\n<span>FY 2021 preliminary results: 9 <span>th</span> March 2022</span>\n</p>\n<p>\n<span>·</span>\n<span>Q1 2022 trading statement: 27 <span>th</span> April 2022</span>\n</p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>Investor Relations enquiries</span>\n</p>\n</td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>Network International</p>\n</td>\n<td>\n<p>InvestorRelations@Network.Global</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Amie Gramlick, Head of Investor Relations</p>\n</td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Media enquiries</span>\n</p>\n</td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>Teneo</p>\n</td>\n<td>\n<p>NetworkInternational@Teneo.com</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Ben Foster, Andy Parnis</p>\n</td>\n<td>\n<p>\n</p></td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>Forward Looking Statements</span>\n</p>\n<p>\n<span>This announcement contains certain forward-looking statements with respect to the financial condition, results or operation and businesses of Network International Holdings Plc. Such statements and forecasts by their nature involve risks and uncertainty because they relate to future events and circumstances. There are a number of other factors that may cause actual results, performance or achievements, or industry results, to be materially different from those projected in the forward- looking statements.</span>\n</p>\n<p>\n<span>These factors include general economic and business conditions; changes in technology; timing or delay in signing, commencement, implementation and performance of programmes, or the delivery of products or services under them; industry; relationships with customers; competition; and ability to attract personnel. You are cautioned not to rely on these forward-looking statements, which speak only as of the date of this announcement. We undertake no obligation to update or revise any forward-looking statements to reflect any change in our expectations or any change in events, conditions or circumstances.</span>\n</p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>TSTGPUWWGUPPGRB</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}