{"date": "2022-01-26 18:12:46+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2799.72, "close": 2792.75}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        In today's world, enterprise customers are dominantly focused on their users and applications. The bridge that stitches them together is the Enterprise WAN, which not only needs to align with the growing complex needs of its users but also needs to be secure, scalable, resilient, and programable. Cisco SD-WAN brings together users, branches, applications, and data centers (on-prem or cloud) under one cohesive architecture to meet today's expectations. Cisco vManage provides a single pane of glass to provision, operate, and manage this network.\n      </p>\n                <p>\n        The enterprise cloud footprint is growing at a rapid pace, resulting in complex policies and designs for connectivity across enterprise sites and workloads in the cloud. Traditional AWS cloud-native service like AWS Transit Gateway is a regional construct, which performs well in a design involving transit gateway peering across a small number of AWS Regions. As more Regions are added, the network can get exponentially complex with additional transit gateway peering. Also, separate route tables for segmentation add another layer of complexity to the network.\n      </p>\n                <p>\n        Questions we typically hear from our customers are:\n      </p>\n                <ol>\n                  <li>\n          How do I easily deploy and manage a cloud network for segmented users, applications, and other resources dispersed across regions, while maintaining a hardened security posture?\n        </li>\n                  <li>\n          Can my network be agile enough to quickly adapt to changing policies and application requirements?\n        </li>\n                  <li>\n          What is the impact on the user experience for a multi-region application?\n        </li>\n                  <li>\n          My users connected to region X are having inconsistent experiences accessing an application in region Y. What can I do?\n        </li>\n                  <li>\n          Can I use the Cloud Service Provider (CSP) backbone as a faster way to connect my sites instead of less reliable internet?\n        </li>\n                </ol>\n                <p>\n        It basically drills down to having a more robust means to connect site-to-site, site-to-cloud workloads, and inter-Region workloads in AWS. This is exactly what the Cisco SD-WAN and AWS Cloud WAN integration can offer.\n      </p>\n                <p>\n                  <strong>AWS Cloud WAN</strong>\n                </p>\n                <p>\n        AWS Cloud WAN is a managed WAN solution that was announced at AWS re:Invent 2021. It enables users to build a multi-Region global WAN network on the AWS backbone using simple policy statements. It removes the need to stitch together multiple Regions as is the case with AWS Transit Gateway.\n      </p>\n                <p>\n                  <a href=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2022/01/Fig-1-AWS-Cloud-WAN.png\" data-type=\"url\" class=\"tr-link\" translate=\"no\">[Link]</a>\n                </p>\n                <p>\n        The key building blocks of the AWS Cloud WAN architecture are:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <strong>Cloud WAN:</strong> Cloud WAN is a managed WAN service that allows enterprises to establish network connectivity across the Region using the AWS backbone. Cloud WAN can be enabled in a Region that is near to sites, users, or workloads. Cloud WAN includes CNE (Core Network Edge) which is a Regional Connection Point. Resources are connected to CNE using attachments like VPC, VPN, etc.\n        </li>\n                  <li>\n                    <strong>Core Network Policy (CNP):</strong> A single JSON policy document that defines the whole configuration of the Cloud WAN. It lists the Regions through which the Cloud WAN extends. It carries the segment information which is used for routing separation. It also defines how the VPC and VPN attachments are connected to the network segments, along with route leak configuration for shared services use-cases.\n        </li>\n                  <li>\n                    <strong>Attachments:</strong> Attachments are a way to connect resources to the Cloud WAN. The types of attachments are VPC, VPN, Connect, and TGW.\n        </li>\n                  <li>\n                    <strong>Core Network Edge (CNE):</strong> The regional connection point managed by AWS in each Region, as defined in the Core Network Policy. Every attachment connects to a Core Network Edge.\n        </li>\n                </ul>\n                <p>\n        Based on CNP configuration, AWS Cloud WAN will create CNE in the configured Regions. The CNEs across all the Regions will automatically peer with each other. Cloud WAN also carries segment information across the Region, thus automatically creating end-to-end routing domain for each individual segment. Resources are attached to the CNE and are mapped to a segment.\n      </p>\n                <p>\n                  <a href=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2022/01/Fig-2-CNE.png\" data-type=\"url\" class=\"tr-link\" translate=\"no\">[Link]</a>\n                </p>\n                <p>\n        This Cloud WAN architecture's built-in automation manages the complexity and provides customers with a simple plug-n-play approach to deploy and manage the cloud network.\n      </p>\n                <p>\n                  <strong>Cisco SD-WAN Integration</strong>\n                </p>\n                <p>\n        The Cisco SD-WAN Cloud OnRamp for Multicloud with AWS, provides enterprise customers the following capabilities to deploy a secure SD-WAN fabric over a reliable AWS Cloud WAN backbone.\n      </p>\n                <ol>\n                  <li>\n                    <strong>Automation</strong>: The integrated solution gives users the automation to integrate their SD-WAN policies with AWS cloud-native constructs for reliable and consistent sites and cloud deployments. Cisco vManage simplifies the process of creating and managing the Core Network Policy (CNP) document and AWS manages the implementation details.\n        </li>\n                  <li>\n                    <strong>Security</strong>: AWS Cloud WAN's built-in network segmentation enables seamless integration with Cisco SD-WAN to provide end-to-end segmentation. Using a simple workflow in Cisco vManage, enterprise customers can deploy carrier grade transport (across Regions) using the AWS backbone.\n        </li>\n                  <li>\n                    <strong>Observability</strong>: Cisco SD-WAN integration with AWS Cloud WAN simplifies operations by enabling visibility for the SD-WAN overlay and AWS Cloud WAN underlay in the vManage portal.\n        </li>\n                </ol>\n                <p>\n                  <a href=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2022/01/Fig-3-Cloud-WAN-and-SD-WAN.png\" data-type=\"url\" class=\"tr-link\" translate=\"no\">[Link]</a>\n                </p>\n                <p>\n        Cisco vManage will:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          Discover workload VPC across regions\n        </li>\n                  <li>\n          Tag the VPC attachment to map to a desired segment (VPN)\n        </li>\n                  <li>\n          Deploy Cloud Gateway (CGW)\n        </li>\n                  <li>\n          Instantiate CNE in the required region\n        </li>\n                  <li>\n          Instantiate Transit VPC (TVPC) with pair of Cisco SD-WAN virtual edge routers\n        </li>\n                  <li>\n          Establish VPN or Connect attachment and BGP peering between CNE and SD-WAN virtual edge router for each segment/VPN\n        </li>\n                  <li>\n          Realize Intent by mapping SD-WAN VPN to AWS Cloud WAN segments\n        </li>\n                </ul>\n                <p>\n        With the help of Cloud Gateway (CGW), the Cisco SD-WAN fabric is extended to the edge of the AWS Cloud in the desired Region. As shown in the topology above, Cisco vManage manages the SD-WAN policy across the fabric. This enables vManage to push consistent SD-WAN policies to the branches and Cisco SD-WAN virtual edge router in the TVPC. With the AWS Cloud WAN integration, vManage can create and update the CNP document. Using API calls, vManage pushes the CNP to AWS. AWS Cloud WAN then updates necessary configuration based on the policies defined in the CNP documents. Thus, Cisco SD-WAN intuitively helps create and manage end-to-end segments from the users to the application.\n      </p>\n                <p>\n                  <a href=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2022/01/Fig-4-Sales-VPN-Prod-VPN.png\" data-type=\"url\" class=\"tr-link\" translate=\"no\">[Link]</a>\n                </p>\n                <p>\n                  <strong>Automation Workflow</strong>\n                </p>\n                <p>\n        Cloud OnRamp for Multicloud automation follows a simple 4 step workflow. Users can follow these simple steps to implement AWS Cloud WAN integration:\n      </p>\n                <p>\n                  <a href=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2022/01/Fig-5-Cisco-vManage.png\" data-type=\"url\" class=\"tr-link\" translate=\"no\">[Link]</a>\n                </p>\n                <p>\n                  <strong>1. Setup</strong>\n                </p>\n                <p>\n        Customer selects the solution and defines global parameters for the AWS Cloud WAN integration.\n      </p>\n                <p>\n                  <a href=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2022/01/Fig-6-vManage-Resource-Group.png\" data-type=\"url\" class=\"tr-link\" translate=\"no\">[Link]</a>\n                </p>\n                <p>\n                  <strong>2. Discover</strong>\n                </p>\n                <p>\n        Customer uses the Discover option to discover host VPCs (workload VPCs) in the cloud. These VPCs can now be tagged with the segment name which attaches them to the desired VPN.\n      </p>\n                <p>\n                  <a href=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2022/01/Fig-7-vManage-Discover.png\" data-type=\"url\" class=\"tr-link\" translate=\"no\">[Link]</a>\n                </p>\n                <p>\n                  <strong>3. Deploy</strong>\n                </p>\n                <p>\n        At this step we deploy CGW in the AWS Region. Repeat this step for all the required AWS Regions to build a multi-region AWS Cloud WAN network.\n      </p>\n                <p>\n                  <a href=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2022/01/Fig-8-vManage-Deploy.png\" data-type=\"url\" class=\"tr-link\" translate=\"no\">[Link]</a>\n                </p>\n                <p>\n                  <strong>4. Declare Intent</strong>\n                </p>\n                <p>\n        As a final step, users can map SD-WAN VPNs to AWS Cloud WAN segments by simply clicking on the specific matrix to establish the intended connections. In the example below, VPN 61 is mapped to SALES segment. VPN2 and VPN10 are being configured to map to TEST and PROD segments respectively.\n      </p>\n                <p>\n                  <a href=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2022/01/Fig-9-Declare-Intent.png\" data-type=\"url\" class=\"tr-link\" translate=\"no\">[Link]</a>\n                </p>\n                <p>\n        That's all it takes to bring up the AWS Cloud WAN integration using vManage.\n      </p>\n                <p>\n                  <a href=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2022/01/Fig-10-Cloud-OnRamp-with-AWS-Cloud-WAN.png\" data-type=\"url\" class=\"tr-link\" translate=\"no\">[Link]</a>\n                </p>\n                <p>\n        The complimenting partnership between Cisco and AWS delivers a simplified WAN for:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <strong>Unified Management</strong> - leverage an intuitive workflow to deploy site-to-cloud and site-to-site connectivity over a reliable backbone network, with end-to-end visibility and assurance, via single UI, Cisco vManage.\n        </li>\n                  <li>\n                    <strong>Security</strong> - The built-in segmentation in AWS Cloud WAN not only simplifies VPN mapping with Cisco SD-WAN but also enables propagation of unified business-intent policies across the network.\n        </li>\n                  <li>\n                    <strong>Reduced TCO</strong> - Reduce deployment time for overlay and underlays, ability to dynamically deploy in software is critical as traditional MPLS circuits takes weeks or months to provision. Significantly lower OpEx through improved performance and a reliable, on-demand consumption model provisioned through Cisco vManage.\n        </li>\n                </ul>\n                <p>\n        To summarize, Cisco SD-WAN and AWS Cloud WAN integration will simplify Site-to-Cloud, Site-to-Site, and inter-region workload use-cases for the customers. This alleviates customers from dealing with the complexity of today's WAN requirement and focuses on their users, applications, and core business.\n      </p>\n                <p>\n        To learn more:\n      </p>\n                <p>\n        Share:\n      </p>\n                <br/>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://blogs.cisco.com/networking/cisco-sd-wan-driving-network-efficiency-and-accelerating-cloud-integration-with-aws-cloud-wan\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Cisco Systems Inc.</strong> published this content on <strong>26 January 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>26 January 2022 18:12:46 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - Cisco Systems Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Cisco-Systems-Inc.</p></div>"}