{"date": "2022-01-14 07:45:07.731000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3304.14, "close": 3242.76}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>A Mitchell's Plain pensioner is expected to appear in court on charges of animal cruelty after animal welfare organisation Animal Welfare Society (AWS) confiscated three \"grossly abused and neglected dogs living at a proverbial house of horrors\".</p><p>CAPE TOWN - A Mitchell's Plain pensioner is expected to appear in court on charges of animal cruelty after animal welfare organisation Animal Welfare Society (AWS) confiscated three \"grossly abused and neglected dogs living at a proverbial house of horrors\".</p></div><div class=\"tr-npp-body\"><p>The 67-year-old woman, a resident in New Woodlands near Lentegeur, was formally charged after her granddaughter reported the case of cruelty to the AWS, alleging that her grandmother had said: \"All the dogs must die and nobody must give them food or water.\"</p><p>SAPS spokesperson Joseph Swartbooi said the three dogs were removed after establishing who they belonged to.</p><p>\"Lentegeur Police are investigating a case of cruelty to animals. According to reports, the incident occurred on Friday, January 6. The 34-year-old complainant visited the address in New Woodlands and found two dogs that were injured.</p><p>\"When she enquired from a female at the premises, she responded by saying that the dogs didn't belong to them. However, a family member then confirmed that the senior female was in fact the owner of the two injured dogs,\" said Swartbooi.</p><p>In a statement, AWS said the granddaughter was convinced that the dogs were in danger and what her grandmother said \"was not idle threats\".</p><p>\"Having witnessed the ongoing pain and suffering of the dogs for too long, and knowing full well that the rest of her family will resent and ostracise her for reporting the plight of the dogs, she bravely picked up the phone and sought our help.</p><p>\"When trainee inspector Sivuyile Kilwa arrived at the property he found all three dogs cringing on a tatty blood-spattered couch in the backyard.</p><p>\"He noticed that the older of the trio had a severe neck wound that almost penetrated her trachea, and that one of the younger dogs had half of her tail amputated. The third dog was severely traumatised but appeared unharmed.</p><p>\"The dogs had no shelter and there was one empty bowl lying in the yard that may have been their shared food or water bowl,\" the statement read.</p><p>The dogs have since been confiscated from the premises and are now in the care of AWS, where they are recovering with intensive care.</p><p>AWS further said: \"We have successfully removed the elastic hair scrunchy that someone cruelly placed around the adult female dogs neck, and we have surgically removed most of the other dog's tail.</p><p>\"The unharmed puppy is still too petrified to venture out of her enclosure and is receiving extensive one-on-one therapy.</p><p>\"While our Nursing and Animal Care Centre teams tend to their every need, our inspectors are busy gathering further evidence to ensure a rock-solid case and successful prosecution of one of the meanest individuals we have ever had to pursue,\" the statement read.</p><p><span>Cape Times</span> </p><p>Cape Times © 1999 - 2022 Independent Newspapers (Pty) Limited. All rights strictly reserved. Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 SyndiGate. All Rights Reserved.</p></div>"}