{"date": "2021-12-07 05:22:16.773000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><a href=\"https://www.independent.co.uk/topic/amazon-company\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> faces losing nearly £1.4bn from <a href=\"https://www.independent.co.uk/topic/uk\" data-type=\"url\" class=\"tr-link\" translate=\"no\">UK</a> shoppers when it blocks payments made using Visa credit cards in Britain from January 2022.</p><p>A poll of 2,000 adults found that 13 per cent of Amazon's 48 million UK customers -equivalent to 6.15 million people -intend to either slash the amount of their purchases, or totally quit buying from the corporation.</p></div><div class=\"tr-npp-body\"><p>As Amazon's total UK revenues in 2020 were £20.63bn, the loss of this part of its British customer revenues could cause the firm to lose £1.356bn in purchases.</p><p>Data suggests <a href=\"https://www.independent.co.uk/topic/visa\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Visa</a> credit card transactions last year accounted for around £1.4bn of the firm's net sales in the UK.</p><p>It also emerged that one-third of those polled have been left with \"negative\" feelings against the firm for stopping Visa payments from 19 January 2022.</p><p>More than one-fifth of UK consumers said they predict Amazon's UK transactions will nosedive by up to 50 per cent in the wake of the change.</p><p>A spokesman for OnePoll, said: \"The inconvenience factor of this has clearly got Brits riled.</p><p>\"They obviously don't like being told what to do or given the extra admin of changing payment details due to a petty battle between two of the world's biggest corporations.</p><p>\"Those dissatisfied, disappointed and angry at the move may also be aware other factors may be at play.</p><p>\"There are plenty of industry insiders who believe Amazon's dramatic decision is calculated to drive customers to adopt the company's own credit cards, which will give a competitive advantage to Visa's main rival Mastercard.\"</p><p>The survey found nearly 90 per cent of those polled shop on Amazon, with 27 per cent of those preferring to pay via Visa credit card.</p><p>Another 34 per cent used a Mastercard credit card, while 27 per cent had a debit account lodged with the site.</p><p>Almost one-fifth buy goods online \"a couple of times a week\", with 14 per cent of respondents shopping on Amazon \"most days\".</p><p>Another 65 per cent said they also paid for an Amazon Prime account that allows for speedier shipping of items.</p><p>More than four in 10 were \"frustrated\" by the prospect of not being able to use Visa credit cards on Amazon, and only 11 per cent felt more positive towards it due to the upcoming ban.</p><p>One-third said they will register a different card and continue <a href=\"https://www.independent.co.uk/topic/shopping\" data-type=\"url\" class=\"tr-link\" translate=\"no\">shopping</a> with Amazon once the block on Visa credit cards begins.</p><p>Despite frustration about the change, almost half felt Amazon was in the right to \"stand up to\" Visa for increasing fees while 20 per cent said the corporation was wrong.</p><p>Amazon's announcement on the payment ban came on 17 November, citing \"the high fees Visa charges for processing credit card transactions\" as the reason for its decision.</p><p>It came after it was reported in March that Visa was planning to hike fees for items bought in Britain from Europe.</p><p>The Brexit-linked interchange fee increase for online credit card payments jumped to 1.5 per cent -up five times from the previous 0.3 per cent rate.</p><p><span>SWNS</span> </p><p>Read More</p><p><a href=\"https://www.independent.co.uk/news/kshama-sawant-seattle-ed-murray-amazon-republican-b1970798.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Socialist Kshama Sawant faces recall vote in Seattle</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/amazon-game-board-warehouse-workers-tiktok-b1970534.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon worker shares dystopian gameboard which monitors how hard staff are working</a> </p><p><a href=\"https://www.independent.co.uk/news/will-smith-juice-wrld-riz-ahmed-netflix-oscar-b1969385.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">New this week: 'Sex and the City,' Juice Wrld and Will Smith</a> </p><p><a href=\"https://www.independent.co.uk/news/new-york-victoria-s-secret-pennsylvania-experts-amazon-b1968540.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Holiday shoppers navigate shortages with mixed results</a> </p><p><a href=\"https://www.independent.co.uk/news/ceo-washington-mastercard-covid-san-francisco-b1967887.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Visa CEO: COVID caused permanent shift to digital payments</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/new-york-scotland-glasgow-africa-amazon-b1967861.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Peter Prengaman to lead AP's expanding climate coverage</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Independent, The (UK) (Online). All rights reserved.</p></div>"}