{"date": "2021-12-02 21:12:06.231000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3443.72, "close": 3389.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>PROACTIVE (\"OPTIX-Q\")\nKOOTENAY SILVER INC (\"KTN-V\")\nCHAMPION GAMING GROUP INC (\"WAGR-V\")\nTRILLION ENERGY INTERNATIONAL INC (\"TCF-Z\")\nVICTORY SQUARE TECHNOLOGIES INC (\"VST-Z\")\nADASTRA HOLDINGS INC (\"XTRX-Z\")\nAYURCANN HOLDINGS CORP (\"AYUR-Z\")\nBELMONT RESOURCES INC (\"BEA-V\")\nACME LITHIUM INC (\"ACME-Z\")\nPATHWAY HEALTH CORP (\"PHC-V\")\nCANNTAB THERAPEUTICS LTD (\"PILL-Z\")\nFOBI AI INC (\"FOBI-V\")\nPSYBIO THERAPEUTICS CORP (\"PSYB-V\")\nEVERGEN INFRASTRUCTURE CORP (\"EVGN-V\")\nRIDGELINE MINERALS CORP (\"RDG-V\")\nFSD PHARMA INC (\"HUGE-Z\")\nHIGHGOLD MINING INC (\"HIGH-V\")\nMANDALAY RESOURCES CORP (\"MND-T\")\nALGERNON PHARMACEUTICALS INC (\"AGN-Z\")\nUNIGOLD INC (\"UGD-V\")\nKIDOZ INC (\"KIDZ-V\")\nCABRAL GOLD INC (\"CBR-V\")\n- News Headlines Including Pan-Biome Pharmaceuticals, Kootenay\n- Silver, Trillion Energy International and Champion Gaming Group\n\n     Proactive, provider of real-time news and video interviews on growth\ncompanies listed in the US and Canada, has covered the following companies:\n\n     *  Bragg Gaming Group subsidiary ORYX Gaming inks deal to provide\nexclusive content to White Hat Gaming's European operator network\n     *  Champion Gaming Group starts trading on the TSX Venture Exchange\nafter completion of reverse takeover transaction click here\n     *  Adastra Holdings reports significant revenue bump in 3Q, targeting\n$5 million in monthly sales by the end of 2022\n     *  Victory Square Technologies says its portfolio company GameOn\nEntertainment partners with Polygon Studios to build NFT-based games\n     *  Pan-Biome Pharmaceuticals outlines case for its compounds'\npotential as it updates on longevity research program\n     *  Ayurcann wins two awards in Canada for extraction facility and toll\nprocessing facility of the year\n     *  Kootenay Silver releases final drill results from Copalito project\nshowcasing high-grade silver and the potential for substantial resources\n     *  Belmont Resources says option partner Marquee Resources completes\nfirst two drill holes at the Lone Star project in Washington State\n     *  ACME Lithium Inc acquires two lithium projects in the Winnipeg\nriver pegmatite region in Manitoba\n     *  Trillion Energy International sees \"significant\" increase in SASB\nGas field's NPV on rising commodity prices\n     *  Pathway Health and Canntab Therapeutics strike agreement to provide\noral tablet cannabinoid products in select Canadian pharmacies\n     *  Logiq expects 4Q revenue to exceed $10M for a 52% year-over-year\nincrease\n     *  Fobi AI inks agreement with Amazon for distribution and fulfillment\nof hardware products\n     *  PsyBio Therapeutics presents 16 scientific abstracts highlighting\nits research and development efforts at two scientific conferences\n     *  EverGen Infrastructure appoints Natasha Monk as Interim CFO\n     *  Ridgeline Minerals poised to advance Carlin-East and Bell Creek\nprojects in Nevada next year as it reports final results for Crash Zone\ndrill program\n     *  FSD Pharma shares pre-clinical data revealing positive effects of\nLucid-MS in treating multiple sclerosis in mouse models\n     *  CNS Pharmaceuticals is progressing well with its Berubicin brain\ncancer treatment studies\n     *  Highgold Mining intersects high-grade gold at its Difficult Creek\nProspect in Alaska; appoints Dr Peter Megaw to its technical advisory team\n     *  Mandalay Resources completes sale of Cerro Bayo mine in Chile to\nEquus Mining\n     *  Algernon Pharmaceuticals projects full enrollment for its Phase 2\npulmonary fibrosis and chronic cough trial using Ifenprodil\n     *  Todos Medical says all 31 patients in Tollovir Phase 2 clinical\ntrial in hospitalized coronavirus patients have completed the study\n     *  Unigold hires experienced mine manager as new COO as company\nadvances towards development at Candelones asset\n     *  Kidoz announces the safe programmatic advertising sourcing solution\nKidoz Connect\n     *  Cabral Gold reports more encouraging results from MG deposit,\nincluding high grades at the gold-in-oxide blanket\n\n     About Proactive\n\n     *  Proactive is a unique tech-enabled platform providing companies\nglobally with a comprehensive investor engagement solution across their\nbusiness lifecycle.\n     *  With six offices on three continents, Proactive works with\ninnovative growth companies quoted on the world's major stock exchanges,\nhelping executives to engage intelligently with investors.\n     *  In 2020, Proactive featured in 809 million search results, our\ncontent was viewed over 165 million times and our readers spent over 10\nmillion hours on our websites. Proactive has produced over 300,000 articles\nand 20,000 executive interviews since it was established in 2006.\n\n     For more information on how Proactive can help you make a difference,\nemail us at action@proactiveinvestors.com\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133500640.MNPRE2133502752-12454620211202</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}