{"date": "2021-12-17 10:24:12+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3466.3, "close": 3400.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds background, detail</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">LONDON, Dec 17 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Two Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> shareholders have called on the tech giant to disclose global tax practices and risks to investors, shareholder adviser PIRC said on Friday, as investors step up demands for greater tax transparency from large corporations.</p><p>Greater Manchester Pension Fund and the Oblate International Pastoral (OIP) Investment Trust have filed a shareholder proposal urging Amazon to implement the new GRI (Global Reporting Initiative) Tax Standard, including public country-by-country reporting of financial, tax and worker information. </p><p>It is the first resolution of its kind filed in the United States, PIRC, which advises investors on how to vote on shareholder resolutions, said in a statement.</p><p>\"Public country-by-country reporting will allow investors to better understand Amazon’s business model and tax planning strategy and ensure that its growth fairly contributes to the communities in which it earns its profits and doesn’t unfairly undercut those companies taking a responsible approach to tax planning,\" said Seamus Finn, chief of faith consistent investing at OIP Trust.</p><p>The size of the investors' Amazon shareholdings was not immediately available.</p><p>Governments and investors have been pushing for more clarity on taxes from multinational corporations.</p><p>A global deal to ensure big companies pay a minimum tax rate of 15% and make it harder for them to avoid taxation was agreed in October by 136 countries. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2SM5LQ\" data-type=\"storyId\" data-story-id=\"nL8N2SM5LQ\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>PIRC said it was supporting the filing of the Amazon proposal as part of a new initiative with the Centre for International Corporate Tax Accountability and Research to engage with companies in sectors with a history of aggressive tax avoidance.</p><p>Danish pension fund AkademikerPension, with $23 billion in assets under management, has declared its intention to vote in favour of the proposal, PIRC said. AkademikerPension has filed shareholder proposals for implementation of the GRI Tax Standard at five Danish companies.</p><p>Shareholders vote on proposals at company annual general meetings. </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Carolyn Cohn Editing by Huw Jones and Mark Potter)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:carolyn.cohn@thomsonreuters.com\" data-type=\"email\" translate=\"no\">carolyn.cohn@thomsonreuters.com</a> ; 44 207 513 4391; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON-INVESTORS/TAX (UPDATE 1, PIX)</p></div>"}