{"date": "2021-11-27 09:02:16.051000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3504.56, "close": 3507.07}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">Shoppers buoyed by solid hiring, healthy pay gains and substantial savings are returning to stores and splurging on all types of items</p><p class=\"tr-npp-section-title\">Stocks sank Friday, with the Dow Jones Industrial Average briefly falling more than 1,000 points, as a new coronavirus variant first detected in South Africa appeared to be spreading across the globe</p><p class=\"tr-npp-section-title\">Macao police have detained the head of Macao's biggest junket organizer and others after Chinese authorities issued an arrest warrant for them over accusations that they ran an illegal cross-border gambling syndicate</p><p class=\"tr-npp-section-title\">The European Union drug regulator has authorized Pfizer's coronavirus vaccine for use on children from 5 to 11 years old</p><p class=\"tr-npp-section-title\">Climate activists have blockaded Amazon warehouses in three European countries</p><p class=\"tr-npp-section-title\">Russian officials say 52 miners and rescuers have died after a devastating blast in a Siberian coal mine about 250 meters (820 feet) underground</p><p class=\"tr-npp-section-title\">Some of Europe's Christmas markets are warily opening amid surging coronavirus infections</p><p class=\"tr-npp-section-title\">Pope Francis says he's praying that God will help Lebanon \"get up\" and get back on its feet following an unprecedented economic crisis that has thrown three quarters of the country's 6 million people including a million Syrian refugees into poverty</p><p class=\"tr-npp-section-title\">Americans are doing the main thing that drives the U.S. economy — spending — but accelerating inflation is casting a pall</p><p class=\"tr-npp-section-title\">Russian President Vladimir Putin says Moscow will continue providing natural gas to Serbia on terms favorable to its ally</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 The Associated Press.  All rights reserved. This material may not be published, broadcast, rewritten or redistributed.</p></div>"}