{"date": "2021-12-12 01:02:18.660000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3444.24, "close": 3381.83}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>MAYFIELD, Ky. (AP) — A monstrous tornado, carving a track that could rival the longest on record, ripped across the middle of the U.S. in a stormfront that killed dozens and tore apart a candle factory, crushed a nursing home, derailed a train and smashed an Amazon warehouse.</p><p>\"I pray that there will be another rescue. I pray that there will be another one or two,\" Kentucky Gov. Andy Beshear said, as crews sifted through the wreckage of the candle factory in Mayfield, where 110 people were working overnight Friday when the storm hit. Forty of them were rescued.</p></div><div class=\"tr-npp-body\"><p>\"We had to, at times, crawl over casualties to get to live victims,\" said Jeremy Creason, the city's fire chief and EMS director.</p><p>In Kentucky alone, 22 were confirmed dead by Saturday afternoon, including 11 in and around Bowling Green. But Beshear said upwards of 70 may have been killed when a twister touched down for more than 200 miles (320 kilometers) in his state and that the number of deaths could eventually exceed 100 across 10 or more counties.</p><p>The death toll of 36 across five states includes six people in Illinois, where an Amazon facility was hit; four in Tennessee; two in Arkansas, where a nursing home was destroyed; and two in Missouri.</p><p>If early reports are confirmed, the twister \"will likely go down perhaps as one of the longest track violent tornadoes in United States history,\" said Victor Genzini, a researcher on extreme weather at Northern Illinois University.</p><p>The longest tornado on record, in March 1925, tracked for about 220 miles (355 kilometers) through Missouri, Illinois and Indiana. But Genzini said this twister may have had touched down for nearly 250 miles (400 kilometers). The storm was all the more remarkable because it came in December, when normally colder weather limits tornadoes, he said.</p><p>Debris from destroyed buildings and shredded trees covered the ground in Mayfield, a city of about 10,000 in western Kentucky. Twisted metal sheeting, downed power lines and wrecked vehicles lined the streets. Windows and roofs were blown off the buildings that were still standing.</p><p>The missing at the candle factory included Janine Denise Johnson Williams, a 50-year-old mother of four whose family members kept vigil at the site Saturday.</p><p>\"It's Christmastime and she works at a place that's making candles for gifts,\" her brother, Darryl Williams, said. \"To give up the gift of life to make a gift. We haven't heard anything, and I'm not presuming anything. But I'm expecting for the worst.\"</p><p>He said Johnson Williams called her husband overnight to report the weather was getting bad, the last time anyone heard from her.</p><p>Kyanna Parsons-Perez, an employee at the factory, was trapped under 5 feet (about 1.5 meters) of debris for at least two hours until rescuers managed to free her.</p><p>In an interview with NBC's \"Today,\" she said it was \"absolutely the most terrifying\" event she had ever experienced. \"I did not think I was going to make it at all.\"</p><p>Just before the tornado struck, the building's lights flickered. She felt a gust of wind, her ears started popping and then, \"Boom. Everything came down on us.\" People started screaming, and she heard other workers praying.</p><p>Kentucky State Trooper Sarah Burgess said rescue crews were using heavy equipment to move rubble at the candle factory. Coroners were called to the scene and bodies were recovered, but she didn't know how many. She said it could take a day and potentially longer to remove all of the rubble.</p><p>Rescue efforts were complicated because Mayfield's main fire station and emergency services hub were also hit by the tornado, Creason said.</p><p>After a wall at a nursing home in Mayfield collapsed, Vernon Evans said he rushed to help firefighters pull people out, only to find one resident lying dead in a few inches of water.</p><p>\"All I could do is sit there and hold their head up,\" he said. \"I never experienced nothing like this.\"</p><p>President Joe Biden approved an emergency disaster declaration for Kentucky on Saturday and pledged to support the affected states.</p><p>\"I promise you, whatever is needed — whatever is needed — the federal government is going to find a way to provide it,\" Biden said.</p><p>Six people were killed in the collapse of the Amazon warehouse in Edwardsville, Illinois, with another injured worker airlifted to a hospital, fire Chief James Whiteford said.</p><p>Investigators searched the rubble throughout the day for additional victims and 45 people survived, Whiteford said. Authorities were uncertain Saturday evening whether anyone was still unaccounted because workers were in the midst of a shift change when it was struck by the tornado about 8:30 p.m. Friday.</p><p>\"This is a devastating tragedy for our Amazon family and our focus is on supporting our employees and partners,\" Amazon spokesperson Richard Rocha said in a written statement.</p><p>The Retail, Wholesale and Department Store Union, which has been trying to organize workers at an Amazon facility in Alabama, criticized the company for keeping the Illinois site open during a weather emergency.</p><p>Missouri Gov. Mike Parson's office said the storms killed at least two people in the state and initial assessments indicate they destroyed or did major damage to hundreds of homes and buildings.</p><p>Workers at a National Weather Service office had to take shelter as a tornado passed near their office in Weldon Spring, Missouri, about 30 miles (48 kilometers) west of St. Louis.</p><p>\"This was an incredible storm that lasted a long time and covered a lot of territory,\" said Larry Vannozzi, meteorologist in charge of the National Weather Service office covering the Nashville area.</p><p>Meteorologists haven't determined whether the storm spawned a single tornado or multiple tornadoes, he said.</p><p>In Arkansas, a tornado struck a nursing home in Monette, killing one and trapping 20 people inside as the building collapsed, Craighead County Judge Marvin Day told The Associated Press.</p><p>Another person died when the storm hit a Dollar General store in nearby Leachville, Gov. Asa Hutchinson said.</p><p>\"Probably the most remarkable thing is that there's not a greater loss of life,\" Hutchinson said after touring the wreckage of the nursing home. \"It is catastrophic. It's a total destruction.\"</p><p>Gov. Bill Lee on Saturday toured tornado-torn parts of western Tennessee in which four people had been killed.</p><p>Lee traveled to Tiptonville and then Dresden, a small town of about 3,000 that saw its downtown corridor ripped to shreds.</p><p>\"This is about the saddest thing I've ever seen,\" Lee said, who has had three fatal tornadoes rip through the state during his first term in office. \"The whole town, the whole town.\"</p><p>Dylan Lovan in Mayfield, Seth Borenstein in Washington, D.C.; Travis Loller in Nashville, Tennessee; Kimberlee Kruesi in Dresden, Tennessee; John Raby in Charleston, West Virginia; and Jeff McMurray in Chicago contributed to this report. Salter reported from O'Fallon, Missouri.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.</p></div>"}