{"date": "2021-12-01 19:52:16.357000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Bright Machines Welcomes Seasoned Engineering Executive Sudhanshu Verma as CDO</b>\n</p><p class=\"bwalignc\">\n<b><span>Former Amazon executive brings deep software development experience as company continues to expand its Software-Defined Manufacturing solutions</span></b>\n</p><p>\nToday, Bright Machines, an innovator in intelligent, software-defined manufacturing, announced the addition of Sudhanshu (“Sud”) Verma, a seasoned technology executive, to its leadership team as Chief Development Officer. He will oversee the strategy and execution of Bright Machines' intelligent automation software stack in a newly created role. Sud brings a strong background in cloud, data management, and hardware, having held senior engineering positions across industry-leading companies like Amazon, Amazon Web Services, Infinera, and Hewlett-Packard.\n</p><p>\nSud joins Bright Machines most recently from Amazon, where he was the Director of Alexa Connected Devices and Orchestration and led the team responsible for developing Alexa Cloud Services and API integrations for all devices. Before Alexa, he was the Director of Network Product Development at Amazon Web Services, leading the unit responsible for developing all the in-house network products that run Amazon’s data center networks. Prior to Amazon, Sud was Senior Vice President of Software Engineering for Infinera, a global optical networking telecom provider, leading a team of around 700 people in the United States, India, and China.\n</p><p>\n\"We are seeing growing interest from our customers in bringing a software-first approach to their manufacturing operations and in Bright Machines solutions specifically. These are good indicators that it is the right time to increase our investment in software, accelerating our delivery of value to customers. Because Sud has led large development teams across technology sectors that require a unique blend of hardware and software expertise, we know he is the right person to help lead the further development of our market ready solutions,\" said Amar Hanspal, CEO and Co-Founder, Bright Machines. \"I'm excited to welcome him to Bright Machines, where he will apply this rich background to solving the challenges of rethinking manufacturing.\"\n</p><p>\n\"Over the years, I’ve been fortunate to help develop and innovate on some of today’s most widely used software, hardware, and cloud networks. This has given me a firm conviction on the power of software-driven solutions to transform industries,\" said Sud Verma, CDO, Bright Machines. \"I'm thrilled to join the world-class Bright Machines team to lead the paradigm change in manufacturing with scalable, cloud-based software solutions that deliver deep data analytics and insights.\"\n</p><p>\nSud joins the current Bright Machines leadership team, which consists of Amar Hanspal (CEO and Co-Founder), Fiorella Dettorre (CHRO), Bill Griffin (CRO), Victoria Libin (General Counsel and Corporate Secretary), Michael Keogh (CFO), Brian Mathews (CTO), Caroline Pan (CMO), Abhishek Pani (CPO), and Tzahi Rodrig (COO and Co-Founder).\n</p><p>\n<b>About Bright Machines</b>\n</p><p>\nHeadquartered in San Francisco, Bright Machines is a technology company that is pioneering an innovative approach to intelligent, software-defined manufacturing. It leverages computer vision, machine learning, 3D simulation, and adaptive robotics to fundamentally change the flexibility, scalability, and economics of production. With more than 600 employees worldwide, Bright Machines operates R&amp;D centers in the U.S. and Israel, with additional field operations in North America, Central America, Southeast Asia and EMEA.\n</p><p>\nThe company recently entered into a definitive <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.brightmachines.com%2Finvestors%2F&amp;esheet=52538040&amp;newsitemid=20211201005011&amp;lan=en-US&amp;anchor=merger+agreement&amp;index=1&amp;md5=5130ccc1ada19452cdc10bd228229a88\" data-type=\"url\" class=\"tr-link\" translate=\"no\">merger agreement</a> with SCVX (NYSE: SCVX), a special purpose acquisition company, with the intent of becoming a publicly traded company.\n</p><p>\nBright Machines is reimagining how products can be designed and produced to address the realities of today and the future ahead. Rethink everything you ever knew about manufacturing. Visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.brightmachines.com%2F&amp;esheet=52538040&amp;newsitemid=20211201005011&amp;lan=en-US&amp;anchor=www.brightmachines.com&amp;index=2&amp;md5=61f144231df792640913840e1fb1ac8b\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.brightmachines.com</a>\n</p><p>\n<span>Bright Machines® and the LOGO and Brightware® are registered trademarks of Bright Machines, Inc.</span>\n</p><p>\n<b>Additional Information and Where to Find It</b>\n</p><p>\nIn connection with the proposed business combination, SCVX intends to file a Registration Statement on Form S-4, including a preliminary proxy statement/prospectus and a definitive proxy statement/prospectus with the SEC. SCVX’s stockholders and other interested persons are advised to read, when available, the preliminary proxy statement/prospectus and the amendments thereto and the definitive proxy statement/prospectus and documents incorporated by reference therein filed in connection with the proposed business combination, as these materials will contain important information about Bright Machines, SCVX, and the proposed business combination. When available, the definitive proxy statement/prospectus and other relevant materials for the proposed business combination will be mailed to stockholders of SCVX as of a record date to be established for voting on the proposed business combination. Stockholders will also be able to obtain copies of the preliminary proxy statement/prospectus, the definitive proxy statement/prospectus, and other documents filed with the SEC that will be incorporated by reference therein, without charge, once available, at the SEC’s website at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.sec.gov&amp;esheet=52538040&amp;newsitemid=20211201005011&amp;lan=en-US&amp;anchor=www.sec.gov&amp;index=3&amp;md5=4d38c77b7d1aa598e5df4721134e6c98\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.sec.gov</a>, or by directing a request to: c/o Strategic Cyber Ventures, 1220 L St. NW, Suite 100-397, Washington, DC 20005.\n</p><p>\n<b>Participants in the Solicitation</b>\n</p><p>\nSCVX and Bright Machines and their respective directors and executive officers may be considered participants in the solicitation of proxies with respect to the potential transaction described in this press release under the rules of the SEC. Information about the directors and executive officers of SCVX is set forth in SCVX’s Annual Report on Form 10-K filed with the SEC pursuant to Section 13 of the Securities Exchange Act of 1934, as amended, on April 6, 2021, and is available free of charge at the SEC’s web site at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.sec.gov&amp;esheet=52538040&amp;newsitemid=20211201005011&amp;lan=en-US&amp;anchor=www.sec.gov&amp;index=4&amp;md5=7df4071695d367c88b684120b81f4a52\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.sec.gov</a>, or by directing a request to: c/o Strategic Cyber Ventures, 1220 L St. NW, Suite 100-397, Washington, DC 20005. Information regarding the persons who may, under the rules of the SEC, be deemed participants in the solicitation of the SCVX shareholders in connection with the potential transaction will be set forth in the registration statement containing the preliminary proxy statement/prospectus when it is filed with the SEC. These documents can be obtained free of charge from the sources indicated above.\n</p><p>\n<b>No Offer or Solicitation</b>\n</p><p>\nThis press release shall not constitute a solicitation of a proxy, consent, or authorization with respect to any securities or in respect of the proposed business combination. This press release shall also not constitute an offer to sell or the solicitation of an offer to buy any securities, nor shall there be any sale of securities in any states or jurisdictions in which such offer, solicitation, or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. No offering of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the Securities Act of 1933, as amended, or an exemption therefrom.\n</p><p>\n<b>Forward Looking Statements</b>\n</p><p>\nCertain statements herein may be considered forward-looking statements. Forward-looking statements generally relate to future events or SCVX’s or Bright Machines’ future financial or operating performance. For example, statements about the expected timing of the completion of the proposed business combination, the benefits of the proposed business combination, the competitive environment, and the expected future performance and market opportunities of Bright Machines are forward-looking statements. In some cases, you can identify forward-looking statements by terminology such as “may”, “should”, “expect”, “intend”, “will”, “estimate”, “anticipate”, “believe”, “predict”, “potential” or “continue”, or the negatives of these terms or variations of them or similar terminology. Such forward-looking statements are subject to risks, uncertainties and other factors which could cause actual results to differ materially from those expressed or implied by such forward-looking statements.\n</p><p>\nThese forward-looking statements are based upon estimates and assumptions that, while considered reasonable by SCVX and its management, and Bright Machines and its management, as the case may be, are inherently uncertain. Factors that may cause actual results to differ materially from current expectations include, but are not limited to: (1) the occurrence of any event, change or other circumstances that could give rise to the termination of the merger agreement; (2) the outcome of any legal proceedings that may be instituted against SCVX, Bright Machines, the combined company or others following the announcement of the proposed business combination; (3) the inability to complete the proposed business combination due to the failure to obtain approval of the shareholders of SCVX or to satisfy other conditions to closing; (4) changes to the proposed structure of the proposed business combination that may be required or appropriate as a result of applicable laws or regulations or as a condition to obtaining regulatory approval of the proposed business combination; (5) the ability to meet stock exchange listing standards at or following the consummation of the proposed business combination; (6) the risk that the proposed business combination disrupts current plans and operations of Bright Machines as a result of the announcement and consummation of the proposed business combination; (7) the ability to recognize the anticipated benefits of the proposed business combination, which may be affected by, among other things, competition, the ability of the combined company to grow and manage growth profitably, maintain relationships with customers and suppliers and retain its management and key employees; (8) costs related to the proposed business combination; (9) changes in applicable laws or regulations; (10) the possibility that Bright Machines or the combined company may be adversely affected by other economic, business and/or competitive factors; and (11) other risks and uncertainties set forth in the section entitled “Risk Factors” and “Cautionary Note Regarding Forward-Looking Statements” in SCVX’s Form 10-K for the year ended December 31, 2020, and which will be set forth in the registration statement to be filed by SCVX with the SEC in connection with the proposed business combination.\n</p><p>\nNothing herein should be regarded as a representation by any person that the forward-looking statements set forth herein will be achieved or that any of the contemplated results of such forward-looking statements will be achieved. You should not place undue reliance on forward-looking statements, which speak only as of the date they are made. Neither SCVX nor Bright Machines undertakes any duty to update these forward-looking statements.\n</p><p><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211201005011/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211201005011/en/</a></span></p><p>\nFor media inquiries: Justine Crosby <a href=\"mailto:pr@brightmachines.com\" data-type=\"email\" translate=\"no\">pr@brightmachines.com</a>\n</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: CA-BRIGHT-MACHINES</p></div>"}