{"date": "2021-11-10 18:33:58+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3576.23, "close": 3472.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Foo Yun Chee</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">BRUSSELS, Nov 10 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Draft landmark EU rules requiring U.S. tech giants to share information with rivals could put at risk companies' intellectual property and trade secrets, the United States government warned in a document seen by Reuters.</p><p>The paper said requiring gatekeepers - companies that control data and access to their platforms - to change their business practices and the design of their software may have  implications for security and consumer protection.</p><p>The document, circulated to EU countries, the European Commission and involved companies, underlines U.S. concerns that the rules will come at the expense of U.S. companies.</p><p>Frustrated by the slow pace of investigations, EU antitrust chief Margrethe Vestager has proposed two sets of rules to rein in Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, Apple <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a>, Alphabet <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a> unit Google and Facebook <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a>.</p><p>The Digital Markets Act (DMA) sets out a list of dos and don'ts that takes direct aim at each company's core business model, reinforced by fines of up to 10% of global turnover.</p><p>The Digital Services Act (DSA) forces the tech giants to do more to tackle illegal content on their platforms, with fines of up to 6% of global turnover for non-compliance.</p><p>\"DMA would require gatekeepers under certain circumstances to provide competitors with information that may be protected by intellectual property and trade secret law,\" the document said.</p><p>\"However, the DMA does not include specific language relevant to the protection of intellectual property, including trade secrets.\"</p><p>\"As a result, there is a concern that the DMA may override existing protections for intellectual property rights, including protection for trade secrets, in EU law under certain circumstances.\"</p><p>The U.S. government declined to comment on the document.</p><p>\"Broadly speaking, the Biden administration has been consulting with stakeholders and reviewing both the DMA and the DSA,\" a U.S. government official told Reuters.</p><p>\"We have also been clear that we oppose efforts specifically designed to target only U.S. companies,\" the official said.</p><p>The document also warned against imposing onerous obligations on cloud service providers, saying they may be neutral transporters of data from one point to another and that the EU should reconsider the size of fines and penalties.</p><p>On the DSA, the paper said illegal content should be defined narrowly \"to ensure it will not be a source of conflicts of law  nor a benefit to member states who have shown a tendency to  reduce press and association freedoms\".</p><p>The rules should clarify the geographic scope of a platform's obligation to take down illegal content, the paper said, amid worries that an EU country may issue a pan-European order. </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Foo Yun Chee; Editing by Jan Harvey)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:foo.yunchee@thomsonreuters.com\" data-type=\"email\" translate=\"no\">foo.yunchee@thomsonreuters.com</a> ; +32 2 287 6844; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://foo.yunchee.thomsonreuters.com@reuters.net\">foo.yunchee.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: EU-TECH/ANTITRUST-USA (EXCLUSIVE)</p></div>"}