{"date": "2022-01-19 15:41:52.658000+00:00", "ticker": "III", "mrkt_info": {"open": 1432.0, "close": 1410.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENBRIDGE INC (\"ENB-TN\")\n- Executive Leadership Changes\n\n     Enbridge Inc. (Enbridge or the Company) announced the following\nexecutive leadership changes.\n\n     Bill Yardley, Executive Vice President and President, Gas Transmission\nand Midstream, has decided to retire on May 31, 2022. Al Monaco, President\nand CEO, said \"Bill has led a top-notch gas transmission business,\nsignificantly expanded our franchises, and executed our LNG gas pipeline\nexport strategy. Equally important, he's advanced our mission to bring the\ngas business to the forefront of safety, reliability, and customer service.\nIt's been an honor to work alongside Bill; we've appreciated his principled\nleadership, collaborative style, and dedication to Enbridge and his team.\"\n\n     Cynthia Hansen, Executive Vice President and President, Gas\nDistribution and Storage, has been appointed Executive Vice President and\nPresident, Gas Transmission and Midstream, to succeed Mr. Yardley,\neffective March 1, 2022. Ms. Hansen brings a wealth of experience in the\nnatural gas industry and a long track record of accomplishments at\nEnbridge. Under Ms. Hansen's leadership the utility has generated\ntremendous rate base growth, combined our two Ontario utility franchises,\nand advanced our low carbon energy strategies. Mr. Yardley will support the\ntransition until his retirement. Ms. Hansen will move from Toronto to\nHouston.\n\n     Michele Harradence, Senior Vice President and Chief Operations\nOfficer, Gas Transmission and Midstream and has been appointed Senior Vice\nPresident and President, Gas Distribution and Storage, to succeed Ms.\nHansen effective March 1, 2022. Ms. Harradence brings 25 years of\nengineering, legal and business experience from across the energy value\nchain. She will report directly to the President and CEO and move from\nHouston to Toronto.\n\n     Vern Yu, Executive Vice President and Chief Financial Officer, has\nbeen assigned expanded accountability for Corporate Development and Energy\nServices and has been appointed Executive Vice President, Corporate\nDevelopment and Chief Financial Officer, effective March 1, 2022. Mr. Yu is\nbased in Calgary.\n\n     \"These key appointments once again reinforce the effectiveness of our\nexecutive development and succession program at Enbridge and advancing\ninternal talent,\" said Monaco.\n\n     About Enbridge Inc.\n\n     Enbridge Inc. is a leading North American energy infrastructure\ncompany. We safely and reliably deliver the energy people need and want to\nfuel quality of life. Our core businesses include Liquids Pipelines, which\ntransports approximately 25 percent of the crude oil produced in North\nAmerica; Gas Transmission and Midstream, which transports approximately 20\npercent of the natural gas consumed in the U.S.; Gas Distribution and\nStorage, which serves approximately 3.8 million retail customers in Ontario\nand Quebec; and Renewable Power Generation, which owns approximately 1,766\nmegawatts (net) in renewable power generation capacity in North America and\nEurope. The Company's common shares trade on the Toronto and New York stock\nexchanges under the symbol ENB. For more information, visit\nwww.enbridge.com.\n\n     FOR FURTHER INFORMATION PLEASE CONTACT:\n\n     Media Toll Free: (888) 992-0997 Email: media@enbridge.com\n\n     Investment Community Toll Free: (800) 481-2804 Email:\ninvestor.relations@enbridge.com\n\n\nWWW   : <a href=\"https://www.enbridge.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.enbridge.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201800197.MNPRE2201801531-06404420220119</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}