{"date": "2021-04-27 06:46:23+00:00", "ticker": "AVV", "mrkt_info": {"open": 3907.0, "close": 3555.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds detail from call</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">April 27 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>French electrical equipment group Schneider Electric <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SCHN.PA\" data-type=\"ric\" data-ric=\"SCHN.PA\" translate=\"no\" dir=\"ltr\">SCHN.PA</a> on Tuesday raised its full-year outlook, buoyed by first-quarter sales that beat expectations due to strong demand for its data centre and building energy management products.</p><p>Schneider, which sells products ranging from electrical car chargers to industrial robotics, is now targeting a 14%-20% increase in 2021 adjusted earnings before interest, taxes and amortisation (EBITA) with revenues likely to gain 8%-11%.</p><p>It had previously forecast adjusted EBITA growth of 9%-15% for this year, from revenues up 5%-8%. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2KH0DP\" data-type=\"storyId\" data-story-id=\"nL1N2KH0DP\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>\"We did see increased tensions in the supply chain over the first quarter,\" finance chief Hilary Maxson told Reuters in a call, citing weather conditions in the United States, the Suez Canal and accelerating demand.</p><p>A pandemic-led surge of consumer electronics sales, stockpiling in China and supply problems have caused a global shortage in semiconductor chips that has squeezed capacity and driven up costs of even the cheapest components. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2LO3SU\" data-type=\"storyId\" data-story-id=\"nL4N2LO3SU\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Maxson said that the group expected impacts from the shortage to peak in the second quarter and effects so far had been limited.</p><p>She added that Schneider was exposed to supply issues for certain plastics and types of semiconductors, though the new profit target range accounted for uncertainties throughout the year.</p><p>Boosted by particularly strong growth in China as well as robust demand for its data centre and building energy management offerings, first quarter sales jumped 13.5% organically to 6.53 billion euros ($7.88 billion).</p><p>Analysts polled by the company had forecast revenues up 8.2% to 6.22 billion euros for the quarter.</p><p>As part of a disposals plan, which it had put on hold in 2020, Schneider said it had agreed to sell its Northern European cable support business to the Storskogen Group, bringing cumulative revenues from the scheme to 700 million euros.</p><p><br/></p><p>($1 = 0.8283 euros)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Sarah Morland in Gdansk; Editing by Rashmi Aich and Carmel Crimmins)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:sarah.morland@thomsonreuters.com\" data-type=\"email\" translate=\"no\">sarah.morland@thomsonreuters.com</a> ; +48 58 769 65 92; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SCHNEIDER-RESULTS/ (UPDATE 1)</p></div>"}