{"date": "2021-12-03 19:34:18.963000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3437.36, "close": 3427.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>CrowdStrike has launched new product integrations and certifications that deliver breach protection and streaming observability.</p><p> These solutions provide consistent security and simplified operational management across Amazon Web Services, Inc. (AWS) cloud-to-edge and customer-managed infrastructure, and break down silos across information technology (IT) security and development operations (DevOps) teams.\"Many organizations lack the visibility and streamlined security needed to properly protect their cloud workloads with precision from end-to-end,\" said Matthew Polly, vice president of World Wide Alliances, Channels and Business Development at CrowdStrike. \"With these latest certifications and integrations, joint customers are provided a consistent security posture and holistic observability of their edge workloads, on-premises data centers and cloud-native deployments, bridging the gap between IT security and DevOps.\"The expanded CrowdStrike support includes new product integrations, AWS Certifications achievements and participants as launch partners for the following AWS programs:EKS Anywhere Support - CrowdStrikeprovides continuous posture management and breach protection for Amazon Elastic Kubernetes Service (EKS), Amazon EKS with AWS Fargate and now Amazon EKS running on customers' on-premises infrastructure via Amazon EKS Anywhere. Customers benefit from greater visibility, compliance and the industry's fastest threat detection and response to outsmart the adversary.AWS Outposts Launch Partner - IDC predicts that by 2024, due to an explosion of edge data, 65% of the Forbes Global 2000 will embed edge-first data stewardship, security and network practices into data protection plans.¹ As a result, CrowdStrike is proud to be a launch partner of AWS Outposts, spanning the 1U, 2U and 42U form factors. Customers will be afforded a unified security experience across AWS-supported on-premises edge, data center and cloud-native services.AWS Quick Starts for Humio - Customers will be able to initiate Humio clusters via AWS Quick Starts templates. This will reduce dozens of manual AWS procedures to a few steps, empowering customers to start attaining Humio's streaming observability at scale and with consistency, within minutes.Humio Integration with AWS FireLens -Customers are now able to ingest AWS service and event data into Humio via AWS FireLens, container log router for Amazon Elastic Container Service (Amazon ECS) and AWS Fargate. Humio customers will now have greater extensibility to use the breadth of services at AWS to simplify routing of logs to Humio, enabling accelerated threat hunting and search across their AWS footprint for novel and advanced cyber threats.AWS Well Architected ISV Certification Achieved - CrowdStrike has passed the AWS technical review and achieved a certification for being an AWS Well Architected ISV, having proven to adopt AWS best practices, drive improved security and performance outcomes, adopt cloud-native architectures and achieve industry compliance at scale.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}