{"date": "2021-12-10 13:41:19.439000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.16, "close": 3444.24}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>YOWIE GROUP LTD (\"YWGRF-0\")\n- Holiday Campaign\n\n     Yowie Group, the confectionary company that brings families\nsustainably sourced sweet treats combined with a unique educational\nexperience, has officially debuted their \"Feel the Magic with Yowie\"\nholiday campaign. Throughout the holiday season, Yowie will be offering\nfree activities for families and ultra-rare Pacific Giant Glass Frog\ngiveaways. This Yowie collectible just debuted as part of the \"Animals with\nSuperpowers\" series and the odds of finding a Pacific Giant Glass Frog are\none in one thousand - so this is an extra special treat.\n\n     During the holiday season magic is felt all over the world, whether\nfamilies are celebrating Christmas, Hanukkah, or Kwanza. There's the magic\nof love, surprises, storytelling, traditions and new experiences. Yowie is\neager to inspire more feelings of enchantment by engaging children and\nfamilies through meaningful holiday activities that can be done together or\nwith friends.\n\n    \"Tis the season of giving, and Yowie values giving children games, crafts,\nrecipes, videos and other holiday themed activities to enjoy throughout the\nentire season,\" said Yowie Group's Global CMO, Cynthia Thayer. \"There is\nmagic to be felt all around - as kids decorate holiday cards for loved\nones, get their hands dusted in flour while trying new recipes, create\ndecorations to spruce up holiday decor, learn a new dance to showcase at\nholiday parties or eagerly peel off brightly colored foil to open their\nsurprise-inside chocolate eggs to see what collectible Yowie figurine is\ninside. Our goal is to provide opportunities for our customers to genuinely\nfeel the magic with Yowie this holiday season.\"\n\n     This year, Yowie invites families to experience 12 Days of Magic this\nholiday season. What are some ways to \"Feel the Magic with Yowie\" this\nholiday season?\n\n*  Decorate a printable holiday card\n*  Play Spot the Nap Yowie game\n*  Color holiday gift tags\n*  Craft ornaments for a Christmas tree\n*  Make recycled Yowie garland\n\n    Visit www.yowieworld.com/holidays, the Yowie World YouTube channel, or the\nYowie World Facebook page to see all the new activities and games in their\n\"Feel the Magic with Yowie\" campaign to make the holidays extra special for\nyour family. For any families looking to take advantage of Yowie's \"Feel\nthe Magic with Yowie\" holiday offerings, Yowie surprise-inside chocolate\neggs can be found in more than 30,000 retail outlets across the United\nStates, including Walmart, Target, 7Eleven, Albertson's, Meijer, Walgreens,\nCVS and most recently both Food Lion and Casey's or online at Amazon.com.\n\n     Not only is Yowie inviting families to feel the magic this season, but\nYowie is also spreading the feeling of magic through the donation of 14,150\nYowie books to families supported by Chrisco. For over 40 years Chrisco has\nbeen creating magical memories each Christmas for hundreds of thousands of\nfamilies in Australia, New Zealand, the U.K and Canada. Chrisco helps\nfamilies by providing a convenient and affordable way to plan, shop and\nbudget for Christmas. Each family's order is delivered in a hamper just in\ntime for the holidays. Yowie's books will be an added surprise for select\nhampers being delivered to Australian families.\n\n    \"We are delighted to spread additional holiday magic and cheer to Chrisco\ncustomers in Australia by surprising recipients of select hampers with a\nYowie book,\" said Thayer. \"In addition, each book will be gifted with a\nYowie bookmark. Yowie is on a mission to make learning about endangered\nwildlife fun which we are doing through our confectionary products, books\nand online content.\"\n\n     Yowie surprise-inside chocolates provide an engaging experience\noutside of the typical holiday treat. By providing delicious, sustainably\nsourced, 100% milk chocolate free from GMOs, gluten, nuts, palm oil and\nartificial coloring and flavors AND the surprise and delight of discovering\nwhich endangered animal collectible is inside your Yowie egg to learn all\nabout, parents can gift a treat that keeps on giving.\n\n(figure class=\"image image_resized\" style=\"width:650px;\")(/figure)     To\nlearn more about Yowie's future campaigns as well as their current\nSuperpower collection, visit www.yowieworld.com, find them on Facebook, or\nlook for @YowieWorld on Instagram. You can also find easy, interactive, and\neducational craft projects and games on their YouTube channel and on\nPinterest. Collectors can leverage the 'Yowie Collector' app to keep track\nof their growing collection by downloading the free app on the Apple App\nStore or on Google Play.\n\n    About Yowie\n\n     Yowie is best known for its flagship product, the Yowie surprise\ninside chocolate. Each Yowie product is created in the shape of the Yowie\ncharacters and contains limited-edition collectible animal toys and a full\ncolor leaflet featuring a picture of the real-life animal, its profile and\nlevel of endangerment. Our social media channels and website allow\ncollectors to learn more about the animals and their world while having\nloads of fun through games and competitions. The combination of tasty,\nclean-label treats, fun animal toys and a digital platform encourages kids\nto learn about the natural world and understand its need for protection.\nFor more information visit www.yowieworld.com.\n\nCONTACT:\nLauren Witt\nyowie@interdependence.com\n817-721-5576\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134200707.MNPRE2134203303-16104420211209</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}