{"date": "2021-12-01 14:49:01.034000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MIMI'S ROCK CORP (\"MIMNF-0\")\n- $1.5 Million Private Placement of Subordinated Secured Debentures\n\n     Mimi's Rock Corp. (the \"Company\") is pleased to announce the closing\nof its $1.5 million non-brokered private placement of subordinated secured\ndebentures (the \"Placement\").\n\n     Placement of Subordinated Secured Debentures\n\n     The Company announces that it has closed its non-brokered private\nplacement of $1.5 million of subordinated secured debentures (the\n\"Debentures\") consisting of $10,000 principal amount per Debenture (the\n\"Principal Amount\"). The Debentures will mature on November 24, 2023 (the\n\"Maturity Date\") and will bear a 10.0% p.a. total cash yield, consisting of\nan 8.0% p.a., payable quarterly and an annual maintenance fee of 2%, paid\nannually in advance.\n\n     In connection with the Placement, subscribers were granted 3,571\ncommon shares of the Company (each, a \"Bonus Share\") for each $10,000 of\nPrincipal Amount of Debentures or 560,706 Bonus Shares in the aggregate.\n\n     Proceeds of the Placement are expected to be used by the Company for\nworking capital and general corporate purposes.\n\n     In connection with the Placement, the Company paid a cash commission\nequal to up to 5% of the gross proceeds from the sale of Debentures (the\n\"Cash Fee\") sold pursuant to the Placement (other than in respect of\nproceeds from sales to persons on a \"president's list\", in respect of which\nno fee was paid), or $66,000 in the aggregate, and such number of\nnon-transferrable compensation warrants (the \"Compensation Warrants\") as is\nequal to 5% of the gross proceeds from the sale of Debentures sold pursuant\nto the Placement (other than in respect of proceeds from sales to persons\non a \"president's list\", in respect of which no fee was paid) divided by\n$0.28, or 66,000 Compensation Warrants in the aggregate. Each Compensation\nWarrant entitles the holder thereof to purchase one common share of the\nCompany at $0.50 per share until November 24, 2022.\n\n     The securities issued in connection with the Placement are subject to\na statutory hold period of four months from the date of issuance in\naccordance with applicable securities legislation.\n\n     In connection with the Placement, the Company issued an aggregate\n$150,000 principal amount of Debentures and 53,571 Common Shares to\naffiliates of Hueniken Asset Management Inc. (\"Hueniken\"). The issuance of\nsuch securities to Hueniken, an insider of the Company (as defined under\napplicable securities laws), constitutes a \"related party transaction\"\nwithin the meaning of Policy 5.9 - Protection of Minority Security Holders\nin Special Transactions of the TSX Venture Exchange (\"TSXV\") and\nMultilateral Instrument 61-101 - Protection of Minority Security Holders in\nSpecial Transactions (\"MI 61-101\"). The Company is relying on the exemption\nfrom the formal valuation requirement in section 5.5(b) of MI 61-101 (as a\nresult of its Common Shares being listed on the TSXV) and the exemption\nfrom the minority approval requirement in section 5.7(1)(b) of MI 61-101\n(as neither the fair market value of the securities distributed to Hueniken\npursuant to the Placement, nor the consideration paid by Hueniken exceeded\n$2,500,000).\n\n     About the Company\n\n     Mimi's Rock Corp. (formerly Commerce Acquisition Corp.) is an online\ndietary supplement and wellness company operating under the Dr. Tobias\nbrand. The brand features over 30 products including the top selling colon\ncleansing product and the #1 selling Omega 3 Fish Oil on Amazon.com. The\nCompany currently serves customers in the United States and has rapid\ngrowth plans to expand into other markets.\n\n     Forward Looking Statements\n\n     This news release may contain forward-looking statements or\n\"forward-looking information\" within the meaning of applicable Canadian\nsecurities laws (\"forward-looking statements\"). Often, but not always,\nforward-looking statements can be identified by the use of words such as\n\"plans\", \"expects\" or \"does not expect\", \"is expected\", \"budget\",\n\"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does\nnot anticipate\", or \"believes\", or describes a \"goal\", or variation of such\nwords and phrases or state that certain actions, events or results \"may\",\n\"could\", \"would\", \"might\" or \"will\" be taken, occur or be achieved.\n\n     All forward-looking statements reflect the Company's beliefs and\nassumptions based on information available at the time the statements were\nmade. Actual results or events may differ from those predicted in these\nforward-looking statements. All of the Company's forward-looking statements\nare qualified by the assumptions that are stated or inherent in such\nforward-looking statements.\n\n     Forward-looking statements involve known and unknown risks, future\nevents, conditions, uncertainties and other factors which may cause the\nactual results, performance or achievements to be materially different from\nany future results, prediction, projection, forecast, performance or\nachievements expressed or implied by the forward-looking statements. Such\nfactors include, among others, internal and external factors disclosed in\nthe most recent annual information form of the Company and other documents\npublicly filed by the Company. Although the Company has attempted to\nidentify important factors that could cause actual actions, events or\nresults to differ materially from those described in forward-looking\nstatements, there may be other factors that cause actions, events or\nresults not to be as anticipated, estimated or intended. There can be no\nassurance that forward-looking statements will prove to be accurate, as\nactual results and future events could differ materially from those\nanticipated in such statements. Accordingly, readers should not place undue\nreliance on forward-looking statements.\n\n     The Company disclaims any intention or obligation to update or revise\nany forward-looking statements whether as a result of new information,\nfuture events, or otherwise, except in accordance with applicable\nsecurities laws.\n\n     This press release does not constitute an offer to sell or a\nsolicitation of an offer to buy any of the securities in the United States.\nThe securities have not been and will not be registered under the United\nStates Securities Act of 1933, as amended (the \"U.S. Securities Act\") or\nany state securities laws and may not be offered or sold within the United\nStates or to U.S. Persons unless registered under the U.S. Securities Act\nand applicable state securities laws or an exemption from such registration\nis available. Not for distribution to U.S. Newswire Services or for\ndissemination in the United States. Any failure to comply with this\nrestriction may constitute a violation of U.S. Securities laws.\n\n     Neither the TSX Venture Exchange nor its Regulation Services Provider\n(as that term is defined in the policies of the TSX Venture Exchange)\naccepts responsibility for the adequacy or accuracy of this news release.\n\n Contact Information:\n\nvisit mimisrock.com or contact: Telfer Hanson, (416) 230-3003,\ninfo@mimisrock.com\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133400428.MNPRE2133401898-06325120211201</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}