{"date": "2021-11-18 04:37:29+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>\n      We're excited to celebrate ten years of re:Invent with you in-person and online! As an AWS Premier Consulting Partner and Gold Sponsor of AWS re:Invent 2021, Onica by Rackspace Technology has exciting activities for everyone with a packed schedule of hands-on activities, executive presentations, and networking events.\n    </p>\n              <p>\n      Learn about (and hopefully try for yourself at our booth) a fun, educational, and interactive experience we developed showcasing how we help customers innovate their IoT portfolio with AWS. You'll also hear about exciting new solutions that we've developed to support your AWS journey at the conference.\n    </p>\n              <p>\n      This year you'll find us at re:Invent booth 706 within the Venetian Sands Expo in Las Vegas, NV, from November 28th through December 3rd. Highlights of our 2021 line-up include:\n    </p>\n              <h4>\n      Rise of the machine (learning): Power up Your IoT Game!\n    </h4>\n              <p>\n      In-person, visitors will observe and engage with a miniaturized industrial hardware environment being monitored in real-time by AWS IoT services and AWS machine learning services for anomaly detection.​\n    </p>\n              <p>\n      Booth attendees will interact with the hardware and see how the AWS IoT and machine learning services can detect trends and abnormal behavior in hardware, enabling automated alerting and preventive maintenance actions.​\n    </p>\n              <p>\n      Learn more about our IoT solutions <a href=\"https://www.rackspace.com/applications/iot-edge\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a>.\n    </p>\n              <h4>\n      Ready, Set, Operate: The AWS Cloud Operations Model​\n    </h4>\n              <p>\n      Operations are at the heart of driving success for organizations' cloud migration and modernization journeys. AWS has spent more than a decade helping organizations move to and operate in the cloud.\n    </p>\n              <p>\n      Join Bill Vass, VP of Engineering, Storage, Automation, and Management at AWS, and Josh Prewitt, Chief Product Officer (CPO) at Onica by Rackspace Technology, on the main stage, Wednesday, December 1st at 5:30 PM (PT), for a leadership session discussing how the cloud operations model can drive the business outcomes you want.\n    </p>\n              <p>\n      Discover how the AWS Cloud operations model can help you build securely and successfully in the cloud-whether on-premises, in the cloud, edge, or hybrid environments. Plus, learn how organizations have successfully used the cloud operations model to speed up innovation.​\n    </p>\n              <h4>\n      re:Invent Virtual Booth and On-demand\n    </h4>\n              <p>\n      Virtual attendees can expect to log in to a wealth of content focused on our Elastic Engineering, IoT, artificial intelligence, and hybrid cloud solutions, plus a special mini data lake offer.\n    </p>\n              <p>\n      You can also catch the rebroadcast of Bill Vass' and Josh Prewitt's leadership session at the following times and again on-demand through December 10th:\n    </p>\n              <ul class=\"bulleted-list arrowlist\">\n                <li>\n        Thursday, December 2nd from 5:30 PM - 6:30 PM (SGT)\n      </li>\n                <li>\n        Thursday, December 2nd from 5:30 PM - 6:30 PM (GMT)\n      </li>\n              </ul>\n              <p>\n      And keep an eye on our blog; we'll also be keeping you up to date with insights and commentary on all the exciting announcements, keynotes, and launches coming out of re:Invent this year from AWS.\n    </p>\n              <p>\n      Whether you're attending virtually or in person, our AWS team is looking forward to engaging with you at AWS re:Invent 2021. For conference, event registration information, and a complete list of featured customers, <a href=\"https://events.rackspace.com/aws-reinvent-2021-rackspace-technology-events/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">click here</a>!\n    </p>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.rackspace.com/blog/road-aws-reinvent-2021\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Rackspace Technology Inc.</strong> published this content on <strong>17 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>18 November 2021 04:37:29 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Rackspace Technology Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Rackspace-Technology-Inc.</p></div>"}