{"date": "2021-12-09 20:28:09.223000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.16, "close": 3444.24}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>BIG SCREEN ENTERTAINMENT GROUP INC (\"BSEG-0\")\n- Continues Expansion With Google Play Launch\n\n   Big Screen Entertainment Group has launched its over-the-top (OTT)\nstreaming platform in the Google Play Store.\n\n   This app integration is the latest audience expansion move from Big\nStream Entertainment, which showcases hundreds of hours of the company's\nfilm and TV content and was previously available just as a Roku channel and\nonline.\n\n   The move puts Big Stream onto Android devices and positions the company\nfor further revenue generation from subscription video-on-demand and\nadvertising as demand for the platform grows.\n\n   \"Streaming our content directly to consumers across a range of media\ndevices is key to success in the current entertainment landscape,\" said\nKimberley Kates, Chief Executive of Big Screen. \"With the current surge in\ndemand for movie and television content, we are well positioned to benefit\nby growing our global viewership.\n\n   \"Big Screen is also looking to bring BSE app onto Apple iOS devices\ntargeting mid next year. With our first application now published on\nAndroid, we are also in time looking to build more applications for\nentertainment content, games, and more,\" added Kates.\n\n   Android users can use this link to install Big Stream Entertainment onto\ntheir phone and/or tablets.\n\n   Link:\n<a href=\"https://play.google.com/store/apps/details?id=com.bigscreenentertainmentgro\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://play.google.com/store/apps/details?id=com.bigscreenentertainmentgro</a>\nup.bigstreamentertainment\n\n   The company is focused on developing new content and raising funds to\ncreate more original films and shows, following the successful streaming\nmodel originated by Netflix and Amazon.\n\n   COVID-19 lockdowns led to a big increase in OTT viewing figures\nworldwide and demonstrated the importance for entertainment companies to\nmove beyond traditional media delivery systems and enter the streaming\ngame.\n\n   Big Stream features over 250 titles with a mix of original content along\nwith its library of films, shows and documentaries.\n\n   About Big Screen Entertainment (BSEG)\n\n   Big Screen Entertainment Group (OTC:BSEG) is a well-established\ndistribution and production company based in Beverly Hills. Built on a love\nfor storytelling, the business launched in 2005. It continues to grow and\nevolve into new commercial models in an ever-changing media world.\n\n   Forward-Looking Statement: A number of statements contained in the press\nrelease are forward-looking statements that are made pursuant to the safe\nharbor provisions of the Private Securities Litigation Act of 1995. These\nforward-looking statements involve a number of risks and uncertainties,\nincluding timely development, and market acceptance of products and\ntechnologies, competitive market conditions, successful integration of\nacquisitions and the ability to secure additional sources of financing.\nWhen used in this press release, words such as \"could,\" \"plan,\" \"estimate,\"\n\"expect,\" \"intend,\" \"may,\" \"potential,\" \"should,\" and similar expressions\nare forward-looking statements.\n\nLorraine Lee\n323.654.3400\nbig@bigscreenent.com\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134200550.MNPRE2134202731-12264420211209</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}