{"date": "2021-12-15 13:48:38+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds more detail on current members</p><p class=\"tr-by\">By Elizabeth Culliford</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Dec 15 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Video-conferencing platform Zoom has joined a counterterrorism organization formed by major U.S. tech companies including Meta Platforms Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a>, formerly known as Facebook, and Microsoft Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MSFT.O\" data-type=\"ric\" data-ric=\"MSFT.O\" translate=\"no\" dir=\"ltr\">MSFT.O</a>, the group said on Wednesday.</p><p>The Global Internet Forum to Counter Terrorism (GIFCT) <span class=\"tr-strong\">is</span> an independent group through which member companies share information to combat terrorism and violent extremism on their sites.</p><p>Zoom Video Communications Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ZM.O\" data-type=\"ric\" data-ric=\"ZM.O\" translate=\"no\" dir=\"ltr\">ZM.O</a>, which saw usage explode during the COVID-19 pandemic but has faced <a href=\"https://www.reuters.com/news/picture/zoom-shares-tumble-as-revenue-growth-slo-idUSKBN2I81C0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">slowing growth</a> in recent months, has come under scrutiny over how to police content and abuses on its platform. </p><p>GIFCT'<span class=\"tr-strong\">s founding members were Facebook, Microsoft, Twitter <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TWTR.N\" data-type=\"ric\" data-ric=\"TWTR.N\" translate=\"no\" dir=\"ltr\">TWTR.N</a> and Alphabet's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a> YouTube.</span></p><p><span class=\"tr-strong\">Its membership has risen to 18 companies with </span>five new platforms <span class=\"tr-strong\">joining this </span>year including home-rental <span class=\"tr-strong\">firm </span>Airbnb <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ABNB.O\" data-type=\"ric\" data-ric=\"ABNB.O\" translate=\"no\" dir=\"ltr\">ABNB.O</a>, social network Tumblr and online publishing platform WordPress. It <span class=\"tr-strong\">said it </span>plans for more in 2022.</p><p>Tech companies have long been criticized for failing to curb violent extremist activity on their platforms, though they also face concerns over free expression.</p><p>GIFCT was created in 2017 under pressure from U.S. and European governments after a series of deadly attacks in Paris and Brussels. </p><p><span class=\"tr-strong\">It </span>manages a hash-sharing database, where member companies can share \"hashes\", unique numerical representations of original pieces of content that have been removed from their services. Other companies can use these hashes to identify the same content on their sites and review or remove the material.</p><p>\"It is our responsibility to support our users and protect them against online threats,\" Josh Parecki, Zoom's associate general counsel for trust and safety, <span class=\"tr-strong\">said in </span>a statement. </p><p>\"By collaborating with other leaders across the industry, sharing key learnings and advancing research, we aspire to make the digital world a safer place for all.\"</p><p>As individuals and companies turned to video-conferencing apps during COVID-19 lockdown restrictions, Zoom faced high-profile content moderation issues. </p><p>These ranged from abuses like \"zoombombing\", where uninvited users crashed others' calls to share hate speech and racist, violent or pornographic content, to decisions like its cancellation of a virtual event featuring Leila Khaled, a member of a Palestinian group on the U.S. State Department's list of terrorist organizations. </p><p>GIFCT Executive Director Nicholas Rasmussen said in a statement it was delighted to add Zoom as its mission \"requires we work with a diverse range of companies ...to develop cross-platform solutions that render terrorists and violent extremists ineffective across the internet\".</p><p>GIFCT has faced criticism from some human and digital rights advocates over centralized or over-broad censorship, and calls for greater transparency.     </p><p>In July, the organization <a href=\"https://www.reuters.com/technology/exclusive-facebook-tech-giants-target-manifestos-militias-database-2021-07-26\" data-type=\"url\" class=\"tr-link\" translate=\"no\">expanded the scope</a> of its hash-sharing database to include attacker manifestos and other publications and URLs flagged by the United Nations initiative Tech Against Terrorism. It also said it would continue to broaden the database to include hashes of audio files or certain symbols. </p><p>GIFCT also said on Wednesday it has designed a new membership structure based on company revenue, with suggested annual contributions ranging from $0 to $1 million. It said membership was not contingent on a company's revenue.</p><p><span class=\"tr-strong\">Other members include Meta's Instagram and WhatsApp, </span>Pinterest <a href=\"reuters://REALTIME/Verb=FullQuote/ric=PINS.N\" data-type=\"ric\" data-ric=\"PINS.N\" translate=\"no\" dir=\"ltr\">PINS.N</a>, Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, <span class=\"tr-strong\">chat platform Discord </span>and file-sharing service Dropbox <a href=\"reuters://REALTIME/Verb=FullQuote/ric=DBX.O\" data-type=\"ric\" data-ric=\"DBX.O\" translate=\"no\" dir=\"ltr\">DBX.O</a>. Other companies <span class=\"tr-strong\">such as </span>Reddit and Snapchat-owner Snap <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SNAP.N\" data-type=\"ric\" data-ric=\"SNAP.N\" translate=\"no\" dir=\"ltr\">SNAP.N</a> can also access the hash-sharing database.</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Elizabeth Culliford in Birmingham, England; editing by Lisa Shumaker and Jason Neely)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:elizabeth.culliford@thomsonreuters.com\" data-type=\"email\" translate=\"no\">elizabeth.culliford@thomsonreuters.com</a> ; 2127679959; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: ZOOM VIDEO COMMN-COUNTERTERRORISM/ (UPDATE 1, EXCLUSIVE, , PIX)</p></div>"}