{"date": "2021-05-03 12:36:26+00:00", "ticker": "AVV", "mrkt_info": {"open": 3330.0, "close": 3317.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><h4>\n      Being a part of the exclusive AVEVA Model-Driven MES Practice allows ICT to offer elevated benefits to customers.\n    </h4>\n              <p>\n                <strong>ROTTERDAM, May 3, 2021 - AVEVA, a global leader in industrial software, driving digital transformation for industrial organizations managing complex operational processes, has selected ICT Netherlands, part of ICT Group, to join its Model-Driven Manufacturing Execution System (MES) Practice Partner Program. ICT Netherlands is one of only three partners from the Benelux region who has qualified for this elite program by meeting AVEVA standards and requirements. As a development partner, ICT will help AVEVA to build a knowledge base with reusable templates. This contributes to expanding industry best practices and functionality in AVEVA's software library and enables ICT to realize projects much faster, bringing in enhanced benefits to end customers.</strong>\n              </p>\n              <p>\n      We are proud to be part of AVEVA's worldwide Practice Partner Program as one of only three partners in the Benelux.\n    </p>\n              <p>\n      Erwin Pouwels, Strategic Partner Director of ICT Netherlands\n    </p>\n              <p>\n      Mark Satink, General Manager of AVEVA Distributor Wonderware Benelux, said, 'The Model-Driven MES offering is our solution for a Manufacturing Execution System at production companies that want to step into the Industry 4.0 era to become a truly <a href=\"https://ictgroup.eu/solution/industrial-automation/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">smart factory</a> with optimal automatized and paperless workflows. We need knowledgeable partners that have the necessary skill to integrate our solution. ICT already has a proven track record in the implementation of our SCADA and MES offering, and we are delighted that they are taking this next step.'\n    </p>\n              <p>\n      Model-Driven MES is a processcentric approach to the digital transformation of best practices for reuse, sustainable standardization, and continuous improvement in plant and multi-site manufacturing operations. AVEVA's Model-Driven MES approach combines the traditional benefits of a manufacturing execution system with modern digital workflow management technology to bring people, organizations, and processes together for increased efficiency as well as for capturing work processes and operational procedures in digital workflows and related user experience configurations (models).\n    </p>\n              <p>\n      As a supplier, <a href=\"https://www.aveva.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AVEVA</a> has chosen to focus primarily on developing, and delivering the software product portfolio including service and support. Delivering projects with their software products is reserved for these elite system integrators. This allows all parties to do what they do best.\n    </p>\n              <p>\n      Erwin Pouwels, Strategic Partner Director of ICT Netherlands, said, 'We are proud to be part of AVEVA's worldwide Practice Partner Program as one of only three partners in the Benelux. ICT is a major player in the European technology solutions market. We have already realized several large projects with AVEVA MES. In addition, we have a large group of expert engineers who have extensive domain knowledge, mainly in the Food, Chemical, Pharma and Water market segments. Thanks to this intensive partnership with AVEVA, our customers will benefit from the advantages of Model-Driven MES.'\n    </p>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://ict.eu/2021/ict-selected-as-aveva-model-driven-mes-practice-partner/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>ICT Group NV</strong> published this content on <strong>03 May 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>03 May 2021 12:36:26 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - ICT Group NV</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: ICT-Group-NV</p></div>"}