{"date": "2021-12-29 13:06:49.247000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3393.39, "close": 3384.02}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>UMAX GROUP CORP (\"UMAX-0\")\n- Funny Media Group Signs Distribution Deal with Foundation Sales\n- and Consulting\n\n     UMAX Group Corp. a Nevada corporation, has signed a deal to distribute\nits comedy specials with Foundation Sales and Consulting, a company known\nfor its strategic and operational expertise in the film, television, and\nthe evolving digital and technology space.\n\n     After the acquisition of Funny Media Group in May 2021, UMAX has now\nfully transitioned into comedy development as the vehicle to achieve a\ncash-flow positive operation and to provide the best return on\nshareholder's investment.\n\n     Rondell Fletcher (UMAX President and CEO), who has been producing\ncontent for more than 19 years, says that Foundation will become a great\npartner.\n\n     \"We couldn't have asked for a more dedicated and experienced group of\nprofessionals,\" Mr. Fletcher says.\n\n     As part of its deal with Foundation, Funny Media Group has developed a\nnew format called \"The Cube\"-30-minute episodes featuring 15 minutes each\nfrom two select comedians.\n\n     \"The Cube allows us to highlight the work of some of our funniest\ncomedians,\" Mr. Fletcher says.\n\n     Since beginning the shows in May 2021, FMG's YouTube channel has\nracked up over 1.5M views over only 40 shows. Two hundred shows have been\ntaped, with 160 remaining to be released.\n\n     \"The response has been fantastic,\" Mr. Fletcher says.\n\n     Mr. Fletcher has an extensive background in production and media. He\nhas owned his own production studio in Los Angeles for the past 19 years\nand has produced national shows for CNN, FOX, Food Network and Comedy\nCentral, among others.\n\n     The short-term goal for Funny Media Group is to produce content for\nstreaming services such as Netflix and Amazon with the long-term goal of\nbuilding a large media catalog for acquisition.\n\n     Funny Media's social media sites are as follows:\n\n     Website: <a href=\"https://www.FunnyMediaGroup.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.FunnyMediaGroup.com</a>\nInstagram: <a href=\"https://www.instagram.com/funnymediagroupofficial/?hl=en\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.instagram.com/funnymediagroupofficial/?hl=en</a>\nYouTube: <a href=\"https://www.youtube.com/watch?v=bbv-T0DNjMM\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.youtube.com/watch?v=bbv-T0DNjMM</a>\n\n     About Us\n\n     UMAX Group Corp. is a Nevada corporation, is a public-quoted Pink\nSheet issuer under the ticker symbol \"UMAX\". UMAX reports as an alternative\nreporting issuer with OTC Markets Group, Inc. and is current in its\nmandatory required filings (E.g., \"Pink Sheet Current\").\n\n     Disclaimer Regarding Forward-Looking Statements\n\n     Certain statements that we make may constitute \"forward-looking\nstatements\" under the Private Securities Litigation Reform Act of 1995.\nForward-looking statements include information concerning future strategic\nobjectives, business prospects, anticipated savings, financial results\n(including expenses, earnings, liquidity, cash flow and capital\nexpenditures), industry or market conditions, demand for and pricing of our\nproducts, acquisitions and divestitures, anticipated results of litigation\nand regulatory developments or general economic conditions. In addition,\nwords such as \"believes,\" \"expects,\" \"anticipates,\" \"intends,\" \"plans,\"\n\"estimates,\" \"projects,\" \"forecasts,\" and future or conditional verbs such\nas \"will,\" \"may,\" \"could,\" \"should,\" and \"would,\" as well as any other\nstatement that necessarily depends on future events, are intended to\nidentify forward-looking statements. Forward-looking statements are not\nguarantees, and they involve risks, uncertainties, and assumptions.\nAlthough we make such statements based on assumptions that we believe to be\nreasonable, there can be no assurance that actual results will not differ\nmaterially from those expressed in the forward-looking statements. We\ncaution investors not to rely unduly on any forward-looking statements.\n\n     Company Information:\n\n     UMAX Group Corp.\n2020 Bay Avenue\nLos Angeles, California 90021\nWeb: New website under construction\n\n     Website: <a href=\"https://funnymediagroup.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://funnymediagroup.com</a>/\nInstagram: <a href=\"https://www.instagram.com/funnymediagroupofficial/?hl=en\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.instagram.com/funnymediagroupofficial/?hl=en</a>\nYouTube:https://www.youtube.com/c/FunnyMediaGroup\n\nContact Information:\n\nJack Zietz\nEmail: investors@umaxgrpcorp.com\n<a href=\"http://www.umaxcorp.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.umaxcorp.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2136000046.MNPRE2136000668-16324720211227</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}