{"date": "2021-12-07 19:12:18.929000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>H &amp; R BLOCK INC (\"HRB-N\")\n- New H&amp;R Block Insights Report Looks Back at a Year of Americans\n- Changing the Way They Worked and Becoming Smarter with Money\n\n     H&amp;R Block released a new report with insights into American life,\ninformed by the 12 million hours of conversations its associates have as\nthey help 22 million Americans file their taxes each year. The report,\nInsights on American Perseverance, outlines how Americans have persisted\nthrough the COVID-19 pandemic, to turn adversity into opportunity and\nemerge stronger than ever.\n\n     \"The country and the world have overcome countless hurdles recently,\nand new challenges every day require renewed flexibility and adaptability,\"\nsaid Karen Orosco, H&amp;R Block's president, global consumer tax &amp; service\ndelivery. \"Our clients give us unique perspective on how this unusual time\nhas changed our country. Their experiences reveal just how strong American\nresiliency is, even in the face of unprecedented pressures.\"\n\n     American work continues to shift: small business, gigs, side hustles\nAs the labor market shifted, during the last tax season, the number of\npeople claiming unemployment jumped four to six times across all income\nlevels, which led to people exploring new and alternative job options--such\nas starting a small business.\n\n     Nearly a quarter of new small businesses were started by people under\n30, including 12% by those 19- to 25-years old and another 12% by those\naged 26 to 30. In addition to new small businesses, many people started gig\nwork or side hustles. These were most concentrated among men in Colorado,\nGeorgia and Idaho.\n\n     People are getting smarter with money\nThe H&amp;R Block data shows that Millennials and Gen Zers also jumped into the\nstock market as the pandemic continued. Over the last year, Millennial\nparticipation in the market grew by 4.5 times, while Gen Z participation\ndoubled.\n\n     In addition, people under age 29 were 55% more likely than older\ngenerations to have made money in cryptocurrency. Gen Zers and Millennials\nalike saw a 155% year-over-year increase in cryptocurrency-linked profits.\n\n     Other report insights include:\n\n     *  13% more teenagers and 20-somethings filed their taxes\nindependently for the first time, instead of their parents claiming them as\ndependents, likely to take advantage of stimulus payments that totaled as\nmuch as $3,200 per person.\n     *  Consumer spending was weighted toward deliveries of necessities and\nfood, with Amazon purchases increasing 82% in 2020 for H&amp;R Block Emerald\nCard account holders.\n     *  Couples under 40 without children, and earning more than $100,000\nannually, moved most frequently--and farthest--during the pandemic.\nSoutherners moved primarily to the mountain West, Northeasterners moved to\nthe South, and Pacific Westerners moved to Texas, Oklahoma, Arkansas and\nLouisiana.\n\n     View the full report and learn more here.\n\n     About H&amp;R Block\n\n     H&amp;R Block, Inc. (NYSE: HRB) provides help and inspires confidence in\nits clients and communities everywhere through global tax preparation,\nfinancial products, and small-business solutions. The company blends\ndigital innovation with the human expertise and care of its associates and\nfranchisees as it helps people get the best outcome at tax time and better\nmanage and access their money year-round. Through Block Advisors and Wave,\nthe company helps small-business owners thrive with innovative products\nlike Wave Money, a small-business banking and bookkeeping solution, and the\nonly business bank account to manage bookkeeping automatically. For more\ninformation, visit H&amp;R Block News or follow @HRBlockNews on Twitter.\n\n     For Further Information\n\n//st\n\n Contact Information:\n\nContact:   Michaella Gallina, (816) 854-3022,\n                        michaella.gallina@hrblock.com\n\n                        Jordyn Eskijian, (816) 854-5674,\n                        jordyn.eskijian@hrblock.com\n\n  Media Relations:      Angela Davied, (816) 854-5798,\n                        angela.davied@hrblock.com\n\n//et\n\nTel   : 1-816-854-3000    H &amp; R BLOCK INC\nEmail : investorrelations@hrblock.com\nWWW   : <a href=\"https://www.hrblock.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.hrblock.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134000487.MNPRE2134002830-11031420211207</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}