{"date": "2022-02-25 02:00:21.783000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2896.54, "close": 3075.77}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p> <br/>   By Swastika Mukhopadhyay and Monika Asthana<br/>NewsRise<br/>   MUMBAI (Feb 25) -- Events scheduled on Friday: <br/><br/>NEW DELHI: National Company Law Appellate Tribunal to hear Amazon’s case challenging the Competition Commission of India’s order in Amazon-Future Group deal.<br/><br/>NEW DELHI: 10:00 am: Health Minister Mansukh Mandaviya, Junior Chemicals and Fertilizers Minister Bhagwanth Khuba, Department of Chemicals and Petrochemicals Secretary Arti Ahuja, Joint Secretary (Petrochemicals) Kashi Nath Jha at FICCI event. <br/><br/>10:30 am: Prime Minister Narendra Modi, Defence Minister Rajnath Singh at post-budget webinar on defence sector.<br/><br/>11:00 am: Ministry of Electronics and IT MyGov Chief Executive Officer Abhishek Singh, Google Research India Director Manish Gupta at FICCI webinar on artificial intelligence technology for India.<br/><br/>11:00 am: India Ratings and Research webinar on FY23 outlook for non-banking finance companies and housing finance companies.<br/><br/>4:30 pm: Finance Minister Nirmala Sitharaman, Niti Aayog Chief Executive Officer Amitabh Kant at Asia Economic Dialogue 2022.<br/><br/>MUMBAI: 5:00 pm: RBI to release weekly foreign exchange data.<br/><br/>MUMBAI: RBI to set underwriting fees for INR230 billion weekly bond auction.<br/><br/>MUMBAI: India to sell federal bonds worth INR230 billion.<br/><br/>MUMBAI: RBI to conduct 14-day variable rate reverse repo auction worth INR7 trillion.<br/><br/>EARNINGS: Rain Industries. <br/>   - By Swastika Mukhopadhyay and Monika Asthana; swastika.mukhopadhyay@newsrise.org; +91-33-6813 3333<br/>- Edited by Gurdev Singh Virk<br/>- Send Feedback to feedback@NewsRise.org<br/>- Copyright (c) 2022 NewsRise Financial Research &amp; Information Services Pvt. Ltd.<br/>    </p></div>"}