{"date": "2021-11-14 23:54:53.577000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Bengaluru</p></div><div class=\"tr-npp-lead\"><p>Bengaluru, Nov. 14 -- Amazon Seller Services Pvt. Ltd., the Indian seller marketplace arm of Amazon, has raised around Rs.1,460 crore from parent, as a part of a new corporate round, amid an intensifying battle with Walmart-owned Flipkart in India's booming online retail market.</p><p>Singapore-based Amazon Corporate Holdings Pvt. Ltd. invested around Rs.1,459.93 crore as a part of the current round, with Mauritius-based Amazon.com.incs Ltd investing another Rs.6.74 lakh in the Indian unit, showed regulatory filings with the corporate affairs ministry accessed by business intelligence platform Tofler.</p></div><div class=\"tr-npp-body\"><p>Amazon Corporate Holdings was allotted 1.45 billion shares and Amazon.com.incs another 67,452 shares at a nominal value of Rs.10 per share.</p><p>The new fund infusion in Amazon's seller marketplace arm comes days after Amazon Pay, the digital payments unit of Amazon India, raised Rs.1,000 crore from Amazon Corporate Holdings and Amazon.com.incs, earlier this month.</p><p>Previously, Amazon Pay also raised Rs.450 crore ahead of the Diwali season sales from its US parent to compete with Flipkart during the month-long festive season sales. Those funds were also raised by Amazon Corporate Holdings and Amazon.com Inc.</p><p>As a part of its month-long festive season sale, Amazon India said that almost 79% of new customers were from non-metro cities such as Ernakulam, Guntur, Krishna and Godavari.</p><p>Kiranas and local businesses which joined the 'Local Shops' programme, launched in April 2020, registered nearly two-fold growth during the festive sales. Categories such as large appliances, kitchen essentials, home entertainment and furniture continued to be top selling products for the 'Local Shops' programme, the company said in a statement earlier this month.</p><p>The US-based e-commerce major has on-boarded more than 300,000 of the the total 850,000 sellers listed on Amazon India since January 2020. The company has also helped Indian MSMEs export $1 billion in shipments in the past 12 months under its 'Global Selling' programme, it said earlier this year. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}