{"date": "2022-01-11 14:40:53.570000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>KOMO PLANT BASED FOODS INC (\"YUM-Z\")\n- Now Distributed in Ontario and Quebec Through BRR Logistics, a\n- Unilever Master Distributor\n\n     Komo Plant Based Foods Inc. (\"Komo\"), a premium plant-based food\ncompany, is pleased to announce that BRR Logistics is now carrying all Komo\nfrozen plant-based products for distribution, with a focus on Ontario and\nQuebec. BRR offers one of Canada's largest selections of high quality\nfrozen consumer goods, working with some of the biggest brands and\nretailers in the world. BRR is a Unilever Master Distributor and directly\nservices all national grocery banners including Loblaws, Real Canadian\nSuperstore, Metro, The Northwest Company, Sobeys, Costco and Walmart.\nAdditionally BRR services a large number of independent grocery accounts.\nIts weekly service points include the following jurisdictions;\nSaskatchewan, Manitoba, Nunavut, Ontario, Quebec and Atlantic.\n\n     \"Myself and the entire team at BRR are really excited as we prepare to\nlaunch Komo Comfort Foods to major grocery retail in Canada. While focusing\nin Ontario and Quebec we will be making sensible and delicious vegan family\noptions available on shelf for 2 in 3 Canadian households! We have watched\nas the brand exceeded expectations in Western Canada and we are hearing\nfrom buyers across Ontario and Quebec who have also noticed Komo and\nrecognized the gap their products fill in the marketplace. There is an\ninventory position in Ontario now and we expect to see strong demand for\nKomo Comfort Foods in Q1 2022,\" says Michael Wakefield, President and CEO,\nBRR Logistics Limited.\n\n     BRR picked up its first order of Komo Plant-Based foods in late\nDecember 2021 and is now actively distributing Komo products across Canada,\nwith a focus on Ontario and Quebec. BRR partners with TransCold\nDistribution, who began distributing Komo in October 2021, to major grocery\nchains in British Columbia and Alberta. Komo frozen plant-based products\nare now carried by five distributors - BRR Logistics, TransCold\nDistribution (which sells to Safeway, Save on Foods, Loblaws, Real Canadian\nSuperstore, Fresh Co, Thrifty Foods, Whole Foods, Walmart, Nesters Market,\nBuy-Low Foods, Walmart, Costco, 7-Eleven, Shoppers Drug Mart, SPUD.ca and\nPomme Natural Market in Western Canada), Dean's Dairy, Goodness\nDistributors and Nationwide Natural Foods (which focuses on delivering\nclean, natural products that cater to a certain lifestyle to major and\nindependent grocery stores, specialty stores, coffee shops and bistros,\nincluding Sobeys, Choices, Quality Foods, Country Grocer, Save-On-Foods and\nWhole Foods across Canada).\n\n     In addition to selling through a retail network, Komo sells its\nproducts directly to consumers through its e-commerce website and at local\nfarmers' markets. A full list of retail locations can be found at the\ncompany's website in addition to over 200 reviews from verified buyers.\n\n     About BRR Logistics Limited\nBRR Logistics Limited (BRR) is a privately held Canadian corporation\nproviding deep-frozen storage and distribution needs across the entire\ncountry. BRR's centralized operations are from a 100 000 sq foot, state of\nthe art freezer facility in Brampton, ON. Utilizing a national dedicated\ndeep frozen logistics fleet ensures all products reach their intended\ndestination on time and in premium condition. Brands and retailers are\nsupported by a full service customer team including strategic brand\nmanagement, key account management, GS1 - ECCnet management, order entry as\nwell as inbound and outbound EDI orders and invoicing. BRR offers one of\nCanada's largest selections of high quality frozen consumer goods, working\nwith some of the biggest brands and retailers in the world. BRR directly\nservices all national grocery banners including Loblaws, Metro, The\nNorthwest Company, Sobeys and Walmart on a weekly basis whether direct to\nstore or direct to warehouse delivery. Additionally BRR services a large\nnumber of independent grocery accounts as well as national and independent\nconvenience and gas including 7-Eleven and Couche Tard. Weekly service\npoints include the following jurisdictions; Saskatchewan, Manitoba,\nNunavut, Ontario, Quebec and Atlantic. BRR partners with TransCold\nDistribution in British Columbia and Alberta. Suitably BRR Logistics\nLimited's head office is in one of the coldest capitals in Canada,\nWinnipeg, Manitoba.\n\n     About Komo\nKomo Plant Based Foods Inc. is a premium plant-based food company that\ndevelops, manufactures and sells a variety of plant-based frozen meals that\nare always hearty, satisfying, and made with wholesome ingredients. At\nKomo, our mission is to help make plant-based meals a staple on every\ndinner table by sharing our love for feel-good food that connects the\npeople to the planet. We believe plant-based eating is the future and -\nChange can start with a single biteTM. Our experienced plant-based\ninnovation and development team recreates vegan versions of traditionally\ncheesy and meaty classics, with 100% plants. Komo's products are sold\ndirect-to-consumer through our eCommerce website and a distribution network\nof online and brick and mortar grocery, convenience and natural retailer\nchannels. Our operating subsidiary Komo Comfort Foods launched in 2021 with\nour flagship products: plant-based Lasagna, Shepherd's Pie and Chickenless\nPot Pie and has recently launched a new line - Komo Plant-Based Meal\nHelpersTM - versatile meal starters to allow the creation of many dishes at\nhome. All of our products are 100% plant-based, made with wholesome\ningredients, free from preservatives, and frozen for freshness. Freezing\nproducts is a natural and effective way of keeping food products for longer\nwithout having to use any preservatives. Komo's meals have a 1-year frozen\nshelf life. Komo also sells hot ready-to-eat meals in Metro Vancouver\nthrough Uber Eats and Skip the Dishes.\n\n     Learn more at: www.komocomfortfoods.com and follow on Instagram:\n@komocomfortfoods\n\n     For further information, please contact:\n\n     William White, President &amp; CEO, Komo Plant Based Foods Inc.\nwill@komoeats.com\n1-866-969-0882\n\n     The Canadian Securities Exchange has not reviewed, approved or\ndisapproved the contents of this news release.\n\n     Cautionary Statement Regarding Forward-Looking Statements\nCertain statements contained in this press release constitute\nforward-looking information. These statements relate to future events or\nKomo's future performance. The use of any of the words \"could\", \"expect\",\n\"believe\", \"will\", \"projected\", \"estimated\" and similar expressions and\nstatements relating to matters that are not historical facts are intended\nto identify forward-looking information and are based on Komo's current\nbelief or assumptions as to the outcome and timing of such future events.\nActual future results may differ materially. In particular, Komo's product\ndevelopment plans, its ability to launch its products on food delivery\napps, its ability to retain key personnel, its revenues, and its\nexpectation as to the acceptance of its products by retailer stores and\nconsumers constitute forward-looking information. Actual results and\ndevelopments may differ materially from those contemplated by\nforward-looking information. Readers are cautioned not to place undue\nreliance on forward-looking information. The statements made in this press\nrelease are made as of the date hereof. Komo disclaims any intention or\nobligation to publicly update or revise any forward-looking information,\nwhether as a result of new information, future events or otherwise, except\nas may be expressly required by applicable securities laws.\n\nTel   : 778-229-4781    KOMO PLANT BASED FOODS INC\nWWW   : <a href=\"https://www.komocomfortfoods.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.komocomfortfoods.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201000031.MNPRE2201000658-05035620220111</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}