{"date": "2021-11-08 19:41:54.112000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MAPLE LEAF FOODS INC  (\"MFI-T\")\n- Field Roast and JUST Egg Partner to Develop Plant-Based\n- Breakfast Sandwich Debuting Exclusively at Whole Foods\n- Market\n\nBrands collaborate on co-branded breakfast innovations to meet growing\nconsumer demand in the vegan breakfast category\n\nGreenleaf Foods, SPC, owner of leading plant-based brand Field Roast\n(Field Roast), announced the debut of the Field Roast Classic Style\nSausage, Egg &amp; Cheese Plant-Based Breakfast Sandwich, a restaurant-quality\nplant-based breakfast innovation developed in collaboration with the\nCalifornia-based food technology company Eat Just.\n\nThis press release features multimedia. View the full release here:\n<a href=\"https://www.businesswire.com/news/home/20211108005080/en\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211108005080/en</a>/\nField Roast and JUST Egg partner to develop plant-based breakfast sandwich\ndebuting exclusively at Whole Foods Market. \n\nField Roast and JUST Egg partner to develop plant-based breakfast sandwich\ndebuting exclusively at Whole Foods Market. \n\nThis first-of-its-kind co-branded vegan breakfast sandwich combines some of\nconsumers favorite plant-based product offeringsField Roast Plant-Based\nBreakfast Sausage Patty, JUST Egg Folded and Chao Creamery Creamy Original\nCheese Slice, all sandwiched in one convenient, delicious biteand will be\navailable exclusively at Whole Foods Market locations across the U.S.,\nfollowed by expanded national distribution at additional retailers in 2022.\n\nWe are pleased to expand our valued relationship with an innovator like\nEat Just, as we continue our focus and brand momentum on Field Roast\nportfolio innovation, said Dan Curtin, President of Greenleaf Foods. This\ncollaboration with two plant-based industry leaders joining forces will\nprovide a better breakfast solution for the consumer seeking high-quality\nand delicious plant-based options for their mornings.\n\nA recent OnePoll survey commissioned by Eat Just found that many\nrespondents were going plant-based during breakfast versus other meals and\nmore than 80% were open to trying a plant-based meal one day a week1. With\nthe global plant-based egg market anticipated to be worth an estimated $1.5\nbillion by 20262, JUST Egg has expanded to a variety of formats since\nlaunching nationally in 2019 and is looking to continue that momentum in\ncollaboration with Field Roasts popular plant-based breakfast sausage and\ndairy-free cheese products.\n\nSince its inception, Field Roast has built equity leveraging bold flavor\nprofiles to create mouth-watering plant-based food. This collaboration adds\nan innovative new co-branded product to their already impressive\nportfolio, said Josh Tetrick, co-founder and CEO of Eat Just. Our\ncombined expertise in the breakfast space has produced a superior breakfast\noffering that delivers on both flavor and convenience.\n\nField Roast continues to prioritize innovation, investing in a robust\nexpansion of its product portfolio with the addition of several recent\ncrave-worthy plant-based options for consumers to enjoy, most recently\nincluding:\n\n    Field Roast Signature Stadium Dog  Following its debut in March as the\nfirst pea protein-based hot dog at retail in North America, it has since\nbecome the official plant-based Dodger Dog and is currently available as a\nmenu item on chef Roy Chois famed Kogi trucks in the Los Angeles area and\nvia Goldbelly nationally through 2021.\n    Field Roast Plant-Based Pepperoni  First introduced in January 2021 at\nPizza Nova locations in Canada and currently available at participating\nLittle Caesars locations, Whole Foods Market and select other retailers\nshelves across North America.\n    Field Roast Plant-Based Nuggets  Recently expanded retail distribution\nof this plant-based chicken staple to now offer a new-and-improved formula\nthat utilizes several relevant food technologies including high moisture\nextrusion (HME) technology to better deliver on consumers expectations\nimprovements in taste, texture, and color.\n\nIn the last 12 months, the Field Roast brand has seen tremendous growth in\nthe U.S., introducing nearly 10 new products and gaining distribution at\nmore than 5,500 retailers throughout North America. Its portfolio of\nhigh-quality plant-based sausages, burgers, roasts, appetizers and entrees\nand its leading Chao Creamery dairy-free cheese products are crafted for\nthose who want to discover, indulge and share in bold taste experiences.\n\nFor more information on Field Roast, visit fieldroast.com and follow\n@FieldRoast on Facebook, Twitter and Instagram.\n\nABOUT GREENLEAF FOODS, SPC\n\nGreenleaf Foods, SPC, is transforming plant-based protein with a wide array\nof delicious and innovative products that satisfy consumers interested in\nadding protein variety to their diets. Our leading brands include\nLightlife (Lightlife) and Field Roast (Field Roast). Together, these\nbrands are delighting loyal, longtime fans and enticing new ones who never\nknew plant-based protein could taste so good. The Lightlife and Field Roast\nportfolios feature nearly 50 products and represent a leading market\nposition in the refrigerated, plant-based protein category in the U.S.\nGreenleaf Foods, SPC is a wholly owned, independent subsidiary of Maple\nLeaf Foods Inc. (TSX:MFI).\n\nABOUT EAT JUST, INC.\n\nEat Just is a food technology company with a mission to build a healthier,\nsafer and more sustainable food system in our lifetimes. The company's\nexpertise, from functionalizing plant proteins to culturing animal cells,\nis powered by a world-class team of scientists and chefs spanning more than\na dozen research disciplines. Eat Just created Americas fastest-growing\negg brand, which is made entirely of plants, and the worlds\nfirst-to-market meat made from animal cells instead of slaughtered\nlivestock. The company has been recognized as one of Fast Companys Most\nInnovative Companies, Entrepreneurs 100 Brilliant Companies, CNBCs\nDisruptor 50 and a World Economic Forum Technology Pioneer. JUST Egg has\nbeen named among Popular Sciences 100 Greatest Innovations and Fast\nCompanys World Changing Ideas and the history-making debut of GOOD Meat\nwas heralded as one of 2020's top scientific breakthroughs by The Guardian,\nVox and WIRED. For more information on JUST Egg, visit <a href=\"https://ju.st\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://ju.st</a>. For\nmore information on GOOD Meat, visit <a href=\"http://goodmeat.co\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://goodmeat.co</a>.\n\nMedia Contact: Bianca Mooney, bmooney@160over90.com\nInvestor Contact: investor.relations@mapleleaf.com\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2131100828.MNPRE2131103112-11304520211108</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}