{"date": "2022-02-15 14:40:49.684000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ELSE NUTRITION HOLDINGS INC (\"BABY-T;BABYF-0\")\n- Former Chairperson of the American Academy of Pediatrics, Dr. Susan\n- Baker joins Else's Scientific Advisory Board\n\n     ELSE NUTRITION HOLDINGS INC. (\"Else\" or the \"Company\") the Plant-Based\nbaby, toddler and children nutrition company, is pleased to announce that\nDr. Susan Baker, tenured professor of Pediatrics at the University of\nBuffalo, to its Scientific Advisory Board.\n\n     Dr. Baker is recognized as a leader, having served as Chairperson of\nthe American Academy of Pediatrics, Committee on Nutrition, Chairperson of\nthe American Board of Pediatrics, sub board of Gastroenterology and\nnumerous other national and international advisory groups including the\nInstitute of Medicine, USDA and the FDA.\n\n     \"We are extremely pleased to add Dr. Baker's experience and insights\nto the Else Nutrition Team. Her extensive expertise, particularly in\nchildren's health and nutrition will be of tremendous benefit to our\ncompany and our customers,\" said Hamutal Yitzhak, CEO of Else Nutrition.\n\n     Dr. Baker obtained her BS at the University of Pittsburgh, MD at\nTemple University School of Medicine, and PhD at Massachusetts Institute of\nTechnology. Dr. Baker completed her residency in Pediatrics at Children's\nHospital of Buffalo and her fellowship in gastroenterology at the Combined\nProgram at Massachusetts General Hospital and Children's Hospital of\nBoston.\n\n     Most recently Dr. Baker was awarded the Murray Davidson Award by the\nAmerican Academy of Pediatrics recognizing an outstanding clinician,\neducator, and scientist who made significant contributions to the field of\nPediatric gastroenterology, hepatology, and nutrition.\n\n     About Else Nutrition Holdings Inc.\n\n     Else Nutrition GH Ltd. is an Israel-based food and nutrition company\nfocused on developing innovative, clean and plant-based food and nutrition\nproducts for infants, toddlers, children, and adults. Its revolutionary,\nplant-based, non-soy, formula is a clean-ingredient alternative to\ndairy-based formula. Else Nutrition (formerly INDI) won the \"2017 Best\nHealth and Diet Solutions\" award at the Global Food Innovation Summit in\nMilan. Else Plant-Based Complete Nutrition for Toddlers was recently ranked\nas the #1 Top seller in the baby and toddler formula category on Amazon.\nThe Company recently received the World Plant-Based Award for \"Best dairy\nalternative product\" in New York at World Plant-Based Expo in late 2021.\nThe holding company, Else Nutrition Holdings Inc., is a publicly traded\ncompany, listed as TSX Venture Exchange under the trading symbol BABY and\nis quoted on the US OTC Markets QX board under the trading symbol BABYF and\non the Frankfurt Exchange under the symbol 0YL. Else's Executives includes\nleaders hailing from leading infant nutrition companies. Many of Else\nadvisory board  members had past executive roles in companies such as Mead\nJohnson, Abbott Nutrition, Plum Organics and leading infant nutrition\nSocieties,  and some of them currently serve in different roles in leading\nmedical centers and academic institutes such as Boston Children's Hospital,\nPediatrics at Harvard Medical School, USA, Tel Aviv University, Schneider\nChildren's Medical Center of Israel, Rambam Medical Center and Technion,\nIsrael and University Hospital Brussels, Belgium.\n\n     For more information, visit: elsenutrition.com or @elsenutrition on\nFacebook and Instagram.\n\nContact:\nLytham Partners, LLC\nMr. Ben Shamsian\nNew York | Phoenix\nE: shamsian@lythampartners.com\nP: 646-829-9701\n\n     TSX Venture Exchange\n\n     Neither the TSX Venture Exchange nor its regulation services provider\n(as that term is defined in the policies of the TSX Venture Exchange)\naccepts responsibility for the adequacy or accuracy of this release.\n\n     Caution Regarding Forward-Looking Statements\n\n     This press release contains statements that may constitute\n\"forward-looking statements\" within the meaning of applicable securities\nlegislation. Forward-looking statements are typically identified by words\nsuch as \"will\" or similar expressions. Forward-looking statements in this\npress release include statements with respect to the anticipated dates for\nfiling the Company's financial disclosure documents. Such forward-looking\nstatements reflect current estimates, beliefs and assumptions, which are\nbased on management's perception of current conditions and expected future\ndevelopments, as well as other factors management believes are appropriate\nin the circumstances. No assurance can be given that the foregoing will\nprove to be correct. Forward-looking statements made in this press release\nassume, among others, the expectation that there will be no interruptions\nor supply chain failures as a result of COVID 19 and that the\nmanufacturing, broker and supply logistic agreement with the Company do not\nterminate. Actual results may differ from the estimates, beliefs and\nassumptions expressed or implied in the forward-looking statements. Readers\nare cautioned not to place undue reliance on any forward-looking\nstatements, which reflect management's expectations only as of the date of\nthis press release. The Company disclaims any obligation to update or\nrevise any forward-looking statements, whether as a result of new\ninformation, future events or otherwise, except as required by law.\n\n     A photo accompanying this announcement is available at\n<a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/75e3af0c-9ef0-4ef0-bb86\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.globenewswire.com/NewsRoom/AttachmentNg/75e3af0c-9ef0-4ef0-bb86</a>\n-890ac12f73fe\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204500211.MNPRE2204501678-06282720220215</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}