{"date": "2022-01-17 21:50:35+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Rich McKay</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Jan 17 (Reuters)</span><span class=\"tr-dl-sep\"> - </span><span class=\"tr-strong\">The family of an Amazon.com delivery truck driver in Illinois who died </span>in December when a warehouse was destroyed by a swarm of tornadoes that killed six people there, filed a lawsuit against the online retailer on Monday over his death.</p><p>The suit, the first against the company stemming from the disaster, was brought in state court by the Chicago firm, Clifford Law Offices, on behalf of the family of driver Austin McEwen, 26. It was filed in Third Judicial Circuit in Madison County, Illinois.</p><p>It alleges that the Amazon knew that conditions were \"highly unsafe as tornado warnings had been issued,\" but company officials \"rolled the dice with peoples' lives to put profit over safety,\" attorney Jack J. Casciato said.</p><p>\"We are seeking damages in excess of multi-millions of dollars,\" Casciato said.</p><p>Kelly Nantel, an Amazon Spokesperson, said the warehouse was built in compliance with all codes and that Amazon managers followed the weather conditions closely.</p><p>\"We believe our team did the right thing as soon as a warning was issued, and they worked to move people to safety as quickly as possible,\" Natel said in a statement to Reuters.</p><p>\"We will defend against this lawsuit, but our focus continues to be on supporting our employees and partners, the families who lost loved ones, the surrounding community, and all those affected by the tornadoes,” she said.</p><p>On Dec. 10, a barrage of tornadoes ripped through six U.S. states, leaving a trail of death and destruction at homes and businesses stretching more than 200 miles (322 km). <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2T03T7\" data-type=\"storyId\" data-story-id=\"nL4N2T03T7\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>The six workers in an Amazon delivery station were among more than 70 who died throughout the region. The site received tornado warnings between 8:06 p.m. and 8:16 p.m. before the tornado struck the building at 8:27 p.m., according to Amazon. </p><p>Amazon managers had directed workers to shelter in bathrooms after receiving emergency alerts on mobile phones from authorities, several employees previously told Reuters.</p><p>Casciato said that the company had insufficient storm shelters and should have evacuated the warehouse when warnings were first issued a day earlier.</p><p>\"We're suing because we hope companies like Amazon learn a lesson,\" he said.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Rich McKay in Atlanta and David Shepardson in Washington; Editing by David Gregorio)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:rich.mckay@thomsonreuters.com\" data-type=\"email\" translate=\"no\">rich.mckay@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-LAWSUIT/ (PIX)</p></div>"}