{"date": "2022-01-11 09:02:25+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds context on legal representation in paragraph 11, additional links in Related Content field</p><p class=\"tr-by\">By Aditya Kalra</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW DELHI, Jan 11 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>For more than a year, Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and India's Future Group have been locked in a complex legal stand-off that has stalled Future's $3.4 billion sale of assets to the U.S. firm's rival Reliance Industries <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RELI.NS\" data-type=\"ric\" data-ric=\"RELI.NS\" translate=\"no\" dir=\"ltr\">RELI.NS</a> - with no end in sight.</p><p>Here's what the dispute, seen as key to deciding who gets an upper hand in one of the world's <a href=\"https://reut.rs/2OYLmMV\" data-type=\"url\" class=\"tr-link\" translate=\"no\">fastest-growing retail markets</a>, is all about.</p><p><br/></p><p>WHAT TRIGGERED THE DISPUTE?</p><p>In 2019, Amazon and Future, number two player in India behind market leader Reliance, became business partners when the U.S. company invested $200 million in a gift voucher unit of the Indian group. </p><p>That deal, Amazon argues, came with certain non-compete clauses that prohibited Future from selling retail assets to certain rivals, including Reliance, run by one of India's richest men, Mukesh Ambani. The deal also included clauses for settlement of any disputes under rules laid down by the Singapore International Arbitration Centre.</p><p>But in 2020, Future - hit hard by the COVID-19 pandemic - decided to sell assets to Reliance. </p><p>Amazon then approached Singapore arbitrators and successfully stopped the sale. Both parties have also challenged each other with lawsuits in Indian courts, including the Supreme Court, since the \"seat of arbitration\" remains in New Delhi and Indian law governs the proceedings.</p><p><br/></p><p>WHAT DO AMAZON AND FUTURE SAY?</p><p>Amazon argues various agreements signed in 2019 with Future gave it special rights over Future's retail assets, some of which it had also hoped to ultimately own should India's rules for foreign investors be eased. The potential Future-Reliance deal \"destroys\" the latter prospect, the U.S. company has said.</p><p>Future denies any wrongdoing, saying Amazon is illegally seeking to exert control on Future's retail business. Future Retail <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FRTL.NS\" data-type=\"ric\" data-ric=\"FRTL.NS\" translate=\"no\" dir=\"ltr\">FRTL.NS</a> - the group's flagship retail arm <span class=\"tr-strong\">- </span>says it <a href=\"https://reut.rs/2HBGN7F\" data-type=\"url\" class=\"tr-link\" translate=\"no\">faces liquidation</a> and its more than 27,000 employees can become jobless if the Reliance deal fails. </p><p>Both sides have deployed a battery of lawyers and top Indian legal firms are involved in the high-profile matter. Two lawyers who formerly occupied the position of Solicitor General of India have played a key role in arguing for Amazon and Future.</p><p><br/></p><p>WHAT'S THE BIGGER PICTURE?</p><p>At stake is whether Amazon can become a bigger force in a $900 billion retail market, with 1.3 billion consumers, than Reliance.</p><p>Conglomerate Reliance has operations including 1,100 supermarkets, while Future has more than 1,500. Both are expanding fast into e-commerce, but the Future deal will immediately boost the retail footprint of Reliance, which has <a href=\"https://reut.rs/330Is1t\" data-type=\"url\" class=\"tr-link\" translate=\"no\">attracted marquee foreign investors</a> in the business.</p><p>For its part, Amazon has invested $6.5 billion in India, which it counts as a key growth market where it is a leading e-commerce player. The Future partnership had already allowed Amazon to boost its online portfolio of grocery deliveries by integrating the Indian company's stores on its website.</p><p>Keeping Future away from Reliance chimes with Amazon's efforts to combat billionaire Ambani's growth plans. In one <a href=\"https://reut.rs/33nMWyN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">confidential legal filing</a>, Amazon said Reliance's consolidated position with Future \"will further restrict competition in the Indian retail market\".</p><p><br/></p><p>HOW DID INDIA'S ANTITRUST AGENCY GET INVOLVED?</p><p>Future complained to India's antitrust agency, the Competition Commission of India (CCI), that Amazon was making incorrect and contradictory submissions about the intent of the 2019 deal.</p><p>Amazon said it never concealed any information, but last December the CCI <a href=\"https://reut.rs/3GIXGX0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">suspended its approval</a> of the 2019 deal with Future, saying there was \"a deliberate design on the part of Amazon to suppress the actual scope\" of the deal and its interest in Future's retail businesses.</p><p>While Amazon contends the CCI acted beyond its powers, Future maintains the U.S company no longer has any right to assert its claims as the 2019 deal itself now lacks regulatory approval. </p><p>In a setback for the U.S. giant, the Delhi High Court <a href=\"https://reut.rs/32Rb8tA\" data-type=\"url\" class=\"tr-link\" translate=\"no\">this month halted</a> the Singapore arbitration proceedings between the two sides in light of the Indian antitrust decision<span class=\"tr-strong\">. </span></p><p>The arbitration has since been on hold, but Amazon has <a href=\"https://reut.rs/33hN1Ux\" data-type=\"url\" class=\"tr-link\" translate=\"no\">appealed the decisions</a> in Indian courts which are yet to hear the matter.</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Aditya Kalra in New Delhi; Editing by Kenneth Maxwell)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:aditya.kalra@tr.com\" data-type=\"email\" translate=\"no\">aditya.kalra@tr.com</a> ; +91-11-49548021; Twitter <a href=\"https://twitter.com/adityakalra\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/adityakalra</a>; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-INDIA/FUTURE-RELIANCE (UPDATE 1, EXPLAINER, PIX)</p></div>"}