{"date": "2021-09-02 07:00:14.040000+00:00", "ticker": "III", "mrkt_info": {"open": 1337.5, "close": 1338.5}, "html": "<div class=\"storyContent\" lang=\"fi\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>Eltel Networks</div>\n<p>Asiakkaan muuttaessa uuteen asuntoon sähköt kytketään päälle etäohjattavalla sähkömittarilla. Mikäli etäkytkentä epäonnistuu tai sähkömittari vikaantuu, saapuu paikalle uuden sopimuksen mukaisesti Eltelin työntekijä ratkaisemaan ongelman.</p>\n<p>Eltel ja Helen Sähköverkko ovat allekirjoittaneet sopimuksen Helsingin sähkönjakeluverkon energiamittauksiin liittyvistä kenttätöistä. Eltel vastaa jo Helen Sähköverkon sähkönjakeluverkon rakentamisesta ja kunnossapidosta ja osaltaan turvaa 400 000 loppuasiakkaan häiriötöntä sähkönjakelua. Sähkömittareihin liittyvä palvelu sopii erinomaisesti Eltelin pääkaupunkiseudun palvelukokonaisuuteen.</p>\n<p>Mika Nousiainen, mittauspäällikkö, Helen Sähköverkko: ”Asiakkaillemme sähkömittarin mittaustulos näkyy tietenkin sähkölaskulla. Yhtiönä hyödynnämme laadukkaiden mittauspalveluiden tuottamaa dataa myös monilla muilla tavoilla, muun muassa tunnistamalla sähkönkäytön muutoksia osana sähköverkon pitkän tähtäimen suunnittelua. Sähkömittareiden tuottaman laatutiedon perusteella saamme myös faktatietoa sähkömittareiden elinkaaresta. Tekoälyn analysoima data ohjaa päätöksentekoamme missä aikataulussa Helsingin 400 000 sähkömittaria tulisi vaihtaa uusiin.” </p>\n<p>Juha Luusua, toimitusjohtaja, Eltel Networks Oy: ”Tämä sopimus on hyvää jatkoa Eltelin pitkäaikaiseen mittauspalveluosaamiseen. Olemme viimeisen 15 vuoden aikana asentaneet yli 5,5 miljoonaa sähkömittaria. Tällä hetkellä työskentelemme Ruotsissa ja Saksassa noin 1,5 miljoonan mittarin asennussopimusten parissa. Olen erittäin iloinen, että voimme jälleen hyödyntää merkittäviä oppeja myös Suomessa yhteistyössä Helen Sähköverkon kanssa.”</p>\n<p>Eltel ottaa kokonaisuuden vastuulleen vuoden 2022 alussa. Sopimus jatkuu vähintään vuoden 2026 loppuun saakka, optioiden kautta pidempäänkin. Sopimus tulee työllistämään noin kymmenen mittaustöiden osaajaa.</p>\n<p><strong>Lisätietoja:</strong></p>\n<p>Juha Luusua<br/>\ntoimitusjohtaja, Eltel Networks Oy<br/>\nPuh. 040 311 3005, juha.luusua@eltelnetworks.com</p>\n<p>Mika Nousiainen<br/>\nMittauspäällikkö, Helen Sähköverkko Oy<br/>\nPuh. 050 364 1852, mika.nousiainen@helen.fi</p>\n<p><a href=\"https://news.cision.com/fi/eltel-networks/r/helsingin-sahkonjakeluverkon-mittauspalveluiden-kenttatyot-eltelille%2Cc3408622\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://news.cision.com/fi/eltel-networks/r/helsingin-sahkonjakeluverkon-mittauspalveluiden-kenttatyot-eltelille%2Cc3408622</a></p>\n<p><a href=\"https://news.cision.com/fi/eltel-networks/i/eltelin-asentaja-toni-toppari-tyoskentelemassa-mittariasennuksen-parissa%2Cc2950003\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Eltelin asentaja Toni Toppari työskentelemässä mittariasennuksen parissa</a></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Waymaker BIT News - Cision 2021</p></div>"}