{"date": "2021-11-30 21:11:57.879000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>OTONOMO TECHNOLOGIES LTD (\"OTMOW,OTMO-Q\")\n- Collaborates with AWS to leverage AWS IoT FleetWise\n\n   at AWS re:Invent,  Otonomo Technologies Ltd. (Otonomo),, a leading\nmobility intelligence platform provider, today announced its plans for\nbuilding on its Amazon Web Services (AWS) Partner Network (APN) membership\nand existing integration with AWS Connected Mobility Solution by adding\nsupport for AWS IoT FleetWise, a new AWS service launching today.\n\n   \"Today's connected cars are already data centers on wheels, each\ngenerating GBs of data per hour,\" said Mike Tzamaloukas, GM IoT Automotive,\nAWS. \"The collaboration between Otonomo and AWS Kaleidoscope will\naccelerate automakers and their partners capabilities to put this massive\namount of data to use creating new and innovative solutions that will\nadvance the entire mobility industry.\"\n\n   AWS IoT FleetWise's advanced capabilities include the efficient\ncollection and transfer of select automotive data to the cloud in near\nreal-time from any vehicle. These capabilities, combined with AWS IoT\nFleetWise's intelligent filtering capabilities, will make it even easier\nfor Otonomo to process and deliver the massive quantities of vehicle data\nit manages daily into AWS workloads. Otonomo expects the resulting,\nincreased velocity to enable its customers to build the next-generation of\nconnected car applications.\n\n   \"At Otonomo, we're committed to driving smarter decisions and services\nfor our customers through the utilization of connected vehicle data,\" said\nBen Volkow, CEO and Co-Founder, Otonomo. \"Today's Kaleidoscope announcement\nhelps automakers collect and transfer data to the cloud more easily and\nefficiently than ever before. We are thrilled to expand our work leveraging\nAWS and are excited about the additional capabilities made possible through\nKaleidoscope.\"\n\n   For more information about Otonomo's vehicle data platform and\nmarketplace, visit www.otonomo.io.\n\n   About Otonomo\n\n   Otonomo fuels a data ecosystem of OEMs, fleets, and more than 100\nservice providers spanning the transportation, mobility, and automotive\nindustries. Our platform securely ingests more than 4 billion data points\nper day globally from over 40 million vehicles licensed on the platform as\nwell as mobility demand data from multimodal sources, then reshapes and\nenriches it to accelerate time to market for new services that improve the\nmobility and transportation experience. We provide deeper visibility and\nactionable insights to empower strategic data-driven decisions - taking the\nguesswork out of mobility and transportation planning, deployment and\noperations. Privacy by design and neutrality are at the core of our\nplatform, which enables GDPR, CCPA, and other privacy-regulation-compliant\nsolutions using both personal and aggregate data. Use cases include\nemergency services, mapping, traffic management, EV management,\nsubscription-based services, micro-mobility, parking, predictive\nmaintenance, insurance, media, in-vehicle services, and dozens of smart\ncity solutions. Otonomo has an R&amp;D center in Israel and a presence in the\nUnited States and Europe.\n\n   More information is available at otonomo.io\n\n   Otonomo on Social Media\n? Follow Otonomo on LinkedIn\n? Like Otonomo on Facebook\n? Follow Otonomo in Twitter\n\nOtonomo\nJodi Joseph Asiag\nHead of Content and Communications\njodija@otonomo.io\n\n   For investment  inquiries, please contact:\nMS- IR for Otonomo\nMiri Segal\nmsegal@ms-ir.com\n\n   Forward Looking Statements\n\n   This announcement contains certain forward-looking statements within the\nmeaning of the federal securities laws, including statements regarding the\nservices offered by Otonomo, the anticipated technological capability of\nOtonomo, the anticipated benefits of the partnership with AWS, the markets\nin which Otonomo operates and Otonomo's projected future financial and\noperational results. These forward-looking statements generally are\nidentified by the words \"believe,\" \"project,\" \"expect,\" \"anticipate,\"\n\"estimate,\" \"intend,\" \"strategy,\" \"future,\" \"opportunity,\" \"plan,\" \"may,\"\n\"should,\" \"will,\" \"would,\" \"will be,\" \"will continue,\" \"will likely\nresult,\" and similar expressions. Forward-looking statements are\npredictions, projections and other statements about future events that are\nbased on current expectations and assumptions and, as a result, are subject\nto risks and uncertainties. Many factors could cause actual future events\nto differ materially from the forward-looking statements in this\nannouncement, including but not limited to, the ability to implement\nbusiness plans, forecasts, and other expectations, the ability to identify\nand realize additional opportunities, the ability to successfully integrate\nNeura, and potential changes and developments in the highly competitive\ndata marketplace. The foregoing list of factors is not exhaustive. You\nshould carefully consider the foregoing factors and the other risks and\nuncertainties described in Otonomo's final prospectus filed with the SEC on\nNov 3, 2021 and other documents filed by Otonomo from time to time with the\nSEC. These filings identify and address other important risks and\nuncertainties that could cause actual events and results to differ\nmaterially from those contained in the forward-looking statements.\nForward-looking statements speak only as of the date they are made. Readers\nare cautioned not to put undue reliance on forward-looking statements, and\nOtonomo assumes no obligation and does not intend to update or revise these\nforward-looking statements, whether as a result of new information, future\nevents, or otherwise. Otonomo gives no assurance that it will achieve its\nexpectations.\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133300597.MNPRE2133303186-12524820211130</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}