{"date": "2021-06-02 17:34:47.407000+00:00", "ticker": "AAF", "mrkt_info": {"open": 79.1, "close": 79.65}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-abstract\"><p>Airtel Africa on Wednesday said it has sold its tower portfolio, which is part of Airtel Tanzania, for about $175 million (~1,279.6 crore).</p></div><div class=\"tr-npp-lead\"><p>The deal marks the latest strategic divestment of the group\u0092s tower portfolio as it focuses on an asset-light business model and its core subscriber-facing operations, the company said.</p><p>Airtel Africa is a provider of telecommunications and mobile money services with a presence in 14 countries across the continent.</p></div><div class=\"tr-npp-body\"><p>In a statement, Airtel Africa announced \u0093the sale of the tower portfolio belonging to Airtel Tanzania to a joint venture company owned by a wholly-owned subsidiary of SBA Communications Corporation, a global independent owner and operator of wireless communications infrastructure, as majority owner, and Paradigm Infrastructure, a UK company focused on developing, owning and operating shared passive wireless infrastructure.\u0094</p><p>The tower portfolio in Airtel Tanzania comprises about 1,400 towers that form part of the group\u0092s wireless telecommunications infrastructure network.</p><p>According to the terms of the deal, the group\u0092s subsidiary Airtel Tanzania will continue to develop, maintain and operate its equipment on the towers under a separate lease arrangement with the purchaser.</p><p>Airtel said the consideration for the transaction is about $175 million. Of this, approximately $157.5 million is payable on the first closing date (expected to take place in the second half of the group\u0092s current financial year).</p><p>The balance is payable in instalments on the completion of the transfer of any remaining towers to the purchaser, it added.</p><p>\u0093Around $60 million from the proceeds will be used to invest in network and sales infrastructure in Tanzania and for distribution to the government of Tanzania, as per the settlement described in the Airtel Africa IPO prospectus document published in June 2019,\u0094 the statement said.</p><p>Rest of the proceeds will be used to reduce debt at the group level, it added.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}