{"date": "2022-01-07 22:14:09+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3265.08, "close": 3229.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ADVANCE UNITED HOLDINGS INC (\"AUHI-Z;AUHIF-0\")\n- Wall Street Analyzer Reports on Advance United Marketplace\n- and a Unique Approach to the Junior Mining Space\n\n   Advance United Holdings Inc. (the \"Company\", or \"Advance United\") is\npleased to announce Jim Atkinson's, CEO of Advance United, interview with\nthe Wall Street Analyzer.\n\n   The Wall Street Analyzer's staff of writers, analysts, publishers,\nproducers, market researchers, and PR professionals aim to provide\ninvestors with the tools they need to make informed decisions on buying\nstock. Their staff is a mix of financial professionals and media savvy\nindividuals whose experiences bring the best talent from both ends of the\nspectrum.\n\n   Juan Costello, Senior Analyst with the Wall Street Analyzer, interview\nwith Advance United's CEO Jim Atkinson highlights follow below and the\noriginal audio interview and abridged transcript can be found here.\n\n   Juan: Jim please start off with an overview of the company for our\nlisteners.\n\n   Jim: Sure, let me give you a quick rundown. We were listed on the CSE in\nMay 2021 so we are a relatively new company. The company was formed by the\nmerger of two existing private companies, one of which was originally\ncalled Talisker Gold and had properties and we merged with a company that\nwas set up specifically for the public merger and that happened on May\n28th. Since then, we've been working to advance the company, as our name\nindicates, and we have recently completed some financings, which gives us a\nvery healthy treasury. We completed a $2.15 million flow-through financing\nwhich will allow us to explore the Canadian properties, and we added\n$300,000 of equity financing to our balance sheet which will allow us to go\nahead with our marketing and other corporate plans.\n\n   Juan: Can you bring us up to speed there on some of the most recent news\nas you just launched your Advance United Marketplace? And your private\nplacement.\n\n   Jim: The most exciting thing, as far as I'm concerned, is our recent\nlaunch of what we call our property Marketplace. To give you a little bit\nof background on this, we consider the value of our company to be X + Y +\nZ, which equals the value. \"X\" is our existing properties portfolio. \"Y\" is\nthe properties that we have in our pipeline / headlights, these are\nproperties that we believe we can acquire that increase our core portfolio\nand enhance the asset value of the company. And \"Z\" is what we're most\nexcited about and that is our digital marketplace. This is a different\napproach to the junior mining space, and this is why we are a unique junior\ncompany that has tremendous potential. To give you a quick explanation of\nour marketplace and what it is, it is a way for persons and/or companies\nthat have existing properties and projects that have been perhaps known for\nquite a while, but they haven't been worked on for a long time. Perhaps the\nlast time they were worked on was when gold was trading at $300 or $400 an\nounce and the project was not economically viable at that time, but the\nproperties may have had a significant amount of historic work done on them.\nThey have data that needs to be updated. So, we see our marketplace as a\nplace for these companies, these people, and all these projects to be\nbrought forward. Our job is to evaluate these projects based on the\ncriteria which exist on our Marketplace and decide what can be done on the\nproperty. In other words, perhaps it's a modern kind of technology, perhaps\neven AI or digital applications to the data that exists that will enhance\nthe value of that property and make it worth a lot more. On the other side\nof this of course is that we have some indication of what production\ncompanies are looking for. So, we see ourselves as almost a broker between\nthe people that have projects and the people that want these projects. We\narbitrage that middle value. That's what we think makes us unique because\nwe're looking to generate a revenue stream from this work and we see\nourselves as being equivalent to say, an Amazon or Uber Marketplace. Uber's\nthe largest taxi company in the world, yet they don't own any cars. They\nbroker the relationship between the buyers and sellers, and that's where we\nsee ourselves in our Marketplace. We've have had a fair amount of feedback\nalready from people in the industry when we issued our press release\nlaunching the beta version, and we've had people that have expressed an\ninterest in this, saying this is something that has not existed in the\njunior mining space, or in the mining space at all for that matter. This is\nsomething that is going to be very useful for the market and for ourselves.\nSo that's just a quick rundown of who we are and where we are at.\n\n   Juan: Great. What are the main goals and milestones here over the first\nhalf of 2022 that investors should keep an eye out for?\n\n   Jim: Well, I think our main goal, and this is something that we're\nactively working on right now, is to bolster our board of directors by\nadding people who have experience in the digital technology industries. We\nare currently interviewing for a Chief Technical Officer and a Chief\nFinancial Officer with experience in the digital space. We have a very\nstrong board already which has a lot of experience in the mining,\nexploration, and financing side of junior exploration companies. But what\nwe're trying to upgrade is our expertise on the technology and digital\nside, and that's going to be one of our next major steps. The next major\nstep after that of course, is the finalization of the next version of our\nMarketplace which is expected in the first quarter of 2022 once we've had\nfeedback and input on the existing tech. Launching our advertising and\nmarketing is another next big step. We will be making a big marketing push\nfor the company to talk about our ideas and the digital marketplace. As an\naside, I'll mentioned that our marketing approach is going to be very\ndifferent than a junior exploration company which talks about drill holes.\nWe're going to be talking about the vision for the mining market and a\ndifferent kind of junior exploration company. We like to say to people we\ndon't want to be miners. We don't want to be the people that do the mining\nbecause that's a very different type of expertise. We want to be the\ncompany that brings projects and the story to the attention to the\ncompanies that do have the expertise in mining and want to become involved\nwith the project.\n\n   Juan: Certainly. So, your strategic alliances and joint ventures, what\nare some of the key synergies that you look for?\n\n   Jim: I think one of the things that we're going to do which is not done\nvery often in the junior mining space is really understanding what it is\nthat production companies want. For instance, what is it that a company\nlike Barrick, Newmont or Kinross, what is it that they want, and we're\ngoing to try to be in some respects their \"eyes and ears\" on the ground.\nThey do not have enough people to evaluate everything that's out there. So\nwe're going to try to be able to help them with that by understanding what\nthey want, and also understanding what's available and to put the two\ntogether. That's the goal of our Marketplace, our digital platform.\n\n   Juan: What do you feel are the main factors that make Advance United\nunique from some of the other players in the sector that are unable to\ncapitalize on some of the trends in the sector?\n\n   Jim: I think one of the things that makes us different, as I've said\nbefore, is we don't want to be a typical junior mining company. We\ncertainly have properties that will require some work, and we certainly\nwill acquire properties that will require some work, but our goal is not to\never be a miner. Our goal is actually to increase their value and add value\nto the company bottom line so that the share price escalates, and our\nshareholders make out well. That's really our thing. And as I have told\nmany people, the biggest failure that a lot of junior mining companies get\ninto is they get to the point where they think they can be miners, and\nwe've seen this recently with a couple of companies and we see it quite\noften in the space. We don't want to be that and you'll see that all of our\nmarketing says that - we're the company that doesn't want to touch the\ngold. We want to be the Uber of the junior mining space where we don't own\ncars, we don't own mines. We simply put together people with projects, and\npeople who need projects. Like Uber and Amazon. That's our goal.\n\n   Readers can listen to the original audio interview and read the entire\nabridged transcript interview here.\n\n   About Advance United\nAdvance United, headquartered in Toronto, Canada, is traded on the Canadian\nSecurities Exchange in Canada under the symbol \"AUHI\" and the Borse\nFrankfurt Stock Exchange in Germany under the symbol \"9I0\".\n\n   We are a different kind of Canadian junior mining company, one designed\nto succeed where other junior mining companies fail. We are involved\nexclusively in the acquisition and advancement of past projects - with no\nintent to bring them back into production or to mine them ourselves. Our\nexpertise is in identifying and acquiring undervalued properties with\nsignificant historical work, which were uneconomic at the time, but we\nbelieve have economic value at today's prices.\n\n   We fund the development of re-working historic data and applying modern\ntechnology to underwrite new qualified reports, document quantifiable\nresources and reserves to current standards, thereby recognizing the\ncurrent value.\n\n   Our purpose is to bring immediate and long-term value to our partners\nand shareholders while seeking to eliminate exploration risk, so that we\ncan all advance united in the shortest possible time frame.\n\n   For additional information about us, our projects, or to find out how\nyou can get involved please visit www.advanceunited.ca.\n\n   Contact Information\nJames Atkinson, P. Geo., CEO\nEmail: jim.atkinson@advanceunited.ca\nTel: (647) 278-7502\n\n   Forward-Looking Information and Cautionary Statements\nThe listing of the Company's common shares on the OTCQB remains subject to\nthe approval of the OTCQB and the satisfaction of applicable listing\nrequirements. There is no assurance as to when and/or if the application to\nOTCQB will be accepted and that the Company will be eligible for public\nquotations pursuant to Rule 15c2-11 or any other applicable regulation.\n\n   This news release may contain \"forward-looking information\" within the\nmeaning of applicable securities laws relating to the trading of the\nCompany's securities and the focus of the Company's business. Any such\nforward-looking statements may be identified by words such as \"expects\",\n\"anticipates\", \"intends\", \"contemplates\", \"believes\", \"projects\", \"plans\"\nand similar expressions. Forward-looking statements in this news release\ninclude statements regarding the Company's ability to increase the value of\nits current and future mineral exploration properties and, in connection\ntherewith, any long-term shareholder value, the Company's ability to\nmitigate or eliminate exploration risk, and the Company's intention to\ndevelop a portfolio of historic gold properties. Readers are cautioned not\nto place undue reliance on forward-looking statements. These statements\nshould not be read as guarantees of future performance or results. Such\nstatements involve known and unknown risks, uncertainties, and other\nfactors that may cause actual results, performance, or achievements to be\nmaterially different from those implied by such statements. Although such\nstatements are based on management's reasonable assumptions, there can be\nno assurance that the Company will continue its business as described\nabove. Readers are encouraged to refer to the Company's annual and\nquarterly management's discussion and analysis and other periodic filings\nmade by the Company with the Canadian securities regulatory authorities\nunder the Company's profile on SEDAR at www.sedar.com. The Company assumes\nno responsibility to update or revise forward-looking information to\nreflect new events or circumstances or actual results unless required by\napplicable law.\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200600306.MNPRE2200601325-14115720220107</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}