{"date": "2022-02-07 11:00:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Julia Love and Helen Coster</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Feb 7 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>With just weeks to go before an expected launch, Donald Trump’s new media venture is trying to strike a delicate balance with its app: giving Trump's base the freedom to express themselves, without running afoul of Apple and Google’s app store policies.</p><p>The launch of <a href=\"https://www.reuters.com/world/us/former-us-president-donald-trump-launches-new-social-media-platform-2021-10-21\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Truth Social</a> comes a year after the former U.S. president <a href=\"https://www.reuters.com/world/us/facebook-suspends-former-us-president-trumps-account-two-years-2021-06-04\" data-type=\"url\" class=\"tr-link\" translate=\"no\">was banned from Facebook</a>, Twitter and YouTube. It will be a major test of whether Trump Media &amp; Technology Group (TMTG) and other tech companies that describe themselves as champions of free speech can scale alongside the Silicon Valley gatekeepers that conservatives have accused of squelching free expression.</p><p>TMTG has pledged to deliver an “engaging and censorship-free experience” on its Truth Social app, appealing to a base that feels its views around such hot-button topics in American life as vaccines and the outcome of the 2020 presidential election have been scrubbed from mainstream tech platforms. </p><p>Yet Trump’s tech team must erect guard rails to ensure Truth Social does not get kicked out of the app stores run by Apple Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a> and Alphabet Inc's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a> Google - a fate that befell popular conservative app Parler in the wake of the <a href=\"https://www.reuters.com/world/us/democracy-under-siege-an-hour-by-hour-look-assault-us-capitol-2022-01-04\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Jan. 6, 2021, riots</a> in the U.S. Capitol. Without these stores, there is no easy way for most smartphone users to download the app.</p><p>The risk of such “de-platforming” is a top priority for TMTG Chief Executive Devin Nunes, a former Republican congressman, as his team builds the app, according to two people with knowledge of the matter. Recognizing that the app will be a major target for hackers from day one, Nunes wants to have cyber talent at the “nation-state level,” one of the people said. Nunes has said publicly that the company’s goal is to launch its Truth Social app by the end of March. </p><p>A spokesperson for TMTG did not respond to a request for comment.</p><p>TMTG remains shrouded in secrecy and is regarded with skepticism by some in tech and media circles. Two conservative media executives pointed to the venture’s apparent failure to launch a beta service in November, as planned, and cited the lack of known involvement by high-profile media, tech or political players - other than Nunes - as evidence it may be more bluster than substance. </p><p>“No one has approached me or my team,” said one conservative media insider. “Trump has always been a bit of (his) own island.”</p><p><br/></p><p>CONTENT MODERATION</p><p>TMTG’s mission of standing up to Big Tech is limited by its reliance on Google and Apple, which operate app stores that dominate the smartphone market. TMTG is working with Hive, a San Francisco-based company that does AI-based content moderation, to flag sexually explicit content, hate speech, bullying and violent content. That partnership is driven in part by TMTG’s desire for the Truth Social app to remain in the Apple App and Google Play stores, according to a person familiar with the venture. </p><p>Truth Social will need robust content moderation in the form of both automated detection and in-person teams, as well as a way for users to report offensive posts, said David Thiel, the big data architect and chief technology officer of the Stanford Internet Observatory. </p><p>“Where it is going to become difficult is if they get into a situation like with Parler, where they have such a degree of hate speech that the hosting service and potentially the App Store starts to take notice,” he said.</p><p>The Truth Social app will be subject to Apple's App Store rules that require developers to offer a way for users to report offensive content and provide \"timely responses.\" The rules also bar content that \"encourages violence\" or \"depictions that encourage illegal or reckless use of weapons and dangerous objects.\"    </p><p>As of Feb. 4, TMTG had 12 job openings listed on the company website, for technical roles such as a developer to be part of the Android team and an iOS engineer. Salaries range from $80,000 to $220,000, according to the postings, which beckon candidates to work for a “well-funded,” “remote-first” and “conservative-leaning” startup. A requirement for the iOS engineer role is “knowledge of Apple’s Human Interface Guidelines and App Store Review Guidelines (which are more like rules).” One posting describes the ideal candidate as someone who “enjoy(s) companies that are scrappy and able to do more with less.”</p><p>Among other positions, the company is seeking to hire at least one developer with experience with Elixir, a back-end programming language, according to a job posting. </p><p>In a Jan. 13 interview with radio host Ray Appleton, Nunes said the Palm Beach, Florida-based company will be looking for a more “permanent” location – favoring states like Florida, Tennessee and Texas over Silicon Valley. In the company’s early months, some tech talent has been working in the Atlanta area, according to two people with knowledge of the matter.</p><p><br/></p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Julia Love in San Francisco and Helen Coster in New York<br/>Editing by Kenneth Li and Matthew Lewis)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:helen.coster@thomsonreuters.com\" data-type=\"email\" translate=\"no\">helen.coster@thomsonreuters.com</a> ; Twitter: <a href=\"https://twitter.com/hcoster\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/hcoster</a>) )</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-TRUMP/SOCIAL MEDIA (ANALYSIS, PIX)</p></div>"}