{"date": "2021-11-10 03:48:20.478000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>NEW DELHI</p></div><div class=\"tr-npp-lead\"><p>NEW DELHI, Nov. 10 -- Amazon Pay India has announced the launch of its most recent digital campaign this week. The company said its campaign 'Ab Har Din Hua Aasan' will highlight the convenience of digital payments on the platform and its positive impact on customers in India.</p><p>The campaign demonstrates the evolution of money and various business activities, from cash to digital, across generations. It shows how their payment tools can be used to pay anyone. The campaign, which has aired on social media, features people shopping in marketplaces or online, recharging their phones and paying utility bills etc., and narrates how Amazon Pay has enabled small business owners such as street vendors to start accepting digital payments.</p></div><div class=\"tr-npp-body\"><p>Mahendra Nerurkar, CEO and VP, Amazon Pay India said over the last few years, digital payments have become an integral part of people's lives. \"Through this campaign, we have captured various perspectives and stories that further strengthen the sense of trust around digital payments and drive adoption,\" he said.</p><p>This week, Amazon Pay (India) Private Limited reported revenues of Rs.1,769 crore for the financial year 2020-21, a 29% jump since the last financial year. The company reported a net loss of Rs.1,516 crore during the same fiscal, a 19% decrease from the last financial year. The company's total expenses for the fiscal stood at Rs.3,285 crore, it said in its Ministry of Corporate Affairs filing accessed via business intelligence platform Tofler.</p><p>Amazon Pay also announced that it has raised Rs.1000 crore from its investors Amazon Corporate Holdings Private Limited, Singapore and Amazon.com Inc Limited, Mauritius. The significant share of this investment came from Amazon Singapore at Rs.999 crores. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}