{"date": "2022-01-09 21:47:33.721000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Jan. 8 -- Amazon has announced Mobile and TV Savings Days bringing together a host of deals and offers on a range of the latest Smart TVs, smartphones and accessories. Customers can enjoy up to 10 per cent instant discount on their favourite brands including OnePlus, Xiaomi, Samsung, OPPO, Tecno, Vivo and Realme amongst other. The latest Tecno Spark 8T, Tecno Spark 8 Pro, OnePlus Nord CE, OnePlus Nord 2, Samsung S20 FE 5G, Mi 11X, Xiaomi 11 Lite NE 5G, Redmi Note 10S, Redmi Note 10 Lite, Oppo F19 Pro+, Vivo V21 are amongst other smartphones than will see great offer. Mobile and TV Saving Days will be live until January 10, 2022.</p><p>Customers can enjoy 10 per cent instant discount up to Rs.1,000 using Citi Bank Credit and Debit cards and Rs.1,250 on Citi Bank Credit Card EMI transactions. They can also avail exciting exchange offers and convenient No-Cost EMI for up to 12 months on their favourite smartphones.</p></div><div class=\"tr-npp-body\"><p>Prime Members can avail savings of up to Rs.20,000 with Advantage Just for Prime, which includes benefits like 6-month free screen replacement and additional 3 month No Cost EMI on HDFC Bank Debit and Credit Cards.</p><p>Customers can also get flagship phones at the lowest prices with Premium Phones Party Event which will be live until 12 January. Get up to 40 per cent on flagship smartphones and extra up to Rs.5,000 off with Amazon coupons.</p><p>Here are some of the latest smartphones and smart TVs:</p><p>Xiaomi Smartphones and TVs</p><p>The Flagship Mi 11X will be available for Rs.23,499 including discounts, cash back and exchange. The newly launched Xiaomi 11 Lite NE 5G will be available for Rs.19,999. The Redmi 9A will be available for Rs.7,199 including 10 per cent instant discount. The Redmi TV 32 inches HD ready TV will be available starting at Rs.14,999. The Redmi TV 50 inch with an MRP of Rs.44,999 will be available for Rs.37,999. Mi 40 inch Horizon FHD TV will available starting Rs.24,999 with Rs.6,000 savings.</p><p>Samsung Smartphones and TVs</p><p>Samsung Galaxy S20 FE 5G will be available for Rs.39,990 (46% off) get additional 10% instant discount and get it for Rs.38,740. The recently launched Samsung Galaxy M52 5G will be available for Rs.24,999 including discounts and Rs.5,000 off with coupons. The Samsung 43 inch Crystal 4K Pro UHD TV will be available starting Rs.37,990.</p><p>OnePlus Smartphones and TVs</p><p>The OnePlus 9R will be available for Rs.33,999, OnePlus 9 at Rs.36,999 and OnePlus 9 Pro at Rs.54,999 including Bank discounts, coupons and exchange offer. OnePlus Nord CE and OnePlus Nord 2 will be available for Rs.23,499 and Rs.27,999 including discounts with Amazon coupons. OnePlus TVs will be available starting Rs.17,999.</p><p>iQOO</p><p>Customers can avail the iQOO Z5 for Rs.21,990 and the iQOO 7 for Rs.27,990 including discounts with Amazon coupons worth Rs.2,000.</p><p>Tecno</p><p>The newly launched Tecno Spark 8T and Tecno Spark 8 Pro for Rs.8,550 and Rs.9,540 including 10% instant discount with Citi bank cards.</p><p>Smart TV Offers</p><p>Get 40% off on Amazon Basics 50-inch 4K TV starting at Rs.32,999. Get 30% off on Premium Sony 50-inch 4K UHD Google TV will be available for as low as Rs.77,990. Up to 48% off on iFFALCON 43 inches 4K UHD TV. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}