{"date": "2021-12-21 14:17:45+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n        United States - December 21, 2021, 09:00 AM\n      </div>\n                <p>\n                  <strong>\n                    <span>Initiative can help Infor's automotive industry customers address their core challenges, adapt to disruption and provide a platform for future growth</span>\n                  </strong>\n                </p>\n                <p>\n                  <strong>NEW YORK -</strong>\n                  <strong>Dec. 21,</strong>\n                  <strong>2021</strong>\n                  <strong>-</strong> Infor, the industry cloud company, today announced support for an Amazon Web Services (AWS) initiative, <a href=\"https://aws.amazon.com/automotive/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS for Automotive</a>, to help Infor's automotive industry customers address their core challenges - such as building more agile and resilient supply chains, attracting and retaining top talent, thriving amid massive industry disruption, and advancing safety and sustainability initiatives - as well as establish a platform for future growth. This collaboration underscores Infor's commitment to the automotive industry and to providing its customers with a trusted cloud offering through AWS.\n      </p>\n                <p>\n        AWS for Automotive is an initiative featuring services and solutions from AWS and its partners, built specifically for automotive customers. The initiative is designed to make it easier for automotive customers to select the right tools and partners for their highest-priority workloads across the automotive landscape, in everything from software-defined vehicles and connected mobility to manufacturing and supply chain. For customers looking to accelerate deployments with solution-specific support, AWS for Automotive also identifies dedicated AWS automotive industry specialists, AWS Professional Services teams, and leading AWS partners in each of the solution areas.\n      </p>\n                <p>\n        Infor has more than 20 years of experience working with some of the best-known global auto companies. <a href=\"https://www.infor.com/industries/automotive\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Infor CloudSuite Automotive</a> was a leader in the development of an automotive industry-specific, fully-functional cloud-based solution. It features integrated financials tailored to specific parameters of the industry, including original equipment manufacturers (OEMs), tiered suppliers, and specialty vehicle manufacturers. Infor's innovative cloud technologies are designed to work with AWS to help give organizations the power and responsiveness to stay ahead in competitive business environments.\n      </p>\n                <p>\n        \"AWS and Infor are equally committed to putting our customers at the center of the automotive experience,\" said Scott Kamieneski, Infor general manager, automotive industries. \"A continuous stream of disruption has led to recent shifts in the marketplace that have increased the demands on the entire industry, from OEMs down through suppliers. They must adopt digital strategies faster, with more agility and visibility into data-driven insights. Working with AWS, Infor strives to provide superior industry-focused automotive solutions that help drive productivity and better outcomes.\"\n      </p>\n                <p>\n        Designed specifically for the automotive industry, Infor's CloudSuite Automotive, and enterprise application platform <a href=\"https://www.infor.com/technology\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Infor OS</a> are built on infrastructure services from AWS to deliver industry-specific capabilities without extensive customizations or integrations. With Infor CloudSuite Automotive, businesses can experience automatic upgrades that deliver the latest Infor advances in enterprise functionality. Infor CloudSuite Automotive is designed to help automotive companies meet customer demands, maintain employee productivity, and deliver innovative products to market ahead of the competition.\n      </p>\n                <p>\n                  <strong>About Infor</strong>\n                </p>\n                <p>\n        Infor is a global leader in business cloud software specialized by industry. Providing mission-critical enterprise applications to 65,000 customers in more than 175 countries, Infor software is designed to deliver more value and less risk, with more sustainable operational advantages. We empower our 17,000 employees to leverage their deep industry expertise and use data-driven insights to create, learn and adapt quickly to solve emerging business and industry challenges. Infor is committed to providing our customers with modern tools to transform their business and accelerate their own path to innovation. To learn more, please visit <a href=\"http://www.infor.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.infor.com</a>.\n      </p>\n                <p>\n        # # #\n      </p>\n                <p>\n                  <strong>For more information:<br/></strong> Scott Matulis<br/>\n         Infor<br/>\n         Scott.matulis@infor.com<br/>\n         818.451.8918\n      </p>\n                <p>\n                  <span>Copyright ©2021 Infor. All rights reserved. The word and design marks set forth herein are trademarks and/or registered trademarks of Infor and/or related affiliates and subsidiaries. All other trademarks listed herein are the property of their respective owners</span>\n                  <span>.</span>\n                  <span>\n                    <a href=\"http://www.infor.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.infor.com</a>\n                  </span>\n                </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.infor.com/news/infor-aws-for-automotive-initiative\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Infor Inc.</strong> published this content on <strong>21 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>21 December 2021 14:17:45 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Infor Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Infor-Inc.</p></div>"}