{"date": "2021-12-16 17:49:20.769000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3466.3, "close": 3400.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SATORI RESOURCES INC (\"BUD-V;STRRF-0\")\n- Predicts Big Changes for Modern Data Operations in 2022\n\n     Satori, the category creator behind DataSecOps, shared its predictions\nfor the near future of cloud-based transformation, detailing three major\ndevelopments to watch for in the world of data governance and operational\nsecurity over the course of 2022.\n\n     As cloud adoption accelerates in all industries and business\nintelligence &amp; analytics go from cutting-edge luxuries to bottom-line\nnecessities, many companies are finding themselves at a crossroads. With\nmore data being moved to the cloud, new opportunities arise, as data can be\neasily connected with various cloud-based services, including BI, analytics\nand AI, ultimately delivering richer insights for data scientists, analysts\nand business users. On the other hand, moving sensitive data such as\npersonally identifiable information (PII), personal health information\n(PHI) and financial data to the cloud increases the risk of a data breach.\nIt's in this context that chief data officers (CDOs), data platform owners\nand other data professionals are thinking through big decisions and bracing\nfor major change in the year ahead.\n\n     \"To stay competitive in today's data-driven economy, businesses are\npouring more and more capital into making their data analytics operations\nsmarter, faster and more agile than their competitors', and moving data to\nthe cloud is part of that strategy,\" said Eldad Chai, co-founder and CEO of\nSatori. \"But, in doing so, many overlook the most essential ingredients for\ndata operations at scale -- security and governance. Too often, business\nleaders make the mistake of viewing data governance as a constraint and\npolicies as barriers to insight and innovation. In reality, security\ndoesn't have to slow you down. In fact, with the right tools and\noperational framework, governance holds the secret to supercharging growth\nby facilitating data democratization. This holds especially true when\naccompanied by cloud-based transformation, which allows business analysts\nand data scientists to get access to the data they need in minutes, rather\nthan days. Data engineers and platform owners can streamline secure access\nto sensitive PII, PHI or financial data to eliminate manual processing and\nerrors.\"\n\n     The Rise of Mesh Architecture Will Make \"DataSecOps\" a New Business\nStandard\nIn a recent survey of C-Suite executives, researchers found that although\n99% of businesses were actively investing significant sums into Big Data\ninitiatives, only 24% of respondents felt they'd created a data-driven\norganization and/or culture. So, despite countless calls for data\ndemocratization over the past year and a half, and no scarcity of funding,\nit would appear that at least 75% of businesses have yet to make the dream\nof democratization a reality. However, there is hope. Thanks to recent\nadvances in AI, and the introduction of the data mesh architecture, a\nsolution is just over the horizon. With its focus on decentralization and\nempowering the data consumer, data mesh is an obvious candidate for the\nframework supporting democratization. However, for the data mesh to\nfunction without the degradation of data security, organizations will have\nto put the principles and processes of DataSecOps into practice. DataSecOps\nseeks to make security a continuous part of the data operations process,\nrather than an afterthought. And in a mesh model, where more teams and more\nstakeholders are engaging with data, the understanding of the importance of\ndata security should be shared by virtually every member of the\norganization. Its implementation will require organizations to adopt a\ncollaborative framework, in which security is not only an issue for\nsecurity teams alone, but a concern for everyone. In 2022, this streamlined\nDataSecOps solution, integrated with an intelligent data mesh architecture,\nwill allow data democratization to be implemented at scale.\n\n     Over-Privileged Employees at Unicorns Access Sensitive Data Leading to\nMore Data Breaches and Exposures\nRapid cloud-based adoption and disruptive business models have led Unicorns\nto experience unprecedented growth in revenue and customer acquisition -\nespecially within the fields of Fintech, Healthtech and internet services.\nData operations have scaled up to meet demand, however, data security\nhasn't kept pace. A prime example of this is the data breach at Robinhood,\nin which an unknown third party used social engineering to glean\ninformation from a customer service representative over the phone. The\nbad-faith actor was able to gain access to sensitive customer support data,\nultimately affecting over five million customers. Clearly, the customer\nsupport employee was over-privileged, meaning they had access to more data\nthan was necessary for them to do their job effectively. Startups,\nespecially those experiencing rapid growth, such as Robinhood, often start\noff with trust-based data access policies, where employees are given broad\naccess to data, which initially fuels faster decision making. Moving\nforward, these startups will have to adopt more rigorous processes and\ntools for implementing data security as a core part of their data\noperations. Doing so, they will ensure that employees have access only to\nthe data they need to do their jobs, while limiting and tracking access to\nsensitive data to minimize the risk of data breaches.\n\n     More Sensitive Personal Data Will Migrate to the Cloud for BI, ML and\nAnalytics Workloads\nAnalytics and AI leaders are looking to build and deploy next-generation\nsolutions by leveraging cloud-based services in combination with sensitive\npersonal data. The trend is being driven by cloud-based analytics and AI\nplatforms, in combination with data stores such as Snowflake, Amazon\nRedshift, Google BigQuery, Databricks and Microsoft Azure Synapse. And\nadoption is accelerating across organizations of all sizes. This poses an\nimportant question - \"Is sensitive personal data secure in my cloud-based\ndata warehouse, data mart, analytics or machine learning solution of\nchoice?\" Analytics, AI and machine learning leaders must figure out how to\nnavigate and answer this question with confidence and to the satisfaction\nof information security, privacy and compliance teams. With the help of\nprocess improvements and new data access tools such as DataSecOps,\nsensitive data will be managed in the cloud securely -- powering BI,\nAnalytics and machine learning projects for faster insights.\n\n     Attackers Target Data via Analytics and AI Service Providers\nHardly a week goes by without some high-profile data breach jeopardizing\nthe security of user data. Data breaches aren't going to disappear anytime\nsoon. But we will see more data breaches target third parties - Data,\nAnalytics, AI and Machine Learning services providers who are entrusted\nwith massive amounts of sensitive data with PII, PHI and financial\ninformation. The massive misuse involving personal data of over 87 million\nFacebook users by the third-party analytics provider, Cambridge Analytica,\nin 2018 is a prime example of this type of risk. Organizations of all sizes\nare leveraging cloud-based services for data, analytics, AI and machine\nlearning. This trend drives innovation, but can lead to misuse of sensitive\ndata, especially if the service provider has ad-hoc processes and tools for\nhandling the security and privacy of said data. In order to scale up for\nexplosive growth responsibly, data, analytics, AI and machine learning\nservice providers will need data governance platforms intelligent and\nrobust enough to mitigate data consumers' occasional lapses in judgment.\nAll it takes is a blip of frustration, impatience, or worry for an employee\nto skip, overlook, or forget a practice or policy that leaves sensitive\ndata exposed. An intelligent policy platform, on the other hand, never\nwaivers in its vigilance. In 2022, those with the necessary security\nmeasures will make headway against the competition, while those without\nthem will make headlines.\n\n     No matter what comes our way in 2022, there's one thing we can be\ncertain of -- DataOps will undergo some significant changes. With so much\nupheaval taking place in 2021, it's all but inevitable that organizations\nwill be making changes to their operations. Whether it be democratization\nby way of intelligent data mesh, or the implementation of an intelligent\ndata platform to safeguard against exposure, CDOs will be taking action in\n2022. And those that don't will surely be left behind.\n\n     About Satori\nSatori is the developer of the first DataSecOps platform -- a universal\ndata access platform for cloud-based data stores and infrastructure,\ntouting multiple out-of-the-box integrations with industry's leading data\nstores, such as Snowflake, Amazon Redshift, Amazon Athena, Amazon Aurora,\nand Azure SQL. The solution does not require any changes to organizations'\ndata infrastructure or user setup, empowering data teams to apply\ncomprehensive controls across data stores in days instead of months.\nFounded by former Imperva and Incapsula executives in 2019, Satori has\nreceived significant market traction, including recognition as a Top 10\nFinalist at the 2021 RSA Conference Innovation Sandbox Contest. Satori's\ninvestors include B Capital Group, Evolution Equity Partners, and YL\nVentures. For more: <a href=\"https://satoricyber.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://satoricyber.com</a>/.\n\n Contact Information:\n\nContact:Dana Zemack\nScratch Marketing + Media for Satori\ndana@scratchmm.com\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134900420.MNPRE2134902257-08134920211216</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}