{"date": "2021-11-23 12:10:03.996000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_kbt7se6j&amp;referenceId=tag:reuters.com,2021:newsml_OVF4OR6A3_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_kbt7se6j&amp;referenceId=tag:reuters.com,2021:newsml_OVF4OR6A3_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: The S&amp;P 500 ended lower on Monday after President Joe Biden picked Federal Reserve Chair Jerome Powell to lead the central bank for a second term, while Wall Street lenders rallied on the prospect of interest rate hikes in 2022. Fred Katayama reports.<br/>Short Link: <a href=\"https://refini.tv/3HK6FZ8\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3HK6FZ8</a><br/><br/>Video Transcript:<br/><br/>Stocks on Wall Street ended mostly lower Monday after initially cheering President Joe Biden's nomination of Federal Reserve Chair Jerome Powell for a second term. Rising Treasury yields fueled a rally in big bank stocks, but that couldn't offset the sharp drop in rate-sensitive tech titans like Amazon and Microsoft. Hilary Kramer, Investment Research President Hilary Kramer, says Powell will face a huge challenge.<br/><br/>Jerome Powell will have to raise interest rates and he's going to have to do it sooner rather than later. Jerome Powell, our Fed Chairman, had this 2% target for inflation, but now we're seeing the highest level in inflation, over 6% in 50 years. Inflation is runaway.<br/><br/>The Dow finished just above the breakeven line. The S&amp;P edged a 0.33% lower, while the NASDAQ sank 1.25%. Apple bucked the Big Tech losses, rising for the seventh straight session. JPMorgan said its supplies of the iPhone 13 may be improving just ahead of an expected spike in demand. After Apple, the second biggest mover on the S&amp;P was Tesla, thanks to yet another tweet from Elon Musk. The electric vehicle maker's CEO said the Model S Plaid will probably be coming to China around March. That sedan boasting a range of 520 miles can reach top speeds of up to 200 miles an hour. Shares of Rivian Automotive dropped. Investors soured on the stock after the electric vehicle startup and Ford Motor dropped plans to jointly develop an electric vehicle. Shares of Ford, which owns about 12% of Rivian, jumped.<br/></span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}