{"date": "2022-02-04 00:09:38+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3012.25, "close": 3152.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The author is a Reuters Breakingviews columnist.  The opinions expressed are his own. Refiles to fix pronoun in final paragraph.</p><p class=\"tr-by\">By Robert Cyran</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW YORK, Feb 3 (Reuters Breakingviews)</span><span class=\"tr-dl-sep\"> - </span>Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> is an atypical technology giant. Like peers, the $1.4 trillion online retailer dominates markets and has businesses that are growing rapidly. Yet Amazon has a workforce 10 times the size of Microsoft <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MSFT.O\" data-type=\"ric\" data-ric=\"MSFT.O\" translate=\"no\" dir=\"ltr\">MSFT.O</a>, Apple <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a>, or Google parent Alphabet <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a> as well as a vast network of costly delivery infrastructure. These leave it uniquely vulnerable to inflationary pressures, only its <a href=\"https://s2.q4cdn.com/299287126/files/doc_financials/2021/q4/business_and_financial_update.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">valuation</a> doesn’t reflect the risk. </p><p>The company run by Andy Jassy has some businesses that are mostly immune to rising costs. In its earnings released on Thursday, the company showed its Web Services division shook off competition <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2UC2G2\" data-type=\"storyId\" data-story-id=\"nL4N2UC2G2\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> from Microsoft, Google and others in the last quarter, with revenue of $18 billion, a 40% increase from the same period last year. And Amazon’s advertising platform <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2RO2TM\" data-type=\"storyId\" data-story-id=\"nL1N2RO2TM\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> grew 32% to $9.7 billion. </p><p>Yet fulfilling and shipping orders that come through its online retailing website need gigantic numbers of workers, and the company’s expansion has required enormous amounts of capital. Lockdowns sent these demands into hyperdrive. Amazon now has 1.6 million workers, about twice as many as at <span class=\"tr-strong\">the</span> pandemic’s start. It has resorted to offering enticements like higher starting pay. Jassy said higher labor costs driven by shortages and inflationary pressures affected results and are continuing. </p><p>Expanding the company’s warehouses and vehicle fleet has also been costly. Capital expenditures since the start of 2020 has been about $100 billion, twice as much as any of its big tech rivals. This binge, along with inflation in construction costs means it’s been getting less bang for its buck. In 2017, Amazon pulled in over $4 of revenue for each dollar of property, plant and equipment held on its books. That was down to about $2.50 last year.</p><p>Investors for now seem to be overlooking these challenges. The company’s stock was up 17% in after-hours trading. That more than made up for an 8% fall earlier in the day, after ping-ponging with some other technology stocks. But Amazon was already valued at 17 times estimated EBITDA over the next year, according to Refinitiv, about 15% higher than Alphabet. </p><p>The increased cost pressures on the retailing business come on top of growth that is lagging peers. As pricing puts on the squeeze, investors will come to regret complacency. And Jassy might find himself in the hot seat<span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2S932V\" data-type=\"storyId\" data-story-id=\"nL1N2S932V\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> to make more transformative changes. </p><p>Follow <a href=\"https://twitter.com/rob_cyran\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@rob_cyran</a> on Twitter</p><p>         </p><p>CONTEXT NEWS </p><p>-  Amazon.com reported on Feb. 3 revenue of $137.4 billion for the fourth quarter, an increase of 9% from the same period last year. Operating income for the quarter was $3.5 billion, a 50% drop compared to the same period a year ago. The company’s operating cash flow decreased 30% to $46.3 billion in the company’s trailing 12 months.</p><p>- The $1.5 trillion technology giant’s Chief Executive Andy Jassy noted in the company’s earnings statement that the company had “labor supply shortages and inflationary pressures” over the holidays that have persisted into the first quarter.</p><p><br/></p><p class=\"tr-signoff\"> (Editing by Lauren Silva Laughlin, Pranav Kiran and Sharon Lam)</p><p class=\"tr-contactinfo\">((For previous columns by the author, Reuters customers can click on <a href=\"reuters://REALTIME/verb=Headlines/ric=CYRAN/\" data-type=\"newsExpression\" data-expression=\"CYRAN/\" translate=\"no\" dir=\"ltr\">CYRAN/</a> <br/> SIGN UP FOR BREAKINGVIEWS EMAIL ALERTS <a href=\"https://bit.ly/BVsubscribe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://bit.ly/BVsubscribe</a> | <a href=\"mailto:robert.cyran@thomsonreuters.com\" data-type=\"email\" translate=\"no\">robert.cyran@thomsonreuters.com</a> ; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://robert.cyran.thomsonreuters.com@reuters.net\">robert.cyran.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-RESULTS/BREAKINGVIEWS</p></div>"}