{"date": "2021-10-01 14:38:34+00:00", "ticker": "AVV", "mrkt_info": {"open": 3639.0, "close": 3516.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        AVEVA Group plc\n      </p>\n                <p>\n        Director/PDMR Shareholding\n      </p>\n                <p>\n        AVEVA Group plc announces that on 29 September 2021 it was notified of the following share option exercises and sales which took place:\n      </p>\n                <p>\n        Claire Denton, Group General Counsel and Company Secretary\n      </p>\n                <p>\n                <span>On 28 September 2021 Ms Denton exercised options over 1,899 shares under the</span>\n                <span>AVEVA Group Senior Employee Restricted Share Plan<span>and sold all resulting shares at a price of £37.40 per share.</span></span>\n                </p><p>\n                  <span>Ms Denton also exercised options over 4,678 shares under the AVEVA Group Long Term Incentive Plan and sold all resulting shares at a price of £37.40 per share.</span>\n                </p>\n                <p>\n        Ravi Gopinath, Chief Strategy Officer and Chief Cloud Officer\n      </p>\n                <p>\n                  <span>On 28 September 2021 Mr Gopinath exercised options over 16,706 shares under the AVEVA Group Long Term Incentive Plan and sold 18 of the resulting shares at a price of £38.00 per share to cover associated tax obligations and costs, retaining the balance of 16,688 shares.</span>\n                </p>\n                <p>\n                  <span>Mr Gopinath further exercised options over 8,654 shares under the AVEVA Group Senior Employee Restricted Share Plan and sold 10 of the resulting shares at a price of £38.00 per share to cover associated tax obligations and costs, retaining the balance of 8,654 shares.</span>\n                </p>\n                <p>\n                <span>Mr Gopinath also exercised options over 28 shares under the</span>\n                <span>AVEVA Group Deferred Share Bonus Plan<span>and sold 2 of the resulting shares at a price £38.00 per share to cover associated tax obligations and costs, retaining the balance of 18 shares.</span></span>\n                </p><p>\n        James Kidd, Deputy CEO and CFO\n      </p>\n                <p>\n                <span>On 28 September 2021 Mr Kidd exercised options over 36,053 shares under the</span>\n                <span>AVEVA Group Long Term Incentive plan<span>and sold 17,552 of the resulting shares at a price £37.26 per share to cover associated tax obligations and costs, retaining the balance of 18,501 shares.</span></span>\n                </p><p>\n        Andrew McCloskey, Chief Technology Officer\n      </p>\n                <p>\n                  <span>On 28 September 2021 performance share awards granted under the AVEVA Group Long Term Incentive Plan vested. Mr McCloskey received 10,445 shares and sold 3,632 shares at a price of £36.89 per share</span>\n                  <span>to cover associated tax obligations and costs, retaining the balance of 6,813 shares.</span>\n                </p>\n                <p>\n                  <span>On 28 September 2021 conditional share awards granted under the AVEVA Group Senior Employee Restricted Share Plan vested. Mr McCloskey received 3,957 shares and sold 1,376 shares at a price of £36.89 per share</span>\n                  <span>to cover associated tax obligations and costs, retaining the balance of 2,581 shares.</span>\n                </p>\n                <p>\n                  <span>Robert McGreevy, Head of M&amp;A and Corporate Strategy</span>\n                </p>\n                <p>\n                  <span>On 28 September 2021 performance share awards granted under the AVEVA Group Long Term Incentive Plan vested. Mr McGreevy received 4,648 shares and sold 1,473 shares at a price of £36.89 per share</span>\n                  <span>to cover associated tax obligations and costs, retaining the balance of 3,175 shares.</span>\n                </p>\n                <p>\n                  <span>On 28 September 2021 conditional share awards granted under the AVEVA Group Senior Employee Restricted Share Plan vested. Mr McGreevy received 2,113 shares and sold 623 shares at a price of £36.89 per share</span>\n                  <span>to cover associated tax obligations and costs, retaining the balance of 1,490 shares.</span>\n                </p>\n                <p>\n        Enquiries:\n      </p>\n                <div class=\"story-table-container\"><table class=\"story-basic-table\">\n                  <tbody>\n                    <tr>\n                      <td>\n                        <p>\n                AVEVA Group plc\n              </p>\n                      </td>\n                      <td>\n                      </td>\n                    </tr>\n                    <tr>\n                      <td>\n                      </td>\n                      <td>\n                      </td>\n                    </tr>\n                    <tr>\n                      <td>\n                        <p>\n                Matt Springett, Head of Investor Relations\n              </p>\n                      </td>\n                      <td>\n                        <p>\n                +44 (0) 7789 818 684\n              </p>\n                      </td>\n                    </tr>\n                    <tr>\n                      <td>\n                      </td>\n                      <td>\n                      </td>\n                    </tr>\n                    <tr>\n                      <td>\n                        <p>\n                FTI Consulting LLP\n              </p>\n                      </td>\n                      <td>\n                      </td>\n                    </tr>\n                    <tr>\n                      <td>\n                        <p>\n                Edward Bridges/Dwight Burden\n              </p>\n                      </td>\n                      <td>\n                        <p>\n                +44 (0) 20 3727 1000\n              </p>\n                      </td>\n                    </tr>\n                  </tbody>\n                </table></div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://tools.euroland.com/tools/PressReleases/GetPressRelease/?ID=3971719&amp;lang=en-GB&amp;companycode=uk-avv\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Aveva Group plc</strong> published this content on <strong>30 September 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>01 October 2021 14:38:34 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Aveva Group plc</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Aveva-Group-plc</p></div>"}