{"date": "2021-12-13 23:11:46.947000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>HEPS DEADLINE: Kessler Topaz Meltzer &amp; Check, LLP Reminds Investors of D MARKET Elektronik Hizmetler ve Ticaret Anonim Sirketi a/k/a D MARKET Electronic Services &amp; Trading d/b/a</p>\n</div>\n<div class=\"tr-npp-body\">\n<pre>D MARKET ELECTRONIC SERVICES &amp; TRADING (\"HEPS-Q\")\n- HEPS DEADLINE: Kessler Topaz Meltzer &amp; Check, LLP Reminds\n- Investors of D-MARKET Elektronik Hizmetler ve Ticaret Anonim\n- Sirketi a/k/a D-MARKET Electronic Services &amp; Trading d/b/a\n- Hepsiburada of Deadline in Securities Fraud Class Action\n- Lawsuit and Encourages Investors with Substantial Losses to Contact the\nFirm\n\n     The law firm of Kessler Topaz Meltzer &amp; Check, LLP informs investors\nthat a securities class action lawsuit has been filed in the United States\nDistrict Court for the Southern District of New York against D-MARKET\nElektronik Hizmetler ve Ticaret Anonim Sirketi a/k/a D-MARKET Electronic\nServices &amp; Trading d/b/a Hepsiburada (\"Hepsiburada\") (NASDAQ: HEPS). The\naction charges the company with violations of the federal securities laws,\nincluding omissions and fraudulent misrepresentations involving its\nAmerican Depositary Receipts (\"ADRs\") pursuant and/or traceable to the\nregistration statement and prospectus (collectively, the \"Registration\nStatement\") issued in connection with Hepsiburada's July 2021 initial\npublic offering (\"IPO\").  Hepsiburada's materially misleading statements\nregarding their business, operations, and prospects caused investors to\nsuffer significant losses.\n\n     LEAD PLAINTIFF DEADLINE: December 20, 2021\n\n     CLASS PERIOD: Pursuant and/or Traceable to July 1, 2021 IPO through\nOctober 21, 2021\n\n     CONTACT AN ATTORNEY TO DISCUSS YOUR RIGHTS:\nJames Maro, Esq. (484) 270-1453 or Toll Free (844) 887-9500 or Email at\ninfo@ktmc.com\n\n     HEPSIBURADA'S ALLEGED MISCONDUCT\n\n     Hepsiburada operates an ecommerce platform in Turkey, regarded as the\n\"Amazon of Turkey.\" On July 1, 2021, Hepsiburada filed its prospectus on a\nForm 424B4, which forms part of the Registration Statement. In the IPO,\nHepsiburada sold approximately 62,251,000 ADRs at a price of $12 per ADR\nand received proceeds of approximately $783 million from the Offering. The\nRegistration Statement touted Hepsiburada's purported growth attributable\nto \"meticulous execution.\" The Registration Statement also touted the\nincrease in gross merchandise value (\"GMV\"), which \"refers to the total\nvalue of orders/products sold through [the] platform over a given period of\ntime,\" including shipping fees but excluding other service revenues and\ntransaction fees.\n\n     The truth regarding Hepsiburada was revealed on August 26, 2021, when\nit announced its second quarter 2021 financial results (the quarter which\nhad ended before the IPO closed) reporting that earnings before interest,\ntaxes, depreciation, and amortization, or EBITDA, was \"negative TRY 188.6\nmillion in Q2 2021 compared to positive TRY 71.1 million in Q2 2020 . . .\ndue to lower gross contribution driven primarily by investments to fortify\nour position in electronics, investments to penetrate in high frequency\ncategories as well as higher customer demand for low margin products.\" The\ncompany also reported a \"shift in GMV mix in favor of Marketplace.\"\n\n     Following this news, Hepsiburada's ADR price fell $3.05, or 25%, to\nclose at $8.97 per ADR on August 26, 2021. At the time the class action\nlawsuit was filed, Hepsiburada's ADRs were trading as low as $5.30 per ADR,\na nearly 56% decline from the $12 per ADR IPO price.\n\n     WHAT CAN I DO?\n\n     Hepsiburada investors may, no later than December 20, 2021, seek to be\nappointed as a lead plaintiff representative of the class through Kessler\nTopaz Meltzer &amp; Check, LLP or other counsel, or may choose to do nothing\nand remain an absent class member. Kessler Topaz Meltzer &amp; Check, LLP\nencourages Hepsiburada investors who have suffered significant losses to\ncontact the firm directly to acquire more information.\n\n     WHO CAN BE A LEAD PLAINTIFF?\n\n     A lead plaintiff is a representative party who acts on behalf of all\nclass members in directing the litigation.  The lead plaintiff is usually\nthe investor or small group of investors who have the largest financial\ninterest and who are also adequate and typical of the proposed class of\ninvestors. The lead plaintiff selects counsel to represent the lead\nplaintiff and the class and these attorneys, if approved by the court, are\nlead or class counsel. Your ability to share in any recovery is not\naffected by the decision of whether or not to serve as a lead plaintiff.\n\n     ABOUT KESSLER TOPAZ MELTZER &amp; CHECK, LLP\n\n     Kessler Topaz Meltzer &amp; Check, LLP prosecutes class actions in state\nand federal courts throughout the country and around the world. The firm\nhas developed a global reputation for excellence and has recovered billions\nof dollars for victims of fraud and other corporate misconduct. All of our\nwork is driven by a common goal: to protect investors, consumers, employees\nand others from fraud, abuse, misconduct and negligence by businesses and\nfiduciaries. At the end of the day, we have succeeded if the bad guys pay\nup, and if you recover your assets.  The complaint in this action was not\nfiled by Kessler Topaz Meltzer &amp; Check, LLP. For more information about\nKessler Topaz Meltzer &amp; Check, LLP please visit www.ktmc.com.\n\nCONTACT:\nKessler Topaz Meltzer &amp; Check, LLP\nJames Maro, Jr., Esq.\n280 King of Prussia Road\nRadnor, PA 19087\n(844) 887-9500 (toll free)\ninfo@ktmc.com\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134600691.MNPRE2134602839-14420220211213</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}