{"date": "2022-01-09 07:20:35+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3251.08, "close": 3307.24}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds Supreme Court move by Amazon</p><p class=\"tr-by\">By Aditya Kalra</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW DELHI, Jan 9 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> has filed fresh legal challenges in its long-running dispute with Indian retailer Future Group after the national antitrust agency suspended a 2019 deal between the two sides, leading to a halt in their arbitration, four sources told Reuters on Sunday.</p><p>The Competition Commission of India (CCI) last month suspended its approval of Amazon's 2019 deal with Future, denting the U.S. e-commerce giant's attempts to block the sale of Future's retail assets to Indian market leader Reliance Industries <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RELI.NS\" data-type=\"ric\" data-ric=\"RELI.NS\" translate=\"no\" dir=\"ltr\">RELI.NS</a>.</p><p>The <a href=\"https://reut.rs/34DDiJf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">suspension</a> jolted Amazon as subsequently a New Delhi court <a href=\"https://reut.rs/33d4ZYr\" data-type=\"url\" class=\"tr-link\" translate=\"no\">halted the arbitration proceedings</a> between the two sides.</p><p>Late on Saturday night, Amazon filed an appeal against the CCI suspension decision at India's National Company Law Appellate Tribunal, two of the sources said.</p><p>Separately, two other sources said, Amazon also filed a challenge in the Supreme Court against the <a href=\"https://reut.rs/33d4ZYr\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Delhi court</a> decision in which judges last week that said Future-Amazon arbitration proceedings must remain on hold until Feb. 1 in light of the antitrust suspension of the deal.</p><p>Amazon and the CCI did not immediately respond to requests for comment.</p><p>The filings are the latest in the bitter legal dispute which has embroiled Amazon, Future and Reliance over what is seen as a battle for retail supremacy in India's booming consumer market. </p><p>Reliance, run by one of India's richest <span class=\"tr-strong\">men </span>Mukesh Ambani, wants to expand its footprint by acquiring debt-laden Future, but <a href=\"https://reut.rs/3G8WbkU\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon has told India's antitrust body</a> <span class=\"tr-strong\">it believes Reliance's </span>consolidated position \"will further restrict competition in the Indian retail market\".</p><p>Amazon has long argued that Future violated the terms of its 2019 deal in deciding to sell retail assets to Reliance. <span class=\"tr-strong\">T</span>he U.S. company's position has so far been backed by the Singapore arbitrator and Indian courts. Future denies any wrongdoing.</p><p>But after the CCI suspended that deal's approval, saying Amazon suppressed information while seeking clearances for the deal, Future has argued <span class=\"tr-strong\">Amazon no </span>longer has any legal basis to pursue the dispute.</p><p><span class=\"tr-strong\">Both of Amazon's appeals, to the Indian tribunal and Supreme Court, are likely to be heard in coming days, two of the sources said.</span></p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Aditya Kalra in New Delhi; Editing by Ana Nicolaci da Costa and Lincoln Feast.)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:aditya.kalra@tr.com\" data-type=\"email\" translate=\"no\">aditya.kalra@tr.com</a> ; +91-11-49548021; Twitter <a href=\"https://twitter.com/adityakalra\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/adityakalra</a>; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON-INDIA/FUTURE-RELIANCE (UPDATE 1, PIX)</p></div>"}