{"date": "2022-01-25 21:11:17.153000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NEXTECH AR SOLUTIONS CORP (\"NTAR-Z;NEXCF-0\")\n- Closes CAD $10 Million Private Placement with\n- Institutional Investor\n\n  Nextech AR Solutions Corp. (\"Nextech\" or the \"Company\"), a diversified\nleading provider of augmented reality (\"AR\") experience technologies is\npleased to announce that it has closed its previously announced private\nplacement of its common shares (\"Common Shares\") and warrants to purchase\nCommon Shares (\"Warrants\") with a single institutional investor for gross\nproceeds of approximately CAD $10 million (the \"Private Placement\").\nPursuant to the Private Placement, the Company issued 8,130,082 Common\nShares and Warrants to purchase up to an aggregate of 8,130,082 Common\nShares at a purchase price of CAD $1.23 per Common Share and associated\nWarrant. Each Warrant entitles the holder to purchase one Common Share at\nan exercise price of CAD $1.54 for a period of three years following the\nissuance date. H.C. Wainwright &amp; Co. acted as the exclusive placement agent\nfor the Private Placement. The Company has paid an aggregate cash\ncommission of CAD $800,000.07 and issued an aggregate of 650,407 broker\nwarrants to the placement agent and its assignees, each entitling the\nholder to acquire one Common Share at an exercise price of CAD$1.5375 for a\nperiod of three years following the issuance date.\n\n  The net proceeds of the Private Placement will be used by the Company for\nworking capital and general corporate purposes. No securities were offered\nor sold to Canadian residents in connection with the Private Placement.\n\n  This news release shall not constitute an offer to sell or the\nsolicitation of an offer to buy any securities, nor shall there be any sale\nof the securities in any jurisdiction in which such offer, solicitation or\nsale would be unlawful prior to registration or qualification under the\nsecurities laws of any such jurisdiction. The securities referred in this\nnews release have not been, nor will they be, registered under the United\nStates Securities Act of 1933, as amended, (the \"U.S. Securities Act\"), or\nany U.S. state securities laws, and such securities may not be offered or\nsold within the United States or to any U.S. person absent registration\nunder U.S. federal and state securities laws or an applicable exemption\nfrom such U.S. registration requirements. \"United States\" and \"U.S. person\"\nhave the respective meanings ascribed to them in Regulation S under the\nU.S. Securities Act.\n\n  NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION IN\nTHE UNITED STATES\n\n  To learn more, please follow us on Twitter, YouTube, Instagram, LinkedIn,\nand Facebook, or visit our website: <a href=\"https://www.Nextechar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.Nextechar.com</a>.\n\n  About Nextech AR\n\n  Nextech develops and operates AR platforms that transports\nthree-dimensional product visualizations, human holograms and 360 portals\nto its audiences altering e-commerce, digital advertising, hybrid virtual\nevents (events held in a digital format blended with in-person attendance)\nand learning and training experiences. Nextech focuses on developing AR\nsolutions however most of the Company's revenues are derived from three\ne-Commerce platforms: vacuumcleanermarket.com (\"VCM\"), infinitepetlife.com\nand Trulyfesupplements.com. VCM and product sales of residential vacuums,\nsupplies and parts, and small home appliances which are sold on Amazon.\n\n  Forward-looking Statements\n\n  This press release contains \"forward-looking information\" and may also\ncontain statements that may constitute \"forward-looking statements\",\ncollectively \"forward-looking information\", within the meaning of\napplicable Canadian securities legislation. Such forward-looking\ninformation is not representative of historical facts or information or\ncurrent condition, but instead represent the beliefs and expectations\nregarding future events about the business and the industry and markets in\nwhich the Company operates, as well as plans or objectives of management,\nmany of which, by their nature, are inherently uncertain. Generally, such\nforward-looking information can be identified by the use of terminology\nsuch as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"budget\",\n\"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does\nnot anticipate\", or \"believes\", or variations of such words and phrases or\nmay contain statements that certain actions, events or results \"may\",\n\"could\", \"would\", \"might\" or \"will be taken\", \"will continue\", \"will occur\"\nor \"will be achieved\". Forward-looking information contained herein may\ninclude but is not limited to, references to any future acquisitions and\nthe timing thereof and the use of proceeds of the Private Placement.\nFactors that could cause actual results to differ materially from such\nforward-looking information include, but are not limited to, general market\nconditions, availability of financing, regulatory approvals and the results\nof the Company's operations. Forward-looking information is not a guarantee\nof future performance and involve risks, uncertainties and assumptions\nwhich are difficult to predict. Accordingly, readers should not place undue\nreliance on forward-looking information, which are qualified in their\nentirety by this cautionary statement. The Company does not undertake any\nobligation to release publicly any revisions for updating any voluntary\nforward-looking information, except as required by applicable securities\nlaw.\n\nInvestor Relations\nLindsay Betts\ninvestor.relations@Nextechar.com\n866-ARITIZE (274-8493) Ext 7201\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2202400552.MNPRE2202402935-12553020220125</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}