{"date": "2022-02-20 16:04:22.984000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Introduction of characters of color into Tolkien's fantasy world has some fans complaining but as others point out, it's not less authentic to cast Black actors</p><p>As the new Lord of the Ring <span>s</span> series gears up for its September launch on Amazon, the company finds itself navigating treacherous, if familiar, waters and has already triggered a fierce debate over race by introducing characters of color into JRR Tolkien's fantasy world.</p></div><div class=\"tr-npp-body\"><p>The tech giant has spent a dragon's dungeon of gold on adapting the beloved story famous for its cultish fans, some of whom are deeply enmeshed in the rightwing culture war industry. Yet it is fully aware its final product has to reach a broad and modern audience to justify its eye-popping expenditure.</p><p>Co-produced by New Line Cinema, <span>The Lord of the Rings: The Rings of Power</span> isn't part of Peter Jackson's phenomenally successful <span>Lord of the Rings</span> and <span>Hobbit</span> movies, but it is intended to capitalize on their success: a streaming series set in the world of Tolkien's high-fantasy novels, with characters and battles drawn from the interior history and mythology laid forth in the books' extensive appendices. Jackson himself is not involved but the sets and costumes would be right at home in his movies.</p><p>The new series will feature the Saint Maud star Morfydd Clark as a younger version of Cate Blanchett's Elvish queen Galadriel, Benjamin Walker as heroic Elven-King Gil-Galad and Maxim Baldry as human king-to-be Isildur among many others. It cost $465m to make the first season, making it the most expensive television show in history. Over its projected five seasons, that budget will almost certainly exceed $1bn.</p><p>It is the crown jewel in Amazon's increasing investment in licensing and producing movies and TV series, which went up from $11bn to $13bn last year according to the company's annual report. In general, licensing old TV shows and movies will only get more expensive. So it's in Amazon's interest to make new shows and movies to attract subscribers and earn itself a little breathing room when it comes time to renegotiate the price of Parks &amp; Recreation reruns.</p><p>The Lord of the Rings appendices are more of a \"show bible\" – the kind of notes you'd give to teleplay writers – than a narrative of their own. So producers have woven their own stories of romance and palace intrigue into the book's timelines, fairy stories and genealogical footnotes.</p><p>That has allowed them to cast people of color as some of the series' elves and dwarves, pleasing some of the books' fans and angering others. Recently, Vanity Fair ran a spread of promotional photos for the show, including images of Sophia Nomvete as Dwarven princess Disa and Ismael Cruz Co´rdova as Elvish warrior Arondir.</p><p>On YouTube, the trailer for The Rings of Power has 67,000 comments as of this writing, and thousands of them are the same quote from Tolkien about the corrupting and uncreative nature of evil. \"Evil cannot create anything new, it can only spoil and destroy what good forces have invented and created,\" it reads in multiple languages. Others were more blunt. \"Imagine spending millions of dollars to promote your woke social justice warrior garbage of a film. Way to tarnish a good franchise,\" read one. \"Amazon decided to destroy Tolkien's work. Because why do a good job when you can just be corrupt and force your political beliefs,\" stated another.</p><p>Non-fans rolled their eyes. South Park retroactively changed its sole Black kid character's name from Token to Tolkien, the kind of backhanded acknowledgment of its own mistakes that are <a href=\"https://www.youtube.com/watch?v=qNKAlOejEh4\" data-type=\"url\" class=\"tr-link\" translate=\"no\">a staple</a> of the irreverent cartoon's sense of humor.</p><p>It's tempting to dismiss the complaining as the usual internet nerd rage. Similar <a href=\"https://www.theguardian.com/film/2021/mar/05/star-wars-racism-trolls-kelly-marie-tran\" data-type=\"url\" class=\"tr-link\" translate=\"no\">disputes played</a> out when actors of color started taking new major roles in Star Wars products. But the conflict is also about the rise of two kinds of media empire, not just one: there is Amazon, the crown jewel in the vast business empire of Jeff Bezos, the richest man in the world, and there is YouTube, a place for every dork who likes to complain about pop culture and whose darker corners are a frequent haunt of racism and bigotry.</p><p>One group is populated by people who can afford to buy the rights to The Lord of the Rings, and the other is populated by people for whom The Lord of the Rings is the second-best thing to the Bible, but for both, an incredible amount of money and influence is at stake. And Amazon is probably wary that its grand project could be vulnerable to attacks by aggrieved online superfans.</p><p>YouTubers complaining about \"fan mistreatment\" have hundreds of thousands, sometimes millions of subscribers. Inevitably, these fans are devoted to movies, TV shows and comics from their childhoods and many are constantly on the watch for a new version that might expand the role of women, add characters of color, or include characters who aren't straight.</p><p>When they're riled up, they can coordinate broad campaigns of harassment and even threats of violence across social media and skew perception of public opinion. It's the sort of thing that often meets with the approval of the broader rightwing media, which will sometimes fan the flames of <a href=\"https://web.archive.org/web/20200912054040/https://www.foxnews.com/media/washington-post-defends-cuties-joker-provocative\" data-type=\"url\" class=\"tr-link\" translate=\"no\">a useful controversy</a> . Talented social media trolls have gone on to <a href=\"https://www.splcenter.org/splc-investigation-far-right-oann-anchor-jack-posobiecs-rise-tied-white-supremacist-movement\" data-type=\"url\" class=\"tr-link\" translate=\"no\">jobs on cable television</a> .</p><p>In human terms, being the target of rightwing hate campaigns can be draining and depressing. in business terms, it can really mess with a marketing budget, and that kind of power is attractive to permanently aggrieved pop culture devotees.</p><p>The extremity of protest over the \"unrealistic\" presence of a Black dwarf princess feels silly, considering the stories themselves are about wizards and magic rings and the occasional dragon. But audiences, says Ebony Thomas, author of <a href=\"https://nyupress.org/9781479800650/the-dark-fantastic/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Dark Fantastic</a> and an associate professor at the University of Michigan, are not wrong when they say that Black characters seem like they just don't belong in the notoriously white fantasy genre.</p><p>\"The history of fantasy is racialized,\" she says. \"People are used to seeing fantasies and fairytales as all-white, particularly in faux-medieval or magical-medieval settings,\" Thomas explains. \"We're taking them out of the dream space. We're taking them out of how they imagined it could be, and so it feels off to them. So that's why they're saying, you know, 'Who are these people? This is not what Tolkien intended! It's not accurate!'\"</p><p>Of course, if you're willing to go back to the poems and legends that inspired Tolkien, you will definitely find characters who are not white.</p><p>The Norse Prose Edda, compiled in 1220, includes the <span>svartálfar</span> , Black elves who live in Svartálfarheim; Tolkien was a devotee of Old Norse prose and verse and even translated some of the verse into English.</p><p>But, despite that, it is a fraught time to be adapting anything with even a hint of Norseness to it. American fascist organizations use Norse iconography publicly in lieu of more easily recognized swastikas and Confederate flags. American \"European heritage\" groups are obsessed with Norse gods and runes. These groups are often violent, and when they rally behind a symbol, the people they target tend to turn away from it.</p><p>Some devotees are refusing to cede that ground, arguing that such symbols – and fantasy more broadly – should be for everyone. \"White Supremacists don't own Norse Mythology, even if some of them think they do, any more than they own the Bible, or the US Constitution, even though they might think they do,\" wrote fantasist Neil Gaiman on Twitter.</p><p>Gaiman is qualified to deliver that rebuke: he's written his own Norse mythology and a novel incorporating it (and other traditions) into American myth-making, American Gods.</p><p>In fact, despite its array of wizards, magic objects, warring races and deep wells of mythology, The Lord of the Rings is a decidedly non-threatening tale: fundamentally a comforting story of middle-class heroes of multiple races who triumph over enormous odds to save their way of life by working together against a common foe. This is poor soil for exterminationism – more of a saccharine conservatism, complicated by Tolkien's own experiences in the first world war.</p><p>\"I don't think these books are 'fascist',\" wrote the great British fantasist Michael Moorcock in 1978, \"but they certainly don't exactly argue with the 18th-century enlightened Toryism with which the English comfort themselves so frequently in these upsetting times.\" Moorcock thought Tolkien owed a lot to AA Milne; he called the Rings books \"Epic Pooh\". American conservatives, too, especially evangelical Christians who venerate Tolkien and CS Lewis, love Tolkien's preoccupation with the simple life and disdain for anything urban or industrial.</p><p>So is it fundamentally disrespectful to do what Amazon has done by making a modern adaptation of such a traditionalist work with a non-traditional cast?</p><p>Thomas, who loves Tolkien, doesn't think so, and she points out that the notoriously restrictive Tolkien estate doesn't think so, either. In this case, Tolkien's official interpreters are far less concerned with uniform pigmentation among the cast than they are with making sure the new show doesn't touch the potentially lucrative events of The Silmarillion, a posthumous novel the estate would surely like to see sold to a big movie studio for gobs of cash.</p><p>The question, Thomas says, is not merely of accuracy, but of authenticity, and given that race is an arbitrary construct anyway, it's not somehow less authentic to cast Black actors than it is to cast white ones.</p><p>\"My ancestors have been here, speaking English, for 10 generations,\" she says. \"It's not the case that some strange people who are not from Anglo-American culture are suddenly demanding representation. We've been here for centuries. We have been existing.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 theguardian.com-NonSyndicated</p></div>"}