{"date": "2021-12-09 20:11:33.882000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.16, "close": 3444.24}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>TENABLE HOLDINGS INC (\"TENB-Q\")\n- Named the Only 2021 Gartner Peer Insights(TM) Customers'\n- Choice for Vulnerability Assessment\n\n   Tenable(R), Inc., the Cyber Exposure company, announced that it is the\nonly vendor to be named a November 2021 Customers' Choice in the Voice of\nthe Customer: Vulnerability Assessment Report.\n\n   Gartner classifies the VA market as \"vendors that provide capabilities\nto identify, categorize and manage vulnerabilities. These include unsecure\nsystem configurations or missing patches, as well as other security-related\nupdates in the systems connected to the enterprise network directly,\nremotely or in the cloud.\"\n\n   \"It is meaningful and thrilling to be named a Gartner Peer Insights\nCustomers' Choice because we believe it reflects our customers' feedback as\nmuch as our leadership in this space,\" said Mark Thurmond, chief operating\nofficer, Tenable. \"We thank all of the customers who shared their\nexperiences and who continue to trust Tenable to solve some of their\nbiggest cybersecurity challenges.\"\n\n   According to Gartner, \"Vendors' User Interest and Adoption scores\nincorporate three factors, each given one-third weight: review volume, user\nwillingness to recommend, and review market coverage across industry,\ncompany size, and deployment region. A vendor must meet or exceed the\nmarket average User Interest and Adoption Score to qualify for the\nright-hand quadrants.\"\n\n   Only vendors with 20 or more eligible published reviews during the\nspecified 18-month submission period are included. Reviews from end users\nof companies greater than $50M in revenue are included in the methodology.\n\n   Below is a sampling of the typical reviews Tenable received in the\nVulnerability Assessment category:\n\n   \"We use the vulnerability management platform from Tenable to see all\nour assets and vulnerabilities across our entire network and attack\nsurface, which includes our cloud services, OT, and container environments.\nThe service is excellent as it allows us to act on each high-priority\nvulnerability to effectively manage risk and measure key KPIs that allow\neasy management reporting.\" - Senior Product Manager in the Services\nIndustry\n\n   \"The Industry Standard For Vulnerability Management\" - SOC in the\nFinance Industry\n\n   \"Automate - Vulnerability Management On AWS Cloud. I must say SE Team is\nvery cooperative and technical well versed with complete AWS native\nautomation tools and third-party providers e.g. Terraform &amp; Ansible. Using\n[Tenable.io] for vulnerability management for multiple (26) AWS account in\na different region helped us to have complete vulnerability management &amp;\nconfiguration audit on the single console. We're able to...integrate\ntenable with AWS CI-pipeline to prepare golden image.\" - Lead - Cloud &amp;\nDevSecOps in the Services Industry\n\n   To see the full list of vendors in the November 2021 Gartner Peer\nInsights Customers' Choice for Vulnerability Assessment, click here.\n\n   Gartner Peer Insights Customers' Choice constitute the subjective\nopinions of individual end-user reviews, ratings, and data applied against\na documented methodology; they neither represent the views of, nor\nconstitute an endorsement by, Gartner or its affiliates.\n\n   Gartner Peer Insights reviews constitute the subjective opinions of\nindividual end users based on their own experiences and do not represent\nthe views of Gartner or its affiliates.\n\n   About Tenable\nTenable(R), Inc. is the Cyber Exposure company. Over 30,000 organizations\naround the globe rely on Tenable to understand and reduce cyber risk. As\nthe creator of Nessus(R), Tenable extended its expertise in vulnerabilities\nto deliver the world's first platform to see and secure any digital asset\non any computing platform. Tenable customers include more than 50 percent\nof the Fortune 500, more than 30 percent of the Global 2000 and large\ngovernment agencies. Learn more at www.tenable.com.\n\nTenable\ntenablepr@tenable.com\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134200539.MNPRE2134202677-11573420211209</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}