{"date": "2021-11-30 00:31:33.557000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_5fipdntq&amp;referenceId=tag:reuters.com,2021:newsml_OVF5NPLL7_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_5fipdntq&amp;referenceId=tag:reuters.com,2021:newsml_OVF5NPLL7_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: Wall Street stocks closed higher on Monday, regaining some of the ground they lost in Friday's sell-off, as investors were hopeful that the Omicron coronavirus variant would not significantly dampen the economy.  Conway G. Gittens reports.<br/>Short Link: <a href=\"https://refini.tv/3pacA1e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3pacA1e</a><br/><br/>Video Transcript:<br/><br/>Stocks bounced back Monday from the miserable sell-off at the end of last week as cooler heads prevailed over a possible turn in the health crisis. The Dow rallied 236 points, but that was just a mere fraction of Friday's decline, the worst all year. The S&amp;P 500 rose 60 points. And with a gain of 291 points, the NASDAQ nearly took back all off Friday's losses. David Bahnsen, Chief Investment Officer at The Bahnsen Group, said Friday's market nosedive was an overreaction.<br/><br/>Just as much as I'm somewhat sanguine on what the variant news will end up being, there's still a lot of uncertainty, too. So some people still may not want to get fully back into the water. They want to wait and hear some additional information. But I think that the headline issue Friday drove some panic selling. And now you have a partial normalization playing out today.<br/><br/>A rebound in the price of oil gave energy stocks a boost. Top officials from OPEC and OPEC+ said they weren't worried that the new COVID-19 variant Omicron would dampen demand. Crude oil prices climbed and so did the stock price for oil majors like ExxonMobil. Retailers were a key sector to watch as Cyber Monday got underway. There were some concerns after Black Friday posted the first-ever drop in digital sales compared to the prior year. But other early indications on the start of the key holiday shopping season were less somber. US shoppers spent 14% more on merchandise excluding automobiles during Black Friday weekend compared to the same holiday weekend a year earlier, according to MasterCard SpendingPulse. Shares of e-commerce leader Amazon rallied 1.6% on the day. Twitter had a volatile session. Jack Dorsey announced he stepped down as CEO and was replaced by Chief Technology Officer Parag Agrawal. Shares ended the day lower after an initial pop.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}