{"date": "2022-01-06 20:58:14.992000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3287.14, "close": 3251.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>CINEDIGM CORP (\"CIDM-Q\")\n- Agrees to Acquire Streaming and Entertainment Company Digital Media\n- Rights Adding 10 New Channels and 7,500 Titles\n\n     Cinedigm, the leading provider of enthusiast streaming services,\nannounced today that the Company has reached an agreement to acquire\nDigital Media Rights (DMR), a diversified specialty streaming, advertising,\nand content distribution company with significant expertise in building\naudiences for global content in North America.\n\n(figure class=\"image\")(/figure)     Founded more than a decade ago by media\nindustry veterans Michael Hong and David Chu, DMR focuses on four key\nstreaming businesses. First, the company is a leading global distributor of\nfeature films and television series for the streaming ecosystem, with more\nthan 7,500 titles under distribution.\n\n     Secondly, DMR has developed and operates 10 channels focused on\nenthusiast audiences. Six of these proprietary streaming services are\navailable as free ad-supported streaming television (FAST) channels and/or\nvideo-on-demand apps (all apps have ad-supported VOD and premium,\nsubscription VOD options):\n\n*  AsianCrush (asiancrush.com): The one-stop portal to the latest Asian\nentertainment featuring premium movies and shows.\n*  Midnight Pulp (midnightpulp.com): The perfect late-night channel to end\nall boredom, offering an expertly curated selection of cult programming\nwith a twist of millennial irreverence.\n*  RetroCrush (retrocrush.tv): Dedicated to the Golden Age of anime.\n*  Cinehouse (www.cinehousetv.com): both a standalone channel with apps\navailable across all major devices, as well as a Linear TV streaming\nbundle, curating niche, enthusiast channels focused on the best movies and\nTV shows from around the world. Among the linear FAST channels available in\nCinehouse's lineup are 24/7 streams of AsianCrush, RetroCrush, Midnight\nPulp and KMTV, with more being announced in 2022.\n*  Cocoro (cocoro.tv): The ultimate destination for kid-friendly shows\ndesigned to educate and entertain.\n*  KMTV (kmtvnow.com): Features all things K-Pop, from music videos of the\nnewest releases to variety show highlights, to all things in between.\n\n     Third, through its DMR Social unit, DMR curates social video channels\nfor most of the above brands, as well as four others, with more in\ndevelopment:\n\n*  C-Crush: A community for fans of the best Chinese TV and movies.\n*  Cinehouse Romance: A curated selection of romance-focused movie clips\nfrom DMR's library of arthouse and indie films.\n*  K-Crush: A community for Korean cinema, TV and pop culture addicts.\n*  QTTV: A community for fans of queer cinema.\n\n     Lastly, DMR operates an Ad Network &amp; Marketplace garnering more than\n100 million connected TV impressions a month against long-form, premium\nmovies and television shows across their owned-and-operated and selected\npartner channels with an average ad completion rate of over 95%.\n\n     Acquisition Boosts Library, Channel Portfolio, Ad Business and Social\nFootprint\n\n     Upon completion of the deal, Cinedigm will increase its library to\nmore than 46,000 hours of premium film and television content, with an\nestimated 40+ million monthly viewers, 18.5 million social subscribers, 4\nbillion views, and 13 billion minutes viewed annually. With the addition of\nthe seven new owned, proprietary channels, the Company will have 15\nwholly-owned streaming services, which now comprises more than 50% of its\n28 channels in operation.\n\n     With a significant portion of DMR's portfolio focused on premium Asian\nfilm and television content, the addition of its wildly popular titles to\nCinedigm's content portfolio will help fill the growing consumer demand for\nAsian-influenced media, such as Japanese anime and Korean dramas, across\nthe entertainment landscape. According to Ampere Analysis, more than 25% of\nall North American consumers now watch foreign content, with Squid Game and\nNarcos being examples of two breakout hits reflecting the trend. Given\nDMR's tight programming and demographic alignment with Cinedigm's existing\nsubscription services, the Company plans on leveraging each Company's\nrespective content portfolio to enhance and broaden the Company's existing\nstreaming services.\n\n     Cinedigm also plans to further expand DMR's Advertising Network, which\nhas long-standing customers and direct partnerships with key advertising\npartners, with the Company's robust programmatic ad sales infrastructure.\nIn conjunction with Cinedigm's continued investment in technology and\nsupply-chain automation via the Company's proprietary Matchpoint(TM)\nplatform, the Company believes it will reduce DMR's operating costs and\nstrengthen its revenue growth by leveraging its unique competitive\nadvantage in the streaming business and through its underlying technology.\nMigrating DMR's entire content library into the Matchpoint(TM) platform\nwill allow the Company to efficiently expand the distribution of DMR's film\n&amp; television content catalog and easily deliver it at significant scale to\nCinedigm's extensive network of OTT platforms and third-party distribution\npartners at the click of a button.\n\n     Finally, Cinedigm plans to leverage DMR's first-class social media\ndivision to grow engagement and followers of Cinedigm's streaming channels\non the leading social media platforms. DMR's social media unit brings\nextensive expertise in curating content to help drive new distribution,\nrevenue and marketing opportunities. DMR Social has a footprint of more\nthan 17 million subscribers and followers on YouTube and Facebook alone,\nacross eight brands that are collectively averaging 284 million video views\nper month -- and more than 8 million hours watched -- over the past year.\nDMR's community-building and content curation techniques and expertise will\nbe applied to Cinedigm's portfolio of channels including Fandor, CONtv and\nScreambox. The goal is to establish a new ad revenue stream for the Company\nand help grow Cinedigm's SVOD, AVOD and FAST streaming channels.\n\n     \"DMR's top-notch management team, high-quality channels and film &amp; TV\nlibrary perfectly complement our own strengths and our mission of serving\nenthusiast audiences,\" said Chris McGurk, Chairman and CEO at Cinedigm.\n\"When you consider the other key additive components from this deal,\nincluding the global reach of DMR's expansive social media efforts, we are\nwell-positioned to not only reach a rapidly growing new audience in the\nshort-term but also to expand the scale of a larger Cinedigm umbrella\nchannel strategy in the long run. We expect this acquisition to be\nimmediately accretive, and the leverage of Cinedigm's technological\nefficiencies and expansive portfolio of assets will spur significant\nadditional growth.\"\n\n     \"Rarely do you find an acquisition that is as complementary as DMR,\"\nsaid Erick Opeka, President of Cinedigm Networks and Chief Strategy Officer\nof Cinedigm. \"This portfolio of channels and content immediately provides\nincreased scale, strengthens the content offering on our flagship services,\nprovides critical growth and marketing capabilities via social, and gives\nus a new foothold into the direct ad sales and streaming live television\nbusinesses. We look forward to starting out the new fiscal year with the\npeople and assets we need to meet the growing needs of our viewers,\nplatforms and advertisers.\"\n\n     \"The strong synergy between Cinedigm and DMR is readily apparent, and\nby working together, we can continue to deliver and further scale our\ntop-notch, curated streaming channels to our audiences in a way that builds\na true sense of community. The team at DMR is proud to have built an\nimpressive lineup of channels and offer content that can meet the rising\ndemands of audiences around the world, including fans of incredibly popular\nKorean dramas, Japanese anime, and Chinese TV, as well as arthouse, romance\nand horror movies,\" said David Chu, Co-Founder and CEO of DMR. \"It's why\nwe're thrilled to align with this key industry player and are looking\nforward to a future with even more expansion opportunities.\"\n\n     Added DMR Co-Founder and Chairman Mike Hong, \"Today's deal with\nCinedigm marks a watershed moment for David and I. As entrepreneurs we're\nincredibly excited to see more than a decade of hard work fueling the\nongoing growth of DMR, now culminating in this acquisition which will\nprovide the foundation to take the company to even more heights.\"\n\n     An innovator in the digital transformation of the entertainment\nindustry for more than two decades, Cinedigm's core mission is to entertain\nthe world by building the world's best portfolio of enthusiast channels and\nservices for the streaming generation. Through a diverse mix of premium\nSVOD services and dedicated AVOD and FAST channels, Cinedigm's streaming\nportfolio reaches indie film (Fandor), horror (Screambox &amp; Bloody\nDisgusting) and family entertainment (Dove Channel), as well as dedicated\nchannels for iconic entertainers, led by Bob Ross (The Bob Ross Channel).\nCinedigm's ultimate goal is to build destinations that immerse viewers in\ncontent they love while staying at the forefront of technology as the\nstreaming industry continues to evolve.\n\n     About Cinedigm:\n\n     For more than 20 years, Cinedigm (NASDAQ: CIDM) has led the digital\ntransformation of the entertainment industry. Today, Cinedigm entertains\nconsumers around the globe by providing premium feature film and television\nseries, enthusiast streaming channels and technology services to the\nworld's largest media, retail and technology companies. As a leader in the\nrapidly evolving streaming ecosystem, Cinedigm continues its legacy as an\ninnovator through its adoption of next-generation technologies, such as\nartificial intelligence and machine learning, through its proprietary,\nhighly-scalable Matchpoint(TM) technology platform. For more information,\nvisit cinedigm.com.\n\n     About DMR:\n\n     DMR (aka Digital Media Rights) is a privately-held digital media and\nentertainment company founded a decade ago by industry veterans Michael\nHong and David Chu. Pioneers in digital entertainment, DMR is transforming\nthe industry while specializing in OTT Channels and Digital Distribution.\n\n     As a publisher and developer, DMR owns and operates seven OTT channels\nthat have become leading destinations for their respective genres:\nAsianCrush (pan-Asian), Midnight Pulp (horror/thriller/action), Cinehouse\n(general entertainment), RetroCrush (classic anime), Cocoro (kids/family),\nand KMTV (K-Pop), and Cinehouse Selects (arthouse). These are available as\nvideo-on-demand (AVOD and/or SVOD) apps on Smart TVs, mobile and connected\nTV devices; on Xbox One and Xbox Series X|S consoles; on the web; and/or as\nlinear, free ad supported television (FAST) channels on LG Channels,\nPeacock, Plex, Redbox, The Roku Channel, Samsung TV Plus, STIRR and VIZIO\nSmartCast. Its DMR Social division curates several social video channels\nfor most of the above brands, as well as C-Crush (Chinese TV shows and\nmovies), Cinehouse Romance (romance), K-Crush (Korean pop culture) and QTTV\n(LGBTQ+).\n\n     DMR is also one of the world's largest content aggregators and\ndistributors with a catalog containing more than 7,500 premium titles from\nleading TV networks, studios, producers and sales agents. The company has\ncultivated distribution deals with Amazon Instant Video, Amazon Prime,\nHulu, Netflix, Cable VOD, iTunes, Google Play, FandangoNow, Tubi, PlutoTV,\nCrackle, Hoopla, Kanopy, Vudu, to name a few. The DMR Advertising\nMarketplace provides video and display ads via direct sales and\nprogrammatic channels (Connected TV, desktop, and mobile) while connecting\nbrands and media buying agencies to premium publishers. For more\ninformation, visit digitalmedarights.com\n\n     Cautionary Statement Regarding Forward-Looking Statements\n\n     Statements made in this press release may contain forward-looking\nstatements within the meaning of Section 27A of the Securities Act of 1933,\nas amended, and Section 21E of the Securities Exchange Act of 1934, as\namended, that are based on Cinedigm's beliefs, as well as assumptions made\nby, and information currently available to, Cinedigm, and therefore involve\nrisks and uncertainties that are difficult to predict. Generally, future or\nconditional verbs such as \"will,\" \"would,\" \"should,\" \"could,\" or \"may\" and\nthe words \"believe,\" \"anticipate,\" \"continue,\" \"intend,\" \"expect\" and\nsimilar expressions identify forward-looking statements. Forward-looking\nstatements include, but are not limited to, references to strategies,\nplans, objectives, expectations, intentions, assumptions, future operations\nand prospects and other statements that are not historical facts. You\nshould not place undue reliance on forward-looking statements. Although\nCinedigm believes that plans, intentions and expectations reflected in or\nsuggested by any forward-looking statements made herein are reasonable,\nCinedigm may be unable to achieve such plans, intentions or expectations\nand actual results, and performance or achievements may vary materially and\nadversely from those envisaged in the statements made in this press\nrelease.\n\n     Press Contacts:\n\n     DKC Public Relations\ncinedigm@dkcnews.com\n\n     High Touch Investor Relations\nCinedigm@htir.net\n\n     Don Ciaramella / Matt Biscuiti\nThe Lippin Group for DMR\ndon@lippingroup.com / matt@lippingroup.com\n\nTel   : 212-206-8600    CINEDIGM CORP\nEmail : jcalcaterra@cinedigm.com\nWWW   : <a href=\"https://www.cinedigm.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.cinedigm.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200500680.MNPRE2200501814-06382320220106</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}