{"date": "2021-09-29 20:40:42.157000+00:00", "ticker": "III", "mrkt_info": {"open": 1272.5, "close": 1281.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENBRIDGE INC (\"ENB-TN\")\n- Line 3 Replacement Project Substantially Completed and Set to be\n- Fully Operational\n\n     Enbridge Inc. (Enbridge or the Company) announced the achievement of a\nmajor milestone with the substantial completion of the Line 3 Replacement\nProject and the establishment of an in-service date of October 1. This step\nmarks the full replacement of the entire 1,765-kilometre/1,097-mile-long\npipeline from Edmonton, AB. to Superior, WI. With new state-of-the-art,\nthicker-walled pipe, its completion ensures a safe, reliable supply of\nNorth American crude oil to U.S. refineries, helping fuel the quality of\nlife for millions of people.\n\n     \"After more than eight years of many people working together,\nextensive community engagement, and thorough environmental, regulatory and\nlegal review, we are pleased that Line 3 is complete and will soon deliver\nthe low cost and reliable energy that people depend on every day,\" said Al\nMonaco, Enbridge President and Chief Executive Officer. \"From day one, this\nproject has been about modernizing our system and improving safety and\nreliability for the benefit of communities, the environment and our\ncustomers.\n\n     \"Line 3 was developed and executed with the most state-of-the-art\napproach to design, construction and environmental management,\" Monaco\nadded. \"We're also very proud of the relationship of trust we've built with\ncommunities along the right-of-way in both Canada and the United States.\nOur goal is to continuously live up to the trust that all of our\nstakeholders have placed in us.\"\n\n     The new 542-kilometre/337-mile Minnesota segment of Line 3, which\nfollows other segments already placed into service in Canada, North Dakota\nand Wisconsin, restores the full pipeline capacity of 760,000 barrels per\nday to meet the energy needs of refineries in the Midwest. Many labor\ngroups, including the International Union of Operating Engineers (IUOE),\nLaborers' International Union of North America (LIUNA), United Association\nof Plumbers and Pipefitters (UA), and the International Brotherhood of\nTeamsters, and communities along the right-of-way made the successful\ncompletion of the project possible.\n\n     In Minnesota, the Line 3 replacement was the most studied pipeline\nproject in state history, with input gathered from 71 public comment\nregulatory meetings and over 3,500 community engagement meetings.\nExhaustive scientific review exceeding legal and regulatory requirements\nresulted in support and project approvals from federal, state, and local\nagencies, and Native American tribes.\n\n     More than 1,500 Indigenous people worked on replacing Line 3 in the\nU.S. and Canada. Specifically, in Minnesota, where Native Americans made up\nseven percent of the Line 3 workforce, over US$300 million went directly to\nNative-owned contractors, tribal community investments and training and\nhiring Native individuals. In total, the Company invested CDN$750 million\nwith Indigenous communities, individuals, and businesses.\n\n     Throughout the project, Enbridge has shown continuous respect for\ntribal sovereignty. In Minnesota, 30 tribes took part in the consultation\nprocess with the U.S. Army Corps of Engineers. The project included a\nfirst-of-its kind Tribal Cultural Resource Survey led by the Fond du Lac\nBand of Lake Superior Chippewa which employed tribal cultural experts who\nwalked the full route identifying and recording significant cultural\nresources to be avoided. Construction was completed under the supervision\nof tribal monitors with authority to stop construction to ensure protection\nof important cultural resources.\n\n     Forward-Looking Information\n     Forward-looking information, or forward-looking statements, have been\nincluded in this news release to provide information about Enbridge Inc.\n(\"Enbridge\" or the \"Company\") and its subsidiaries and affiliates,\nincluding management's assessment of Enbridge and its subsidiaries' future\nplans and operations. This information may not be appropriate for other\npurposes. Forward-looking statements are typically identified by words such\nas \"anticipate\", \"expect\", \"project\", \"estimate\", \"forecast\", \"plan\",\n\"intend\", \"target\", \"believe\", \"likely\" and similar words suggesting future\noutcomes or statements regarding an outlook. Forward-looking information or\nstatements in this news release include statements with respect to the Line\n3 Replacement Project, including the benefits thereof and the expected\nin-service date.\n\n     Although Enbridge believes these forward-looking statements are\nreasonable based on the information available on the date such statements\nare made and processes used to prepare the information, such statements are\nnot guarantees of future performance and readers are cautioned against\nplacing undue reliance on forward-looking statements. By their nature,\nthese statements involve a variety of assumptions, known and unknown risks\nand uncertainties and other factors, which may cause actual results, levels\nof activity and achievements to differ materially from those expressed or\nimplied by such statements. Assumptions regarding the expected supply of\nand demand for crude oil, natural gas, NGL and renewable energy, and the\nprices of these commodities, are material to and underlie all\nforward-looking statements, as they may impact current and future levels of\ndemand for the Company's services. Similarly, energy transition, including\nthe drivers and pace thereof, the COVID-19 pandemic, exchange rates,\ninflation and interest rates impact the economies and business environments\nin which the Company operates and may impact levels of demand for the\nCompany's services and cost of inputs, and are therefore inherent in all\nforward-looking statements. Due to the interdependencies and correlation of\nthese macroeconomic factors, the impact of any one assumption on a\nforward-looking statement cannot be determined with certainty. The most\nrelevant assumptions associated with forward-looking statements on\nannounced projects and projects under construction, including estimated\nin-service dates, include the following: the impact of litigation and\ngovernment, regulatory and stakeholder actions and approvals on\nconstruction and in-service schedules; the availability and price of labour\nand construction materials; the effects of inflation and foreign exchange\nrates on labour and material costs; the effects of interest rates on\nborrowing costs; and the impact of weather.\n\n     Enbridge's forward-looking statements are subject to risks and\nuncertainties, including, but not limited to those risks and uncertainties\ndiscussed in this news release and in the Company's other filings with\nCanadian and United States securities regulators. The impact of any one\nrisk, uncertainty or factor on a particular forward-looking statement is\nnot determinable with certainty as these are interdependent and Enbridge's\nfuture course of action depends on management's assessment of all\ninformation available at the relevant time. Except to the extent required\nby applicable law, Enbridge assumes no obligation to publicly update or\nrevise any forward-looking statements made in this news release or\notherwise, whether as a result of new information, future events or\notherwise. All subsequent forward-looking statements, whether written or\noral, attributable to Enbridge or persons acting on the Company's behalf,\nare expressly qualified in their entirety by these cautionary statements.\n\n     About Enbridge Inc.\n     Enbridge Inc. is a leading North American energy infrastructure\ncompany. We safely and reliably deliver the energy people need and want to\nfuel quality of life. Our core businesses include Liquids Pipelines, which\ntransports approximately 25 percent of the crude oil produced in North\nAmerica; Gas Transmission and Midstream, which transports approximately 20\npercent of the natural gas consumed in the U.S.; Gas Distribution and\nStorage, which serves approximately 3.8 million retail customers in Ontario\nand Quebec; and Renewable Power Generation, which generates approximately\n1,766 MW of net renewable power in North America and Europe. The Company's\ncommon shares trade on the Toronto and New York stock exchanges under the\nsymbol ENB. For more information, visit www.enbridge.com.\n\n     None of the information contained in, or connected to, Enbridge's\nwebsite is incorporated in or otherwise forms part of this news release.\n\n     FOR FURTHER INFORMATION PLEASE CONTACT:\n\n     Media Toll Free: (888) 992-0997 Email: media@enbridge.com\n\n     Investment Community Toll Free: (800) 481-2804 Email:\ninvestor.relations@enbridge.com\n\nTel   : 403-231-3900    ENBRIDGE INC\nFax   : 403-231-5929\nWWW   : <a href=\"https://www.enbridge.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.enbridge.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2127100058.MNPRE2127100813-05335820210929</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}