{"date": "2021-11-09 14:00:00.633000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p align=\"justify\">LONDON, Nov.  09, 2021  (GLOBE NEWSWIRE) -- Europe’s leading managed vacation rentals group, <a href=\"https://www.globenewswire.com/Tracker?data=LAX4cZd3j0NdDYd1y63Hppk6I7HpVdr0ZUP3txLJGi_uQH2OfxzTY75p_9hGNa-52p34eFftAGgJOyRaK9sy-A==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Awaze</a>, says its support from Rackspace Technology™ (NASDAQ: RXT), the end-to-end multicloud technology services company, is already paying dividends as it celebrates a record year and looks forward to further growth.<br/></p>  <p align=\"justify\">The self-catering giant, which offers 90,000 accommodation choices in 36 countries to more than six million holidaymakers a year, has seen unprecedented surges in demand over the last 12 months thanks to the rising popularity of domestic breaks in the wake of the global pandemic.</p>  <p align=\"justify\">Awaze has only been able to meet the huge volumes of traffic to its Hoseasons and cottages.com websites at points this year due to its transition to Amazon Web Services (AWS) cloud from an on-premises environment.</p>  <p align=\"justify\">James Baird, Technical Operations Director at Awaze said: “Our partnership with Rackspace Technology has allowed us to optimise our cloud footprint and make it elastic at every layer and across every point of the customer and owner journey. This means it seamlessly expands and contracts in line with volatile patterns of demand, maintaining robustly consistent response times and performance whilst also being highly commercially optimised.”</p>  <p align=\"justify\">Tightly aligning compute resources to demand as part of the multi-million pound investment has led to a 30% reduction in web session costs.</p>  <p align=\"justify\">“Prior to this investment we had to maintain compute resources at peak levels most of the time,” Baird added. “We already had multi-dimensional cycles influencing patterns of demand, including time of day and time of year, but the pandemic completely disrupted these resulting in huge spikes and troughs. Auto-scaling means we no longer have to waste resource to cope with market volatility and can service demand in the most efficient, cost-effective way possible whilst maintaining performance and delivering a great experience for our guests and owners.”</p>  <p align=\"justify\">The system’s operating effectiveness was given one of its toughest tests on February 21st this year when web traffic increased 400% in the minutes after UK Prime Minister Boris Johnson’s route out of lockdown address to Parliament. Traffic peaked at one booking and nearly 100 searches every second, with the number of CPUs powering the company’s guest and owner portals going from less than 100 to more than 1,200 in less than six hours.</p>  <p>Simon Bennett, CTO, EMEA at Rackspace Technology, said: “Awaze has been a valued customer for over 12 years and we’re proud to have been part of its digital evolution. With auto-scaling and flexibility being key components of public cloud environments, Awaze can benefit from increased innovation and agility in support of their own business objectives.”</p>  <p align=\"justify\">Awaze is currently using Rackspace Technology’s flexible and innovative elastic engineering service to migrate all its remaining applications hosted in non-cloud data centres into the AWS cloud. This will deliver unparalleled flexibility, near limitless scalability and performance and enable the company to continue its growth journey, both organically and through M&amp;A activity.</p>  <p>For more information about Awaze visit <a href=\"https://www.globenewswire.com/Tracker?data=x7Oci2xmmmRbl9a-44UoOvBwUekz9pmPWJHQb3xWwY6idgehZXwvTKKXIw5td0t_WFuuT5wuqxtvItZaEIeyqw==\"><u>www.awaze.com</u></a><u>.</u> </p>  <p><strong>Rackspace Technology </strong><br/>Rackspace Technology is a leading end-to-end multi-cloud technology services company. We can design, build and operate our customers’ cloud environments across all major technology platforms, irrespective of technology stack or deployment model. We partner with our customers at every stage of their cloud journey, enabling them to modernize applications, build new products and adopt innovative technologies.</p>  <p><strong>Awaze</strong> <br/>Awaze is Europe’s leading managed vacation rentals and holiday resorts business. Home to specialist self-catering brands cottages.com, Hoseasons, James Villa Holidays and Novasol, the company provides everyday amazing holiday experiences to more than six million guests each year, with 90,000 places to stay across 36 countries. <a href=\"https://www.globenewswire.com/Tracker?data=x7Oci2xmmmRbl9a-44UoOimFbEbd6qXbSMC24A7twqSbAIpAkRuHb3AQb_TM6063EXiqTwlLH1tYUJBVXtPGZg==\"><u>www.awaze.com</u></a> </p>  <p><strong>Media Contact</strong><br/>Devika Mistry<br/>EMEA Rackspace Technology Corporate Communications<br/>Devika.mistry@rackspace.co.uk</p>  <p> </p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODM4OTMzOSM0NTQwNjY1IzIwMDU3MjQ=\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RNNE9UTXpPU00wTlRRd05qWTFJekl3TURVM01qUT0=&amp;key=c2e7586e9f730d25398c778cf0d966faf73e7372ed7530a55b1d958bd29e294812cd60a502ca6cab5e4f203313abd1bdedf892fb95fb8992d4484d4d580570d4\"/></div></div> <br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/Y2Y2Y2VkNGYtZDJiYi00OWY0LTg1MjktNmYyZTAyMjM4YjMwLTEwMTcyOTc=/tiny/Rackspace-Technology-Inc-.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9ZMlkyWTJWa05HWXRaREppWWkwME9XWTBMVGcxTWprdE5tWXlaVEF5TWpNNFlqTXdMVEV3TVRjeU9UYz0vdGlueS9SYWNrc3BhY2UtVGVjaG5vbG9neS1JbmMtLnBuZw==&amp;key=2a0e6aad1216d050b07d943684f4732cb9ad6e35f10a48dfe5e7d60608b96971e41c670c45d4f924e6eae532298e73b52135be924817993c4c95126ecbd48a0b\"/></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright GlobeNewswire, Inc. 2021</p></div>"}