{"date": "2021-11-04 12:00:01.730000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b><span>Generation Hemp Launches Rowdy Rooster Hemp Animal Bedding Products on Amazon</span></b>\n</p><p>\n- <b><span>The animal bedding line, made from Hemp Hurd, is produced within a sustainable operation and is a sustainable product</span></b>\n</p><p>\n- <b><span>Utilizing Hemp Hurd, a byproduct of the Company’s hemp processing operations, adds an additional revenue stream</span></b>\n</p><p>\nGeneration Hemp, Inc. (the “Company”), a Dallas/Fort Worth based, midstream hemp company (OTCQB: GENH), and its wholly-owned subsidiary, GENH Halcyon Acquisition, LLC (collectively the “Company”), today announced that its new Rowdy Rooster Hemp animal bedding line is now available for purchase through Amazon. In efforts to create an environmentally sustainable operation and products, the bedding is created from the hemp hurd byproduct (the woody inner portion of the hemp stalk) that is produced by the Company’s harvested hemp processing operations. The utilization of this byproduct contributes to the Company’s commitment to its ESG program (Environmental, Social, and Corporate Governance) by utilizing the entire plant to offer a compostable, biodegradable, and chemical free bedding product, while adding an additional revenue stream.\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: <a href=\"https://www.businesswire.com/news/home/20211104005364/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211104005364/en/</a></p><p>\nFavored among consumers, hemp hurd animal bedding is one of the healthiest animal bedding materials, as reported in studies. Hemp hurd bedding is more than twice as absorbent as wood shavings to trap waste, it is low dust, and its natural properties are resistant to bacteria, mold, and pests. All these characteristics combine to make hemp hurd animal bedding superior to traditional bedding materials, and Rowdy Rooster’s ultra-fine milling process results in bedding that is also extremely soft.\n</p><p>\nPredominantly imported to the United States, hemp hurd and fiber products have not been as accessible as other materials, which has limited their market exposure. Generation Hemp seeks to leverage the limited market exposure of hemp hurd and position itself as a leader in the market with hemp hurd made and sold within the United States.\n</p><p>\nSenior Vice President of Corporate Development, Melissa Pagen commented, “Of all sales channels, Amazon has been an early mover in providing animal bedding made of hemp hurd, and with the number of product reviews, it’s clear that consumers know that Amazon is a channel where hemp animal bedding can be found. However, there seem to be very few manufacturers to provide this product – and as far as we are aware, no other manufacturer’s products are made in the USA, sourcing their hemp hurd from U.S. farmers. We are so committed to providing a US based product, that even our milling equipment is made in the USA.”\n</p><p>\nHemp animal bedding sells for approximately $2.00 per pound on average, but as high as $10.00 per pound. Based on testimonials, any hesitation of consumers to the price per pound is offset by how long hemp bedding lasts. Rowdy Rooster Hemp animal bedding is selling for a discount at approximately $1.50 per pound but sold in volume units, as is the standard for animal bedding. Currently, Generation Hemp sells Rowdy Rooster Hemp animal bedding in two sizes of bags at 24 L (5 lbs.) and 141 L (24 lbs.), for $7.49 and $35.99, respectively.\n</p><p>\nRowdy Rooster Hemp animal bedding has already begun taking orders on Amazon and its Shopify website and can be purchased here on <b><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazon.com%2FRowdy-Rooster-Hemp-Animal-Bedding%2Fdp%2FB09JYN4HDS%2Fref%3Dsr_1_1%3Fdchild%3D1%26m%3DA7AQJNNIOBJ8T%26marketplaceID%3DATVPDKIKX0DER%26qid%3D1635779749%26s%3Dmerchant-items%26sr%3D1-1&amp;esheet=52521616&amp;newsitemid=20211104005364&amp;lan=en-US&amp;anchor=Amazon&amp;index=1&amp;md5=3f3d0705d7158e534cd41cd6d9aa05b4\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a></b> and on the Rowdy Rooster Hemp website at <b><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Frowdyroosterhemp.com%2F&amp;esheet=52521616&amp;newsitemid=20211104005364&amp;lan=en-US&amp;anchor=rowdyroosterhemp.com&amp;index=2&amp;md5=2171b69d3f7de59004e5b97932d4e511\" data-type=\"url\" class=\"tr-link\" translate=\"no\">rowdyroosterhemp.com</a></b>.\n</p><p>\n<b>About Generation Hemp, Inc</b>\n</p><p>\nGeneration Hemp, Inc. is a Dallas/Fort Worth based hemp company that operates in the midstream sector. With operations in Hopkinsville, Kentucky and Denver, Colorado, the company uses its proprietary technology to dry, clean, process and store hemp. In addition, Generation Hemp also owns and leases real estate to companies needing seed storage facilities located within the greater Denver area.\n</p><p>\n<b>Forward Looking Statements</b>\n</p><p>\nThis press release may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. The use of words such as “believes,” “expects,” “anticipates,” “intends,” “plans,” “estimates,” “projects,” “forecasts,” “proposes,” “should,” “likely” or similar expressions, indicates a forward-looking statement. These statements and all the projections in this press release are subject to risks and uncertainties and are based on the beliefs and assumptions of management, and information currently available to management. The actual results could differ materially from a conclusion, forecast or projection in the forward-looking information. The identification in this press release of factors that may affect the company’s future performance and the accuracy of forward-looking statements is meant to be illustrative and by no means exhaustive.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211104005364r1&amp;sid=ucdp4&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTA0MDA1MzY0cjEmc2lkPXVjZHA0JmRpc3Rybz1ueCZsYW5nPWVu&amp;key=4f787a4d0efc116d866c2363a9b2586d60197d46785db083e4fd273235ad207297e064b5c135d4cc0eeb22819d271d23f36b61af7ebb3df979b3e69349165aa7\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211104005364/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211104005364/en/</a></span></p><p>\nMelissa M. Pagen\n<br/>Generation Hemp, Inc.\n<br/>Phone: (310) 628-2062\n<br/>Email: <b><a href=\"mailto:mpagen@genhempinc.com\" data-type=\"email\" translate=\"no\">mpagen@genhempinc.com</a></b>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: TX-GENERATION-HEMP</p></div>"}