{"date": "2022-02-11 10:51:11.784000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3223.79, "close": 3065.87}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_l6pw5zu0&amp;referenceId=tag:reuters.com,2022:newsml_OVFY8J3IJ_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_l6pw5zu0&amp;referenceId=tag:reuters.com,2022:newsml_OVFY8J3IJ_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: Amazon.com on Thursday informed staff at its U.S. warehouses and logistics sites that they must report being fully vaccinated by March 18 if they wish to receive paid leave due to COVID-19. Gloria Tso reports.<br/>Short Link: <a href=\"https://refini.tv/3BezV7t\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3BezV7t</a><br/><br/>Video Transcript:<br/><br/>Amazon will soon allow its US employees to work without a face mask, and to go on paid COVID-19 leave, but only if they're fully vaccinated. In a message to workers shared with Reuters, Amazon said staff could work without a face mask if local regulations allow, and employees must be fully vaccinated by March 18 in order to get paid leave due to COVID-19. The online retailer attributed its policy updates to a recent decline in coronavirus cases across the country, rising vaccination rates, and public health guidance, calling it a positive sign for returning to normal operations. Amazon's COVID-19 protocols have faced scrutiny throughout the pandemic. Amazon is America's second-biggest private employer behind Walmart, with over 1.6 million full and part-time workers worldwide at the end of last year. The retailer's paid leave change does not affect workers who have received a religious or medical exemption from vaccination. The company said unvaccinated employees without an exemption can take unpaid time off for a week of COVID-19 isolation.<br/></span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}