{"date": "2021-12-07 16:54:10.922000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>CINEDIGM CORP (\"CIDM-Q\")\n- Signs Deal With Live Video Streaming Service SideStream\n\n   Cinedigm, the leading independent streaming company super-serving\nenthusiast fan bases, announced today that the Company will release some of\ntheir most popular titles on the new streaming service SideStream. The\nservice is an interactive social video platform for movie lovers, which\nallows for commentary and live discussions throughout the film. With a\nunique transactional model, SideStream has caught the eye of industry giant\nGoogle's Android TV, who recently awarded a development grant to the social\nviewing platform via its inaugural \"Innovations Initiative.\"\n\n(figure class=\"image\")(/figure)     SideStream is expected to launch a\ncollection of Cinedigm's top-performing films when the platform makes its\ndebut in February 2022. Including:\n\n*  The Call: From the creator of Final Destination, Lin Shaye and Tobin\nBell star in this spine-tingling horror hit.\n*  Highlander: The Movie: Even 35 years after its release, the cult classic\ncontinues to be a favorite with audiences thanks to its masterful\nstorytelling and quotable one-liners.\n*  Short Term 12: The intensely powerful film features Academy Award?\nWinners Brie Larson &amp; Rami Malek, as well as Golden Globe Award? Nominee\nKaitlyn Dever.\n*  River Runs Red: Taye Diggs and John Cusack lead an all-star cast in the\ntimely action thriller about a father desperate to uncover the truth about\nhis son's death.\n\n   \"As catalog continues to be a key revenue driver for TVOD, Cinedigm\nlooks for new and unique ways to drive revenue for the Company's library,\nwhich includes forward-thinking social engagement opportunities for our\npremium films,\" said Kali Turja, Executive Director of Digital Sales at\nCinedigm. \"The dynamic ability of the SideStream app allows audiences to\nshare and experience their favorite films with friends and followers.\nCinedigm is thrilled to be a launch partner of SideStream, a company at the\nforefront of the next wave of social cinema.\"\n\n   An innovator in the digital transformation of the entertainment industry\nfor more than two decades, Cinedigm's core mission is to entertain the\nworld by building the world's best portfolio of enthusiast channels and\nservices for the streaming generation. Through a diverse mix of premium\nSVOD services and dedicated AVOD and FAST channels, Cinedigm's streaming\nportfolio reaches indie film (Fandor), horror (Screambox &amp; Bloody\nDisgusting) and family entertainment (Dove Channel), as well as dedicated\nchannels for iconic entertainers, led by Bob Ross (The Bob Ross Channel).\nCinedigm's ultimate goal is to build destinations that immerse viewers in\ncontent they love while staying at the forefront of technology as the\nstreaming industry continues to evolve.\n\n   About Cinedigm:\nFor more than 20 years, Cinedigm (NASDAQ:CIDM) has led the digital\ntransformation of the entertainment industry. Today, Cinedigm entertains\nconsumers around the globe by providing premium feature film and television\nseries, enthusiast streaming channels and technology services to the\nworld's largest media, retail and technology companies. As a leader in the\nrapidly evolving streaming ecosystem, Cinedigm continues its legacy as an\ninnovator through its adoption of next-generation technologies, such as\nartificial intelligence and machine learning, through its proprietary,\nhighly-scalable Matchpoint(TM) technology platform. For more information,\nvisit www.cinedigm.com.\n\n   Cinedigm uses, and will continue to use, its website, press releases,\nSEC filings, and various social media channels, including Twitter (Cinedigm\nTwitter), LinkedIn (Cinedigm LinkedIn), Facebook (Cinedigm Facebook),\nStockTwits (Cinedigm Stocktwits) and the Company website (www.cinedigm.com)\nas additional means of disclosing public information to investors, the\nmedia and others interested in the Company. It is possible that certain\ninformation that the Company posts on its website, disseminated in press\nreleases, SEC filings, and on social media could be deemed to be material\ninformation, and the Company encourages investors, the media and others\ninterested in the Company to review the business and financial information\nthat the Company posts on its website, disseminates in press releases, SEC\nfilings and on the social media channels identified above, as such\ninformation could be deemed to be material information.\n\n   About SideStream:\nSideStream is a live-streaming platform where anyone can watch movies with\nfriends and followers for fun or for profit. Iterating on the success of\nplatforms such as Twitch and YouTube and the increased popularity of\ntransactional content services like Cameo and Master Class, and the growing\nbuzz around apps like Clubhouse - SideStream provides access to commentary\nand discussion appealing to social communities of all sizes. Now,\ninfluencers of all sizes can legally watch premium studio movies while\nearning a revenue share of each ticket they sell. With distribution\nagreements from the likes of Universal Pictures and Cinedigm Entertainment,\nSideStream's model was further validated when Google's Android TV\nrecognized their ground-breaking approach by accepting SideStream into its\ninaugural Innovation Initiative. This highly selective, global program\nseeds developers with resources that help them bring a shared vision for\ncommunication and entertainment to life.\n\n   SideStream is a joint partnership co-founded by CEO Neal Tiles and Chief\nProduct Officer Kevin Pereira. Tiles is an award-winning creative executive\nand strategist with more than two decades of experience in entertainment,\nholding executive roles at ESPN/Disney, Fox Broadcasting, DirecTV and\nComcast/NBCU, and devising content, marketing, and development strategies\nfor Pluto TV, VENN, IGN, and Tribune Media. Kevin Pereira is a\nmulti-talented producer and personality, experienced in traditional and\ndigital media, and live-streaming. He is the founder of Super\nCreative-producing content for Disney, Sony, Amazon, and more-and has\nhosted series and specials on G4, as well as the popular how-to series\n\"Hack My Life\" on HBOMax. Email info@sidestream.com for inquires and\nfurther information.\n\nDKC Public Relations\ncinedigm@dkcnews.com\n\nHigh Touch Investor Relations\nCinedigm@htir.net\n\nTel   : 212-206-8600    CINEDIGM CORP\nEmail : jcalcaterra@cinedigm.com\nWWW   : <a href=\"https://www.cinedigm.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.cinedigm.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134000414.MNPRE2134002489-08513220211207</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}