{"date": "2021-12-16 17:59:54.380000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3466.3, "close": 3400.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>TEJON RANCH CO (\"TRC-N\")\n- Sustainable Prefabricated Custom Home Builder to Expand\n- Operations to Tejon Ranch\n\n     Tejon Ranch Co. announced it has closed on the sale of 17.1 acres of\nland on the east side of the Tejon Ranch Commerce Center to Scannell\nProperties, a privately-held real estate development and investment company\nthat focuses on build-to-suit and speculative development of industrial,\noffice and multifamily facilities throughout the U.S., Canada and Europe.\nThere, Scannell will build an approximately 270,000-square-foot\nmanufacturing facility for Rialto, CA-based Plant Prefab.\n\n     This new factory - Plant Prefab's third - will serve as the company's\nfirst automated facility and regional production hub, and will be\npurpose-built to efficiently manufacture custom-prefabricated panelized and\nmodular building components. The hub facility will allow for the full\nindustrialization of Plant Prefab's patented Plant Building System(TM)?,\nwhich combines advanced engineering with specialized Plant Panels(TM)? and\nPlant Modules(TM)? to build custom housing 20 to 50 percent faster than\ntraditional building methods with up to 30 percent less waste at a 10 to 25\npercent cost savings in labor-constrained markets.\n\n     \"The Tejon Ranch Commerce Center is an outstanding location - with its\nefficient access to the interstate and strategic location between Los\nAngeles and the Bay Area, combined with the efficiencies that will be\ndriven by the state-of-the-art facility, Plant Prefab will be able to\nexpand its reach to the entire Western U.S.,\" said Jacob Holdeman with\nScannell Properties. \"They are establishing their flagship facility in a\nlocation that represents a strong value proposition when compared to the\nInland Empire and joining an area that is expected to continue growing for\ndecades.\"\n\n     Steve Glenn, Founder and CEO of Plant Prefab, stated, \"Opening the hub\nfacility will be a critical milestone that will move Plant Prefab into the\nnext phase of our evolution, enabling us to construct architectural,\nsustainable housing more time and cost efficiently, and at higher volumes\nthan we could previously. It will also allow us to expand into larger\ndwelling formats including large-scale student, affordable and market-rate\nhousing to serve a wider universe of clients including real estate,\nhospitality, and corporate developers. This represents a significant step\ntoward our ultimate goal of helping to address critical housing issues in\nsupply- and labor-constrained markets.\"\n\n     Plant Prefab's design and estimating teams are now engaging projects\nfor the new facility, which expects to begin production in January 2023.\nThe launch of the hub will be well timed to help Plant Prefab accommodate\nrising demand from a growing list of clients, as production contracts have\ngrown by more than 175 percent in the past year alone. Looking ahead, Plant\nPrefab expects to replicate its hub-and-spoke production model, allowing it\nto scale efficiently to meet demand across urban infill markets in other\nregions across the country - including the East Coast - that are similarly\nwell located and primed to serve large populations.\n\n     Joseph N. Rentfro, Tejon Ranch Co.'s Executive Vice President of Real\nEstate, added, \"Along with the County of Kern, which awarded Plant Prefab\nan incentive under the Advance Kern Initiative, we look forward to\nwelcoming this innovative company to Tejon Ranch, as we share their\ncommitment to helping address California's housing crisis in an efficient,\nsustainable way. This investment by Scannell Properties, which can - and\ndoes - invest all over the world, is further evidence of the strength and\nappeal of our location. All of our existing industrial space is 100% leased\nand 100% occupied, and we're making good progress on a +/-\n630,000-square-foot speculative industrial facility we're building in\npartnership with Majestic Realty Co., as we look to meet the demand we're\nseeing out of Southern California and elsewhere for warehouse,\ndistribution, and now, advanced manufacturing facilities, with Plant\nPrefab's new manufacturing hub serving as an example of the type of\nbusiness identified as a targeted sector for business development in Kern\nCounty by the B3K endeavor.\"\n\n     Tejon Ranch Co. is a participant in B3K Prosperity, a collaboration\namong business, government and civic stakeholders in Bakersfield and Kern\nCounty, whose purpose is to create and deliver a joint strategy and\ninvestment plan for regional economic growth and opportunity.\n\n     JLL's Mac Hewett and Mike McCrary represented all parties in the\ntransaction.\n\n     About Tejon Ranch Commerce Center\n\n     The Tejon Ranch Commerce Center is located at the junction of\nInterstate 5 and Highway 99, approximately 40 minutes north of Santa\nClarita. The 1,450-acre industrial/commercial complex is already home to\nmajor distribution centers for Camping World, Caterpillar, Dollar General,\nFamous Footwear, IKEA, L'Oreal USA's professional salon distribution\ncompany, SalonCentric, and TransformCO.\n\n     About Tejon Ranch Co.\n\n     Tejon Ranch Co. (NYSE: TRC) is a growth-oriented, fully diversified\nreal estate development and agribusiness company, whose principal asset is\nits 270,000-acre land holding located approximately 60 miles north of Los\nAngeles and 30 miles south of Bakersfield. Tejon Ranch Co. is positioned\nfor growth with its fully operational commercial/industrial real estate\ndevelopment and three master planned residential communities on the\nhorizon.\n\n     About Scannell Properties\n\n     Scannell Properties is a privately held real estate development and\ninvestment company that focuses on build-to-suit and speculative\ndevelopment of industrial, office, and multifamily facilities throughout\nthe U.S., Canada and Europe. Since its inception in 1990, Scannell\nProperties has completed over 450 development projects totaling 114 million\nSF. The value of all their projects is estimated at over $5 Billion.\nwww.scannellproperties.com\n\n     About Plant Prefab\n\n     Plant Prefab is the first Certified B Corporation(TM) building\ntechnology company dedicated to sustainable design, materials, and\noperations. The company's patented Plant Building System(TM) utilizes\nadvanced digital modeling and fully customizable Plant Panels(TM) and Plant\nModules(TM) to help architects, developers, general contractors, and\nindividuals design and build multifamily and custom single-family homes 20\nto 50 percent faster than site-based methods. The system provides better\nquality control, design flexibility, and time, cost, and material\nefficiency than any other method of offsite or on-site construction. With a\nmission to build a better world by design, Plant Prefab was the first\nhousing prefabricator to announce a net zero goal and actually achieved\ncarbon neutrality in their operations in 2020. Plant Prefab is backed by\nleading investors including Amazon, Asahi Kasei, Gerdau Paris Ventures,\nObvious Ventures, and others. For more information, visit plantprefab.com.\n\n Contact Information:\n\nCONTACT:\nBarry Zoeller, Sr. VP, Corporate Communications &amp; Investor Relations\n(661) 663-4212\nbzoeller@tejonranch.com\n\nTel   : 661-248-3000    TEJON RANCH CO\nEmail : bzoeller@tejonranch.com\nWWW   : <a href=\"http://www.tejonranch.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.tejonranch.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134900510.MNPRE2134902524-09245520211216</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}