{"date": "2021-11-15 08:10:03+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n      Thousands of deals will be available for customers starting on Thursday, November 25, including deep discounts on select TVs, Alexa-enabled devices, and must-have toys.\n    </div>\n              <div>\n                <p>\n        This year, <span><a href=\"https://www.amazon.com/blackfriday\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon's 48-hour Black Friday event</a></span>will offer more deals than ever before, featuring products from well-known brands and companies to small businesses and independent artisans. Plus, customers have access to expertly curated guides to help them find the perfect gifts for family and friends this holiday season.\n      </p>\n                <p>\n        Starting on Thursday, November 25, customers can start shopping thousands of deals that include new gadgets and electronics from Samsung, kid-favorite toys and baby essentials from Mattel and Cybex gb Pockit strollers, and must-have home and kitchen items from Instant Pot. Other deals include seasonal fashion finds, like rag &amp; bone clothing from Shopbop, and beauty favorites from Sunday Riley, OPI, and Color Wow.\n      </p>\n                <p>\n        The event will also feature thousands of deals from Amazon's independent selling partners, most of which are small and medium-sized businesses, including deals from women-owned, military family-owned, and Black-owned businesses. To support small while you save, visit our gift guides highlighting <span><a href=\"http://www.amazon.com/smallbusinessgiftguide\" data-type=\"url\" class=\"tr-link\" translate=\"no\">small businesses</a></span>, <span><a href=\"http://www.amazon.com/handmadeholiday21\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Handmade</a></span>, and <span><a href=\"http://www.amazon.com/Launchpad-GiftHub\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Launchpad</a></span>.\n      </p>\n                <div>\n                  <div>\n                    <span>Investing in Our Team</span>\n                  </div>\n                  <div>\n          Amazon employees come together to deliver joyful experiences for customers year-round, and the company recently announced it is hiring for an additional 125,000 full- and part- time positions and 150,000 seasonal jobs.<br/><br/>\n           These jobs offer an average starting pay of $18 per hour, sign-on bonuses of up to $3,000, and an additional $3 per hour depending on shifts in many locations. Our employees are the heart and soul of Amazon, which is why the company has spent more than $15 billion across its fulfillment network to help keep employees safe and deliver products to customers.\n        </div>\n                </div>\n                <p>\n        Customers looking for inspiration can also shop from Amazon's largest selection of <span><a href=\"http://www.amazon.com/gifts\" data-type=\"url\" class=\"tr-link\" translate=\"no\">gift guides</a></span>, including favorites like <span><a href=\"http://www.amazon.com/StockingStufferGifts\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Stocking Stuffers</a></span>, <span><a href=\"https://www.amazon.com/customersmostlovedgifts\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Customers' Most Loved</a></span>, and <span><a href=\"http://www.amazon.com/holidaytoylist\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Holiday Toy List</a></span>, along with guides focused on <span><a href=\"https://amazon.com/techgifts\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Electronics</a></span>, <span><a href=\"http://www.amazon.com/fashiongiftguide\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Fashion</a></span>, and <span><a href=\"http://www.amazon.com/HolidayBeautyGiftGuide\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Beauty</a></span>. Newly released gift guides include <span><a href=\"http://www.amazon.com/oprah\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Oprah's Favorite Things</a></span>, <span><a href=\"http://www.amazon.com/ExpertsGiftPicks\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Expert Picks Gift Guide,</a></span>and the Luxury Stores Gift Guide.\n      </p>\n                <h4>\n        Preview Amazon's 2021 Black Friday deals\n      </h4>\n                <p>\n        Check out this sneak peek of top deals you can expect to find during Amazon's 2021 Black Friday event to help find your favorite items and gifts. Then mark your calendars to <span><a href=\"https://www.amazon.com/blackfriday\" data-type=\"url\" class=\"tr-link\" translate=\"no\">start shopping during the event on November 25 and November 26</a></span>.\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <strong>Holiday toy list:</strong> Save on dolls, toys, and accessories from L.O.L. Surprise!, PAW Patrol, Bluey, Little Tikes, Fisher-Price, Barbie, Hot Wheels, and more. Save up to 30% on party games from Cards Against Humanity and gifts from Disney, Marvel, DC, and PJ Masks.\n        </li>\n                  <li>\n                    <strong>Seasonal fashion:</strong> Save on a selection of footwear, apparel, accessories, and best sellers, including up to 40% on Levi's for the family and up to 30% on adidas. Save up to 25% on select Fall Fashion styles from Shopbop, including rag &amp; bone, Frame, and Mother Denim. Save up to 25% on a Made For You custom T-shirt, and up to 30% on Staples by The Drop. Plus, shoppers save $10 when they spend $50 on their first order from Prime Try Before You Buy, and both new and existing customers save $10 when they spend $50 with Personal Shopper by Prime Try Before You Buy (terms and conditions apply).\n        </li>\n                  <li>\n                    <strong>Home entertaining and décor:</strong> Save up to 40% on Instant Brands kitchen appliances. Save up to 43% on robot, cordless, and upright vacuums from Shark. Save up to 30% on air purifiers from Levoit and Coway. Save up to 15% on select furniture.\n        </li>\n                  <li>\n                    <strong>Electronics:</strong> Save up to 30% on select TVs from Samsung, Sony, and LG. Save on select headphones from Bose, Sony, and Beats. Save up to 29% on Garmin watches and navigation products. Save up to 30% on select desktops, laptops, monitors, and tablets. Receive a $50 Amazon promotional credit with the purchase of Oculus Quest 2. Save $40 with the purchase of FlashForge Adventurer 3 Lite 3D Printer.\n        </li>\n                  <li>\n                    <strong>Beauty:</strong> Save $50 on Sunday Riley Mini Vault Skincare Collection, an Amazon exclusive.Save up to 30% on lash serums and hair sprays from Grande Cosmetics and Color Wow. Save up to 40% on grooming appliances from Braun and Panasonic. Save up to 50% on Waterpik.\n        </li>\n                  <li>\n                    <strong>Amazon brands:</strong> Save up to 30% on men's and women's fashion. Save up to 30% on tech accessories and home products. Save up to 35% on fitness and wellness essentials. Save up to 40% on pet food from Wag. Save up to 20% on baby products from Mama Bear.\n        </li>\n                  <li>\n                    <strong>Amazon Devices:</strong> Save up to 42% on select Alexa-enabled devices including Echo Show 5 (2nd Gen) Kids, Echo Buds (2nd Gen) with wired case, and Echo Frames (2nd Gen). Save up to 30% on Amazon Fire TV 50\" 4-Series. Save up to 30% on the Kindle Oasis. Save up to 50% on the Fire TV Stick 4K. Save up to 50% on select Fire HD tablets. Save up to 30% on Blink video Doorbell. Save $20 on the Luna Controller.\n        </li>\n                  <li>\n                    <strong>Tools, garden, and automotive:</strong> Save up to 30% on select DEWALT tools. Save up to 31% on select generators from DuroMax. Save up to 30% on select AeroGarden indoor gardens. Save up to 30% on select auto parts and accessories.\n        </li>\n                  <li>\n                    <strong>Sports and outdoors:</strong> Save up to 30% on select Coleman and Marmot equipment. Save up to 30% on select Team Sports products.\n        </li>\n                  <li>\n                    <strong>Entertainment:</strong> Saveup to 50% on <span><a href=\"http://www.amazon.com/primememberdeals\" data-type=\"url\" class=\"tr-link\" translate=\"no\">select Prime Video</a></span>movies to rent or buy, from new releases to classics, plus hit TV shows, seasonal content, and more. And save with Amazon Music Unlimited, free for three months for new customers, or free for six months with the purchase of select Amazon Echo devices. Readers can also <span><a href=\"https://www.amazon.com/b/?node=11552285011\" data-type=\"url\" class=\"tr-link\" translate=\"no\">save up to 80%</a></span>on 100+ best sellers on Kindle, <span><a href=\"https://www.amazon.com/b?node=13245867011&amp;ref=apubna_da_gr_10004_hz_ml_sa_2112\" data-type=\"url\" class=\"tr-link\" translate=\"no\">50% or more</a></span>on select Kindle Exclusive titles, <span><a href=\"https://arborist-na.amazon.com/us/stores/23654166011\" data-type=\"url\" class=\"tr-link\" translate=\"no\">up to 50%</a></span>on Amazon exclusive print titles, and <span><a href=\"https://www.amazon.com/deal/4b6ccf91?showVariations=true\" data-type=\"url\" class=\"tr-link\" translate=\"no\">up to 30%</a></span>on children's books.\n        </li>\n                  <li>\n                    <strong>Virtual travel and experiences:</strong> Save up to 50% on all Amazon Explore experiences, hosted by local experts, U.S. customers have access to a wide range of livestreamed, interactive experiences across the globe-all from the comfort of their homes. Customers can shop unique items, learn how holidays are celebrated around the world, and gift experiences to their friends and family.\n        </li>\n                </ul>\n                <div>\n                  <div>\n                    <span>Fast and efficient delivery over the holidays</span>\n                  </div>\n                  <div>\n          Amazon continues to invest in technology, aircraft, ships, and buildings to ensure it has the products customers want and need throughout the season. We're also putting more selection in fulfillment centers closer to customers, which is possible because of the sophisticated and innovative network we've built over 20 years. These improvements mean customers can continue to rely on fast and efficient delivery throughout the holiday season and beyond.\n        </div>\n                </div>\n                <h4>\n        Find fast, free, and convenient delivery options\n      </h4>\n                <p>\n        Now that you've got your eye on a few deals, find out how you can get them shipped quickly and conveniently this season through the services below.\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <strong>Free One-Day and Same-Day delivery:</strong> Prime members in the U.S. can shop a selection of over 10 million items eligible for Prime Free One-Day Delivery with no minimum purchase, and millions of items are available for Free Same-Day Delivery in 47 major metropolitan areas. Prime members can also shop over 3 million items available for delivery in as fast as five hours with faster Same-Day Delivery-now available in 15 cities. These fast delivery options are not only convenient for customers, but they're better for the planet. Same-Day deliveries ship from local fulfillment centers, so the items travel shorter distances and generate less carbon emissions. This is just another way Amazon is reducing the impact of climate change on future generations by building a sustainable business. <span><a href=\"https://www.amazon.com/b?node=15247183011\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Learn more about Prime Delivery</a></span>or <span><a href=\"http://www.amazon.com/prime\" data-type=\"url\" class=\"tr-link\" translate=\"no\">start a free 30-day trial of Prime</a></span>.\n        </li>\n                  <li>\n                    <strong>Ultrafast grocery delivery and pickup:</strong> Prime members in more than 5,000 cities and towns have access to two-hour grocery delivery on more than 170,000 products from Whole Foods Market and Amazon Fresh. With Amazon Fresh, Prime members get free two-hour delivery, plus free grocery pickup at select Amazon Fresh stores on orders over $35. Prime members can also find toys, gifts, household products, everyday essentials, electronics, Amazon devices, and more at Amazon Fresh. Prime members get free pickup on orders over $35 from Whole Foods Market stores nationwide.\n        </li>\n                  <li>\n                    <strong>Delivery where it's needed most:</strong> Whether customers are road-tripping to see family, staying home and need a secure delivery location, or sending a gift to a loved one or friend, Amazon provides thousands of package pickup locations for customers. These locations are conveniently located near or in offices, convenience stores, malls, apartment buildings, and grocery stores, in more than 900 cities and towns across the U.S. Tens of millions of products can be easily and conveniently delivered to an Amazon pickup point at Whole Foods Market, 7-11, Chase Bank, Rite-Aid, HealthMart, GNC, Stage Stores, and other locations. <span><a href=\"http://www.amazon.com/hub\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Find a location near you</a></span>.\n        </li>\n                  <li>\n                    <strong>Extended returns window:</strong> Most of the items purchased between October 1, 2021, and December 31, 2021, can be returned until January 31, 2022.\n        </li>\n                </ul>\n                <p>\n        As we all wait for the big day, get prepared with <span><a href=\"https://www.aboutamazon.com/news/retail/amazon-shopping-tips\" data-type=\"url\" class=\"tr-link\" translate=\"no\">tips on how to shop and save on Amazon</a></span>this season, and learn more about <span><a href=\"http://www.amazon.com/holidaydelivery\" data-type=\"url\" class=\"tr-link\" translate=\"no\">holiday delivery</a></span>.\n      </p>\n              </div>\n              <div>\n                <div>\n        Related Tags\n      </div>\n                <div>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/holiday\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Holiday</a>\n                  </span>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/shopping\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Shopping</a>\n                  </span>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/retail\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Retail</a>\n                  </span>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/retail/preview-some-of-amazons-top-black-friday-deals-for-2021\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>15 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>15 November 2021 08:10:03 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}