{"date": "2021-11-22 08:01:00.179000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwlistdisc{list-style-type:disc;}.storyContent .bwuline{text-decoration:underline;text-decoration-color:inherit;}</style><p class=\"bwalignc\">\n<b>Amazon Customers Can Shop and Save on Thousands of Deals During Cyber Monday Weekend</b>\n</p><p class=\"bwalignc\">\n<span>Amazon will kick off its Cyber Monday deals weekend on Saturday, November 27, by offering customers more deals and deep discounts on must-have items for the gifting season</span>\n</p><p class=\"bwalignc\">\n<span>Throughout the weekend and on Cyber Monday, customers will find savings on top gifts and products from brands like Ninja, Bose, Sony, Calvin Klein, LEGO, and select Alexa-enabled devices, as well as deals from small businesses, including women-owned, Black-owned, and military family-owned businesses, and from Amazon Handmade artisans and innovative Amazon Launchpad startups</span>\n</p><p class=\"bwalignc\">\n<span>Plus, Prime members get 30 minutes of early access to the hottest Lightning Deals on Amazon throughout the holiday season before they are gone—as well as fast, free, and convenient delivery options</span>\n</p><p>\n(NASDAQ:AMZN)—Mark your calendars for a weekend of savings. Amazon today revealed a sneak peek of the thousands of deals customers can shop during its Cyber Monday deals weekend, which kicks off on Saturday, November 27, and runs through Monday, November 29. Throughout the deals event, customers can score incredible savings across every category, as well as deep discounts on popular products and must-have items including electronics from Samsung and LG, home and kitchen essentials from Shark, Vitamix, and Cuisinart, must-have toys from Hasbro, LEGO, and Crayola, beauty favorites from Revlon, top fashion picks from Ray-Ban, and select Alexa-enabled devices like the Amazon Fire TV 50” 4-Series. All weekend long, customers can also shop thousands of amazing deals from independent selling partners, most of which are small and medium-sized businesses, including deals from women-owned, Black-owned, and military family-owned businesses.\n</p><p>\n<b><span class=\"bwuline\">Gifting Inspiration</span></b>\n</p><p>\nFor customers who need a little extra inspiration on what to gift their loved ones this year, Amazon has you covered. All throughout the season customers can continue to shop and discover items from Amazon’s biggest selection of gift guides yet—including the popular <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fholidaytoylist&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=Holiday+Toy+List&amp;index=1&amp;md5=f5664e64321b6de02135b945323cb556\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Holiday Toy List</a> and <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Foprah&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=Oprah%26%238217%3Bs+Favorite+Things&amp;index=2&amp;md5=0a2bd826217a556985c760e6f409f8fb\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Oprah’s Favorite Things</a> list, as well as the curated <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazon.com%2Fcustomersmostlovedgifts&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=Customers%27+Most-Loved+Gifts&amp;index=3&amp;md5=855e7690a10cc82d0dccdbfe6a24586c\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Customers' Most-Loved Gifts</a> guide and <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2FExpertsGiftPicks&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=Experts%27+Gift+Picks&amp;index=4&amp;md5=8b655ed3f03b4fc325a2db84d87ebae8\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Experts' Gift Picks</a> gift guide, which features top picks from A-list celebrities like Jessica Alba, Jojo Siwa, gold medalist Suni Lee and influencer duo Aint Afraid, and media outlets including BuzzFeed and Refinery29, among others.\n</p><p>\nOn Cyber Monday, Amazon Live will hold various livestream events showcasing a curated selection of the best deals, product demonstrations, try-on hauls, and live chats hosted by celebrities and influencers, including supermodel and entrepreneur Miranda Kerr, country singer and songwriter Jessie James Decker, and fashion influencer Aimee Song. Viewers can easily shop featured products and brands through a carousel that updates in real-time. To watch, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Flive&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=amazon.com%2Flive&amp;index=5&amp;md5=abef56e90d051c83a9f1bbbdea1cc99b\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/live</a> or the Amazon Live Shopping app on Fire TV.\n</p><p>\n<b><span class=\"bwuline\">Cyber Monday Deals Preview</span></b>\n</p><p>\nBelow is a sampling of top deals and products that will be available at various dates and times between Saturday, November 27, and Monday, November 29, while supplies last. Customers can shop Cyber Monday deals at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazon.com%2Fcybermonday&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=amazon.com%2Fcybermonday&amp;index=6&amp;md5=8b792b108363288c60ed3e3af61c70e9\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/cybermonday</a>, on the Amazon shopping app, or by asking, “Alexa, what are my deals?” Select Cyber Monday deals will also be available at all Amazon 4-star store and Amazon Books store locations. Prime members also can enjoy 30 minutes of early access to the hottest Lightning Deals on Amazon throughout the holiday season, and every day.\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\n<b>Toys and Games: </b>Save up to 30% on select building sets, including from LEGO and Playmobil. Save up to 30% on Hasbro games. Save up to 30% on arts and crafts toys from Crayola and other brands. Save up to 30% on select board games including Catan and Ticket to Ride. Save up to 30% on Osmo educational kits and games. Save up to 30% on Learning Resources and Educational Insights learning toys.\n</li>\n<li>\n<b>Seasonal Fashion: </b>Save up to 40% on select Orolay down jackets and parkas.<b> </b>Save up to 30% on select Crocs. Save up to 30% on select True &amp; Co. bras and underwear. Save up to 30% on select Ray-Ban sunglasses. Save up to 20% on select outerwear from Calvin Klein, Tommy Hilfiger, DKNY, and more. Save up to 25% on a Made For You custom t-shirt. Save up to 25% on select active and lounge styles from Shopbop, including Honeydew Intimates, Z Supply, and Alala.\n</li>\n<li>\n<b>Home and Kitchen: </b>Save up to 35% on select Instant Pot appliances, and select cookware and kitchen essentials from All-Clad, Ninja, Vitamix, Calphalon, Cuisinart, and SodaStream.<b> </b>Save up to 31% on select iRobot Roomba vacuums, select air purifiers from Blue Air and Coway, and sewing machines from Brother and Singer. Save up to 30% on select furniture.\n</li>\n<li>\n<b>Electronics: </b>Save up to 33% on select TVs from Samsung, Sony, and LG. Save on select headphones from Bose, Sony, and JBL. Save up to 30% on select HP monitors, laptops, and all-in-one desktops. Save up to 34% on select Nixplay digital picture frames. Save $20 on select Nintendo Switch Pro controllers. Save 25% on the MYNT3D Professional Printing 3D Pen.\n</li>\n<li>\n<b>Beauty and Personal Care: </b>Save up to 50% on select electric toothbrushes from Oral-B and Philips Sonicare. Save up to 39% on electric shavers, razors, and blades from Braun, Gillette, and more. Save up to 30% on hair care from Revlon, Bed Head, and other brands. Save up to 52% on 23andMe Personal Genetic Service DNA Test Kits.\n</li>\n<li>\n<b>Amazon Brands: </b>Save up to 30% on Amazon Basics kitchen products. Save up to 30% on clothing for kids and babies from Our Brands. Save up to 30% on coffee from Our Brands.\n</li>\n<li>\n<b>Amazon Devices: </b>Save up to 47% on the Echo Show 5. Save up to 45% on Amazon Halo Band fitness tracker. Save up to 40% on Kindle and up to 28% on Kindle Paperwhite Kids. Save up to 40% on Fire HD 10 Kids Pro tablet. Save up to 36% on the Fire TV Stick 4k Max. Save up to 30% on Amazon Fire TV 50” 4-Series.\n</li>\n<li>\n<b>Home Improvement, Tools, and Garden:</b> Save up to 30% on select BLACK+DECKER tools. Save on select tools from DEWALT, GEARWRENCH, and SKIL. Save 25% on select Level Home smart locks. Save up to 40% on select spas and pools from Bestway and more.\n</li>\n<li>\n<b>Baby: </b>Save on select baby essentials from Philips Avent. Save on select feeding products from Dr. Brown’s such as bottles and pacifiers. Save on select Cybex gb Pockit strollers. Save up to 30% on select Britax car seats. Save 25% on select Safety 1<sup>st</sup> Grow and Go car seats. Plus, save on select items from Joovy this holiday season.\n</li>\n<li>\n<b>Pets: </b>Save 30% on select pet gifts and supplies, including toys, treats, beds, and crates.<b> </b>Save up to 25% on select Bissell pet care items. Save 20% on Petmate Husky Dog House for dogs up to 90 pounds. Receive a free sample of Greenies new supplement product, while supplies last.\n</li>\n<li>\n<b>Sports and Outdoors:</b> Save up to 30% on select Nalgene Sustain water bottles. Save up to 30% on select Weider Platinum Strength products. Save up to 30% on select CamelBak bottles and accessories. Save up to 30% on select electric scooters, bike racks, and stands from Segway, Hover-1, and more.\n</li>\n<li>\n<b>Entertainment: </b>Save up to 50% on <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fprimememberdeals&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=select+Prime+Video&amp;index=7&amp;md5=ce40788b00c7bc5951a84f0e34590b51\" data-type=\"url\" class=\"tr-link\" translate=\"no\">select Prime Video</a> movies to rent or buy, from new releases to classics, plus hit TV shows, seasonal content, and more. Plus, new customers get 50% off this season’s NBA League Pass and NBA Team Pass subscription following a seven-day free trial. Save with Amazon Music Unlimited, free for three months for new customers, or free for six months with the purchase of select Amazon Echo devices. Plus, customers can listen to their favorite Wondery podcasts with 40% off a one-year subscription to Wondery+. Save up to 59% on a new annual membership to <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.imdbpro.com%2F&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=IMDbPro&amp;index=8&amp;md5=5cf36ff6ea502d309dcfbed6447e27c2\" data-type=\"url\" class=\"tr-link\" translate=\"no\">IMDbPro</a>. Readers can save up to 80% on <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazon.com%2Fb%2F%3Fnode%3D11552285011&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=popular+eBooks&amp;index=9&amp;md5=c6744f8530dbfb5039846b773d186e98\" data-type=\"url\" class=\"tr-link\" translate=\"no\">popular eBooks</a>, up to 50% on select <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazon.com%2Fb%3Fnode%3D20611076011%26ref%3Dapubna_da_gr_10004_hz_ml_sa_2112&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=Kindle+exclusive+titles&amp;index=10&amp;md5=b1779a5864d19f4f8de1065895fb511f\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Kindle exclusive titles</a>, and up to 30% on <span>Wheel of Time</span> boxed sets.\n</li>\n<li>\n<b>Virtual Travel and Experiences:</b> For those on your list who have everything or are experience seekers, save up to 50% on all Amazon Explore experiences, hosted by local experts. U.S. customers have access to a wide range of livestreamed, interactive experiences across the globe—all from the comfort of their homes. Customers can shop unique items, learn how holidays are celebrated around the world, and gift experiences to their friends and family.\n</li>\n</ul><p>\n<b><span class=\"bwuline\">Shop and Support Small and Medium-Sized Businesses</span></b>\n</p><p>\nAmazon hosts more than 500,000 U.S. independent selling partners, most of which are small and medium-sized businesses, in its store and helps them reach hundreds of millions of customers globally, increase their sales, and create jobs—including an estimated 1.8 million U.S.-based jobs in 2020. Customers can support these small and medium-sized businesses and save on gifts by shopping the <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fsmallbusinessgiftguide&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=Small+Business&amp;index=11&amp;md5=af5673946e47634f4641ec0aeaf327d0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Small Business</a>, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fhandmadeholiday21&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=Amazon+Handmade&amp;index=12&amp;md5=3908c228698bf74c0d1c5e94c5deb63d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Handmade</a> and <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2FLaunchpad-GiftHub&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=Amazon+Launchpad&amp;index=13&amp;md5=9c159bc6a47b679fb38c15577cd21a1f\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Launchpad</a> gift guides, and by visiting <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fsupportsmall&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=amazon.com%2Fsupportsmall&amp;index=14&amp;md5=6ae0e9d5e33e7d55cac31946eb9c3dce\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/supportsmall</a>.\n</p><p>\n<b><span class=\"bwuline\">How Amazon is Delivering this Season</span></b>\n</p><p>\nAmazon employees around the world team up to meet the needs of customers during the holiday season—and every day after. Recently, Amazon announced plans to add 125,000 full- and part-time roles, plus an additional 150,000 seasonal jobs. Employees are the heart and soul of the company, which is why Amazon offers an average starting wage of $18 per hour, sign-on bonuses up to $3,000, and an additional $3 per hour depending on shifts in many locations. In addition to hiring, Amazon has made investments across technology, supply chain planning, transportation, and delivery teams in preparation for the holiday season in an effort to get customers what they want, when they want it, wherever they are. Visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2F&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=About+Amazon&amp;index=15&amp;md5=9ccc05dec56a2f3babf94a1ae71a1b0c\" data-type=\"url\" class=\"tr-link\" translate=\"no\">About Amazon</a> to learn more <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2Fnews%2Foperations%2Famazons-plan-to-serve-customers-this-holiday-season&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=about+Amazon%26%238217%3Bs+plan+to+serve+customers+this+holiday+season&amp;index=16&amp;md5=d837b5320d0d9975ecd25fe8265b4a55\" data-type=\"url\" class=\"tr-link\" translate=\"no\">about Amazon’s plan to serve customers this holiday season</a>.\n</p><p>\n<b><span class=\"bwuline\">Fast, Free, and Convenient Delivery Options</span></b>\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\n<b>Free One-Day and Same-Day Delivery: </b>Prime members in the U.S. can shop a selection of over 10 million items eligible for Prime Free One-Day Delivery with no minimum purchase, and millions of items are available for Free Same-Day Delivery in 47 major metropolitan areas. Prime members can also shop over 3 million items available for delivery in as fast as five hours with faster Same-Day Delivery—now available in 15 cities. These fast delivery options are not only convenient for customers, they’re better for the planet. Same-Day deliveries ship from local fulfillment centers, so the items travel shorter distances and generate less carbon emissions. This is just another way Amazon is reducing the impact of climate change on future generations by building a sustainable business. Learn more at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fprimedelivery&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=amazon.com%2Fprimedelivery&amp;index=17&amp;md5=63e8f022a0aadc533cf5813febe00ec7\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/primedelivery</a> or start a free 30-day trial of Prime at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fprime&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=amazon.com%2Fprime&amp;index=18&amp;md5=9ff90314f71c5608adccdd71d02e9e92\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/prime</a>.\n</li>\n<li>\n<b>Ultrafast Grocery Delivery and Pickup: </b>Prime members in more than 5,000 cities and towns have access to two-hour grocery delivery on more than 170,000 products from Whole Foods Market and Amazon Fresh. With Amazon Fresh, Prime members get free two-hour delivery, plus free grocery pickup at select Amazon Fresh stores on orders over $35. Prime members can also find toys, gifts, household products, everyday essentials, electronics, Amazon devices, and more at Amazon Fresh. Prime members get free pickup on orders over $35 from Whole Foods Market stores nationwide.\n</li>\n<li>\n<b>Delivery Where it’s Needed Most: </b>Whether customers are road-tripping to see family, staying home and need a secure delivery location, or sending a gift to a loved one or friend, Amazon provides thousands of package pickup locations for customers. These locations are conveniently located near or in offices, convenience stores, malls, apartment buildings, and grocery stores in more than 900 cities and towns across the U.S. Tens of millions of products can be easily and conveniently delivered to an Amazon pickup point at Whole Foods Market, 7-11, Chase Bank, Rite-Aid, HealthMart, GNC, Stage Stores, and other locations. To find a location, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazon.com%2FHub&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=amazon.com%2FHub&amp;index=19&amp;md5=4424f1bc9f9555fb6e5a94c57d9e5818\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/Hub</a>.\n</li>\n<li>\n<b>Extended Returns Window: </b>Most of the items purchased between October 1, 2021, and December 31, 2021, can be returned until January 31, 2022.\n</li>\n</ul><p>\nGet the latest news by visiting <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2F&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=About+Amazon&amp;index=20&amp;md5=916f2a887b6ad071fa4e6192a5cc824b\" data-type=\"url\" class=\"tr-link\" translate=\"no\">About Amazon</a>, where you can find <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2Fnews%2Fretail%2Famazon-shopping-tips&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=shopping+tips+and+ways+to+save+this+season&amp;index=21&amp;md5=db789cb2815ee1c3ec49c98b57fd0db1\" data-type=\"url\" class=\"tr-link\" translate=\"no\">shopping tips and ways to save this season</a> and learn more about <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fholidaydelivery&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=holiday+delivery&amp;index=22&amp;md5=dd76a2d7a1339682d91e08e07157ed02\" data-type=\"url\" class=\"tr-link\" translate=\"no\">holiday delivery</a>.\n</p><p>\n<b>About Amazon</b>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazon.com%2Fabout&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=23&amp;md5=04963cd43bcf053bd5127db9ea133351\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211122005884r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTIyMDA1ODg0cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=f5726fc718cf8802350c4dbca42f68c04fa49cd3be10dc49a5a7873b723949f5dd05c03d0d944f370b4f569e81fb556c222461d82ac11d2b13d3d57858381242\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211122005884/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211122005884/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52536886&amp;newsitemid=20211122005884&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=24&amp;md5=e421861d5996dbe211e5c97bfe56a0bb\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON</p></div>"}