{"date": "2022-02-21 07:11:20.036000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 2045CAllied Minds PLC21 February 2022</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>This announcement contains inside information for the purposes of the Market Abuse Regulation (EU) No. 596/2014 as amended by The Market Abuse (Amendment) (EU Exit) Regulations 2019. Upon the publication of this announcement, this inside information is now considered to be in the public domain.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>21 February 2022</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Allied Minds</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Federated Wireless raises $58 million in Series D funding; Group trading update</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Allied Minds plc (LSE: ALM, \"the Group\"), the IP commercialisation company focused on early stage company development within the technology sector, announces that portfolio company Federated Wireless, Inc., (\"Federated\"), the industry leader in enterprise shared spectrum 5G private wireless, has secured $58 million in Series D funding at a pre new-money valuation of $230m. The Group also reports a trading update for the period to 18 February 2022.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Participants in Federated's latest financing round include an affiliate of Cerberus Capital Management, L.P. (\"Cerberus\"), a new investor, alongside existing investors GIC (Singapore's sovereign wealth fund) and Allied Minds.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The funding will help scale Federated's platform and support further investments in its capabilities and partnerships. Founded in 2012, Federated is focused on accelerating enterprise adoption of private wireless networking and delivering new capabilities for network edge innovation. With this latest round of funding, its goal is to simplify and automate how wireless networks are purchased, deployed, provisioned and managed, making it easier for organisations to customise their network to business requirements, and speed time to market with advancements in IoT, VR/AR, and other digital technologies.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Iyad Tarazi, CEO of Federated Wireless</span>\n</span>\n<span>, commented: <span>\n</span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\"Private wireless will deliver the type of transformation for enterprises that the cloud delivered for IT infrastructure. This investment will enable us to scale our spectrum platforms, invest in commercialization, and accelerate private wireless market adoption.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Democratising wireless with shared spectrum</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Shared spectrum, also known as CBRS, is an innovative technology that delivers the best attributes of traditional wireless and Wi-Fi, with lower fixed cost, higher quality and greater efficiency and scale.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>As the first to market with a Spectrum Access System (SAS), Federated is the nationwide leader in enabling, commercialising and driving adoption of shared spectrum. With more than 350 customers and over 85,000 connected devices across the United States and territories, the company serves a customer base spanning defence, government, manufacturing, telecommunications, utilities, real estate, and education with a wide range of use cases from network densification and mobile offload to private wireless and industrial IoT. Noteworthy customers include Charter, Comcast, the US Department of Defense, Carnegie Mellon University, and others.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Accelerating private 5G wireless for enterprise</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Critical to the Federated strategy is expanding its edge solutions, which it will achieve through collaboration with hyperscale providers including AWS, Intel, HPE-Aruba, JMA, Cisco, and others. The company's top priorities include:</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>Investing in cloud-native tools to empower edge innovation, including automation, application analytics and zero touch provisioning (ZTP);</span>\n</p>\n<p>\n<span>·</span>\n<span>Mobilising the ecosystem with a heightened focus on relationship management, business development and sales enablement;</span>\n</p>\n<p>\n<span>·</span>\n<span>Expanding product capabilities for sharing in 6 Ghz, and promoting its adoption domestically and internationally; and</span>\n</p>\n<p>\n<span>·</span>\n<span>Ramping up commercial capacity with increased investment in Sales, Marketing and Customer Success.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Investing in growth</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>In addition to significant investments in product development, Federated has made key appointments to the company's leadership team and Board:</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>·</span>\n<span>Dr. Shaygan Kheradpir joins the Federated Wireless Board, bringing senior C-level experience from industry giants such as Verizon, Barclays, Juniper, and Coriant, where he served as CEO and Chairman</span>\n</p>\n<p>\n<span>·</span>\n<span>Industry veteran Chris Swan joins as Chief Commercial Officer to drive record growth with leadership over sales, marketing, and customer care</span>\n</p>\n<p>\n<span>·</span>\n<span>Strategic operations and finance executive Loren Buck joins as Chief Financial Officer, accountable for capital raising, strategic investments, financial planning and cash management</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Outlook</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Federated delivered a year of very strong revenue growth in 2021, albeit below the expectations set out at Allied Minds' capital markets presentation in April 2021. This was due to delayed customer deployment of contracted business that was originally budgeted for the final months of the year. It is anticipated that revenue recognition will occur in 2022.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The Board remains very positive about Federated's growth prospects and potential for further valuation upside. It is pleased that investors with Cerberus and GIC's track record also recognise that opportunity with their respective investments.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Further information about the Series D funding</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The Series D funding was completed at a post</span>\n<span>‐</span>\n<span>money valuation of $288 million, up from the Series C post-money valuation of $215 million published in the Allied Minds' Annual Report and Accounts for the year ended 31 December 2020.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>In November 2021, Allied Minds invested $4,283,000 in Federated as bridge financing, which has been fully converted following the completion of the Series D funding round. As a result, Allied Minds' fully</span>\n<span>‐</span>\n<span>diluted ownership of the issued share capital of Federated stands at 24.19%.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Wider portfolio update</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>BridgeComm</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The optical communications market has become a focal area for investors as they see more opportunities arising from commercial space opportunities and government programs looking for the unique characteristics of high speed and security. BridgeComm has engaged an investment bank to advise on its options and is engaged in discussions with multiple parties. We look forward to updating investors in due course.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>BridgeComm has developed a proprietary, patent awarded set of technologies around point to multipoint optical communications using Managed Optical Communication Array (MOCA) technology, meaning it can truly complement legacy radio frequency technology. This allows multi-domain capabilities to share large volumes of data faster, with increased security. This capability has been demonstrated to customers and BridgeComm is now developing terminals for specific applications. As anticipated, sales of the MOCA technology to customers began in H2 2021.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Key partners include Boeing, a supporter of BridgeComm and partner for key applications and Space Micro for the production of point to multipoint terminals based on MOCA technology.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Ocuterra Therapeutics</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>In November 2021, Ocuterra announced the final close of its $35m Series B financing, raising funds for its Phase 2 study of OTT166 in patients with moderate to severe non-proliferative and mild proliferative diabetic retinopathy. The study is expected to commence early this year.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The post Series B valuation was $51.3m. Allied Minds' fully diluted holding in the Occuterra is 14.18%.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Orbital Sidekick</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Following its $16m Series A financing in April 2021 and the launch of Aurora, its most powerful satellite in July 2021, Orbital continues to expand its its innovative product offerings, build on its strategic partnerships with companies such as Phillips 66 and iPIPE, and introduce its advanced satellite monitoring technology to new industries. The company is currently scheduled to launch four satellites in 2022 and a further two in 2023.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Spark Insights</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>On 1 November 2021, Allied Minds disposed of portfolio company Spark Insights, Inc. to Concirrus, a private UK-based insurance technology company for $0.7m USD, paid in Concirrus stock.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Spin Memory</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>As announced at the half year results in October 2021, Spin Memory is being liquidated via an Assignment for the Benefit of Creditors. This process is ongoing and we do not anticipate that Spin shareholders will receive any proceeds from the liquidation process.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Touch Bistro</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Allied Minds is in the advanced stages of selling its residual shareholding in Touch Bistro for</span>\n<span>$5.5m CAD ($4.3m USD</span>\n<span>), monetising its holding in line with the Group's strategy.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Allied Minds Strategic Outlook and Cash Position</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>In January 2021, the Board set out in its strategic update that it believed that the portfolio was capable of <span>delivering venture capital-like returns upon exit and it was the Group's objective to position each portfolio company for a favourable exit in the next two to three year period.</span>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Having rationalised and refocused the portfolio during 2021, concluding with today's financing of Federated Wireless and the announcement of the forthcoming sale of the residual holding in Touch Bistro, the Board reaffirms its belief in the strategic objectives set out at the start of 2021.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Net Cash held at the parent level at the year-end was $9m. Adjusting for the anticipated Touch Bistro proceeds and the Federated Wireless investment results in a pro-forma cash position today of $13.3m (at 31 December 2020: $22.3m).</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>As set out at the half year results, the Board continues to manage the Group in as cost-efficient manner as possible, regularly reviewing the ongoing costs associated with being a listed company.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Appointment of Mark Pritchard as consultant to the Board</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The Board is pleased to announce that Mark Pritchard, founder and former executive chairman of Allied Minds and a 5.53% shareholder, has been appointed as a consultant to the Board, to help execute its strategy of maximising cash returns to shareholders. Mark has an investment banking background alongside many years of senior level management experience across multiple technology sectors and stages and has achieved significant exits for companies.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Harry Rein, Chairman of Allied Minds,</span>\n</span>\n<span>said:</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\"We're proud of the achievements made by Federated Wireless, which have been recognised by investors in this well-backed funding round. The company has gained share, surpassed development milestones and secured significant customer implementations moving into 2022. We are excited about Federated's market positioning, and optimistic about near-term revenue prospects as well as the growth of the market at large.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\"Our other operating portfolio companies also continue to progress, with expanded product offerings. We're also pleased to be working towards successful monetisation of our stake in Touch Bistro.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Allied Minds will publish its Full Year 2021 results in the second half of April.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>For more information, please contact:</span>\n</p>\n<p>\n<span>\n</span></p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>Allied Minds plc</span>\n</p>\n</td>\n<td>\n<p>\n<span>c/o Instinctif Partners</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Harry Rein</span>\n</p>\n</td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Federated Wireless, Inc.</span>\n</p>\n<p>\n<span>Iyad Tarazi</span>\n</p>\n</td>\n<td>\n<p>\n<span>c/o Instinctif Partners</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Instinctif Partners</span>\n</p>\n</td>\n<td>\n<p>\n<span>\n<a href=\"mailto:alliedminds@instinctif.com\" data-type=\"email\" translate=\"no\">alliedminds@instinctif.com</a>\n</span>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Tim Linacre / Rozi Morris / Joe Quinlan</span>\n</p>\n</td>\n<td>\n<p>\n</p></td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>About Allied Minds</span>\n</p>\n<p>\n<span>Allied Minds plc is an IP commercialisation company focused on early stage company development within the technology sector. With origination relationships that span US federal laboratories, universities, and leading US corporations, Allied Minds historically created, and now operates and funds, a portfolio of companies to generate long-term value for its investors and stakeholders. Based in Boston, Allied Minds supports its businesses with capital, management, expertise and shared services. For more information, please visit</span>\n<span>\n<span>\n<a href=\"http://www.alliedminds.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.alliedminds.com</a>\n</span>\n</span>\n<span>.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>About Federated Wireless</span>\n</p>\n<p>\n<span>Founded in 2012, Federated Wireless has long led the industry in development of shared spectrum CBRS capabilities. The company's partner ecosystem includes more than 40 device manufacturers and edge partners, all of which are dedicated to collaboration to advance development and proliferation of CBRS services. Federated Wireless' customer base includes companies spanning the telecommunications, energy, hospitality, education, retail, office space, municipal and residential verticals, with use cases ranging from network densification and mobile offload to Private 4G/5G and Industrial IoT. For more information, visit:</span>\n<span>\n<span>\n<a href=\"https://www.globenewswire.com/Tracker?data=x5L1ZZ5txK5clbz3MSuQHXRZrW_EgKvMy4SW7ncCJ4NrCzSHZA3JkOxq7yW6SY-6_7Y975OGucrObBf7BnVTNMWWiVJp8WOoStSLRzUHiwDJ3QauLRzvTU6sDbRb2Nr2\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.federatedwireless.com</a>\n</span>\n</span>\n<span>.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>TSTDBLFLLLLZBBX</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}