{"date": "2021-11-03 14:10:46.806000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">Neo Lithium Corp. Announces Closing of Plan of Arrangement with Zijin Mining Group Co., Ltd.</p>\n<p>TORONTO, Jan. 26, 2022</p>\n<p>\n<span>All monetary amounts are expressed in Canadian Dollars, unless otherwise indicated.</span>\n</p>\n<p>\n<span>TORONTO</span> , <span>Jan. 26, 2022</span> /CNW/ - Neo Lithium Corp. (\" <span>Neo Lithium</span> \" or the \" <span>Company</span> \") (TSXV: NLC) (OTCQX: NTTHF) (FSE:NE2) is pleased to announce the completion of the previously announced plan of arrangement under the <span>Ontario</span>\n<span>Business Corporations Act</span> (the \" <span>Arrangement</span> \") involving the Company, Zijin Mining Group Co., Ltd. (\" <span>Zijin</span> \"), and 2872122 Ontario Limited, a wholly-owned subsidiary of Zijin (the \" <span>Purchaser</span> \"), following receipt of all required regulatory approvals and satisfaction of all closing conditions.</p>\n<p>\n\n</p>\n<p>Pursuant to the Arrangement, the Purchaser acquired all of the issued and outstanding common shares of the Company (the \" <span>Shares</span> \") for <span>$6.50</span> per Share in cash. Registered shareholders should send their completed and executed letters of transmittal and share certificates or DRS advices, as applicable, to the depositary, TSX Trust Company, as soon as possible in order to receive the consideration to which they are entitled in connection with the Arrangement.</p>\n<p>As a result of the Arrangement, the Shares are expected to be delisted from the TSX Venture Exchange. It is also expected that the Shares will cease being quoted for trading on the OTCQX and the Frankfurt Stock Exchange concurrently or shortly thereafter, and that the Company will apply to cease to be a reporting issuer in all of the provinces of <span>Canada</span> in which it is a reporting issuer.</p>\n<p>In connection with the closing, and in accordance with the terms of the Arrangement, the Company issued an additional 6,275,500 Shares to the Purchaser at a price of <span>$6.50</span> per Share for gross proceeds to the Company of <span>$40,790,750</span> , which proceeds will be primarily used by the Company to fund a portion of the transaction consideration.</p>\n<p>\n<span>About Neo Lithium Corp.</span>\n</p>\n<p>Neo Lithium Corp., incorporated in January, 2016, owns and operates the 3Q lithium brine project in <span>Argentina</span> . Additional information regarding Neo Lithium Corp. is available on SEDAR at <a href=\"http://www.sedar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.sedar.com</a> under the Company's profile and at its website at <a href=\"http://www.neolithium.ca\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.neolithium.ca</a> .</p>\n<p>\n<span>About Zijin</span>\n</p>\n<p>Formed in 1993 and based in <span>Fujian, China</span> , Zijin is one of the largest mining companies in <span>China</span> as well as a leading global gold and copper producer. It manages an extensive portfolio, primarily consisting of gold, copper, zinc, and other metals through investments in <span>China</span> and twelve overseas countries across <span>Europe</span> , <span>Central Asia</span> , <span>Africa</span> , Oceania and <span>South America</span> . Listed on the Shanghai Stock Exchange and the Hong Kong Stock Exchange, Zijin has a market capitalization of approximately <span>US$40 billion</span> .</p>\n<p>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this press release.</p>\n<p>View original content to download multimedia: <a href=\"https://www.prnewswire.com/news-releases/neo-lithium-corp-announces-closing-of-plan-of-arrangement-with-zijin-mining-group-co-ltd-301468237.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/neo-lithium-corp-announces-closing-of-plan-of-arrangement-with-zijin-mining-group-co-ltd-301468237.html</a>\n</p>\n<p>SOURCE Neo Lithium Corp.</p>\n<p>View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/January2022/26/c4504.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/January2022/26/c4504.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}