{"date": "2021-11-26 21:07:58.427000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3504.56, "close": 3507.07}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Chhorii movie review: Director Vishal Furia shoots his own film in the foot by turning it into a 'message movie' in its final moments.</p><p>Like Rosemary's Baby in the sticks, Amazon Prime's Chhorii is a surprisingly well-made horror picture that actually respects the genre, but loses its way so tragically in its final moments that you might mistake it for an especially stupid scary movie heroine.</p></div><div class=\"tr-npp-body\"><p>Thankfully, Nushrratt Bharuccha's Sakshi is quite the resourceful protagonist, mostly. She's a heavily pregnant teacher in a Madhya Pradesh town, who in the film's opening moments is awakened to discover her husband getting clobbered by some goons because he owes them money. Instead of going to the authorities or trying to arrange for the cash-you know, logical stuff-Sakshi's husband initiates the first in a series of confounding decisions that only characters in horror movies seem to make. He packs a bag and drags her along to their trusted driver's village home, where the plan is to lay low for a few days until the gangsters… forget that they're owed money?</p><p>This happens within the opening 15 minutes, and is basically going to be the first leap of faith you're going to have to make as a viewer. If you aren't able to, you might as well check out then and there, because things only get kookier. In the village, Sakshi's husband-he's called Hemant, by the way-conveniently goes missing for large chunks of the movie, only so that she can be isolated for the purposes of the plot.</p><p>While Hemant is away, Sakshi is taken care of by a middle-aged couple-the driver, and his wife. During one of her strolls in the fields of tall grass nearby, Sakshi runs into three kids, who appear to be playing hide-and-seek. Refreshed after a cheerful outing, she returns to the dull village, only for the aunty to forbid her from interacting with the kids again. She's very vague about it, but as we learn later, the village has been marred by some very unfortunate incidents.</p><p>Director Vishal Furia establishes the film's admittedly detailed lore in the laziest possible manner-by having the aunty narrate it to a sedated Sakshi-while the film intermittently cuts to flashbacks. It's an inelegant, overly verbose approach that completely ignores one of the central tenets of filmmaking: show, don't tell.</p><p>Chhorri is based on Furia's Marathi original Lapachhapi. I haven't seen the Marathi film, but I wonder if it had similar third-act problems as this one. If it did, then it makes no sense for Furia to have not changed things up, and if it didn't, then it would mean that Furia, in fact, actually sabotaged Chhorii by making it worse. It's a lose-lose situation.</p><p>While it might tackle the same anxieties as Roman Polanski's classic-Chhorii is also about female liberation, and has a scene in which a woman is violated during an occult ritual-it doesn't simply duplicate those themes for a desi audience. It is, instead, an effective translation. But since nobody is going to accept that Chhorii is essentially a Rosemary's Baby remake, it can't be appreciated for being one of the better examples of one. Remember, in India, movies are remade solely on the basis of how successful the original was at the box office; big numbers are basically seen as proof-of-concept.</p><p>And recent developments have proven that there is an appetite for horror among Indian masses. It's a different matter altogether that in our country, horror is usually merged with other genres like romance and comedy. Chhorii is an old-fashioned, unadulterated horror picture that would've been very easy to recommend had it resisted the desire to turn into a message movie in its final moments.</p><p>The 'message', as had been quite effectively conveyed already, is that female infanticide = bad. Don't do it. Don't even think about it. But for some reason, Furia completely loses faith in his audience and decides to shoehorn in a scene where a character literally delivers a speech about this and brings the movie to a screeching halt. And as if that wasn't enough, he pulls a Mimi (and Rashmi Rocket) and concludes not on the sort of unsettling note that good horror movies should, but with several title cards that throw statistics at you. For whom are these statistics intended? Does Furia think that potential baby-killers are watching his film? Does he expect Chhorii to change their mind about killing babies?</p><p>Maybe it can, who knows? In that case, it's worth a shot. But for the rest of us who aren't inclined to commit foeticide, it's a sorry (and utterly avoidable) addition to an otherwise solid film.</p><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}