{"date": "2022-01-05 14:30:12.821000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p> <br/>   By Swastika Mukhopadhyay<br/>NewsRise<br/>   KOLKATA (Jan 5) -- Here's a roundup of latest news from India so far on Wednesday:<br/><br/>*UPDATE: India Court Stays Arbitration Proceedings In Future Group-Amazon Case  <br/><br/>The Delhi High Court today put on hold Future Group’s arbitration proceedings with Amazon in Singapore court, and stayed yesterday’s order dismissing the Indian company’s plea. Further, the division bench of Delhi High Court issued notice to Amazon, deferring the next hearing to Feb. 1  <br/><br/>*India Won’t Mix-And-Match Booster Jabs For Health Workers, Elderly - Govt Official<br/><br/>India won’t mix-and-match Covid-19 vaccines for booster doses to healthcare and frontline workers as well as for those above 60 years with co-morbidities, V.K. Paul, member health at top federal think-tank Niti Aayog said today.\"The precautionary vaccine dose... will be the same vaccine as has been given to them previously,\" Paul told reporters. <br/><br/>*India Health Official: Molnupiravir Has Major Safety Concerns, Not Part Of Covid Protocol<br/><br/>An Indian health official today said that anti-viral drug Molnupiravir could lead to safety issues and added that the drug was not part of the national Covid-19 treatment protocol. “We have to remember that this drug has major safety concerns,” Balram Bhargava, Director General of the Indian Council of Medical Research told reporters today. “It is not included in the national taskforce treatment. The WHO has not included it, the U.K. has not included it as of now.”<br/><br/>*India Court Declines To Restrain ED From Probing Amazon’s 2019 Future Deal; Adjourns Hearing<br/><br/>The Delhi High Court today refused to restrain the Enforcement Directorate after the local unit of Amazon challenged the federal financial-crime probe agency’s investigation into the U.S. e-commerce major’s 2019 investment in Future Group. The court adjourned next hearing in the case to Jan. 12, said one of the lawyers representing Future Group. <br/><br/>*India Issues Show Cause Notices To Xiaomi Technology India For $88 Million Duty Evasion<br/><br/>India has issued three show cause notices to mobile phone maker Xiaomi Technology India Private Limited for demand and recovery of customs duty worth 6.53 billion rupees ($88 million), according to a government statement today. Investigations by the Directorate of Revenue Intelligence indicated that neither Xiaomi India nor its contract manufactures were including the amount of royalty paid by Xiaomi India in the assessable value of the goods imported by the company and its contract manufacturers, the statement said. <br/><br/>*India NCLAT Sets Aside NCLT Order Approving Twin Star’s Bid For Videocon - Lawyer<br/><br/>India’s National Company Law Appellate Tribunal today rejected the National Company Law Tribunal’s order that approved Vedanta Group-owned Twin Star Technologies' bid to acquire debt-laden Videocon Industries, according to a lawyer. “The bench was convinced that there were some discrepancies in the way in which the Committee of Creditors (CoC) approved the resolution plan and that it was against certain sections of the Insolvency and Bankruptcy Code,” the lawyer, who did not wish to be identified said. “The bench has sent back the plan to the CoC.”<br/><br/>*Foreign Investors Bought Net $181.92 Million Of Indian Shares On Jan 4<br/><br/>Foreign investors bought net $181.92 million of Indian shares on Jan. 4, according to data from the National Securities Depository Ltd. In January so far, these investors bought net $493.66 million of Indian shares. <br/><br/>*India Health Ministry Revises Home Isolation Norms For Mild, Asymptomatic Covid-19 Cases<br/><br/>India’s federal health ministry today issued revised guidelines for mild and asymptomatic cases of Covid-19 disease amid the quick spread of the highly-contagious Omicron variant of coronavirus. While asymptomatic cases are defined as laboratory confirmed Covid-19 cases not experiencing any symptoms and with oxygen saturation of more than 93%, mild cases are patients with upper respiratory tract symptoms, with or without fever, without shortness of breath and with oxygen saturation of more than 93%.<br/><br/>*BAZAAR BUZZ: ICICI Rerating Hinges On Closing RoE Gap With HDFC Bank: Jefferies<br/><br/>Jefferies says ICICI Bank’s narrowing return on equity gap with peer HDFC Bank will be led by an upside to the former’s net interest margin from higher quantum of lending to small- and mid-sized firms and unsecured loans. “We believe that next leg of rerating will be driven by narrowing of gap in ROE with best-in-class levels of HDFC Bank,” analyst Prakhar Sharma says in a research note. <br/><br/>*BAZAAR BUZZ: CLSA Says JSPL Set For Next Growth Leg; Capital Allocation Policy Key<br/><br/>CLSA says Jindal Steel &amp; Power set for next growth leg with several re-rating catalysts. \"Our plant visit indicates growth projects are on track, with focus on capacity expansion. Angul capacity to expand to 16mt in the next four years and growth projects are guided by a focus on steel in India, environmental impact, lower leverage (net debt/Ebitda of less than 1.5x across cycles) and high IRR of 15-20%,\" house says.<br/><br/>*BAZAAR BUZZ: HDFC Bank Up 1.4%; Macquarie Bullish On Expected Margin Pickup<br/><br/>India HDFC Bank’s net interest margins likely to improve in the coming quarters due to faster growth in retail loans, Macquarie says. Shares up 1.4% at 1,549.95 today, while Sensex up 0.2%.<br/><br/>*BAZAAR BUZZ: CLSA Adds SBI Life To India Focus Portfolio, Sees 50% Upside<br/><br/>CLSA adds SBI Life Insurance Company to its large, liquid, stock-based \"India focus portfolio\" on expectations of a positive surprise in value for new business margins in the coming quarters. Stock trading 0.2% lower at INR1,217.50 apiece on BSE today; benchmark BSE Sensex up 0.1%.<br/><br/>*India December Auto Sales Slump As Two-Wheelers, PVs Drag - FADA<br/><br/>India's automobile retail sales in December slumped 16% on year, dragged by lower two-wheeler and passenger vehicle sales as rising coronavirus infections and persisting chip shortage slammed demand and output, the Federation of Automobile Dealers Association, or FADA, said today. Total retail sales of vehicles in December fell to 1.56 million units from 1.86 million units a year ago, FADA said in a statement today.<br/><br/>*Cairn To Approach India For Tax Refund As It Completes Withdrawal Of Global Legal Cases<br/><br/>UK-based Cairn Energy on Wednesday announced that it will be approaching India’s tax department for refund after having completed withdrawal of legal proceedings in international courts against the South Asian government and its entities. Withdrawal of legal proceedings against the Indian government was a prerequisite before Cairn could have claimed the refund of taxes under the latest amendment to Indian laws.<br/><br/>*BAZAAR BUZZ: India On Path For Full Recovery In 2022, MS Says; Ups GDP Forecast<br/><br/>Morgan Stanley raises India’s fiscal year F22-23 GDP forecast to 7.8% from 7.2% on expectations that all growth components to pick up steam and to contribute positively. “We expect consumption, which so far has been lagging, to pick up in a broad-based manner as vaccination rates cover the entire eligible population,” house says. “And, a pickup in investments underpinned by structural reforms will help to create a virtuous cycle of sustained high productive growth.”<br/>   - By Swastika Mukhopadhyay; swastika.mukhopadhyay@newsrise.org; +91-33-68133333<br/>- Edited by Gurdev Singh Virk<br/>- Send Feedback to feedback@NewsRise.org<br/>- Copyright (c) 2022 NewsRise Financial Research &amp; Information Services Pvt. Ltd.<br/>    </p></div>"}