{"date": "2021-11-29 21:32:07.233000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">BE'ER SHEVA, Israel, Nov. 29, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span>Technology for automated, risk-based vulnerability management enhances Amazon Inspector vulnerability scan results, helping customers streamline manual security work while elevating security posture</span></p>\n  <p>BE'ER SHEVA, <span class=\"xn-location\">Israel</span>, <span class=\"xn-chron\">Nov. 29, 2021</span> /PRNewswire/ -- <u><a href=\"https://www.rezilion.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Rezilion</a></u>— a startup transforming development, security, and operations (DevSecOps) with automation — has been selected as a launch partner for the new Amazon Inspector, an automated security assessment service used by companies to help secure their workloads running on Amazon Web Services (AWS). Rezilion can now be seamlessly enabled across AWS without requiring customers to go through the tedious task of deploying additional software agents. In addition, Rezilion will be available in <u><a href=\"https://aws.amazon.com/marketplace\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Marketplace</a></u> for instant procurement and deployment.</p>\n<p>Rising pressure for companies to undergo digital transformation and accelerate innovation has led to unprecedented amounts of code being shipped daily. In turn, this creates bottlenecks for security teams who lack the necessary automation tools to adequately detect, prioritize, and address the risk in fast-moving release cycles with both precision and agility. </p>\n<p>The combination of Rezilion and Amazon Inspector answers this increasingly urgent need. This announcement empowers AWS customers with seamless access to DevSecOps tools, enabling their security teams to scan for software vulnerabilities, validate their exploitability, and prioritize remediation efforts according to the actual risk they pose. Using Rezilion, customers can understand which vulnerabilities discovered by Amazon Inspector are exploitable in the specific runtime context of their environment. Since more than 70% of vulnerabilities are not actually exploitable, focusing on the ones that pose a real threat results in:</p>\n<ul type=\"disc\" class=\"bulleted-list arrowlist\"><li><b>70% reduction in patching efforts: </b>saving thousands of DevOps and security teams' hours. </li><li><b>Reduction of remediation timelines from months to days</b>: Making sure real threats are addressed in a timely manner. </li><li><b>Acceleration of development timelines: </b>Spending less time patching, DevOps teams can now focus on building. </li></ul><p>Beyond detection and prioritization, the combination of Rezilion and Amazon Inspector provide an end-to-end solution for managing vulnerabilities:</p>\n<ul type=\"disc\" class=\"bulleted-list arrowlist\"><li><b>Actionable remediation plan</b>: After filtering out un-exploitable vulnerabilities from one or several scanners, Rezilion aggregates findings and organizes them by software components that need to be patched and updated, distilling thousands of vulnerabilities to a handful of remediation actions. </li><li><b>Advanced reporting capabilities</b>: Showing risk trends over time across environments and applications, including metrics such as average time-to-fix and total exploitable risk. </li><li><b>Full, dynamic software bill of materials (SBOM)</b>: Dynamic live mapping of all code in a software environment for holistic management and compliance, including code provenance (where it comes from), location (where it's deployed) and status (how it's executed).</li></ul><p>\"As more and more of our clients are embracing DevSecOps and pushing code faster than ever, we're looking for ways to help them to stay safe in motion,\" says <span class=\"xn-person\">Erik Melander</span>, Chief Executive Officer of Astellent, a Rezilion customer and leading services and technology company helping organizations to achieve digital transformation. \"For any organization facing the same challenge, the combination of Amazon Inspector and Rezilion will do exactly that.\"</p>\n<p>\"We've completely re-imagined Amazon Inspector, making it easier than ever for customers to enable continuous and automated software vulnerability assessments across their entire organization of AWS accounts,\" says <span class=\"xn-person\">Michael Fuller</span>, Director, Product Management, AWS Security Services. \"Adding Rezilion provides customers with additional context to help prioritize remediation efforts, reduce patching backlogs, and accelerate release cycles, all while improving their security and compliance.\"</p>\n<p>\"Rezilion Validate is the only solution for any organization seeking to significantly reduce their patching backlog and refocus efforts on innovation. We're delighted that AWS has recognized the value of our tools for the launch of Amazon Inspector and look forward to making them much more accessible in the AWS Marketplace,\" says Liran Tancman, Chief Executive Officer and Co-Founder of Rezilion. \"Vulnerability identification and risk remediation are imperative to the software development life cycle. Our work with AWS is a major milestone towards Rezilion's aim of empowering teams to focus more on building and less on fixing, to make the SDLC more efficient for everyone it affects.\"</p>\n<p><b>About Rezilion</b><br/>Rezilion is a leading autonomous DevSecOps platform that allows organizations to effortlessly control and mitigate attack surfaces from dev to prod and across cloud infrastructures, applications, and IoT devices. It dramatically reduces the manual work security and engineering teams have to do, harmonizing previously oppositional efforts, and empowering organizations to innovate faster. With operations in <span class=\"xn-location\">Israel</span> and <span class=\"xn-location\">the United States</span>, Rezilion is swiftly attracting a growing client base of Fortune 100 companies and leading industry partners. For more information, visit <u><a href=\"http://www.rezilion.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rezilion.com</a></u>.</p>\n<p><b>For more information, please contact:</b></p>\n<p><span class=\"xn-person\">Kellen Davison</span><br/>Si14 Global Communications  <br/><a href=\"mailto:kellen.davison@si14global.com\" data-type=\"email\" translate=\"no\">kellen.davison@si14global.com</a></p>\n</div>\n<div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p></div>"}