{"date": "2021-12-09 15:35:30.189000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.29, "close": 3483.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">The number of Americans applying for unemployment benefits plunged last week to the lowest level in 52 years, more evidence that the U.S. job market is recovering from last year's coronavirus recession</p><p class=\"tr-npp-section-title\">Last August, Vince Patton was watching a YouTube video of a Tesla owner who had made a startling observation: Tesla drivers could now play a video game on their car's touch-screen dashboard — while the vehicle is moving</p><p class=\"tr-npp-section-title\">Italy's anti-trust authority has fined Amazon 1.13 billion euros, accusing the company of exploiting its dominant position against independent sellers on its website in violation of European Union competition rules</p><p class=\"tr-npp-section-title\">A growing effort to unionize Starbucks stores is facing its first major test</p><p class=\"tr-npp-section-title\">Austria's health minister says the country plans to impose fines of up to 3,600 euros (around $4,000) on people who flout a coronavirus vaccine mandate for all residents ages 14 and over that it aims to introduce in February</p><p class=\"tr-npp-section-title\">Following a blog post that led to some criticism about her giving style, billionaire philanthropist MacKenzie Scott said her team will share details about her philanthropy in the \"year to come.\"</p><p class=\"tr-npp-section-title\">China's central bank is trying to restrain the rise of the yuan after the currency hit a 2 1/2-year high against the dollar</p><p class=\"tr-npp-section-title\">A small spa town in western Ukraine is standing out in a country where only 29% of the population has received coronavirus vaccine shots</p><p class=\"tr-npp-section-title\">The average interest rate on a long-term mortgage in the U.S. held firm again this week</p><p class=\"tr-npp-section-title\">CVS Health is hiking its dividend and offering a better-than-expected 2022 revenue forecast as the health care giant prepares to dive deeper into providing more care</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 The Associated Press.  All rights reserved. This material may not be published, broadcast, rewritten or redistributed.</p></div>"}