{"date": "2021-07-31 00:54:31.990000+00:00", "ticker": "AAF", "mrkt_info": {"open": 83.65, "close": 86.85}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Global law firm White and Case LLP has advised Qatar Holding LLC, an affiliate of the Qatar Investment Authority (QIA), the sovereign wealth fund of the state of Qatar, on entering into an agreement to make a US$200 million investment in Airtel Mobile Commerce BV (AMC BV), one of Africa's leading mobile money businesses.</p><p>The transaction values Airtel Africa's mobile money business at US$2.65 billion on a cash and debt free basis. QIA will hold a minority stake in AMC BV upon completion of the transaction (alongside other minority investors), with Airtel Africa continuing to hold the majority stake. The transaction is subject to customary closing conditions.</p></div><div class=\"tr-npp-body\"><p>AMC BV is a subsidiary of Airtel Africa Plc (Airtel Africa), a London-listed telecommunications company. AMC BV is the holding company for the majority of Airtel Africa's mobile money operations, and will eventually own and operate the business in 14 countries in East Africa and Central and West Africa.</p><p>The White and Case team which advised on the transaction was led by partners Michiel Visser (New York), John Cunningham and Deji Adegoke (both London), and included partners Marc Israel, Peita Menon, Jonathan Rogers, Anneka Randhawa (all London), Bertrand Liard (Paris), Genevra Forwood (Brussels), Richard Burke (Washington, DC) and Jost Kotthoff (Frankfurt), counsel Joseph Carroll (London) and Peter Chessick (Washington, DC), and associates Oji Adoh, Francis Brown, Emma Barker, Kristen DiLemmo, Dayle Perles Fattal, Bruna Beloso (all London), Matthias Vangenechten (Brussels), Emily Holland (Washington, DC) and Mathias Bogusch (Frankfurt).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}