{"date": "2021-11-04 08:43:39+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        ILLIMITY ON \"ACCELERA CON AMAZON\"\n      </p>\n                <p>\n        THE COLLABORATION WITH <span>A</span>MAZON TO DIGITALISE ITALIAN SME<span>S</span> GETS UNDER WAY\n      </p>\n                <p>\n                  <span>Milan, 4 November 2021</span> - illimity Bank S.p.A. (\"<span>illimity</span>\" or the \"<span>Bank</span>\") is on <a href=\"https://sell.amazon.it/accelera-con-amazon?ref_=asit_soa_rd&amp;ld=WEITSOAEDU_PPT\" data-type=\"url\" class=\"tr-link\" translate=\"no\">\"</a><span><a href=\"https://sell.amazon.it/accelera-con-amazon?ref_=asit_soa_rd&amp;ld=WEITSOAEDU_PPT\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Accelera con Amazon</a></span>\", the free-of-charge training programme for Italian SMEs promoted by Amazon and a limited group of entities involved in supporting the transition to digital, with the aim of providing business owners with the tools and expertise needed for anyone seeking to launch or further develop their online activity at a national and international level.\n      </p>\n                <p>\n        Leveraging on the fact that it is both a Bank and a digital company, illimity will be able to enrich the programme with a training course focusing on banking and credit issues, in this way continuing its progress towards supporting the growth of Italy's entrepreneurial fabric.\n      </p>\n                <p>\n        \"Accelera con Amazon\" provides for a series of webinars dedicated to \"doing business\", available to people enrolled in the training programme, in which top members of the Bank will be involved as instructors. In addition, with illimity, video training pills with a specific focus will be created for the first time as part of the project, for example on the new creditworthiness variables, digital reputation and sustainability. The contents of the training course are characterised by their simple and immediate language to ensure maximum usability by a wide audience.\n      </p>\n                <p>\n        illimity will also give ample space to listening to businessmen's needs by promoting surveys designed to identify their training requirements.\n      </p>\n                <p>\n        The first Virtual Academy is planned to take place on 18 November with registration possible through the following <span><a href=\"https://register.gotowebinar.com/register/7458511157387331855\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LINK</a></span><a href=\"https://register.gotowebinar.com/register/7458511157387331855\" data-type=\"url\" class=\"tr-link\" translate=\"no\">.</a></p>\n                <p>\n        The programme responds to a real need in Italy's entrepreneurial fabric: <span>only a third of SMEs are digitalised</span> and only one in seven (of those with more than 10 employees) has a significant online presence (<span>1</span>). In addition, Italy is ranked 25th out of the 28 Member States of the European Union in the 2020 edition of the <span><a href=\"https://digital-strategy.ec.europa.eu/en/library/digital-economy-and-society-index-desi-2020\" data-type=\"url\" class=\"tr-link\" translate=\"no\">DESI Digital Economy and Society Index.</a></span></p>\n                <p>\n                  <span>Carlo Panella</span>, Head of Direct Banking in <span>illimity,</span> commented: \"<span>For illimity, this initiative consolidates the collaboration with Amazon that began in 2019 and represents an important opportunity for fostering financial education in the country's SMEs by putting its expertise in the credit and digital fields at their disposal. In this respect we believe that the drive towards the digitalisation and internationalisation of businesses also passes by way of an extended knowledge of the tools available and a greater awareness of their potential. We are proud to be the first banking partner of \"Amazon Accelerate\", because we strongly believe in the spirit of the project and its efficacy as an outreach model\".</span></p>\n                <p>\n                  <span>(</span>\n                  <span>1</span>\n                  <span>)</span> Source: Netcomm B2C eCommerce Observatory - School of Management of Milan Polytechnic, 2020\n      </p>\n                <p>\n        illimity Bank S.p.A., Sede Legale Via Soperga 9, 20124 Milano, Italia - <span><a href=\"http://www.illimity.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.illimity.com</a></span></p>\n              </div>\n              <div>\n                <p>\n        \"Customers' purchasing habits are changing. And these changes mean opportunities. Each day we innovate to help small and medium-sized companies develop their business to become more competitive in the local and global markets, and the aim of Amazon Accelerate is to provide specific training to support the road to digitalisation\", <span>commented</span><span>Xavier Flamand</span><span>, VP, EU Seller Services in</span><span>Amazon</span><span>.</span> \"The Italian SMEs that sell on Amazon generated more that 600 million euro of foreign sales in 2020: a figure that confirms that this is the right way of supporting the growth of their business.\"\n      </p>\n                <p>\n                  <span>For further information</span>:\n      </p>\n                <p>\n        Investor Relations illimity\n      </p>\n                <p>\n        Silvia Benzi: +39.349.7846537 - +44.7741.464948 - <span><a href=\"mailto:silvia.benzi@illimity.com\" data-type=\"email\" translate=\"no\">silvia.benzi@illimity.com</a></span></p>\n                <div class=\"story-table-container\"><table class=\"story-basic-table\">\n                  <tr>\n                    <td>\n                      <p>\n              Press &amp; Communication illimity\n            </p>\n                    </td>\n                    <td>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <p>\n              Isabella Falautano, Francesca d'Amico\n            </p>\n                    </td>\n                    <td>\n                      <p>\n                        <span>Sara Balzarotti,</span> Ad Hoc Communication Advisors\n            </p>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <p>\n                        <span>+39.340.1989762</span>\n                        <span>\n                          <a href=\"mailto:press@illimity.com\" data-type=\"email\" translate=\"no\">press@illimity.com</a>\n                        </span>\n                      </p>\n                    </td>\n                    <td>\n                      <p>\n                        <span>+39.335.1415584</span>\n                        <span>\n                          <a href=\"mailto:sara.balzarotti@ahca.it\" data-type=\"email\" translate=\"no\">sara.balzarotti@ahca.it</a>\n                        </span>\n                      </p>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <p>\n              Press &amp; Communication Amazon\n            </p>\n                    </td>\n                    <td>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <p>\n                        <a href=\"mailto:press@amazon.it\" data-type=\"email\" translate=\"no\">press@amazon.it</a>\n                      </p>\n                    </td>\n                    <td>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <p>\n              Create PR | <a href=\"mailto:amazon@createpr.it\" data-type=\"email\" translate=\"no\">amazon@createpr.it</a></p>\n                    </td>\n                    <td>\n                    </td>\n                  </tr>\n                </table></div>\n                <p>\n        illimity Bank S.p.A.\n      </p>\n                <p>\n                  <span>illimity</span> is the high-tech banking group founded and headed by Corrado Passera that was created with the aim of responding to specific market needs by way of an innovative and specialist business model. More specifically, illimity extends financing to high-potential SMEs, purchases distressed corporate loans and services these through its platform neprix, and provides digital direct banking services through illimitybank.com. illimity SGR, which sets up and manages alternative investment funds, the first of which dedicated to UTP loans, is also a member of the Group. The story of the illimity Group began in January 2018 with the launch of the special purpose acquisition company SPAXS S.p.A., which ended with a record 600 million euro being raised on the market. SPAXS subsequently acquired Banca Interprovinciale\n      </p>\n                <p>\n        S.p.A., with the resulting merger between the two giving rise to \"illimity Bank S.p.A.\" which has been listed on the Italian Stock Exchange since 5 March 2019 (ticker \"ILTY\"), first on the MTA exchange and since September 2020 on the Star\n      </p>\n                <p>\n        Segment. The banking group, headquartered in Milan, can already count on over 600 employees and ended the first half of 2021 with assets exceeding 4 billion euro.\n      </p>\n                <p>\n        Amazon\n      </p>\n                <p>\n                  <span>Amazon</span> is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Fire tablets, Fire TV, Amazon Echo, and Alexa Customer reviews, 1-Click shopping, personalized recommendations, Prime, Amazon Logistics, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios and Climate Pledge are some of the products and services pioneered by Amazon. For more information, visit www.aboutamazon.it and follow Amazon.it on Instagram, Facebook e Twitter.\n      </p>\n                <p>\n        illimity Bank S.p.A., Sede Legale Via Soperga 9, 20124 Milano, Italia - <span><a href=\"http://www.illimity.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.illimity.com</a></span></p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://assets.ctfassets.net/0ei02du1nnrl/3h8ZvhEOvBrz4hqy1wbEqd/833c742c8445f77196ba5cb06e4cd464/illimity_on_Accelera_con_Amazon.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>illimity Bank S.p.A.</strong> published this content on <strong>04 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>04 November 2021 08:43:39 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - illimity Bank S.p.A.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: illimity-Bank-S.p.A.</p></div>"}