{"date": "2022-01-28 03:40:19+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2777.45, "close": 2879.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The author is a Reuters Breakingviews columnist.  The opinions expressed are her own.</p><p class=\"tr-by\">By Una Galani</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">MUMBAI, Jan 28 (Reuters Breakingviews)</span><span class=\"tr-dl-sep\"> - </span>A souped-up combatant looks set to join India’s streaming wars. Industry veterans James Murdoch and Uday Shankar are close to a deal that would pump 120 billion rupees ($1.6 billion) into Viacom18, a joint venture backed by Mukesh Ambani’s Reliance Industries <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RELI.NS\" data-type=\"ric\" data-ric=\"RELI.NS\" translate=\"no\" dir=\"ltr\">RELI.NS</a>, a move that will reduce current partner ViacomCBS’ <a href=\"reuters://REALTIME/Verb=FullQuote/ric=VIAC.O\" data-type=\"ric\" data-ric=\"VIAC.O\" translate=\"no\" dir=\"ltr\">VIAC.O</a> holding in TV18 Broadcast <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TVEB.NS\" data-type=\"ric\" data-ric=\"TVEB.NS\" translate=\"no\" dir=\"ltr\">TVEB.NS</a> to 10%, per the Economic Times. That’ll add more ammunition to the battle for content, pleasing viewers but also leading to overspending. </p><p>If consummated, the investment would be the latest in a string of mergers and acquisitions to reshape the industry. Sony Pictures India and Zee Entertainment <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ZEE.NS\" data-type=\"ric\" data-ric=\"ZEE.NS\" translate=\"no\" dir=\"ltr\">ZEE.NS</a> are waiting for competition clearance <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2TM026\" data-type=\"storyId\" data-story-id=\"nL1N2TM026\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> on their $7 billion merger to create a film powerhouse. Walt Disney’s <a href=\"reuters://REALTIME/Verb=FullQuote/ric=DIS.N\" data-type=\"ric\" data-ric=\"DIS.N\" translate=\"no\" dir=\"ltr\">DIS.N</a> 2019 merger with 21st Century Fox landed it Star India. </p><p>The deals are set to turbocharge what’s already a highly competitive market. Revenue from streaming services will grow 25% annually to reach $15 billion in 2030, the Confederation of Indian Industry reckons. This burgeoning part of the entertainment industry counts as many as 80 million subscriptions, up 50% year-on-year. And there are more than 40 platforms. Disney is by far the market leader, thanks to its ownership of the hugely popular Indian Premier League (IPL) cricket. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2RM23X\" data-type=\"storyId\" data-story-id=\"nL4N2RM23X\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Reliance’s potential new partners would probably shake that up. Shankar led an aggressive shopping spree of sports rights at Star, including dropping $2.6 billion on IPL cricket in 2017 while Murdoch ran the subsidiary’s parent, Fox <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FOXA.O\" data-type=\"ric\" data-ric=\"FOXA.O\" translate=\"no\" dir=\"ltr\">FOXA.O</a>. Those rights are up for auction again this year, with deep-pocketed players including Reliance, Sony-Zee and Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> all likely to give Star a run for is money – and drive up the price. The battle for non-sports content will intensify too: Netflix <a href=\"reuters://REALTIME/Verb=FullQuote/ric=NFLX.O\" data-type=\"ric\" data-ric=\"NFLX.O\" translate=\"no\" dir=\"ltr\">NFLX.O</a>, already grappling with less impressive growth in its mature home U.S. and Canadian market, looks particularly vulnerable.</p><p>Paying up for ever more expensive content under a business model where consumers can turn off as soon as an eight-week cricket tournament is over is especially risky in a price-sensitive market like India: Subscribers pay at most a third of U.S. rates, if not much less. The more platform-hopping Indian viewers engage in, the more broadcasters will be tempted to spend to try to win them over. </p><p>Follow <a href=\"https://twitter.com/ugalani\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@ugalani</a> on Twitter</p><p><br/></p><p>CONTEXT NEWS</p><p>- Lupa India, an investment company set up by James Murdoch and former Star India and Walt Disney executive Uday Shankar, is close to acquiring almost 40% of Viacom18, the Economic Times reported on Jan. 26 citing unnamed sources. </p><p>- The group plans to invest 120 billion rupees ($1.6 billion) in the entertainment and sports business, including through the issuance of primary shares, at a valuation of around $4 billion. Viacom18 is 51% owned TV18 Broadcast and 49% owned by ViacomCBS. After the deal, ViacomCBS’ interest will reduce to 10%. </p><p>- TV18 is a subsidiary of Mumbai-listed Network18 which is <a href=\"https://www.nw18.com/shareholding\" data-type=\"url\" class=\"tr-link\" translate=\"no\">75% owned</a> by entities related to Mukesh Ambani’s Reliance Industries. </p><p><br/></p><p><br/></p><p class=\"tr-signoff\"> (Editing by Antony Currie and Katrina Hamlin)</p><p class=\"tr-contactinfo\">((For previous columns by the author, Reuters customers can click on <a href=\"reuters://REALTIME/verb=Headlines/ric=GALANI/\" data-type=\"newsExpression\" data-expression=\"GALANI/\" translate=\"no\" dir=\"ltr\">GALANI/</a> <br/> SIGN UP FOR BREAKINGVIEWS EMAIL ALERTS <a href=\"https://bit.ly/BVsubscribe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://bit.ly/BVsubscribe</a> | <a href=\"mailto:una.galani@thomsonreuters.com\" data-type=\"email\" translate=\"no\">una.galani@thomsonreuters.com</a> ; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://una.galani.thomsonreuters.com@reuters.net\">una.galani.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: RELIANCE INDS-DEAL/BREAKINGVIEWS</p></div>"}