{"date": "2021-11-04 21:12:13+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3384.0, "close": 3518.99}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        November is Native American Heritage Month, which provides an opportunity to honor and celebrate the cultures, experiences, and traditions of Native American people. There are more than 500 federally recognized tribes in the U.S., but Indigenous people can be found all over the world, as reflected in the rapid growth being experienced by Amazon's affinity group designed especially for native people around the world.\n      </p>\n                <p>\n        \"One of the many things that impress me about working at Amazon is our unqualified commitment to diversity. We understand the importance of listening to and learning from a wide range of perspectives-it's the most meaningful path to growth as individuals, as a company, and as a society. I urge everyone to participate in Native American Heritage Month to recognize and celebrate the rich cultures, history, and experiences of Native peoples,\" says Mike Hopkins, senior vice president, Amazon Prime Video and Studios.\n      </p>\n                <h4>\n        Indigenous@Amazon affinity group\n      </h4>\n                <p>\n        Amazon's 13 employee-led affinity groups create inclusive communities, provide mentorship, and lead programs that build awareness around customer inclusion. The affinity groups lead company-wide initiatives around Asian Pacific-American Heritage Month, Black History Month, Hispanic Heritage Month, and Native American Heritage Month-and play an important role in advising business units, leading service projects, and engaging in communities where Amazon employees live and work. Native American Heritage Month is no different.\n      </p>\n                <p>\n        Amazon's Indigenous affinity group is an inclusive community of Indigenous employees and allies, dedicated to making an internal and external impact that celebrates and elevates diverse Indigenous cultures from around the world through culturally aware technologies, services, and marketplace. Amazon is a company of builders who bring varying backgrounds, ideas, and points of view to invent on behalf of our customers.\n      </p>\n                <p>\n        \"Coming from a small Native American community, we often lacked access to basic necessities like electricity and running water, as well as access to technology,\" said Fawn Sanchez, Shoshone-Bannock, President of the Indigenous@Amazon affinity group. \"We are passionate about hearing the voices of Amazon employees around the world. Simply put, diversity drives innovation, allowing our workforce to look at customer problems from another perspective, while representing the communities that we come from and advocating for their needs.\"\n      </p>\n                <p>\n        Nicole Robey, Winnebago/Ho-Chunk, Indigenous@ communications lead, PXT3 senior change leader, agrees. \"Being Native, community and connectivity is an integral part of who I am. After 15 years at Amazon, I have been fortunate enough to form and reconnect with my community while providing opportunities to uplift and empower other indigenous peoples. I am so excited about the opportunities in front of us and the positive impact we can make inside and outside of Amazon,\" she said.\n      </p>\n                <p>\n        Formed four years ago, the Indigenous@ affinity group focuses on increasing recruitment, representation, and retention across Amazon's global footprint. Today, the Indigenous affinity group has over 2,000 members, with four chapters in the Americas as well as chapters in Australia, New Zealand, and Canada. As we celebrate NAHM in the U.S., we also reflect on how international our community is. \"Being Hawaiian, I've always searched for a group of people I can fit in with and feel safe and respected when talking and learning more about my culture,\" said Shannon Hokulani Sharp, Hawaiian, Indigenous@ treasurer, Amazon freight supply chain manager. \"In Indigenous@, we support, respect, and celebrate all Indigenous cultures. I am so proud of this group and the growth we've had in getting our voices heard more, and I'm excited to see that growth continue.\"\n      </p>\n                <h4>\n        Indigenous@ in the community\n      </h4>\n                <p>\n        The COVID-19 pandemic brought both challenges and opportunities across Amazon. Indigenous people have been disproportionately impacted by the COVID-19 pandemic, with limited access to heath care and lack of access to essential services and key preventative measures. In addition, the community celebrations that often drive familial and community connections came to a halt. \"On tough days, I always remember that nothing can break my resilient spirit. Resilience runs through Indigenous people's veins,\" said Omega Detsoi, Navajo Nation (Diné), Indigenous@ chapter expansion lead, AMXL logistics specialist. Amazon responded to the pandemic with an increase in virtual events, and affinity groups used this as an opportunity to create inclusion across their global footprint, resulting in even more growth than planned.\n      </p>\n                <p>\n        Native American Heritage Month 2021 will feature multiple events per week, ranging from musical performances, beadwork demonstrations, and live classes, to Native American author spotlights and events that celebrate Amazon's diverse intersectionality.\n      </p>\n                <p>\n        \"Native-Indigenous peoples still severely lack representation across society, and this remains true for Native-Indigenous people within the larger queer community. It's unfortunate, but because people still may not have a robust understanding of Native-Indigenous people, it causes conversations to often start 500+ years ago and dredge through an unbelievable amount of traumatic history,\" said Caleb Dunlap, Anishinaabe and Mvskoke, DEI program manager, worldwide consumer talent acquisition. \"Celebrating Indigenous Pride is a cosponsored event by Indigenous@ and Glamazon during NAHM that will serve to do the very opposite by celebrating and elevating the voices of current Two Spirit individuals while showcasing the all-important intersectionality of Native-Indigenous and 2SLGBTQIA+ communities.\"\n      </p>\n                <p>\n        For several years, Amazon has been a primary corporate sponsor for the American Indian Science and Engineering Society (AISES) organization-dedicated to increasing the representation of Indigenous peoples of North America and the Pacific Islands in science, technology, engineering, and math (STEM) studies and careers. Indigenous@ members and company representatives attend the annual conference and lead key conversations on diversity at Amazon, including this year's topic, <span>Inside the Smile-Imposter Syndrome</span>, and for the last three years, Amazon has been named as one of the <strong>Top 50 Indigenous STEM Employers</strong> in the AISES <span>Winds of Change</span> magazine. Most recently, Amazon Web Services (AWS) has leveraged their AWS re/Start program to partner with the BMO Financial Group-Canada's only Indigenous-led and Indigenous-staffed IT service and training firm-to offer a 12-week cloud computing training course and BMO internship for Indigenous students across Canada.\n      </p>\n                <h4>\n        Honoring Indigenous cultures throughout the month\n      </h4>\n                <p>\n        Indigenous@ also invites Prime Video subscribers to celebrate Native American Heritage Month-through a curated selection of titles to honor the culture, traditions, and impacts of Native people. The selection features Native American actors, producers, writers, and filmmakers, and include titles such as <span><a href=\"https://www.amazon.com/Day-Seven/dp/B08NMC79YB/ref=sr_1_1/?dchild=1&amp;keywords=the+wilds&amp;qid=1630084675&amp;s=instant-video&amp;sr=1-1\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Wilds</a></span>(Amazon Original), <span><a href=\"https://www.amazon.com/Last-Mohicans-Madeleine-Stowe/dp/B018YLCE32/ref=sr_1_1?dchild=1&amp;keywords=The+Last+of+the+Mohicans&amp;qid=1633119804&amp;s=instant-video&amp;sr=1-1\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Last of the Mohicans</a></span>, <span><a href=\"https://www.amazon.com/Episode-1/dp/B07B3J5DCP/ref=sr_1_3?dchild=1&amp;keywords=PowWow+Highway&amp;qid=1633119275&amp;s=instant-video&amp;sr=1-3\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Dreamkeeper</a></span>, <span><a href=\"https://www.amazon.com/gp/video/detail/B08Z74KHSR/ref=atv_dp_amz_det_c_UTPsmN_1_6\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Spirit Rider</a></span>and <span><a href=\"https://www.amazon.com/gp/video/detail/B07MTWZL8M/ref=atv_wl_hom_c_unkc_1_21\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Native America S1</a></span>.\n      </p>\n                <p>\n        Learn more about the histories and contributions of Indigenous communities through our <span><a href=\"https://blog.aboutamazon.com/working-at-amazon/honoring-indigenous-peoples-day\" data-type=\"url\" class=\"tr-link\" translate=\"no\">curated book list on Native peoples</a></span>.\n      </p>\n                <h4>\n        How to support Native communities today\n      </h4>\n                <p>\n        The Indigenous@ group works with a variety of nonprofit organizations to support the growth and development of Indigenous peoples and communities across the nation. This support ranges from donations to tribal communities impacted by current events to offering coding camps for Native Americans. The Indigenous@ group recommends those interested in supporting nonprofit organizations consider the following: <span><a href=\"https://www.aises.org/support\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AISES</a></span>, <span><a href=\"http://www.potlatchfund.org/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Potlatch Fund</a></span>, <span><a href=\"https://www.aigcs.org/aigc-donation-form/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">American Indian Graduate Center</a></span>and <span><a href=\"https://www.firstnations.org/covid-19-emergency-response-fund/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">First Nations' COVID-19 Emergency Response Fund</a></span>.\n      </p>\n              </div>\n              <div>\n                <div>\n        Related Tags\n      </div>\n                <div>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/affinity-groups\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Affinity groups</a>\n                  </span>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/working-at-amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Working at Amazon</a>\n                  </span>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/diversity\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Diversity, equity, and inclusion</a>\n                  </span>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/workplace/amazon-celebrates-native-american-heritage-month\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>04 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>04 November 2021 21:12:13 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}