{"date": "2022-01-04 22:32:58.728000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>mumbai</p></div><div class=\"tr-npp-lead\"><p>mumbai, Jan. 5 -- In a setback to the Kishore Biyani's Future Group, the Delhi high court on Tuesday dismissed its plea to suspend the arbitration proceedings at the Singapore International Arbitration Tribunal in connection with its deal with US retail firm Amazon.</p><p>Future Group had cited a December 17 order of the Competition Commission of India (CCI) keeping in abeyance the approval granted for its 2019 deal with Amazon. However, in 2020, Future Group decided to sell its retail assets to Reliance Retail. Amazon initiated arbitration proceedings against the sale.</p></div><div class=\"tr-npp-body\"><p>Future argued in court that after the antitrust regulator's order, its application for termination of arbitration proceedings with Amazon should be decided before the start of the final hearing in the main arbitration case.</p><p>Declining the relief, the court said it cannot dictate a duly constituted tribunal on the manner in which it will carry out proceedings. Any interference would violate the autonomy of the tribunal, justice Amit Bansal said.</p><p>On Monday, the court had reserved its order on the petitions filed by Future group entities - Future Retail, and Future Future Coupons - and its promoters seeking to halt the arbitration proceedings at SIAC's Delhi-seated tribunal.</p><p>In a 21-page judgment, justice Bansal said that there was nothing to suggest the tribunal has denied equal opportunity to the parties, or that it has not been accommodating towards requests of the petitioners.</p><p>Amazon and Future have been locked in a bitter legal tussle after the US e-commerce firm dragged Future Group to arbitration at SIAC in October, arguing that the latter had violated their contract by entering into the deal with rival Reliance. Amazon approached Indian courts as well.</p><p>On October 21, the Singapore tribunal rejected the plea of Future Retail to lift the interim stay granted by its emergency arbitrator on October 25, 2020, observing that \"the award was correctly granted\".</p><p>The appeal by the company was filed at the international arbitration tribunal against the October 25 order, which had barred Future Retail from taking any step to dispose of or encumber its assets or issuing any securities to secure any funding from a restricted party.</p><p>Subsequently, a three-member tribunal was constituted to decide the issues arising from the deal.</p><p>On August 6, in a major victory for Amazon, the Supreme Court ruled that Future Group was bound by an emergency award that restrains it from a $3.4 billion sale of retail assets to Reliance.</p><p>The court said that all the parties in the present arbitration proceedings are big corporations and have a battery of lawyers representing them before multiple fora.</p><p>\"Even if some of the lawyers have tested positive for Covid-19, it can be duly expected that the parties and their law firms would endeavour to make alternate arrangements. An adjournment at the last minute cannot be sought in respect of an international commercial arbitration of this magnitude, involving arbitrators, counsels and experts from different jurisdictions,\" the court said.</p><p>Future Retail recently missed the last date for payment of Rs.3,494.56 crore to banks and others lenders as its assets sale deal was hampered due to its ongoing legal dispute with e-commerce giant Amazon.</p><p>Future Retail had said due to ongoing litigations with Amazon.com NV Investment Holdings LLC, the company was not able to complete the planned monetisation of the specified business on due date.\"The company would be co-operating for completing the monetisation of the specified business in next 30 days,\" the company had said. Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}