{"date": "2021-11-30 18:35:00.265000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>AWS Announces AWS Mainframe Modernization</b>\n</p><p class=\"bwalignc\">\n<span>AWS Mainframe Modernization makes it faster and easier for customers to migrate mainframe and legacy workloads to the cloud and benefit from the superior agility, elasticity, and cost savings of AWS</span>\n</p><p class=\"bwalignc\">\n<span>Banco Inter, Accenture, and DXC Technology among customers and partners using AWS Mainframe Modernization</span>\n</p><p>\nToday, at AWS re:Invent, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), announced AWS Mainframe Modernization, a new service that makes it faster and easier for customers to migrate mainframe and legacy workloads to the cloud, and enjoy the superior agility, elasticity, and cost savings of AWS. With AWS Mainframe Modernization, customers can refactor their mainframe workloads to run on AWS by transforming legacy applications into modern Java-based cloud services. Alternatively, customers can keep their applications as written and re-platform their workloads to AWS reusing existing code with minimal changes. A runtime environment built into AWS Mainframe Modernization provides the necessary compute, memory, and storage to run both refactored and replatformed applications and automatically handles the details of capacity provisioning, security, load balancing, auto-scaling, and application health monitoring. AWS Mainframe Modernization provides all the development, testing, and deployment tools necessary to automate the migration from mainframe and legacy environments to AWS. Customers and systems integrators (SIs) can use AWS Mainframe Modernization to help enterprise migration teams assess and analyze migration readiness and plan migration projects. There are no upfront costs for using AWS Mainframe Modernization, and customers only pay for the amount of compute provisioned. To learn more about AWS Mainframe Modernization, visit aws.amazon.com/mainframe-modernization.\n</p><p>\nUnder the best of circumstances, mainframe systems are complex, expensive, and difficult to scale. In today’s world, applications written for mainframe legacy systems also present significant operational challenges to customers compounded by the dwindling pool of engineers who specialize in these outdated technologies. Many organizations want to migrate their legacy applications to the cloud, but to do so they need to go through a lengthy migration process that is made more challenging by the complexity of mainframe applications. To migrate their mainframe workloads to AWS, organizations typically turn to SIs to lead modernization and migration projects. Migrating mainframe workloads to the cloud requires multiple steps to discover, access, migrate, test, and operate the new workload environments. Each step is complex and requires custom or third-party tooling that must be calibrated to each individual customer environment—before SIs can begin the intricate task of translating mainframe subsystems into cloud services. Aside from the migration itself, there is also the challenge of needing to configure, run, and operate these complex systems with modern application development and deployment best practices in the new cloud environments. As more customers want to modernize their infrastructure and migrate off of complex legacy technologies, they could benefit from better tools that make it easier for them to move to the cloud.\n</p><p>\nAWS Mainframe Modernization provides a complete development and runtime environment that makes it faster and easier for customers to migrate, modernize, and run their workloads on AWS. AWS Mainframe Modernization integrates the tools needed for migrations into a single environment to create an end-to-end migration pipeline. With AWS Mainframe Modernization, customers can refactor their workloads written for mainframes in legacy programming languages (e.g. COBOL) to modern Java-based cloud services. Or, customers can keep their workloads as written and re-platform them to AWS with minimal code changes. Whether customers choose to refactor or replatform their workloads, AWS Mainframe Modernization provides a runtime environment for the migrated applications that includes all the benefits of a fully managed service and automatically handles capacity provisioning, security, load balancing, auto-scaling, and application health monitoring. AWS Mainframe Modernization also provides continuous integration and continuous delivery (CI/CD) capabilities to enable modern application development and deployment best practices, so customers can operate their modernized workloads in production on an ongoing basis with the superior agility, elasticity, and cost savings of AWS. AWS Mainframe Modernization de-risks and accelerates the migration of mainframe and legacy workloads to AWS.\n</p><p>\n“More and more customers are modernizing their applications by moving them to the cloud to take advantage of the elasticity and agility of AWS and to reinvent customer experiences at a lower cost. But, for most enterprises, migrating their mainframe applications to the cloud is uncharted territory,” said William Platt, General Manager of Migration Services at AWS. “With today’s launch of AWS Mainframe Modernization, customers and systems integrators can now more quickly modernize their legacy mainframe workloads in a predictable way and get rid of much of the complexity and manual work involved in migrations. AWS Mainframe Modernization provides automation in discovery, analysis, migration, and testing phases, and it gives customers and systems integrators a managed runtime environment to deploy their replatformed and refactored mainframe workloads for their customers, which makes modernizing applications faster and easier.”\n</p><p>\nAWS Mainframe Modernization is available in preview today in US East (N. Virginia), US West (Oregon), Asia Pacific (Sydney), EU (Frankfurt), and South America (São Paulo) with availability in additional AWS Regions in the coming months.\n</p><p>\nEstablished in 1994, Banco Inter is the first fully digital bank in Brazil, which as of 2021 has served 15 million customers and expects to double its customer base within a few years. Its mission is to simplify banking and make it transparent and fair, with a one-stop shop that includes day-to-day banking, investments, credit card, insurance, loans, and even ecommerce. “The AWS Mainframe Modernization replatforming toolchain is effective for migrating mainframe applications to AWS with substantial cost savings,” said Guilherme Ximenes, Chief Technology Officer at Banco Inter S.A. “By using the AWS Mainframe Modernization managed runtime, we expect to simplify our card processor operations for enhanced resiliency and scalability. We are also excited by the DevOps CI/CD pipeline for increasing the agility we need to more quickly deliver new credit and debit card transaction capabilities to our customers.”\n</p><p>\nAccenture is a global professional services company with leading capabilities in digital, cloud, and security. “AWS Mainframe Modernization helps to simplify moving and managing mainframe applications,” said Chris Wegmann, Global Technology and Practice Lead at Accenture’s AWS Business Group. “The combination of AWS Mainframe Modernization with Accenture’s extensive experience in mainframe application modernization and managing mainframe applications now provides a way for clients to realize the agility, elasticity, and cost efficiency of AWS sooner.”\n</p><p>\nDXC Technology, a leading Fortune 500 global technology services company, provides mission-critical IT services that transform global businesses. “DXC is excited to be leading mainframe legacy application transformation and modernization, partnering with AWS on its AWS Mainframe Modernization platform,” said Rick Sullivan, Vice President and General Manager of Applications at DXC Technology. “DXC brings years of experience working with customers’ mainframe applications and modernization. We look forward to leveraging the new capabilities that AWS Mainframe Modernization will provide to complement our approach for enabling successful mainframe transformations on AWS.”\n</p><p>\n<b>About Amazon Web Services</b>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Faws.amazon.com%2F&amp;esheet=52542182&amp;newsitemid=20211130005966&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=1&amp;md5=c4f584de72a8d7480f43f27fcb8a9f18\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<b>About Amazon</b>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Famazon.com%2Fabout&amp;esheet=52542182&amp;newsitemid=20211130005966&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=2&amp;md5=c0b3fffab9536d4aa0019b60b3fe86d1\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211130005966r1&amp;sid=ny6r1&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTMwMDA1OTY2cjEmc2lkPW55NnIxJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=ab7a5c3657be2418302255a84e4bf48b35125e0a4765931030c11f4c34487643d005c698962d40759ee53b1cd5a3829d13c288147b4d440a85ea123b7d092039\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211130005966/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211130005966/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52542182&amp;newsitemid=20211130005966&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=3&amp;md5=0628ef86a31ecda3dd070996fce3d20a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NV-AMAZON.COM,-INC.</p></div>"}