{"date": "2022-02-22 20:50:59+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds comment from Amazon, paragraphs 3, 4</p><p class=\"tr-by\">By Daniel Wiessner</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Feb 22 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>A U.S. retail workers' union on Tuesday accused Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> of unlawfully interfering with a union election at an Alabama warehouse where the company had already been found to have engaged in unlawful conduct to deter labor organizing. </p><p>The Retail, Wholesale and Department Store Union (RWDSU) filed charges with the National Labor Relations Board (NLRB) claiming Amazon removed union literature from employee break rooms, limited workers' access to the warehouse before and after shifts and forced workers to attend anti-union meetings.</p><p><span class=\"tr-strong\">Amazon in a statement provided by spokesperson Kelly Nantel said it was confident it had fully complied with the law.</span></p><p><span class=\"tr-strong\">\"Our focus remains on working directly with our team to make Amazon a great place to work,\" the company said. </span></p><p>Scrutiny of working conditions at Amazon has intensified in recent months, with some employees seeking to organize at facilities in New York and Canada. A victory at even one warehouse would be a milestone that labor experts say could invigorate the U.S. labor movement.</p><p>The NLRB sent unionization ballots to workers at the Bessemer, Alabama, plant earlier this month and will tally the votes at the end of March. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2TR22W\" data-type=\"storyId\" data-story-id=\"nL1N2TR22W\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>The RWDSU was handily defeated in an election held last year, but the NLRB threw out those results after finding that Amazon unlawfully influenced the vote by encouraging workers to place ballots in a mailbox on company property. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2PA17Q\" data-type=\"storyId\" data-story-id=\"nL1N2PA17Q\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Amazon and a group of New York workers last week agreed tentatively on terms for a union election at a different warehouse, and an organizer said that vote would take place late next month. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2UR2FC\" data-type=\"storyId\" data-story-id=\"nL1N2UR2FC\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>The charges filed on Tuesday could lay the groundwork for the RWDSU to challenge the results of the pending election in Alabama if it loses. </p><p>The union said in the charges that meetings featuring anti-union messaging that Amazon workers are required to attend are coercive, and that workers should have the right to opt out of them.</p><p>So-called \"captive audience meetings\" are currently legal under U.S. labor law and are a common feature of employer campaigns to discourage unionizing. </p><p>But the general counsel of the NLRB, an appointee of Democratic President Joe Biden, recently said she wanted the board to reconsider that precedent. </p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Daniel Wiessner in New York; Editing by Lisa Shumaker and Jonathan Oatis)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:daniel.wiessner@thomsonreuters.com\" data-type=\"email\" translate=\"no\">daniel.wiessner@thomsonreuters.com</a> ; 518-414-0693) )</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-UNIONS/ALABAMA (UPDATE 2, PIX)</p></div>"}