{"date": "2021-12-01 19:49:12.009000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>American air carrier United Airlines has turned to Amazon subsidiary Amazon Web Services for helping drive digital innovation as its preferred Cloud provider.</p><p>The airline will receive machine learning, the Internet of things (IoT), databases, analytics, computing, storage and security capabilities from AWS.Currently, United Airlines has deployed several AWS solutions to enhance their customers' interaction with the airline.The carrier has introduced new features in its app and digital channels in order to aid customers in understanding Covid-19 travel curbs.Passengers can now fulfil their testing or vaccination needs according to the requirements of their specific destination through United's Travel-Ready Centre.They can easily upload testing and vaccination records, schedule a Covid-19 test and fill nation-specific forms in United's app and website.By using Amazon Elastic Kubernetes Service (Amazon EKS) and AWS' machine learning technology, United passengers can get their travel papers reviewed in real-time before reaching the airport.AWS' technology will also help in improving the airport operations and support airport workers to expand operations.The airline runs a companywide analytics and machine learning programme, which depends on AWS to bring efficiencies, deal with potential delays, and optimise new services.In addition, it installed Amazon SageMaker to forecast irregularity in operations and gain insights for improving customer service, baggage routing, and flight scheduling.United Airlines technology executive vice-president and chief digital officer Linda Jojo said: \"AWS's superior portfolio of products and services and its focus on continuous innovation for its customers is a complement to United's approach to technology.\"United has an established track record of developing new ways to use technology to improve the customer experience. Naming AWS as our preferred Cloud provider helps us to even further accelerate how we innovate and deliver even more personalised and scalable services for our customers and employees.\"In April, it was announced that San Francisco International Airport (SFO) and United Airlines will test SITA's Smart Path biometric solution.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}