{"date": "2022-02-25 00:00:00+00:00", "ticker": "AAL", "mrkt_info": {"open": 3532.5, "close": 3735.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>As he prepares to step down in April after nine years in the role, he leaves behind a completely altered company that has a pipeline of growth projects and a history of shareholder returns - an 18.5% average annual total shareholder return over the nine years - that place it at the front of its peers.</p>\n<p>\"It's a different world, and it's been a long road. We've been through a very significant transformation, and today, our company looks very different,\" Cutifani told Fastmarkets.</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>That change has required a restructuring, he said, and has led to a roughly 40% decline in unit operating costs in real terms over the period.</p>\n<p>\"The good news is we do have some growth - over the next 10 years it's around 35%, and by 2023 it's around 18%. We've got some growth, but we'd like to see if we can do a little bit more with some of the technology work that we're doing,\" he said in an interview.</p>\n<p>\"I think we're pretty well positioned. But like everyone, we're still building and investing in technology, we're investing in marketing, and we remain open to new opportunities,\" he added.</p>\n<p>In 2021, Anglo American recorded $45.55 billion in revenue, up by 63% from 2020, while its underlying earnings before interest, taxes, depreciation and amortization (Ebitda) more than doubled to $20.6 billion, from $9.8 billion the prior year. Its profits also rose to $17.6 billion in 2021 from $5.6 billion in 2020.</p>\n<p>Growth portfolio <br/> A key focus of growth for Anglo American right now is the Quellaveco copper project in Moquegua, Peru, scheduled to be commissioned in the middle of the year despite the company being forced to temporarily pause work due to Covid-19 restrictions in 2020.</p>\n<p>The greenfield mine will produce around 300,000 tonnes of copper annually, of which Anglo American receives 180,000 tonnes due to its 60% ownership stake. The company produced 647,200 tonnes of copper in 2021.</p>\n<p>Copper is, Cutifani said, one of the raw materials that will need to see significant production growth if it is to meet the demand requirements of the energy transition due to its use in electrification as well as panels for renewable energy.</p>\n<p>To that end, the large majority of Anglo American's output and investment capital going forward is focused on the metals and minerals essential for decarbonization and to meet global consumer demand.</p>\n<p>\"We [the world] are short of raw materials. In copper, for example, you see a few projects, including by ourselves at Quellaveco, but you've also got old capacity falling away. So, [the industry is] replacing and introducing some new capacity, but realistically we're going to need 40-50% growth in the copper market to satisfy what will be required for the energy transition,\" he said.</p>\n<p>\"My fear over the next 10 years is that we're still going to be short [on] copper,\" he added.</p>\n<p>As supply-demand dynamics kick in - tight markets typically beget higher prices, as is already being seen across metals like copper, nickel, and cobalt - it is often common for consumers to look for alternative materials, Cutifani noted.</p>\n<p>\"[Tesla CEO] Elon Musk made it very clear - if the copper price doubles then Tesla would need to look at reducing the amount of copper it uses,\" he said.</p>\n<p>Cobalt has already been particularly exposed to substitution, he added, referring to the push by battery producers to engineer the mineral out of its technologies, turning to nickel-rich batteries in its place.</p>\n<p>\"The world will find a way technically but at the same time if it's not going to use copper, for instance, it's going to be using another metal,\" Cutifani said.</p>\n<p>Also in the company's growth plan is the Woodsmith fertilizer project in North Yorkshire, the United Kingdom, which will produce a low-carbon fertilizer certified for organic use; the Sakatti multi-metal deposit in Finland; and new expansion phases planned at the vast Collahuasi copper mine in Chile.</p>\n<p>Cutifani said the company meanwhile has options to debottleneck its Grosvenor and Moranbah coal operations - where a decision on expanding the processing facilities is expected next year - and is working on an underground operation at the Los Bronces copper mine in Chile.</p>\n<p>Anglo American's 40% shareholding in Samancor, meanwhile, gives it access to manganese operations in South Africa, a sector Cutifani favors for the long term, both in terms of steel and other specialty metals, including batteries.</p>\n<p>What about adding lithium, another key raw material sought-after due to its role in battery cathodes, to the Anglo American portfolio? Yes, Cutifani said, but it's \"expensive to buy [lithium projects] out of the blocks at the moment, given everybody is chasing it.\"</p>\n<p>But with the company actively exploring in a number of countries, it's possible it might discover a lithium project option.</p>\n<p>\"If we kick our toe on some lithium, as long as it is competitive, we'd be very open to developing it. But at the moment, [lithium projects are] a little more expensive to buy and we have a number of better options inside the portfolio. We don't need to chase it, and we are hoping exploration will yield a few results as well,\" Cutifani added.</p>\n<p>Investor focus <br/> Environmental, social and governance (ESG) issues have become a far more regular conversation with shareholders than in prior years; according to Cutifani, perhaps 60% of its investors want to discuss ESG versus 10-15% just three or four years ago.</p>\n<p>\"They [shareholders] genuinely are engaged. Clearly, they're being asked to justify investments in companies on the basis of their environmental footprint or the commitment they're making to climate change. So, we see them as being very serious conversations,\" he said.</p>\n<p>Anglo American's demerger from thermal coal, for instance, was well-received, he noted, with the focus on ESG something he expects to continue.</p>\n<p>There's also increasing attention by consumers on the provenance of material in order to ensure it meets all core ESG standards, Cutifani said.</p>\n<p>\"For us, ESG is part of our core business, so we're getting automotive companies coming to us and saying, 'we use 18 metals and minerals, could we contract with you to supply all our raw materials and at the same time give us that certificate that says this is conflict-free, ethically sourced, all those sorts of things,'\" he said.</p>\n<p>Standards like the Initiative for Responsible Mining Assurance (IRMA) are becoming more important as a result and are critical differentiating points for the company as well, Cutifani noted.</p>\n<p>Tracking and tracing materials to provide supply chain transparency can be aided by digital technology such as blockchain, something the company has been using at its diamonds business, De Beers, for some time.</p>\n<p>The end result, Cutifani said, may be that De Beers blockchain system Tracr is rolled out company-wide, becoming a standard package across all its minerals stream.</p>\n<p>Cutifani steps down on April 19, and will be replaced by Duncan Wanblad, currently the miner's head of strategy and business development.</p>\n<p>\"I'm really pleased to see Duncan, an internal appointment, take over the role. I'm very excited for Anglo American's future,\" Cutifani added. <br/>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Euromoney Institutional Investor PLC.</p></div>"}