{"date": "2022-01-17 19:41:49.008000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">Denison Announces Intersection of 24.9% eU3O8 over 4.2 metres extending beyond high-grade domain at Phoenix Zone A</p>\n<p>TORONTO, Feb. 16, 2022</p>\n<p>\n\n</p>\n<p>\n<span>TORONTO</span> , <span>Feb. 16, 2022</span> /CNW/ - <span>Denison Mines Corp.</span> (\"Denison\" or the \"Company\") (TSX: DML) (NYSE American: DNN) is pleased to announce multiple intersections of high-grade uranium mineralization beyond the previously defined extents of the high-grade domain in the Phase 1 area of the Zone A portion of the <span>Phoenix</span> uranium deposit (\"Phoenix\") at the Company's effective 95%-owned Wheeler River Uranium Project (\"Wheeler River\" or the \"Project\") in northern <span>Saskatchewan</span> . <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3445334-1&amp;h=3613961970&amp;u=https%3A%2F%2Fmma.prnewswire.com%2Fmedia%2F1747718%2F20220216_WRX_PhoenixFieldProgramPressRelease_VFinal_ID_234f0d5bfeb6_1.pdf&amp;a=View+PDF+version\" data-type=\"url\" class=\"tr-link\" translate=\"no\">View PDF version</a> .</p>\n<p>Three drill holes were completed during the fall of 2021 to follow up the discovery of high-grade uranium mineralization (22.0% eU <span>3</span> O <span>8</span> over 8.6 metres) in drill hole GWR-045, which was located outside of the previously defined extent of the high-grade domain of Phoenix Zone A (see Denison's news release dated <span>July 29, 2021</span> ). All three follow-up holes returned intervals of high-grade uranium mineralization, including massive uraninite mineralization in GWR-049.</p>\n<ul class=\"bulleted-list arrowlist\">\n<li>\n<span>24.9% eU <span>3</span> O <span>8</span> over 4.2 metres in GWR-049:</span> This drill hole was expected to intersect only a narrow interval of high-grade uranium mineralization along the northwestern boundary of the Phoenix Zone A high-grade resource domain, approximately 17 metres to the northeast of GWR-045. The drill hole intersected a thick interval of high-grade unconformity-associated uranium mineralization that, coupled with the results of GWR-045, is expected to expand the volume of the high-grade domain to the northwest outside of the extents of the same in the current resource model (see Figures 1 and 3).</li>\n<li>\n<span>3.6% eU <span>3</span> O <span>8</span> over 3.5 metres in WR-787:</span> This drill hole was designed to test the extents of the high-grade mineralization discovered in GWR-049, by targeting the unconformity approximately 6 metres north of the mineralization in GWR-049 (see Figures 1 and 3). Mineralization in WR-787 was encountered at the unconformity, and included a mineralized interval grading 15.2% eU <span>3</span> O <span>8</span> over 0.7 metres.</li>\n<li>\n<span>1.2% eU <span>3</span> O <span>8</span> over 2.1 metres in WR-784:</span> This drill hole was designed to test the extents of high-grade mineralization discovered by drill hole GWR-045, by targeting the unconformity approximately 6 metres northwest of the mineralized intersection in GWR-045 (see Figures 1 and 2). The drill hole intersected perched uranium mineralization grading 1.2% eU <span>3</span> O <span>8</span> over 2.1 metres, lying approximately 6.5 metres above the unconformity.</li>\n</ul>\n<p>\n<span>Andy Yackulic</span> , P. Geo., Denison's Director, Exploration, commented, <span>\n<span>\"The grade and thickness of mineralization in holes GWR-045 and G</span>\n</span>\n<span>\n<span>WR-049 significantly exceeded what was predicted by the <span>Phoenix</span> block model. We believe these results will support an expansion of the volume of the high-grade mineralized domain in Phase 1 area of Zone A. Follow-up drilling encountered additional uranium mineralization that is also expected to be additive to future updates to the resource model for Phoenix Zone A. Of particular interest is the perched mineralization discovered in WR-784, which presents a style of mineralization that has not been previously encountered at <span>Phoenix</span> . As this intersection is located outside the extents of previous drilling at <span>Phoenix</span> , the potential exists to identify additional perched mineralization along the northwest margin of the Deposit.\"</span>\n</span>\n</p>\n<p>\n<span>This press release constitutes a \"designated news release\" for the purposes of the Company's prospectus supplement dated <span>September 28, 2021</span> , to its short form base shelf prospectus dated <span>September 16, 2021</span> .</span>\n</p>\n<p>\n<span>Assay Results and Radiometric Equivalent Grades</span>\n</p>\n<p>The final assay results from the follow-up holes and GWR-045 were recently received, and confirmed the presence of high-grade mineralization in each drill hole. However, the Company is reporting radiometric equivalent grades (\"eU <span>3</span> O <span>8</span> \") for these holes, instead of final assay results, as significant core loss was encountered in each of these mineralized intervals.</p>\n<p>The Company may report results as preliminary eU <span>3</span> O <span>8</span> , derived from a calibrated downhole total gamma probe, and subsequently report definitive assay grades following sampling and chemical analysis of the mineralized drill core. In the case where core recovery within a mineralized intersection is less than 80%, meaning that samples may not be assayed with enough resolution to be considered representative of the nature and grade of the mineralization, radiometric grades are considered to be more representative of the mineralized intersection and may be reported in the place of assay grades. Radiometric equivalent probe results are subject to verification procedures by qualified persons employed by Denison prior to disclosure.</p>\n<p>For further details on the total gamma downhole probe methods employed by Denison, QAQC procedures and data verification procedures please see Denison's Annual Information Form dated <span>March 26, 2021</span> filed under the Company's profile on SEDAR ( <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3445334-1&amp;h=4012026118&amp;u=http%3A%2F%2Fwww.sedar.com%2F&amp;a=www.sedar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.sedar.com</a> ).</p>\n<p>\n<span>Summary of 2021 Phoenix Expansion Drill Results</span>\n</p>\n<p>Figure 1 illustrates the location of the drill holes completed as part of the Company's 2021 expansion drilling at Phoenix Zone A, including the position of the five-spot commercial scale well pattern installed during the summer of 2021 (see Denison's news related dated <span>July 29, 2021</span> ).</p>\n<p>Figure 2 illustrates the previously defined extents of the Phoenix Zone A low-grade and high-grade domains, on section with the interpreted results from GWR-045 and WR-784.</p>\n<p>Figure 3 illustrates the previously defined extents of Phoenix Zone A low-grade and high-grade domains, on section with the interpreted results from GWR-049 and WR-787.</p>\n<p>The mineralized intervals from each of these drill holes are summarized in the table below:</p>\n<p>\n<span>Table 1 – Phoenix Zone A – Select 2021 Mineralized Intersections</span>\n</p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>\n<span>Drill Hole</span>\n</span>\n</p>\n</td>\n<td>\n<p>\n<span>\n<span>From (m)</span>\n</span>\n</p>\n</td>\n<td>\n<p>\n<span>\n<span>To (m)</span>\n</span>\n</p>\n</td>\n<td>\n<p>\n<span>\n<span>Length (m) <span>(1)</span>\n</span>\n</span>\n</p>\n</td>\n<td>\n<p>\n<span>\n<span>eU <span>3</span> O <span>8</span> (%) <span>(2,3)</span>\n</span>\n</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>GWR-045</span>\n</p>\n</td>\n<td>\n<p>\n<span>406.95</span>\n</p>\n</td>\n<td>\n<p>\n<span>415.55</span>\n</p>\n</td>\n<td>\n<p>\n<span>8.6</span>\n</p>\n</td>\n<td>\n<p>\n<span>22.0 <span>(4)</span>\n</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>GWR-049</span>\n</p>\n</td>\n<td>\n<p>\n<span>408.95</span>\n</p>\n</td>\n<td>\n<p>\n<span>413.15</span>\n</p>\n</td>\n<td>\n<p>\n<span>4.2</span>\n</p>\n</td>\n<td>\n<p>\n<span>24.9 <span>(4)</span>\n</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>WR-784</span>\n</p>\n</td>\n<td>\n<p>\n<span>406.25</span>\n</p>\n</td>\n<td>\n<p>\n<span>408.35</span>\n</p>\n</td>\n<td>\n<p>\n<span>2.1</span>\n</p>\n</td>\n<td>\n<p>\n<span>1.2</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>WR-787</span>\n</p>\n</td>\n<td>\n<p>\n<span>411.40</span>\n</p>\n</td>\n<td>\n<p>\n<span>415.90</span>\n</p>\n</td>\n<td>\n<p>\n<span>4.5</span>\n</p>\n</td>\n<td>\n<p>\n<span>3.6</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\n<span>including</span>\n</span>\n</p>\n</td>\n<td>\n<p>\n<span>413.00</span>\n</p>\n</td>\n<td>\n<p>\n<span>413.70</span>\n</p>\n</td>\n<td>\n<p>\n<span>0.7</span>\n</p>\n</td>\n<td>\n<p>\n<span>15.2 <span>(4)</span>\n</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td colspan=\"2\">\n</td></tr>\n<tr>\n<td colspan=\"2\">\n<p>\n<span>Notes:</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>1.</span>\n</p>\n</td>\n<td>\n<p>\n<span>As the drill holes are oriented vertically and the mineralization is interpreted to lie nearly horizontal, the drill intersection is interpreted to represent the true thickness.</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>2.</span>\n</p>\n</td>\n<td>\n<p>\n<span>eU <span>3</span> O <span>8</span> is a radiometric equivalent grade U <span>3</span> O <span>8</span> derived from a calibrated total gamma down-hole probe.</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>3.</span>\n</p>\n</td>\n<td>\n<p>\n<span>Composited above a cut-off grade of 0.1% eU <span>3</span> O <span>8</span> unless otherwise indicated.</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>4.</span>\n</p>\n</td>\n<td>\n<p>\n<span>Composited above a cut-off grade of 1.0% eU <span>3</span> O <span>8</span>\n</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>Sampling and Assay Procedures</span>\n</p>\n<p>Drill core with anomalous total gamma radioactivity (&gt;300 counts per second using an RS-120 or RS-125 scintillometer) was sampled over 0.5 metre intervals. Sampling is undertaken on site by splitting the core in half, with one half submitted for analysis and the other half retained in the core box for future reference. Uranium chemical assays are performed by the Saskatchewan Research Council (\"SRC\") Geoanalytical Laboratories located in Saskatoon. Sample preparation involves crushing and pulverizing core samples to 90% passing -106 microns. Splits of the resultant pulps are initially submitted for multi-element ICP-MS analysis following partial (HNO3:HCl) and total (HF:HNO3:HClO4) digestions. Samples with ≥ 1,000 ppm U (partial digest) are re-assayed for U <span>3</span> O <span>8</span> using an ISO/IEC 17025:2005 accredited method for the determination of U <span>3</span> O <span>8</span> weight percentage. Pulp splits are digested using aqua-regia, and the solution is analyzed for U <span>3</span> O <span>8</span> weight percentage using ICP-OES. In addition to internal checks by SRC Geoanalytical Laboratories, the Company has rigorous quality assurance and quality control (\"QAQC\") procedures, including the insertion of standard reference materials, blanks and field duplicates. The assay data is subject to verification procedures by qualified persons employed by Denison prior to disclosure. For further details on the assay, QAQC and data verification procedures, please see Denison's Annual Information Form dated <span>March 26, 2021</span> , filed under the Company's profile on SEDAR ( <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3445334-1&amp;h=4012026118&amp;u=http%3A%2F%2Fwww.sedar.com%2F&amp;a=www.sedar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.sedar.com</a> ).</p>\n<p>\n<span>\n<span>About Wheeler River</span>\n</span>\n</p>\n<p>\n<span>Wheeler River is the largest undeveloped uranium project in the infrastructure rich eastern portion of the <span>Athabasca</span> Basin region, in northern <span>Saskatchewan</span> – including combined Indicated Mineral Resources of 132.1 million pounds U <span>3</span> O <span>8</span> (1,809,000 tonnes at an average grade of 3.3% U <span>3</span> O <span>8</span> ), plus combined Inferred Mineral Resources of 3.0 million pounds U <span>3</span> O <span>8</span> (82,000 tonnes at an average grade of 1.7% U <span>3</span> O <span>8</span> ). The project is host to the high-grade <span>Phoenix</span> and Gryphon uranium deposits, discovered by Denison in 2008 and 2014, respectively, and is a joint venture between Denison (operator) and JCU ( <span>Canada</span> ) Exploration Company Limited (\"JCU\"). Denison has an effective 95% ownership interest in Wheeler River (90% directly, and 5% indirectly through a 50% ownership in JCU).</span>\n</p>\n<p>\n<span>A PFS was completed for Wheeler River in 2018, considering the potential economic merit of developing the <span>Phoenix</span> deposit as an ISR operation and the Gryphon deposit as a conventional underground mining operation. Taken together, the Project is estimated to have mine production of 109.4 million pounds U <span>3</span> O <span>8</span> over a 14-year mine life, with a base case pre-tax NPV of <span>$1.31 billion</span> (8% discount rate), Internal Rate of Return (\"IRR\") of 38.7%, and initial pre-production capital expenditures of <span>$322.5 million</span> . The Phoenix ISR operation is estimated to have a stand-alone base case pre-tax NPV of <span>$930.4 million</span> (8% discount rate), IRR of 43.3%, initial pre-production capital expenditures of <span>$322.5 million</span> , and industry-leading average operating costs of <span>US$3.33</span> /lb U <span>3</span> O <span>8</span> . The PFS is prepared on a project (100% ownership) and pre-tax basis, as each of the partners to the Wheeler River Joint Venture are subject to different tax and other obligations.</span>\n</p>\n<p>\n<span>Further details regarding the PFS, including additional scientific and technical information, as well as after-tax results attributable to Denison's ownership interest, are described in greater detail in the NI 43-101 Technical Report titled \"Pre-feasibility Study for the Wheeler River Uranium Project, <span>Saskatchewan, Canada</span> \" dated <span>October 30, 2018</span> , with an effective date of <span>September 24</span> , 2018. A copy of this report is available on Denison's website and under its profile on SEDAR at <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3445334-1&amp;h=4012026118&amp;u=http%3A%2F%2Fwww.sedar.com%2F&amp;a=www.sedar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.sedar.com</a> and on EDGAR at <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3445334-1&amp;h=1186591817&amp;u=http%3A%2F%2Fwww.sec.gov%2Fedgar.shtml&amp;a=www.sec.gov%2Fedgar.shtml\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.sec.gov/edgar.shtml</a> .</span>\n</p>\n<p>\n<span>Denison suspended certain activities at Wheeler River during 2020, including the EA process, which is on the critical path to achieving the project development schedule outlined in the PFS. While the EA process has resumed, the Company is not currently able to estimate the impact to the project development schedule outlined in the PFS, and users are cautioned against relying on the estimates provided therein regarding the start of pre-production activities in 2021 and first production in 2024.</span>\n</p>\n<p>\n<span>\n<span>About Denison</span>\n</span>\n</p>\n<p>\n<span>Denison is a uranium exploration and development company with interests focused in the <span>Athabasca</span> Basin region of northern <span>Saskatchewan, Canada</span> . In addition to its effective 95% interest in the Wheeler River project, Denison's interests in the <span>Athabasca</span> Basin include a 22.5% ownership interest in the McClean Lake joint venture, which includes several uranium deposits and the McClean Lake uranium mill that is contracted to process the ore from the Cigar Lake mine under a toll milling agreement, plus a 25.17% interest in the Midwest Main and Midwest A deposits, and a 66.90% interest in the Tthe Heldeth Túé (\"THT,\" formerly J Zone) and Huskie deposits on the Waterbury Lake property. The Midwest Main, Midwest A, THT and Huskie deposits are each located within 20 kilometres of the McClean Lake mill.</span>\n</p>\n<p>\n<span>Through its 50% ownership of JCU, Denison holds additional interests in various uranium project joint ventures in <span>Canada</span> , including the Millennium project (JCU 30.099%), the Kiggavik project (JCU 33.8123%) and <span>Christie Lake</span> (JCU 34.4508%). Denison's exploration portfolio includes further interests in properties covering ~280,000 hectares in the <span>Athabasca</span> Basin region.</span>\n</p>\n<p>\n<span>Denison is also engaged in mine decommissioning and environmental services through its Closed Mines group (formerly Denison Environmental Services), which manages Denison's <span>Elliot Lake</span> reclamation projects and provides third-party post-closure mine care and maintenance services.</span>\n</p>\n<p>Follow Denison on Twitter @DenisonMinesCo</p>\n<p>\n<span>Qualified Persons</span>\n</p>\n<p>\n<span>The technical information contained in this release has been reviewed and approved by Mr. <span>Andrew Yackulic</span> , P. Geo., Denison's Director, Exploration, who is a Qualified Person in accordance with the requirements of NI 43-101.</span>\n</p>\n<p>\n<span>Cautionary Statement Regarding Forward-Looking Statements</span>\n</p>\n<p>\n<span>Certain information contained in this news release constitutes 'forward-looking information', within the meaning of the applicable <span>United States</span> and Canadian legislation, concerning the business, operations and financial performance and condition of Denison.</span>\n</p>\n<p>\n<span>Generally, these forward-looking statements can be identified by the use of forward-looking terminology such as 'plans', 'expects', 'budget', 'scheduled', 'estimates', 'forecasts', 'intends', 'anticipates', or 'believes', or the negatives and/or variations of such words and phrases, or state that certain actions, events or results 'may', 'could', 'would', 'might' or 'will be taken', 'occur', 'be achieved' or 'has the potential to'.</span>\n</p>\n<p>\n<span>In particular, this news release contains forward-looking information pertaining to the following: the interpretation of exploration results and expectations with respect thereto, including expansion of the volume of the high-grade domain in, or other ipmacts on, the Company's mineral resource estimation for Wheeler River and the interpreted potential to identify further mineralization; other evaluation activities, objectives and expectations; and expectations regarding its joint venture ownership interests and the continuity of its agreements with its partners and third parties.</span>\n</p>\n<p>\n<span>Forward looking statements are based on the opinions and estimates of management as of the date such statements are made, and they are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of Denison to be materially different from those expressed or implied by such forward-looking statements. For example, the modelling and assumptions upon which the work plans are based may not be maintained after further testing or be representative of actual conditions within the <span>Phoenix</span> deposit. In addition, Denison may decide or otherwise be required to discontinue its field test activities or other testing, evaluation and development work at Wheeler River if it is unable to maintain or otherwise secure the necessary resources (such as testing facilities, capital funding, regulatory approvals, etc.) or operations are otherwise affected by COVID-19 and its potentially far-reaching impacts. Denison believes that the expectations reflected in this forward-looking information are reasonable but no assurance can be given that these expectations will prove to be accurate and results may differ materially from those anticipated in this forward-looking information. For a discussion in respect of risks and other factors that could influence forward-looking events, please refer to the factors discussed in Denison's Annual Information Form dated <span>March 26, 2021</span> or subsequent quarterly financial reports under the heading 'Risk Factors'. These factors are not, and should not be construed as being exhaustive.</span>\n</p>\n<p>\n<span>Accordingly, readers should not place undue reliance on forward-looking statements. The forward-looking information contained in this news release is expressly qualified by this cautionary statement. Any forward-looking information and the assumptions made with respect thereto speaks only as of the date of this news release. Denison does not undertake any obligation to publicly update or revise any forward-looking information after the date of this news release to conform such information to actual results or to changes in Denison's expectations except as otherwise required by applicable legislation.</span>\n</p>\n<p>\n<span>\n<span>Cautionary Note to United States Investors Concerning Estimates of Mineral Resources and Mineral Reserves:</span>\n</span>\n<span>This press release may use terms such as \"measured\", \"indicated\" and/or \"inferred\" mineral resources and \"proven\" or \"probable\" mineral reserves, which are terms defined with reference to the guidelines set out in the Canadian Institute of Mining, Metallurgy and Petroleum (\"CIM\") CIM Definition Standards on Mineral Resources and Mineral Reserves (\"CIM Standards\"). The Company's descriptions of its projects using CIM Standards may not be comparable to similar information made public by U.S. companies subject to the reporting and disclosure requirements under <span>the United States</span> federal securities laws and the rules and regulations thereunder. <span>United States</span> investors are cautioned not to assume that all or any part of measured or indicated mineral resources will ever be converted into mineral reserves. United States investors are also cautioned not to assume that all or any part of an inferred mineral resource exists, or is economically or legally mineable.</span>\n</p>\n<p>\n<span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3445334-1&amp;h=3463702942&amp;u=https%3A%2F%2Fmma.prnewswire.com%2Fmedia%2F1747646%2FDenison_Mines_Corp__Denison_Announces_Intersection_of_24_9__eU3O_2.jpg%3Fp%3Doriginal&amp;a=Figure+1+-+Plan+Map+Showing+Location+of+Phoenix+Deposit+(Phase+1)+%E2%80%93+ISR+Test+Pattern+and+exploration+holes+WR-784+and+WR-787\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Figure 1 - Plan Map Showing Location of Phoenix Deposit (Phase 1) – ISR Test Pattern and exploration holes WR-784 and WR-787</a>\n</span>\n</p>\n<p>\n\n</p>\n<p>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3445334-1&amp;h=3425211671&amp;u=https%3A%2F%2Fmma.prnewswire.com%2Fmedia%2F1747647%2FDenison_Mines_Corp__Denison_Announces_Intersection_of_24_9__eU3O_3.jpg%3Fp%3Doriginal&amp;a=Figure+2%C2%A0-+Cross-Section+View+of+the+Phoenix+Deposit+(Phase+1)+%E2%80%93+Through+GWR-045+and+WR-784\">\n<span>Figure</span>\n<span>2</span>\n<span>- Cross-Section View of the Phoenix Deposit (Phase 1) – Through GWR-045 and WR-784</span>\n</a>\n</p>\n<p>\n\n</p>\n<p>\n<span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3445334-1&amp;h=2227320565&amp;u=https%3A%2F%2Fmma.prnewswire.com%2Fmedia%2F1747649%2FDenison_Mines_Corp__Denison_Announces_Intersection_of_24_9__eU3O_4.jpg%3Fp%3Doriginal&amp;a=Figure+3+-+Cross-Section+View+of+the+Phoenix+Deposit+(Phase+1)+%E2%80%93+Through+GWR-049+and+WR-787\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Figure 3 - Cross-Section View of the Phoenix Deposit (Phase 1) – Through GWR-049 and WR-787</a>\n</span>\n</p>\n<p>\n\n</p>\n<p>\n\n</p>\n<p>View original content to download multimedia: <a href=\"https://www.prnewswire.com/news-releases/denison-announces-intersection-of-24-9-eu3o8-over-4-2-metres-extending-beyond-high-grade-domain-at-phoenix-zone-a-301483266.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/denison-announces-intersection-of-24-9-eu3o8-over-4-2-metres-extending-beyond-high-grade-domain-at-phoenix-zone-a-301483266.html</a>\n</p>\n<p>SOURCE Denison Mines Corp.</p>\n<p>View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/February2022/16/c7934.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/February2022/16/c7934.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}