{"date": "2021-09-23 08:10:36.910000+00:00", "ticker": "III", "mrkt_info": {"open": 1297.0, "close": 1328.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 7488M3i Infrastructure PLC23 September 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>3i Infrastructure plc agrees to sell Oystercatcher's four European terminals</span>\n</p>\n<p class=\"tr-npp-section-title\">\n<span>\n</span></p>\n<p class=\"tr-npp-section-title\">\n<span>23 SEPTEMBER 2021</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Further to the announcement dated 22 July 2021, 3i Infrastructure plc (\"3i Infrastructure\" or the \"Company\") is pleased to announce that it has now entered into an agreement to sell its 45% stakes in four European liquid storage terminals to Evos through its entity Evos Finance B.V., who will also acquire the 55% stakes in the terminals held by co-shareholder Oiltanking GmbH (\"Oiltanking\").</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The four terminals are Oiltanking Amsterdam B.V., Oiltanking Ghent N.V., Oiltanking Malta Limited and Oiltanking Terneuzen B.V., which collectively provide</span>\n<span>3.8 million cubic metres of liquid storage capacity and associated services to a diverse range of customers</span>\n<span>.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Following completion of this transaction, 3i Infrastructure will retain its 45% stake in Oiltanking Singapore Limited, alongside Oiltanking's 55% stake.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The sale is conditional on certain third party consents. Completion is expected to occur in Q4 2021. The proceeds from the transaction will be used to repay debt and related break costs of 3i Infrastructure's holding company, Oystercatcher. The balance of the proceeds will be distributed to 3i Infrastructure, which we estimate will not exceed c.€50 million. The sale price achieved implies an increase in 3i Infrastructure's NAV of c. €110 million or c.10p per share, before any revision to the value of Oiltanking Singapore Limited, and this increases Oystercatcher's unrealised money multiple to 2.8x and unrealised IRR to 13.5% over the Company's 14 year investment period.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>During 3i Infrastructure's ownership, the terminals have benefitted from strong, long-term demand for liquid storage capacity and have achieved consistently high utilisation levels. Our partnership with Oiltanking has seen the terminals invest to upgrade and expand storage and jetty capacity and improve environmental and safety performance, and thereby remain the terminals of choice for their customers.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Richard Laing, Chair of 3i Infrastructure, commented:</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\"3i Infrastructure was a pioneer among infrastructure investors into the liquids storage sector 14 years ago and Oystercatcher has proven a good investment for the Company over that period. Now is an appropriate time for the four European terminals to move to new ownership, well-placed to support them into the future.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Phil White, Managing Partner and Head of Infrastructure, 3i Investments plc, Investment Manager of the Company, added:</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\"Oystercatcher is another successful investment for the Company and we have achieved a sale of the European terminals at an attractive price. The management and staff of all four terminals have been a pleasure to work with throughout the life of our investment and we thank them for their commitment and excellent performance over that time. We wish them every success under new ownership.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>-ENDS-</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>For further information, contact:</span>\n</p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>\n</span></p>\n<p>\n<span>Thomas Fodor</span>\n</p>\n<p>\n<span>Investor enquiries</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Kathryn van der Kroft</span>\n</p>\n<p>\n<span>Media enquiries</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n<p>\n<span>Tel: +44 207 975 3469</span>\n</p>\n<p>\n<span>Email:</span>\n<span>\n<a href=\"mailto:thomas.fodor@3i.com\" data-type=\"email\" translate=\"no\">thomas.fodor@3i.com</a>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Tel: +44 20 7975 3021</span>\n</p>\n<p>\n<span>Email:</span>\n<span>\n<a href=\"mailto:kathryn.vanderkroft@3i.com\" data-type=\"email\" translate=\"no\">kathryn.vanderkroft@3i.com</a>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<p>\n<span>Notes to editors:</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>3i Infrastructure plc</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>3i Infrastructure plc is a Jersey-incorporated, closed-ended investment company, an approved UK Investment Trust, listed on the London Stock Exchange and regulated by the Jersey Financial Services Commission. It is a long-term investor in infrastructure businesses and assets. Its market focus is on economic infrastructure and greenfield projects in developed economies, principally in Europe, investing in operating businesses and projects which generate long-term yield and capital growth.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>3i Investments plc, a wholly-owned subsidiary of 3i Group plc, is authorised and regulated in the UK by the Financial Conduct Authority and is the investment manager of 3i Infrastructure plc.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>MSCGRGDCBDDDGBX</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}