{"date": "2022-02-24 15:34:51.380000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon on Thursday launched in India its second-generation Echo Buds wireless earbuds with active noise cancellation and hands-free Alexa at Rs 11,999. Compatible with Android and iOS phones with support for Google Assistant and Siri through customisable tap controls, the Echo Buds 2nd Gen will be available with wireless charging case at Rs 13,999. Important to note, prices of both the models include limited-period discount of Rs 1,000.</p><p>The Echo Buds 2nd Gen boasts a high-performance audio driver for balanced sound with extended dynamic range. According to Amazon, the audio drivers are optimised for increased fidelity in bass and treble, which reduces distortion during media playback. The earbuds feature ANC technology, which cancels the ambient noise. According to Amazon, ANC is activated by pressing and holding the control button on either earbud, or through voice command using Alexa. With ANC, the earbuds also have ambience mode called Passthrough.</p></div><div class=\"tr-npp-body\"><p>The Echo Buds 2nd Gen are IPX4-rated to withstand splashes, sweat, or light rain. The earbuds have a short nozzle and built-in vents to reduce in-ear pressure while in use. They come with four ear tip sizes and two wing tip sizes. Amazon says, the Echo Buds 2nd Gen offers up to five hours of music playback on a single charge with Active Noise Cancellation and Alexa wake word enabled, with additional power for a total of up to 15 hours of music playback with the case. The Echo Buds can be charged via USB-C (comes with the box) and the wireless option can be charged with compatible Qi-certified wireless charging pads (to be purchased separately).</p><p>With Alexa built-in, the Echo Buds 2nd Gen can be used hands-free to listen to songs on Amazon Prime Music, Hungama, JioSaavn, Gaana, Apple Music, Spotify or audiobooks available on Audible, and stories narrated by celebrities available on Audible Suno.</p><p>The Echo Buds connect to compatible smartphones through the Alexa app. They sport a combination of three microphones to detect speech for voice controls, and more. The earbuds have privacy protections built-in, including the ability to mute the mics with the Alexa app or through the customisable on-bud tap controls.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Business Standard Ltd.</p></div>"}