{"date": "2021-11-30 22:05:38.494000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>SEATTLE - Workers at an Amazon warehouse in Bessemer, Ala., are going to get a second shot at unionizing, after a National Labor Relations Board official called for a revote after finding that the e-commerce giant improperly interfered in the first election.</p><p>It's a major victory for the Retail, Wholesale and Department Store Union, which was vanquished in the first vote at the warehouse last spring, with workers rejecting unionization by more than 2 to 1. That union and others have been working to crack Amazon, now the United States' second-largest private employer, which employs nearly 1 million workers at its U.S. warehouses.</p></div><div class=\"tr-npp-body\"><p>Getting a second chance at organizing Bessemer workers is \"a big deal\" for the union, said Rebecca Givan, a labor studies professor at Rutgers University.</p><p>\"It confirms what workers have been saying,\" Givan said, \"that Amazon went too far.\"</p><p>The do-over will bring the high-profile campaign back to the warehouse, which opened in March 2020.</p><p>The NLRB's Atlanta region director, Lisa Y. Henderson, in her decision ripped Amazon's \"flagrant disregard\" for an agency procedure to make union elections free and fair. She expressed displeasure with the company's efforts to place an unmarked U.S. Postal Service mailbox in front of the warehouse just after voting started, writing that Amazon \"essentially highjacked the process and gave a strong impression that it controlled the process.\"</p><p>The RWDSU, which is working to unionize the staff in Bessemer, applauded the decision.</p><p>\"Today's decision confirms what we were saying all along - that Amazon's intimidation and interference prevented workers from having a fair say in whether they wanted a union in their workplace - and as the Regional Director has indicated, that is both unacceptable and illegal,\" union president Stuart Appelbaum said in a statement.</p><p>Amazon spokeswoman Kelly Nantel blasted the decision, saying that workers benefit from a \"direct relationship\" with managers and that unions get in the way of the company's ability to remain nimble.</p><p>\"Our employees have always had the choice of whether or not to join a union, and they overwhelmingly chose not to join the RWDSU earlier this year,\" Nantel said in a statement. \"It's disappointing that the NLRB has now decided that those votes shouldn't count.\"</p><p>(Amazon founder Jeff Bezos owns The Washington Post.)</p><p>During the nearly two-month mail-in balloting that ended in March, the union drew support from leaders at the AFL-CIO as well as liberal politicians nationally, including Sen. Bernie Sanders (I-Vt.) and former Georgia gubernatorial candidate and voting rights advocate Stacey Abrams.</p><p>Even with that support, the union decisively lost the election. But the rapid turnover at Amazon warehouses, where workers often stay for a few weeks or months, could change the outcome.</p><p>Givan expects the company to continue its vigorous campaign to convince workers that they don't need a union, and acknowledges there is nothing to suggest that the outcome will be different.</p><p>What makes the decision so crucial is that it allows the union to continue the fight. Some unionization drives take several years and multiple elections before succeeding, Givan said.</p><p>The RWDSU has maintained a presence in Bessemer even after the lopsided loss last spring. The union's leadership has pointed to the lack of early campaigning as a key reason for its defeat and has worked to build a foundation for the upcoming campaign.</p><p>The revote decision comes nearly four months after a NLRB hearing officer, Kerstin Meyers, recommended it. Meyers, whose filing guided the final ruling, also criticized Amazon's efforts to get the Postal Service to install a mailbox in front of the warehouse because it could have given workers the impression that the company had a role in collecting and counting ballots.</p><p>In her decision Monday, Henderson wrote that the mailbox altered the agency's election procedures \"to give the appearance of irregular and improper\" involvement by Amazon.</p><p>She also blasted Amazon's rationale that the mailbox made voting more convenient for workers, noting that there were \"more than 49 postal branches with secure receptacles within 20 miles of the distribution center, in addition to the residential mailboxes available to most employees.\" Henderson had set the previous election rules and disapproved of Amazon's request to make voting \"easier,\" she wrote, adding that the company \"ignored the spirit of my directive by unilaterally requisitioning the installation of a postal mailbox.\"</p><p>Meyers also found that Amazon's pressuring employees to display anti-union paraphernalia the company handed out was also improper because it \"could reasonably cause an employee to perceive that the Employer was trying to discern their support for, or against, the Union.\"</p><p>And Henderson concurred in her ruling, writing that Amazon \"improperly polled employees when it presented small groups of employees with the open and observable choice to pick up or not pick up 'Vote No' paraphernalia in front of\" managers.</p><p>Henderson ruled that Amazon will need to post a notice at the Bessemer facility that reads, in part, that the previous election was set aside \"because the National Labor Relations Board found the Employer interfered with the employees' exercise of a free and reasoned choice by creating the appearance of irregularity in the election procedure due to issues surrounding the installation of a mailbox outside the main entrance and by improperly polling employees' support during mandatory meetings.\"</p><p>Amazon has until Dec. 13 to ask the full NLRB to review Henderson's decision.</p><p>jay.greene@washpost.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 The Washington Post</p></div>"}