{"date": "2021-12-17 14:35:42+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3466.3, "close": 3400.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\"><li class=\"tr-summaryitem\">Amazon 2019 Future deal was at heart of ongoing legal disputes </li><li class=\"tr-summaryitem\">India watchdog suspends deal, says Amazon suppressed info in 2019</li><li class=\"tr-summaryitem\">Amazon should pay penalty of 2 billion rupees-watchdog</li><li class=\"tr-summaryitem\">Suspension of deal latest legal twist in Future-Amazon saga</li></ul><p class=\"tr-advisory\">Adds details, context; updates throughout</p><p class=\"tr-by\">By Aditya Kalra</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW DELHI, Dec 17 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>India's antitrust agency suspended Amazon.com's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> 2019 deal with Future Group on Friday, potentially denting the U.S. e-commerce giant's attempts to block the sale of Future's retail assets to an Indian market leader. </p><p>The regulator ruled that the U.S. company had suppressed information while seeking regulatory approval on an investment into Indian retailer Future Group two years ago. </p><p>The ruling by the Competition Commission of India (CCI) could have far-reaching consequences for Amazon's legal battles with now estranged partner Future.</p><p>Amazon has for months successfully used the terms of its toehold $200 million investment in Future in 2019 to block the Indian retailer's attempt to sell retail assets to Reliance Industries <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RELI.NS\" data-type=\"ric\" data-ric=\"RELI.NS\" translate=\"no\" dir=\"ltr\">RELI.NS</a> for $3.4 billion.</p><p>The regulator's 57-page order said it considers \"it necessary to examine the combination (deal) afresh,\" adding its approval from 2019 \"shall remain in abeyance\" until then.</p><p>The CCI's order said Amazon had \"suppressed the actual scope\" of the deal and had made \"false and incorrect statements\" while seeking approvals. </p><p>\"The approval is suspended. This is absolutely unprecedented,\" said Shweta Dubey, a partner at Indian law firm SD Partners, who was formerly a CCI official.</p><p>\"The order seems to have found new power for CCI to keep the combination approval in abeyance,\" she added.</p><p>With the 2019 Future deal's antitrust approval now suspended, it could dent Amazon's legal position and retail ambitions, while making it easier for Reliance - the country's largest retailer - to acquire number two player Future, people familiar with the dispute said.     </p><p>The CCI also imposed a penalty of around 2 billion rupees ($27 million) on the U.S. company, adding that Amazon will be given time to submit information again to seek approvals, the CCI added.</p><p>Future Group, however, is unlikely to cooperate with Amazon if it tries to reapply for antitrust clearance after the CCI's decision, a source with direct knowledge told Reuters.</p><p>The Indian company is also set to take CCI's Friday decision before various legal forums to argue that Amazon has no legal basis to challenge its asset sale, the source added.</p><p>Future and Reliance did not respond to a request for comment. Amazon said it is reviewing the order \"and will decide on its next steps in due course.\"    </p><p><br/></p><p>RETAIL BATTLE    </p><p>The dispute over Future Retail, which has more than 1,500 supermarket and other outlets, is the most hostile flashpoint between Jeff Bezos' Amazon and Reliance, run by India's richest man Mukesh Ambani, as they try to gain the upper hand in winning retail consumers.    </p><p>Hit by the COVID-19 pandemic, Future last year decided to sell its retail assets to Reliance for $3.4 billion, but Amazon managed to block the sale successfully through legal challenges.</p><p>Amazon cited breach of contracts by Future, arguing that terms agreed in 2019 to pay $200 million for a 49% stake in Future's gift voucher unit prevented its parent, Future Group, from selling its Future Retail Ltd <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FRTL.NS\" data-type=\"ric\" data-ric=\"FRTL.NS\" translate=\"no\" dir=\"ltr\">FRTL.NS</a> business to certain rivals, including Reliance. </p><p>The CCI review of the deal started after Future, which denies any wrongdoing, complained, saying that Amazon was making contradictory statements before different legal forums about the intent of the 2019 transaction. </p><p>In June, the <a href=\"http://reut.rs/3I1MJ4r\" data-type=\"url\" class=\"tr-link\" translate=\"no\">CCI told Amazon</a> the U.S. firm in 2019 explained its interest in investing in Future's gift voucher unit as one that would address gaps in India's payments industry. But later, the CCI said, Amazon disclosed in other legal forums the foundation of its investment in the Future unit was to obtain special rights over the retail arm, Future Retail.</p><p>In the Friday order, CCI said there was \"a deliberate design on the part of Amazon to suppress the actual scope and purpose of the\" deal.</p><p>Ahead of CCI's decision, Amazon denied concealing any information and <a href=\"https://reut.rs/3q526kb\" data-type=\"url\" class=\"tr-link\" translate=\"no\">warned the watchdog</a> that Future's bid to unwind the 2019 deal to allow Reliance to consolidate its position \"will further restrict competition in the Indian retail market\".</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Aditya Kalra in New Delhi;<br/>Editing by Euan Rocha, Jane Merriman and Louise Heavens)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:aditya.kalra@tr.com\" data-type=\"email\" translate=\"no\">aditya.kalra@tr.com</a> ; +91-11-49548021; Twitter <a href=\"https://twitter.com/adityakalra\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/adityakalra</a>; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-INDIA/FUTURE-RELIANCE (UPDATE 2, PIX)</p></div>"}