{"date": "2021-04-19 12:40:26.797000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3802.0, "close": 3835.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>ENPNEWSWIRE-(C)2021 ENPUBLISHING</p><p>Release date- 19042021 - AVEVA, a global leader in industrial software, driving digital transformation and sustainability, today announced that it has extended its long term relationship with Aker Solutions to help accelerate the company's digital transformation strategy.</p></div><div class=\"tr-npp-body\"><p>The two organizations will work together to deploy new engineering capabilities which will enable multi-discipline teams to work effectively together to develop and maintain the detailed definition of all the key operational items as well as deliver the full range of AVEVA's process simulation, design, engineering, and lifecycle management technologies.</p><p>The extended partnership which now comprises most of AVEVA's Engineering offerings, including AVEVA E3D Design, AVEVA Enterprise Resource Management, AVEVA Asset Information Management, and AVEVA Point Manager, will further strengthens Aker Solutions and AVEVA's relationship.</p><p>Aker Solutions is one of AVEVA's top 100 customers. The renewal of the agreement will extend the existing strategic partnership and secure AVEVA's position as a leading industrial software solutions provider on the Norwegian continental shelf.</p><p>Kjetel Digre, CEO of Aker Solutions said, 'We are pleased to extend our long-term partnership with AVEVA. Digitalization across our work processes is an enabler for our strategy and growth objectives. We are committed to creating a sustainable energy future to address the need to lower the carbon footprint through usage of advanced digital technology.'</p><p>Craig Hayman CEO of AVEVA also commented, 'Our goal is to work with our customers to help them innovate and drive sustainability and the breath of our portfolio is enabling organizations like Aker Solutions to deploy faster, reduce energy consumption, cut emissions, and collaborate around innovation, boosting sustainable outcomes for all.'</p><p>'Our proven industrial software expertise, enhanced by the cloud and infused with Artificial Intelligence, means we have an unsurpassed understanding as well as the capabilities to deliver sustainability best practices. The scale and scope of our cloud offerings help to support digitally transformed ways of working to facilitate improved engineering, operations &amp; performance resulting in diverse environmental benefits for our customers,' concluded Hayman.</p><p>About Aker Solutions</p><p>Aker Solutions delivers integrated solutions, products, and services to the global energy industry. We enable low-carbon oil and gas production and develop renewable solutions to meet future energy needs. By combining innovative digital solutions and predictable project execution we accelerate the transition to sustainable energy production. Aker Solutions employs approximately 14,000 people in more than 20 countries.</p><p>Visit akersolutions.com and connect with us on Facebook, Instagram, LinkedIn, Twitter and YouTube .</p><p>About AVEVA</p><p>AVEVA, a global leader in industrial software, drives digital transformation for industrial organizations managing complex operational processes. Through Performance Intelligence, AVEVA connects the power of information and artificial intelligence (AI) with human insight, to enable faster and more accurate decision making, helping industries to boost operational delivery and sustainability. Our cloud-enabled data platform, combined with software that spans design, engineering and operations, asset performance, monitoring, and control solutions, delivers proven business value and outcomes to over 20,000 customers worldwide, supported by the largest industrial software ecosystem, including 5,500 partners and 5,700 certified developers. AVEVA is headquartered in Cambridge, UK, with over 6,000 employees at 90 locations in more than 40 countries. For more details visit: www.aveva.com</p><p>Copyright 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</p><p>Enquiries:</p><p>AVEVA Media Contacts</p><p>Rose Bambi</p><p>Senior Director Global PR and External Communications</p><p>Tel: +44 (0) 208 323 2789</p><p>rose.bambi@aveva.com</p><p>Caroline Stephens</p><p>Senior Global PR Manager</p><p>caroline.stephens@aveva.com</p><p>Catherine Singh</p><p>Global PR/Social Media Coordinator</p><p>catherine.singh@aveva.com</p><p>External Communications Alias</p><p>external.communications@aveva.com</p><p>[Editorial queries for this story should be sent to newswire@enpublishing.co.uk]</p><p>((Comments on this story may be sent to info@enpublishing.co.uk))</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 M2 Communications Ltd.</p></div>"}