{"date": "2021-12-17 20:17:53.784000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3377.42, "close": 3341.58}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon has launched a new Amazon Fresh grocery store at Regent's Place, one of British Land's London campuses. Located on the ground floor of Euston Tower, the 2,500 sq ft store is the second Amazon Fresh to open in British Land's portfolio, following the opening of its first ever UK store at Ealing Broadway in March.</p><p>The letting follows a period of excellent leasing activity, with over 1 million sq ft of retail deals signed in the first half of the year. It also reflects the attraction of British Land's campuses, which benefit from excellent locations, proximity to key transport links and access to a diverse mix of office occupiers.The store uses Amazon's Just Walk Out technology, designed to offer a convenient and seamless shopping experience for customers. After scanning into the store using a smartphone QR code on the Amazon app, customers can shop Amazon Fresh's range of food and daily essentials, including Amazon's private label, 'by Amazon', then walk out of the store without having to visit a cashier. Billing and receipts are handled through the customer's Amazon account shortly after their visit.Darren Richards, Head of Real Estate at British Land, said: \"We are thrilled to welcome Amazon Fresh to Regent's Place. The campus benefits from its proximity to local and international transport links, the latest in sustainable design and a lively mix of retail, leisure and public spaces. The letting follows one of our strongest six months for retail leasing activity in recent years, with total activity of more than 1 million sq ft.\"Amazon Fresh joins a diverse mix of high street brands, independent stores and leisure brands, including speciality coffee chain, Black Sheep Coffee, Asian-inspired food chain, itsu, independent Italian restaurant, Nuvola, and boutique hair salon, Don Hair Port.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}