{"date": "2021-08-12 22:21:28.617000+00:00", "ticker": "III", "mrkt_info": {"open": 1337.0, "close": 1336.5}, "html": "<div class=\"storyContent\" lang=\"fr\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Déclaration de l'Administratrice en chef de la santé publique Canada au sujet de son rapport annuel de 2021 : Une vision pour transformer le système de santé publique du Canada</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">Déclaration de l'Administratrice en chef de la santé publique Canada au sujet de son rapport annuel de 2021 : Une vision pour transformer le système de santé publique du Canada</p>\n<p>Canada NewsWire</p>\n<p>OTTAWA, ON, le 13 déc. 2021</p>\n<p>\n<span>OTTAWA, ON</span> , le 13 déc. 2021 /CNW/ - Aujourd'hui, mon rapport annuel sur l'état de la santé publique au <span>Canada</span> , intitulé <span>Une vision pour transformer le système de santé publique du <span>Canada</span>\n</span> , a été déposé au Parlement par le ministre de la Santé, l'honorable Jean-Yves Duclos. Ce rapport est un appel au renforcement du système de santé publique du <span>Canada</span> , afin que nous soyons mieux équipés contre les menaces actuelles et futures pour la santé.</p>\n<p>La COVID-19 a grandement mis à l'épreuve les systèmes de santé publique au <span>Canada</span> et dans le reste du monde. Dès le début de la pandémie, notre système de santé publique a été propulsé sous les projecteurs, en tant que première ligne de défense contre le virus SARS-CoV-2. Au fur et à mesure que la pandémie continuait de se propager, nous avons vu notre système de santé publique s'adapter rapidement pour relever le défi de protéger la santé des Canadiens. Notre système de santé publique s'est montré à la hauteur de la situation, mais à un coût élevé : il s'approche du point de rupture et doit immédiatement être renforcé.</p>\n<p>La pandémie a constitué un important signal d'alarme qui nous a fait prendre conscience de la nécessité de renouveler le système de santé publique du <span>Canada</span> . De plus, bien que la lutte contre la pandémie demeure la priorité absolue du <span>Canada</span> , d'autres défis complexes en matière de santé publique nécessitent une attention urgente. Il s'agit notamment des répercussions des changements climatiques sur la santé, de la crise des surdoses d'opioïdes, de la résistance aux antimicrobiens et de la dégradation de la santé mentale au sein de la population canadienne.</p>\n<p>Tout au long des séances de consultation que j'ai tenues pour guider ce rapport, j'ai régulièrement entendu dire que le rôle général des responsables de la santé publique n'était pas entièrement compris par ceux qui ne faisaient pas partie du secteur. En santé publique, la population est le patient. La mission de la santé publique est de prévenir les blessures et les maladies, de promouvoir des saines habitudes de vie, et de veiller à ce que TOUTES les personnes aient une chance égale de rester en bonne santé et de se sentir bien. La santé publique, c'est l'éclosion qui n'a pas eu lieu, la blessure traumatique qui ne s'est pas produite et la surdose d'opioïdes qui a été évitée.</p>\n<p>Dans un système de santé efficace, il ne suffit pas de traiter les maladies avec des médicaments et des traitements en milieu hospitalier : il faut empêcher ces maladies de se produire. La santé publique et le système de soins de santé se complètent : en maintenant les gens en bonne santé, la santé publique réduit le fardeau du système de soins de santé et contribue à sa durabilité. Nous devons changer notre façon de penser et reconnaître l'importance de la santé dans notre pays, afin de valoriser la prévention et le bien-être de la même manière que nous valorisons les traitements et les soins médicaux.</p>\n<p>Dans mon rapport annuel de 2020 intitulé <span>Du risque à la résilience : Une approche axée sur l'équité concernant la COVID-19</span> , j'ai décrit comment les Canadiens n'étaient pas sur un pied d'égalité lorsque la pandémie s'est installée. Des inégalités à l'échelle de la société ont entraîné des répercussions disproportionnées de la COVID-19 sur la santé de certaines populations au <span>Canada</span> . Les personnes qui ont été les plus durement touchées par la COVID-19 sont également celles qui risquent de subir les plus fortes répercussions négatives lors d'autres crises sanitaires.</p>\n<p>\n<span>\n<span>Nous devons prendre des mesures pour veiller à ce que <span>tout le monde</span> au <span>Canada</span> soit également protégé et en mesure d'atteindre une santé maximale.</span>\n</span>\n</p>\n<p>Dans mon rapport, je décris quatre domaines d'intervention prioritaires, afin de stimuler la transformation du système de santé publique :</p>\n<ul class=\"bulleted-list arrowlist\">\n<li>\n<span>Renforcer notre personnel de santé publique</span> : La pandémie a mis à rude épreuve les travailleurs de la santé publique, qui ont travaillé jour et nuit pendant près de deux ans et ont été nombreux à souffrir d'épuisement. Cependant, la pandémie a aussi suscité un intérêt accru pour le domaine de la santé publique. Nous devons poursuivre sur cette lancée et nous efforcer de recruter, de retenir et de former la prochaine génération de professionnels de la santé publique, afin de disposer d'une main‑d'œuvre hautement qualifiée, diversifiée et inclusive qui est adaptée aux collectivités desservies. Une capacité de pointe est également nécessaire pour accroître rapidement les effectifs en cas d'urgence.</li>\n</ul>\n<ul class=\"bulleted-list arrowlist\">\n<li>\n<span>Améliorer nos outils de santé publique</span> : Nos mesures de lutte contre la pandémie ont été entravées en partie par d'importantes lacunes dans nos systèmes de données et de surveillance de la santé publique, notamment le manque de données sur la race et l'ethnicité, le manque de données comparables entre les provinces et les territoires et les lacunes en matière d'information au niveau local.En collaboration avec les gouvernements fédéral, provinciaux et territoriaux, nous visons, au moyen de la Stratégie pancanadienne <span>de données sur la santé, à combler ces lacunes de façon</span> sécuritaire <span>et éthique. Nous devons accélérer la mise en</span> œuvre <span>de la Stratégie pour nous assurer que la santé publique dispose des bonnes données au bon moment, de manière à pouvoir prendre des décisions efficaces. Nous devons également renforcer notre programme de recherche « fait au <span>Canada</span> », afin de déterminer quels sont les interventions et les modèles de santé publique les plus efficaces pour améliorer la santé des populations et réduire les inégalités en matière de santé.</span>\n</li>\n</ul>\n<ul class=\"bulleted-list arrowlist\">\n<li>\n<span>Moderniser nos modèles de structures de gouvernance et de collaboration</span> : La pandémie a fait la preuve que nous ne pouvons pas travailler en vase clos et que les défis complexes en matière de santé publique nécessitent une approche « à l'échelle sociétale », une collaboration entre les autorités, les secteurs, les industries, les collectivités et par-delà les frontières. Nous devons veiller à ce que ces efforts soient mieux soutenus au moyen de mesures collectives fondées sur des indicateurs clairs et mesurables qui nous permettent de déterminer si nous atteignons nos objectifs d'une meilleure santé pour tous.Les collectivités des Premières Nations, des Inuits <span>et des Métis doivent également être soutenues dans l'élaboration de leurs propres priorités, plans et solutions en matière de santé publique.</span>\n</li>\n</ul>\n<ul class=\"bulleted-list arrowlist\">\n<li>\n<span>Garantir un financement stable et cohérent à la hauteur du mandat de la santé publique</span> : Comme nous l'avons vu par le passé, les ressources en santé publique sont souvent réduites une fois l'urgence passée, alors que les gouvernements se tournent vers d'autres priorités. C'est ce qu'on appelle le « cycle d'expansion et de contraction » des dépenses de santé publique. Le système de santé publique se trouve ainsi désavantagé au début de chaque crise, car il ne dispose pas des capacités ou des réseaux nécessaires à une intervention rapide.À l'avenir, la santé publique aura besoin d'investissements soutenus de la part de tous les ordres de gouvernement. De plus, les gouvernements fédéral, provinciaux et territoriaux devraient définir des objectifs et des priorités pancanadiens et pourraient utiliser le financement fédéral pour soutenir la réalisation de ces priorités. Par la suite, un bilan annuel sur nos progrès pourrait être présenté aux Canadiens.</li>\n</ul>\n<p>Bien que la pandémie de COVID-19 ne soit pas encore terminée, le moment est venu de se tourner vers l'avenir. J'espère que les recommandations formulées dans mon rapport déclencheront un dialogue national fort nécessaire et catalyseront l'action collective en vue du renouvellement de la santé publique.</p>\n<p>Nous avons assisté à de remarquables réalisations tout au long de la pandémie, notamment à la plus vaste campagne de vaccination de masse de l'histoire de notre pays, pour laquelle de nombreux secteurs et quantité de personnes de tout le <span>Canada</span> se sont mobilisés, ainsi qu'à des exemples de prise en charge par les Autochtones de leur intervention face à la pandémie et à des innovations locales visant à aider les membres de la collectivité qui se trouvent dans le besoin - et ce n'est là qu'un aperçu de ce qui est possible lorsque nous travaillons tous ensemble.</p>\n<p>La santé publique est une responsabilité qui nous incombe à tous. Pour réaliser pleinement un système de santé publique de classe mondiale, nous devons tous apporter notre contribution.</p>\n<p>En unissant les forces des collectivités, des gouvernements, des secteurs et de la communauté internationale, nous pouvons bâtir un système de santé publique qui nous sert au mieux et qui soutient une société saine et prospère.</p>\n<p>C'est en travaillant ensemble que nous pouvons nous assurer de bien faire les choses.</p>\n<p>\n<span>Produits connexes</span>\n</p>\n<ul class=\"bulleted-list arrowlist\">\n<li>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=fr&amp;o=3386418-1&amp;h=860145087&amp;u=https%3A%2F%2Fwww.canada.ca%2Ffr%2Fsante-publique%2Forganisation%2Fpublications%2Frapports-etat-sante-publique-canada-administrateur-chef-sante-publique%2Fetat-sante-publique-canada-2021.html&amp;a=Rapport+%E2%80%93+Une+vision+pour+transformer+le+syst%C3%A8me+de+sant%C3%A9+publique+du+Canada+\">Rapport - Une vision pour transformer le système de santé publique du <span>Canada</span>\n</a>\n</li>\n<li>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=fr&amp;o=3386418-1&amp;h=3633879484&amp;u=https%3A%2F%2Fwww.canada.ca%2Ffr%2Fsante-publique%2Fnouvelles%2F2021%2F12%2Fpublication-annuelle-rapport-de-ladministratrice-en-chef-de-la-sante-publique-sur-letat-de-la-sante-publique-au-canada2021-une-vision-pour-transfor.html&amp;a=Document+d%27information+%3A+Publication+annuelle+%E2%80%93+Rapport+de+l%27administratrice+en+chef+de+la+sant%C3%A9+publique+sur+l%27%C3%A9tat+de+la+sant%C3%A9+publique+au+Canada+2021+%3A+Une+vision+pour+transformer+le+syst%C3%A8me+de+sant%C3%A9+publique+du+Canada\">Document d'information : Publication annuelle - Rapport de l'administratrice en chef de la santé publique sur l'état de la santé publique au <span>Canada</span> 2021 : Une vision pour transformer le système de santé publique du <span>Canada</span>\n</a>\n</li>\n</ul>\n<p>SOURCE Santé <span>Canada</span>\n</p>\n<p>Consulter le contenu original : <a href=\"http://www.newswire.ca/fr/releases/archive/December2021/13/c2461.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/fr/releases/archive/December2021/13/c2461.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 CNW Group Ltd.</p></div>"}