{"date": "2021-12-16 20:47:05.960000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3466.3, "close": 3400.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>North American travel retailer Hudson has installed Amazon's Just Walk Out technology at its Hudson Nonstop store at Dallas Love Field Airport (DAL).</p><p>The retailer aims to offer a more convenient and contactless shopping experience by using the technology.It has become the first travel retailer to provide the service.The Just Walk Out solution allows shoppers to enter and pay by simply waving their palm over the device and be automatically charged from the card linked to their unique palm print.In addition, the store allows customers to use their credit or debit card for payments.To assist new customers, Hudson has installed an enrolment kiosk outside the store where they can sign up by associating their credit or debit card with a palm signature.Customers who have previously registered at certain Amazon Go, Amazon Books, Amazon 4-star, Amazon Fresh, Amazon Pop Up or Whole Foods Market stores can enter the store by hovering their palm over the Amazon One device.Hudson CEO Jordi Martin-Consuegra said: \"The integration of Amazon One into our technology portfolio demonstrates Hudson's unique ability to continually redefine and elevate the travel experience.\"With consumers increasingly demanding greater convenience and speed, we look forward to leading the charge in introducing new innovative solutions and retail concepts that are designed to meet and exceed the expectations of our travellers and partners.\"Besides its Nonstop DAL store, Hudson has also installed Amazon's Just Walk Out technology at its store in Chicago Midway International Airport (MDW).The retailer operates more than 1,000 stores in airports, commuter hubs, landmarks and tourist destinations across North America.Last month, British supermarket chain Sainsbury's opened its first contactless and checkout-free convenience store, SmartShop Pick &amp; Go, powered by Amazon One.The store in Holborn Circus, London, uses Sainsbury's SmartShop mobile app in conjunction with the Just Walk Out technology.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}