{"date": "2021-06-08 16:00:29.677000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3461.0, "close": 3489.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Read Article By Kerry Grimes, Head of Global Partners, AVEVA Cloud computing solutions enable enterprises across verticals to power their digital transformation journeys. Living in a pandemic has made every business realize the need to be digitally agi...</p><p>Kerry Grimes, Head of Global Partners, AVEVA</p></div><div class=\"tr-npp-body\"><p>Cloud computing solutions enable enterprises across verticals to power their digital transformation journeys. Living in a pandemic has made every business realize the need to be digitally agile, robust, reliable, and secure. Deploying the cloud for business is the fastest and surest way to achieve this. Every other digital transformation solution can be bolted on after the enterprise has adopted and migrated to a cloud platform.</p><p>Today, customers from all industries are either planning to migrate to cloud platforms or have already started that journey. It is imperative for system integrators and value-added partners for industrial solutions, traditionally facing oil and gas, energy and power, engineering and construction and utility networks, to similarly advance their journey into the cloud and keep pace with their customers. As every organization moves towards becoming a cloud-first business, channel partners must make a similar transition – or risk being left behind.</p><p>COVID-19 has served as a catalyst for every company to accelerate its move to the cloud to unlock the benefits of digital transformation, from resilience and cost reductions to new products and services. For channel partners, the trend represents an opportunity to build a holistic cloud journey at speed and scale for innovation-focused clients.</p><p>Lateral integration is necessary for channel partners</p><p>As a regional channel partner delivering industrial and high value software solutions for large enterprises, you are likely to find that your customer personas are also changing. If you dealt with the vice-president of capital projects or the chief investment officer before, now be prepared to interface with other personas including the chief information officer (CIO), chief digital officer, and chief innovation officer. The language of business services has evolved from long-term returns to shorter demand-based consumption and outcome-based returns.</p><p>Channel partner solutions and services therefore need to integrate laterally with other enterprise application solutions. Cloud-based application interoperability, OT-IT gateways, digital twins, manufacturing execution systems and cyber security policies are now as important, if not more so, than the upgrade of the ten-year old SCADA control systems that is on your quotation list.</p><p>With your customer now likely to be a digital-first C-suite executive, it is necessary that your credentials showcase technical proficiency as well as the skills of a trusted advisor. The key consideration for this new breed of corporate partners is likely to revolve around delivering the plug-and-play infrastructure that eases their digital transformation. This comes back to ensuring the customer is well supported on their cloud journey as they build bridges between industrial and digital.</p><p>As channel partners begin or advance in their cloud skills development, they need to progressively move through a checklist to guarantee great customer experiences and complete satisfaction.</p><p>Key questions to understand customer requirements</p><p>1. What is the customer's cloud adoption strategy and progress in cloud adoption? 2. Is the customer looking for choice and flexibility? 3. What is the business value that cloud will need to deliver in the short and medium term?4. Do you know the IT decision makers and their technology expectations? 5. Do you have an Opex based service price list to combine with the vendor's?</p><p>Key questions to select the most ideal vendor offerings</p><p>1. Does the enterprise application vendor offer all flavors of cloud? 2. Are the solutions suitable for the target markets you operate in or plan to? 3. Does the vendor have a cloud partner program and specialization? 4. Does the vendor offer training programs for your cloud enablement? 5. Is the vendor incentivizing your cloud services?</p><p>The cloud is not a short-term strategy for either the customer, the channel partner or the vendor. For now, it is a joint partnership effort and all stakeholders can benefit over the medium and long term. Technology and innovation are very important in the customer's digitalization journey, and trust, partnership and the human journey are the keys to success.</p><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}