{"date": "2022-02-14 14:40:46.948000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NVIDIA CORP (\"NVDA-Q\")\n- GTC 2022 to Feature Keynote From CEO Jensen Huang, New Products,\n- 900+ Sessions From Industry and AI Leaders\n\n     NVIDIA announced that it will host its GTC 2022 conference virtually\nfrom March 21-24, with a news-filled keynote by its founder and CEO Jensen\nHuang and more than 900 sessions from 1,400 speakers, including some of the\nworld's top researchers and industry leaders in AI, high performance\ncomputing and graphics.\n\n     Registration is free and open now at www.nvidia.com/gtc.\n\n     Huang's keynote will be live-streamed on Tuesday, March 22, at 8 a.m.\nPacific time and available on demand afterward. Registration is not\nrequired to view the keynote.\n\n     \"As one of the world's leading AI conferences, GTC provides a singular\nopportunity to help solve huge challenges and redefine the future for\ndevelopers, researchers and decision-makers across industries, academia,\nbusiness and government,\" said Greg Estes, vice president of Developer\nPrograms at NVIDIA. \"There's a mother lode of content and opportunities for\nattendees of all levels to deepen their knowledge and make new\nconnections.\"\n\n     This GTC will focus on accelerated computing, deep learning, data\nscience, digital twins, networking, quantum computing and computing in the\ndata center, cloud and edge. There will be more than 20 dedicated sessions\non how AI can help visualize and further climate science.\n\n     Among the many notable speakers at GTC:\n\n     *  Andrew Ng, founder of DeepLearning.AI, founder and CEO of Landing\nAI\n     *  Prof. Dr. Bjorn Stevens, managing director and director of the\ndepartment, The Atmosphere in the Earth System, Max Planck Institute for\nMeteorology\n     *  Prof. Chelsea Finn, assistant professor of computer science,\nStanford University\n     *  Hao Yang, vice president of AI Research, Visa\n     *  Jack Jin, lead machine learning Infra engineer, Zoom\n     *  Joe Ucuzoglu, CEO, Deloitte U.S.\n     *  Lidia Fonseca, chief digital and technology officer, Pfizer\n     *  Magnus Ostberg, chief software officer, Mercedes-Benz AG\n     *  Marc Petit, general manager for Unreal Engine, Epic Games\n     *  Markus Gross, vice president of Research, Walt Disney Studios\n     *  Michael Russinovich, CTO and Technical Fellow, Microsoft Azure\n     *  Natalya Tatarchuk, director of global graphics, Unity\n     *  Peter Stone, executive director, Sony AI, and professor of computer\nscience, University of Texas, Austin\n     *  Dr. Stefan Sicklinger, head of BigLoop and Advanced Systems,\nCARIAD/VW Group\n     *  Yu Liu, director of AI, Meta\n     *  Zoe Lofgren, member of Congress, U.S. House of Representatives\n\n     Other organizations participating include Amazon, Autodesk, Barclays,\nBloomberg, Cisco, Cornell University, DeepMind, Dell Technologies,\nEricsson, Flipkart, Google Brain, Lockheed Martin, NASA, NFL, Snap, U.S.\nAir Force and VMware.\n\n     Learning and Development Opportunities\nGTC provides participants at all stages of their careers with outstanding\nlearning and development opportunities - many of which are free.\n\n     The event kicks off with Learning Day, for all levels and backgrounds,\non Monday, March 21, and continues the rest of the week with sessions in\nfour languages across multiple time zones. From sessions on GPU computing\nto AI workshops, there will be extensive learning and training\nopportunities for students, developers and professionals with technology\ntalks from NVIDIA subject-matter experts, including from NVIDIA's Deep\nLearning Institute (DLI) and NVIDIA Academy.\n\n     Students and early career professionals can participate in\nintroductory courses on deep learning and robotics. They can also access\nsessions like \"The Right Formula for AI Success: Insights from AI High\nPerformer\" and \"Deep Learning Demystified\" as well as the \"5 Steps for\nStarting a Career in AI\" panel, featuring Sheila Beladinejad, president of\nWomen in AI &amp; Robotics, and David Ajoku, founder of Aware.ai.\n\n     More experienced developers can enroll in a variety of DLI courses,\nincluding 20 free, short-day sessions and 17 full-day workshops, to dive\ndeeper into AI and earn a DLI certificate demonstrating subject-matter\ncompetency. From Feb. 21 until the end of March, new members to NVIDIA's\nDeveloper Program can get access to an additional complementary GTC DLI\ncourse when they sign up.\n\n     Developed for IT professionals, NVIDIA Academy will host certified\ntraining programs on the data center, InfiniBand, IT infrastructure and\nnetworking. The program includes instructor led-training sessions followed\nby self-paced coursework and proctored certification tests.\n\n     All workshops and sessions are led by trained, DLI-certified\ninstructors, either from NVIDIA or partners and collaborators who are\nexperts in their field.\n\n     Supporting AI Ecosystem for All\nAs part of NVIDIA's commitment to making AI accessible for all developer\ncommunities and emerging markets, there are numerous sessions showcasing\nhow developers and startups in emerging economies are building and scaling\nAI and data science. Sessions for emerging markets include \"Look to Africa\nto Advance Artificial Intelligence\" and \"Democratizing AI in Emerging\nMarkets Through the United AI Alliance.\"\n\n     NVIDIA is also providing free credits for DLI courses to\nminority-serving institutions, from community colleges to historically\nBlack colleges and universities.\n\n     Spotlight on Startups\nNVIDIA Inception, a global program to nurture cutting-edge startups with\n9,000+ members, will host tracks aimed at helping emerging companies build\nand grow their businesses and gain industry knowledge.\n\n     These include VC-focused sessions on such topics as Omniverse and\nquantum computing, as well as sessions led by NVIDIA and startups from\nacross the globe on AI, autonomous systems, climate science, cybersecurity,\nhealthcare and digital twins, among other themes.\n\n     About NVIDIA\nNVIDIA's (NASDAQ: NVDA) invention of the GPU in 1999 sparked the growth of\nthe PC gaming market and has redefined modern computer graphics, high\nperformance computing and artificial intelligence. The company's pioneering\nwork in accelerated computing and AI is reshaping trillion-dollar\nindustries, such as transportation, healthcare and manufacturing, and\nfueling the growth of many others. More information at\n<a href=\"https://nvidianews.nvidia.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://nvidianews.nvidia.com</a>/.\n\n     For further information,\n\n Contact Information:\n\ncontact:\nStephanie Matthew\nCorporate Communications\nNVIDIA Corporation\n+1-408-646-3359\nsmatthew@nvidia.com\n\n     Certain statements in this press release including, but not limited\nto, statements as to new AI products at GTC; the time, size, themes,\nspeakers, presenters, participants, availability and impact of GTC; and the\nimpact and topics for learning and development opportunities at GTC,\nincluding the NVIDIA Deep Learning Institute, NVIDIA Academy and NVIDIA\nInception are forward-looking statements that are subject to risks and\nuncertainties that could cause results to be materially different than\nexpectations. Important factors that could cause actual results to differ\nmaterially include: global economic conditions; our reliance on third\nparties to manufacture, assemble, package and test our products; the impact\nof technological development and competition; development of new products\nand technologies or enhancements to our existing product and technologies;\nmarket acceptance of our products or our partners' products; design,\nmanufacturing or software defects; changes in consumer preferences or\ndemands; changes in industry standards and interfaces; unexpected loss of\nperformance of our products or technologies when integrated into systems;\nas well as other factors detailed from time to time in the most recent\nreports NVIDIA files with the Securities and Exchange Commission, or SEC,\nincluding, but not limited to, its annual report on Form 10-K and quarterly\nreports on Form 10-Q. Copies of reports filed with the SEC are posted on\nthe company's website and are available from NVIDIA without charge. These\nforward-looking statements are not guarantees of future performance and\nspeak only as of the date hereof, and, except as required by law, NVIDIA\ndisclaims any obligation to update these forward-looking statements to\nreflect future events or circumstances.\n\n     (c) 2022 NVIDIA Corporation. All rights reserved. NVIDIA and the\nNVIDIA logo are trademarks and/or registered trademarks of NVIDIA\nCorporation in the U.S. and other countries. Other company and product\nnames may be trademarks of the respective companies with which they are\nassociated. Features, pricing, availability and specifications are subject\nto change without notice.\n\n     A photo accompanying this announcement is available at\n<a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/07405477-9213-4927-be1b\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.globenewswire.com/NewsRoom/AttachmentNg/07405477-9213-4927-be1b</a>\n-b6b8592e43ad\n\nTel   : 408-486-2000    NVIDIA CORP\nFax   : 408-486-2200\nEmail : info@nvidia.com\nWWW   : <a href=\"https://www.nvidia.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.nvidia.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204400468.MNPRE2204401457-06190820220214</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}