{"date": "2021-12-14 08:46:38.401000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Federal regulators are investigating the collapse of an Amazon warehouse in Edwardsville, Ill., which occurred Friday night during a tornado in the region.</p><p>The Occupational Safety and Health Administration confirmed Monday that compliance officers have been at the building collapse since this weekend. It has six months to conduct the investigation, it said in a statement. (Amazon founder Jeff Bezos owns The Washington Post.)</p></div><div class=\"tr-npp-body\"><p>The 1.1-million-square-foot Amazon facility was severely damaged Friday when a tornado ripped through the area. Six people died in the building, and a seventh was injured, Gov. J.B. Pritzker said at a news conference Monday.</p><p>An investigation to look at potential structural issues and ensure that the building is up to code is ongoing, officials said at the news conference. Amazon spokeswoman Kelly Nantel said at the conference that the Amazon facility was \"constructed consistent with code.\"</p><p>As the state experiences more severe storms due to climate change, the building codes may need to be updated, Pritzker (D) said at the conference.</p><p>\"Suffice it to say that's something we are deeply concerned about, to make sure code is where it ought to be,\" he said.</p><p>He added that the Amazon facility does not have a basement because the industrial area is prone to flooding and builders cannot dig far down.</p><p>Most of the 46 workers inside the building gathered at a \"take shelter\" location on the north side of the building, Amazon said. \"Generally speaking, it's in an area where there are no windows, so it's a safer space to be in the building,\" Nantel said.</p><p>But seven people on the south side of the building sheltered outside the designated \"take shelter\" area. Amazon thinks the workers were on the south side of the building \"because of the work they were doing at the time,\" Nantel said. Six of the people on the south side of the building died, and the seventh was injured.</p><p>It's unclear exactly how much warning workers were given to reach the sheltered area. Nantel said they had \"minutes.\"</p><p>She refused to speculate how long it would take workers to cross the building, but she noted the building's large size. The building is one of Amazon's delivery centers, a smaller warehouse where packages and boxes are loaded onto trucks for deliveries.</p><p>The facility does not have a rule against workers having their cellphones, Nantel said, though there are safety rules about how cellphones can be used.</p><p>The \"take shelter\" location is the restrooms, said delivery driver Alonzo Harris.</p><p>Harris was returning from his route to the delivery center Friday when he got a storm alert on his work phone. At first, he didn't take it seriously because the alerts happen often, he said.</p><p>Then an Amazon manager came out and started yelling to people, telling them to take shelter immediately. \"Within minutes, I heard a loud rumbling noise and the ground was shaking, like it was an earthquake,\" Harris said. \"I ran deep into the shelter. I thought, 'oh lord, I don't want to fly away.' \"</p><p>At the Monday news conference, Amazon representatives also said a siren sounded in the building.</p><p>Harris said that people in the shelter were trying to take care of each other, and especially caring for people who were hit by debris before they had reached the shelter. He felt safe and secure in the shelter, he said. Still, the storm was massive.</p><p>\"I don't believe anything man-made is a match for mother nature,\" he said.</p><p>rachel.lerman@washpost.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 The Washington Post</p></div>"}