{"date": "2021-11-08 09:26:12+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Refiles to make clear IFC is part of \"World Bank Group\" in headline and 1st paragraph</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">JOHANNESBURG, Nov 8 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>The World Bank <span class=\"tr-strong\">Group</span>'s International Finance Corporation (IFC) has partnered with South Africa's Liquid Intelligent Technologies to expand data centre capacity and roll out fibre-optic cable on the continent, the groups said in a joint statement on Monday.</p><p>The link-up with Liquid Intelligent Technologies, formally Liquid Telecom, aims to increase digital connectivity in Africa and to support the region's growing digital ecosystem, the partners said.  </p><p>The investment in data centres underscores the rising demand for cloud services even in relatively undeveloped corners of the continent.</p><p>U.S. tech giants such as Microsoft <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MSFT.O\" data-type=\"ric\" data-ric=\"MSFT.O\" translate=\"no\" dir=\"ltr\">MSFT.O</a> and Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> are already competing with Chinese telecom firm Huawei <a href=\"reuters://REALTIME/verb=Headlines/ric=HWT.UL\" data-type=\"newsExpression\" data-expression=\"HWT.UL\" translate=\"no\" dir=\"ltr\">HWT.UL</a> to set up massive data centres on the continent as demand for cloud connectivity soars as companies save huge costs by renting storage space than building their own servers. </p><p>IFC's equity and debt investments in Liquid, which to date totals approximately $250 million, will support the company to grow its hyper-scale data centre capacity in Egypt, Kenya, Nigeria, and South Africa through its subsidiary, Africa Data Centres, the statement said. </p><p>\"As Africa's population grows and is increasingly urbanized, data consumption is expected to grow strongly and with this comes the need for secure local data hosting,\" they added. </p><p>The investments will also support the continued roll out of Liquid's fibre broadband network, which today covers more than 100,000 kilometres of sub-Saharan Africa.  </p><p>According to the Broadband Commission on Sustainable Development, sub-Saharan Africa needs around $100 billion in investment to achieve affordable and high-quality broadband access by 2030. It would need at least 250,000 kilometres of new fibre lines to achieve this.</p><p>IFC's latest investment in Liquid follows its investment in the company in February 2021 through Liquid's bond placement on Euronext Dublin, Ireland's main stock exchange. The issuance raised $620 million.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Nqobile Dludla; Editing by Toby Chopra)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:nqobile.dludla@thomsonreuters.com\" data-type=\"email\" translate=\"no\">nqobile.dludla@thomsonreuters.com</a> ; +27103461066; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AFRICA-CONNECTIVITY/ (CORRECTED)</p></div>"}