{"date": "2022-01-12 15:11:44.767000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>DATA443 RISK MITIGATION INC (\"ATDS-0\")\n- Releases Antivirus Protection Manager, Meeting Demands for\n- Expanded Security in Growing Hostile Environments\n\n     Data443 Risk Mitigation, Inc. (\"Data443\" or the \"Company\"), a leading\ndata security and privacy software company, today announced the release of\nits newest data security solution, Data443 Antivirus Protection Manager,\nthe Company's first ever antivirus product for Microsoft Windows desktops,\nlaptops, virtual desktops, database engines, Azure/AWS/GCP &amp; hybrid cloud\ninstances and standard servers.\n\n     Unlike comparable antivirus software in the market today, Data443 does\nNOT install energy-consuming, difficult to uninstall crypto-mining software\nwithin its software. 2021 demonstrated again that risk, attacks, and\nnefarious activities will not abate and continue to be a major concern for\nall organizations this year. Direct antivirus management is a key component\nin the toolkit for protection in addition to Data443's growing product\nsuite.\n\n     Data443 Antivirus Protection Manager provides antivirus technology for\nprotection from all viruses, malware, ransomware, trojans, and spyware.\nComprised of a massive antivirus engine and requisite libraries that update\nlive patterns to the minute, Data443 Antivirus Protection Manager protects\nand scans all portions of your device (including USB), featuring live\nalerts as needed. Data443 Antivirus Protection Manager runs and detects\nactive threats and integrates well with several of our family of data\nsecurity products, including Data Identification Manager and Ransomware\nRecovery Manager.\n\n     Jason Remillard, Data443's Founder and Chief Executive Officer,\ncommented, \"Our clients are looking for new and different options from the\nusual incumbents as they review budgets and renewals come due. Our\nRansomware Recovery Manager product enables clients to survive cyberattacks\nand avoid ransom payments, instantly recovering copies of their critical\ndata and restoring their computers without IT department interaction. These\nand other product capabilities to be announced have led our expansion into\nadditional market segments that our sales and marketing activities will\nleverage in this pivotal year for data privacy and security.\"\n\n     Data443 offers several licensing models - individual, small business\nand major enterprise bundles. Additionally, there are sell-with bundles\nthat match up valuable Data443 products that benefit users directly and\nenterprises.\n\n     Clients can learn more directly at:\n<a href=\"https://data443.com/antivirus-protection-manager\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://data443.com/antivirus-protection-manager</a>/\n\n     Clients can download a free trial at:\n<a href=\"https://orders.data443.com/index.php?rp=/store/endpoint\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://orders.data443.com/index.php?rp=/store/endpoint</a>\n\n     About Data443 Risk Mitigation, Inc.\n\n     Data443 Risk Mitigation, Inc. (OTCPK: ATDS), is an industry leader in\nAll Things Data Security(R), providing software and services to enable\nsecure data across local devices, network, cloud, and databases, at rest\nand in flight. Its suite of products and services is highlighted by:\n(i) Data443(R) Ransomware Recovery Manager(TM), built for the modern\nenterprise, its capabilities are designed to recover a workstation\nimmediately upon infection to the last known business-operable state,\nwithout any end user or IT Administrator efforts;\n(ii) Data Identification Manager(TM) (previously marketed as ClassiDocs(R)\nand FileFacets(R)), the Company's award-winning data classification and\ngovernance technology, which supports CCPA, LGPD and GDPR compliance in a\nSoftware-as-a-Service (SaaS) platform that performs sophisticated data\ndiscovery and content search of structured and unstructured data within\ncorporate networks, servers, content management systems, email, desktops\nand laptops;\n(iii) Data Archive Manager(TM) (previously marketed as ArcMail(R)), a\nleading provider of simple, secure and cost-effective enterprise data\nretention management, archiving and management solutions;\n(iv) Sensitive Content Manager(TM) (previously marketed as ARALOC(R))\n(LOC(TM)), a market leading secure, cloud-based platform for the\nmanagement, protection and distribution of digital content to the desktop\nand mobile devices, which protects an organization's confidential content\nand intellectual property assets from leakage -- malicious or accidental --\nwithout impacting collaboration between all stakeholders; , a market\nleading secure, cloud-based platform for the management, protection and\ndistribution of digital content to the desktop and mobile devices, which\nprotects an organization's confidential content and intellectual property\nassets from leakage -- malicious or accidental -- without impacting\ncollaboration between all stakeholders;\n(v) Data Placement Manager(TM) (previously marketed as DATAEXPRESS(R)), the\nleading data transport, transformation and delivery product trusted by\nleading financial organizations worldwide;\n(vi) Access Control Manager(TM) (previously marketed as Resilient\nAccess(TM)), enables fine-grained access controls across myriad platforms\nat scale for internal client systems and commercial public cloud platforms\nlike Salesforce, Box.Net, Google G Suite, Microsoft OneDrive and others;\n(vii) Data Identification Manager(TM) (previously marketed as\nClassiDocs(R)) for Blockchain, provides an active implementation for the\nRipple XRP that protects blockchain transactions from inadvertent\ndisclosure and data leaks;\n(viii) Data443(R) Global Privacy Manager(TM), the privacy compliance and\nconsumer loss mitigation platform which is integrated with Data\nIdentification Manager to do the delivery portions of GDPR and CCPA as well\nas process Data Privacy Access Requests - removal request - with inventory\nenables the full lifecycle of Data Privacy Access Requests, Remediation,\nMonitoring and Reporting;\n(ix) IntellyWP, a leading purveyor of user experience enhancement products\nfor webmasters for the world's largest content management platform,\nWordPress;\n(x) Data443(R) Chat History Scanner, which scans chat messages for\nCompliance, Security, PII, PI, PCI &amp; custom keywords; and\n(xi) GDPR Framework, The CCPA Framework and LGPD Framework WordPress\nplugins, with over 30,000 active site owners combined, enables\norganizations of all sizes to comply with European, California and\nBrazilian privacy rules and regulations.\n\n     For more information, please visit <a href=\"http://www.data443.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.data443.com</a>.\n\n     Forward-Looking Statements\n\n     The statements contained in this release that are not historical facts\nare forward-looking statements as defined in the Private Securities\nLitigation Reform Act of 1995. Words such as \"may,\" \"will,\" \"could,\"\n\"should,\" \"expect,\" \"plan,\" \"project,\" \"intend,\" \"anticipate,\" \"believe,\"\n\"estimate,\" \"predict,\" \"potential,\" \"pursuant,\" \"target,\" \"continue,\" and\nsimilar expressions are intended to identify such forward-looking\nstatements. The statements in this press release that are not historical\nstatements, including statements regarding Data443's plans, objectives,\nfuture opportunities for Data443's services, future financial performance\nand operating results and any other statements regarding Data443's future\nexpectations, beliefs, plans, objectives, financial conditions, assumptions\nor future events or performance that are not historical facts, are\nforward-looking statements within the meaning of the federal securities\nlaws. These statements are not guarantees of future performance and are\nsubject to numerous risks, uncertainties, and assumptions, many of which\nare beyond Data443's control, and which could cause actual results to\ndiffer materially from the results expressed or implied by the statements.\nThese statements are not guarantees of future performance and involve\nrisks, uncertainties and assumptions that are difficult to predict, and\ninclude, without limitation, results of litigation, settlements and\ninvestigations; actions by third parties, including governmental agencies;\nvolatility in customer spending; global economic conditions; ability to\nhire and retain personnel; loss of, or reduction in business with, key\ncustomers; difficulty with growth and integration of acquisitions; product\nliability; cybersecurity risk; anti-takeover measures in our charter\ndocuments; and, the uncertainties created by the ongoing outbreak of a\nrespiratory illness caused by the 2019 novel coronavirus that was recently\nnamed by the World Health Organization as COVID-19. These and other\nimportant risk factors are described more fully in our reports and other\ndocuments filed with the Securities and Exchange Commission (\"the SEC\"),\nincluding under (i) \"Part I, Item 1A. Risk Factors\", in our Registration\nStatement on Form 10 filed with the SEC on January 11, 2019 and amended on\nApril 24, 2019; (ii) \"Part I, Item 1A. Risk Factors\", in our Annual Report\non Form 10-K filed with the SEC on March 23, 2021; and, (iii) subsequent\nfilings. Undue reliance should not be placed on the forward-looking\nstatements in this press release, which are based on information available\nto us on the date hereof. Except as otherwise required by applicable law,\nwe undertake no obligation to publicly update or revise any forward-looking\nstatements, whether because of new information, future events, or\notherwise.\n\n     Data443(R), ClassiDocs(R), ARALOC(R), ARCMAIL(R), DATAEXPRESS(R) and\nFILEFACETS(R) are all registered trademarks of Data443 Risk Mitigation,\nInc.\n\n     All product names, trademarks and registered trademarks are property\nof their respective owners. All company, product and service names used in\nthis website are for identification purposes only. Use of these names,\ntrademarks and brands does not imply endorsement.\n\n     All other trademarks cited herein are the property of their respective\nowners.\n\n     For Further Information:\n\n     Follow us on Twitter: <a href=\"https://twitter.com/data443Risk\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/data443Risk</a>\nFollow us on Facebook: <a href=\"https://www.facebook.com/data443\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.facebook.com/data443</a>/\nFollow us on LinkedIn:\n<a href=\"https://www.linkedin.com/company/data443-risk-mitigation-inc\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.linkedin.com/company/data443-risk-mitigation-inc</a>/\nSignup for our Investor Newsletter:\n<a href=\"https://data443.com/investor-email-alerts\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://data443.com/investor-email-alerts</a>/\n\n     Investor Relations\n\nContact:\n Matthew Abenante\n ir@data443.com\n919.858.6542\n\nTel   : 919-526-1070    DATA443 RISK MITIGATION INC\nFax   : 972-899-3485\nWWW   : <a href=\"https://www.data443.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.data443.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201100299.MNPRE2201101482-06445920220112</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}