{"date": "2021-01-15 09:24:46+00:00", "ticker": "AVV", "mrkt_info": {"open": 3534.0, "close": 3805.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds shares, analyst comments, details on outlook, background</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Jan 15 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Aveva Group <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AVV.L\" data-type=\"ric\" data-ric=\"AVV.L\" translate=\"no\" dir=\"ltr\">AVV.L</a> on Friday reported an over 26% jump in third-quarter organic revenue, as the British industrial software provider benefited from strong and early contract renewals, sending its shares up 4.2% to the top of the UK blue chip index.</p><p>    The strong revenue growth was driven by a large three-year contract renewal in the food sector, early renewal of three large engineering, procurement and constructions contracts scheduled for the next quarter and the conversion of two large contracts in the marine sector.</p><p>This pull forward of revenue from the fourth quarter to the third will make the former look softer but the overall outlook for the second-half of the fiscal year looks more certain, Credit Suisse analysts said in a note.  </p><p>The company said it remains confident in its full-year outlook thanks to digital demand generation and several large contract renewals, but added that its order pipeline for the fourth quarter dipped sequentially.</p><p>    \"Although encouraging, the impact of revenue recognition on larger deals and likely soft comparables in the prior year, mean that it is difficult to fully interpret the strength of the quarter,\" the brokerage said. </p><p>Aveva added that OSIsoft, which it bought for an enterprise value of $5 billion in August last year, continued to perform well with 8.5% growth in its billings in the fiscal year.   </p><p>    The Cambridge-based company also said that recurring revenues made up 68% of its overall revenue after growing 10% in the nine months ended Dec. 31.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Aniruddha Ghosh in Bengaluru; Editing by Shailesh Kuber)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Aniruddha.Ghosh@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Aniruddha.Ghosh@thomsonreuters.com</a> ; 91 83 83 81 2416; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AVEVA GROUP-OUTLOOK/ (UPDATE 1)</p></div>"}