{"date": "2021-12-14 18:50:33+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds comments, details, background</p><p class=\"tr-by\">By Cheney Orr</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">MAYFIELD, Ky., Dec 14 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>The death toll from the barrage of tornadoes that tore through Kentucky and surrounding states late last week included a dozen children, the youngest of which was a 2-month-old infant, Governor Andy Beshear said on Tuesday.</p><p>Searchers sifting through the debris left by the storms that struck on Friday night did not uncover any more bodies in the past 24 hours, leaving the number of dead in the state at 74, Beshear said. The oldest victim was 98. Eight of the dead have yet to be identified, he said.</p><p>\"I still expect that we will find some more bodies. There is just so much destruction,\" Beshear said at a briefing, adding that more than 100 people remain missing.</p><p>In all, deaths across the states hit by the tornadoes totaled 88. The toll included six people who were killed at an Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> warehouse in Illinois, four in Tennessee, two in Missouri and two in Arkansas. The U.S. workplace safety agency is investigating the circumstances around the <a href=\"https://www.reuters.com/world/us/investigation-into-amazoncom-illinois-building-collapse-opened-labor-official-2021-12-13\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon warehouse collapse</a><span class=\"tr-strong\">.</span></p><p>More than 100 people were working at a candle factory in Mayfield, Kentucky, when the storm hit and reduced the plant to rubble. A total of eight people were killed, far less than initially feared.  </p><p>\"If you saw it in person, you would believe that's a miracle,\" Beshear said of the fact that more people were not killed.</p><p>By midday on Tuesday, nearly 25,000 Kentucky homes and businesses still lacked power, according to PowerOutages.us, more than four days after the tornadoes surprised people by striking unusually late in the year. Insured losses from the swarm of tornadoes could total <a href=\"https://www.reuters.com/markets/commodities/deadly-us-tornadoes-cost-insurers-about-3-bln-kcc-2021-12-14\" data-type=\"url\" class=\"tr-link\" translate=\"no\">up to $5 billion</a><span class=\"tr-strong\">, </span>industry experts said on Tuesday.</p><p>President Joe Biden on Wednesday plans to visit hard-hit areas, including Mayfield, after he declared a major federal disaster in Kentucky on Sunday. </p><p>Late on Monday, the president also declared an emergency in Tennessee and Illinois and approved federal assistance for the two states.</p><p>Hundreds National Guard service members were at the sites, searching for victims and survivors, clearing roads and providing police services, Beshear said.</p><p>There was also the Herculean task of carting the fields of debris out of Mayfield and other communities that were leveled. </p><p>\"It feels pretty good not to be just pushing this stuff just out of the way, but to be loading it up and taking it out of town,\" the governor said. \"There is something therapeutic about taking that chaos and destruction and death and getting it out of some of those areas.\" </p><p>The disaster has also produced an <a href=\"https://www.reuters.com/markets/commodities/help-arrives-kentucky-with-stew-chain-saws-place-stay-2021-12-14\" data-type=\"url\" class=\"tr-link\" translate=\"no\">outpouring of volunteers</a>. </p><p>“As devastating as this damage is and all of the images that we see coming out of this, man, the stories of neighbors helping neighbors and people across Kentucky coming together to support each other, it’s remarkable,\" Lieutenant Governor Jacqueline Coleman said. \"It’s absolutely remarkable.\"</p><p>More than 300 people in Kentucky, as well as in Arkansas and Tennessee, were being housed in Red Cross shelters, and that number is expected to grow. Hundreds more have been placed temporarily in resorts at area state parks, Kentucky Red Cross Chief Executive Steve Cunanan said.</p><p>        </p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Cheney Orr in Mayfield, Kentucky; Peter Szekely in New York and Brendan O'Brien in Chicago; Editing by Lisa Shumaker)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Peter.Szekely@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Peter.Szekely@thomsonreuters.com</a> ; (646) 223-5302; Reuters Messaging: @peszeke))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-WEATHER/TORNADOES (UPDATE 2, PIX, TV)</p></div>"}