{"date": "2021-12-21 11:00:00.439000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwlistdisc{list-style-type:disc;}.storyContent .bwuline{text-decoration:underline;text-decoration-color:inherit;}</style><p class=\"bwalignc\">\n<b>Amazon Announces Plans to Create 550 New Jobs at Phoenix Tech Hub</b>\n</p><p class=\"bwalignc\">\n<span>More than 400 corporate and tech roles are currently available at Amazon’s Phoenix Tech Hub. Those interested can apply at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazon.jobs%2Fen%2Fsearch%3Foffset%3D0%26result_limit%3D10%26sort%3Drelevant%26category_type%3DCorporate%26distanceType%3DMi%26radius%3D24km%26latitude%3D33.42551%26longitude%3D-111.93724%26loc_group_id%3D%26loc_query%3DTempe%252C%2520AZ%252C%2520United%2520States%26base_query%3D%26city%3DTempe%26country%3DUSA%26region%3DArizona%26county%3DMaricopa%26query_options%3D%26&amp;esheet=52553806&amp;newsitemid=20211221005239&amp;lan=en-US&amp;anchor=amazon.jobs&amp;index=1&amp;md5=7a5dfc77833b11e29a29211c934f3b04\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.jobs</a></span>\n</p><p>\nAmazon today announced plans to create more than 550 corporate and tech jobs in Tempe, Arizona, over the next few years, further expanding the company’s Phoenix Tech Hub. These new roles will support Amazon’s growing teams in Consumer Retail, Amazon Web Services, and Operations, and include positions such as software development engineers, senior solution architects, project managers, and business analysts.\n</p><p>\n“Not only do Phoenix and Tempe have an incredible existing talent pipeline, but this is a place where people want to move to as well,” said Doug Welzel, site lead for Amazon’s Phoenix Tech Hub. “We’ve experienced amazing growth over the last few years, creating jobs and economic opportunity for the wider community. We’ve already created more than 5,000 corporate and tech jobs in the Phoenix area and we are excited to continue investing here.”\n</p><p>\n“It’s investments from companies like Amazon that will continue to help Tempe attract more businesses and tech talent to our city,” said Corey Woods, Mayor of Tempe. “These types of investments not only create good jobs, but they help to power the economic engine of our community and provide more opportunities for our residents and citizens.”\n</p><p>\n“We are proud of Amazon’s continued investments in Arizona and the more than 32,000 jobs they support,” said Sandra Watson, President and CEO of the Arizona Commerce Authority. “The latest expansion of Amazon’s Tech Hub in Tempe reflects our highly skilled and growing workforce as well as our premier attractiveness for technology and innovation.”\n</p><p>\nTo accommodate its growth in Phoenix, Amazon has signed on to a 63,000-square-foot expansion at its existing offices at 100 S. Mill Avenue in Tempe, developed by Cousins Properties and Hines. The additional new office space is expected to open for employees in late 2022. Amazon currently has more than 5,000 tech and corporate employees working at its Phoenix Tech Hub.\n</p><p>\nAs part of its recruitment and hiring efforts, Amazon is constantly innovating and creating new programs to provide candidates of all backgrounds and levels of experience the opportunity to join the company. Two of the latest programs include:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2Fnews%2Fworkplace%2Famazons-returnship-program-helps-professionals-get-back-to-work&amp;esheet=52553806&amp;newsitemid=20211221005239&amp;lan=en-US&amp;anchor=Amazon+Returnship&amp;index=2&amp;md5=779fe7b19ebd17b5b4ecaab584eb3e87\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Returnship</a>, an initiative to help professionals get back to work after they lost or left their jobs—including people displaced by the impacts of COVID-19. Through this 16-week paid initiative, Amazon is offering the program to people who have been without a job or underemployed for at least a year. The initiative provides them a new opportunity to rejoin the workforce by restarting their careers at Amazon. Candidates go through a customized and abbreviated interview process that takes into account their career trajectory. Once they start in their new role, they receive dedicated support and personalized coaching. During the program, returners work on a specific project and, after four months, have the possibility to move into full-time positions at Amazon.\n</li>\n<li>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2Fnews%2Fworkplace%2Fhow-amazon-is-simplifying-the-job-hunt&amp;esheet=52553806&amp;newsitemid=20211221005239&amp;lan=en-US&amp;anchor=Best+Fit&amp;index=3&amp;md5=2a27128792eed73c68c1a6e2829e467f\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Best Fit</a>, a new program that allows software engineers to apply once and be considered for thousands of jobs across hundreds of teams within the company—including some roles they may not have even thought of.\n</li>\n</ul><p>\nThis investment at Amazon’s Phoenix Tech Hub is part of a multi-city expansion across the country and company. The company plans to create 3,000 jobs across Austin, Chicago, and Phoenix in the next few years. Last year, Amazon announced it would create 500 jobs in the Phoenix area, with an investment also at 100 S. Mill Avenue. There are currently more than 400 corporate and tech roles available at Amazon’s Phoenix Tech Hub. Those interested in can find more information <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Famazon.jobs%2Fen%2F&amp;esheet=52553806&amp;newsitemid=20211221005239&amp;lan=en-US&amp;anchor=here&amp;index=4&amp;md5=52006904aa814017544badacf2811870\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a>.\n</p><p>\n<b><span class=\"bwuline\">Committed to Arizona</span></b>\n</p><p>\nAmazon continues to provide support for communities across Arizona, including organizations such as the Foundation for Southern Arizona, which provides grants to local organizations that support the LGBTQ+ community, and the Ajo Center for Sustainable Agriculture Community, a Native American-governed nonprofit with a mission of supporting a sustainable and just local food system in Ajo, Arizona, and the surrounding region.\n</p><p>\nAmazon also supports local schools through <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazonfutureengineer.com%2F&amp;esheet=52553806&amp;newsitemid=20211221005239&amp;lan=en-US&amp;anchor=Amazon+Future+Engineer&amp;index=5&amp;md5=6a46c5b9e3b0501dd84ad73201fbae9d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Future Engineer</a>, a global computer science education program designed to inspire and educate millions of students each year to try computer science and coding. The program supports more than 40 schools across Phoenix, reaching almost 1,100 students with high-quality computer science curriculum, robotics clubs, and project-based learning.\n</p><p>\nSince 2010, Amazon has created more than 32,000 full- and part-time jobs in Arizona and invested more than $16 billion across the state, including infrastructure from fulfillment centers, Whole Foods Market locations, and the Phoenix Tech Hub. These investments have contributed an additional $13 billion to the Arizona economy and have supported 44,000 indirect jobs—in addition to the employees the company directly employs—from jobs in construction to positions in logistics and professional services. Currently, more than 37,500 independent authors and small and medium-sized businesses in Arizona are growing their businesses with Amazon.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211221005239r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMjIxMDA1MjM5cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=ed7e031ffc9e3ee5cc92a40083744143496ca09813a6b604a22f0288c248b545adf8582d7389e7f1f73a745bd1e76113578db57b6ff2e2fbd8e2391f6a32c4ce\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211221005239/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211221005239/en/</a></span></p><p>\n<b>For media inquiries:\n<br/></b>Zach Goldsztejn \n<br/><a href=\"mailto:amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">amazon-pr@amazon.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AZ-AMAZON</p></div>"}