{"date": "2021-11-25 07:00:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3580.04, "close": 3504.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Lisa Jucca</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">VALVIGNA, Italy, Nov 25 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Lorenzo Bertelli, the eldest son and heir designate to Prada's Chief Executive Patrizio Bertelli, vowed to keep the family-controlled luxury fashion group independent when he <a href=\"https://www.reuters.com/business/pradas-ceo-says-could-hand-over-reins-son-3-yrs-time-2021-11-18\" data-type=\"url\" class=\"tr-link\" translate=\"no\">takes the reins</a> in a few years, he told Reuters.</p><p>Lorenzo Bertelli, a 33-year old former rally driver, is currently Prada's marketing chief and has helped bolster the group's digital business, which aims to account 15% of retail sales in the medium term from just 2% before the pandemic.</p><p>At an <a href=\"https://www.reuters.com/business/retail-consumer/prada-sets-45-bln-euros-revenue-goal-boost-e-commerce-2021-11-18\" data-type=\"url\" class=\"tr-link\" translate=\"no\">investor presentation</a> last week, his father officially crowned him as his successor, saying he could hand over to him in three to four years. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2S95TS\" data-type=\"storyId\" data-story-id=\"nL8N2S95TS\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Earlier this year, Patrizio Bertelli described Lorenzo as a \"key element in the turnaround of the group\" that he and his wife, top fashion designer Miuccia Prada, put in place to revive sales. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2P56E1\" data-type=\"storyId\" data-story-id=\"nL8N2P56E1\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>The revamp strategy, which has focused on moving Prada upmarket by eliminating mark-downs and cutting wholesale distribution, has paid off and Prada is often cited by rival groups as an attractive potential prey.</p><p>However, like his father, Lorenzo Bertelli said the Hong Kong-listed group - in which the family has an 80% stake - was not up for sale.</p><p>\"This is a question for my parents but for me, absolutely yes,\" he said in an interview that will air in full at the upcoming Reuters Next conference on Dec.1, when asked whether he wanted to keep the group in the hands of the family.  </p><p>\"I do not see other directions, also because I hope to have still a long path ahead and so I have to do something with my life. So I would like to stay independent,\" he added, speaking at the group's industrial headquarters and prototyping centre in Valvigna, in Tuscany.</p><p>He did not rule out acquiring other brands, saying there were no opportunities for the time being, but \"tomorrow we do not know.\"</p><p>And he dismissed, at least for the time being, the possibility of the group's main labels - Prada and the younger line Miu Miu - selling on Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, which is seeking to lure prestigious luxury names to its platform. </p><p>\"We tried with one of our smallest brands (Car Shoe) just to have a try,\" he said. \"We don't think at the moment Amazon is ready for the bigger brands ... We don't see either Prada or Miu Miu on the Amazon platform at the moment.\"</p><p>Instead, he reiterated that Prada could be interested in taking a stake in a joint e-commerce venture that Cartier-owner Richemont <a href=\"reuters://REALTIME/Verb=FullQuote/ric=CFR.S\" data-type=\"ric\" data-ric=\"CFR.S\" translate=\"no\" dir=\"ltr\">CFR.S</a> and U.S.-listed online retailer Farfetch <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FTCH.N\" data-type=\"ric\" data-ric=\"FTCH.N\" translate=\"no\" dir=\"ltr\">FTCH.N</a> are discussing. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2S3126\" data-type=\"storyId\" data-story-id=\"nL8N2S3126\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Richemont said earlier this month it was in advanced talks with Farfetch about selling it a minority stake in its online business Yoox Net-a-Porter (YNAP). It added it would also invite other firms to participate in turning YNAP into an industry-wide platform with no overall controlling shareholder. </p><p>A direct investment in the platform \"could be an opportunity,\" Bertelli said.</p><p>The group last week unveiled a medium-term goal of raising its operating profit margin to 20% of sales, below that of bigger competitors like Louis Vuitton or Gucci and Prada's own profitability margin of 27% in its heyday.</p><p>Bertelli said that in the long term the group could go back to that kind of profitability level. But he said Prada preferred to give itself reasonable goals and when possible do even better, rather than aim too high and risk disappointing.</p><p>To watch the Reuters Next conference please register here <a href=\"https://reutersevents.com/events/next/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://reutersevents.com/events/next/</a></p><p>   </p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Writing by Claudia Cristoferi, editing by Silvia Aloisi and Nick Zieminski)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:silvia.aloisi@thomsonreuters.com\" data-type=\"email\" translate=\"no\">silvia.aloisi@thomsonreuters.com</a> ; +393487607044; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://silvia.aloisi.thomsonreuters.com@reuters.net\">silvia.aloisi.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: REUTERS-NEXT/PRADA (PIX)</p></div>"}