{"date": "2022-02-08 16:11:55.134000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>VECIMA NETWORKS INC (\"VCM-T;VNWTF-0\")\n- and Bluepeak Announce Industry's First Cloud-Based Distributed\n- Access Architecture Controller Deployed on AWS\n\n    Vecima Networks Inc. (TSX: VCM) and Bluepeak announced that Bluepeak,\nan innovative and fast-growing internet provider with operations throughout\nSouth Dakota, Minnesota, Oklahoma, and Wyoming, has successfully deployed a\nVecima Entra SC-2D R-MACPHY node managed and controlled by an Entra Access\nController operating on Amazon Elastic Compute Cloud (EC2), a web service\nthat provides secure, resizable compute capacity in the Amazon Web Services\n(AWS) cloud. This proof-of-concept demonstration brings the scale,\nsecurity, and reliability of modern cloud computing directly to progressive\nbroadband networks.\n\n    Hybrid fiber coaxial (HFC) networks are being overwhelmed by an\nexplosion in IP video traffic, high-speed data services, and business\napplications that currently drive enormous annual rates of growth. To cope\nwith these escalating bandwidth demands, cable operators are turning to\nsoftware-driven, all-IP Distributed Access Architectures (DAA) that help to\nincrease the capacity of existing networks to both reduce operating costs\nand improve last mile signal quality. DAA architectures are becoming\nessential for cable operators looking to rapidly deploy new services and\ncost-effectively upgrade their networks.\n\n    Vecima's Entra DAA solution enables operators, like Bluepeak, to\nincrease the capacity of existing HFC infrastructure and eliminate most\ncable-specific, facilities-based network hardware to reduce overall space\nand power requirements. Leveraging modern software constructs, the Vecima\non AWS proof-of-concept optimizes critical infrastructure - placing the\nDOCSIS Media Access Control (MAC) in the node, and the control and\nmanagement plane in the cloud. This permits operators to expand network\ncapacity through the deployment of simple, standards-based IP and Ethernet\nequipment in their facilities.\n\n    The placement of the Vecima Entra Access Controller onto Amazon's EC2\nenvironment is the first step in a journey to a cloud-driven, intelligent,\nand cost-effective set of cloud services for access networks. Cable\noperators immediately benefit from AWS scale, security, and reliability\nwithout having to build and manage on-premises compute and cloud\nenvironments - accelerating time to deploy DAA and lowering overall costs.\n\n    At the same time, the vast suite of AWS services, such as data lakes,\nartificial intelligence (AI) and machine learning (ML) services, and data\nand analytics creation all become native add-ons to this progressive\narchitecture. Many cable operators are exploring convergence strategies for\nfixed and mobile services, and the flexibility of AWS means current and\nfuture Broadband Network Gateway (BNG), Wi-Fi, and 5G network workloads can\nseamlessly become part of the cable operator's service offerings.\n\n    \"AWS is excited to work with both Vecima and Bluepeak on this\ninnovative project,\" said Sameer Vuyyuru, Director and Head of Worldwide\nTelecommunications Business Development at AWS. \"Migrating critical\nelements of modern cable access networks onto AWS enables cable operators\nto securely and confidently scale their converged networks at a high\nvelocity, with lower costs. This proof-of-concept sets the stage for\nfurther innovation in cable, leveraging AWS Outposts, AWS AI and ML, data\nlakes, IoT and broadband management technologies.\"\n\n    \"Vecima's 'DAA in the cloud' proof-of-concept with Bluepeak on AWS\nillustrates the enormous flexibility that DAA introduces to the network,\"\nsaid Jeff Heynen, Vice President, Broadband Access &amp; Home Networking at the\nDell'Oro Group. \"Space, power, and signal quality are the short-term\nbenefits, but the long-term benefits will be innovations built around\nvirtualization and the cloud, whether the operators own cloud or a\nthird-party cloud.\"\n\n    \"Bluepeak's objective is to apply innovative solutions to allow us to\ndeliver the best service to our customers while growing our business in the\nmost efficient way possible,\" said Cash Hagan, Chief Operating Officer at\nBluepeak. \"We are always looking for ways to improve our time to market and\nreduce costs, and we are excited to work with Vecima and AWS to prove out\nthis cloud-based approach.\"\n\n    \"We are proud to work with Bluepeak and AWS on this ground-breaking\nproject,\" added Clay McCreery, Chief Operating Officer at Vecima. \"Our\ncable and fiber access solutions are ideal for cloud-based architectures.\nUnlike other cable access approaches, Remote MACPHY distributes all\ncable-specific functions to the edge of the network in the node. As a\nresult, latency-sensitive and data-intensive functions stay within the\nnetwork, and only the control is placed in the cloud. Cloud-based DAA\nvirtually eliminates hub space requirements, enabling hub collapses and\nreducing real estate expenses.\"\n\n    About Bluepeak\n\n    Bluepeak is building a faster, more reliable internet without the things\nthat get in the way of great service--like red tape, hidden fees, and slow\nresponse times. Offering up to 5 gigabits of speed for residential\ncustomers and 10 gigabits for businesses, Bluepeak is a whole new ballgame\n-- from internet to TV, to connecting every device in a home, to powering a\nbusiness, Bluepeak not only provides the best fiber connections in the\ncommunities it serves, but also meets the growing needs for how its\ncustomers live.\n\n    Bluepeak (Clarity Telecom LLC) is known as Vast Broadband today in\nSouth Dakota, portions of western Minnesota, Oklahoma, and Wyoming until\nthose markets rebrand as Bluepeak in the summer of 2022. Visit\nwww.mybluepeak.com to learn more.\n\n    About Vecima Networks\n\n    Vecima Networks Inc. is a global leader focused on developing integrated\nhardware and scalable software solutions for broadband access, content\ndelivery, and telematics. We enable the world's leading innovators to\nadvance, connect, entertain, and analyze. We build technologies that\ntransform content delivery and storage, enable high-capacity broadband\nnetwork access, and streamline data analytics.\n\n    Further information about Vecima's Entra solution is available at\n<a href=\"https://vecima.com/solutions/distributed-access\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://vecima.com/solutions/distributed-access</a>. Or visit our website at\nwww.vecima.com.\n\nContact Information:\n\nVecima Networks\nInvestor Relations - 250-881-1982\ninvest@vecima.com\n\nTel   : 306-955-7075    VECIMA NETWORKS INC\nFax   : 250-881-1974\nEmail : dale.booth@vecima.com\nWWW   : <a href=\"https://www.vecima.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.vecima.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203800044.MNPRE2203801064-05382820220208</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}