{"date": "2021-12-08 23:58:25.126000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.29, "close": 3483.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Dec 08, 2021</p></div><div class=\"tr-npp-lead\"><p>Amazon (AMZN) closed the most recent trading day at $3,523.16, making no change from the previous trading session. This change lagged the S&amp;P 500's 0.31% gain on the day. At the same time, the Dow added 0.1%, and the tech-heavy Nasdaq gained 0.48%.</p><p>Prior to today's trading, shares of the online retailer had lost 1.48% over the past month. This has was narrower than the Retail-Wholesale sector's loss of 2.72% and lagged the S&amp;P 500's loss of 0.04% in that time.</p></div><div class=\"tr-npp-body\"><p>Wall Street will be looking for positivity from Amazon as it approaches its next earnings report date. In that report, analysts expect Amazon to post earnings of $3.90 per share. This would mark a year-over-year decline of 72.32%. Our most recent consensus estimate is calling for quarterly revenue of $137.63 billion, up 9.62% from the year-ago period.</p><p>AMZN's full-year Zacks Consensus Estimates are calling for earnings of $40.79 per share and revenue of $470.51 billion. These results would represent year-over-year changes of -2.49% and +21.87%, respectively.</p><p>Investors might also notice recent changes to analyst estimates for Amazon. These recent revisions tend to reflect the evolving nature of short-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook.</p><p>Based on our research, we believe these estimate revisions are directly related to near-team stock moves. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.</p><p>The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 2.38% lower within the past month. Amazon is currently sporting a Zacks Rank of #5 (Strong Sell).</p><p>Valuation is also important, so investors should note that Amazon has a Forward P/E ratio of 86.38 right now. For comparison, its industry has an average Forward P/E of 54.33, which means Amazon is trading at a premium to the group.</p><p>It is also worth noting that AMZN currently has a PEG ratio of 3.5. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The Internet - Commerce industry currently had an average PEG ratio of 2.56 as of yesterday's close.</p><p>The Internet - Commerce industry is part of the Retail-Wholesale sector. This industry currently has a Zacks Industry Rank of 227, which puts it in the bottom 11% of all 250+ industries.</p><p>The Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.</p><p>To follow AMZN in the coming trading sessions, be sure to utilize Zacks.com.</p><p><span>Infrastructure Stock Boom to Sweep America</span></p><p>A massive push to rebuild the crumbling U.S. infrastructure will soon be underway. It's bipartisan, urgent, and inevitable. Trillions will be spent. Fortunes will be made.</p><p>The only question is \"Will you get into the right stocks early when their growth potential is greatest?\"</p><p>Zacks has released a Special Report to help you do just that, and today it's free. Discover 7 special companies that look to gain the most from construction and repair to roads, bridges, and buildings, plus cargo hauling and energy transformation on an almost unimaginable scale.</p><p><a href=\"https://www.zacks.com/registration/ultimatetrader/welcome/eoffer/3b9f?add=1728&amp;adid=NEWSTEX_CONTENT_ZU_INFRASTRUCTUREREPORT_TALEOFTAPE_515_12082021&amp;cid=CS-NEWSTEX-FT-tale_of_the_tape%7Cyseop_template_6-1837071\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Download FREE: How to Profit from Trillions on Spending for Infrastructure &gt;&gt;</a></p><p>Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.</p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=RPT_7BST_LP194&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_TALEOFTAPE_515&amp;cid=CS-NEWSTEX-FT-tale_of_the_tape%7Cyseop_template_6-1837071\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Click to get this free report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=AMZN&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_TALEOFTAPE_515&amp;cid=CS-NEWSTEX-FT-tale_of_the_tape%7Cyseop_template_6-1837071\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. (AMZN): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/stock/news/1837071/amazon-amzn-flat-as-market-gains-what-you-should-know?cid=CS-NEWSTEX-FT-tale_of_the_tape%7Cyseop_template_6-1837071\" data-type=\"url\" class=\"tr-link\" translate=\"no\">To read this article on Zacks.com click here.</a></p><p>The views expressed in any and all content distributed by Newstex and its re-distributors (collectively, the \"Newstex Authoritative Content\") are solely those of the respective author(s) and not necessarily the views of Newstex or its re-distributors. Stories from such authors are provided \"AS IS,\" with no warranties, and confer no rights. The material and information provided in Newstex Authoritative Content are for general information only and should not, in any respect, be relied on as professional advice. Newstex Authoritative Content is not \"read and approved\" before it is posted. Accordingly, neither Newstex nor its re-distributors make any claims, promises or guarantees about the accuracy, completeness, or adequacy of the information contained therein or linked to from such content, nor do they take responsibility for any aspect of such content. The Newstex Authoritative Content shall be construed as author-based content and commentary. Accordingly, no warranties or other guarantees are offered as to the quality of the opinions, commentary or anything else appearing in such Newstex Authoritative Content. Newstex and its re-distributors expressly reserve the right to delete stories at its and their sole discretion.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Zacks Investment Research</p></div>"}