{"date": "2021-11-16 13:28:22+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds link to Total Health event</p><p class=\"tr-by\">By Jeffrey Dastin</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Nov 15 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> has reached a deal to sell virtual medical services to Hilton <a href=\"reuters://REALTIME/Verb=FullQuote/ric=HLT.N\" data-type=\"ric\" data-ric=\"HLT.N\" translate=\"no\" dir=\"ltr\">HLT.N</a> in the United States, landing a marquee customer for its nascent healthcare business.</p><p>The company declined to disclose financial terms of its agreement with the hotel chain.</p><p>The world's biggest online retailer has looked to sign up employers to Amazon Care, its on-demand health offering that lets users message or video-chat clinicians and receive home visits in some cities. Amazon piloted the service for its employees around Seattle in 2019, and this summer it started marketing Care nationwide to other companies.</p><p>The deal with Hilton Worldwide Holdings Inc, which Reuters is first to report, marks Amazon Care's first hospitality customer and only its second disclosed client after fitness equipment maker Precor. It shows how the company is seeking to disrupt the healthcare industry with a tried-and-true playbook.</p><p>Just as Amazon built data centers to satisfy its e-commerce needs and later sold access to this infrastructure in what became its cloud-computing business, so is Amazon looking to market a healthcare service it built first for its workers' benefit.</p><p>Speaking at Reuters' Total Health conference on Monday, Kristen Helton, director of Amazon Care, called the Hilton deal \"a great step forward for the business to show we can provide care nationwide to their team members.\" <a href=\"https://reutersevents.com/events/healthcare\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://reutersevents.com/events/healthcare/</a></p><p>Hilton employed about 141,000 people globally as of Dec. 31, 2020. All its U.S. staff enrolled in a corporate health plan will have Amazon Care as a benefit next year.</p><p>That means virtual meetings with clinicians from Care Medical, a company focused on serving Amazon Care users. Amazon also offers house calls in greater Seattle and the Washington-Baltimore metro area, with plans to expand to Los Angeles, Chicago, Dallas, Philadelphia and Boston.</p><p>Helton said employers' pandemic safety concerns and recruiting needs during a labor shortage have contributed to demand.</p><p>\"Attracting and retaining talent is so critical for businesses right now,\" she said.</p><p>Hilton pays for workers' access to care and for a portion of the visit expenses. Text chats via Amazon Care will be free to the hotel chain's employees, while provider video or home visits carry a small fee, she said.</p><p>Artificial intelligence (AI) will play a greater role in the future, too.</p><p>\"We will have clinicians in the loop for a period of time until we can actually trust that AI and those technology solutions are taking care of the patient in the way that is best,\" Helton said.</p><p>Amazon is looking to technology to reduce providers' post-care work and lower costs, though the human connection remains very important, she said.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting By Jeffrey Dastin in Palo Alto, California; editing by Diane Craft and Edward Tobin)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Jeffrey.Dastin@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Jeffrey.Dastin@thomsonreuters.com</a> ; +1 424 434 7548; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-HEALTHCARE/HILTON WRLDWIDE (UPDATE 2, PIX)</p></div>"}