{"date": "2021-01-11 10:30:35.647000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3501.0, "close": 3534.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Read Article AVEVA has attained a Gold Application Development competency and Silver Cloud Platform, Data Analytics, and Data Center competencies, demonstrating a 'best-in-class' ability and commitment to meet Microsoft Corp. customers' evolving needs ...</p><p>AVEVA has attained a Gold Application Development competency and Silver Cloud Platform, Data Analytics, and Data Center competencies, demonstrating a 'best-in-class' ability and commitment to meet Microsoft Corp. customers' evolving needs in today's mobile-first, cloud-first world and distinguishing itself within a small percentage of the Microsoft partner ecosystem. A portfolio of competencies showcases that AVEVA is committed to focusing on on-demand, business solution areas, along with ensuring it can meet the evolving needs of our mutual customers.</p></div><div class=\"tr-npp-body\"><p>To earn a Microsoft competency, partners must successfully complete exams (resulting in Microsoft Certified Professionals) to prove their level of technology expertise and, for Gold competencies, designate these certified professionals uniquely to one Microsoft competency, ensuring a certain level of staffing capacity. Partners must also submit customer references that demonstrate successful projects and pass technology and/or sales assessments. For gold competencies, partners must also implement a yearly customer satisfaction study and, for many competencies, meet a revenue commitment.</p><p>\"AVEVA is enabling industrial organizations to embrace innovative digital platforms that will allow them to deploy faster, reduce energy consumption and emissions, and work more collaboratively\", commented Steen Lomholt-Thomsen, Chief Revenue Officer at AVEVA. \"These Microsoft competencies not only showcase our technology expertise, but also demonstrate our commitment to supporting customers and embracing innovation. By deploying our solutions, customers can be empowered to deliver better business outcomes, which will in turn help to accelerate their own success.\"</p><p>\"By accomplishing a portfolio of competencies, partners demonstrate true commitment to meeting customer technology needs today and into the future,\" said Gavriella Schuster, corporate vice president, Worldwide Partner Group at Microsoft Corp. \"These partners' proficiency and expertise of Microsoft technology is instrumental in helping our mutual customers continue to drive innovative solutions.\"</p><p>All 17 Microsoft technology competencies differentiate a partner's specific technology capabilities, helping customers find qualified solution providers with expertise in discrete areas quickly and easily.</p><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}