{"date": "2021-12-07 16:41:37.083000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>VOIP PAL.COM INC (\"VPLM-0\")\n- Provides a Legal Update on Current Litigation in the Western\n- District of Texas\n\n     VoIP-Pal.com Inc. (\"VoIP-Pal\", \"Company\") is pleased to provide an\nupdate on the Company's lawsuits currently being litigated in the Western\nDistrict of Texas (WDTX).\n\n     The Court has lifted the stay on legal proceedings in the following\ncases:\n\n     *  VoIP-Pal v. Facebook/WhatsApp; Civil Action No. 6:20-cv-267\n     *  VoIP-Pal v. Amazon.com Inc. et al.; Civil Action No. 6:20-cv-272\n     *  VoIP-Pal v. Google LLC; Civil Action No. 6:20-cv-269\n\n     The above cases, originally filed in April 2020, assert VoIP-Pal's\nUnited States Patent No. 10,218,606, \"Producing Routing Messages For Voice\nOver IP Communications.\"  The cases were stayed on September 30, 2020,\npending the outcome of certain motions in declaratory-judgment actions\nfiled against VoIP-Pal in the Northern District of California (NDCAL).\n\n     With those actions in the NDCAL cases now dismissed, the stays in the\nWDTX cases have been lifted. The cases are now moving forward together with\nthe new cases filed by the Company in June 2021, asserting VoIP-Pal's\nUnited States Patent Nos. 8,630,234 and 10,880,721, \"Mobile Gateway.\" A\nMarkman hearing is scheduled for May 2022, to conduct claim construction on\nthe asserted patents in both sets of cases prior to a jury trial.\n\n     About VoIP-Pal.com Inc.\n\n     VoIP-Pal.Com, Inc. (\"VoIP-Pal\") is a publicly traded corporation\n(OTCQB: VPLM) headquartered in Waco, Texas. The Company owns a portfolio of\npatents relating to Voice-over-Internet Protocol (\"VoIP\") technology that\nit is currently looking to monetize.\n\n     Any forecast of future financial performance is a \"forward looking\nstatement\" under securities laws. Such statements are included to allow\npotential investors the opportunity to understand management's beliefs and\nopinions with respect to the future so that they may use such beliefs and\nopinions as one factor among many in evaluating an investment. While the\nCompany believes in the circumstances that legal action is needed to\nmonetize its patents, patent litigation involves various risks and\nuncertainties that could affect its ability to monetize the patents. We\nrecognize that it is impossible to predict the specific outcomes of\nlitigation.\n\n//st\n\n                   Corporate Website:      www.voip-pal.com\n\n                   IR inquiries:           IR@voip-pal.com\n\n                   IR\n\nContact: Rich Inza   (954) 495-4600\n\n//et\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134000366.MNPRE2134002358-08192120211207</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}