{"date": "2021-08-12 23:15:13.218000+00:00", "ticker": "III", "mrkt_info": {"open": 1337.0, "close": 1336.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ALGONQUIN POWER &amp; UTILITIES CORP (\"AQN-TN\")\n- 2021 Second Quarter Financial Results\n\n     Algonquin Power &amp; Utilities Corp. (\"AQN\" or the \"Company\") announced\nfinancial results for the second quarter ended June 30, 2021. All amounts\nare shown in United States dollars (\"U.S. $\" or \"$\"), unless otherwise\nnoted.\n\n     \"We are pleased to report strong year-over-year earnings growth in the\nsecond quarter, supported in part by the approximately 1,400 MW of\nrenewable energy projects placed in service since August 2020 and\ncontributions from our recent acquisitions,\" said Arun Banskota, President\nand Chief Executive Officer of AQN. \"In the quarter, we successfully\ncompleted our Midwest 'greening the fleet' initiative, which is expected to\nprovide clean and cost effective energy solutions to our customers,\naligning with our commitment to advancing a sustainable energy and water\nfuture.\"\n\n     Q2 2021 Financial Highlights\n\n//st\n\n  * Revenues of $527.5 million, an increase of 54%;\n  * Adjusted EBITDA1 of $244.9 million, an increase of 39%;\n  * Adjusted Net Earnings1 of $91.7 million, an increase of 93%; and\n  * Adjusted Net Earnings1 per share of $0.15, an increase of 67%, in each\n    case compared to the second quarter of 2020.\n\n//et\n\n     Key Financial Information\n\n//st\n\n  All amounts in U.S.     Three Months Ended June 30\n  $ millions except\n  per share information\n\n                          2021                       2020\nChange\n\n  Revenue                 527.5                      343.6            54%\n\n  Net earnings            103.2                      286.2            (64)%\n  attributable to\n  shareholders\n\n  Per share               0.16                       0.54             (70)%\n\n  Cash provided by        103.3                      142.9            (28)%\n  operating activities\n\n  Adjusted Net            91.7                       47.4             93%\n  Earnings1\n\n  Per share               $                 0.15     0.09             67%\n\n  Adjusted EBITDA1        244.9                      176.3            39%\n\n  Adjusted Funds from     161.3                      93.4             73%\n  Operations1\n\n  Dividends per share     $                 0.1706   $       0.1551   10%\n\n//et\n\n//st\n\n  1.   Please refer to \"Non-GAAP Financial Measures\" at the end of this\n       document for further details.\n\n//et\n     Corporate Highlights\n\n//st\n\n  * Achieved Milestone of 4 GW of Aggregate Renewable Power Generation -\n    Through its Regulated Services Group and Renewable Energy Group, the\n    Company directly owns and operates hydroelectric, wind and solar\n    facilities with a combined net generating capacity of approximately 2.8\n    GW. In addition to directly owned and operated assets, the Company has\n    investments in renewable generating assets with approximately 1.3 GW of\n    net generating capacity. As at June 30, 2021, the Company has added\n    approximately 1.4 GW of renewable generation since the beginning of\n2020\n    and remains on track to achieving the addition of 2.0 GW of renewable\n    power generating capacity between 2019 and the end of 2023, one of the\n    key ESG goals set out in the Company's 2020 Sustainability Report.\n  * Completion of Midwest Greening the Fleet Initiative - In the second\n    quarter of 2021, the Regulated Services Group successfully completed\nthe\n    construction and acquisition of all wind facilities related to its\n    inaugural 'greening the fleet' initiative. The initiative consists of\n600\n    MWs of new strategically located wind energy generation which is\nexpected\n    to provide benefits to the Regulated Services Group's electric\ncustomers\n    in Missouri, Arkansas, Oklahoma and Kansas. The initiative also\nresulted\n    in the early retirement of the 200 MW Asbury Coal Facility (\"Asbury\")\non\n    March 1, 2020, approximately 15 years ahead of its original retirement\n    schedule. The early retirement of Asbury has reduced the Company's CO2e\n    emissions by more than 900,000 metric tons, bringing the Company's\ntotal\n    reduction of greenhouse gas (\"GHG\") emissions to over 1 million metric\n    tons since 2017. With the drive to responsibly minimize CO2e emissions,\n    AQN's commitment to 'greening the fleet' supports important growth and\n    sustainability levers. The early retirement has also contributed to the\n    reduction in the Company's total Scope 1 GHG emissions and reductions\nin\n    the Company's emission intensity per dollar of revenue since 2017, the\n    year in which the Company acquired The Empire District Electric Company\n    (\"Empire\"), which owns Asbury. Since 2017, Empire has seen an\n    approximately 26% reduction in emission intensity per dollar of\nrevenue,\n    an attestation to the Company's responsible stewardship of energy\n    infrastructure. AQN was an early pioneer in seeking to build renewables\n    into rate base to promote customer savings and remains committed to\n    further \"greening the fleet\" initiatives consistent with its\n    sustainability and growth strategy.\n  * Completion of the Altavista Solar Project - On June 1, 2021, the\n    Renewable Energy Group achieved full commercial operations at its 80 MW\n    Altavista Solar Facility, located in Campbell County, Virginia. The\n    Altavista Solar Facility is the Renewable Energy Group's sixth solar\n    powered electric generating facility and is expected to generate\n    approximately 174 GW-hrs of energy per year with the majority of output\n    being sold to Facebook Operations, LLC, a wholly-owned subsidiary of\n    Facebook, Inc., pursuant to a power purchase agreement.\n  * Acquisition of Majority Interest in Fourth Texas Coastal Wind Facility\n-\n    On August 12, 2021, the Renewable Energy Group closed the acquisition\nof\n    a 51% interest in the West Raymond Wind Facility that it had previously\n    agreed to purchase from RWE Renewables Americas, LLC, a subsidiary of\nRWE\n    AG. The West Raymond Wind Facility is located in the coastal region of\n    south Texas, achieved commercial operations in the third quarter of\n2021\n    and has a generating capacity of approximately 240 MW. With the\n    acquisition of the West Raymond Wind Facility and the three wind\n    facilities that were acquired in the first quarter of 2021 (Stella,\n    Cranell, and East Raymond), the Renewable Energy Group now owns a 51%\n    interest in the portfolio of four wind facilities that have a total\n    generating capacity of approximately 861 MW.\n  * Completed EnergyNorth Gas System Regulatory Proceeding - The Company's\n    EnergyNorth Gas System reached a settlement in New Hampshire which\nbecame\n    effective August 1, 2021. As part of the settlement, the Commission\n    authorized a permanent rate increase of $7.6 million based on a return\non\n    equity of 9.3% and an equity capital structure of 52%, and received\n    authorization for a property tax tracking mechanism, which is expected\nto\n    further increase the predictability of earnings. In addition, step\n    adjustments of $4.0 million for 2021, and $3.2 million for 2022, were\n    authorized as part of the settlement, pending further diligence and\n    hearings.\n  * Growth Plan on Track - For the six months ended June 30, 2021, the\n    Company's capital expenditures totaled $3.14 billion. During this\nperiod,\n    the Regulated Services Group invested $1.51 billion related to the\n    acquisition of the North Fork Ridge, Neosho Ridge, and Kings Point Wind\n    Facilities, and ongoing investments relating to the safety and\n    reliability of the electric and gas systems. The Renewable Energy Group\n    invested $1.63 billion primarily related to the acquisitions of the\n    previously unowned portions of the Maverick Creek and Sugar Creek Wind\n    Facilities and Altavista Solar Facility from its joint venture\npartners,\n    and the acquisition of a 51% interest in three Texas Coastal Wind\n    Facilities (Stella, Cranell and East Raymond). The Company's renewable\n    energy construction pipeline remains robust, with construction\ncontinuing\n    to progress well on Blue Hill Wind in Saskatchewan (175 MW) and Val-Eo\n    Wind in Quebec (24 MW) and with construction commencing on Shady Oaks\nII\n    Wind in Illinois (108 MW) and New Market Solar in Ohio (100MW) in the\n    second quarter of 2021. The Company's five-year capital plan of $9.4\n    billion from 2021 through 2025 remains on track.\n  * Inaugural Issuance of Green Equity Units - During the second quarter of\n    2021, the Company completed an offering of 23,000,000 equity units (the\n    \"Green Equity Units\") for total gross proceeds of $1.15 billion (which\n    includes the units issued pursuant to the underwriters' over-allotment\n    option, which was exercised in full). The net proceeds have been or\nwill\n    be, as applicable, used to finance or refinance investments in\nrenewable\n    energy generation or facilities or other clean energy technologies in\n    accordance with the Company's Green Financing Framework. The Green\nEquity\n    Units have been assigned high equity credit (100% equity treatment)\nfrom\n    S&amp;P Global Ratings, further strengthening AQN's balance sheet and\n    reinforcing the Company's commitment to investment grade BBB credit\n    ratings. This is the Company's fourth \"green\" offering and aligns with\n    AQN's commitment to advancing a sustainable energy and water future.\n\n//et\n\n     Additional information regarding AQN is available on its web site at\nwww.AlgonquinPowerandUtilities.com and in its corporate filings on SEDAR at\nwww.sedar.com and EDGAR at www.sec.gov.\n\n     Earnings Conference Call\n\n     AQN will hold an earnings conference call at 10:00 a.m. eastern time\non Friday, August 13, 2021 hosted by President and Chief Executive Officer,\nArun Banskota and Chief Financial Officer, Arthur Kacprzak.\n\n//st\n\n  Date:        Friday, August 13, 2021\n\n  Time:        10:00 a.m. ET\n\n  Conference   Toll Free Dial-In Number\n(833)\n  Call:\n670-0721\n\n               Toll Dial-In Number\n(825)\n\n312-2060\n\n               Conference ID\n8160639\n\n  Webcast:\n<a href=\"https://event.on24.com/wcc/r/3196639/C5D5FF99122874A213D865F458E5849F\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://event.on24.com/wcc/r/3196639/C5D5FF99122874A213D865F458E5849F</a>\n\n               Presentation also available at:\nwww.algonquinpowerandutilities.com\n\n//et\n\n     About Algonquin Power &amp; Utilities Corp. and Liberty\n\n     Algonquin Power &amp; Utilities Corp., parent company of Liberty, is a\ndiversified international generation, transmission, and distribution\nutility with over $16 billion of total assets. Through its two business\ngroups, the Regulated Services Group and the Renewable Energy Group, AQN is\ncommitted to providing safe, secure, reliable, cost-effective, and\nsustainable energy and water solutions through its portfolio of electric\ngeneration, transmission, and distribution utility investments to over one\nmillion customer connections, largely in the United States and Canada. AQN\nis a global leader in renewable energy through its portfolio of long-term\ncontracted wind, solar, and hydroelectric generating facilities. AQN owns,\noperates, and/or has net interests in over 4 GW of installed renewable\nenergy capacity.\n\n     AQN is committed to delivering growth and the pursuit of operational\nexcellence in a sustainable manner through an expanding global pipeline of\nrenewable energy and electric transmission development projects, organic\ngrowth within its rate-regulated generation, distribution, and transmission\nbusinesses, and the pursuit of accretive acquisitions.\n\n     AQN's common shares, Series A preferred shares, and Series D preferred\nshares are listed on the Toronto Stock Exchange under the symbols AQN,\nAQN.PR.A, and AQN.PR.D, respectively. AQN's common shares, Series 2018-A\nsubordinated notes, Series 2019-A subordinated notes and equity units are\nlisted on the New York Stock Exchange under the symbols AQN, AQNA, AQNB,\nand AQNU, respectively.\n\n     Visit AQN at www.algonquinpowerandutilities.com and follow us on\nTwitter @AQN_Utilities.\n\n     Caution Regarding Forward-Looking Information\n\n     Certain statements included in this news release constitute\n\"forward-looking information\" within the meaning of applicable securities\nlaws in each of the provinces of Canada and the respective policies,\nregulations and rules under such laws and \"forward-looking statements\"\nwithin the meaning of the U.S. Private Securities Litigation Reform Act of\n1995 (collectively, \"forward-looking statements\"). The words \"will\",\n\"expects\", \"intends\", \"plans\", and similar expressions are often intended\nto identify forward-looking statements, although not all forward-looking\nstatements contain these identifying words. Specific forward-looking\nstatements in this news release include, but are not limited to statements\nregarding: expected future capital investments; expectations regarding the\naggregate generating capacity and timing for completion of the Company's\nrenewable energy projects; expected generation of the Altavista Solar\nFacility; anticipated customer benefits resulting from the Midwest\n'greening the fleet' initiative; the expected benefit of the EnergyNorth\nproperty tax tracking mechanism on the predictability of earnings; and\nexpectations regarding the use of the net proceeds from the Company's\noffering of Green Equity Units. These statements are based on factors or\nassumptions that were applied in drawing a conclusion or making a forecast\nor projection, including assumptions based on historical trends, current\nconditions and expected future developments. Since forward-looking\nstatements relate to future events and conditions, by their very nature\nthey require making assumptions and involve inherent risks and\nuncertainties. AQN cautions that although it is believed that the\nassumptions are reasonable in the circumstances, these risks and\nuncertainties give rise to the possibility that actual results may differ\nmaterially from the expectations set out in the forward-looking statements.\nMaterial risk factors and assumptions include those set out in AQN's\nManagement Discussion &amp; Analysis and Annual Information Form for the year\nended December 31, 2020, and in AQN's Management Discussion &amp; Analysis for\nthe three months ended June 30, 2021 (the \"Interim MD&amp;A\"), each of which is\nor will be available on SEDAR and EDGAR. Given these risks, undue reliance\nshould not be placed on these forward-looking statements, which apply only\nas of their dates. Other than as specifically required by law, AQN\nundertakes no obligation to update any forward-looking statements to\nreflect new information, subsequent or otherwise.\n\n     Non-GAAP Financial Measures\n\n     The terms \"Adjusted EBITDA\", \"Adjusted Net Earnings\" and \"Adjusted\nFunds from Operations\" are used in this press release. The terms \"Adjusted\nEBITDA\", \"Adjusted Net Earnings\" and \"Adjusted Funds from Operations\" are\nnot recognized measures under U.S. GAAP. There is no standardized measure\nof \"Adjusted EBITDA\", \"Adjusted Net Earnings\" and \"Adjusted Funds from\nOperations\"; consequently, AQN's method of calculating these measures may\ndiffer from methods used by other companies and therefore may not be\ncomparable to similar measures presented by other companies. An\nexplanation, calculation and analysis of \"Adjusted EBITDA\", \"Adjusted Net\nEarnings\" and \"Adjusted Funds from Operations\", including a reconciliation\nto the most directly comparable U.S. GAAP measure, where applicable, can be\nfound in the Interim MD&amp;A.\n\n     Adjusted EBITDA\n\n     Adjusted EBITDA is a non-GAAP measure used by many investors to\ncompare companies on the basis of ability to generate cash from operations.\nAQN uses these calculations to monitor the amount of cash generated by AQN.\nAQN uses Adjusted EBITDA to assess the operating performance of AQN without\nthe effects of (as applicable): depreciation and amortization expense,\nincome tax expense or recoveries, acquisition costs, litigation expenses,\ninterest expense, gain or loss on derivative financial instruments, write\ndown of intangibles and property, plant and equipment, earnings\nattributable to non-controlling interests, non-service pension and\npost-employment costs, cost related to tax equity financing, costs related\nto management succession and executive retirement, costs related to prior\nperiod adjustments due to the Tax Cuts and Jobs Act (\"U.S. Tax Reform\"),\ncosts related to condemnation proceedings, financial impacts on the\nCompany's Senate Wind Facility from the significantly elevated pricing that\npersisted in the Electric Reliability Council of Texas (ERCOT) market over\nseveral days (the \"Market Disruption Event\") as a result of the February\n2021 extreme winter storm conditions experienced in Texas and parts of the\ncentral U.S., gain or loss on foreign exchange, earnings or loss from\ndiscontinued operations, changes in value of investments carried at fair\nvalue, and other typically non-recurring or unusual items. AQN adjusts for\nthese factors as they may be non-cash, unusual in nature and are not\nfactors used by management for evaluating the operating performance of the\nCompany. AQN believes that presentation of this measure will enhance an\ninvestor's understanding of AQN's operating performance. Adjusted EBITDA is\nnot intended to be representative of cash provided by operating activities\nor results of operations determined in accordance with U.S. GAAP, and can\nbe impacted positively or negatively by these items.\n\n     Adjusted Net Earnings\n\n     Adjusted Net Earnings is a non-GAAP measure used by many investors to\ncompare net earnings from operations without the effects of certain\nvolatile primarily non-cash items that generally have no current economic\nimpact or items such as acquisition expenses or litigation expenses that\nare viewed as not directly related to a company's operating performance.\nAQN uses Adjusted Net Earnings to assess its performance without the\neffects of (as applicable): gains or losses on foreign exchange, foreign\nexchange forward contracts, interest rate swaps, acquisition costs,\none-time costs of arranging tax equity financing, certain litigation\nexpenses and write down of intangibles and property, plant and equipment,\nearnings or loss from discontinued operations, unrealized mark-to-market\nrevaluation impacts (other than those realized in connection with the sales\nof development assets), costs related to management succession and\nexecutive retirement, costs related to prior period adjustments due to U.S.\nTax Reform, costs related to condemnation proceedings, financial impacts\nfrom the Market Disruption Event on the Company's Senate Wind Facility,\nchanges in value of investments carried at fair value, and other typically\nnon-recurring or unusual items as these are not reflective of the\nperformance of the underlying business of AQN. The non-cash accounting\ncharge related to the revaluation of U.S. deferred income tax assets and\nliabilities as a result of implementation of the effects of U.S. Tax Reform\nis adjusted as it is also considered a non-recurring item not reflective of\nthe performance of the underlying business of AQN. AQN believes that\nanalysis and presentation of net earnings or loss on this basis will\nenhance an investor's understanding of the operating performance of its\nbusinesses. Adjusted Net Earnings is not intended to be representative of\nnet earnings or loss determined in accordance with U.S. GAAP, and can be\nimpacted positively or negatively by these items.\n\n     Adjusted Funds from Operations\n\n     Adjusted Funds from Operations is a non-GAAP measure used by investors\nto compare cash flows from operating activities without the effects of\ncertain volatile items that generally have no current economic impact or\nitems such as acquisition expenses that are viewed as not directly related\nto a company's operating performance. AQN uses Adjusted Funds from\nOperations to assess its performance without the effects of (as\napplicable): changes in working capital balances, acquisition expenses,\nlitigation expenses, cash provided by or used in discontinued operations,\nfinancial impacts from the Market Disruption Event on the Company's Senate\nWind Facility, and other typically non-recurring items affecting cash from\noperations as these are not reflective of the long-term performance of the\nunderlying businesses of AQN. AQN believes that analysis and presentation\nof funds from operations on this basis will enhance an investor's\nunderstanding of the operating performance of its businesses. Adjusted\nFunds from Operations is not intended to be representative of cash flows\nfrom operating activities as determined in accordance with U.S. GAAP, and\ncan be impacted positively or negatively by these items.\n\n     Reconciliation of Adjusted EBITDA to Net Earnings\n\n     The following table is derived from and should be read in conjunction\nwith the consolidated statement of operations. This supplementary\ndisclosure is intended to more fully explain disclosures related to\nAdjusted EBITDA and provides additional information related to the\noperating performance of AQN. Investors are cautioned that this measure\nshould not be construed as an alternative to U.S. GAAP consolidated net\nearnings.\n\n//st\n\n                                Three Months Ended June 30\n\n  (all dollar amounts in $      2021                         2020\n  millions)\n\n  Net earnings attributable     $                    103.2   $\n286.2\n  to shareholders\n\n  Add (deduct):\n\n  Net earnings attributable     2.9                          4.0\n  to the non-controlling\n  interest, exclusive of\n  HLBV1\n\n  Income tax expense            (4.2)                        46.9\n  (recovery)\n\n  Interest expense              58.2                         44.8\n\n  Other net losses3             1.8                          26.9\n\n  Pension and                   3.9                          3.6\n  post-employment\n  non-service costs\n\n  Change in value of            (27.3)                       (309.8)\n  investments carried at\n  fair value2\n\n  Costs related to tax          5.3                          --\n  equity financing\n\n  Loss (gain) on derivative     1.4                          (1.4)\n  financial instruments\n\n  Realized gain (loss) on       0.2                          (0.6)\n  energy derivative contracts\n\n  Loss on foreign exchange      1.3                          --\n\n  Depreciation and              98.2                         75.7\n  amortization\n\n  Adjusted EBITDA               $                    244.9   $\n176.3\n\n//et\n\n//st\n\n  1   HLBV represents the value of net tax attributes earned during the\n      period primarily from electricity generated by certain U.S. wind\n      power and U.S. solar generation facilities. HLBV earned in the three\n      months ended June 30, 2021 amounted to $21.3 million as compared to\n      $17.3 million during the same period in 2020.\n\n  2   See Note 6 in the unaudited interim consolidated financial\nstatements.\n\n  3   See Note 16 in the unaudited interim consolidated financial\n      statements.\n\n//et\n\n     Reconciliation of Adjusted Net Earnings to Net Earnings\n\n     The following table is derived from and should be read in conjunction\nwith the consolidated statement of operations. This supplementary\ndisclosure is intended to more fully explain disclosures related to\nAdjusted Net Earnings and provides additional information related to the\noperating performance of AQN. Investors are cautioned that this measure\nshould not be construed as an alternative to consolidated net earnings in\naccordance with U.S. GAAP.\n\n     The following table shows the reconciliation of net earnings to\nAdjusted Net Earnings exclusive of these items:\n//st\n\n                               Three Months Ended June 30\n\n  (all dollar amounts in $     2021                          2020\n  millions except per share\n  information)\n\n  Net earnings attributable    $                     103.2   $\n286.2\n  to shareholders\n\n  Add (deduct):\n\n  Loss (gain) on derivative    1.4                           (1.4)\n  financial instruments\n\n  Realized gain (loss) on      0.2                           (0.6)\n  energy derivative\n  contracts\n\n  Other net losses2            1.8                           26.9\n\n  Loss on foreign exchange     1.3                           --\n\n  Change in value of           (27.3)                        (309.8)\n  investments carried at\n  fair value1\n\n  Costs related to tax         5.3                           --\n  equity financing and\n  other non-recurring\n  adjustments\n\n  Adjustment for taxes         5.8                           46.1\n  related to above\n\n  Adjusted Net Earnings        $                     91.7    $         47.4\n\n  Adjusted Net Earnings per    $                     0.15    $         0.09\n  share\n\n//et\n\n//st\n\n  1   See Note 6 in the unaudited interim consolidated financial\nstatements.\n\n  2   See Note 16 in the unaudited interim consolidated financial\n      statements.\n\n//et\n\n     Reconciliation of Adjusted Funds from Operations to Cash Flows from\nOperating Activities\n\n     The following table is derived from and should be read in conjunction\nwith the consolidated statement of operations and consolidated statement of\ncash flows. This supplementary disclosure is intended to more fully explain\ndisclosures related to Adjusted Funds from Operations and provides\nadditional information related to the operating performance of AQN.\nInvestors are cautioned that this measure should not be construed as an\nalternative to cash flows from operating activities in accordance with U.S\nGAAP.\n\n     The following table shows the reconciliation of cash flows from\noperating activities to Adjusted Funds from Operations exclusive of these\nitems:\n\n//st\n\n                                   Three Months Ended June 30\n\n  (all dollar amounts in $         2021                       2020\n  millions)\n\n  Cash flows from operating        $                  103.3   $\n142.9\n  activities\n\n  Add (deduct):\n\n  Changes in non-cash operating    51.8                       (52.6)\n  items\n\n  Costs related to tax equity      5.3                        --\n  financing\n\n  Acquisition-related costs        0.9                        3.1\n\n  Adjusted Funds from Operations   $                  161.3   $        93.4\n\n//et\n\n\nInvestor Inquiries: Amelia Tsang, Vice President, Investor Relations,\nAlgonquin Power &amp; Utilities Corp., E-mail: InvestorRelations@APUCorp.com,\nTelephone: (905) 465-4500;\n\nWWW   : <a href=\"http://www.algonquinpowerandutilities.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.algonquinpowerandutilities.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2122301026.MNPRE2122303378-16115220210812</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}