{"date": "2021-11-01 19:07:34.490000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Southwest Value Partners has announced the five new retail tenants that will be located in Tower 1 of Amazon Nashville, offering a suite of services along with fast-casual dining options available to both Amazon employees and the general public.</p><p>\"We are developing Nashville Yards with an emphasis on healthy living,\" said Cary Mack, managing partner of Southwest Value Partners, owner and developer of the 18-acre Nashville Yards development that is home to Amazon Nashville. \"With that in mind, we have worked carefully and deliberately to identify these five very high-quality food &amp; beverage, fitness, and banking companies to bring outstanding products and services to Amazon Nashville and the rest of downtown Nashville.\"The new retail tenants at Amazon Nashville Tower I include:Crisp &amp; Green: A healthy, fast-casual dining concept founded by Steele Smiley, Crisp &amp; Green offers chef-crafted, scratch-made salads, grain bowls and smoothies. Franchise operators Mark and Lori Mitchell and Alan Hans will open the company's first Tennessee location in a 2,168 square foot space, complete with an outdoor patio, in spring 2022.Orangetheory Fitness: Slated to open in summer 2022, this 3,315 square foot branch of the popular fitness chain will be the fifth Nashville location from franchise operators Brigitte &amp; Don Edwards. John Maxwell of Alpine Ventures served as the local representative for Orangetheory Fitness in the retail transaction.Starbucks: Opening this fall, the 1,152 square foot Starbucks branch located in Tower I will embrace a new app-focused ordering system not previously available in other Nashville locations. Tony Vaughn of Colliers provided local representation for Starbucks in the retail transaction.The Urban Juicer and Eatery: Local juice bar and eatery The Urban Juicer and Eatery will open a 1,095 square foot store in November. Offering healthy food, drinks, and snacks, this will be the restaurant's sixth location from owner Celeste Krenz.Pinnacle Bank: As previously announced, Pinnacle Financial Partners is moving its headquarters to a new multi-tenant office tower at Nashville Yards, and has been named a Founding Partner and the exclusive bank of the development. Pinnacle will open a unique, digitally-focused office concept dubbed the Nashville Innovation Center in Amazon Tower I in early 2022 - the first such location in Pinnacle's portfolio.When complete, Nashville Yards will offer more than 180,000 square feet of total retail and food and beverage space aimed at ensuring Nashville Yards becomes a top destination for locals and visitors alike.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}