{"date": "2021-11-02 07:55:08.785000+00:00", "ticker": "III", "mrkt_info": {"open": 1362.0, "close": 1368.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 9875Q3i Group PLC02 November 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">\n<span>\n</span></p>\n<p class=\"tr-npp-section-title\">\n<span>Press release</span>\n</p>\n<p class=\"tr-npp-section-title\">\n<span>2 November 2021</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>3i Group plc</span>\n</p>\n<p>\n<span>3i portfolio company Action announces appointment of Hajir Hajji to succeed Sander van der Laan as CEO</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The Board of Directors of Action announced today that Sander van der Laan will be stepping down as CEO of Action to be succeeded by Hajir Hajji, currently Commercial Director and member of the executive management team. The handover marks the next phase of development for Action, in which continued commitment to its customers and significant growth will be coupled with the further implementation of Action's digital and sustainability strategy.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Sander van der Laan (53) joined Action as CEO in 2015. Under his leadership, Action has grown from €2 billion revenue with 655 stores in six markets to over €5 billion revenue and 1,869 stores in nine markets now. Sander very successfully led the delivery of the Action strategy also during the challenging Covid-19 period, during which Action and its employees demonstrated extraordinary resilience.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Simon Borrows, Chief Executive of 3i and Chairman of the Board of Action: \"On behalf of 3i and Action's Board I want to recognise and thank Sander for successfully leading the company. Action has continued its strong growth despite the uncertainties presented by the pandemic. He leaves the business performing strongly and on track to deliver its business plan. He has been a driven and committed colleague and I want to thank Sander for his leadership and wish him the very best.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Sander van der Laan added: \"It has been a great pleasure to lead such a great company and team. The passion and drive of our employees has been a source of inspiration for me. When I joined Action, my task was very clear: further strengthen the foundations of the company as the fastest growing non-food discounter in Europe and prepare the leadership of the company for the future. We will soon be opening our 2,000th store and I believe this is the right time for Hajir to take over from me. Hajir <span>is</span> Action. Her achievements across the business are unprecedented. And she is the right professional to lead the team and our operations into the next phase of growth and development. I want to thank Simon and all other members of the Board, my colleagues in the executive management team and all our employees who make Action such an amazing company, for their enormous support during my six years at the helm of Action.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Hajir Hajji: through the ranks of Action</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Hajir Hajji (41) joined Action 24 years ago as a store employee, then aged 17. Over the years she has successfully worked her way through the ranks of the organisation in a variety of management roles. Hajir was Director Store Operations for seven years, responsible for Action's sales and international retail operations, including the opening of new stores and expansion to new markets. For the past three years Hajir worked as Commercial Director, responsible, amongst other things, for global buying, marketing, e-commerce and sustainability. Hajir has been a member of the executive management team since 2011.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The Action Board is delighted that Hajir will succeed Sander. Simon Borrows: \"Hajir is a significant part of the Action DNA and the natural successor to Sander. Action is ready for the next phase of its growth agenda with an increased focus on digital and sustainable growth, two areas for which Hajir is currently responsible. Hajir has great retail expertise and is a strong leader. A long-standing Action executive and an advocate of the Action culture and values, she will bring both continuity and a new push for Action's next phase of growth. I look forward to working with her and wish her success in her new role.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Hajir Hajji: \"Action is a great business with a very strong formula and a unique culture. As we move into a next phase of growth and development, I intend to continue building on our past achievements and explore with our 65,000 dedicated employees and our partners the opportunities ahead. I want to thank Sander for his contribution to the business during his time as CEO, our cooperation and for helping me to get accustomed to my new role. And I want to thank the Board for their confidence in me and the entire Action team.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Hajir will formally become CEO of Action on 1 January 2022, while Sander will remain with the company until the end of March 2022 in order to ensure a smooth transition. The appointment of Hajir is subject to advice from Action's works council.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>- Ends-</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>For further information, contact:</span>\n</p>\n<p>\n<span>\n</span></p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>3i Group plc</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Silvia Santoro</span>\n</p>\n<p>\n<span>Investor enquiries</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Kathryn van der Kroft</span>\n</p>\n<p>\n<span>Media enquiries</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Tel: +44 20 7975 3258</span>\n</p>\n<p>\n<span>Email:</span>\n<span>\n<a href=\"mailto:silvia.santoro@3i.com\" data-type=\"email\" translate=\"no\">silvia.santoro@3i.com</a>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Tel: +44 20 7975 3021</span>\n</p>\n<p>\n<span>Email:</span>\n<span>\n<a href=\"mailto:kathryn.vanderkroft@3i.com\" data-type=\"email\" translate=\"no\">kathryn.vanderkroft@3i.com</a>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<p>\n<span>About 3i Group</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>3i is a leading international investment manager focused on mid-market Private Equity and Infrastructure. Our core investment markets are northern Europe and North America.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>For further information, please visit:</span>\n<span>\n<a href=\"http://www.3i.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.3i.com</a>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>About Action</span>\n</p>\n<p>\n<span>Action is the fastest growing non-food discounter in Europe, offering an ever changing variety of c.6,000 products in almost 1,900 stores to more than 11 million customers every week. In addition, each week another eight million consumers visit the Action.com website. Action employs over 65,000 people in nine countries with over 130 different nationalities. While offering our constantly surprising assortment at the lowest prices, we continue to improve our products in terms of quality and sustainability. The business has responded well to the challenges posed by the pandemic and is on track to deliver on its growth plans for 2021 and beyond in all its markets. The promise of Action: Small prices. Big Smiles.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>MSCFZMGMRMFGMZM</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}