{"date": "2021-12-10 00:24:12.073000+00:00", "ticker": "ABDN", "mrkt_info": {"open": 242.6, "close": 236.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>INDIA FUND INC (\"IFN-N\")\n- The India Fund, Inc. Announces Special Cash Election Distribution\n\n     The India Fund, Inc. (the \"Fund\"), announced that the Fund's Board of\nDirectors has declared a special capital gains distribution in the amount\nof $0.80 per share.\n\n     The special distribution will be payable on January 31, 2022, to\nstockholders of record on December 20, 2021. The distribution will be paid\nin shares of the Fund's common stock. Stockholders may request to be paid\ntheir distributions in cash instead of shares of the Fund's common stock by\nproviding advance notice to the bank, brokerage or nominee who holds their\nshares if the shares are in \"street name,\" or by filling out in advance an\nelection card received from Computershare Investor Services if the shares\nare in registered form. To receive the distribution payable in January 2022\nin cash instead of shares of common stock, the bank, brokerage or nominee\nwho holds the shares must advise the Depository Trust Company as to the\nfull and fractional shares for which they want the distribution paid in\ncash by January 19, 2022, and written notification for the election of cash\nby registered shareholders must be received by Computershare Trust Company,\nN.A. not later than 4:00 p.m. (New York time) on January 19, 2022. The\naggregate amount of cash to be paid out in the distribution will not be\nlimited.\n\n     Stockholder requests to receive cash in lieu of the Fund's common\nstock must be received by Computershare Trust Company, N.A., the Fund's\ntransfer agent, not later than 4:00 p.m. (New York time) on January 19,\n2022.\n\n     The per share value of shares of the Fund's common stock to be issued\nin the distribution will be determined on January 20, 2022. The per share\nvalue will be the average trading price of the Fund's common shares on the\nNew York Stock Exchange as of the close of trading during a three-business\nday period ending on January 20, 2022. Although the distribution is payable\nin 2022, it will be treated as having been paid by the Fund and received by\nstockholders as of December 31, 2021.\n\n     The Fund's Board of Directors considered available options, including\nan all-cash distribution, the payment of an excise tax and postponement of\nthe distribution payment, and a cash election distribution with or without\na cap on the cash component, and approved the cash election distribution\nwithout a cap.\n\n     A written notice of the planned distribution will be sent to\nstockholders. The written notice will include instructions on how\nstockholders can request to receive cash in lieu of stock.\n\n     Stockholders who have questions regarding the distribution may contact\nthe Fund's Investor Services team at 1-800-992-6341.\n\n     IRS and SEC Distribution Disclosure\n\n     Under applicable U.S. tax rules, the amount and character of\ndistributable income for the Fund's fiscal\n\n     year can be finally determined only as of the end of the Fund's fiscal\nyear. However, under Section 19 of\n\n     the Investment Company Act of 1940, as amended (the \"1940 Act\") and\nrelated rules, the Fund may be required to indicate to shareholders the\nestimated source of certain distributions to shareholders.\n\n     The following tables set forth the estimated amounts of the sources of\nthe distributions for purposes of Section 19 of the 1940 Act and the rules\nadopted thereunder. The tables have been computed based on generally\naccepted accounting principles. The tables include estimated amounts and\npercentages for the\n\n     current distributions to be paid as well as for the cumulative\ndistributions paid relating to fiscal year to date, from the following\nsources: net investment income; net realized short-term capital gains; net\nrealized long-term capital gains; and return of capital. The estimated\ncompositions of the distributions may vary because the estimated\ncomposition may be impacted by future income, expenses and realized gains\nand losses on securities and currencies.\n\n     The Fund's estimated sources of the current distributions to be paid\nand for its current fiscal year to date are as follows:\n\n(figure style=\"width:494.75pt;\")\n//st\n\n  Estimated Amounts of Current Distribution per Share\n\n  Fund           Distribution   Net              Net Realized      Net\nRealized      Return of\n                 Amount         Investment       Short-Term\nLong-Term Gains   Capital\n                                Income           Gains**\n\n  IFN            $0.8000        -            -   $0.0400      5%   $0.7600\n95%   -         -\n\n//et\n\n(/figure)(figure style=\"width:499.15pt;\")\n//st\n\n  Estimated Amounts of Fiscal Year to Date Cumulative Distributions per\nShare\n\n  Fund                  Fiscal Year to Date      Net Investment       Net\nRealized Short-Term     Net Realized Long-Term      Return of\n                        Distribution Amount *    Income\nGains**                     Gains                       Capital\n\n                  IFN                  $3.2100                -   -\n$0.1605   5%               $3.0495   95%             -   -\n\n//et\n\n    * The amount reflected is inclusive of the Fund's four established\nquarterly distributions for 2021 and the special cash election\ndistribution.\n**Includes currency gains.\n\n     The amounts and sources of distributions reported in this notice are\nonly estimates and are not being provided for tax reporting purposes. The\nfinal determination of the source of all distributions for the current year\nwill only be made after year-end. The actual amounts and sources of the\namounts for tax reporting purposes will depend upon the Fund's investment\nexperience during the remainder of the fiscal year and may be subject to\nchange based on tax regulations. After the end of each calendar year, a\nForm 1099-DIV will be sent to shareholders for the prior calendar year that\nwill tell you how to report these distributions for federal income tax\npurposes.\n\n     The following table provides the Funds' total return performance based\non net asset value (NAV) over various time periods compared to the Funds'\nannualized and cumulative distribution rates.\n\n(figure style=\"width:446.8pt;\")\n//st\n\n  Fund Performance and Distribution Rate Information\n\n  Fund             Average       Current         Cumulative    Cumulative\n                   Annual        Fiscal          Total         Distribution\n                   Total         Period's        Return on     Rate on NAV\n\n                   Return on     Annualized      NAV\n                   NAV for       Distribution\n                   the 5 Year    Rate on NAV\n                   Period\n                   Ending\n                   11/30/2021\n\n  IFN              13.05%        9.75%           14.78%        7.25%\n\n//et\n\n(/figure)     1 Return data is net of all Fund expenses and fees and\nassumes the reinvestment of all distributions reinvested at prices obtained\nunder the Fund's dividend reinvestment plan.\n\n     2 Based on the Fund's NAV as of November 30, 2021.\n\n     Shareholders should not draw any conclusions about a Fund's investment\nperformance from the amount of the Fund's current distributions or from the\nterms of the distribution policy (the \"Distribution Policy\").\n\n     While NAV performance may be indicative of the Fund's investment\nperformance, it does not measure the value of a shareholder's investment in\nthe Fund. The value of a shareholder's investment in the Fund is determined\nby the Fund's market price, which is based on the supply and demand for the\nFund's shares in the open market.\n\n     Pursuant to an exemptive order granted by the Securities and Exchange\nCommission, the Funds may distribute any long-term capital gains more\nfrequently than the limits provided in Section 19(b) under the 1940 Act and\nRule 19b-1 thereunder. Therefore, distributions paid by the Funds during\nthe year may include net income, short-term capital gains, long-term\ncapital gains and/or a return of capital. Net income dividends and\nshort-term capital gain dividends, while generally taxable at ordinary\nincome rates, may be eligible, to the extent of qualified dividend income\nearned by the Funds, to be taxed at a lower rate not to exceed the maximum\nrate applicable to your long-term capital gains. Distributions made in any\ncalendar year in excess of investment company taxable income and net\ncapital gain are treated as taxable ordinary dividends to the extent of\nundistributed earnings and profits, and then as a return of capital that\nreduces the adjusted basis in the shares held. To the extent return of\ncapital distributions exceed the adjusted basis in the shares held,\n\n     capital gain is recognized with a holding period based on the period\nthe shares have been held at the date such amount is received.\n\n     The payment of distributions in accordance with the Distribution\nPolicy may result in a decrease in the Fund's net assets. A decrease in the\nFund's net assets may cause an increase in the Fund's annual operating\nexpense ratio and a decrease in the Fund's market price per share to the\nextent the market price correlates closely to the Fund's net asset value\nper share. The Distribution Policy may also negatively affect the Fund's\ninvestment activities to the extent that the Fund is required to hold\nlarger cash positions than it typically would hold or to the extent that\nthe Fund must liquidate securities that it would not have sold, for the\npurpose of paying the distribution. Each Fund's Board has the right to\namend, suspend or terminate the Distribution Policy at any time. The\namendment, suspension or termination of the Distribution Policy may affect\nthe Fund's market price per share. Investors should consult their tax\nadvisor regarding federal, state and local tax considerations that may be\napplicable in their particular circumstances.\n\n     Circular 230 disclosure: To ensure compliance with requirements\nimposed by the U.S. Treasury, we inform you that any U.S. tax advice\ncontained in this communication (including any attachments) is not intended\nor written to be used, and cannot be used, for the purpose of (i) avoiding\npenalties under the Internal Revenue Code or (ii) promoting, marketing or\nrecommending to another party any transaction or matter addressed herein.\n\n     Important Information\n\n     In the United States, abrdn is the marketing name for the following\naffiliated, registered investment advisers: Aberdeen Standard Investments\nInc., Aberdeen Asset Managers Ltd., abrdn Australia Limited, abrdn Asia\nLimited, Aberdeen Capital Management, LLC, Aberdeen Standard Investments\nETFs Advisors LLC and Aberdeen Standard Alternative Funds Limited.\n\n     Closed-end funds are traded on the secondary market through one of the\nstock exchanges. The Fund's investment return and principal value will\nfluctuate so that an investor's shares may be worth more or less than the\noriginal cost. Shares of closed-end funds may trade above (a premium) or\nbelow (a discount) the net asset value (NAV) of the fund's portfolio. There\nis no assurance that the Fund will achieve its investment objective.\n\n     If you wish to receive this information electronically, please contact\nInvestor.Relations@abrdn.com\n\n     abrdnifn.com\n\n     For More Information\n\nContact:\n\nAberdeen Standard Investments Inc.\nInvestor Relations\n1-800-992-6341\nInvestor.Relations@abrdn.com\n\nTel   : 800-522-5465    INDIA FUND INC\nEmail : investorrelations@aberdeen-asset.com\nWWW   : <a href=\"https://www.aberdeenifn.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.aberdeenifn.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134200711.MNPRE2134203313-16223820211209</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}