{"date": "2022-01-23 17:50:44.053000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-abstract\"><p>US e-commerce giant Amazon has again written to independent directors of Future Retail (FRL), including Gagan Singh, Ravindra Dhariwal, and Jacob Mathew, expressing its willingness and ability to help FRL address its financial concerns. This included the solution proposed in the term sheet between Amazon-backed private equity firm Samara Capital and FRL, in which the former contemplated an infusion of ~7,000 crore in the Kishore Biyani firm. Amazon has reached out to FRL in response to the retailer's letter in which the company said that it is willing to accept Amazon\u0092s proposal but under certain conditions, and assessment of the proposal will be subject to FRL\u0092s legal obligations.</p></div><div class=\"tr-npp-lead\"><p>Amazon has also sent the letter to top officials, including Ajay Tyagi, chairman, Securities and Exchange Board of India (SEBI), Ashok Gupta, chairman, Competition Commission of India (CCI), and Sanjay Kumar Mishra, director, Enforcement Directorate.</p><p>It has also been sent to top executives at Union Bank of India, Bank of India, SBI, BoB, Central Bank of India, PNB, UCO Bank, and Indian Bank.</p></div><div class=\"tr-npp-body\"><p>\u0093We are pleased that for the first time since our letter dated December 2, 2020, the independent directors are willing to consider Amazon\u0092s assistance in addressing the financial concerns of FRL,\u0094 said Amazon\u0092s letter to FRL\u0092s independent directors (dated January 22) which Business Standard has reviewed. \u0093We note that significant time has been lost on account of the unwillingness of FRL and the independent directors to consider potential solutions facilitated by Amazon in the past. Nevertheless, we reaffirm our offer to assist FRL within the framework of our rights under the agreements.\u0094</p><p>Amazon confirmed that ba­s­ed on FRL\u0092s letter on January 21, Samara Capital (Samara) has reiterated to Amazon that it remains committed to lead and take forward the term sheet dated June 30, 2020, signed among Samara, FRL and the promoters of FRL, which contemplates a purchase consideration of ~7,000 crore with the assistance and cooperation of the independent directors. \u0093Pertinently, the Samara Term Sheet provides for an acquisition of all retail assets of FRL, including the \u0093small store formats\u0094 comprising the \u0091Easy Day\u0092, \u0091Adhaar\u0092 and \u0091Heritage\u0092 brands, through an Indian owned and controlled entity structure led by Samara and supported by Amazon,\u0094 said Amazon\u0092s letter. Queries to Amazon and Future Group remained unanswered until the time of going to press.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Business Standard Ltd.</p></div>"}