{"date": "2021-12-11 19:20:05.316000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3444.24, "close": 3381.83}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">&lt;span class=\"legendSpanClass\"&gt;'Chapter and Verse' will feature notable authors talking about music&lt;/span&gt; - &lt;span class=\"legendSpanClass\"&gt;from the way it inspires the creative process to its influence on their latest works&lt;/span&gt;- &lt;span class=\"legendSpanClass\"&gt;and invite listeners into their literary worlds through sound&lt;/span&gt;</h2>\n<h2 class=\"xn-hedline\">&lt;span class=\"legendSpanClass\"&gt;New series kicks off with authors Nicholas Sparks, Wendy Walker and Jonathan Maberry on Pandora, SiriusXM's Volume channel and on the SXM App&lt;/span&gt;</h2>\n<h2 class=\"xn-hedline\">&lt;span class=\"legendSpanClass\"&gt;James Patterson and Daymond John to follow in the coming months&lt;/span&gt;</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">NEW YORK, Dec. 9, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">NEW YORK</span>, <span class=\"xn-chron\">Dec. 9, 2021</span> /PRNewswire/ -- SiriusXM and Pandora have teamed up with Audible, the leading creator and provider of premium audio storytelling, to create <span>Chapter and Verse, </span>a new programming series that will blend conversations with some of the world's top authors and the music and artists that inspire them.</p>\n\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/831441/siriusxm_pandora_Logo.html\">\n                    <div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"(PRNewsfoto/Sirius XM Holdings Inc.)\" src=\"https://mma.prnewswire.com/media/831441/siriusxm_pandora_Logo.jpg\" title=\"(PRNewsfoto/Sirius XM Holdings Inc.)\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvODMxNDQxL3Npcml1c3htX3BhbmRvcmFfTG9nby5qcGc=&amp;key=05f66aeb7ba25d33c1e1e717a1d611da5723c36906d5815911969f1ab7e179ae89ee3ef14c0f096224a580d653fd93908c70e745fb2747cfc141d1d965ed4248\"/></div></div>\n                        </a>\n                </p>\n\n    </div>\n<p><span>Chapter and Verse </span>will come to life as a monthly feature where a rotation of notable authors whose titles are available on Audible discuss music as an inspiring creative tool, while playing the songs that intersect with their work. This all-new series kicks off today, <span class=\"xn-chron\">December 9</span>, on Pandora, the SXM App and on SiriusXM's Volume channel beginning at <span class=\"xn-chron\">Noon ET</span>.</p>\n<p>At launch, listeners will hear directly from authors <span class=\"xn-person\">Nicholas Sparks</span>, <span class=\"xn-person\">Wendy Walker</span>, and <span class=\"xn-person\">Jonathan Maberry</span> as they talk about their latest literary project and the unique, essential role that music plays in their work.  In the coming months, listeners will hear from authors such as <span class=\"xn-person\">James Patterson</span>, <span class=\"xn-person\">Daymond John</span> and more, as they gain insight into the author's literary world and writing process through sound, featuring a hand-selected soundtrack of music that sparks their creativity.</p>\n<p>On Pandora, the series will be featured as hosted playlists, where new authors' playlists are expected to be added each month. On SiriusXM's Volume, <span>Chapter and Verse</span> will join the channel's line-up of talk programming dedicated to conversations about music.  Listeners can expect to sit back and hear great songs and storytelling about the integral role music can play in an author's world.</p>\n<p>\"This new series brings our listeners more of what they love the most – great music and the personal, one-of-a-kind stories from some of the best storytellers around,\" said <span class=\"xn-person\">Bill Crandall</span>, Vice President of Original Digital Content Programming, Pandora. \"We're looking forward to hearing from some of the most popular writers and sharing their journeys and voices with our audiences.\" </p>\n<p><span>Chapter and Verse </span>will launch with several episodes available including <span class=\"xn-person\">Nicholas Sparks</span> discussing music and his new book, <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3384109-1&amp;h=3555100049&amp;u=https%3A%2F%2Fwww.audible.com%2Fpd%2FThe-Wish-Audiobook%2F1478992689&amp;a=The+Wish\"><span>The Wish</span></a><span>,</span> <span class=\"xn-person\">Wendy Walker</span> talking about her new Audible Original, <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3384109-1&amp;h=2338202952&amp;u=https%3A%2F%2Fwww.audible.com%2Fpd%2FAmerican-Girl-Audiobook%2FB09J5XCVNC&amp;a=American+Girl\"><span>American Girl</span></a><span>, </span>and <span class=\"xn-person\">Jonathan Maberry</span> providing the soundtrack to his Audible Original, <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3384109-1&amp;h=1369355325&amp;u=https%3A%2F%2Fwww.audible.com%2Fpd%2FThe-Werewolfs-15-Minutes-Audiobook%2FB09F1BW9Y2&amp;a=The+Werewolf%27s+15+Minutes\"><span>The Werewolf's 15 Minutes</span></a>.  In the coming months, listeners can hear <span class=\"xn-person\">James Patterson</span> giving insights into his Audible Original, <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3384109-1&amp;h=1694370761&amp;u=https%3A%2F%2Fwww.audible.com%2Fpd%2FThe-Guilty-Audiobook%2FB09D3ZH22P&amp;a=The+Guilty\"><span>The Guilty</span></a>, and <span class=\"xn-person\">Daymond John</span> will be diving into his Audible Original, <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3384109-1&amp;h=2568178597&amp;u=https%3A%2F%2Fwww.audible.com%2Fpd%2FFounding-FUBU-Audiobook%2FB099KLNDB6&amp;a=Founding+Fubu\"><span>Founding Fubu</span></a>. Listeners can catch <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3384109-1&amp;h=1068465935&amp;u=https%3A%2F%2Fwww.pandora.com%2Fplaylist%2FPL%3A78760219068338758%3A287385066&amp;a=Chapter+and+Verse\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Chapter and Verse</a>  on Pandora, SiriusXM's Volume channel 106, and anytime on the SXM App.</p>\n<p><b><u>ABOUT AUDIBLE, INC.<br/></u></b>Audible, Inc., an Amazon.com, Inc. subsidiary (NASDAQ:AMZN), is the leading creator and provider of premium audio storytelling, offering customers a new way to enhance and enrich their lives every day. Audible content includes more than 600,000 audio programs from leading audiobook publishers, broadcasters, entertainers, magazine and newspaper publishers, and business information providers.</p>\n<p><b><u>About SiriusXM<br/></u></b>Sirius XM Holdings Inc. (NASDAQ: SIRI) is the leading audio entertainment company in <span class=\"xn-location\">North America</span>, and the premier programmer and platform for subscription and digital advertising-supported audio products. SiriusXM's platforms collectively reach approximately 150 million listeners, the largest digital audio audience across paid and free tiers in <span class=\"xn-location\">North America</span>, and deliver music, sports, talk, news, comedy, entertainment and podcasts. Pandora, a subsidiary of SiriusXM, is the largest ad-supported audio entertainment streaming service in the U.S. SiriusXM's subsidiaries Stitcher, Simplecast and AdsWizz make it a leader in podcast hosting, production, distribution, analytics and monetization. The Company's advertising sales organization, which operates as SXM Media, leverages its scale, cross-platform sales organization and ad tech capabilities to deliver results for audio creators and advertisers. SiriusXM, through Sirius XM Canada Holdings, Inc., also offers satellite radio and audio entertainment in <span class=\"xn-location\">Canada</span>. In addition to its audio entertainment businesses, SiriusXM offers connected vehicle services to automakers. For more about SiriusXM, please go to: <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3384109-1&amp;h=1342475380&amp;u=http%3A%2F%2Fwww.siriusxm.com%2F&amp;a=www.siriusxm.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.siriusxm.com</a>.</p>\n<p><span>This communication contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include, but are not limited to, statements about future financial and operating results, our plans, objectives, expectations and intentions with respect to future operations, products and services; and other statements identified by words such as \"will likely result,\" \"are expected to,\" \"will continue,\" \"is anticipated,\" \"estimated,\" \"believe,\" \"intend,\" \"plan,\" \"projection,\" \"outlook\" or words of similar meaning. Such forward-looking statements are based upon the current beliefs and expectations of our management and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are difficult to predict and generally beyond our control. Actual results and the timing of events may differ materially from the results anticipated in these forward-looking statements.</span></p>\n<p><span>The following factors, among others, could cause actual results and the timing of events to differ materially from the anticipated results or other expectations expressed in the forward-looking statements:  </span><span>we face substantial competition and that competition is likely to increase over time; our efforts to attract and retain subscribers and listeners, or convert listeners into subscribers, which may not be successful, and may adversely affect our business; we engage in extensive marketing efforts and the continued effectiveness of those efforts is an important part of our business; we rely on third parties for the operation of our business, and the failure of third parties to perform could adversely affect our business; we may not realize the benefits of acquisitions and other strategic investments and initiatives; a substantial number of our Sirius XM subscribers periodically cancel their subscriptions and we cannot predict how successful we will be at retaining customers; our ability to profitably attract and retain subscribers to our Sirius XM service as our marketing efforts reach more price-sensitive consumers is uncertain; our business depends in large part on the auto industry; vehicle production and sales are dependent on may factors, including the availability of consumer credit, general economic conditions, consumer confidence, fuel costs and component supply shortages; the impact of COVID-19, including its variant strains, on our business; failure of our satellite would significantly damage our business; our Sirius XM service may experience harmful interference from wireless operations; our Pandora ad-supported business has suffered a substantial and consistent loss of monthly active users, which may adversely affect our Pandora business; our failure to convince advertisers of the benefits of our Pandora ad-supported service could harm our business; if we are unable to maintain revenue growth from our advertising products, particularly in mobile advertising, our results of operations will be adversely affected; changes in mobile operating systems and browsers may hinder our ability to sell advertising and market our services; if we fail to accurately predict and play music, comedy or other content that our Pandora listeners enjoy, we may fail to retain existing and attract new listeners; privacy and data security laws and regulations may hinder our ability to market our services, sell advertising and impose legal liabilities; consumer protection laws and our failure to comply with them could damage our business; failure to comply with FCC requirements could damage our business; if we fail to protect the security of personal information about our customers, we could be subject to costly government enforcement actions and private litigation and our reputation could suffer; interruption or failure of our information technology and communications systems could impair the delivery of our service and harm our business; the market for music rights is changing and is subject to significant uncertainties; our Pandora services depend upon maintaining complex licenses with copyright owners, and these licenses contain onerous terms; the rates we must pay for \"mechanical rights\" to use musical works on our Pandora service have increased substantially and these new rates may adversely affect our business; our use of pre-1972 sound recordings on our Pandora service could result in additional costs; failure to protect our intellectual property or actions by third parties to enforce their intellectual property rights could substantially harm our business and operating results; some of our services and technologies may use \"open source\" software, which may restrict how we use or distribute our services or require that we release the source code subject to those licenses; rapid technological and industry changes and new entrants could adversely impact our services; we have a significant amount of indebtedness, and our debt contains certain covenants that restrict our operations; we are a \"controlled company\" within the meaning of the NASDAQ listing rules and, as a result, qualify for, and rely on, exemptions from certain corporate governance requirements; while we currently pay a quarterly cash dividend to holders of our common stock, we may change our dividend policy at any time; and our principal stockholder has significant influence, including over actions requiring stockholder approval, and its interests may differ from the interests of other holders of our common stock; if we are unable to attract and retain qualified personnel, our business could be harmed; our facilities could be damaged by natural catastrophes or terrorist activities; the unfavorable outcome of pending or future litigation could have an adverse impact on our operations and financial condition; we may be exposed to liabilities that other entertainment service providers would not customarily be subject to; and our business and prospects depend on the strength of our brands. Additional factors that could cause our results to differ materially from those described in the forward-looking statements can be found in our Annual Report on Form 10-K for the year ended December 31, 2020, which is filed with the Securities and Exchange Commission (the \"SEC\") and available at the SEC's Internet site (http://www.sec.gov). The information set forth herein speaks only as of the date hereof, and we disclaim any intention or obligation to update any forward looking statements as a result of developments occurring after the date of this communication.</span></p>\n<p><b>Source: SiriusXM</b></p>\n<p><b>Media contact:<br/></b><b><u>SiriusXM<br/></u></b><span class=\"xn-person\">Amy Galleazzi</span><br/><a href=\"mailto:Amy.Galleazzi@siriusxm.com\" data-type=\"email\" translate=\"no\">Amy.Galleazzi@siriusxm.com</a></p>\n<p> </p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n</div>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=NY01500&amp;sd=2021-12-09\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1OWTAxNTAwJnNkPTIwMjEtMTItMDk=&amp;key=840c1ca817e3d6f4bf8f72efcbc17aa318676ab4cfc25c4c1d9845a55a0f6bc78c1662e664b38aa5629a81decb86e0fe3ff2a8ff4b5aa0b8ec0cf91bd90ff29b\"/></div></div> View original content to download multimedia:<a href=\"https://www.prnewswire.com/news-releases/siriusxm-and-pandora-launch-chapter-and-verse-series-with-audible-301441452.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/siriusxm-and-pandora-launch-chapter-and-verse-series-with-audible-301441452.html</a><p></p>\n<p>SOURCE  Sirius XM Holdings Inc.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SIRIUSChapterAndVerse</p></div>"}