{"date": "2021-12-21 15:41:53.863000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>CEO Featured in Authority Magazine Article Titled '5 Things I Wish Someone Told Me Before I Became a Founder'; Magazine Reaches 90 Million+ Monthly Visitors</p>\n</div>\n<div class=\"tr-npp-body\">\n<pre>FRIENDABLE INC (\"FDBL-0\")\n- CEO Featured in Authority Magazine Article Titled '5 Things I\n- Wish Someone Told Me Before I Became a Founder'; Magazine\n- Reaches 90 Million+ Monthly Visitors\n\n     Friendable, Inc. (the \"Company\"), a mobile technology and marketing\ncompany, is pleased to announce that the Company's CEO has been featured in\nan article published by Authority Magazine. The article, featuring\nFriendable CEO and Founder Robert A. Rositano Jr., delves into the mind of\na founder and executive, as well as specifically touching on how\nFriendable's Fan Pass livestream artist platform is revolutionizing the\nmusic industry.\n\n     \"We are on the move as the New Year approaches and intend to bring\nmore awareness to our brand, community and platform with a variety of new\nservice offerings set to enhance all artist and fan experiences. To be\ninterviewed by Authority Magazine puts Friendable, Fan Pass, myself and my\nbrother/partner in a very elite class among those who have been previously\ninterviewed by the Authority team, including the founders of GoPro, Zoom,\nZappos, Adobe and Cisco. Thank you to our team, partners and our\nshareholders for their continued support. We are ready for an exciting\n2022,\" said Rositano Jr., CEO, Friendable, Inc.\n\n     Authority Magazine - \"5 Things I Wish Someone Told Me Before I Became\na Founder.\"\n\n     Article Link:\n<a href=\"https://medium.com/authority-magazine/robert-rositano-jr-of-fan-pass-live-5\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://medium.com/authority-magazine/robert-rositano-jr-of-fan-pass-live-5</a>\n-things-i-wish-someone-told-me-before-i-became-a-founder-7df1be3927a\n\n     About Authority Magazine:\n     Authority Magazine is a Medium publication devoted to sharing\ninteresting \"interview series\" featuring people who are authorities in\nbusiness, film, sports and tech. We use interviews to draw out stories that\nare both empowering and actionable. We believe that good stories should\nfeel beautiful to the mind, heart and eyes. Most publications share great\narticles about a single topic. Authority Magazine distinguishes itself by\nproducing large interview series with scores of experts around a single\nempowering topic. Popular interview series include \"Female Disruptors, With\nAkemi Sue Fisher,\" \"Big Ideas, With Christina D. Warner,\" \"Grit, With Phil\nLaboon,\" \"Women of The Blockchain Revolution, With Tyler Gallagher,\"\n\"Mental Health Champions, With Bianca Rodriguez,\" \"Joie de Vivre, With Dr.\nMarina Kostina,\" \"The Future Is Now, With Fotis Georgiadis\" and \"5 Things I\nWish Someone Told Me, With Yitzi Weiner.\" Since 2018, Authority Magazine\nhas conducted more than 30,000 empowering interviews with prominent\nauthorities like Shaquille O'Neal, Peyton Manning, Floyd Mayweather, Baron\nDavis, Kelly Rowland, Bobby Brown, Daymond John, Seth Godin, Lori Greiner,\nRobert Herjavec, Lindsay Lohan, Cal Ripken Jr., David Wells, Jillian\nMichaels, John Sculley, Matt Sorum, Derek Hough, Mika Brzezinski, Blac\nChyna, and the C-Suite executives of companies like eBay, Kroger, American\nExpress, Bank of America, Blue Cross Blue Shield, MasterCard, Comcast,\nPepsi, 3M, EY, L'Oreal, Charles Schwab, FedEx, Walgreens, Zoho, The\nTelevision Academy (Emmys), Intuit, Virgin, Campbell, Walmart, CVS, Wells\nFargo, AT&amp;T, Sprint, Oracle, RedHat, GoPro, Zoom, Udemy, Samuel Adams Beer,\nZappos, Adobe, Capital One, Lockheed Martin, Gallop, Procter &amp; Gamble,\nAnheuser-Busch, Chipotle, Allergan, Deloitte, Intel, Starbucks, McAfee,\nHilton, Cisco, David's Bridal, Taco Bell, Konica Minolta, Morton's Salt,\nUdemy, Kraft Heinz and thousands others.\n\n     To support Fan Pass and our artists:\n     Download the Fan Pass app on the Apple App Store or the Google Play\nStore.\n\n     About Friendable Inc.\n     Friendable Inc. is a mobile technology and marketing company focused\non developing and identifying products, services and brand opportunities\nwith mass market potential and scalability.\n\n     Friendable published its first mobile application in the Apple App\nStore and Google Play Store in 2014 in the social networking and dating\ncategory. The Friendable app achieved over 1.5 million downloads, top 10\nworldwide rankings, and has led to celebrity-related marketing\nopportunities and various relationships with well-known music artists as\nwell as up-and-coming independent artists.\n\n     Friendable has since removed the social dating app from the app stores\nand has pivoted its business focus to Fan Pass, its livestream artist\nplatform. Launched July 24, 2020, the Fan Pass livestream platform has\nproven invaluable for artists and fans alike as performances shifted from\nthe stage to the screen.\n\n     Friendable was founded by brothers Robert A. Rositano Jr. and Dean\nRositano, who have more than 27 years of experience working together on\ntechnology-related ventures.\n\n     For more information, visit www.Friendable.com or www.FanPassLive.com.\n\n     Forward-Looking Statements\n     This press release contains forward-looking statements. The words or\nphrases \"would be,\" \"will allow,\" \"intends to,\" \"will likely result,\" \"are\nexpected to,\" \"will continue,\" \"is anticipated,\" \"estimate,\" \"project\" or\nsimilar expressions are intended to identify \"forward-looking statements.\"\nActual results could differ materially from those projected by Friendable,\nInc. The Company's iTunes rankings should not be construed as an indication\nin any way whatsoever of the future value of Friendable's common stock or\nits present or future financial condition. The public filings of\nFriendable, Inc. made with the Securities and Exchange Commission may be\naccessed at the SEC's Edgar system at www.sec.gov. Statements made herein\nare as of the date of this press release and should not be relied upon as\nof any subsequent date. Friendable, Inc. cautions readers not to place\nreliance on such statements. Unless otherwise required by applicable law,\nFriendable, Inc. does not undertake, and Friendable, Inc. specifically\ndisclaims any obligation, to update any forward-looking statements to\nreflect occurrences, developments, unanticipated events or circumstances\nafter the date of such statement.\n\nContact Information:\n\nFriendable:\nPhone: (855) 473-7473 Ext. 101\n\nEmail: Info@Friendable.com\nwww.Friendable.com\n\nCorporate Communications:\nInvestorBrandNetwork(IBN)\nLos Angeles, California\nwww.InvestorBrandNetwork.com\n310.299.1717 Office\nEditor@InvestorBrandNetwork.com\n\nTel   : 855-473-7473    FRIENDABLE INC\nWWW   : <a href=\"http://www.friendable.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.friendable.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2135400419.MNPRE2135401549-07235920211221</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}