{"date": "2022-02-01 15:40:30+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Supantha Mukherjee and Elizabeth Culliford</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Feb 1 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Spotify investors will focus on how much its 'Netflix for audio' strategy is costing the streaming service when it reports fourth-quarter results on Wednesday against the backdrop of several angry high-profile artists withdrawing their tracks.</p><p>Over the past four years, Spotify <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SPOT.N\" data-type=\"ric\" data-ric=\"SPOT.N\" translate=\"no\" dir=\"ltr\">SPOT.N</a> has spent more than $1 billion on podcasts such as Joe Rogan's in an attempt to triumph over rival music subscription services from Apple <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a> and Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>.</p><p>The <a href=\"https://www.reuters.com/technology/spotify-says-it-will-add-content-advisory-podcasts-that-discuss-covid-2022-01-31\" data-type=\"url\" class=\"tr-link\" translate=\"no\">decision</a> by Neil Young and Joni Mitchell to pull their music from Spotify in protest over the views about COVID-19 in Rogan's podcasts could enrich rivals and anger its listeners if others follow in their footsteps. </p><p>Nevertheless, Wall Street analysts expect Spotify's revenue and premium subscribers to keep growing as advertising rebounds from a pandemic slump and more music streamers try out podcasts.</p><p>Quarterly revenue is expected to increase to 2.65 billion euros ($2.99 billion) from 2.50 billion euros, data from Refinitiv shows.</p><p>\"We expect to hear more on monetization opportunities in podcasts along with plans in audiobooks as SPOT's evolution from music application to audio platform continues, providing a path towards margin expansion,\" UBS analysts wrote in a client note.</p><p>Spotify's shares, which are trading at half the price they were a year ago, lost a quarter of their value last month due to broader tech stock sell-off and publicity over the Rogan row. </p><p>The stock has risen 12% since Rogan apologized and Citigroup gave it a \"buy\" rating. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2UB0E6\" data-type=\"storyId\" data-story-id=\"nL1N2UB0E6\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p><br/></p><p>IN MODERATION</p><p>Podcasts engage users for longer than music, giving more opportunities to place ads and also keeping the audience hooked. Rogan's podcasts are usually more than one hour long and some run to over three hours, with an estimated audience of more than 10 million listeners.  </p><p>Spotify does not break out the share of advertising generated by podcasts, although its chief executive Daniel Ek told Reuters last quarter that growth was in triple digits.  </p><p>But such projections may also be weighed down by the cost of moderating podcasts for misinformation or problematic content.</p><p>The dispute over Rogan's podcast adds pressure for Spotify, which does not disclose how much it spends on content review, to take a more hands-on and transparent approach to moderation. This week it said it would start adding content advisories to episodes discussing <a href=\"https://www.reuters.com/technology/spotify-says-it-will-add-content-advisory-podcasts-that-discuss-covid-2022-01-31\" data-type=\"url\" class=\"tr-link\" translate=\"no\">COVID-19.</a></p><p>Science journalist and podcaster Wendy Zukerman <a href=\"https://www.reuters.com/business/media-telecom/science-podcaster-calls-spotifys-support-joe-rogan-slap-face-2022-02-01\" data-type=\"url\" class=\"tr-link\" translate=\"no\">said</a> on Monday that Spotify's newly-published platform rules do not go far enough to address the problem and said she would start devoting her fact-checking show exclusively to contradicting misinformation spread on Spotify.</p><p>Major tech companies have increasingly invested in human content moderators as well as artificial intelligence in recent years. Podcasts have often received less scrutiny than social media sites on content moderation, partly due to the open nature of the podcasting ecosystem and challenges in moderating audio. </p><p>\"Spotify is one piece and Joe Rogan is one podcaster and there's a very big problem more broadly in this space,\" Valerie Wirtschafter, a senior data analyst at the Brookings Institution, said.</p><p>Spotify's exclusive programming added a greater responsibility for it to build better moderation into its business model, some people close to the industry say.   </p><p>\"To fall back on a cheesy comic-book phrasing, with great power comes great responsibility,\" Owen Grover, former CEO of podcast app Pocket Casts, said.</p><p>($1 = 0.8876 euros)</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Supantha Mukherjee in Stockholm and Elizabeth Culliford in New York; Editing by Kenneth Li and Alexander Smith)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:supantha.mukherjee@thomsonreuters.com\" data-type=\"email\" translate=\"no\">supantha.mukherjee@thomsonreuters.com</a> ; +46 70 721 1004; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://supantha.mukherjee.thomsonreuters.com@reuters.net\">supantha.mukherjee.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SPOTIFY TECH-RESULTS/ (PREVIEW, PIX)</p></div>"}