{"date": "2022-02-24 18:12:34.385000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2896.54, "close": 3075.77}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>AMDOCS LTD (\"DOX-Q\")\n- Amdocs Showcases Amazing Charging Capacity, Enabling 12 Billion\n- Complex Charging Transactions Per Day on the Cloud\n\n     Amdocs, a leading provider of software and services to communications\nand media companies, announced a significant milestone in its program of\nsuccessful implementations of its real-time online charging solution on\nAmazon Web Services (AWS).\n\n     In recent tests, Amdocs and AWS have demonstrated a scale capacity\ntarget of 12 billion complex charging transactions per day, which will be\nan essential part of a proposed business support system (BSS)\ntransformation for a top-tier service provider. Amdocs believes that all\nservice providers will need to comfortably achieve such milestones to fully\nmonetize the different business models enabled by 5G moving forward.\n\n     This performance breakthrough builds upon advancements Amdocs has made\nin cloud-native, service-based architecture design and optimization\nrequired for the 5G market. Previously, Amdocs achieved a one trillion\nevents-per-day benchmark in the cloud, and this recent achievement handled\nmuch more complex online and offline transactions. These volumes support\nreal-world business requirements that would touch hundreds of millions of\ncustomers and devices.\n\n     Separately, Amdocs built a proof of concept for a service provider\nconcerned about roundtrip latency impacts due to the distance between their\ncore network running on-premises and the Amdocs Convergent Charging system\non an AWS Region more than 930 miles apart. Using the customer's backbone\nnetwork and AWS Direct Connect, Amdocs' deployment proved that the overall\nsolution enabled on AWS would meet the customer's service level agreement\n(SLA) requirements while benefiting from the cloud's improved flexibility,\nresiliency, and security.\n\n     Through implementations such as these, Amdocs' charging and policy\ncontrol products will further accelerate the modernization of the\nindustry's information technology (IT) into an open and dynamic\ninfrastructure, improving time-to-market for new innovative services.\n\n     Anthony Goonetilleke, Group President of Technology and Head of\nStrategy at Amdocs said: \"With 5G expected to drive diverse monetization\nmodels across a plethora of connected experiences, this benchmark on AWS\nshowcases the benefits of Amdocs' charging platform leveraging the\nscalability and power of public cloud. This is a critical milestone in our\nrelationship with AWS that showcases our ability to process a leading\nvolume of real-time, low-latency transactions on public cloud\ninfrastructure.\"\n     Supporting Resources\n\n     *  Learn more about Amdocs' charging offerings\n     *  Keep up with Amdocs news by visiting the company's website\n     *  Follow us on Twitter, Facebook, LinkedIn and YouTube\n\n     About Amdocs\n\n     Amdocs helps those who build the future to make it amazing. With our\nmarket-leading portfolio of software products and services, we unlock our\ncustomers' innovative potential, empowering them to provide next-generation\ncommunication and media experiences for both the individual end user and\nenterprise customers. Our 29,000 employees around the globe are here to\naccelerate service providers' migration to the cloud, enable them to\ndifferentiate in the 5G era, and digitalize and automate their operations.\nListed on the NASDAQ Global Select Market, Amdocs had revenue of $4.3\nbillion in fiscal 2021. For more information, visit Amdocs at\nwww.amdocs.com\n\n     Amdocs' Forward-Looking Statement\n\n     This press release includes information that constitutes\nforward-looking statements made pursuant to the safe harbor provision of\nthe Private Securities Litigation Reform Act of 1995, including statements\nabout Amdocs' growth and business results in future quarters. Although we\nbelieve the expectations reflected in such forward-looking statements are\nbased upon reasonable assumptions, we can give no assurance that our\nexpectations will be obtained or that any deviations will not be material.\nSuch statements involve risks and uncertainties that may cause future\nresults to differ from those anticipated. These risks include, but are not\nlimited to, the effects of general economic conditions, Amdocs' ability to\ngrow in the business markets that it serves, Amdocs' ability to\nsuccessfully integrate acquired businesses, adverse effects of market\ncompetition, rapid technological shifts that may render the Company's\nproducts and services obsolete, potential loss of a major customer, our\nability to develop long-term relationships with our customers, and risks\nassociated with operating businesses in the international market. Amdocs\nmay elect to update these forward-looking statements at some point in the\nfuture; however, the Company specifically disclaims any obligation to do\nso. These and other risks are discussed at greater length in Amdocs'\nfilings with the Securities and Exchange Commission, including in our\nAnnual Report on Form 20-F for the fiscal year ended September 30, 2021\nfiled on December 10, 2021, and our Form 6-K furnished for the first\nquarter of fiscal 2022 on February 14, 2022.\n\nContact:\n     Michael Zema\nAmdocs Public Relations\nE-mail: Michael.Zema@amdocs.com\n\n     Emily Holt\nPAN Communications for Amdocs\nEmail: Amdocs@pancomm.com\n\nTel   : 314-212-8328    AMDOCS LTD\nFax   : 314-212-7500\nEmail : dox_info@amdocs.com\nWWW   : <a href=\"https://www.amdocs.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.amdocs.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2205400637.MNPRE2205402703-10030820220224</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}