{"date": "2021-06-16 13:14:31.752000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3536.0, "close": 3598.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>ENPNEWSWIRE-(C)2021 ENPUBLISHING</p><p>Release date- 15062021 - June 2021 Virtual Event Offers First-Hand Opportunity for Industrial Enterprise Leaders to Discover How Digital Transformation Will Accelerate Business Growth in an Ever-Changing Operating Environment.</p></div><div class=\"tr-npp-body\"><p>AVEVA, a global leader in industrial software, driving digital transformation and sustainability, will host its fourth AVEVA World Digital (AWD) conference on the 17th June 2021. Aimed at leaders and decision makers interested in innovative industrial technology, to deliver digital transformation and strengthen resilience in a challenging environment, this is the first joint AVEVA and PI System event since the company acquired OSIsoft earlier this year. AWD, a half-day event, will explore how data-led insights infused with artificial intelligence can help organizations optimize their value chains for long-term business growth.</p><p>AVEVA's recently appointed CEO, Peter Herweck, will kick-off proceedings with a session that lays out how Performance Intelligence, the concept developed by AVEVA to explain the outcome of combining information, artificial intelligence and human insight. Also, in the presenter line-up will be Nicole Malachowski, the first female United States Air Force fighter pilot to be part of the elite Thunderbirds squadron, who will address resilience and innovation by speaking from her own debilitating experience with Lyme Disease. Having lost the ability to read, write, walk, and fly, the one-time advisor to former US First Lady Michelle Obama tapped into her aerodynamic training bounce back - a secret she will share with AWD attendees.</p><p>'I am looking forward to virtually engaging our customers and partners at my first AVEVA World Digital as the company CEO and the first for former OSIsoft customers. Over the past year, digital transformation has demonstrated how trusted data and artificial intelligence can reshape the future of industries, as well as create new experiences and business opportunities,' commented Peter Herweck, CEO, AVEVA. 'We have witnessed how Cloud, and the Industrial Internet of Things (IIoT) continue to drive operational resilience in a digital-first environment. Today, AVEVA's software is enabling organizations, throughout the globe, to harness greater efficiencies, increase agility and accelerate growth - all key factors in also advancing sustainability for industries.'</p><p>Other keynote speakers will include a mix of AVEVA and former OSIsoft speakers - Lisa Johnston, Chief Marketing Officer and Chief Sustainability Officer, AVEVA, Norton Green, Director of Executive Engagements, AVEVA; Rob McGreevy, Executive Vice President of Operations Business, AVEVA and Ronan de Hooge, Head of Information Management Business Unit, AVEVA. A customer panel session comprising AVEVA and heritage OSIsoft customers, including Enbridge, Nutrien and General Mills, will end proceedings.</p><p>Register for AVEVA World Digital today at: <a href=\"https://www.avevaworld.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.avevaworld.com</a></p><p>About AVEVA</p><p>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence. AVEVA's comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries. Learn more at www.aveva.com.</p><p>Copyright 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</p><p>Enquiries:</p><p>AVEVA Media Contacts</p><p>Rose Bambi</p><p>Senior Director Global PR and External Communications</p><p>Tel: +44 (0) 208 323 2789</p><p>rose.bambi@aveva.com</p><p>Caroline Stephens</p><p>Senior Global PR Manager</p><p>caroline.stephens@aveva.com</p><p>Catherine Singh</p><p>Global PR/Social Media Coordinator</p><p>catherine.singh@aveva.com</p><p>External Communications Alias</p><p>external.communications@aveva.com</p><p>[Editorial queries for this story should be sent to newswire@enpublishing.co.uk]</p><p>((Comments on this story may be sent to info@enpublishing.co.uk))</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 M2 Communications Ltd.</p></div>"}