{"date": "2022-01-03 20:32:46.179000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Every day, we scour Amazon to find the best deals available. Whether it's something for your kitchen or top-rated tech to give your smart home an upgrade, the online shopping giant offers some of the best prices on a  <span>very</span> wide range of items. Whatever you need, Amazon has you covered.</p></div><div class=\"tr-npp-body\"><p><span><span>Make 2022 the year of good decisions.</span> Start by signing up for our newsletter for twice-weekly tips, reviews and more from our experts.</span> </p><p>Below, you'll find our top 10 Amazon deals right now, including fitness supplements, kitchen appliances and our favorite smartwatch, all of which have been vetted by our team of deals experts to make sure they're \"best of web\" prices. </p><p>► <span>Samsung sales:</span> Shop Samsung deals on smartphones, TVs, accessories and more for the new year</p><p>► <span>New year, new deals:</span>  Shop the 70 best New Year sales at Amazon, Walmart, Best Buy and more right now</p><p>If you're not already an Amazon Prime subscriber, you can sign up for a 30-day membership for free. An Amazon Prime subscription gets you free two-day shipping and tons of other benefits for $12.99 a month ($6.49 for students and $5.99 for those receiving qualifying government assistance).</p><p class=\"tr-npp-section-title\">The 10 best Amazon deals you can get today</p><p><big>1. Save $60: Our favorite smartwatch</big> </p><p>When it comes to smartwatches we found the Apple Watch Series 7 to be the best tech of its kind. When we tested it, we were impressed with how fast its battery charged and its many fitness tracking abilities, including being able to automatically detect cycling workouts. The Series 7 also has a larger display than its predecessors, making more room for a new watch-friendly keyboard and for an easier time reading text messages or GPS directions. Normally listed from $399, you can get Apple's latest smartwatch for as low as $339 in its 41-millimeter size with GPS capabilities.</p><p><span>Get the Apple Watch Series 7 from $339 (Save $29.01 to $60)</span> </p><p><big>2. Up to 53% off: These multipack fitness supplements</big> </p><p>If your New Year's resolution is to bulk up, Amazon can help with a wide variety of fitness supplements on sale today. You can get a 60-caplet container of Six Star Creatine pills for 53% off its list price of $12.99, bringing the price down to $6.10. Six Star recommends taking three capsules twice a day (once in the morning and once after a workout) to help add energy to your muscles post-workout. You can also get a 12-pack of C4 energy drinks for $20.98, 30% off its list price of $29.99. C4 says each serving is made with zero sugar, zero calories and zero carbs. </p><p><span>Save up to 53% on select fitness supplements</span> </p><p><big>3. Up to 50% off: These Amazon fitness trackers</big> </p><p>Keep a close eye on your health and more with these Amazon fitness trackers on sale today for appealing price cuts. The Halo View promises users the ability to track heart rate, blood oxygen levels and body-fat percentages all on the wrist. Purchases of the View also come with a 12-month subscription to Amazon's Halo program (normally $3.99 a month) that grants access to personalized workout programs, daily meditations and healthy recipes. There's also the more basic Halo Band, which Amazon says can track steps, heart rate and sleep time. Not only does the Band come with six months of free Halo access, but it's also water-resistant. The Halo View is currently 25% off for $59.99 in two different sizes, while the Halo Band is half off for $49.99 in three different sizes.</p><p><span>Save up to 50% on Amazon fitness trackers</span> </p><p><big>4. 28% off: One of our favorite heating pads</big> </p><p>A heating pad is a helpful home health essential and for our money, the Pure Enrichment PureRelief XL heating pad is one of the best picks you can make. Typically priced at $34.99, this generously sized pad is only $27.99 after clipping the $7 off on-page coupon. We ranked the PureRelief XL as one of the best heating pads for being a \"great, no-frills heating pad\" with cozy microplush fabric and easy-to-use controls. Its electric cord is also detachable, making the pad easy to store and throw into the washing machine. </p><p><span>Get the Pure Enrichment PureRelief XL Heating Pad for $27.99 with coupon (Save $7)</span> </p><p><big>5. Up to 49% off: These healthy protein snacks</big> </p><p>If your want to stay focused on your 2022 fitness goals, Amazon has plenty of protein snacks you can score for safe prices today. You can stay hydrated with Gatorade Zero with Protein, which you can get in a 12-pack of 16.9 fluid-ounce bottles for 30% off, at $13.99. Gatorade says its sugar-free drinks have 10 grams of whey protein isolate to help start muscle recovery, along with electrolytes for energy. For a sweet treat, there's a 2-pack of ZonePerfect protein bars on sale for as low as $13.97—30% off its list price of $19.96. ZonePerfect says its bars contain 10 to 15 grams of protein to help you feel fuller, along with up to 19 vitamins and minerals for immune support.</p><p><span>Save up to 49% on select protein snacks</span> </p><p><big>6. Less than $20: This kid-friendly streaming service</big> </p><p>Amazon has some of the best streaming content on the internet and a lot of it isn't just for grown-ups. With the Amazon Kids+ subscription service, users can get access to thousands of books, movies, TV shows, educational apps and more through Amazon's Fire tablets, Kindle e-readers, Echo devices and mobile devices with iOS and Chrome. Kids can watch PBS Kids programs like  <span>Cyberchase</span> , play fun tunes with iHeartRadio Family and read classics like <span>The Hobbit</span> anytime and anywhere they'd like. You can get a one-year subscription to this streaming service for $19.99—a whopping 80% discount from its list price of $99. </p><p><span>Get a 1-Year subscription to Amazon Kids+ for $19.99 (Save $79.01)</span> </p><p><big>7. Up to 42% off: These easy-to-use kitchen appliances</big> </p><p>Upgrade your kitchen with these Hamilton Beach kitchen appliances that Amazon has for helpful discounts. Those looking for a fresh brew in the morning can get the brand's 2-Way Brewer coffee maker on sale in white for $48.99 thanks to a 35% discount. When we tested the single-serve machine, we found it best for those who only need a cup or two most days since it brews either a whole pot or a single cup of joe. For the health experts, there's the Hamilton Beach juicer on sale from $64.99 down 31% to $44.99. Hamilton Beach says the juicer features a three-inch feed chute so you can fit everything from a whole apple to a handful of kale into the machine's 800-watt motor. </p><p><span>Save up to 42% on Hamilton Beach kitchen appliances</span> </p><p><big>8. Less than $25: One of our favorite clothes steamers</big> </p><p>Keep your clothes looking sharp by picking up the Hilife HL7 steamer on sale for just $21.66. Typically listed for $29.99, you can get the compact clothing steamer for 28% off right now. The HL7 is one of the best steamers we've ever tried thanks to a sleek design that features a wider base, a lid on top and an extended spout for steam. It also has a greater water capacity than other similar models and an attached lint comb that keeps you from touching the hot steam head directly on clothes. </p><p><span>Get the Hilife HL7 Clothes Steamer for $21.66 (Save $8.33)</span> </p><p><big>9. 47% off: This compact smart home hub</big> </p><p>Bring your media streaming, video calls and music outlet together in one compact package with Amazon's second-generation Echo Show 5. Normally priced at $84.99, this smart home display can be yours for nearly half-off at $44.99. When we tested the latest Echo Show 5, we were impressed with the improved camera that provided clear video calls and even offered home security video feeds. Not only is its design compact for any kitchen counter or desk, but it's also made from post-consumer cycled plastics and fabrics. </p><p><span>Get the Amazon Echo Show 5 (2nd Generation) for $44.99 (Save $40)</span> </p><p><big>10. Less than $850: One of our favorite exercise bikes</big> </p><p>Skip the crowded, sweaty gyms in 2022 with the Echelon EX-5 exercise bike. Typically listed for $1,199.99, this fitness machine can be in your home for $848—a 29% discount. The EX-5 is one of the best exercise bikes we've ever tried, having impressed us with its fully adjustable seat and handlebars, along with caged pedals that let you ride with your regular sneakers. We also found the workout classes that come with Echelon's two fitness subscription services to be fun and engaging. </p><p><span>Get the Echelon EX-5 Exercise Bike for $848 (Save $351.99)</span> </p><p class=\"tr-npp-section-title\">Amazon deals you may have missed</p><p><big>1. Bowflex and Schwinn Fitness Equipment</big> </p><p>Tackle your 2022 health resolutions with top-tier fitness equipment from Bowflex and Schwinn. Right now, you can save as much as 20% on select weights and exercise machines from these popular brands. For an affordable indoor fitness bike, consider the Schwinn IC4 indoor cycling bike, down from $1,199 to just $799. As the best basic stationary exercise bike we've ever tested, this machine impressed us with excellent Bluetooth connectivity, quiet pedals and useful accessories, including a set of dumbbells and a heart rate monitor. If you're interested in doing more strength training in 2022, a great pick is the Bowflex SelectTech 840 Kettlebell. This convenient weight allows you to change the resistance between 8 pounds and 40 pounds with just the turn of a dial and is currently on sale for just $119—an $80 markdown. </p><p><span>Save up to 20% on Fitness Equipment from Bowflex and Schwinn</span> </p><p><big>2. Cricut Maker</big> </p><p>If you want to impress your friends and family with heartfelt homemade gifts in 2022, we have the Amazon deal for you. The Cricut Maker, a design tool that lets users create their own paper crafts, iron-ons and vinyl decals, is on sale now for $229, a 38% discount from its list price of $369. This Bluetooth enabled smart device is compatible with plenty of Cricut tools and extras, so you'll be able to easily make dozens of professional-quality crafts. Kate Tully Ellsworth, Reviewed's executive commerce editor, called the Maker a \"game-changer\" for letting her create personalized logos for ironing onto quilts and designing homemade cards. </p><p><span>Get the Cricut Maker for $229 (Save $140)</span> </p><p><big>3. Geryon Vacuum Sealer Machine</big> </p><p>Stick to healthy habits in 2022 with easy meal prepping thanks to the Geryon vacuum sealer machine. This automatic food sealer uses a combination of pressure and heat to preserve foods up to five times longer than traditional storage methods, according to the brand. Designed to prevent freezer burn and cut down on food waste, this compact kitchen tool is easy to clean and can be used with 12-inch-wide vacuum sealer bags. Usually priced at $41.99, this vacuum sealer can be yours today for just $39.09. </p><p><span>Get the Geryon Vacuum Sealer Machine for $39.09 with coupon (Save $6.90) </span> </p><p><big>4. Samsung 2-Terabyte T7 Portable SSD </big> </p><p>Keep your important digital files backed up on the Samsung T7 portable SSD for less than $250 right now. Normally listed for $329.99, the 2-terabyte drive is on sale for an $60 price cut, ringing up at just $269.99. The T7 is one of our favorite portable SSDs for its super sleek design and rugged aluminum case. In testing, a 2.7-gigabyte test file took just under six seconds to copy to the T7, making it better for transferring smaller files every now and then rather than moving the entire capacity of a PC hard drive.</p><p><span>Get the Samsung T7 Portable SSD for $269.99 (Save $60)</span>  </p><p><big>5. Medify Air Purifiers </big> </p><p>Rid your home of viruses, odors and dust with an air purifier from Medify, on sale for up to 38% right now at Amazon. For a machine that can tackle big spaces fast, pick up the Medify MA-25 air purifier for $128—$32 off the full $160 list price. Outfitted with a True HEPA filter, the brand claims this air purifier can remove up to 99.9% of particles, including smoke, dust and pet dander. The easy-to-use machine features a touch screen and three fan speeds as well as other convenient settings like sleep mode and child lock. </p><p><span>Save up to 38% on Medify Air Purifiers</span>  </p><p class=\"tr-npp-section-title\">Other noteworthy Amazon deals we found </p><ul class=\"bulleted-list arrowlist\"><li>Save up to 63% on GE kitchen appliances</li><li>BalanceFrom GoYoga All-Purpose Exercise Yoga Mat with Carrying Strap from $18.90 (Save $25.60 to $31.05)</li><li>Lifewit Large Capacity Clothes Storage Bag Organizer, 3-Pack for $19.99 (Save $10)</li><li>Renpho ES-CS20M Smart Bluetooth Body Fat Scale for $23.91 with coupon (Save $13.08)</li><li>Amazon Echo Dot (4th Generation) with Clock for $44.99 (Save $15)</li><li>TurboTax Deluxe 2021 Download Card with Amazon Gift Card for $49.99 (Save $20)</li><li>Cuisinart ICE-21 Ice Cream Maker from $59 (Save $51)</li><li>Polaroid Hi-Print Portable Printer for $79.99 (Save $20)</li><li>All-Clad 12-Inch D3 Stainless Steel Frying Pan for $99.99 (Save $120.01)</li><li>Eufy Security Wi-Fi Video Doorbell for $109.99 with coupon (Save $50)</li><li>Eufy BoostIQ RoboVac 11S Max for $159.99 with coupon (Save $90)</li><li>Winix 5500-2 Air Purifier for $159.99 (Save $90)</li><li>Le Creuset 3.5-Quart Enameled Cast Iron Signature Sauteuse Oven from $179.95 (Save $120.05)</li><li>Sandisk 1-Terabyte Extreme Pro Portable SSD for $184.99 (Save $125)</li><li>Apple AirPods Pro for $197 (Save $52)</li><li>Samsung The Frame QLED LS03 Series HDR Smart TV from $527.99 (Save $72 to $102)</li> </ul><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Updated daily: Here are the 10 best Amazon deals today in January 2022</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}