{"date": "2022-01-05 17:15:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3350.44, "close": 3265.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Ben Klayman</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">DETROIT, Jan 5 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>General Motors Co's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GM.N\" data-type=\"ric\" data-ric=\"GM.N\" translate=\"no\" dir=\"ltr\">GM.N</a> electric commercial vehicle business, BrightDrop, said on Wednesday it has signed a new deal to supply EVs to retail giant Walmart Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=WMT.N\" data-type=\"ric\" data-ric=\"WMT.N\" translate=\"no\" dir=\"ltr\">WMT.N</a> and expanded its supply agreement with delivery firm FedEx Corp. <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FDX.N\" data-type=\"ric\" data-ric=\"FDX.N\" translate=\"no\" dir=\"ltr\">FDX.N</a></p><p>Financial terms of the deals, announced in conjunction with the Consumer Electronics Show (CES) in Las Vegas, were not disclosed.</p><p>The commercial EV business is attractive because governments around the world are pushing companies to slash CO2 emissions, and companies like FedEx, Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and United Parcel Service Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=UPS.N\" data-type=\"ric\" data-ric=\"UPS.N\" translate=\"no\" dir=\"ltr\">UPS.N</a> have pledged to shift their large delivery fleets to EVs. In addition, EV leader Tesla Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TSLA.O\" data-type=\"ric\" data-ric=\"TSLA.O\" translate=\"no\" dir=\"ltr\">TSLA.O</a> has yet to enter that market. </p><p><span class=\"tr-strong\">Those large customers will be key to determining winners and losers as established automakers compete with startups to electrify the world's package delivery system. Amazon earlier on Wednesday said it will collaborate with Stellantis<a href=\"reuters://REALTIME/Verb=FullQuote/ric=STLA.MI\" data-type=\"ric\" data-ric=\"STLA.MI\" translate=\"no\" dir=\"ltr\">STLA.MI</a> to develop cars and trucks with Amazon software in the dashboards, and deploy electric vans made by the automaker in Amazon's delivery network. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2N02RM\" data-type=\"storyId\" data-story-id=\"nL1N2N02RM\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span><span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2TL2L1\" data-type=\"storyId\" data-story-id=\"nL4N2TL2L1\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></span></p><p>GM, which announced it was entering the EV van business last January, has estimated the U.S. market for parcel and food delivery vehicles will climb to more than $850 billion by 2025. </p><p>The Detroit automaker started delivering the EV600 van last month and will add the smaller EV410 in late 2023. It will open a plant dedicated to BrightDrop vehicles in Ingersoll, Ontario, in Canada in the fourth quarter of this year.</p><p>Under the deal with GM, Walmart will reserve 5,000 of BrightDrop's EV600 and smaller EV410 delivery vans as part of its goal to operate a zero-emission logistics fleet by 2040, the companies said. </p><p>Walmart plans to use the GM vans as part of its InHome delivery service, which it said on Wednesday it was rapidly expanding. The first BrightDrop vans will be delivered in early 2023.</p><p>Meanwhile, FedEx, which had begun taking delivery of 500 EVs from GM last year, is reserving another 2,000 over the next few years and is negotiating to take up to an additional 20,000 after that. FedEx also wants to achieve a carbon-neutral footprint for its global operations by 2040.</p><p>FedEx expects to add more than 200,000 electric medium-sized delivery vehicles by 2040, and GM's current two named models cover two-thirds of those needs, FedEx Express Regional President of the Americas Richard Smith said on a conference call. Fedex expects by 2030 that all new delivery vehicles purchased will be electric.</p><p>FedEx also has discussed GM supplying the larger vehicles with more cargo space that would meet the company's needs required by the remaining one-third, he said. GM Chief Executive Mary Barra previously said BrightDrop would offer a full-size van. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2QP22S\" data-type=\"storyId\" data-story-id=\"nL1N2QP22S\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span>        </p><p>\"BrightDrop's real, they're here now, their trucks are on the road for us in California delivering packages,\" Smith said. \"That's another reason we're leaning in to them.\"</p><p>FedEx and Walmart officials both said their deals with GM are not exclusive and they have talked with other EV makers.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Ben Klayman in Detroit<br/>Editing by Matthew Lewis and Nick Zieminski)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:benjamin.klayman@thomsonreuters.com\" data-type=\"email\" translate=\"no\">benjamin.klayman@thomsonreuters.com</a> ; 313-600-2277; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://benjamin.klayman.thomsonreuters.com@reuters.net\">benjamin.klayman.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: TECH-CES/GM-BRIGHTDROP (PIX)</p></div>"}