{"date": "2021-12-09 18:04:25+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.16, "close": 3444.24}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        In 2020, New Relic began migrating its telemetry data platform to AWS to accommodate explosive growth. At AWS re:Invent, Andrew Hartnett, Senior Director of Software Engineering at New Relic, shared how New Relic used a cell-based architecture to pave the way for long-term scalability and geographic expansion. To see the <span>Unlocking scalability with cells: New Relic's journey to AWS</span>presentation, go to <a href=\"https://reinvent.awsevents.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS re:Invent</a> to watch on-demand content. You'll learn more about the <a href=\"https://docs.newrelic.com/docs/data-apis/get-started/nrdb-horsepower-under-hood/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">New Relic database (NRDB)</a>, how New Relic uses Kafka, and how New Relic successfully made the transition to AWS.\n      </p>\n                <p>\n        As Andrew discusses in the talk, \"Our explosive growth led us to some serious scalability barriers. We found ourselves…with a monolithic single huge cluster in production running our entire business, over 100 engineering teams, 800 services, 1400 JVMs in the NRDB, all of this while ingesting 20 gigs per second. In 2018 and 2019, we had issues, some major outages.\n      </p>\n                <p>\n        \"We needed to scale up quickly. We had massive growth, coupled with increased demand for customers wanting their data led to those scalability barriers... Our Kafka was already one of the largest, if not the largest Kafka clusters in the world, and we were at the physical limitations of that Kafka cluster, so things were getting pretty hairy.\"\n      </p>\n                <p>\n        To learn more about the transition, check out the presentation. Read on to discover what Andrew shared about key lessons learned for New Relic during the transition to AWS.\n      </p>\n                <p>\n        Observability is key\n      </p>\n                <p>\n        \"It's really important to instrument every part of your system, including the system you're migrating from, the actual migration, and then the end system as well,\" Andrew advised.\n      </p>\n                <p>\n        \"All of our systems are fully instrumented. Observability hugely accelerated our ability to make large scale changes and migrations. We knew exactly where and when bottlenecks appeared, and rather than looking at low-level host metrics, our teams had visibility into the topology of our systems and could look closely at anomalies.\"\n      </p>\n                <p>\n        \"To manage and mitigate the risk of such large system change events, applications, owners, and architects need to have the ability to see their system in high cardinality and high dimensionality.\"\n      </p>\n                <p>\n        Don't plan for the happy path\n      </p>\n                <p>\n        \"Things can change. Customers can do things to you. Even the best laid plans will have surprises and discoveries. Plan for these surprises and discoveries along the way,\" Andrew said.\n      </p>\n                <p>\n        \"One key was to start small and then iterate. Stick your toe into the water first. Try with your own data. Because we are actually one of our own largest customers, sending our own data first made sense.\"\n      </p>\n                <p>\n        Continuously build new cells\n      </p>\n                <p>\n        \"We have a goal of having an average cell life of 90 days,\" Andrew shared. \"By doing that, you get the ability to make your changes with new cells instead of having to do it with cells that are dealing with customer load. AWS provides all the APIs and managed services we need to continuously build and decomm cells. So we do it. As a result, our platform reliability has improved significantly, and we've reclaimed engineering capacity that was previously spent on infrastructure.\"\n      </p>\n                <p>\n        Make sure you communicate\n      </p>\n                <p>\n        \"Over communicating becomes very important. Don't keep your customers in the dark,\" Andrew recommended.\n      </p>\n                <p>\n        \"It's important to let them know the reasons why we're doing all of this. We may experience some bumps, but this is going to get better.\"\n      </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://newrelic.com/blog/nerd-life/new-relic-reinvent-aws\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>New Relic Inc.</strong> published this content on <strong>09 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>09 December 2021 18:04:25 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - New Relic Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: New-Relic-Inc.</p></div>"}