{"date": "2022-01-19 11:15:41+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Tim Cocks</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">JOHANNESBURG, Jan 19 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Groups representing the descendants of South Africa's earliest inhabitants, the Khoi and San, went to court on Wednesday to try to halt construction of Amazon's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> new 70,000-square metre Africa headquarters on land they regard as sacred.</p><p>The culturally-intertwined San and Khoi were the first inhabitants of South Africa. The former lived as hunter gatherers for tens of thousands of years, and the latter joined them as pastoralists more than 2,000 years ago. </p><p>Some Khoi and San welcome the prospect of jobs from the 4 billion rand ($259.03 million) <a href=\"https://www.reuters.com/world/africa/heritage-dispute-engulfs-site-chosen-amazons-new-african-hq-2021-06-03\" data-type=\"url\" class=\"tr-link\" translate=\"no\">development</a> near Cape Town, including a hotel, retail offices and homes, and with Amazon -- which employs thousands of people in data hubs in the city -- as its main tenant.</p><p>But the project has faced a backlash from Khoi and San community leaders, who say they represent the majority of their people.</p><p>    <span class=\"tr-strong\">The legal action is against the project developer Liesbeek Leisure Properties Trust, the City of Cape Town and Western Cape Province and a group of Khoi and San who support the development. The court case is due to last three days.</span></p><p>The site lies at the confluence of two rivers, the Black River and the Liesbeek, of paramount spiritual significance to both groups. It will also block their view to the equally sacred Lion's Head mountain, said Tauriq Jenkins of the Goringhaicona Khoena Council, a Khoi traditional group opposed to the project.</p><p>\"It is a deeply disturbing thing,\" he said. \"There is nothing sacred left in this world for indigenous communities.\"</p><p>Yet with a third of South Africans unemployed, authorities are keen to encourage foreign investment. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nJ8N2I301W\" data-type=\"storyId\" data-story-id=\"nJ8N2I301W\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>An Amazon spokesperson declined to comment.</p><p>James Tannanberger, spokesperson for the developer Liesbeek Leisure Properties Trust (LLTP), said in a statement on Wednesday that the majority of South Africa's first people supported the development.</p><p>\"The redevelopment will bring enormous benefit to the people of Cape Town,\" Tannanberger said. \"It is unfortunate that a small group of individuals appear hell bent on blocking (it).\"</p><p>The Khoi and San were displaced from much of South Africa, first by Black settlers from central Africa, then much later by white colonial invaders from Europe, whom they fought to defend their remaining enclaves. </p><p>In one such battle on the Cape half a millennium ago, the Khoi and San defeated a Portuguese raiding expedition on the spot currently under dispute. The site remains a symbol of resistance.</p><p>\"For us, this a ground zero precinct, the epicentre of ... resistance to colonialism,\" Jenkins said.</p><p>($1 = 15.4424 rand)</p><p><br/></p><p class=\"tr-signoff\"> (Additional reporting by Jeffrey Dastin in San Francisco. Editing by Jane Merriman)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:tim.cocks@thomsonreuters.com\" data-type=\"email\" translate=\"no\">tim.cocks@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SAFRICA-AMAZON/ (PIX)</p></div>"}