{"date": "2021-04-01 07:43:06+00:00", "ticker": "AVV", "mrkt_info": {"open": 3360.0, "close": 3504.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Dubai, UAE:</strong> AVEVA, a global leader in industrial software, driving digital transformation for industrial organizations managing complex operational processes, reinforced its continued commitment to drive Sustainability through its Action for Good program through which 1% of its after-tax profits go to assisting global communities. As part of the program, employees at AVEVA  have committed to support three charities: WaterAid, CALM and Save The Children with initiatives that not only align to its Sustainability program but reflect the need to step up support for vulnerable populations disproportionately at risk from the negative impacts of the pandemic.</p>\n<p><strong>Transforming Millions of Lives with Clean Water</strong></p>\n<p>Through its products and innovation, AVEVA empowers municipalities to maximize operating efficiency in water and wastewater facilities around the world. Beyond the positive impact it can have through its products, the company is committed to building a network of collaborators that can help us to reach those most in need on critical issues like access to clean water, one our areas of focus under the United Nations Sustainability Development Goals framework.</p>\n<p>WaterAid, the international non-governmental organization that focuses on water, sanitation, and hygiene globally, was selected by AVEVA employees to receive just over USD $100,000 equating to providing clean water for 5,000 people. WaterAid aims to use its donations to provide running water and sanitation to recipients in 28 countries, including Rwanda, Malawi, Niger, and Colombia. Hear more about how AVEVA’s support helps WaterAid here: <a href=\"https://youtu.be/VXp9SJyMXmY\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://youtu.be/VXp9SJyMXmY</a> </p>\n<p><strong>Walking for Wellbeing</strong></p>\n<p>Improving employee wellbeing, with a focus on mental health, is another long-standing priority area for AVEVA’s business. We recognize mental health issues have taken on increasing significance during the pandemic. In October 2020, AVEVA employees came together to raise money while simultaneously spending time outdoors and in turn improving their own mental wellbeing.</p>\n<p>Over 120 AVEVA employees across Europe, Middle East and Africa (EMEA) joined the Lost Hours Walk, organized by CALM (the Campaign Against Living Miserably), to increase awareness of suicide prevention. The organized walks raised enough money to fund 2,400 potentially life-saving calls.<strong> </strong></p>\n<p><strong>Improving Education for The Next Generation</strong></p>\n<p>AVEVA’s employees have also chosen to  donate USD $130,000 to Save The Children which helps to improve the lives of children through better education, healthcare, and economic opportunities. Save The Children works in over 100 countries and just last year alone helped 1.7 million children and supported 88 health facilities and 23 hospitals.</p>\n<p>One of the key beneficiaries of AVEVA’s Action for Good program, Save the Children, spoke of its heartfelt thanks for this critical support. Gemma Sherrington, Executive Director of Fundraising and Marketing, commented: “I would like to say a huge thank you to all the staff at AVEVA! We are incredibly grateful to everyone who voted for Save the Children to receive this amazing donation. The generous support of colleagues at AVEVA will allow our colleagues in the UK, and around the world, to continue to help combat Covid-19 as well as continuing our other vital work.”</p>\n<p><strong>Employee-driven Initiatives inspired by the desire to support underserved communities</strong></p>\n<p>Lisa Johnston, Chief Sustainability Officer, AVEVA commented, “The pandemic has exacerbated the need for humanity to step forward and rally around people and groups or communities who are underserved in a multitude of ways. Our employee wellbeing during this time has been fundamental and so we encourage our colleagues to commit their spare time to supporting both humanitarian and environmental initiatives, in line with our global Sustainability program.”</p>\n<p>AVEVA has also recently been recognized by the Corporate Engagement Awards (CEA), which presented it with a bronze medal in the category Best CSR Activity or Program to Support or Develop a Corporate Reputation and Highly Commended in the Best Engagement of an Internal Audience in a CSR ProgramThis news follows AVEVA’s recognition in the FTSE4Good for the fourth year in a row, and its commitment to join the United Nations Global Compact as a participant member, as announced in January 2021. </p>\n<p>For updates on AVEVA’s charitable initiatives, view the Action for Good webpage.</p>\n<p><strong>About AVEVA</strong></p>\n<p>AVEVA, a global leader in industrial software, drives digital transformation for industrial organizations managing complex operational processes. Through Performance Intelligence, AVEVA connects the power of information and artificial intelligence (AI) with human insight, to enable faster and more accurate decision making, helping industries to boost operational delivery and sustainabilityOur cloud-enabled data platform, combined with software that spans design, engineering and operations, asset performance, monitoring, and control solutions, delivers proven business value and outcomes to over 20,000 customers worldwide, supported by the largest industrial software ecosystem, including 5,500 partners and 5,700 certified developers. AVEVA is headquartered in Cambridge, UK, with over 6,000 employees at 90 locations in more than 40 countries. For more details visit: <a href=\"http://www.aveva.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.aveva.com</a>. </p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}