{"date": "2021-11-02 17:41:38.709000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>India</p></div><div class=\"tr-npp-lead\"><p>India, Oct. 28 -- It is that time of the year when there is a slight nip in the air but it is still very pleasant. Sweatshirts and light jackets are what are best-suited for the season.</p><p>Amazon is offering great discounts on many products. Some products are a hot favourite among the users. Here's a list of the most-loved men's winter wear collection.</p></div><div class=\"tr-npp-body\"><p>1) Allen Solly Men's Sweatshirt</p><p>These sweatshirts come in 12 different colour combinations and are available in five different sizes. The price ranges from Rs.649.00 - Rs.1,298.00, depending on the buyer's selection.</p><p>This regular fit best-seller is made of 100% cotton fabric. It has long sleeves with a round neck and is an ideal wear for mild winter.</p><p>Price: Rs.649.00 - Rs.1,298.00</p><p>2) WearIndia Men's &amp; Women's Cotton Hooded Hoodies</p><p>This cotton hoodie jacket can be worn by both men and women. It has been bio-washed and pre-shrunk for minimum shrinkage. It comes in two colours - white and yellow.</p><p>Price: Rs.638.00 - Rs.749.00</p><p>3) Amazon Brand - Symbol Men Hooded Sweatshirt</p><p>This sleeveless hooded sweatshirt for men comes in 65% polyester and 35% cotton combination. It has a front open zipper with a solid pattern. It comes in eight different colours and combinations. Its price range varies from Rs.579.00 - Rs.644.00 depending on colour and size.</p><p>Price: Rs.579.00 - Rs.644.00</p><p>4) THE ARCHER Solid Men Hooded Neck with Mask T-Shirt</p><p>This regular fit long sleeve t-shirt comes in four different colours. With its unique design, it gives protection to the neck. It can also be rolled up and used as a mask. Its design is such that it is suitable for both party wear as well for the gym. Its price too varies depending on the colour and size.</p><p>Price: Rs.330.00 - Rs.338.00</p><p>5) Allen Solly Men's Jacket</p><p>This Allen Solly navy jacket is a no fuss one and has a classic fit. It comes in a regular fit and can be machine washed.</p><p>MRP: Rs.2,799.00Deal of the Day: Rs.1,409.00</p><p>At Hindustan Times, we help you stay up-to-date with latest trends and products. Hindustan Times has affiliate partnership, so we may get a part of the revenue when you make a purchase. Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}