{"date": "2021-11-04 21:22:15.263000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3384.0, "close": 3518.99}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MOTORSPORT GAMES INC (\"MSGM-Q\")\n- Third Quarter 2021 Financial Results\n\n   Motorsport Games Inc. (\"Motorsport Games\" or the \"Company\") today\nreported financial results for the third quarter ended September 30, 2021.\nThe Company also posted a Third Quarter 2021 review video and Q3 Earnings\nSlides highlighting key milestones that occurred in the period, which are\naccessible on the investor relations section of its website.\n\n   Dmitry Kozko, Chief Executive Officer of Motorsport Games, commented,\n\"We are thrilled to have released our first, built from the ground up,\nNASCAR title, NASCAR 21: Ignition on October 28, 2021. This is a\nsignificant achievement for us as we all are incredibly excited to start to\nshowcase our passion and capabilities. We are also delighted to announce\nthat we are continuing platform expansion by bringing the first-ever NASCAR\ntitle to Nintendo Switch. NASCAR Heat Ultimate Edition+ will bring the joy\nof NASCAR racing to the NASCAR Switch community comprised of fans from\naround the world. We started accepting pre-orders on October 15, 2021, with\nan official release date of November 19, 2021. With these two titles\nlaunching, we continue to believe we are well-positioned to reach our\noutlook for the full year.\"\n\n   Kozko also commented, \"On the esports front, we officially launched the\nLe Mans Virtual Series in the third quarter of 2021. The first two rounds\nhave been completed and we are anticipating a spectacular grand finale\nevent for the 24 Hours of Le Mans virtual as a live, televised event from\nthe 2022 Autosport International motorsport show on January 15-16, 2022.\"\n\n   Third Quarter 2021 and Subsequent Business Update\n\n   *  INDYCAR License Agreement. The Company has entered into a gaming and\nesports license partnership with INDYCAR. The esports and gaming licenses\nare long-term agreements for the development of the official games and\nesports of the INDYCAR Series. The debut title is expected to launch in\n2023 on Xbox and PlayStation consoles as well as for PCs.\n\n   *  2021 Le Mans Virtual Series Esports Event. A product of the joint\nventure between Motorsport Games and the Automobile Club de l'Ouest, the\ncreators and organizers of the world-famous 24 Hours of Le Mans and\npromoter of the FIA World Endurance Championship (FIA WEC), the Le Mans\nVirtual Series returns to competition with a revised format and portfolio\nof prestigious partners. The event will be held on January 15-16, 2022 at\nAutosport International and includes a $250,000 prize pool, as well as an\nexciting live grand finale that will be televised for all fans.\n\n   *  NASCAR 21: Ignition. The Company officially launched its new NASCAR\nfranchise racing game, NASCAR 21: Ignition, on October 28, 2021, on\nPlayStation, Xbox and PC.\n\n   *  NASCAR Game for Nintendo Switch. The Company announced the upcoming\nlaunch of NASCAR Heat Ultimate Edition+ on Nintendo Switch, the first-ever\nNASCAR title to come to Nintendo Switch. The launch date is targeted for\nNovember 19, 2021.\n\n   *  Board of Directors Addition. The Company added 30-year gaming,\nentertainment and consumer industry leader Peter Moore to its board of\ndirectors. Mr. Moore's involvement with Motorsport Games will give him the\nopportunity to leverage his career experiences in sports and gaming with\nhis personal passions in motorsports and cars.\n\n   ?Financial Results for the Three and Nine Months Ended September 30,\n2021\n\n   CONDENSED CONSOLIDATED STATEMENT OF OPERATIONS\n(Unaudited)\n\n//st\n\n       Three Months Ended September 30,    Nine Months Ended September 30,\n\n       2021     2020       2021      2020\n\nRevenues   $   2,138,466    $  8,988,197   $   6,851,525     $  16,111,581\n\nCost of revenues   949,139     2,920,747       2,637,250    5,261,483\n\nGross profit       1,189,327   6,067,450       4,214,275    10,850,098\n\nOperating\nexpenses:\n\nSales and      1,348,773   961,450     3,077,213    2,321,635\nmarketing\n\nDevelopment    3,015,233   1,300,314       6,083,773    3,438,461\n\nGeneral and    3,130,944   936,818     22,612,162   2,227,373\nadministrative\n\nDepreciation       81,874      38,016      179,097      50,083\nand amortization\nTotal operating    7,576,824   3,236,598       31,952,245   8,037,552\nexpenses\n\n(Loss) income      (6,387,497)  2,830,852       (27,737,970)  2,812,546\nfrom operations\n\nInterest expense   (160,310)  (230,965)   (311,748)  (448,325)\n\nGain (loss)    -       (40,530)   1,370,837    (69,764)\nattributable to\nequity method\ninvestment\n\nOther (loss)       (110,822)  46,337      (26,115)  79,195\nincome, net\n\nNet (loss)     (6,658,629)  2,605,694       (26,704,996)  2,373,652\nincome\n\nLess: Net      (99,114)  1,412,329       (553,413)  1,498,233\n(loss) income\nattributable to\nnon-controlling\ninterest\n\nNet (loss)     $   (6,559,515)   $  1,193,365   $   (26,151,583)   $\n875,419\nincome\nattributable to\nMotorsport\nGames Inc.\n\nNet loss\nattributable to\nClass A common\nstock per share:\n\nBasic and  $   (0.56)      $   (2.32)\ndiluted\n\nWeighted-average\nshares of Class\nA common stock\noutstanding:\n\nBasic and      11,635,897          11,285,757\ndiluted\n\n//et\n\n   For the three months ended September 30, 2021, revenues from the Gaming\nsegment decreased $6.7 million, or 77%, to $2.0 million from $8.8 million\nfor the three months ended September 30, 2020. The decrease in the Gaming\nsegment revenues compared to the 2020 period was primarily due to the\nlaunch of a new game release in Q3-2020, which did not recur in Q3-2021 and\nthe resulting lower sales of console and PC games. The NASCAR Heat 5 game\nwas released in July 2020 and the majority of sales from a new release\noccur closest to the launch date. As an event subsequent to Q3-2021, the\nCompany released its next generation NASCAR console/PC game, NASCAR 21:\nIgnition, on October 28, 2021, and also anticipates releasing NASCAR Heat\nUltimate Edition+ on Nintendo Switch in the fourth quarter of 2021.\nRevenues from the sale of both these releases will be recorded as units are\nsold beginning in Q4-2021.\n\n   Esports segment revenues were $0.1 million and $0.2 million for the\nthree months ended September 30, 2021 and 2020, respectively, a decrease of\n$0.1 million, or 51%, with the decline attributable to higher sponsorship\nrevenues received during Q3-2020.\n\n   Net loss attributable to Motorsport Games Inc. was $6.6 million, or\n$0.56 per share of Class A common stock, for Q3-2021, as compared to net\nincome attributable to Motorsport Games Inc. of $1.2 million for Q3-2020.\nThe decrease in profitability was primarily due to lower revenues for\nQ3-2021 as a result of the 2021 new game release occurring after Q3-2021 as\nwell as higher operating expenses due to an increase in the number of games\nbeing developed.\n\n   Net (loss) income was ($6.7) million and $2.6 million for the three\nmonths ended September 30, 2021 and 2020, respectively. Adjusted EBITDA\nloss(1) was $5.5 million for Q3-2021, as compared to an Adjusted EBITDA\ngain of $3.0 million for Q3-2020. The following table provides a\nreconciliation from net (loss) income to EBITDA and Adjusted EBITDA for\nQ3-2021 and Q3-2020:\n\n//st\n\n       Three Months Ended    Three Months Ended\n       September 30, 2021    September 30, 2020\n\nGAAP: Net (loss)   $    (6,658,629)   $   2,605,694\nincome\n\nGAAP: Interest      160,310      230,965\nexpense, net\n\nGAAP: Depreciation      557,924      154,397\nand Amortization\n\nEBITDA      (5,940,395)   2,991,056\n\nIPO-related expenses    -        -\nAcquisition-related     193,099      -\nexpenses\n\nGain attributable       -        -\nto equity method\ninvestment\n\nStock-based     292,173      -\ncompensation\n\nAdjusted EBITDA    $    (5,455,123)   $   2,991,056\n\n//et\n\n   Jon New, Chief Financial Officer of Motorsport Games, commented \"We\nexceeded analysts' consensus expectations on revenues and gross margin for\nQ3-2021, while our Q3-2021 Adjusted EBITDA loss was higher than expected,\nprimarily due to higher development expenses from newly-added games to our\nproduct pipeline and, to a lesser extent, higher marketing costs. The\ncomparison of results for the third quarter and first nine months of 2021\nwere significantly affected by the timing of the NASCAR game releases, as\ndiscussed above.\"\n\n   Nine Months Ended September 30, 2021 compared to Nine Months Ended\nSeptember 30, 2020\n\n   Revenues were $6.9 million and $16.1 million for the nine months ended\nSeptember 30, 2021 and 2020, respectively. For the nine months ended\nSeptember 30, 2021, revenues from the Gaming segment decreased by $9.4\nmillion, or 57%, to $6.7 million from $15.8 million for the nine months\nended September 30, 2020. The decrease in revenues was due primarily to the\ntiming of product releases as discussed above.\n\n   For the nine months ended September 30, 2021, revenues from the esports\nsegment consisted of $0.12 million, which was comprised primarily of\nsponsorship and event revenues from Le Mans esports events. Esports segment\nrevenue was $0.29 million for the nine months ended September 30, 2020. The\ndifference of $0.17 million primarily relates to sponsorship income earned\nfrom the Formula E esports events during the nine months ended September\n30, 2020.\n\n   Net loss attributable to Motorsport Games Inc. was $26.2 million, or\n$2.32 per share of Class A common stock, for the nine months ended\nSeptember 30, 2021, as compared to net income attributable to Motorsport\nGames Inc. of $0.9 million for the nine months ended September 30, 2020.\n\n   Net (loss) income was ($26.7) million and $2.4 million for the nine\nmonths ended September 30, 2021 and 2020, respectively. The 2021 net loss\nof $26.7 million included $12.4 million of IPO-related expenses including\nnon-cash, stock-based compensation of $9.5 million, non-cash depreciation\nand amortization of $1.2 million, partially offset by a $1.4 million\nnon-cash gain on equity method investment.\n\n   Adjusted EBITDA loss(1) was $12.0 million for the nine months ended\nSeptember 30, 2021, as compared to an Adjusted EBITDA gain of $3.3 million\nfor the nine months ended September 30, 2020. The $15.3 million unfavorable\nvariance includes $9.5 million of non-cash, stock-based compensation, $2.9\nmillion of IPO-related expenses, $0.8 million in increased depreciation and\namortization and $2.1 million of acquisition related expenses, partially\noffset by a $1.4 million non-cash gain on equity method investment. The\nfollowing table provides a reconciliation from net (loss) income to EBITDA\nand Adjusted EBITDA for the nine months ended September 30, 2021 and 2020:\n\n//st\n\n       Nine Months Ended     Nine Months Ended\n       September 30, 2021    September 30, 2020\n\nGAAP: Net (loss)   $   (26,704,996)   $   2,373,652\nincome\n\nGAAP: Interest     311,748       448,325\nexpense, net\n\nGAAP: Depreciation     1,217,234     457,729\nand Amortization\n\nEBITDA         (25,176,014)   3,279,706\n\nIPO-related expenses   2,947,192     -\n\nAcquisition-related    2,123,665     -\nexpenses\n\nGain attributable      (1,370,837)   -\nto equity method\ninvestment\n\nStock-based        9,485,362     -\ncompensation\n\nAdjusted EBITDA    $   (11,990,633)   $   3,279,706\n\n//et\n\n   Business Outlook as of November 4, 2021\n\n   The Company expects full-year 2021 revenues of approximately $20.5\nmillion and updated Adjusted EBITDA loss of approximately $12.0 million. We\nare pleased to have gained the INDYCAR license during the third quarter of\n2021 and this will continue to increase our development costs as we work\ntoward a 2023 release of the new INDYCAR game and our other planned product\nreleases.\n\n   The Company expects to meet or exceed these numbers based on its current\nbusiness, which may be impacted by, among other things, difficulties,\ndelays in or unanticipated events that may impact the timing and scope of\nnew or planned products or offerings, less than expected consumer\nacceptance of our products, less than expected effectiveness of our\nadvertising and marketing plans, a slower than anticipated economic\nrecovery as a result of the ongoing and prolonged COVID-19 pandemic and the\nother factors described in the Company's filings with the SEC, including\nits Annual Report on Form 10-K for the fiscal year ended December 31, 2020,\nits Quarterly Reports on Form 10-Q filed with the SEC during 2021, as well\nas in its subsequent filings with the SEC. Other assumptions on which this\nguidance is based include our current expectations as to external factors\nthat our outside of our control, such as, without limitation, foreign\nexchange translation, tax policy and rates, interest rates, government\nstimulus spending, employment rates and consumer confidence.\n\n   Use of Non-GAAP Financial Measures\n\n   EBITDA and Adjusted EBITDA (the \"Non-GAAP Measures\") are measures that\nare not defined by generally accepted accounting principles in the United\nStates of America (\"U.S. GAAP\"). See the reconciliations of the Non-GAAP\nMeasures to their most directly comparable U.S. GAAP measures in the\nfinancial tables above.\n\n   EBITDA, a measure used by management to assess our operating\nperformance, is defined as net (loss) income plus interest (income)\nexpense, depreciation and amortization, less income tax benefit. Adjusted\nEBITDA is defined as EBITDA adjusted to exclude: (i) IPO-related expenses;\n(ii) acquisition related expenses; (iii) gain attributable to equity method\ninvestment resulting from the acquisition of additional equity interest in\nthe Company's Le Mans joint venture; (iv) stock-based compensation\nexpenses; and (v) other charges or gains resulting from non-recurring\nevents, if any.\n\n   We use the Non-GAAP Measures to manage our business and evaluate our\nfinancial performance, as they have been adjusted for items that affect\ncomparability between periods that we believe are not representative of our\ncore ongoing operating business. Additionally, management believes that the\nNon-GAAP Measures are useful to investors because they enhance investors'\nunderstanding and assessment of our performance and facilitate comparisons\nto prior periods and our competitors' results.\n\n   Each of the Non-GAAP Measures is not a recognized term under U.S. GAAP\nand does not purport to be an alternative to revenue, income/loss from\noperations, net (loss) income, or cash flows from operations or as a\nmeasure of liquidity or any other performance measure derived in accordance\nwith U.S. GAAP. Additionally, each of the Non-GAAP Measures is not intended\nto be a measure of free cash flows available for management's discretionary\nuse, as it does not consider certain cash requirements, such as interest\npayments, tax payments and debt service requirements. The Non-GAAP Measures\nhave limitations as analytical tools, and investors should not consider any\nof such measures in isolation or as substitutes for our results as reported\nunder U.S. GAAP. Management compensates for the limitations of using\nnon-GAAP financial measures by using them to supplement U.S. GAAP results\nto provide a more complete understanding of the factors and trends\naffecting the business that would be presented by using only measures in\naccordance with U.S. GAAP. Because not all companies use identical\ncalculations, our measures may not be comparable to other similarly titled\nmeasures of other companies. Reconciliations of the Non-GAAP Measures to\ntheir respective most directly comparable financial measures calculated and\npresented in accordance with U.S. GAAP are presented in the tables within\nthis release.\n\n   We do not provide a reconciliation for Adjusted EBITDA on a\nforward-looking basis because we are unable to provide a meaningful or\naccurate calculation or estimation of reconciling items and the information\nis not available without unreasonable effort. This is due to the inherent\ndifficulty of forecasting the timing and amount of certain items, such as,\nbut not limited to, certain acquisition related expenses and stock-based\ncompensation expenses. Each of such adjustments has not yet occurred, are\nout of our control and/or cannot be reasonably predicted. For the same\nreasons, we are unable to address the probable significance of the\nunavailable information.\n\n   Conference Call and Webcast Details\n\n   The Company will host a conference call and webcast at 5:00 p.m. ET\ntoday to discuss the results. The live conference call can be accessed by\ndialing (877) 344-8082 from the U.S. or (213) 992-4618. Alternatively,\nparticipants may access the live webcast on the Motorsport Games Investor\nRelations website at <a href=\"https://ir.motorsportgames.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://ir.motorsportgames.com</a> under \"Events.\"\n\n   About Motorsport Games\n\n   Motorsport Games, a Motorsport Network company, combines innovative and\nengaging video games with exciting esports competitions and content for\nracing fans and gamers around the globe. The Company is the officially\nlicensed video game developer and publisher for iconic motorsport racing\nseries, including NASCAR, INDYCAR, 24 Hours of Le Mans, KartKraft, rFactor\n2 and the British Touring Car Championship (\"BTCC\"), across PC,\nPlayStation, Xbox, the Nintendo Switch and mobile. Motorsport Games is an\naward-winning esports partner of choice for 24 Hours of Le Mans, Formula E,\nBTCC, the FIA World Rallycross Championship and the eNASCAR Heat Pro\nLeague, among others.\n\n   For more information about Motorsport Games visit:\nwww.motorsportgames.com.\n\n   Forward-Looking Statements\n\n   Certain statements in this press release, the related conference call\nand webcast which are not historical facts are forward-looking statements\nwithin the meaning of Section 27A of the Securities Act of 1933, as\namended, and Section 21E of the Securities Exchange Act of 1934, as\namended, and are provided pursuant to the safe harbor provisions of the\nPrivate Securities Litigation Reform Act of 1995. Any statements in this\npress release, the related conference call and webcast that are not\nstatements of historical fact may be deemed forward-looking statements.\nWords such as \"continue,\" \"will,\" \"may,\" \"could,\" \"should,\" \"expect,\"\n\"expected,\" \"plans,\" \"intend,\" \"anticipate,\" \"believe,\" \"estimate,\"\n\"predict,\" \"potential,\" and similar expressions are intended to identify\nsuch forward-looking statements. These forward-looking statements include,\nbut are not limited to, statements concerning: (i) Motorsport Games' future\nbusiness, future results of operations and/or financial condition,\nincluding without limitation, as to the Company's expectations that its\nfull-year 2021 net revenues will be approximately $20.5 million and\nAdjusted EBITDA will be approximately a loss of $12.0 million; (ii) the\nexpected future impact of new or planned products or offerings and the\ntiming of launching such products and offerings, including, without\nlimitation, the Company's target release of NASCAR Heat Ultimate Edition+\nfor Nintendo Switch on November 19, 2021, and the Company's expectation\nthat the INDYCAR Series debut title will launch in 2023 on Xbox and\nPlayStation consoles as well as for PCs and that the INDYCAR Series esports\nevents could kick off as early as this year; (iii) the Company's\nexpectations relating to the grand finale event for the 24 Hours of Le Mans\nvirtual to be held on January 15-16, 2022 at Autosport International; (iv)\nthe expected future impact of completed and pending acquisitions; and (v)\nthe expected future impact of implementing management strategies and the\nimpact of other industry trends. All forward-looking statements involve\nsignificant risks and uncertainties that could cause actual results to\ndiffer materially from those expressed or implied in the forward-looking\nstatements, many of which are generally outside the control of Motorsport\nGames and are difficult to predict. Examples of such risks and\nuncertainties include, but are not limited to: (i) difficulties, delays or\nless than expected results in achieving the Company's growth plans,\nobjectives and expectations, such as due to a slower than anticipated\neconomic recovery and/or the Company's inability, in whole or in part, to\ncontinue to execute its business strategies and plans, such as due to less\nthan anticipated customer acceptance of the Company's new game titles, the\nCompany's experiencing difficulties or the inability to launch its games as\nplanned, less than anticipated performance of the games impacting customer\nacceptance and sales and/or greater than anticipated costs and expenses to\ndevelop and launch its games, including, without limitation, higher than\nexpected labor costs; (ii) difficulties, delays in or unanticipated events\nthat may impact the timing and scope of new product launches, such as due\nto the ongoing and prolonged COVID-19 pandemic; (iii) less than expected\nconsumer acceptance of the Company's grand finale event for the 24 Hours of\nLe Mans virtual; and/or (iv) less than expected benefits from implementing\nthe Company's management strategies and/or adverse economic events that\nnegatively impact industry trends, such as significant changes in the labor\nmarkets, an extended inflationary environment, tax increases impacting\nconsumer discretionary spending and or quantitative easing that results in\nhigher interest rates that negatively impact consumers' discretionary\nspending. Factors other than those referred to above could also cause\nMotorsport Games' results to differ materially from expected results.\nAdditional examples of such risks and uncertainties include, but are not\nlimited to: (i) delays and higher than anticipated expenses related to the\nongoing and prolonged COVID-19 pandemic; (ii) Motorsport Games' ability (or\ninability) to maintain existing, and to secure additional, licenses and\nother agreements with various racing series; (iii) Motorsport Games'\nability to successfully manage and integrate any joint ventures,\nacquisitions of businesses, solutions or technologies; (iv) unanticipated\noperating costs, transaction costs and actual or contingent liabilities;\n(v) the ability to attract and retain qualified employees and key\npersonnel; (vi) adverse effects of increased competition; (vii) changes in\nconsumer behavior, including as a result of general economic factors, such\nas increased inflation; (viii) Motorsport Games' ability to protect its\nintellectual property; and/or (ix) local, industry and general business and\neconomic conditions. Additional factors that could cause actual results to\ndiffer materially from those expressed or implied in the forward-looking\nstatements can be found in Motorsport Games' filings with the SEC,\nincluding its Annual Report on Form 10-K for the fiscal year ended December\n31, 2020, its Quarterly Reports on Form 10-Q filed with the SEC during\n2021, as well as in its subsequent filings with the SEC. Motorsport Games\nanticipates that subsequent events and developments may cause its plans,\nintentions and expectations to change. Motorsport Games assumes no\nobligation, and it specifically disclaims any intention or obligation, to\nupdate any forward-looking statements, whether as a result of new\ninformation, future events or otherwise, except as expressly required by\nlaw. Forward-looking statements speak only as of the date they are made and\nshould not be relied upon as representing Motorsport Games' plans and\nexpectations as of any subsequent date.\n\n   Website and Social Media Disclosure\n\n   Investors and others should note that we announce material financial\ninformation to our investors using our investor relations website\n(ir.motorsportgames.com), SEC filings, press releases, public conference\ncalls and webcasts. We use these channels, as well as social media and\nblogs, to communicate with our investors and the public about our company\nand our products. It is possible that the information we post on our\nwebsites, social media and blogs could be deemed to be material\ninformation. Therefore, we encourage investors, the media and others\ninterested in our company to review the information we post on the\nwebsites, social media channels and blogs, including the following (which\nlist we will update from time to time on our investor relations website):\n\n//st\n\n   Websites      Social Media\n\n   motorsportgames.com   Twitter: @msportgames &amp; @traxiongg\n\n   traxion.gg    Instagram: msportgames &amp; traxiongg\n\n   motorsport.com    Facebook: Motorsport Games &amp; traxiongg\n\n         LinkedIn: Motorsport Games\n\n         Twitch: traxiongg\n\n         Reddit: traxiongg\n\n//et\n\n   The contents of these websites and social media channels are not part\nof, nor will they be incorporated by reference into, this press release.\n\n Contact Information:\n\nContact:\nInvestors:\nAshley DeSimone\nAshley.DeSimone@icrinc.com\n\n   Media:\nASTRSK PR\nmotorsportgames@astrskpr.com\n\n   Regarding the Company's use of Adjusted EBITDA, which is a Non-GAAP\nfinancial measure, please see the note, \"Use of Non-GAAP Financial\nMeasures.\"\n\nTel   : 305-507-8799    MOTORSPORT GAMES INC\nEmail : investors@motorsportgames.com\nWWW   : <a href=\"https://www.motorsportgames.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.motorsportgames.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2130700896.MNPRE2130703930-14214320211104</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}