{"date": "2021-11-11 19:44:05.406000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3482.05, "close": 3525.15}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon has opened a fulfilment centre (FC) in Alabama and shared plans to introduce three more operations facilities in the state.</p><p>The retailer's Non-Sortable Fulfilment Centre covers an area of almost one million square feet in Huntsville.It is the first of two facilities that the company plans to set up in the area.Employees will use the FC to pick, pack and ship larger items such as bulk paper goods, outdoor equipment and rugs.They will use advanced technologies and energy-efficient and power industrialised truck (PIT) equipment.In addition to this FC, Amazon plans to open a delivery station in Birmingham, which will employ around 150 people.It will also open an 'extra-large' FC in Limestone County, its third facility in Alabama.The XL Non-Sortable facility is scheduled to open next year and will be used for receiving, storing and packaging heavy or bulky items such as home appliances.The facility will generate more than 250 full-time jobs and cover almost one million square feet.Amazon also plans to open the Montgomery Receive Centre, an inbound cross-dock facility, next year.The 650,000ft2 facility will provide full-time jobs for more than 500 people.Amazon public policy vice-president Brian Huseman said: \"We are proud to continue our investment in Alabama with thousands of good jobs and new, state-of-the-art operations facilities.\"Our success would not be possible without our great employees and we are grateful for the enthusiasm and strong state and local support we have received since first launching operations last year.\"We look forward to continued investment as we innovate and grow to better serve our customers across the state.\"Last month, Amazon opened a 4-star retail outlet at the Bluewater shopping mall near Dartford, UK, its first outside the US.The retailer's 4-star store concept only sells products that are rated four stars or more, are top sellers or are new and trending on Amazon's website.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}