{"date": "2022-02-17 12:54:13.346000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3130.21, "close": 3093.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p></p><pre> \n\n \n\nNEW YORK (AP) ? Visa Inc. and Amazon.com Inc. announced an agreement\nThursday that allows customers to use Visa cards on Amazon sites worldwide\nwithout additional fees.\n\nThe companies also agreed to collaborate on product and technology initiatives\nfor \"innovative payment experiences,\" Visa said in an email.\n\nCredit card fees have been a growing source of tension between Amazon and\nVisa. Last year, Amazon started charging customers in Australia and Singapore\nwho use Visa credit cards a 0.5% surcharge.\n\nUnder the agreement, Amazon's amazon.co.uk site in Britain will no longer turn\noff Visa credit cards. Customers in Australia and Singapore will no longer pay\nthe surcharge for using Visa.\n\nLast month, Amazon's British website backed away from plans to stop accepting\nVisa credit cards issued in the United Kingdom, saying the two sides were\ntalking.\n\nAmazon had announced the move in November, blaming \"the high fees Visa charges\nfor processing credit card transactions.\"\n\nAny credit card transaction involves various fees, such as an \"interchange\nfee\" that the shopper's bank pays to the retailer's bank and other costs like\nservice and technology charges. It wasn't clear which fee was the focus of the\nU.K. dispute.\n \n \n    Copyright ? 2022 The Associated Press. All rights reserved. \nThis material may not be published, broadcast, rewritten or \nredistributed without permission.Copyright ? 2022 The \nAssociated Press. All rights reserved. This material may not \nbe published, broadcast, rewritten or redistributed without \npermission. \n\n      \n      \n    </pre>\n\n<p></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) 2022 Refinitiv. All rights reserved.</p></div>"}