{"date": "2022-02-07 12:17:16.845000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">Increase Harmony in Month of Love for Productivity</p>\n<p>SALT LAKE CITY, Feb. 7, 2022</p>\n<p>\n<span>Bestselling Author, CEO Kevin Guest Shares Insights from Global Leadership</span>\n</p>\n<p>\n<span>SALT LAKE CITY</span> , <span>Feb. 7, 2022</span> /CNW/ -- Teams working together with more love and harmony increases productivity and happiness, according to one author and global CEO.</p>\n<p>\n\n</p>\n<p>\"Because February is the month we celebrate love, it's the perfect time to increase our respect and harmony in all aspects of life,\" said <span>Kevin Guest</span> , chairman and CEO of USANA Health Sciences (NYSE: USNA), and author of <span>All the Right Reasons, 12 Timeless Principles for Living a Life in Harmony.</span> \"I've seen in our business around the world that where harmony is high, productivity rises, and happiness is at record levels.\"</p>\n<p>Raised in <span>Montana</span> , Guest, whose billion-dollar nutrition company operates in 24 markets around the world, saw love and harmony first-hand from his parents' example.</p>\n<p>\"In the ways that really count, my parents were truly extraordinary. They lived their lives serving and teaching others,\" said Guest. \"Virtue meant something to my mom and dad, and threads of love, kindness, hard work, and integrity wove the strong cords of character in their lives.</p>\n<p>\"My parents' lessons, both spoken and lived, shaped the man I have become and the person I still hope to be. My success has been, in great part, because I try to remain true to the values my parents taught me.\"</p>\n<p>Putting our core character traits into action is what it means to live a life in harmony, writes Guest, an active musician who began playing in rock bands his teen years.</p>\n<p>\"In music, harmony happens when notes blend so it's pleasing to the ear. Whether someone performs in a band, a choir, or an orchestra, nothing is quite as exhilarating as achieving perfect harmony with fellow musicians.</p>\n<p>\"In life, harmony means living a consistent and honest arrangement of your values and solidly committing to living those values day in and day out.\"</p>\n<p>Noting that everyone has defining life moments when choices align with destiny and catapult a person in an unanticipated direction, Guest urges courage.</p>\n<p>\"These moments can paralyze us, or they can transform us, profoundly reshaping us for the better, leaving us with fresh insights, new goals, and strengthened resolve,\" he writes.</p>\n<p>\"But with your values defined, love, kindness and respect for others, especially now, will foster harmony in relationships that literally enriches life and makes it more rewarding.\"</p>\n<p>Written expressly to help others find life's success secrets, <span>All the Right Reasons</span> uncovers 12 principles for living a life in harmony. All proceeds from sales of the bestseller are aimed at feeding two million meals to hungry children. Available on Amazon, the book provides 40 meals for each single purchase.</p>\n<p>For more information, visit <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3435295-1&amp;h=3401776798&amp;u=http%3A%2F%2Fwww.kevinguest.com%2F&amp;a=www.kevinguest.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.kevinguest.com</a>\n</span> .</p>\n<p>\n<span>MEDIA CONTACT:</span>\n<span> Tim Brown, Candid Communications <a href=\"mailto:tim@candidcom.com\" data-type=\"email\" translate=\"no\">tim@candidcom.com</a> 801-557-1466 m</span></p>\n<p>\n\n</p>\n<p>\n\n</p>\n<p>View original content to download multimedia: <a href=\"https://www.prnewswire.com/news-releases/increase-harmony-in-month-of-love-for-productivity-301476293.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/increase-harmony-in-month-of-love-for-productivity-301476293.html</a>\n</p>\n<p>SOURCE USANA</p>\n<p>View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/February2022/07/c4720.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/February2022/07/c4720.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}