{"date": "2022-02-25 00:55:07+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2896.54, "close": 3075.77}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds Amazon comment</p><p class=\"tr-by\">By Julia Love and Daniel Wiessner</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Feb 24 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>A group of Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> workers seeking to form a union in New York filed a charge with U.S. labor regulators on Thursday after a high-profile organizer and a pair of employees were arrested outside a company warehouse, according to documents obtained by Reuters.</p><p>Amazon organizer Christian Smalls told Reuters on Wednesday he was arrested when he delivered warehouse workers food as part of the union campaign he is leading. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2UZ06K\" data-type=\"storyId\" data-story-id=\"nL1N2UZ06K\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>His quest to make Amazon's JFK8 Staten Island warehouse a unionized facility will come to a head when workers vote starting March 25.</p><p>The unfair labor practice charge filed on Thursday by a group of workers known as the Amazon Labor Union claims Amazon violated a settlement reached with the National Labor Relations Board (NLRB) in December. </p><p>As part of the settlement, Amazon pledged not to limit workers’ ability to engage with their colleagues in non-work areas during non-work time. </p><p>“Amazon.com Services has violated the National Settlement agreement,” the Amazon Labor Union stated in the charge. “Accordingly, we request an expedited investigation and immediate … relief in light of the upcoming election.” </p><p>In the charge, Amazon Labor Union alleges Amazon had employees Brett Daniels and Jason Anthony arrested on Wednesday in retaliation for their involvement with the union. Smalls previously worked at the warehouse and was fired in 2020 for allegedly violating company safety policies. </p><p><span class=\"tr-strong\">Amazon spokesperson Kelly Nantel said \"the settlement pertains to the rights of employees to solicit on (the company’s) property, and we did nothing to stop employees from soliciting.\" Amazon called the police on Smalls, and not the other two workers, Nantel said.</span></p><p>    \"<span class=\"tr-strong\">Mr. Smalls - who is not employed by Amazon - has repeatedly trespassed despite multiple warnings. Yesterday, when police officers asked Mr. Smalls to leave, he instead chose to escalate the situation and the police made their own decision on how to respond,\" Nantel said.</span></p><p>A second closely watched election is occurring at Amazon's Bessemer, Alabama warehouse, with vote-by-mail being accepted until March 25 and the vote count starting March 28.</p><p>Earlier this week, the Retail, Wholesale and Department Store Union (RWDSU) filed charges with the National Labor Relations Board (NLRB) accusing Amazon of unlawfully interfering in the election. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2UX1TZ\" data-type=\"storyId\" data-story-id=\"nL1N2UX1TZ\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Julia Love in San Francisco and Daniel Wiessner in New York; Editing by Chris Reese)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:julia.love@thomsonreuters.com\" data-type=\"email\" translate=\"no\">julia.love@thomsonreuters.com</a> ; <a href=\"mailto:daniel.wiessner@thomsonreuters.com\" data-type=\"email\" translate=\"no\">daniel.wiessner@thomsonreuters.com</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-UNIONS/ARRESTS (UPDATE 1)</p></div>"}