{"date": "2021-11-06 01:54:31.490000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3477.0, "close": 3488.98}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Star Rating: 4 stars</p><p>\"Your package will arrive in 60 minutes,\" announces the soothing voice of Alexa at the start of Prime_Time, a full-throttle, punk-techno disquisition on life in the age of Amazon. Two topless women in jeans and custard-coloured wigs shuffle furtively towards a transparent plastic curtain separating them from the audience. It is there ostensibly as protection: in smashing the patriarchy, Kat Cory and Dora Lynn will also smash, with baseball bats, the contents of an entire fresh produce section. Fruit rains from the ceiling, underlining the show's argument: if life gives you lemons, what else can you do but kill Jeff Bezos?</p></div><div class=\"tr-npp-body\"><p>Prime_Time, from the trio In Bed With My Brother (Nora Alexander is the off-stage third member), demonstrates that protest is rarely simple. The plastic barrier installed for health and safety reasons makes it seem as if the actors are swaddled inside Amazon's own amniotic packaging, while the instruments of destruction, among them a drill and a chainsaw, are all produced from the Amazon boxes piled on either side of the stage. The e-commerce giant has co-opted even the tools of the women's rebellion.</p><p>The couple's motives seem harmless at first. When they don goggles to dissect a melon on a plinth, they look as mischievous as Minions. They claim to be searching for the Amazon boss's dick pic, which has disappeared from the web since being leaked in 2019. Turning to Alexa for help, they ask questions such as \"Why is Jeff Bezos so bald?\" and \"How do you dispose of a body?\" The steadfast AI's disembodied contributions threaten to turn the show briefly into a digital Krapp's Last Tape. (Fittingly so, for a trio who won the 2020 <a href=\"https://www.osbttrust.com/award.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Oxford Samuel Beckett Theatre Trust award</a> .)</p><p>Ricocheting between the silly and the sinister, Prime_Time never settles in a single groove. It is precisely this unstable quality, along with some abrasive lighting and sound design, which makes it so memorably unsettling. An evening which begins with the eating of an Edenic apple ends with a brutal fall from innocence, and a punchline that shows a company keen to think outside the boxes.</p><ul class=\"bulleted-list arrowlist\"><li> </li></ul><p>Prime_Time is at the <a href=\"https://www.barbican.org.uk/whats-on/2021/event/in-bed-with-my-brother-prime-time\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Barbican, London</a> , until 6 November.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 theguardian.com-NonSyndicated</p></div>"}