{"date": "2021-11-30 15:41:12.315000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ADVANCED MICRO DEVICES INC (\"AMD-Q\")\n- AMD EPYC(TM) Processor Offerings Continue to Grow at AWS With\n- New Instances for General Purpose Compute\n\n     AMD announced Amazon Web Services, Inc. (AWS) has expanded its AMD\nEPYC(TM) processor-based offerings with the general availability of\ngeneral-purpose Amazon EC2 M6a instances. The M6a instances are powered by\n3rd Gen AMD EPYC processors delivering, according to AWS, up to 35% better\nprice-performance compared to the previous M5a instances and a 10% lower\ncost than comparable x86-based EC2 instances.\n\n     \"Our 3rd Gen AMD EPYC processors provide Amazon EC2 users excellent\nscalability and impressive price-performance compared to previous\ngeneration Amazon EC2 M5a instances. This announcement shows our strong\ncollaboration as well as highlights our overall momentum in cloud\ninfrastructure,\" said Lynn Comp, corporate vice president, Cloud Business,\nAMD. \"Our work with AWS exemplifies our commitment to giving end users\ninnovation and performance for their cloud environments and workloads.\"\n\n     \"Amazon EC2 M6a instances, powered by 3rd Gen AMD EPYC processors, are\ndesigned to provide our customers with a balance of compute, memory,\nstorage, and network resources and deliver up to 35% better price\nperformance than the previous generation M5a instances,\" said David Brown,\nvice president, Amazon EC2, AWS. \"Our continued collaboration with AMD\nenables AWS to meet customer demand and provide our users with flexibility,\nscalability, and compelling performance and price-performance for their\ngeneral-purpose workloads.\"\n\n     The Amazon EC2 M6a instances are the first EC2 instances powered by\n3rd Gen AMD EPYC CPUs, which are to be followed by additional instances\ngoing forward. Compared to the existing M5a instances, M6a takes advantage\nof the new 'Zen 3' core for better price-performance, and more core density\nto meet customer demands for increased scalability.\n\n     The M6a instances are also:\n\n     *  SAP-Certified and ideal for workloads such as web and application\nservers, back-end servers supporting enterprise applications,\nmicro-services, multi-player gaming servers, caching fleets, as well as for\napplication development environments.\n     *  Available in ten sizes, with two more instance sizes than M5a\n(32xlarge and 48xlarge). The 48xlarge size has up to 192 vCPUs and 768 GiB\nof memory, which is twice that of the largest M5a instance.\n     *  Available with up to 50 Gbps networking bandwidth, and 40 Gbps to\nthe Amazon Elastic Block Store, which is more than twice that of M5a\ninstances\n     *  Built on the AWS Nitro System, a combination of dedicated hardware\nand lightweight hypervisor, which delivers nearly all of the compute and\nmemory resources of the host hardware to the instances.\n\n     The latest AWS M6a instances powered by 3rd Gen AMD EPYC processors\nare available in AWS US East (Northern Virginia), US West (Oregon), Europe\n(Ireland), and Asia Pacific (Mumbai) Regions. AWS customers can visit the\nM6a instances landing page to get started.\n\n     Supporting Resources\n\n     *  Read the Amazon EC2 blog on M6a instances\n     *  Learn more about AMD EPYC Processors\n     *  Visit the Amazon EC2 M6a instances product detail page\n     *  Follow AMD on Twitter\n     *  Connect with AMD on LinkedIn\n\n     About AMD\nFor more than 50 years AMD has driven innovation in high-performance\ncomputing, graphics and visualization technologies ? the building blocks\nfor gaming, immersive platforms and the datacenter. Hundreds of millions of\nconsumers, leading Fortune 500 businesses and cutting-edge scientific\nresearch facilities around the world rely on AMD technology daily to\nimprove how they live, work and play. AMD employees around the world are\nfocused on building great products that push the boundaries of what is\npossible. For more information about how AMD is enabling today and\ninspiring tomorrow, visit the AMD (NASDAQ: AMD) website, blog, Facebook and\nTwitter pages.\n\n     AMD, the AMD Arrow logo, EPYC, and combinations thereof are trademarks\nof Advanced Micro Devices, Inc. Other names are for informational purposes\nonly and may be trademarks of their respective owners.\n\nTel   : 905-882-2600    ADVANCED MICRO DEVICES INC\nFax   : 905-709-6950\nEmail : linda.lam@amd.com\nWWW   : <a href=\"http://www.amd.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.amd.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133300340.MNPRE2133302234-07213020211130</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}