{"date": "2021-12-11 12:55:43.339000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3483.42, "close": 3391.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>EDWARDSVILLE, Ill. (AP) — Tornadoes and severe weather wreaked major damage in multiple states late Friday, tearing through a candle factory in Kentucky, an Amazon facility in Illinois, a nursing home in Arkansas and numerous homes and buildings. Dozens of deaths are feared and several were confirmed Saturday morning. Many people were feared dead at the factory in Mayfield, Kentucky, where Gov. Andy Beshear called the situation \"tragic\" at a news conference Saturday morning. \"There were about 110 people in it at the time that the tornado hit it,\" Beshear said. \"We believe our death toll from this event will exceed 50 Kentuckians and probably end up 70 to 100.\" The governor added, \"It's very hard, really tough, and we're praying for each and every one of those families.\" At least one person died after severe weather struck an an Amazon facility in Edwardsville, Illinois, police Chief Mike Fillback told reporters Saturday morning.</p><p>WASHINGTON (AP) — Government reports on rising inflation and the potential costs of President Joe Biden's social and environment legislation raised fresh questions Friday about the bill's fate, with both sides hoping the new numbers would influence pivotal Sen. Joe Manchin. The moderate Manchin, D-W.Va., has spent months forcing Democrats to trim the 10-year, $2 trillion package, arguing it's too expensive and at times citing growing inflation as a reason to slow work on the bill. On Friday, the Labor Department said consumer prices grew last month at an annual rate of 6.8%, the highest in 39 years. A separate report from the nonpartisan Congressional Budget Office said that if many of the bill's temporary spending boosts and tax cuts were made permanent, it would add $3 trillion to the price tag.</p></div><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">Tornadoes, storms strike US; Kentucky gov fears dozens dead</p><p class=\"tr-npp-section-title\">New inflation number feeds angst about Democrats' $2T bill</p><p class=\"tr-npp-section-title\">South African doctors see signs omicron is milder than delta</p><p>JOHANNESBURG (AP) — As the omicron variant sweeps through South Africa, Dr. Unben Pillay is seeing dozens of sick patients a day. Yet he hasn't had to send anyone to the hospital. That's one of the reasons why he, along with other doctors and medical experts, suspect that the omicron version really is causing milder COVID-19 than delta, even if it seems to be spreading faster. \"They are able to manage the disease at home,\" Pillay said of his patients. \"Most have recovered within the 10 to 14-day isolation period.\" said Pillay. And that includes older patients and those with health problems that can make them more vulnerable to becoming severely ill from a coronavirus infection, he said.</p><p class=\"tr-npp-section-title\">UK seeks unity at G7 meeting over Russia's 'malign behavior'</p><p>LIVERPOOL, England (AP) — Top diplomats from the Group of Seven industrialized nations gathered beside the River Mersey in Liverpool, with host country Britain seeking \"a show of unity against global aggressors\" amid a crisis over Russia's intentions towards Ukraine. The U.K. is seeking elusive consensus from the wealthy nations' club in response to what it calls \"malign behavior\" by Russia, and over tensions with China and Iran. As a Salvation Army band played Christmas carols, British Foreign Secretary Liz Truss greeted U.S. Secretary of State Antony Blinken and other G-7 counterparts with fist bumps in the rotunda of the modernist Museum of Liverpool at the start of the two-day talks.</p><p class=\"tr-npp-section-title\">Battered survivors tell of Mexico truck crash that killed 55</p><p>TUXTLA GUTIERREZ, Mexico (AP) — Simply counting up the human cost of the horrifying truck crash that killed 55 migrants and injured over 100 is chilling, even for those who survived the disaster on a highway in southern Mexico. About 40 of the survivors were listed with \"multiple contusions\" at local hospitals late Friday, and they were the least injured. Nearly 20 others had fractured bones, often their arms and wrists, suggesting they tried to break the force of the impact when the semi-trailer packed with smuggled migrants tipped over and smashed into a pedestrian bridge. The worst were those with brain injuries or severe internal damage, often crushed chests, abdomens or pelvises.</p><p class=\"tr-npp-section-title\">Taiwan records first omicron case in traveler from Africa</p><p>TAIPEI, Taiwan (AP) — Taiwan has recorded its first case of the omicron variant in a passenger who recently traveled to the southern African country of Eswatini, health officials said Saturday. The passenger, a Taiwanese woman in her 30s who returned on Dec. 8, is now in quarantine in hospital, according to the Central Epidemic Command Center, which is in charge of the island's pandemic response. Passengers who sat near her on the plane have tested negative so far. Taiwan reported 10 new coronavirus cases on Saturday, all of which were identified in travelers entering from abroad. The self-ruling island has a strict two-week quarantine on arrival and has sealed its borders off to all but residents and citizens, with few exceptions.</p><p class=\"tr-npp-section-title\">Dole's last Kansas journey honors service, political career</p><p>TOPEKA, Kan. (AP) — Bob Dole made a final journey back to the prairie state that shaped him for memorials in his western Kansas hometown and at the Statehouse to honor the military service that left him severely wounded and the distinguished political career that followed his recovery. Honors Saturday for the late former U.S. Senate majority leader and presidential candidate will begin with a public viewing of his casket and a memorial service at a Roman Catholic church in Russell, the small town some 240 miles (386 kilometers) west of Kansas City where he grew up during the Great Depression. Dole died Sunday at the age of 98 after serving nearly 36 years in Congress and running as the GOP nominee for president in 1996.</p><p class=\"tr-npp-section-title\">Stay French, or not? New Caledonia holds independence vote</p><p>NOUMEA, New Caledonia (AP) — Voters in the South Pacific archipelago of New Caledonia are set to decide Sunday whether to break away from France, a referendum that is important for French geopolitical ambitions and is being closely watched amid growing Chinese influence in the region. But pro-independence forces are refusing to take part, accusing the French government of trying to rush through the vote. The COVID-19 crisis complicated the campaign for the referendum, the third and last such vote foreseen as part of decades of decolonization efforts. The process is aimed at settling tensions between native Kanaks seeking independence and those who want the territory to remain part of France.</p><p class=\"tr-npp-section-title\">Cuban family finds welcome, refugee status in distant Serbia</p><p>LAJKOVAC, Serbia (AP) — Belquis Gonzales and her family enjoy something close to celebrity status in a small town in Serbia, where they live after fleeing Cuba five years ago. While most emigrants from the Caribbean island go to the United States or Spanish-speaking countries, Gonzales and her husband chose Serbia — a rare country in Europe for which Cubans do not need visas - and arrived there via Russia. \"We didn't know anything about Serbia,\" Gonzales told The Associated Press at the family's home in Lajkovac, a town about 80 kilometers (50 miles) southwest of the Serbian capital, Belgrade. \"We had many doubts and many fears as well, but things have been a lot better than we had expected.\" Still struggling with the aftermath of wars and sanctions in the 1990s, Serbia is far from a promised land for people seeking to build new lives after fleeing violence, repression or poverty at home.</p><p class=\"tr-npp-section-title\">Indian farmers end yearlong protests and return home</p><p>NEW DELHI (AP) — Tens of thousands of jubilant Indian farmers on Saturday cleared protest sites on the capital's outskirts and began returning home, marking an end to their yearlong demonstrations against agricultural reforms that were repealed by Prime Minister Narendra Modi's government in a rare retreat. Farmers dismantled their makeshift accommodations at multiple protest sites and started to vacate long stretches of highways ringing New Delhi where they have camped since November last year. Hundreds of them waved green and white flags and danced to celebrate their victory as they rode tractors, jeeps and cars. \"Farmers have saved the democracy.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 The Associated Press.  All rights reserved. This material may not be published, broadcast, rewritten or redistributed.</p></div>"}