{"date": "2021-11-29 20:00:00.374000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Axonius Integrates with the New, Enhanced Amazon Inspector to Deliver Comprehensive Cyber Asset Attack Surface Management</b>\n</p><p class=\"bwalignc\">\n<span>Axonius helps companies understand and manage their attack surface across their cloud infrastructure</span>\n</p><p>\nAxonius, a leader in<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.axonius.com&amp;esheet=52541682&amp;newsitemid=20211129005685&amp;lan=en-US&amp;anchor=cybersecurity+asset+management&amp;index=1&amp;md5=449f458a091015122852c0ce25df9128\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> cybersecurity asset management</a>, today announced an integration with the new Amazon Inspector, an automated security assessment service. The integration will enable mutual customers to better understand and manage vulnerabilities across their Amazon Web Services (AWS) infrastructure.\n</p><p>\nAmazon Inspector is a vulnerability management service that continually scans AWS workloads for software vulnerabilities and unintended network exposure. The solution automatically discovers all running Amazon Elastic Compute Cloud (Amazon EC2) instances and container images residing in Amazon Elastic Container Registry (Amazon ECR), at any scale, and immediately starts assessing them for known vulnerabilities. Because Axonius delivers a complete inventory of assets from many correlated data sources, customers can gain a comprehensive view of their cloud security posture, including vulnerability data found from Amazon Inspector.\n</p><p>\n\"Customers are burdened by the increasing number of security tools to protect the sprawl of cloud, physical, and virtual assets in their environments,” said Mark Daggett, vice president of worldwide channels and alliances, Axonius. “It's not easy for them to surface which assets are not covered by their security controls that should be, or if they are covered, whether the control is actually working. Customers are exhausted with the highly manual, slow, and error-prone processes that negatively impact their risk mitigation, threat management, and compliance. With Axonius, customers can get a unified view of their assets and dramatically accelerate the process of strengthening security posture across all of their assets.”\n</p><p>\nThe Axonius integration of Amazon Inspector provides the following key capabilities:\n</p><p>\n<b>Comprehensively Track and Assess the Security of AWS Assets</b>: In just a few clicks, the Axonius Query Wizard can identify any AWS assets that have not been assessed with Amazon Inspector. Customers can also easily search for a set of assets based on their last scan time, or segment AWS assets with known vulnerabilities by common vulnerabilities and exposures (CVE) severity, CVE ID, and more. It can also be used to track the Amazon Inspector usage and coverage.\n</p><p>\n<b>Manage Vulnerabilities Within a Broader Context: </b>Beyond simply identifying known vulnerabilities, Axonius delivers correlated data from tools such as endpoint detection and response, privilege access management, and more to help cloud security, DevOps, and security operations teams prioritize which vulnerabilities to remediate first. With an endless backlog of vulnerabilities to manage, this level of context is imperative to helping teams mitigate the vulnerabilities that are more likely to be exploited, or that would have the most impact if exploited.\n</p><p>\n<b>Improve Cloud Compliance Based on Industry Benchmarks: </b>Customers can also ensure that their AWS assets adhere to security best practices, such as the CIS AWS Foundations Benchmark. Using Axonius and Amazon Inspector, cloud security teams can prioritize which assets pose the most risk due to any detected vulnerability or deviation from security standards and best practices.\n</p><p>\n“To be effective, security and DevOps teams need to prioritize vulnerability remediation based on business impact”, said Michael Fuller, director of product management, AWS Security Services. “With the new Amazon Inspector, we’ve dramatically simplified continuous and automated vulnerability assessment for customers across their entire organization, whether they have one AWS account or five thousand. The Axonius integration then brings developers more contextual asset data to help prioritize vulnerability remediation.”\n</p><p>\nLearn more about the <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Finspector%2Fpartners%2F&amp;esheet=52541682&amp;newsitemid=20211129005685&amp;lan=en-US&amp;anchor=Axonius+Amazon+Inspector+integration&amp;index=2&amp;md5=7299cd4a7f121d153ae9b04acdbb54d3\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Axonius Amazon Inspector integration</a> and read more on the <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.axonius.com%2Fblog%2Fimprove-your-cloud-security-posture-with-axonius-and-amazon-inspector&amp;esheet=52541682&amp;newsitemid=20211129005685&amp;lan=en-US&amp;anchor=Axonius+blog&amp;index=3&amp;md5=f0f5aede0c0007597807c61b5517307a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Axonius blog</a>.\n</p><p>\n<b>About Axonius</b>\n</p><p>\nAxonius is the<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.axonius.com%2Fplatform&amp;esheet=52541682&amp;newsitemid=20211129005685&amp;lan=en-US&amp;anchor=cybersecurity+asset+management+platform&amp;index=4&amp;md5=e98a69f438e81a9b5cbdf3462645d3c6\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> cybersecurity asset management platform</a> that gives organizations a comprehensive asset inventory, uncovers gaps, and automatically validates and enforces policies. Deployed in minutes, the Axonius<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.axonius.com%2Fblog%2Fwhy-cyber-asset-attack-surface-management-caasm-is-an-emerging-technology&amp;esheet=52541682&amp;newsitemid=20211129005685&amp;lan=en-US&amp;anchor=cyber+asset+attack+surface+management+%28CAASM%29&amp;index=5&amp;md5=64d12c0b355924f3e25888caa6b61e80\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> cyber asset attack surface management (CAASM)</a> solution integrates with hundreds of data sources to give customers the confidence to control complexity by mitigating threats, navigating risk, decreasing incidents, automating response actions, and informing business-level strategy. Cited as one of the fastest growing cybersecurity startups, with accolades from CNBC, Forbes, and Fortune, Axonius covers millions of devices for<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.axonius.com%2Fresources%3Fmixquery%3Dcase-study&amp;esheet=52541682&amp;newsitemid=20211129005685&amp;lan=en-US&amp;anchor=customers&amp;index=6&amp;md5=8b95bac9d48f68a7b33b1c6b64e736ca\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> customers</a> around the world. For more, visit<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.axonius.com%2F&amp;esheet=52541682&amp;newsitemid=20211129005685&amp;lan=en-US&amp;anchor=Axonius.com&amp;index=7&amp;md5=f65b69bf7c09edbf0e36db3af13e5e88\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> Axonius.com</a>.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211129005685r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTI5MDA1Njg1cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=96655892db1f39fa8ceb2c9919b18ddd09622c638adbdccfbf862c7175a2533c27dbaf2183f01c9d715f35acd7e1969d0ca936847c24be1649709ee6b55ca9f4\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211129005685/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211129005685/en/</a></span></p><p>\nJennifer Tanner\n<br/>Look Left Marketing\n<br/><a href=\"mailto:axonius@lookleftmarketing.com\" data-type=\"email\" translate=\"no\">axonius@lookleftmarketing.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NY-AXONIUS</p></div>"}