{"date": "2021-11-15 13:47:07.283000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>AMAZON.COM INC (\"AMZN-Q\")\n- Amazon Web Services Join Forces to Help Oil &amp; Gas Industry\n- Accelerate Energy Transition\n\n      Today at ADIPEC, IBM and Amazon Web Services, Inc. (AWS), an\nAmazon.com, Inc. company announced the two companies will combine the\nbenefits of IBM Open Data for Industries for IBM Cloud Pak for Data and the\nAWS Cloud to serve energy customers. This comprehensive solution is built\non Red Hat OpenShift and will run on the AWS Cloud, simplifying the ability\nfor customers to run workloads in the AWS cloud and on-premises. The two\ncompanies also intend to collaborate on further co-development of future\nfunctionality to provide greater flexibility and choice on where to run\nOSDU applications.\n\n   As an IBM and Reuters whitepaper, sponsored by IBM, found, the energy\nindustry is facing pressure to reduce greenhouse gases as demand for\naffordable energy continues to rise. Energy companies need solutions that\nhelp drive efficiencies to free up capital, time and resources to invest in\ndiscovering new, more sustainable energy sources for the future. Data and\ndigital technologies can help to navigate this transition, yet an IBM\nsurvey found that less than half of oil and gas executive respondents are\nusing data to drive that innovation. This is in part because most of the\ndigitization efforts have been in proprietary closed systems, hindering the\npotential to combine and maximize the value of data.\n\n   The collaboration between IBM and AWS aims to accelerate reduction of\ndata barriers in the industry. IBM Open Data for Industries is an\nopen-source solution using the OSDU data foundation for the oil, gas and\nenergy industry. IBM Open Data for Industries is fully integrated with IBM\nCloud Pak for Data for easy data management, and built on Red Hat\nOpenShift, the industry's leading Kubernetes platform and open\narchitecture, designed so that companies can run and operate applications\nuniversally. With this collaboration, customers will gain the flexibility\nto run OSDU Data Platform applications in the AWS cloud or on-premises\nwhile addressing data residency requirements. Combined with the expansive\ncloud infrastructure of AWS cloud services, this data platform can help\nenergy companies reduce the cost, time and resources needed to leverage the\ndata to derive insight, streamlining operations and transition to\nsustainable energy generation.\n\n   \"Much of the data needed to solve the complex energy challenges, such as\nsuperior subsurface decisions, already exists, yet is untapped. This is\nbecause one of the greatest values of that data is derived when it can be\neffectively combined, but usually this data is locked by data residency\nrequirements, legacy applications or proprietary data formats,\" said Bill\nVass, vice president, engineering, AWS. \"By collaborating with IBM and\nleveraging Red Hat OpenShift, we will be able to offer customers a global,\nseamless offering with the flexibility to run on virtually any IT\ninfrastructure and drive longer-term digital innovation.\"\n\n   The OSDU Forum is a cross-industry collaboration that provides a\nvendor-neutral framework for companies to develop data platforms against\ncommon energy industry standards. By working together, IBM and AWS will\naccelerate the value of this platform for global customers. The goal is\nthat this combined effort will help serve the needs of energy companies\ntoday with flexibility to adapt to change amid energy transition.\n\n   \"Data is a critical asset to help fuel energy transition, yet too often\nenergy companies must choose between running applications on-premises or in\nthe cloud, and often each deployment uses a proprietary data format,\" said\nManish Chawla, global managing director, energy, resources and\nmanufacturing, IBM. \"This means that rather than using all of that\ncollective data to gather insights, augment operations and inform\ninnovation, some of it was going unused. Our collaboration with Amazon Web\nServices is addressing the need to make it easier for energy customers to\naccess their data and provides the industry with a flexible solution to\nmeet the challenges of today, as well as more easily adapt as the industry\nevolves.\"\n\n   This collaboration underscores the value of IBM and Red Hat to provide\nflexibility and unlock greater business value for operational data across\nindustries.\n\n   Those attending the ADIPEC Exhibition and Conference are encouraged to\nattend a joint, fireside session hosted at the AWS booth, Abu Dhabi\nConvention Centre, Hall 13, AWS booth #13360, on Monday, Nov. 15th 12:30pm\n- 1:00pm GMT +4. AWS and IBM will further discuss this collaboration and\nmeeting the challenges of the industry.\n\n   About IBMIBM combines technology with industry expertise to help Oil &amp;\nGas clients digitally reinvent their businesses for resilience and\nsustainability. Pioneering advances in materials science from IBM Research\naccelerate energy transition. Data science and AI take the guesswork out of\nexploration. Predictive asset management raises production throughput.\nSupply chain insights and blockchain build trust and transparency across\nthe downstream ecosystem. Customer experience experts reshape consumer\nconnections at the gas pump or electric charge station. Through these\nsolutions IBM helps Oil &amp; Gas clients emerge smarter. For further\ninformation visit:  <a href=\"https://www.ibm.com/industries/oil-gas\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.ibm.com/industries/oil-gas</a>\n\n   Red Hat, the Red Hat logo and OpenShift are trademarks or registered\ntrademarks of Red Hat, Inc. or its subsidiaries in the U.S. and other\ncountries.\n\n   IBM's statements regarding its plans, directions, and intent are subject\nto change or withdrawal without notice at IBM's sole discretion.\nInformation regarding potential future products is intended to outline our\ngeneral product direction and it should not be relied on in making a\npurchasing decision. The information mentioned regarding potential future\nproducts is not a commitment, promise, or legal obligation to deliver any\nmaterial, code or functionality. Information about potential future\nproducts may not be incorporated into any contract. The development,\nrelease, and timing of any future features or functionality described for\nour products remains at our sole discretion.\n\nTel   : 206-266-1000    AMAZON.COM INC\nEmail : amazon-ir@amazon.com\nWWW   : <a href=\"https://www.amazon.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.amazon.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2131800074.MNPRE2131801225-05451120211115</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}