{"date": "2022-02-22 15:21:18.631000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SUPERNOVA PARTNERS ACQUISITION CO II LTD (\"SNII-N\")\n- Rigetti Computing Founder and CEO, Chad Rigetti, to Provide\n- Business Update on Technology and Partnership Progress\n\n     Rigetti Computing (\"Rigetti\" or the \"Company\"), a pioneer in hybrid\nquantum-classical computing, today announced that Chad Rigetti, founder and\nCEO of Rigetti, will discuss the Company's recent technology and\npartnership announcements tomorrow, Wednesday, February 23, 2022.\n\n     Webcast Information\n\n     Time: Wednesday, February 23, 2022 at 8:30 am ET / 5:30 am PT\n\n     Speaker: Chad Rigetti, founder and CEO of Rigetti\n\n     Webcast link:\n<a href=\"https://kvgo.com/corporate-services/rigetti-business-update-call\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://kvgo.com/corporate-services/rigetti-business-update-call</a>\n\n     An on-demand replay will be available shortly after the conclusion of\nthe presentation through the webcast link.\n\n     Commentary\n\n     Chad Rigetti, founder and CEO of the Company, commented, \"We have\nrecently made several technology and business announcements focused on\nscale, speed, fidelity, and new partnership engagements. We encourage those\ninterested in Rigetti and quantum computing more broadly to tune in to this\nupdate for additional context on the relevance and potential implications\nof these announcements.\"\n\n     Recent Technology Developments\n\n     1. Commercial Availability of 80-Qubit Aspen-M System and Results of\nCLOPS Speed Tests\n\n     On 2/15/2022, Rigetti announced the commercial availability of its\n80-qubit quantum system, Aspen-M,  on Rigetti Quantum Cloud Services (QCS)\nand to end users on Amazon Braket. Rigetti's 80-qubit gate-model system is\nthe largest quantum computer available on Braket and marks the latest in a\nseries of increasingly powerful Rigetti systems offered through the service\nsince Rigetti served as a launch partner on Amazon Braket in 2019. Rigetti\nexpects the 80-qubit system to be available through Azure Quantum,\nStrangeworks QC(TM) and Zapata's Orquestra(TM) platform in the coming\nmonths. In addition, Aspen-M is expected to support a number of Rigetti\ncollaborations taking place with both enterprise and public sector\ncustomers, including DARPA, Deloitte, Nasdaq, and the U.S. Department of\nEnergy.\n     Rigetti also reported results of system speed tests run on Aspen-M.\nRigetti performed measurements using the CLOPS metric, or circuit layer\noperations per second, which characterizes the overall speed of a\nquantum-classical hybrid system, with a higher CLOPS score indicating\nfaster speed.* Results on Rigetti's 40-qubit system, Aspen-11, and 80-qubit\nsystem, Aspen-M, were 844 CLOPS and 892 CLOPS, respectively, demonstrating\nthat Rigetti's hybrid integration technology delivered comparable or better\nspeed as the Company scaled from 40 qubits to 80 qubits. Read full press\nrelease here.\n\n2. Fidelities as High as 99.5% on Next-Generation Chip Architecture\n\n     Rigetti announced on 2/17/2022 that it has achieved entangling gate\nfidelities as high as 99.5% on its next-generation chip architecture,\ncrossing what is believed to be a key threshold for achieving commercial\nquantum computing. This next-generation device builds on several\nengineering achievements from Rigetti's previous generation processors,\nincluding 3D signal delivery and superconducting caps and vias, which are\ndesigned to reduce crosstalk among qubits on the chip. It also incorporates\nsome of the company's  recent advances in qubit design and gate operations.\n\n     Once scaled, Rigetti intends to incorporate the new design into its\nproprietary modular chip architecture, with the goal of bringing together\nadvancements in scalability, speed and fidelity. Read full press release\nhere.\n\n     Recent Partnership Developments\n\n     1. Ampere Strategic Partnership Announcement\n\n     Rigetti and Ampere Computing announced on 2/16/2022 a strategic\npartnership to create hybrid quantum-classical computers designed to unlock\na new generation of machine learning applications over the cloud. The two\ncompanies are expected to integrate Rigetti Quantum Processing Units (QPUs)\nwith Ampere Altra Max cloud-native processors to create a hybrid computing\nenvironment intended to meet the rigorous demands of machine learning\napplications. Read full press release here.\n\n     2. Nasdaq Collaborative Agreement Announcement\n\n     Rigetti announced on 2/15/2022 a collaborative agreement with Nasdaq\n(Nasdaq:NDAQ) to pursue the development of quantum applications to help\nsolve high-impact computational problems in the financial industry. The\nefforts are expected towill be powered by Rigetti Quantum Cloud Services,\nfeaturing Rigetti's 80-qubit \"Aspen M\" series quantum processor - the\nquantum computing industry's first commercial multi-chip processor. Read\nfull press release here.\n\n     3. New Phase in Zapata Partnership\n\n     Rigetti and Zapata Computing announced on 2/10/2022 a new phase in\ntheir long-standing partnership. In this new phase, the companies are\nworking to developing an industry first hybrid quantum-classical\ncompilation toolchain to better enable researchers to advance hybrid\napplications, including in quantum sampling and quantum machine learning.\nAs part of the work, Zapata is expected towill integrate Orquestra, its\nunified platform for building and deploying quantum-ready applications(TM)\nat enterprise scale, directly with Rigetti's Quantum Cloud Services (QCS).\nThis new, full-stack combination is designed to optimize access to the new\ndevice and speed up execution of hybrid applications. Read full press\nrelease here.\n\n     4. Phase 2 of DARPA ONISQ Program\n\n     Rigetti Computing announced on 1/27/2022 that it has been selected to\ndeliver hardware, software and benchmarks for phase two of a DARPA (Defense\nAdvanced Research Projects Agency) program designed to develop quantum\ncomputers capable of solving complex optimization problems important for\nnational security and commercial applications.\n\n     In partnership with the Universities Space Research Association (USRA)\nand the NASA Quantum Artificial Intelligence Laboratory (QuAIL), the goal\nof the collaboration is to deliver a full-stack solution with a proven\nquantum advantage over classical techniques. Read the full press release\nhere.\n\n     _____\n\n     *CLOPS is calculated as M x K x S x D / time taken where: M = number\nof templates = 100; K = number of parameter updates = 10; S = number of\nshots = 100 (or 1000); and D = number of QV layers = log2 QV.  To Rigetti's\nknowledge, CLOPS as a speed test has not been investigated or verified by\nany independent third party.  In addition, while Rigetti applied the above\nformula in testing the speed of Aspen-M and Aspen-11, there is no guarantee\nthat Rigetti applied the test in the same way as IBM and, as a result, any\nvariability in the application of the test as between Rigetti, IBM or\nothers in the industry that may apply CLOPS in the future could render\nCLOPS scores incomparable and actual relative performance may materially\ndiffer from reported results.\n\n     Other than IBM, others in the industry have not announced CLOPS as a\nspeed test. As a result, the speed of other competitors as measured by\nCLOPS is not currently known. In addition, the solution accuracy provided\nby quantum computers is another key factor, and a quantum computer that may\nbe slower may be preferable to users if it provides a more accurate answer\nfor certain applications. Moreover, the relative leads reflected by speed\ntests such as CLOPS can change as new generations of quantum computers are\nintroduced by industry participants and, consequently, any advantages\ncannot be considered permanent and can be expected to change from time to\ntime. Current CLOPS tests may not be indicative of the results of future\ntests.\n\n     About Rigetti Computing\n\n     Rigetti Computing is a pioneer in full-stack quantum computing. The\nCompany has operated quantum computers over the cloud since 2017 and serves\nglobal enterprise, government and research clients through its Rigetti\nQuantum Cloud Services platform. The Company's proprietary\nquantum-classical infrastructure provides ultra-low latency integration\nwith public and private clouds for high-performance practical quantum\ncomputing. Rigetti has developed the industry's first multi-chip quantum\nprocessor for scalable quantum computing systems. The Company designs and\nmanufactures its chips in-house at Fab-1, the industry's first dedicated\nand integrated quantum device manufacturing facility. Rigetti was founded\nin 2013 by Chad Rigetti and today employs more than 140 people with offices\nin the United States, U.K. and Australia. Learn more at www.rigetti.com.\n\n     Additional Information and Where to Find It\n\n     In connection with the previously announced proposed business\ncombination between Rigetti and Supernova Partners Acquisition Company II\nLtd (\"Supernova\") (NYSE:SNII), Supernova has filed a registration statement\non Form S-4 (as amended, the \"Form S-4\") with the SEC, which includes a\nproxy statement/prospectus, that is both the proxy statement to be\ndistributed to holders of Supernova's ordinary shares in connection with\nits solicitation of proxies for the vote by Supernova's shareholders with\nrespect to the proposed business combination and other matters as may be\ndescribed in the registration statement, as well as the prospectus relating\nto the offer and sale of the securities to be issued in the business\ncombination. Supernova has mailed a definitive proxy statement/prospectus\nand other relevant documents to its shareholders. This communication does\nnot contain all the information that should be considered concerning the\nproposed business combination and is not intended to form the basis of any\ninvestment decision or any other decision in respect of the business\ncombination. Supernova's shareholders and other interested persons are\nadvised to read the definitive proxy statement/prospectus and other\ndocuments filed in connection with the proposed business combination, as\nthese materials will contain important information about Rigetti, Supernova\nand the business combination. The Registration Statement was declared\neffective by the SEC on February 9, 2022 and the definitive proxy\nstatement/prospectus and other relevant documents were mailed to\nshareholders of Supernova as of the record date established for voting on\nthe proposed Business Combination and the other proposals regarding the\nBusiness Combination. Shareholders are able to obtain copies of the\ndefinitive proxy statement and other documents filed with the SEC, without\ncharge, at the SEC's website at www.sec.gov, or by directing a request to\nSupernova's secretary at 4301 50th Street NW, Suite 300 PMB 1044,\nWashington, D.C. 20016, (202) 918-7050.\n\n     Participants in the Solicitation\n\n     Supernova and its directors and executive officers may be deemed\nparticipants in the solicitation of proxies from Supernova's shareholders\nwith respect to the proposed business combination. A list of the names of\nthose directors and executive officers and a description of their interests\nin Supernova is contained in Supernova's definitive proxy\nstatement/prospectus, which was filed with the SEC and is available free of\ncharge at the SEC's website at www.sec.gov. To the extent such holdings of\nSupernova's securities may have changed since that time, such changes have\nbeen or will be reflected on Statements of Change in Ownership on Form 4\nfiled with the SEC.\n\n     Rigetti and its directors and executive officers may also be deemed to\nbe participants in the solicitation of proxies from the shareholders of\nSupernova in connection with the proposed business combination. A list of\nthe names of such directors and executive officers and information\nregarding their interests in the proposed business combination is included\nin the proxy statement/prospectus for the proposed business combination.\n\n     No Offer or Solicitation\n\n     This communication does not constitute (i) a solicitation of a proxy,\nconsent or authorization with respect to any securities or in respect of\nthe proposed business combination or (ii) an offer to sell, a solicitation\nof an offer to buy, or a recommendation to purchase any security of\nSupernova, Rigetti, or any of their respective affiliates.\n\n     Forward-Looking Statements\n\n     Certain statements in this communication may be considered\nforward-looking statements. Forward-looking statements generally relate to\nfuture events and can be identified by terminology such as \"pro forma\",\n\"may\", \"should\", \"could\", \"might\", \"plan\", \"possible\", \"project\", \"strive\",\n\"budget\", \"forecast\", \"expect\", \"intend\", \"will\", \"estimate\", \"anticipate\",\n\"believe\", \"predict\", \"potential\" or \"continue\", or the negatives of these\nterms or variations of them or similar terminology. These forward-looking\nstatements include, but are not limited to, statements relating to\npotential quantum computing applications to the financial services industry\nand Rigetti's related partnerships, including the potential development of\nalgorithms and software that demonstrate the advantages of hybrid\nquantum-classical computers and solve problems; statements relating to the\ncapabilities of Aspen-M, its future availability, the reliability of the\nCLOPS test, including potential deficiencies in, or in the application of,\nthe test, customer experience replicating Rigetti's or competitors' test\nperformance, expected collaborations, programs, partnerships and\napplications; statements with respect to entering into a new era of quantum\nadvantage and ability to advance commercial application of quantum\ncomputing, including the ability to scale and encode real-world problems;\nstatements relating to Rigetti's new chip architecture, key characteristics\nand thresholds for commercial quantum computing and new algorithm R&amp;D and\nstatements relating to Rigetti's plans to scale test devices to higher\nqubits and incorporate its new design into its modular chip architecture;\nstatements relating to Rigetti's plans to deliver technology for Phase 2 of\nDARPA's ONISQ Program; statements relating to certain aspects of Rigetti's\npartnership with Zapata; statements relating to quantum computing\napplications to machine learning and related partnerships, including the\npotential discovery and deployment of high-performance machine learning\nalgorithms, development of a cloud platform for machine learning and\naddressing problems of extreme computational complexity in areas like\nclimate change, fusion energy, quantitative finance, drug development, and\nmaterials science.   Such forward-looking statements are subject to risks,\nuncertainties, and other factors which could cause actual results to differ\nmaterially from those expressed or implied by such forward looking\nstatements. These forward-looking statements are based upon estimates and\nassumptions that, while considered reasonable by Supernova and its\nmanagement, and Rigetti and its management, as the case may be, are\ninherently uncertain. Factors that may cause actual results to differ\nmaterially from current expectations include, but are not limited to: the\noutcome of any legal proceedings that may be instituted against Supernova,\nRigetti, the combined company or others following the announcement of the\nbusiness combination and any definitive agreements with respect thereto;\nthe inability to complete the proposed business combination due to the\nfailure to obtain approval of the shareholders of Supernova or to satisfy\nother conditions to closing; changes to the proposed structure of the\nbusiness combination that may be required or appropriate as a result of\napplicable laws or regulations or as a condition to obtaining regulatory\napproval of the business combination; the ability to meet stock exchange\nlisting standards following the consummation of the business combination;\nthe risk that the proposed business combination disrupts current plans and\noperations of Rigetti as a result of the announcement and consummation of\nthe proposed business combination; the ability to recognize the anticipated\nbenefits of the business combination, which may be affected by, among other\nthings, competition, the ability of the combined company to grow and manage\ngrowth profitably, maintain relationships with customers and suppliers and\nretain its management and key employees; costs related to the business\ncombination; changes in applicable laws or regulations; the possibility\nthat Rigetti or the combined company may be adversely affected by other\neconomic, business, or competitive factors; Rigetti's estimates of expenses\nand profitability; the evolution of the markets in which Rigetti competes;\nthe ability of Rigetti to execute on its technology roadmap; the ability of\nRigetti to implement its strategic initiatives, expansion plans and\ncontinue to innovate its existing services; the impact of the COVID-19\npandemic on Rigetti's business; and other risks and uncertainties set forth\nin the section entitled \"Risk Factors\" and \"Cautionary Note Regarding\nForward-Looking Statements\" in the registration on Form S-4 and proxy\nstatement/prospectus discussed above and other documents filed with\nSupernova from time to time with the SEC.\n\n     Nothing in this communication should be regarded as a representation\nby any person that the forward-looking statements set forth herein will be\nachieved or that any of the contemplated results of such forward-looking\nstatements will be achieved. You should not place undue reliance on\nforward-looking statements, which speak only as of the date they are made.\nNeither Supernova nor Rigetti undertakes any duty to update these\nforward-looking statements.\n\n    Attachment\n\n\n\n                 *\n        Rigetti Computing\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2205200391.MNPRE2205202145-07192420220222</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}