{"date": "2022-02-08 19:33:15.071000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Network International has joined forces with Amazon Payment Services to provide merchants across the UAE with a wider selection of online payment solutions, supporting businesses in their E-Commerce journey.</p><p>Network International and Amazon Payment Services have partnered to provide Network merchants with access to Amazon Payment Services gateway and payment solutions, such as EPP and enhanced fraud monitoring and enable Amazon Payment Services merchants to benefit from Network International's acquiring and settlement solutions.The two organizations will jointly offer diverse payment solutions at competitive prices, expanding the range of digital payment solutions available to their merchants in the UAE across a variety of product verticals. As the UAE's largest acquirer and leading payment processor in the MEA region, Network International has taken a lead role in providing merchants and consumers across the region with best-in-class payment solutions.Commenting on the partnership, Pankaj Kundra, Group Head of Partnerships, Acquiring at Network International, said: \"As the largest acquirer in the UAE and the leading enabler of digital commerce in the Middle East and Africa (MEA), we remain committed to enhancing the UAE's payment ecosystem by enhancing the security and acceptance rates of digital payments. We are happy to partner with a reputable Amazon brand such as Amazon Payment Services in the UAE. We look forward to working together with Amazon Payment Services to expand the fast-growing online market and support merchants looking to transition to e-commerce.\"Amazon Payment Services is a payment processing service aimed at empowering customers and businesses with simple, affordable, and trusted online payment experiences.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}