{"date": "2021-11-30 15:40:50.331000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>CLEARDAY INC (\"CLRD-0\")\n- Presents at Amazon's re: Invent Conference\n\n   Clearday, Inc. innovative care solutions will be presented by Invento\nResearch, Inc. as part of their joint venture in the Wipro booth at the\nAmazon Web Services (AWS) re: Invent conference November 29 thru December 3\nin Las Vegas. The presentation will include combining Clearday at Home\ndigital services with robotic services that are being developed through\nClearday Labs. Guests of Wipro will receive a first-hand demonstration of\nhow robotics and Clearday at Home are combined to support residential,\nin-home, and virtual care for older Americans facing non-acute health\nissues.\n\n   \"We believe our enhanced robotic services provide technology to the\nnon-acute senior care sector is a perfect example of how the AWS community\nis working to empower and enhance lives across the globe. We are focused on\nsupporting the millions of caregivers helping older Americans and adding to\nthe experiences they provide daily.\" Commented James Walesa, CEO of\nClearday.\n\n   Balaji Viswanathan, CEO of Invento Research adds \"We are excited to\nparticipate in the AWS Invent 2021 event in Las Vegas and introduce our\n\"Mitra\" robot that has been successfully deployed in several countries to\nthe American market. Every day we read about the severe shortage of\ncaregivers in the non-acute senior care space. Together with Clearday, we\nare bringing our \"Trusted Companion\" to provide help and companionship to\nthe millions of older Americans in need. Both Companies are aligned in the\nbelief that the combination of innovation and personalization is critical\nto innovating the delivery of daily in home care to empower people to age\nin place.\"\n\n   Amazon Las Vegas, NV re: Invent conference is a week-long conference and\nexhibition dedicated to AWS users and partners and is recognized as the\npremium annual Cloud networking event hosted by Amazon Web Services for the\nglobal Cloud community and is expected to include the latest advances in\nAWS technologies and future product directions.  Amazon has positioned AWS\nas one of the world's most comprehensive and broadly adopted cloud\nplatform, offering over 200 fully featured services from data centers\nglobally.\n\n   About Clearday(TM)Clearday(TM) is an innovative non-acute longevity\nhealth care services company with a modern, hopeful vision for making high\nquality care options more accessible, affordable, and empowering for older\nAmericans and those who love and care for them. Clearday has decade-long\nexperience in non-acute care through its subsidiary Memory Care America,\nwhich operates highly rated residential memory care communities in four\nU.S. states. Clearday at Home - its digital service - brings Clearday to\nthe intersection of telehealth, Software-as-a-Service (SaaS), and\nsubscription-based content.\n\n   Learn more about Clearday at www.myclearday.com.Learn more about\nClearday at Home at www.cleardayathome.com.Learn more about Clearday Clubs\nat clubs.myclearday.com.Learn more about the Clearday Network at\n<a href=\"https://business.cleardayathome.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://business.cleardayathome.com</a>\n\n   About Invento Research Inc.Invento Research Inc is a leading robotics\ncompany building personalized robotic assistants to improve the quality of\nlife for those it touches. Invento has deployed its robots and services in\nIndia and Singapore and has entered a joint venture with Clearday, Inc. to\ndeploy its proven robot in the American health care and non-acute care\nmarkets and  support personal caregivers.  Together, Invento and Clearday\nare creating solutions to support older Americans who want to age in place\nbut need some help with regular activities of daily living.\n   Learn more about Invento Research Inc. at <a href=\"https://mitrarobot.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://mitrarobot.com</a>\n\n   Forward Looking StatementsThis press release may contain forward-looking\nstatements within the meaning of Section 27A of the Securities Act of 1933,\nas amended, and Section 21E of the Securities Exchange Act of 1934, as\namended. All statements other than statements of historical fact are, or\nmay be deemed to be, forward-looking statements. In some cases,\nforward-looking statements can be identified by the use of terms such as\n\"anticipate,\" \"estimate,\" \"believe,\" \"continue,\" \"could,\" \"intend,\" \"may,\"\n\"plan,\" \"potential,\" \"predict,\" \"should,\" \"will,\" \"expect,\" \"objective,\"\n\"projection,\" \"forecast,\" \"goal,\" \"guidance,\" \"outlook,\" \"effort,\"\n\"target,\" \"trajectory,\" \"focus,\" \"work to,\" \"attempt,\" \"pursue,\" or other\ncomparable terms. However, the absence of these words does not mean that\nthe statements are not forward-looking. These forward-looking statements\nare based on certain assumptions and analyses made by us in light of our\nexperience and our perception of historical trends, current conditions and\nexpected future developments, as well as other factors we believe are\nappropriate in the circumstances and are not guarantees of future\nperformance. Actual results may differ materially from those indicated by\nforward-looking statements as a result of various factors, risks and\nuncertainties. These forward-looking statements should not be relied upon\nas representing Clearday's views as of any date subsequent to the date\nhereof. Except as required by applicable law, Clearday undertakes no\nobligation to revise or update any forward-looking statement, or to make\nany other forward-looking statements, whether as a result of new\ninformation, future events or otherwise.\n\nInvestor Relations\nAndrew Barwicki\n516-662-9461\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133300365.MNPRE2133302272-07274720211130</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}