{"date": "2021-12-01 19:54:11.182000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwlistdisc{list-style-type:disc;}.storyContent .bwmarginl1{margin-left:30px;}</style><p class=\"bwalignc\">\n<b>Astadia Migration Factory to Reduce the Duration of Mainframe to AWS Migrations by up to 90%</b>\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\n<b><span>Astadia provides organizations migrating to AWS with a next-generation software platform, automating the transformation of mainframe-based applications and databases.</span></b>\n</li>\n<li>\n<b><span>Enterprises and government agencies can license the Astadia Migration Factory to simplify, automate, and shorten their mainframe-to-cloud journey.</span></b>\n</li>\n</ul><p>\nOrganizations looking to reap the benefits of moving IBM and Unisys mainframe applications to Amazon Web Services (AWS) can now simplify and accelerate complex transformation projects by leveraging the Astadia Migration Factory.\n</p><p>\nThe Astadia platform offers a complete mainframe-to-cloud migration solution that can reduce the duration of a typical migration project by as much as 90%. The Factory’s automation capabilities and technology coverage, combined with AWS’s massive range of computing solutions, offer a reliable and scalable mainframe migration strategy and enable industry-leading organizations to increase speed, optimize costs, and unlock vertical scalability and agility.\n</p><p class=\"bwmarginl1\">\n<span>“By providing organizations with a world-class software platform and the highest level of automation on the market, we enable them to reduce the migration timeframes and eliminate business risks such as increasing license costs, lack of agility, and skills shortage. For industries like banking, insurance, automotive, healthcare, and retail, the speed at which they can modernize mission-critical mainframe applications and move to the cloud can be game-changers,” said Scott G. Silk, Chairman and CEO of Astadia.</span>\n</p><p>\nThe Migration Factory has a broad coverage of legacy technologies such as COBOL, Assembler, CA IDMS, Natural, and ADABAS that can be migrated to, among others, Java or C# in combination with all the leading SQL databases. The migrated applications are functionally equivalent and ready for deployment on the target platform of choice.\n</p><p>\nWith comprehensive and fully automated technology and a proven methodology focused on accelerating the mainframe migration and minimizing and controlling risk, Astadia enables clients to successfully migrate their mainframe applications to AWS and scale with a fully integrated automated workflow.\n</p><p>\nBy leveraging the Astadia and AWS partnership, enterprises and government organizations can:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\nGet a rapid assessment providing a roadmap and an estimated cost to move their mainframe workloads to a distributed platform. This includes a variety of options such as the migration method, comprehensive testing, DevOps concepts, and support\n</li>\n<li>\nPerform automated code transformation from multiple sources (z/OS, z/VSE, CICS, IMS, Assembler, JCL, COBOL, Natural, ADS, Fortran, REXX) to modern platforms\n</li>\n<li>\nAutomatically convert legacy databases and files (Db2, ADABAS, IDMS, IMS DB, VSAM, GDGs)\n</li>\n<li>\nLicense the Astadia Migration Factory that accelerates and industrializes the process of migrating and testing legacy applications, resulting in fixed-price project fees, fast turnover and ROI.\n</li>\n</ul><p>\nThe collaboration with AWS builds on an existing relationship, including Astadia’s participation in the AWS Marketplace and the Public Sector Partner Program. Together, the companies are providing a complete cloud services and cloud management portfolio that will give enterprise and government customers fast, flexible access to the cloud.\n</p><p>\n<b>Additional resources:\n<br/></b>Take advantage of Astadia’s free mainframe-to-cloud modernization resources, where we assist our clients as they plan and move into a safe and secure, high-performance cloud environment.\n</p><p>\n&gt;&gt; Get Astadia’s <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.astadia.com%2Fresources%2Four-resources&amp;esheet=52542525&amp;newsitemid=20211130005834&amp;lan=en-US&amp;anchor=mainframe-to-cloud+resources&amp;index=1&amp;md5=9a28be8e24879ced9171679b2f7d4ad9\" data-type=\"url\" class=\"tr-link\" translate=\"no\">mainframe-to-cloud resources \n</a><br/>&gt;&gt; Find Astadia on AWS Marketplace:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fmarketplace%2Fpp%2Fprodview-5pcfum3zitjso%3Fsr%3D0-1%26ref_%3Dbeagle%26applicationId%3DAWSMPContessa&amp;esheet=52542525&amp;newsitemid=20211130005834&amp;lan=en-US&amp;anchor=Mainframe+Transformation&amp;index=2&amp;md5=4c24d431bdc4da8ae296900594925671\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Mainframe Transformation</a>\n</li>\n<li>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fmarketplace%2Fpp%2Fprodview-euhdkqu5ejbpy%3Fsr%3D0-2%26ref_%3Dbeagle%26applicationId%3DAWSMPContessa&amp;esheet=52542525&amp;newsitemid=20211130005834&amp;lan=en-US&amp;anchor=Mainframe+Modernization+Assessment&amp;index=3&amp;md5=665ffff298e6d6e83a64c1f72315f4e3\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Mainframe Modernization Assessment</a>\n</li>\n</ul><p>\n<b>About Astadia\n<br/></b>Astadia is the market-leading mainframe modernization software, consulting and systems integration boutique. We specialize in moving IBM and Unisys mainframe applications and databases to distributed and cloud platforms. With more than 30 years of experience, over 300 mainframe migrations completed, enterprises and government organizations choose Astadia for their deep expertise, range of technologies, and the ability to automate complex migrations and testing at scale. Learn more on <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.astadia.com%2F&amp;esheet=52542525&amp;newsitemid=20211130005834&amp;lan=en-US&amp;anchor=http%3A%2F%2Fwww.astadia.com&amp;index=4&amp;md5=30c9fa13b511175e237fece19c3cec4e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.astadia.com</a>.\n</p><p>\n<b>About AWS\n<br/></b>Amazon Web Services (AWS) is a leading cloud platform, offering over 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—are using AWS to lower costs, become more agile, and innovate faster. Learn more on <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2F&amp;esheet=52542525&amp;newsitemid=20211130005834&amp;lan=en-US&amp;anchor=https%3A%2F%2Faws.amazon.com&amp;index=5&amp;md5=acee915288d916b6da7762eef82b2b0d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://aws.amazon.com</a>.\n</p><p><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211130005834/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211130005834/en/</a></span></p><p>\nWilson Rains, Chief Revenue Officer\n<br/><a href=\"mailto:Wilson.Rains@astadia.com\" data-type=\"email\" translate=\"no\">Wilson.Rains@astadia.com</a><br/>+1.877.727.8234\n</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: MA-ASTADIA</p></div>"}