{"date": "2021-05-06 15:27:36+00:00", "ticker": "AVV", "mrkt_info": {"open": 3330.0, "close": 3317.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><h4>\n      Poka helps manufacturers boost digital collaboration and knowledge sharing for workers.\n    </h4>\n              <p>\n      Manufacturers are in a dire need to augment workers digitally with real time knowledge and help them master new and complex equipment and reduce failure risks.\n    </p>\n              <p>\n      In an industry that has been reshaped by AI and automation, this statement comes as a striking reminder of the huge potential for more efficiency. More complex, bigger, data-rich and remote processes are challenging plant operators in their detailed understanding and ability to tackle abnormal situations. They require digital tools and a better trained workforce. Thanks to POKA's technology, Aveva is able to digitize knowledge retention and workforce training.\n    </p>\n              <p>\n      In return, Poka benefits from Aveva's market reach and extensive customer base for a faster commercial deployment. '<span>Our partnership gives us global reach within our target markets and provides value to our joint customers by offering them a more complete path to digital transformation</span>.' Alex Leclerc, co-founder and CEO Poka.\n    </p>\n              <h4>\n      Aveva Teamwork leverages Poka's solution to provide customers enhanced digitization of knowledge\n    </h4>\n              <p>\n      AVEVA Teamwork leverages lean manufacturing practices to manage and deliver training content to the workforce. Managers can easily create and deliver workforce training using the modern and visual interface.\n    </p>\n              <p>\n                <a href=\"https://www.poka.io/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Poka</a> is a connected worker platform built specifically for manufacturers. The company's mission is to provide a hub for operational knowledge in factories by empowering workers to learn, share and collaborate right from the production floor.\n    </p>\n              <p>\n      Using Poka, Aveva Teamwork enables instant access to the records of all past actions previously performed by peers to solve abnormal situations through a user-friendly app. The solution fosters digital collaboration across the workforce that can proactively communicate through a social media-type interface and solve problems while recording their resolution in a digital library.\n    </p>\n              <p>\n      While Poka brings its best-in-class solution to Aveva's software suite, they have also accelerated their time to market. '<span>The integration of Poka's solution was seamless and enabled us to commercialize a lot faster than if we had tried to build the solution inhouse.</span>' John Krajewski, Product Director Aveva.\n    </p>\n              <h4>\n      A win-win startup partnership story\n    </h4>\n              <p>\n      Schneider Electric invested in the Canadian startup through our corporate venture fund, SE Ventures. At SE Ventures, we look for partnership opportunities with our lines of business to help portfolio companies scale and drive innovation within Schneider Electric. Due to the synergies with AVEVA, a commercial agreement was formed in November 2020.\n    </p>\n              <p>\n      Grant Allen, General Partner at SE Ventures, explained, '<span>The systems used to capture and share knowledge in commercial production facilities are largely outdated or non-existent, leaving workers without the necessary training and real-time information to be in sync and operating at peak efficiency.</span> Poka is bringing plants into the digital age and, together with Schneider Electric's and AVEVA's global reach, can deliver needed frontline connectivity, knowledge transfer, safety and business continuity.'\n    </p>\n              <p>\n      Aveva's and Poka's partnership illustrates the mutual benefits collaborations with innovative startups can yield. At Innovation at the Edge, we scout the world to invest in and partner with top-tier startups to enhance our customer offers, drive innovation, and create new businesses for Schneider Electric.\n    </p>\n              <p>\n      To learn more about Innovation at the Edge, <a href=\"https://www.se.com/ww/en/about-us/ventures/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">visit our website</a>.<br/>\n       To learn more about AVEVA Teamwork, <a href=\"https://www.aveva.com/en/products/aveva-teamwork/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">visit the website</a>.\n    </p>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://blog.se.com/innovation/2021/05/06/aveva-partners-with-poka/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Schneider Electric SE</strong> published this content on <strong>06 May 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>06 May 2021 15:27:36 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Schneider Electric SE</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Schneider-Electric-SE</p></div>"}