{"date": "2022-01-06 08:46:17.001000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3350.44, "close": 3265.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Today, it might be used in more mundane ways, such as checking the weather and sports scores, and helping with minor trivia queries: \"Alexa, how many cups in a quart?\" But the original inspiration for Amazon's ubiquitous all-hearing Internet sage was the talking computer on the Starship Enterprise, which helped Captain Kirk navigate the cosmos on \"Star Trek.\"</p><p>Now, Alexa may soon be going to space in reality.</p></div><div class=\"tr-npp-body\"><p>Lockheed Martin, which is building the Orion spacecraft that NASA hopes will fly astronauts to the moon within a couple of years, is partnering with Amazon to put an Alexa on the capsule.</p><p>The device would give astronauts real-time information on telemetry, the health of the spacecraft and its speed. And, yes, they might utter something along the lines of: \"Alexa, how far to the moon?\"</p><p>Astronauts would be able to get information about their water supply or battery levels, even change the temperature or color of the lights in the crew module, the companies said. (Amazon founder Jeff Bezos owns The Washington Post.)</p><p>It would be possible \"for astronauts to ask for near real-time data about the spacecraft, the mission, the subsystems,\" Aaron Rubenson, Amazon's vice president for Alexa, said in a briefing. \"What speed are we going on? More importantly, from the crew perspective: What's the time to the next [engine] burn? What's that alarm that just went off? Remind me what that is.\"</p><p>In addition to Alexa, the Orion spacecraft will be outfitted with screens that display Webex by Cisco, the communications platform that, like Zoom, allows users to see each other and share critical information.</p><p>Taken together, the package, known as Callisto, would help translate different languages so astronauts from all over the world could communicate. It would also help controllers on the ground share information over a screen, the way company offices communicate remotely.</p><p>The system would \"make sure that the distance does not become a barrier to how people can collaborate when there's something that goes wrong,\" said Jeetu Patel, executive vice president at Cisco.</p><p>The platform would also help in \"overcoming isolation\" by allowing astronauts to \"stay and feel connected to their home and to their family members and their friends,\" Patel said. \"And we just want to make sure that this becomes a seamless kind of assumed capability that's there, even in space, where people can see and talk to each other at any point in time and interact and collaborate with each other.\"</p><p>The onboard space Alexa would not be connected to the Internet but instead connect directly to Orion's computer and its own onboard cloud, which would allow it to monitor the health of the spacecraft.</p><p>Still, it could send queries back to Earth and connect with the cloud to retrieve all sorts of information, such as news, that would help astronauts to feel less lonely.</p><p>There would be a lag in those queries since data would have to travel from the spacecraft to Earth and then from Earth to the spacecraft.</p><p>The system is slated to launch on NASA's Artemis I mission, now scheduled for March at the earliest, that would send the Orion spacecraft into orbit around the moon. While that flight would not have astronauts onboard, engineers would test Callisto by monitoring it on the ground as well as by keeping tabs on it with cameras inside the spacecraft.</p><p>\"This is all about testing it on this flight, seeing if it's valuable,\" said Rob Chambers, Lockheed Martin's director of civil space strategy. \"And then we can assess how it can be used as we move forward, not just on Orion, but in habitats, rovers, any number of other applications that we're actively looking at.\"</p><p>christian.davenport@washpost.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 The Washington Post</p></div>"}