{"date": "2021-11-17 10:49:15.781000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><a href=\"https://www.independent.co.uk/topic/alexa\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Alexa</a> has been listening to you. And now you can listen to yourself.</p><p>The company's <a href=\"https://www.independent.co.uk/topic/echo\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Echo</a> speakers have come under scrutiny in recent weeks for the way they collect recordings as people speak to them, and the way those recordings are used.</p></div><div class=\"tr-npp-body\"><p>They can often document very personal and intimate moments, since the <a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> Echo tends to sit in the home.</p><p>But you can listen to those moments – and, perhaps more importantly, delete them so that they cannot be stored by Amazon and to give you peace of mind.</p><p>Most likely, the majority of the recordings will be very dull, though listening to them can give you some idea of the kinds of things that are picked up by your speaker.</p><p>Listening to the recordings is straightforward, and Amazon is transparent about them, even if the option to find them in the first place might not be entirely obvious. You can get to the relevant page by clicking <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Falexaprivacysettings\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a> and signing in; on the Alexa app, you can click through to settings, pick \"Alexa Privacy\", and then choose \"Review Voice History\".</p><p>The most useful part of this feature is the ability to delete them. This is done very simply: choose the relevant \"date range\" from the picker, and then chose \"Delete All Recordings\". If you want to get rid of everything, pick \"All History\".</p><p>The issue has been highlighted by recent articles, including <a href=\"https://www.washingtonpost.com/video/business/technology/alexa-has-so-many-recordings-of-me-i-made-a-song-out-of-them/2019/05/06/769ba170-2ba3-454b-a52b-79a8504d1927_video.html?utm_term=.82ffda188192\" data-type=\"url\" class=\"tr-link\" translate=\"no\">one by the Washington Post</a> , in which one reporter was able to collect so many recordings from his Alexa speaker that he could create a song out of them.</p><p>The issue has become more prominent since it emerged that people were being hired by Amazon to listen through recordings, which might include snapshots of your most personal moments. Amazon says the recordings are being taken to improve the service and that staff are not listening to pry, but it is a reminder of the fact that not everything you say to Alexa is necessarily kept between the two of you.</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/life-style/gadgets-and-tech/news/amazon-alexa-echo-listening-spy-security-a8865056.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon admits employees listen to audio from Echo devices</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Independent, The (UK) (Online). All rights reserved.</p></div>"}