{"date": "2022-02-08 14:11:10.684000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NOMAD RTY CO LTD (\"NSR-TN;NSRWF-0\")\n- Latest Report Projects $2 Billion Optical Satcom Market Driven by\n- Non-GEO Constellations\n\n     NSR's newly released Optical Satellite Communications, 4th Edition\n(OSC4) projects a $2 Billion Optical Satcom market for equipment, driven\nprimarily by upcoming Non-GEO constellations. As Optical Satcom growth\ntrends upwards at a 47% CAGR, projected demand reaches 6,000+ laser\ncommunication terminal (LCT) units over the next decade.\n\n     Optical Satcom is situated to significantly impact both core\ncommercial Satellite Applications industries- Communications and Earth\nObservation. LCTs enable transition into higher bandwidth services for\nsatcom and deliver a robust backbone network for backhaul and trunking\nservices via mesh connectivity and lower latency. Similarly, Optical\nofferings provide high bandwidth pipes for data downlink, meeting next\ngeneration Earth Observation satellite demands as increasing sensor\nresolution and ever more satellites lead to need for higher data rates for\ndownload.\n\n     \"While the Optical Satcom market sits on the cusp of growth, there is\nstill a long road ahead,\" states report co-author Shivaprakash\nMuruganandham. \"Few vendors have production facilities with high volume LCT\nmanufacturing capabilities, and even fewer have legacy hardware.\" Pricing\nalso remains a challenge, given current low order volumes,\" Muruganandham\nadds. \"Yet, significant growth is on the horizon with constellation\nlaunches driving demand in the near to mid-term.\"\n\n     \"Short term adoption of Optical in Earth Observation will be driven by\nmany operators, with some focused on interoperability with the U.S. Space\nDevelopment Agency's constellation, for instance,\" notes report co-author\nPrachi Kawade. \"Data relay service providers also have a role to play here\nin the initial phases of adoption. Standardization will further the case\nfor this market as modularity of terminals and inter-operability bring\nimproved flexibility for spacecraft.\"\n\n     In the near-term, opportunity is equipment-centric; however, as more\nLCT-equipped satellites launch, market potential expands. The foundations\nare being laid for future satcom and relay services, such as with quantum\ncommunications and low latency downlink, creating a strong long-term\noutlook.\n\n     About the Report\n\n     NSR's Optical Satellite Communications, 4th Edition (OSC4) report is\nthe only industry report to analysis the evolving space-based laser\ncommunication ecosystem, taking a deep dive into key demand drivers and\nrestraints, for both space-to-space and space-to-ground links types. OSC4\nprovides a comprehensive evaluation of the market, exploring the role of\nOptical satellite communications in the Satellite Constellations &amp;?Earth\nObservation downlinks and data relay markets.\n\n     For additional information on this report, including a full table of\ncontents, list of exhibits and executive summary, please visit www.nsr.com\nor call NSR at +1-617-674-7743.\n\n     Companies and Organizations Mentioned in?NSR's OSC4\n\n     Airbus, Amazon, Hedron, Archangel Lightworks, Astrogate Labs, Atlas\nSpace Operations, AxelSpace, Ball Aerospace &amp; Technologies Corp, BlackSky,\nBridgecomm, Cailabs, Capella Space, Centre Nationale d'Etudes Spatiales\n(CNES), Chang Guang Satellite Technology, Cloud Constellation, DARPA, DLR,\nEdmund Optics, EOSDS, European Space Agency (ESA), General Atomics, GHGSat,\nGomSpace, Honeywell, ICEYE, Inmarsat, JAXA, KSAT, KTSat, L3-Harris, Laser\nFleet, LaserLight Communications, Lockheed Martin, Maersk, Lyteloop,\nmBryonics, MDA, Momentus Space, Mynaric AG, NASA, NCKU Tainan, Nokia Bell\nLabs, Odysseus Space, Planet, Planewave Instruments, QinetiQ, RBC Signals,\nRocket Lab, Sinclair Interplanetary, SKY Perfect JSAT, Skyloom, Sony CSL,\nSpace Development Agency (SDA), Space Micro, Space Union, Spacebelt,\nSpaceLink, SpaceX, SpeQtral Communications, Spire, SSC, Starlight Ventures,\nSynspective, Telesat, TESAT-Spacecom, Thales Alenia Space, TNO,\nTranscelestial Technologies, U.S. Air Force Research Lab, U.S. Space Force,\nWarpspace, X-Lumin, Xenesis\n\n     About NSR\n\n     NSR is the leading global market research and consulting firm focused\non the satellite and space sectors, NSR's global team, unparalleled\ncoverage and anticipation of trends with a high degree of confidence and\nprecision than the competition is the cornerstone of all NSR offerings.\nFirst to market coverage and a transparent, dependable approach sets NSR\napart as the key provider of critical insight to the satellite and space\nindustries.\n\n     Contact us at info@nsr.com to discuss how we can assist your business.\n\nContact:\nKristen Kloster-Grady\nNSR Marketing Director\nKKloster@NSR.com\n\nTel   : 438-538-7555    NOMAD RTY CO LTD\nEmail : vmetcalfe@nomadroyalty.com\nWWW   : <a href=\"https://www.nomadroyalty.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.nomadroyalty.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203800062.MNPRE2203801210-05564120220208</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}