{"date": "2021-12-20 19:40:14.016000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon has teamed up with Barclays to offer its customers a flexible payment service, called Installments by Barclays, in the UK.</p><p>This method helps customers in the country to finance purchases of £100 or more made on Amazon ecommerce site.The reusable credit account can be used by customers on purchases of products, including those from small and medium businesses selling on Amazon.Instalments by Barclays allows Amazon customers to pay for their purchases through financing options on terms between three and 48 months.The first-time users are required to choose their option of instalment plan from available term options at Amazon checkout, following which they need to fill an online application.In most cases, Amazon customers will get an immediate response from Barclays that allows them to check if their application has been approved and later get to know their spending limits.The lending is completed regulated by the FCA. Barclays conducts credit and affordability checks so that customers are not given access to more credit than they can afford.Once approved, the reusable credit account is added to customers' wallet and is available at checkout while shopping on Amazon. This enables customers to go for repeat purchases without requiring them to reapply, as long as they stay within their credit limit and monthly payment limit.Payments get automated via Direct Debit, thereby enabling customers with an easy way of paying for their purchases on time. Furthermore, the account can be managed directly through the Barclays App and a customer is not required to bank with Barclays.Barclays provides this credit account at an APR of 10.9% for purchases on Amazon, with no account management fees, late fees, statement fees, or other hidden fees.However, Instalments by Barclays facility is not available for orders featuring Amazon Gift Cards, digital products, groceries, pre-sale products and out-of-stock products. Furthermore, the minimum spend for each order is £100.Amazon UK head of instalment lending Rob Levy said: \"Every day we strive to innovate on behalf of our UK customers. Instalments is one way we will offer customers flexible options, enabling them to choose to pay now or split the cost of larger purchases into budget-friendly monthly instalments.\"This is a simple and transparent service from Barclays that automates monthly payments, providing greater comfort for customers making bigger purchases.\"Barclays Cubed &amp; Consumer Bank Europe head Ruchir Rodrigues said: \"This is another major step in our ambition to reinvent payments at the point-of-sale and delight customers.\"Amazon offers a world-class shopping experience, and this new service gives users a fully reusable payment-by-instalments option, which they can use to spread the cost of purchases over a longer period.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}