{"date": "2021-11-22 22:12:07.599000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MOTORSPORT GAMES INC (\"MSGM-Q\")\n- To Participate in the Canaccord Genuity 2021 Digital Gaming\n- Summit Conference\n\n     Motorsport Games Inc. (\"Motorsport Games\"), a leading racing game\ndeveloper, publisher and esports ecosystem provider of official motorsport\nracing series throughout the world, today announced that Dmitry Kozko,\nChief Executive Officer, and Stephen Hood, President, will participate in a\nfireside chat at the Canaccord Genuity 2021 Digital Gaming Summit\nConference on Tuesday, November 30th, 2021 at 1:00 PM ET.\n\n     Participants may access a live webcast of the fireside chat on the\nMotorsport Games Investor Relations site <a href=\"https://ir.motorsportgames.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://ir.motorsportgames.com</a>/\nunder \"Events &amp; Presentations.\" A replay will be archived online for one\nyear. For further information, please contact a Canaccord Genuity\nrepresentative.\n\n     About Motorsport Games:\n\n     Motorsport Games, a Motorsport Network company, combines innovative\nand engaging video games with exciting esports competitions and content for\nracing fans and gamers around the globe. The Company is the officially\nlicensed video game developer and publisher for iconic motorsport racing\nseries, including NASCAR, INDYCAR, 24 Hours of Le Mans and the British\nTouring Car Championship (\"BTCC\"), across PC, PlayStation, Xbox, Nintendo\nSwitch and mobile. Motorsport Games is an award-winning esports partner of\nchoice for 24 Hours of Le Mans, Formula E, BTCC, the FIA World Rallycross\nChampionship and the eNASCAR Heat Pro League, among others. For more\ninformation about Motorsport Games, visit www.motorsportgames.com.\n\n     Forward-Looking Statements:\n\n     Certain statements in this press release which are not historical\nfacts are forward-looking statements within the meaning of Section 27A of\nthe Securities Act of 1933, as amended, and Section 21E of the Securities\nExchange Act of 1934, as amended, and are provided pursuant to the safe\nharbor provisions of the Private Securities Litigation Reform Act of 1995.\nAny statements in this press release that are not statements of historical\nfact may be deemed forward-looking statements. Words such as \"continue,\"\n\"will,\" \"may,\" \"could,\" \"should,\" \"expect,\" \"expected,\" \"plans,\" \"intend,\"\n\"anticipate,\" \"believe,\" \"estimate,\" \"predict,\" \"potential,\" and similar\nexpressions are intended to identify such forward-looking statements. These\nforward-looking statements include, but are not limited to, statements\nconcerning the expected future impact of new or planned products, features,\nofferings or events, and the timing of launching such products, features,\nofferings or events. All forward-looking statements involve significant\nrisks and uncertainties that could cause actual results to differ\nmaterially from those expressed or implied in the forward-looking\nstatements, many of which are generally outside the control of Motorsport\nGames and are difficult to predict. Examples of such risks and\nuncertainties include, but are not limited to difficulties, delays in or\nunanticipated events that may impact the timing and scope of new product\nlaunches, such as due to delays and higher than anticipated expenses\nrelated to the ongoing and prolonged COVID-19 pandemic. Factors other than\nthose referred to above could also cause Motorsport Games' results to\ndiffer materially from expected results. Additional factors that could\ncause actual results to differ materially from those expressed or implied\nin the forward-looking statements can be found in Motorsport Games' filings\nwith the SEC, which may be found at www.sec.gov and at\nir.motorsportgames.com, including its Annual Report on Form 10-K for the\nfiscal year ended December 31, 2020, its Quarterly Reports on Form 10-Q\nfiled with the SEC during 2021, as well as in its subsequent filings with\nthe SEC. Motorsport Games anticipates that subsequent events and\ndevelopments may cause its plans, intentions and expectations to change.\nMotorsport Games assumes no obligation, and it specifically disclaims any\nintention or obligation, to update any forward-looking statements, whether\nas a result of new information, future events or otherwise, except as\nexpressly required by law. Forward-looking statements speak only as of the\ndate they are made and should not be relied upon as representing Motorsport\nGames' plans and expectations as of any subsequent date. Additionally, the\nbusiness and financial materials and any other statement or disclosure on,\nor made available through, Motorsport Games' website or other websites\nreferenced or linked to this press release shall not be incorporated by\nreference into this press release.\n\n     Website and Social Media Disclosure:\n\n     Investors and others should note that we announce material financial\ninformation to our investors using our investor relations website\n(ir.motorsportgames.com), SEC filings, press releases, public conference\ncalls and webcasts. We use these channels, as well as social media and\nblogs, to communicate with our investors and the public about our company\nand our products. It is possible that the information we post on our\nwebsites, social media and blogs could be deemed to be material\ninformation. Therefore, we encourage investors, the media and others\ninterested in our company to review the information we post on these\nwebsites, social media channels and blogs, including the following (which\nlist we will update from time to time on our investor relations website):\n\n//st\n\n         Websites              Social Media\n\n         motorsportgames.com   Twitter: @msportgames &amp; @traxiongg\n\n         traxion.gg            Instagram: msportgames &amp; traxiongg\n\n         motorsport.com        Facebook: Motorsport Games &amp; traxiongg\n\n                               LinkedIn: Motorsport Games\n\n                               Twitch: traxiongg\n\n                               Reddit: traxiongg\n\n//et\n\n     The contents of these websites and social media channels are not part\nof, nor will they be incorporated by reference into, this press release.\n     Investors:\nAshley DeSimone\nAshley.Desimone@icrinc.com\n<a href=\"https://www.motorsportgames.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.motorsportgames.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132500577.MNPRE2132503043-13493320211122</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}