{"date": "2021-03-18 12:23:28.348000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3434.0, "close": 3410.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>ENPNEWSWIRE-(C)2021 ENPUBLISHING</p><p>Release date- 16032021 - Shell's Veteran Strategist, Brent Kedzierski Advocates Mass Personalization and Greater Workforce Collaboration as Keys to Industry 5.0.</p></div><div class=\"tr-npp-body\"><p>AVEVA, a global leader in engineering and industrial software, and the Shell Oil Company joined forces to discuss the future of Smart Production recently. Brent Kedzierski, Head of Learning Strategy and Innovation at Shell, and AVEVA's Vice President for Process &amp; Simulation, Ian Willetts, explored how more personalized solutions will empower workers to take greater control over their work experiences creating, more adaptive, on demand experiences which will increase worker confidence, resulting in greater workforce creativity, autonomy and performance. According to Kedzierski, 'Industry 5.0 will be characterized by mass personalization and greater workforce collaboration.'</p><p>Human Intelligence to Work in Harmony with Cognitive Computing Capabilities</p><p>The discussion highlighted the need to accelerate the movement to better blend Industry 4.0 connected technologies with the humanistic practices and expectations of Industry 5.0 to deliver even more personalized worker experiences characteristic of higher concept and touch designs. 'Combining the power of Industry 4.0 connected technologies with the human element of Industry 5.0 will pave the way for human intelligence to work in greater harmony with cognitive computing capabilities,' says Kedzierski.</p><p>While Industry 4.0 was about smart production, IoT, sensors and drones, the discussion highlighted that Industry 5.0 will be differentiated by mass personalization and experience design. Kedzierski is hopeful that Industry 5.0 will be a turning point for the human condition at work as physical and environmental safety competence is mastered and industry can shift to addressing psychological safety. 'Industry 5.0 will offer greater opportunity, prosperity and sustainability for our workforce,' commented Kedzierski.</p><p>AI Infused Micro Learning will Pinpoint a Learner's Strengths and Weaknesses</p><p>The speakers agreed that the need of the hour is to make the operator training environments more mobile, on-demand and collaborative to drive personalized worker experiences. The goal is to have an OTS where operators can come and build their own training exercises and easily share, test, and even gamify those with their colleagues.</p><p>In this regard, Willetts revealed that AVEVA has now integrated operator training simulators with a learning management system (LMS) so that the competency set that must be developed as part of a classroom, lesson or experiential learning exercise can be managed and tracked by the LMS. 'We've also integrated AI infused micro learning that can build upon that learning profile and identify an individual's strengths and weaknesses,' Willetts said. 'We can also absolutely use the behavioral digital twin in experiential learning scenarios. The Digital Twin is not just a data representation of an asset, it provides insight and knowledge that helps companies better understand the behavior of the process.' Kedzierski added, 'We have witnessed this evolution reflected in the design of our operator training simulators (OTS) as well as the industry award winning behavioral based VR learning solution that Shell created with AVEVA for frontline staff.</p><p>Kedzierski concluded that delivering more personalized worker experiences as we progress is necessary to serve the new industrial agenda of achieving the goals of both the enterprise as well as the welfare of humans. 'Industry 5.0 will be about connecting human cognition, collaboration and creativity to smart production. Progress will be judged on not just the connection of data between the Internet of Things (IoT), but how connectivity enhances the human experience. The age of mass personalization will be about achieving large-scale impact, one individual at a time.'</p><p>'Working on projects with innovative companies such as Shell is placing AVEVA way ahead of the curve. Our mission is to help the people behind complex industrial processes with information and solutions that combine data, AI and smart analytics to optimize efficiency and will help to shape a sustainable future,' Willetts also concluded.</p><p>AVEVA OTS solutions combine dynamic process simulations, virtual control systems and replicated interfaces to match the look, feel and behavior of the actual plant - and can be deployed even before a plant is built. The high-fidelity simulation can expose control issues and procedure problems before start-up, so you can fix it fast and ramp from first feed to full production with no surprises.</p><p>About AVEVA</p><p>AVEVA is a global leader in engineering and industrial software driving digital transformation across the entire asset and operations life cycle of capital-intensive industries. The company's engineering, planning and operations, asset performance, and monitoring and control solutions deliver proven results to over 16,000 customers across the globe. Its customers are supported by the largest industrial software ecosystem, including 4,200 partners and 5,700 certified developers. AVEVA is headquartered in Cambridge, UK, with over 4,400 employees at 80 locations in over 40 countries. For more details visit: www.aveva.com</p><p>Copyright 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and products names are the trademarks of their respective companies.</p><p>Enquiries:</p><p>AVEVA Media Contacts</p><p>Rose Bambi</p><p>Senior Director Global PR and External Communications</p><p>Tel: +44 (0) 208 323 2789</p><p>rose.bambi@aveva.com</p><p>Caroline Stephens</p><p>Senior Global PR Manager</p><p>caroline.stephens@aveva.com</p><p>Catherine Singh</p><p>Global PR Executive</p><p>catherine.singh@aveva.com</p><p>External Communications Alias</p><p>external.communications@aveva.com</p><p>[Editorial queries for this story should be sent to newswire@enpublishing.co.uk]</p><p>((Comments on this story may be sent to info@enpublishing.co.uk))</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 M2 Communications Ltd.</p></div>"}