{"date": "2021-11-23 12:01:31.038000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">Federal Reserve Chair Jerome Powell gambled last year that his ultra-low rate policies would help revive an economy that had sunk deep into a pandemic-induced recession</p><p class=\"tr-npp-section-title\">Hedge fund Alden Global Capital, one of the country's largest newspaper owners with a reputation for intense cost cuts and layoffs, has offered to buy the local newspaper chain Lee Enterprises for about $141 million</p><p class=\"tr-npp-section-title\">Former President Barack Obama's foundation says it has received a $100 million donation from Amazon founder Jeff Bezos that it says is the largest individual contribution it has received to date</p><p class=\"tr-npp-section-title\">Shares have opened lower in Europe after a mixed session in Asia, as countries impose lockdowns and other restrictions to fight flare-ups of coronavirus cases</p><p class=\"tr-npp-section-title\">Prince Charles is set to be be on hand Tuesday when pharmaceutical company AstraZeneca opens a 1 billion-pound ($1.34 billion) research center near the University of Cambridge</p><p class=\"tr-npp-section-title\">Sales of previously occupied U.S. homes ticked higher in October, marking their strongest pace since January, even as resilient demand and competition for relatively few properties on the market kept prices climbing</p><p class=\"tr-npp-section-title\">Amazon says it plans to cut the use of plastic packaging in Germany following complaints that the online retailer is contributing to growing mountains of waste</p><p class=\"tr-npp-section-title\">The German military is poised to make coronavirus vaccines mandatory for troops as COVID-19 infections continue to rise across the country</p><p class=\"tr-npp-section-title\">U.S. Interior Secretary Deb Haaland met with state and tribal leaders Monday in northwestern New Mexico where a battle has waged for decades over oil and gas development</p><p class=\"tr-npp-section-title\">California Gov. Gavin Newsom has named his senior adviser on energy policy as the next president of the powerful state body that regulates utilities</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 The Associated Press.  All rights reserved. This material may not be published, broadcast, rewritten or redistributed.</p></div>"}