{"date": "2021-12-13 13:07:01.784000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}.storyContent .prnml40{MARGIN-LEFT:3.33em;}</style><div class=\"xn-newslines\"><p class=\"xn-distributor\">Canada NewsWire</p><p class=\"xn-dateline\">EDMONTON, AB, Dec. 13, 2021</p></div><div class=\"xn-content\"><p><b>The e-commerce giant will occupy a 100,000-square-foot facility in the heart of <span class=\"xn-location\">Ottawa's</span> Hawthorne Industrial Park and is expected to create approximately 100 new, full-time jobs.<br/></b></p><p><span class=\"xn-location\">EDMONTON, AB</span>, <span class=\"xn-chron\">Dec. 13, 2021</span> /CNW/ - Canadian Urban Limited is pleased to announce the finalization of a new lease with Amazon Canada Fulfillment Services, ULC (\"Amazon\"). </p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p title=\"Canadian Urban Limited announces new Amazon lease for Delivery Station in Ottawa, Ontario\"></p></div><p>The more than 100,000 square foot facility is located in the Hawthorne Industrial Park, which is approximately 10 kilometres southeast of <span class=\"xn-location\">Ottawa's</span> central business district. The property is 100% occupied by Amazon and will serve as its delivery station facility in the Ottawa metropolitan area. The Amazon delivery station facility will include contemporary robotics technology, inventory and shipping operations making it a state-of-the-art logistics facility in the <span class=\"xn-location\">Ottawa</span> region. </p><p>The property benefits from its proximity to key transportation routes, including Highway 417 (Trans-Canada Highway) providing ideal access for Amazon's logistics operations. The property features a low site coverage ratio of 23% with the additional 2.5 acres of excess land being contemplated for use as added parking and drive surfaces.</p><p class=\"prnml40\" id=\"indentid\">\"<span>We are very pleased to have secured Amazon as a tenant and business partner in our <span class=\"xn-location\">Ottawa</span> portfolio. The Canadian Urban team invested months into this deal which included successfully executing an early lease surrender with our prior tenant, and subsequent negotiation of a lease with Amazon that met the needs of both the Landlord and Tenant. Considerable capital improvements were completed at this property, positioning it to become a state-of-the-art facility servicing the <span class=\"xn-location\">Ottawa</span> market.\" </span>said<span><b><span class=\"xn-person\">Sorab Gill</span>, Assistant Vice President, Asset Management, Canadian <span class=\"xn-person\">Urban Limited</span></b></span></p><p class=\"prnml40\" id=\"indentid\"><span>\"Our team has certainly benefited in having a strong industrial presence in growth markets. We expect the industrial property sector to continue to be buoyant in this market, particularly those assets that meet the needs of logistics-focused organizations. This transaction highlights Canadian Urban's proven ability to add value with the aim of delivering superior risk-adjusted returns for our investors.\" said <b><span class=\"xn-person\">Jay Hamilton</span>, President, Canadian <span class=\"xn-person\">Urban Limited</span></b></span></p><p>Amazon continues to pursue continued expansion of its distribution network across <span class=\"xn-location\">Canada</span>. Once complete, this facility will employ approximately 100 full-time workers.</p><p class=\"prnml40\" id=\"indentid\"><span>\"We are excited to continue our growth in <span class=\"xn-location\">Ontario</span> with a new delivery station in <span class=\"xn-location\">Ottawa</span>. This new delivery station will allow us to provide fast and efficient delivery for customers and creates approximately 100 job opportunities for the talented local workforce,\" </span>said Amazon Canada last mile logistics operations regional director <b>Jasmin Begagic. </b></p><p>In addition to creating permanent and seasonal, full-time and part-time jobs, entrepreneurs also have the opportunity to build their own small business delivering Amazon packages, and independent contractors the flexibility to be their own boss and create their own schedule delivering for Amazon Flex. To learn more, visit <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3386740-1&amp;h=4051386068&amp;u=http%3A%2F%2Fwww.logistics.amazon.com%2F&amp;a=www.logistics.amazon.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.logistics.amazon.com</a> and <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3386740-1&amp;h=65202181&amp;u=https%3A%2F%2Fflex.amazon.com%2F&amp;a=https%3A%2F%2Fflex.amazon.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://flex.amazon.com</a>.</p><p><b>About Canadian <span class=\"xn-person\">Urban Limited   </span></b></p><p>Canadian Urban is an innovative and disciplined real estate investment manager with a 50-year history and a diverse and strategic portfolio of industrial, office, retail, and multi-family properties across <span class=\"xn-location\">Canada</span>. Canadian Urban delivers on its track-record of achieving superior risk-adjusted returns for institutional and private wealth clients through its entrepreneurial spirit, ability to respond quickly, long-term relationships and keen market insights. Its clients include major pension funds, endowment funds and select private wealth clients. Canadian Urban offers its clients services including Investment Management, Asset Management, Property Management, Development and Sustainability. To learn more, visit <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3386740-1&amp;h=4185499376&amp;u=http%3A%2F%2Fwww.canadianurban.com%2F&amp;a=www.canadianurban.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.canadianurban.com</a> or follow Canadian Urban on <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3386740-1&amp;h=4024813248&amp;u=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fcanadian-urban-limited%2Fmycompany%2F&amp;a=LinkedIn\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LinkedIn</a>.</p><p><b>Legal disclaimer and forward-looking statements:</b></p><p>This communication is for information purposes only and is not, and under no circumstances is to be construed as, an invitation to make an investment in any investment vehicles managed by Canadian <span class=\"xn-person\">Urban Limited</span>. Past performance may not be repeated. Investing in real estate involves significant risks and the value of an investment may go down as well as up. There is no guarantee of performance. An investment in Canadian Urban's investment funds is not intended as a complete investment program and should only be made after consultation with independent investment and tax advisors.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\"><p>SOURCE  Canadian <span class=\"xn-person\">Urban Limited</span></p><div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><p></p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=C9186&amp;sd=2021-12-13\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1DOTE4NiZzZD0yMDIxLTEyLTEz&amp;key=3afa91dd76eb269b5b847e44670008ef3c7b471a2da895f94daa42e74b96115520892fc1d78306258a0f9e3705ace2a1fa4c9923c6def30d4d09a82c24e3b147\"/></div></div> View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/December2021/13/c9186.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/December2021/13/c9186.html</a><p></p></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright CNW Group Ltd. 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: CanadianUrban-Amazon</p></div>"}