{"date": "2022-02-05 01:59:04.109000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2776.91, "close": 3158.71}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\"><p>Recap: Asian equities steadied while Wall Street futures rebounded on Friday after an earlier tech rout, encouraged by better-than-expected earnings from Amazon. The European Central Bank's hawkish stance hurt stocks in Europe.</p><p>The SET index moved in a range of 1,646.88 and 1,678.72 points this week before closing yesterday at 1,674.22, up 2.12% from the previous week, in low daily turnover averaging 65.94 billion baht.</p><p>Foreign investors were net buyers of 2.28 billion baht, institutional investors bought 1.</p><p>61 billion and brokerage firms purchased 1.34 billion baht worth of shares.</p><p>Retail investors were net sellers of 5.23 billion baht.</p><p>Newsmakers: Top oil-producing countries led by Saudi Arabia and Russia announced another modest increase in output on Wednesday despite soaring crude prices and geopolitical tensions rattling markets. Body BulletsThe 26.4% plunge in shares of Facebook parent Meta Platforms erased $230 billion in market value, the biggest one-day loss in history for a US company, after it reported a sharper than expected drop in profit, a decrease in users and threats to its ad business.</p><p>Body BulletsShares of Spotify tumbled on Wednesday after the music streaming service -- embroiled in controversy over star podcaster Joe Rogan -- projected lower profit margins in the coming earnings period as subscriber growth slows. Body BulletsWorld food prices rebounded in January and remained near 10-year highs, led by a jump in the vegetable oils index, the UN Food and Agriculture Organization said on Thursday.</p><p>Body BulletsFactory activity in China edged down in January, official figures showed, but slightly exceeded expectations as businesses struggled with sporadic disruptions due to coronavirus outbreaks. Body BulletsUS labour authorities have filed a complaint accusing the e-commerce giant Amazon of using threats and surveillance against its workers trying to organise a union at a New York City warehouse.</p><p>Body BulletsHackers may have stolen up to $320 million worth of cryptocurrency from decentralised finance blockchain networks after Wormhole, a communication channel linking them, was breached. Wormhole said \"all funds are safe\" but gave no other details.</p><p>Body BulletsThe Thai economy is likely to start recovering in the first half of this year thanks to the government's better control of Covid-19 infections, economic stimulus measures and accelerated infrastructure development. Body BulletsThe four phases of the government's \"Khon La Khrueng\" co-payment subsidy scheme are expected to inject almost 400 billion baht into the economy, says the Fiscal Policy Office.</p><p>Body BulletsConsumer prices topped forecasts with a 3.2% rise in January, reflecting high oil prices.</p><p>The Joint Standing Committee on Commerce, Industry and Banking expects inflation to average between 1.5% and 2.</p><p>5% this year, after rising as high as 3% in the first quarter. Body BulletsThe government expects cross-border trade to grow by 5-7% to between 1.</p><p>08 trillion and 1.1 trillion baht this year, driven by the global recovery, economic and demand growth in neighbouring countries, as well as the baht's weakness.</p><p>Body BulletsRice exporters forecast shipments will rise 14.8% this year to 7 million tonnes, driven by sufficient water supply. Body BulletsCovid-linked curbs on economic activity last year caused Thai fuel consumption to decline by 3.</p><p>5% to an average of 133 million litres a day, down from 138 million in 2020, according to the Department of Energy Business. Body BulletsThe Energy Policy Administration Committee (Epac) says that only diesel blended with 5% palm oil-derived methyl ester will be sold at petrol stations from today, instead of the 7% formula, as it is struggling to deal with soaring global oil prices.</p><p>Body BulletsThe combined value of foreign and local applications for investment promotion in 2021 tallied 643 billion baht, an increase of 59% from a year before, led by technology and more projects in the bio-, circular and green (BCG) industries, as well as a continued push in power generation sector, the Board of Investment reported. Body BulletsThe Tourism and Sports Ministry plans to continue travel bubble discussions with short-haul destinations in the region.</p><p>Foreign tourist arrivals could top 5 million this year, The Tourism Council of Thailand said, resumption of the Test and Go scheme for vaccinated travellers this week. Body BulletsThe Bank of Thailand plans to allow commercial banks to obtain more than one licence, including a planned virtual bank licence, to pave the way for the expansion of the digital economy.</p><p>Body BulletsThe Bank of Thailand plans to allow banks to invest more than the current limit of 3% of their capital funds in fintech, except in digital assets, an assistant governor said on Tuesday. Body BulletsSome 2.</p><p>5 billion baht will be set aside for digital development projects to be financed by the Digital Economy and Society Development Fund in fiscal 2022, according to DE Minister Chaiwut Thanakamanusorn. Body BulletsA royal decree aimed at waiving capital gains tax for investment in startups is expected to come into force by the first quarter of this year.</p><p>Body BulletsHigher inflation, a labour shortage and rising fuel and construction material prices will drive new home prices higher after the housing price index kept declining since the first quarter of 2020. Body BulletsGulf Energy Development Plc has been granted a licence to import more liquefied natural gas (LNG), bringing the total volume to 6.37 million tonnes a year, as it forges ahead to become a major trader in Thailand's LNG market after its liberalisation.</p><p>Body BulletsAdvanced Info Service (AIS), the country's largest mobile operator by subscribers, has signed a cooperation deal with Gulf Energy Development and Singapore Telecommunications (Singtel) to enter the data centre business in Thailand. Body BulletsTotal Access Communication Plc (DTAC), the country's third biggest mobile operator by subscriber base, reported a 3.</p><p>2% year-on-year rise in total revenue to 81.3 billion baht in 2021, supported by the reopening of its shops from September and an easing of Covid restrictions. Coming up: Australia will release January retail sales on Monday, Japan will release December household spending and the US and Canada will release December trade figures.</p><p>Body BulletsThe Reserve Bank of India will announce its interest rate decision on Wednesday. Germany will release December trade balance.</p><p>Britain will release fourth-quarter GDP on Thursday, the US will announce January core CPI and Opec will release its monthly production update. Body BulletsThe US will release the January federal budget balance and February consumer expectations and sentiment on Friday.</p><p>Britain will release third-quarter business investment, December industrial and manufacturing production and trade. Stocks to watch: SCB Securities recommends allocating 50% of one's portfolio to stocks with good profits and those that benefit from a reopening theme including KBANK, GPSC, SPALI, AMATA, LH, GULF, DELTA, ADVANC, ONEE, CRC and MINT.</p><p>Stocks expected to report good Q4 2021 results include BDMS, IVL and BLA. Good fundamental stocks expected to rebound are HANA, KCE, ACE, SYNEX and SINGER.</p><p>Country Group Securities recommends retail stocks expected to benefit from economic stimulus, such as BJC, CRC, CPALL and HMPRO, and CPN for department stores. Baht depreciation will benefit export stocks such as TU.</p><p>The Test and Go scheme will also support AOT, MINT and SPA. Column Body FirstTechnical view: Thanachart Securities sees support at 1,656 points and resistance at 1,696. DBS Vickers Securities sees support at 1,640 and resistance at 1,690.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Bangkok Post</p></div>"}