{"date": "2021-11-04 05:59:26.308000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_93vzimwk&amp;referenceId=6280176367001_B25&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_93vzimwk&amp;referenceId=6280176367001_B25&amp;pageId=RefinitivNewscasts</a></pre>Source: Refinitiv powered by Real Vision<br/><br/>Description: This week Real Vision’s Roger Hirst uses Refinitiv’s best-in-class data to look at the data behind the inflation headlines that looks robust but is starting to head in the wrong direction. Wages are rising at a slower pace than prices, whilst many goods are no longer affordable. Demand could become severely restricted if policy makers tighten too early. And yet that is what markets are starting to price into the front end of the rates curves and this increases the risk of an unexpected move in bond yields.<br/>Short Link: <a href=\"https://refini.tv/3nVEHk7\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3nVEHk7</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; One of the questions that many people are asking at the moment is whether the inflation data is hiding an economy that's beginning to struggle. Pandemic-related supply chain issues may have disguised a significant drop in global activity, which could be impacted further by higher prices strangling consumption. In this week's Big Conversation, we look for signs that growth is slowing as inflation source. The recent price is paid component of the ISM report has again moved higher, indicating the ongoing inflationary pressures. At the same time, we are now starting to see a divergence in the key new orders component. This data point is still strong, but it's dropped to the lowest level in over a year. Higher input prices can often lead a softening in manufacturing data. Chinese manufacturing data has been leading global data. While there's always some uncertainty around these releases, the dropping China's New Orders is significant moving deeper into contraction territory. We've highlighted on a number of occasions the problems of margin pressure, where producer prices have moved higher at a more rapid pace than consumer prices or wages. Corporate are struggling to pass these on, and the current difference between Chinese PPI and CPI is back at the 20-year highs. Global commodity prices are still edging high when we look at the broad-based commodity research board index. China's New Orders component suggests that commodities are not in tune with the demand from the world's largest consumer of raw materials. Obviously, one of the key global concerns is the energy crisis that's elevated natural gas prices and crude oil. In China, however, we have now seen some declines in the active coal futures contracts, which are more stunning than the price surges that we saw a few weeks ago. Several coal futures have fallen over 50 percent from the highs, and that was from a time when China was widely expected to bid up natural gas, which was in turn causing a panic in the UK and mainland Europe energy markets. Now, those issues and not over yet in a burst of cold weather across the northern hemisphere can still play havoc with the energy markets. But it's a sign that it was supply and not demand that was causing those issues. Another indication that this was a supply issue that's come from the copper market. Copper prices have been making new highs, but it was a sudden surge in spot prices relative to future prices that highlighted the problem with inventories. Enemy spot copper briefly surge 20 percent in a few days. The three-month contract also saw prices rise, but the impact was mainly a result of withdrawal from warehouses that saw the spread between the two, rising to a record level. Obviously, all these issues reflect underinvestment in extraction industries, including storage facilities for energy. These issues, they can't be overcome simply because new investment takes a long time to percolate through and to actually increase output. But there is now an increasing risk of a policy mistake as central banks capitulate because they see higher prices as a sign of high demand. Now, if demand is the primary culprit for high levels of inflation, the monetary policy is one tool that can be used to combat that. If however, higher prices are primarily due to supply, which is lagging demand, and that's because of supply chain issues, then tighten monetary policy will impact demand further, but have almost no impact on supply chains. Now this juncture, I should point out the demand has been strong, but that's because we've come off an extremely low base. Demand has seen a very powerful rebound, especially where demand-side policies were favored over supply-side policies. But this is a rebound. It's not yet a return to previous levels. In many places, demand is strong relative to supply, but it's supply where the real issue lies. If supply were to miraculously return to its pre-pandemic levels, then this would overwhelm the current level of demand, which has been artificially boosted by fiscal policy, where budget deficits had in many places like the US with 20 percent of GDP. Now clearl, y if these demand-side policies persist at a time where supply chains remain in a weakened state, then we will get persistence inflation. But the problem that we're seeing is that inflation is now impacting demand. The University of Michigan bind conditions for houses, for vehicles, and large household gerbils have reached record lows, and this has seen the sentiment indicator drop below the levels reached during the crash of 2020. The broader based conference board Consumer Confidence index has held up better, though the index has tended to ebb and flow with the equity market, which in the US is making new all-time highs. Confidence should probably be higher given the gains in the equity market. Policymakers have begun to rethink their strategy. The US Federal Reserve's favored measure of inflation is the quarterly employment cost index. This has reached levels not seen since the great financial crisis. Unfortunately, although wages are rising, they're not rising as quickly as inflation, although wages are in fact usually a more lagging inflation dataset. Now, real wages are therefore falling, which means that consumption will be impacted. Used car prices continue to make new record highs, but this is all about price and not volume, which is the story that's been repeated across the commodity sector and it's one of the reasons that many commodities, stocks, and economies are not performing as well today as they did a decade ago despite these higher prices. Additionally, if economies continue to normalize albeit slowly, then we will get an acceleration on the substitution effect away from goods which were lying commodities as a major input towards services which are less commodity reliant outside of the restaurant business. We currently have an outlook where demand is being constrained by price and the market is anticipating response where policymakers will tag demand by bringing forward the rate hiking cycles, and this will do very little to alleviate the supply chain issues. There, any declining demand will obviously help at the margin, but it's unlikely to be helpful for economic growth. Although the Fed have already had a discussion about tapering bond purchases, long-dated to bond yields have been relatively well-behaved. They benched higher, but in the US have not yet breached the years highs. The repricing has mainly come at the front end of the curve with some spectacular moves in the UK, Sweden, and Australia to name but a few. In Australia, the move higher in the three, a government bond yield was the fastest of the last decade after Governor Philip Lowe caved into pressure of rising yields and scrapping the nought 0.1 percent cap that's been in place since last year. Yield curve has started to flatten as we've seen with a two-year to 10-year portion of the UK government bond curve. Occurs regularly flatten and other risk assets can perform well when growth is leading the rise in two-year yields. On those occasions, inflation often lags growth. Today, however, with inflation that's hurting growth, before it's ever been able to build momentum, therefore, high yields and flattening curves are likely to become a drag on growth rather than reflect an increase in economic momentum. Should we be concerned that curves often flatten and invert ahead of recessions? Well, this process can take a long time to play out, with inversion, usually preceding recessionary event by 6-12 months. Therefore, we shouldn't be too concerned if yield curves are flattening today, although the circumstances today are very, very different from anything we've seen in the last 30 years. In fact, if we do get an aggressive flattening of interest rate curves, then the recent peak of the seasoning process will be the showers that we've seen in 30 years, having reached 150 basis points this year compared to over 250 basis points at the last three major peaks. One small section of the US curve between the 20-year and the 30-year yield has already marginally inverted, but that's probably an outlier. Now two weeks ago, we looked at the risks to the longer dated parts of the yield curve and there's very few analysts, including some of the committed bombards were expecting long dated yields such as the 10-year to move significantly above two percent because of the threat of yoke of control, and that's coming from policymakers, and also the risk of a sudden rise in yields that could have a negative impact on risk assets themselves. In fact, it should be a concern that so few people believe that long-dated yields can move significantly higher. But we could always have a sudden move that catches policymakers unaware, such as a VAR shock, where asset managers are forced by risk models to unwind their positions. The setup in many long dated banjos it looks like the formation of a reversal pattern. On the US 10-year, this has the potential to reach three percent. But we always stress where child patents may have potential, that doesn't mean that the potential will necessarily be fulfilled. Nonetheless, high yields based on [inaudible 00:08:18] positioning rather than an increase in growth could have a significant impact on investment portfolios. Many would still follow that 40-60 framework, a 40 percent bonds versus 60 percent equity. Many of these models use volatility as a major input. Policymakers had been at pains to keep a lead on volatility so that multi-asset portfolios remains stable. But we can currently see a divergence between bond volatility such as the move index, and equity volatility such as the VIX. Divergence has happened before, and these can and do resolve themselves without a major risk events such as we saw earlier this year. But volatility in short-term interest rate products where much of the repricing has been taking place has been pushed out along the curve into those longer dates. If longer dated yields were now to suddenly break higher and whole of the curve suddenly shift upwards, which is where both the shorthand and the longer dated maturities move higher in unison, then it will probably feed through into other asset classes such as equities. Equities themselves remain in rarefied territory. The US equity market continues to make new highs, and even the small caps, which had been consolidating for weeks, have been attempting to break to new highs. This is all taking place to high levels of options volumes where retail investors continue to target the upside on some of the tech behemoths such as Apple, Amazon, and Tesla, as well as a few of the meme stocks. The VIX looks low, though this can be extremely misleading. The spot VIX doesn't trade, though you can trade individual options on the S&amp;P that are very close to experience in a similar levels of volatility. Although the VIX spot index is close to 16, the upward-sloping nature of the curve means that this level rises above 20 by the end of the year. Even though spot VIX looks low versus recent history and when compared to the move index, the VIX is not exactly cheap. Actual volatility, the S&amp;P 500 is between six and 13 percent between 10 and 100 days, much lower than the front month of VIX which is around 20. The level of the VIX itself is then pushed up because of the impact of high volatility and low strikes. This can be seen more clearly in the skew, which is the difference between the lowest strikes such as the 95 percent level and the highest strikes such as the 105 percent. Although skew is currently lower than its record highs achieved earlier this year, it's still towards the top of the 10-year range. Investors have hedged the deep downside risk for events like last year's pandemic. This has pushed up the price of put buying in those lowest strikes. As a result, many investors will not be hedged for basic market events such as a 10-15 percent pull back given the high carrier of course these options have because of the combination of both high volatility along the maturity curve and high volatility as we go into those lowest strikes. However, if the key risk is one of the potential VAR shock in the rates market, but then spills over into other asset classes. There are many investors will be looking to hedge the catalyst, which is the risk of high interest rates and yields, rather than the consequence of this event, which might be lower equities or disorderly rise in the dollar. That's even though bond volatility is towards the top of its one-year range. If you have any questions about this episode, the markets or the economy, then please put them in the comments section or send them to tbc@refinitiv.com.<br/></span></div></div></div></div>"}