{"date": "2021-11-30 15:40:50.296000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SUMO LOGIC INC (\"SUMO-Q\")\n- Named ISV Partner of the Year by Amazon Web Services\n\n     Sumo Logic the pioneer in continuous intelligence, announced it has\nbeen selected by Amazon Web Services (AWS) as its Independent Software\nVendor (ISV) Partner of the Year for 2021. Announced at the annual AWS\nPartner Summit at AWS re:Invent, the AWS ISV Partner of the Year award\nrecognizes Sumo Logic's performance and commitment to helping customers\ndrive innovation on AWS. Sumo Logic will be showcasing its AWS security and\nobservability solutions, which help companies increase the reliability and\nsecurity of modern applications by providing a unified view of key AWS\nservices, accounts, and regions, this week at AWS re:Invent at booth #969.\n\n     \"The AWS ISV Partner of the Year Award is an opportunity for us to\nrecognize the exceptional contributions of AWS Partners across the globe\nwho strive to go above and beyond on behalf of our customers,\" said Rachel\nMushahwar, Director, North America Partners, AWS. \"By leaning into the AWS\nPartner Network (APN) and helping to drive deep partner innovation, Sumo\nLogic is delivering cloud-native machine data analytics to break down data\nsilos across security and IT operations, delivering the real-time insights\nneeded to accelerate digital transformation and power modern businesses and\nwe congratulate them on this well-deserved recognition.\"\n\n     As a cloud-native SaaS analytics platform, Sumo Logic turns\nmachine-generated data, including logs, metrics, and traces, into\ncontinuous intelligence to drive real-time business, security, and IT\ninsights. Sumo Logic's platform uniquely addresses the DevSecOps challenges\nand complexities of digital transformation, modern applications and cloud\nmigration by helping customers: ensure application reliability; manage and\noptimize multi-cloud infrastructure; and Secure and protect against modern\nsecurity threats.\n\n     Together with AWS, Sumo Logic is delivering significant return on\ninvestment to its customers through innovative integrations across security\nand observability that deliver immediate value. Examples of this innovation\ninclude the recent launch of Sumo Logic Cloud SIEM Powered by AWS, a multi\nand hybrid cloud threat protection solution that reduces security blind\nspots with comprehensive visibility of AWS, across clouds and on-premises\nto identify issues before they become incidents, enhance security posture,\nand improve customer's risk profile. In addition, the AWS for Observability\nSolution for Sumo Logic enables visibility of AWS environments in a\nsingle-pane-of-glass while accelerating troubleshooting.\n\n     \"We made a strategic bet early on to go all-in on AWS and build deep\nintegration allowing us to adapt quickly and build rich functionality on\ntop of our Continuous Intelligence Platform to address a broad set of use\ncases across observability, security analytics, compliance, Cloud SIEM, and\nmore,\" said Ramin Sayar, president and CEO for Sumo Logic. \"Today our joint\ncustomers and mutual ecosystem partners continue to benefit from these\ntechnology integrations, which provide better end-user experiences as well\nas a variety of innovative joint go-to-market efforts which further help to\nimprove the value of our offerings. We are honored to be recognized as AWS'\nISV Partner of the Year and look forward to continuing to innovate together\nto architect the future.\"\n\n     The AWS Partner Network (APN) is the global community of Partners who\nleverage Amazon Web Services to build solutions and services for customers.\nAWS helps Partners build, market, and sell their AWS offerings by providing\nvaluable business, technical, and marketing support. There are tens of\nthousands of AWS Partners across the globe who are uniquely positioned to\nhelp businesses take full advantage of all that AWS has to offer and\naccelerate their journey to the cloud.\n\n     Additional Resources\n\n     *  Download this case study on AWS and Sumo Logic's partnership\n     *  Learn why Sumo Logic is a Visionary in the 2021 Gartner Magic\nQuadrant for SIEM\n     *  Watch this video tour of the Sumo Logic AWS Observability solution\n     *  Sign up for a free trial of Sumo Logic\n\n     About Sumo Logic\nSumo Logic Inc. (Nasdaq: SUMO) is the pioneer in continuous intelligence, a\nnew category of software, which enables organizations of all sizes to\naddress the data challenges and opportunities presented by digital\ntransformation, modern applications, and cloud computing. The Sumo Logic\nContinuous Intelligence Platform(TM) automates the collection, ingestion,\nand analysis of application, infrastructure, security, and IoT data to\nderive actionable insights within seconds. More than 2,100 customers around\nthe world rely on Sumo Logic to build, run, and secure their modern\napplications and cloud infrastructures. Only Sumo Logic delivers its\nplatform as a true, multi-tenant SaaS architecture, across multiple\nuse-cases, enabling businesses to thrive in the Intelligence Economy. For\nmore information, visit www.sumologic.com.\n\n     Sumo Logic is a trademark or registered trademark of Sumo Logic in the\nUnited States and in foreign countries. All other company and product names\nmay be trademarks or registered trademarks of their respective owners.\n\n     Any information regarding offerings, updates, functionality, or other\nmodifications, including release dates, is subject to change without\nnotice. The development, release, and timing of any offering, update,\nfunctionality, or modification described herein remains at the sole\ndiscretion of Sumo Logic, and should not be relied upon in making a\npurchase decision, nor as a representation, warranty, or commitment to\ndeliver specific offerings, updates, functionalities, or modifications in\nthe future.\n\n Contact Information:\n\nContact:Melissa Liton\nSumo Logic\nmliton@sumologic.com\n(650) 814-3882\n\nTel   : 650-810-8700    SUMO LOGIC INC\nWWW   : <a href=\"https://www.sumologic.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.sumologic.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133300345.MNPRE2133302239-07213220211130</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}