{"date": "2021-12-14 13:42:12.088000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>VOYAGER DIGITAL LTD (\"VOYG-T\")\n- Becomes The Official Cryptocurrency Brokerage Partner Of The\n- National Women's Soccer League\n\n     Voyager Digital Ltd. (\"Voyager\" or the \"Company\") one of the\nfastest-growing, publicly traded cryptocurrency platforms in the United\nStates, announced a multi-year agreement with The National Women's Soccer\nLeague, making Voyager the NWSL's first-ever cryptocurrency brokerage\npartner, further extending the league's global marketing reach, and\nproviding players with direct financial support, crypto education and\nrewards.\n\n     \"We are extremely proud to partner with the NWSL, specifically to help\nthe league grow and provide its players with crypto education and direct\nfinancial support, paid in crypto,\" said Steve Ehrlich, CEO, and co-founder\nof Voyager. \"We believe strongly in the future of these players and this\nleague, and we can't wait to get started.\"\n\n     The partnership calls for a significant amount of Voyager's investment\nin the league to be used to fund individual crypto accounts for each\nrostered player in the NWSL. Each player will be eligible to receive an\nequal portion of the Voyager-established NWSL players' fund, deposited in\nan account accessible via the Voyager app. Voyager will also provide NWSL\nplayers with financial education on crypto, including key lessons and\ntools, to help develop long-term financial growth opportunities for players\npotentially well after their competitive playing careers have ended.\n\n     \"I'm thrilled to welcome Voyager to the NWSL's growing list of\npartners, each of whom offers our clubs and players crucial support as we\ncontinue to build a league where the world's best players compete,\" said\nMarla Messing, NWSL interim CEO. \"Voyager's investment in the league is\nespecially innovative because we've collectively designed the partnership\nto include direct financial resources for every one of our players, as well\nas education on the revolutionary changes underway in digital assets.\"\n\n     As part of the agreement, Voyager will also inaugurate an  NWSL\nVoyager Player Ambassador roster, featuring one player from each team in\nthe league. Their efforts will include attending educational appearances,\ncreating content, and working with their teammates to manage their Voyager\naccounts better.\n\n     The NWSL will grow to 12 teams in 2022, with the upcoming Expansion\nDraft for Angel City FC and San Diego Wave FC scheduled to air on CBSSN at\n7 p.m. ET on Thursday, Dec. 16, 2021. Two days later, on Dec. 18, the 2022\nNWSL Draft presented by Ally will air on the CBS family of networks,\nbeginning at 2 p.m. ET on CBSHQ. Both drafts will be streamed\ninternationally on the NWSL's Twitch channel.\n\n     About Voyager Digital Ltd.Publicly traded Voyager Digital Ltd.'s (TSX:\nVOYG) (OTCQX:VYGVF ) (FRA: UCD2) US subsidiary, Voyager Digital, LLC, is a\nfast-growing, cryptocurrency platform in the United States founded in 2018\nto bring choice, transparency, and cost efficiency to the marketplace.\nVoyager offers a secure way to trade over 65 different crypto assets using\nits easy-to-use mobile application and earn rewards up to 12 percent\nannually on more than 30 cryptocurrencies. Through its subsidiary Coinify\nApS, Voyager provides crypto payment solutions for both consumers and\nmerchants around the globe. To learn more about the company, please visit\n<a href=\"https://www.investvoyager.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.investvoyager.com</a>.\n\n     About NWSLThe National Women's Soccer League is the premier women's\nprofessional soccer league in the world featuring national team players\nfrom around the globe. The clubs are Angel City FC, Chicago Red Stars,\nHouston Dash, Kansas City Current, NJ/NY Gotham FC, North Carolina Courage,\nOL Reign, Orlando Pride, Portland Thorns FC, Racing Louisville FC, San\nDiego Wave FC, and Washington Spirit. The NWSL's Official Sponsors include\nAlly, Budweiser, CBS, Deloitte, Mastercard, Nationwide, Nike, Twitch,\nVerizon, and Voyager.\n\n     Contacts:VoyagerPatrick Wixted[email protected]240-876-8774\n\n     NWSLKirsten Brierley[email protected]631-617-7093\n\nTel   : 212-547-8807    VOYAGER DIGITAL LTD\nEmail : sehrlich@investvoyager.com\nWWW   : <a href=\"https://www.investvoyager.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.investvoyager.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134700054.MNPRE2134700794-05110420211214</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}