{"date": "2022-02-26 16:31:54.102000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3075.77, "close": 3022.84}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Every day, we scour Amazon to find the best deals available. Whether it's something for your kitchen or top-rated tech to upgrade your smart home collection, the online shopping giant offers some of the best prices on a very wide range of items. Whatever you need, Amazon has you covered.</p></div><div class=\"tr-npp-body\"><p><span><span>Get deals and shopping advice delivered straight to your phone.</span> Sign up for text message alerts from the experts at Reviewed.</span> </p><p>Below, you'll find our top Amazon deals today, including one of our favorite portable speakers, a top-rated foot massager and a powerful robot vacuum, all of which have been vetted by our team of deals experts to make sure they're \"best of web\" prices. If you're looking for N95 and KN95 masks right now, Amazon also has plenty of choices on sale today, too.</p><p>► <span>Where to find the best masks:</span>  N95 and KN95 masks are your best mask option—here's where to buy them online</p><p>► <span>Target Starbucks Drive Up orders:</span>  Retail giant to test adding Starbucks drinks and store returns to Drive Up orders</p><p>If you're not already an Amazon Prime subscriber, you can sign up for a 30-day membership for free. An Amazon Prime subscription gets you free two-day shipping and tons of other benefits for $14.99 a month ($7.49 for students and $6.99 for those receiving qualifying government assistance).</p><p>Better still, right now, shoppers can receive a $5 discount on their first $10-or-more Amazon app purchase. </p><p class=\"tr-npp-section-title\">The best Amazon deals of the day</p><p><big>1. 25% off: One of our favorite portable speakers</big> </p><p>For a compact portable speaker that packs a punch, consider the Anker Soundcore 2, down from $39.99 to as little as $29.99 right now for the black version. Ranking as our favorite bluetooth speaker under $50, this best-selling device is easy to use, sturdy and has satisfactory sound quality. In testing, we found that the speaker had no audible sound distortion and featured tightly sealed inputs—in fact, it's rated IPx7 water-resistant, making it great for beachfront and poolside listening. </p><p><span>Get the Anker Soundcore 2 Portable Bluetooth Speaker from $29.99 (Save $6.60 to $10) </span> </p><p><big>2. Save $43: This top-rated foot massager </big> </p><p>Skip spending money at the masseuse and try this Cincom foot massager. Normally priced at $119.99, you can get this relaxation accessory for $76.50 with its current $43.49 price cut. This popular self-care gadget uses heat and air compression to target pressure points and deliver a deep massage. Outfitted with three intensity levels and a convenient shut off timer, this electric massager is easy to use and even easier to clean thanks to it's removable and machine-washable foot sleeves. </p><p><span>Get the Cincom Foot Massager for $76.50 (Save $43.49)</span> </p><p><big>3. Under $32: This convenient food storage container set </big> </p><p>Whether you need more containers for your weekly meal prep or want an easy way to store leftovers, the FineDine 24-piece glass food storage container set could be a great buy. This leak-proof kitchen set is both freezer and oven safe and includes 12 containers and 12 lids, with container sizes ranging from 12 ounces to 35 ounces. Better still, the containers feature an airtight seal for ultimate food freshness and can be easily cleaned in the dishwasher. Usually retailing for $39.99, you can pick up these food-safe containers for as little as $31.44 today. </p><p><span>Get the FineDine 24-Piece Glass Food Storage Container Set from $31.44 (Save $8.55)</span> </p><p><big>4. Under $23: This cozy mattress cover</big> </p><p>Add a little extra cushioning to your mattress with the Bedsure quilted mattress cover, currently on sale for as little as $22.60 for the twin size—$5.39 off the full $27.99 list price. This deep pocket mattress protector features a cushiony layer of soft microfiber fabric for added warmth and support and a quilted pattern to promote airflow. According to the brand, the fitted mattress cover is designed to extend the life of your mattress by cutting down on daily wear and tear. </p><p><span>Get the Bedsure Quilted Mattress Cover from $22.60 (Save $5.39 to $9.70)</span> </p><p><big>5. Save $200: This self-emptying robot vacuum</big> </p><p>If you're looking for a vacuum with powerful performance at a great price, the Shark AV1010AE IQ robot vacuum could be the perfect buy. This self-emptying robot vacuum usually runs shoppers $599.99, but Amazon is offering it for $399.99 today, a 33% discount. Designed to clean both carpets and hardwoods, this convenient vacuum takes the stress out of cleaning—you can rid your home of pet hair, dust and dirt by simply connecting the vacuum to the SharkClean app or your Alexa device and scheduling a cleaning. Shark makes several of our favorite vacuums, so we're sure this model will please. </p><p><span>Get the Shark AV1010AE IQ Robot Vacuum for $399.99 (Save $200)</span> </p><p class=\"tr-npp-section-title\">The best Amazon deals from this week</p><p><big>1. ThisWorx 12-Volt Car Vacuum</big> </p><p>Keep the floors and seats of your car as spotless as possible with the ThisWorx 12-volt handheld vacuum. Currently priced at $42.99, this travel-ready appliance can be yours for $22.99 thanks to a $20 on-page coupon at Amazon. ThisWorx says the lightweight vacuum features a washable double filter and a large bin capacity to trap ash, dust and food spills on car floors and seats. The cherry on top is its integrated LED light found between the motor base and the bin that helps illuminate the darker parts of your car. </p><p><span>Get the ThisWorx 12-Volt Car Vacuum Cleaner for $22.99 with on-page coupon (Save $20)</span> </p><p><big>2. Vizio 50-Inch M6 Series Premium 4K Smart TV</big> </p><p>Upgrade your home media room by shopping major savings on this Vizio M6 4K smart TV. Typically listed for $529.99, you can get the 50-inch LED screen for 38% off at $328. Vizio says the M6 features Dolby Vision HD and Quantum Color technology for incredible brightness and truly vibrant color in its display. It also features active pixel tuning to consistently adjust the contrast levels of your favorite shows and movies frame by frame for a truly cinematic experience no matter what you're watching.</p><p><span>Get the Vizio 50-Inch M6 Series Premium 4K UHD Quantum Color LED HDR Smart TV for $328 (Save $201.99)</span> </p><p><big>3. Repel Windproof Travel Umbrella </big> </p><p>Whether you step out into a light drizzle or rain bordering on monsoon levels, the Repel windproof travel umbrella can protect you from the elements. Normally priced at $31.95, you can get this outdoor accessory for $18.36 thanks to the already-active 28% discount and the additional 20% on-page coupon. The developer says the umbrella features nine reinforced fiberglass ribs for durability and a double vented canopy that allows winds to pass through without it giving way. It's also lightweight and has an automatic operating system that lets you open and close it with the touch of a button.</p><p><span>Get the Repel Windproof Travel Umbrella for $18.36 with on-page coupon (Save $13.59)</span> </p><p><big>4. Instant Pot 6-Quart Max Multi-Use Electric Pressure Cooker</big> </p><p>If you want to try new ways of making your favorite meals, the Instant Pot Max pressure cooker is the versatile kitchen tool you need. Typically priced at $149.99, this six-quart appliance is now 50% off at $75. Instant Pot says the Max can not only pressure cook, but also slow cook and sauté with its Nutriboost technology. Whatever your preference, you can easily set the cooking process using the Max's large touchscreen control.</p><p><span>Get the Instant Pot 6-Quart Max Multi-Use Electric Pressure Cooker for $74 (Save $75.99)</span> </p><p><big>5. HiCoup 6-Inch Large Mortar and Pestle Set</big> </p><p>Home chefs looking to add their own special flavor to dishes will revel at the HiCoup mortar and pestle set. Currently listed for $28.97 at Amazon, you can get this six-inch bowl with stone grinder included for $17.38 if you use the 40% on-page coupon. HiCoup says the set features a granite, non-porous surface that won't retain odors or flavors each time you grind herbs or spices. Its smooth exterior is also very easy to wash, promising a fresh scent and taste with every grinding project.</p><p><span>Get the HiCoup 6-Inch Large Mortar and Pestle Set for $17.38 with coupon (Save $11.59)</span> </p><p class=\"tr-npp-section-title\">Other noteworthy Amazon deals we found </p><ul class=\"bulleted-list arrowlist\"><li>Save up to 20% on select Tuft &amp; Needle mattresses</li><li>Save up to 38% on select Samsung computer monitors</li><li>Three-Month Trial of Amazon Music Unlimited for free (Save $29.97)</li><li>Old Bay 64-Fluid-Ounce Hot Sauce for $10.74 with coupon (Save $2.68)</li><li>Get the Deer Stags Slipperooz Wherever Adult Slippers from $11.49 (Save $8 to $28.51)</li><li>Errbic Solar Charger for $21.59 with coupon (Save $12.40) </li><li>Kasa Smart Plug Power Strip for $24.99 (Save $5)</li><li>Get the ChomChom Pet Hair Remover for $25.48 (Save $9.51)</li><li>Get the Rossie Home Lap Tray with Detachable Pillow from $27.99 (Save $5 to $12)</li><li>H&amp;R Block Tax Software Deluxe + State 2021 PC Download for $28.44 (Save $16.55)</li><li>Beckham Hotel Collection Bed Pillows from $31.99 with coupon (Save $16.25 to $18)</li><li>Get the Tushy Classic 2.0 Bidet Toilet Seat Attachment for $49.99 (Save $49.01)</li><li>Logitech G Pro Wireless Gaming Mouse for $79 (Save $50.99)</li><li>Bissell Power Fresh Steam Mop for $82.69 (Save $10)</li><li>Vornado AVH10 Vortex Heater for $83.99 (Save $41)</li><li>Staub Cast Iron 4-Quart Round Cocotte from $99.95 (Save $5.62 to $107.65)</li><li>Get the Cuisinart ICE-100 Compressor Ice Cream and Gelato Maker for $176.97 (Save $368.03)</li><li>Apple AirPods Pro for $197 (Save $52)</li><li>Philips Premium Airfryer XXL for $199.95 (Save $136 to $150)</li><li>Amazon Fire TV Omni Series 4K UHD Smart TV from $299.99 (Save $110 to $350)</li><li>iRobot Roomba i3 Wi-Fi Connected Robot Vacuum for $299.99 (Save $50)</li><li>Apple Watch Series 7 GPS + Cellular from $449 (Save $39.95 to $249.01)</li><li>Segway Ninebot MAX G30P Electric Kick Scooter for $877.99 (Save $72)</li> </ul><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Updated daily: Here are the 10 best Amazon deals you can get today</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}