{"date": "2021-12-01 05:49:34+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n                  <span>New offerings further protect customer data and simplify migration to the cloud</span>\n                </p>\n                <p>\n                  <strong>LAS VEGAS - AWS re:Invent, November 29, 2021-</strong>McAfee Enterprise and FireEye today announced the availability of new cloud security capabilities on Amazon Web Services (AWS) as well as integration with <a href=\"https://aws.amazon.com/inspector/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Inspector</a>. FireEye Helix behavior analysis and machine-learning Extended Detection &amp; Response (XDR) capabilities combined with Amazon Inspector, a vulnerability management service, offers AWS customers greater visibility and protection of applications and data in the cloud. McAfee Enterprise and FireEye are also now included in the <a href=\"https://aws.amazon.com/partners/programs/isv-workload-migration/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS ISV Workload Migration Program (WMP)</a>, which helps customers with funding, technology enablement and go-to-market support as they migrate independent software vendor (ISV) workloads on AWS and accelerate their digital transformation.\n      </p>\n                <p>\n        AWS customers are already benefiting from access to the entire company's security product portfolio available in <a href=\"https://aws.amazon.com/marketplace\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Marketplace</a>. Integration with Amazon Inspector and the AWS ISV WMP will further enable AWS customers to bring McAfee Enterprise and FireEye security solutions to their cloud architecture.\n      </p>\n                <p>\n        \"Threats in the cloud are unique because data is stored with a third-party provider and accessed over the internet. This means visibility and control over that data is limited.\" said Michelle Salvado, Senior Vice President, Engineering, McAfee Enterprise and FireEye. \"The combined technology and intelligence of McAfee Enterprise and FireEye protect AWS customers by providing that additional visibility and control, reducing overall risk while also allowing for faster migration to the cloud and easier, more streamlined interoperability.\"\n      </p>\n                <p>\n                  <strong>McAfee Enterprise and FireEye Partner with Amazon Inspector</strong>\n                  <br/>\n                  <a href=\"https://www.fireeye.com/products/helix.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">FireEye Helix</a> is a SaaS-based Security Operations Platform designed on AWS to provide superior detection and response, without the overhead of a full SIEM and SOAR. By integrating with Amazon Inspector, data can now be coupled with threat intelligence to provide deeper vulnerability and risk context for detection and threat hunting activities, while prioritizing alerts that are actionable.\n      </p>\n                <p>\n                  <strong>McAfee Enterprise and FireEye Join AWS ISV Workload Migration Program (WMP)</strong>\n                  <br/>\n         The company joined the <a href=\"https://aws.amazon.com/partners/programs/isv-workload-migration/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS ISV WMP</a> to support customer migrations by providing a repeatable blueprint to migrate on-premise security solutions to AWS SaaS, PaaS, and IaaS security products. McAfee Enterprise and FireEye offer cloud-native solutions for cloud migrations; cloud governance and compliance; threat protection for endpoint, network, email; CASB; and cloud security operations, all of which are part of the AWS WMP to provide investment and help customers mitigate financial risks, and quicken migration decisions and execution.\n      </p>\n                <p>\n        Additional Resources<br/></p>\n                <p>\n                  <strong>About McAfee Enterprise and FireEye</strong>\n                  <br/>\n         McAfee Enterprise and FireEye combined in October 2021, bringing together their portfolios and expert teams to create a market-leading security company. With proven technology and unrivaled experience, the company serves more than 40,000 enterprise, commercial, and government customers worldwide. The new company blends innovative technology, intelligence, and automation to help solve the most complex cybersecurity problems for its customers. More at <a href=\"https://www.mcafee.com/enterprise/en-us/home.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.mcafee.com/enterprise</a> and <a href=\"https://www.fireeye.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.fireeye.com.</a></p>\n                <p>\n                  <strong>Media Contact</strong>\n                  <br/>\n         McAfee Enterprise &amp; FireEye<br/><a href=\"https://www.mcafee.com/enterprise/en-us/about/newsroom/press-releases/2021/media@mcafee.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">media@mcafee.com</a><br/></p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.mcafee.com/enterprise/en-us/about/newsroom/press-releases/2021/20211129-01.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>McAfee Corporation</strong> published this content on <strong>29 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>01 December 2021 05:49:34 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - McAfee Corporation</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: McAfee-Corporation</p></div>"}