{"date": "2021-11-23 13:00:00.119000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>DENVER, Nov.  23, 2021  (GLOBE NEWSWIRE) -- <a href=\"https://www.globenewswire.com/Tracker?data=62bTryMe9PvPtmlZvl4dJwq0MUtqsKhFxE9oJpvhUENzQMjobLa4eCN3Cb1iv38f0JQ8WPPsCDIHFxeAzhwZQA==\"><u>AllCloud</u></a>, a leading, global provider of cloud professional and managed services, announces the launch of AllCloud Engage, a new managed services framework for strategic AWS customers. With Engage, AllCloud is revolutionizing the typical management of cloud services by taking an outcomes-based approach. Services are assigned tailored KPIs and performance is continually monitored and tracked, enabling the customer to measure success according to those KPIs. Customers access their KPI outcomes directly from the Engage Service Console, providing them with full, real-time transparency of the value of their AWS investment.<br/></p><p>AllCloud Engage comes in two service tiers: Essential and Professional. Essential tier customers get access to a wide range of value-added managed services, a personalized AllCloud dashboard, and a dedicated AllCloud customer success manager. The Essential tier includes ongoing AWS support, FinOps, Solutions Architect Advisory services, access to the proprietary AllCloud Solutions Factory and AWS training.</p><p>The Professional tier includes even more access to AllCloud’s AWS experts, who are available to guide and support customers’ in-house teams. With the Professional tier, customers receive the full provision of AWS managed services, including infrastructure and application health monitoring, security management, application delivery, management of their data and analytics platform, management of their backup and disaster recovery, patching and cost optimization. At the Professional tier, customers are assigned a Cloud Services Delivery Manager (CSDM) as part of the concierge program to serve as their single point-of-contact.</p><p>All AllCloud Engage customers are provided with 24/7 access to the Engage Service Console, a dashboard displaying their AllCloud activity, engagement and communications in real-time. Managed services are available as modular add ons, enabling customers to choose the services they need, as they need them. Customers can increase their engagement as they scale their AWS operations, or wind down services no longer needed, providing a fully customizable approach that ensures cost efficiency at all times.</p><p>“AllCloud Engage aims to reduce the complexity of cloud operations, which is achieved by using blueprint driven solutions,” said Lahav Savir, Founder and CTO, Platforms at AllCloud. “It enables faster support, streamlined operations and an improved AWS experience via a single, personalized point of contact. AllCloud’s unique outcomes-based approach ensures that customers continue to receive value from their AllCloud engagement, with full transparency at all times. Whether choosing the Essential tier or a full-service engagement for end-to-end management, our goal is to turn Engage into the gold standard for running your business on AWS.”</p><p>Earlier this month, AllCloud <a href=\"https://www.globenewswire.com/Tracker?data=gXl9HHTZ4vTKBYp-h18F6TjhPzA0Fc-WMiPvWQfGb7AYJ5Vg6fXCOLIdnkSIzvAGXJH1qmiqL1oeJbiNMPLYLDileaXfVqR_yey8FUdGKRzBOtdTnlRF6Z3Rwex9c64xBhDHKfyv-82Qz6UW1NQTqTl3pGqvnEyEsOYeTaZFZYftwp_-rgilni26tDfjXd3vGyJilXNzZH1IR9mDE4qWzR8R9f-R-ikQtYA4WPLmG_Udu0YQT5hdFweP2mQipvrTh-TGUocpT2-ZR0LLAkTNT7QMwIJKutn7CfUIfCQPK8ZU9D22VEy6lF4bSuUiv8Nh\"><u>announced</u></a> an expanded strategic collaboration with AWS. The collaboration, which began last year in Germany, Austria, Switzerland and Israel, will now include North America. Through the collaboration, AllCloud will provide clients with professional and managed services to accelerate their cloud migration and digital transformation.</p><p>More information about Engage can be found <a href=\"https://www.globenewswire.com/Tracker?data=tNsUWRVebklHiJwSmkw51_9dtCvMIVUSmA4UU_x2ffY2osz0iOWvJNWSrenZtbAaJaTGvgP6bfrJABARBDlu7w==\"><u>here</u></a>.</p><p><strong>About AllCloud</strong></p><p>AllCloud is a global professional services company providing organizations with the tools for cloud enablement and transformation. Through a unique combination of expertise and agility, AllCloud accelerates cloud innovation and helps organizations fully unlock the value received from cloud technology and data and analytics.</p><p>As an AWS Premier Consulting Partner, a Salesforce Platinum Partner and Snowflake Select Partner, AllCloud helps clients connect their front office and back office by building a new operating model that allows them to harness the benefits of cloud technology and data and analytics. AllCloud is supported by a robust ecosystem of technology partners, proven methodologies, and well-documented best practices. Thereby, elevating customers by achieving operational excellence on the cloud, within a secure environment, at every milestone of the journey to becoming cloud first.</p><p>With over 13 years of experience and a portfolio of thousands of successful cloud deployments, AllCloud serves clients across the globe. AllCloud has offices in Israel, Europe and North America. <a href=\"https://www.globenewswire.com/Tracker?data=DmUTHMgraIXEToSmf9K-bKAGVbPmPEpmn_8UdnZ7QIKlNXY0HVNpYCOxl7Fje4T1S3TRQzyFH7CrEMbYN9Vg3w==\"><u>www.allcloud.io</u></a></p><p>Media Contact:<br/>Kevin Wolf<br/>Owner - TGPR<br/><a href=\"https://www.globenewswire.com/Tracker?data=end2Vu8j1KyKtwY1B2P9goCp6A0rB4WHtcDEvw3ysj_xfP1su5WBsuFhExpLejgtoVKoSLYoyYCKKqbwakQlkw==\"><u>kevin@tgprllc.com</u></a></p><p> </p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODM5ODg4MyM0NTc3NDQwIzIxMjI4Mzg=\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RNNU9EZzRNeU0wTlRjM05EUXdJekl4TWpJNE16Zz0=&amp;key=f531d9ebb420b52b7ca31e5156af8f3fab21d69669fbaf94006535bc95b14cb2feae99ede2f560b933fc8f09b4e86f9670c4f7ea67e38ca33bce7998aba1efe5\"/></div></div><br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/ZGI4NzYxZjYtNDYwZi00MTdlLWIyODUtMmU1Y2VmYmMyYWMzLTExMzQ0MDk=/tiny/AllCloud.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9aR0k0TnpZeFpqWXRORFl3WmkwME1UZGxMV0l5T0RVdE1tVTFZMlZtWW1NeVlXTXpMVEV4TXpRME1Eaz0vdGlueS9BbGxDbG91ZC5wbmc=&amp;key=63cb01e6507309e79cdf6736b186a0886bfd951d300fb76d0e87a9d48cc53dfc204a1ad2229633c7ef01ad5464f2f831dfb8378b798b6f194ce70349727dd1e7\"/></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">GlobeNewswire, Inc. 2021</p></div>"}