{"date": "2022-01-07 14:41:35.708000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3287.14, "close": 3251.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MOTORSPORT GAMES INC (\"MSGM-Q\")\n- Champions From Around the World Sign Up to Compete in 24 Hours of\n- Le Mans Virtual by Motorsport Games\n\n     The star-studded entry list entry list for the 24 Hours of Le Mans\nVirtual by Motorsport Games Inc., scheduled to be held January 15 &amp; 16,\n2022, has today been revealed and it shows once again the fascination,\ncharm and lure of motorsport's greatest endurance race. The race will be\nheld virtually and on simulators located all around the world.\n\n     A glittering roster of drivers includes newly-crowned F1 World\nChampion Max Verstappen, an Alpine Esports team captained by (non-driving)\nformer F1 and FIA WEC World Champion Fernando Alonso, plus 2021 INDYCAR\nChampion Alex Palou. Among the entries are former CART and IMSA WeatherTech\nSportscar Champion and former F1 star Juan Pablo Montoya, racing alongside\nhis son Sebastian Montoya in a Le Mans Virtual Series guest car, and\nINDYCAR's Felix Rosenqvist - a race winner already this season and\nchampionship title contender who will have Verstappen alongside him in the\nTeam Redline entry.\n\n     Single-seater stars on the list comprise ex Williams F1 young driver\nand Formula E star Oliver Rowland, Formula E's Sergio Sette Camara, Indy\n500 racer Sage Karam, Bent Viscaal, Felipe Drugovich, Victor Martins plus\nthe W Series entry which features pro drivers Fabienne Wohlwend and Ayla\nAgren and their two female sim driver teammates, Emily Jones and Lyobuv\nOzeretskovskaya.\n\n     Also on the entry list from W Series is Beitske Visser who has, in\n2021, started to make quite a name for herself in endurance racing. A feast\nof successful names from the FIA WEC, ELMS, IMSA and GT racing worldwide\nwill be on the grid: 2020 24 Hours of Le Mans Virtual winner Louis Deletraz\ntogether with his 2021 ELMS co-champion Yifei Ye, 2021 Petit Le Mans winner\nGabriel Aubry, Job Van Uitert, Dani Juncadella, Arthur Rougier, WEC GTE Am\nchampion Nicklas Nielsen, former DTM Champion Bruno Spengler, Porsche\nspecialists Matt Campbell and Ben Barker, and current British GT3 champion\nDennis Lind.\n\n     While the focus may initially fall on the real world racing stars\n(listed as PRO on the entry list), internationally-renowned esports stars\nsuch as Joshua Rogers (2020 24H Virtual GTE winner), Kevin Siggy, Bono\nHuis, Atze Kerkhof, Michi Hoyer, Jernej Simoncic? and Nikodem Wisniewski\nare just a few of the very talented and determined sim racers who will be\ncombining with the pros to provide a true feast of competition and\nentertainment.\n\n     In total, 200 drivers have signed up to take part in the event, the\nfinale to the Le Mans Virtual Series which brings together motorsport's\nreal life racers with the world's best esports squads. In addition to\nshining a spotlight on the famous French sports car classic and providing\n24-hours of top entertainment for competitors and fans around the world,\nchampionship titles and prize money are at stake for full-season\ncompetitors.\n\n     Further details will be revealed in the coming days about individual\ncar liveries, plus how you can follow the 24 Hours of Le Mans Virtual on\nTV, online and on social media channels around the world.\n\n     All information on the event can also be found on\nwww.lemansvirtual.com.\n\n     About Le Mans Virtual Series\nLe Mans Virtual Series is a global, elite esports series made up of five\nrounds which bring together endurance racing and sim racing' top teams to\ncompete on some of the world's most famous racetracks. International\nFIA-licensed real-world drivers are teamed up with leading esports\nprotagonists to take on endurance classics for a total prize fund of US\n$250,000, culminating in the prestigious 24 Hours of Le Mans Virtual which\nwill take place entirely online. The Le Mans Virtual Series is a joint\nventure between leading racing game developer, publisher and esports\necosystem provider of official motorsport racing series throughout the\nworld, Motorsport Games, and the Automobile Club de l'Ouest (ACO) - the\ncreator and organizer of the world-famous 24 Hours of Le Mans and promoter\nof the FIA World Endurance Championship (FIA WEC). www.lemansvirtual.com\n\n//st\n\nRound 1   4 Hours of Monza, Italy        September 25, 2021    Online only\n\nRound 2   6 Hours of Spa, Belgium        October 16, 2021      Online only\n\nRound 3   8 Hours of Nurburgring,        November 13, 2021     Online only\n          Germany\n\nRound 4   6 Hours of Sebring, USA        December 18, 2021     Online only\n\nRound 5   24 Hours of Le Mans Virtual    January 15/16, 2022   Online only\n\n//et\n\n     About Motorsport Games\nMotorsport Games, a Motorsport Network company, combines innovative and\nengaging video games with exciting esports competitions and content for\nracing fans and gamers around the globe. The Company is the officially\nlicensed video game developer and publisher for iconic motorsport racing\nseries, including NASCAR, INDYCAR, 24 Hours of Le Mans and the British\nTouring Car Championship (\"BTCC\"), across PC, PlayStation, Xbox, Nintendo\nSwitch and mobile. Motorsport Games is an award-winning esports partner of\nchoice for 24 Hours of Le Mans, Formula E, BTCC, the FIA World Rallycross\nChampionship and the eNASCAR Heat Pro League, among others. For more\ninformation about Motorsport Games, visit www.motorsportgames.com.\n\n     Forward-Looking Statements:\nCertain statements in this press release which are not historical facts are\nforward-looking statements within the meaning of Section 27A of the\nSecurities Act of 1933, as amended, and Section 21E of the Securities\nExchange Act of 1934, as amended, and are provided pursuant to the safe\nharbor provisions of the Private Securities Litigation Reform Act of 1995.\nAny statements in this press release that are not statements of historical\nfact may be deemed forward-looking statements. Words such as \"continue,\"\n\"will,\" \"may,\" \"could,\" \"should,\" \"expect,\" \"expected,\" \"plans,\" \"intend,\"\n\"anticipate,\" \"believe,\" \"estimate,\" \"predict,\" \"potential,\" and similar\nexpressions are intended to identify such forward-looking statements. These\nforward-looking statements include, but are not limited to, statements\nconcerning the expected future impact of new or planned products, features,\nofferings or events, including, without limitation the Le Mans Virtual\nSeries events, and the timing of launching such products, features,\nofferings or events. All forward-looking statements involve significant\nrisks and uncertainties that could cause actual results to differ\nmaterially from those expressed or implied in the forward-looking\nstatements, many of which are generally outside the control of Motorsport\nGames and are difficult to predict. Examples of such risks and\nuncertainties include, but are not limited to difficulties, delays in or\nunanticipated events that may impact the timing and scope of new product\nlaunches, such as due to delays and higher than anticipated expenses\nrelated to the ongoing and prolonged COVID-19 pandemic. Factors other than\nthose referred to above could also cause Motorsport Games' results to\ndiffer materially from expected results. Additional factors that could\ncause actual results to differ materially from those expressed or implied\nin the forward-looking statements can be found in Motorsport Games' filings\nwith the SEC, which may be found at www.sec.gov and at\nir.motorsportgames.com, including its Annual Report on Form 10-K for the\nfiscal year ended December 31, 2020, its Quarterly Reports on Form 10-Q\nfiled with the SEC during 2021, as well as in its subsequent filings with\nthe SEC. Motorsport Games anticipates that subsequent events and\ndevelopments may cause its plans, intentions and expectations to change.\nMotorsport Games assumes no obligation, and it specifically disclaims any\nintention or obligation, to update any forward-looking statements, whether\nas a result of new information, future events or otherwise, except as\nexpressly required by law. Forward-looking statements speak only as of the\ndate they are made and should not be relied upon as representing Motorsport\nGames' plans and expectations as of any subsequent date. Additionally, the\nbusiness and financial materials and any other statement or disclosure on,\nor made available through, Motorsport Games' website or other websites\nreferenced or linked to this press release shall not be incorporated by\nreference into this press release.\n\n     Website and Social Media Disclosure:\nInvestors and others should note that we announce material financial\ninformation to our investors using our investor relations website\n(ir.motorsportgames.com), SEC filings, press releases, public conference\ncalls and webcasts. We use these channels, as well as social media and\nblogs, to communicate with our investors and the public about our company\nand our products. It is possible that the information we post on our\nwebsites, social media and blogs could be deemed to be material\ninformation. Therefore, we encourage investors, the media and others\ninterested in our company to review the information we post on these\nwebsites, social media channels and blogs, including the following (which\nlist we will update from time to time on our investor relations website):\n\n//st\n\n         Websites              Social Media\n\n         motorsportgames.com   Twitter: @msportgames &amp; @traxiongg\n\n         traxion.gg            Instagram: msportgames &amp; traxiongg\n\n         motorsport.com        Facebook: Motorsport Games &amp; traxiongg\n\n                               LinkedIn: Motorsport Games\n\n                               Twitch: traxiongg\n\n                               Reddit: traxiongg\n\n//et\n\n     The contents of these websites and social media channels are not part\nof, nor will they be incorporated by reference into, this press release.\n     Investors:\nAshley DeSimone\nAshley.Desimone@icrinc.com\n\n     US Press:\nASTRSK PR\nmotorsportgames@astrskpr.com\n\n     EU / UK Press:\nSwipe Right PR\nmotorsport@swipterightpr.com\n\n     A photo accompanying this announcement is available at\n<a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/f32ce1a4-f38e-4e33-95db\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.globenewswire.com/NewsRoom/AttachmentNg/f32ce1a4-f38e-4e33-95db</a>\n-9ddfa818a54f\n\nTel   : 305-507-8799    MOTORSPORT GAMES INC\nEmail : investors@motorsportgames.com\nWWW   : <a href=\"https://www.motorsportgames.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.motorsportgames.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200600129.MNPRE2200600598-06164720220107</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}