{"date": "2022-02-18 14:12:08.643000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3162.01, "close": 3052.03}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Transport Workers Union says decision that Amazon Flex must pay delivery drivers a minimum rate is a world firstFollow our Australia news live blog for the latest updatesDownload the free Guardian app ; get our morning email briefing</p><p>Amazon drivers have been awarded an enforceable minimum rate of pay in the New South Wales Industrial Relations Commission, in what is believed to be a world first.</p></div><div class=\"tr-npp-body\"><p>From 1 March, Amazon Flex drivers will receive a minimum rate of pay, starting at $27.83 an hour and increasing to $37.80 by 1 July 2025, after a successful bid by the Transport Workers Union to overhaul the award in the commission.</p><p>TWU national secretary Michael Kaine said the successful application would see pay rises of up to 45% for some drivers. The union said it was the first time rates had risen for owner drivers and contract couriers in 15 years.</p><p>\"They have put in place a model that deliberately classifies workers as independent contractors so they can try to place them outside the system of protections,\" Kaine said.</p><p>\"Amazon can now be held to account.\"</p><p>Amazon was not involved in the proceedings, which did not make any findings about their current practices.</p><p>Amazon launched Flex in Australia in 2020 and promoted the parcel delivery service as a way for people to make extra money.</p><p>It has about 2000 contractors signed up to the service, who all use their own cars and cover their overheads, like petrol. Many say it is impossible to make a living wage.</p><p>One Amazon driver, who asked not to be named, said drivers are currently paid in a lump sum for blocks of work and have to send a request for any overtime.</p><p>On Facebook, drivers share screenshots of blocks on offer. Recent ones show Amazon offering drivers $87-$90 for three hours of work.</p><ul class=\"bulleted-list arrowlist\"><li> </li></ul><p><a href=\"https://www.theguardian.com/world/guardian-australia-morning-mail/2014/jun/24/-sp-guardian-australias-morning-mail-subscribe-by-email?CMP=copyembed\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Sign up to receive an email with the top stories from Guardian Australia every morning</a> </p><p>One of the \"runs\" on offer asks drivers to cross the city, delivering 39 packages to 33 stops within four hours – the first of which is 50 minutes away.</p><p>To request overtime, the driver has to contact an overseas call centre, which reviews their application.</p><p>\"You have to call Amazon Flex support and tell them you have overtime, they say 'oh yeah we will pay it' but then you have to send email, and after two or three weeks they reply, often saying you are not eligible,\" the driver said.</p><p>Another driver, known only as Chris, who spoke after the decision was made, said at one point he lived in his van because he did not make enough money to rent a home.</p><p>\"I decided to stick it out and the way for me to do that and keep my head afloat was to live in my van for two years,\" he said.</p><p>\"Today is a personal thing, that's why I am feeling emotional … it creates a bit of closure for myself also.\"</p><p>Amazon was contacted for comment.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 theguardian.com-NonSyndicated</p></div>"}