{"date": "2021-12-16 14:00:00.259000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3381.83, "close": 3377.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>SANTA CLARA, Calif., Dec.  16, 2021  (GLOBE NEWSWIRE) -- <a href=\"https://www.globenewswire.com/Tracker?data=7djX-arh3syTCsaEUZl9vuGpAcedwAJ83Mxwk4oATRxpUiFw84cfV2Z_iypBNP1XusUX7pShsJCQ0zWXG3M3aQ==\"><u>Clumio® Inc.</u></a>, a leader in cloud data protection, today announced the general availability of <a href=\"https://www.globenewswire.com/Tracker?data=7djX-arh3syTCsaEUZl9vopSqFZUoCzWAn7pWh1uDuKNtqcrVT8xrLVFjNiRTZJRQjt85hVog0gJqWi5OjygwUteJG22ZAdE5R4QeRCKGnM=\"><u>Clumio Protect</u></a> for Amazon S3. Clumio Protect for Amazon S3 is a backup as a service (BaaS) offering that provides added protection against ransomware, simplified compliance reporting, and a low recovery time objective (RTO), while at the same time reducing the cost to protect data in Amazon S3. Since the announcement of its early access (EA) program in September, Clumio has successfully performed thousands of backups for EA customers.<br/></p><p align=\"justify\"><span>“Now that customers have seen it in action and experienced how truly simple it is for them to protect their mission critical datasets in Amazon S3, the reception we have received for Clumio Protect for Amazon S3 has exceeded our expectations,” said Chadd Kenney, Vice President of Product, Clumio. “Customers love how quickly they can protect their data from ransomware and that they can recover it in seconds. You know you have delivered something special when one of your biggest customers tells you – I’m very happy with this product, I couldn’t have designed it better myself.”</span></p><p align=\"justify\">EA customers report the following initial results:</p><ul type=\"disc\" class=\"bulleted-list arrowlist\"><li style=\"margin-bottom:6pt;text-align:justify\"><strong>Quick and effortless ransomware protection:</strong> EA customers experienced easy onboarding through the Clumio Protect listing in AWS Marketplace. <span>“We were able to start protecting our Amazon S3 data in less than ten minutes,” said Francisco Borge, CTO, Birdzi. “Our data is now immutable in Clumio SecureVault and protected against access by ransomware, bad actors, and other threats.”</span></li><li style=\"margin-bottom:6pt;text-align:justify\"><strong>Low RTO with one-click rapid recovery:</strong> Customers can recover critical Amazon S3 data with a single click. Combined with global search functionality that works across backups, buckets, and accounts, <span>recovery time was reduced significantly.</span> One customer was able to recover terabytes of data stored across multiple buckets in less than three minutes, which otherwise would have taken hours.</li><li style=\"margin-bottom:6pt;text-align:justify\"><strong>Cloud scale:</strong> Based on a serverless architecture, Clumio’s data protection platform scales to meet the backup demands of its largest customers. During the EA period, Clumio Protect for Amazon S3 <span>backed up 100s of terabytes of data across more than 100 million Amazon S3 objects</span>. <span>“We were searching for a backup solution for our critical Amazon S3 data that was easy to use without any complex planning involved,” said Tyler Wood, Director of IT, Bidadoo. “Clumio Protect for Amazon S3 met our requirements and exceeded expectations. The platform feature set, service, and support has been amazing.”</span><br/></li></ul><p align=\"justify\"><span>“We have been innovating at a rapid pace in the public cloud and optimally protecting our mission-critical data in Amazon S3 is a challenge,” said Mark Huber, Senior Director, Engineering Enablement at Cox Automotive. “Our Amazon S3 data is immense and diverse. We originally planned to build our own backup solution, but the effort was massive. Clumio listened to our feedback and tirelessly worked with our teams to deliver Clumio Protect for Amazon S3. We can selectively provide the right levels of protection for our Amazon S3 data via global policies and protection groups. Global search enables quick recovery of any bucket or object for compliance needs, and optimizations to reduce small object overhead and deliver a low TCO.”</span></p><p align=\"justify\">With digital transformation continuing to gather momentum, more and more customers leverage Amazon S3 for durable storage. As datasets in Amazon S3 scale, customers need to to track what types of data they have, determine what needs to be protected, and prove compliance with the data protection policies of the business.</p><p align=\"justify\"><span>“As customers migrate more applications to AWS, they look to add additional protection for their most important data, which is often stored in Amazon S3,” said Kevin Miller, Vice President &amp; General Manager, Amazon S3 at Amazon Web Services (AWS). “Clumio Protect for Amazon S3 helps customers to protect their data by enforcing retention periods across buckets, providing fast recovery options when a restore is needed, and monitoring to verify compliance with data protection policies. We’re excited about how Clumio’s service can help customers preserve the integrity of critical datasets, and look forward to our continued work together.”</span></p><p align=\"justify\">Clumio Protect for Amazon S3 key benefits include:</p><ul type=\"disc\" class=\"bulleted-list arrowlist\"><li style=\"margin-bottom:6pt;text-align:justify\"><strong>Ransomware and bad actor protection: </strong>Clumio Protect’s Amazon S3 backups are stored outside of the customer’s AWS account, so that they are completely separated from the production environment. Customer data is stored on immutable storage, and is encrypted both at-rest and in-flight, with the ability for customers to bring their own keys. In addition, Clumio provides multi-factor authentication with SSO integration, access controls for assets and roles, and no delete button.</li><li style=\"margin-bottom:6pt;text-align:justify\"><strong>Global compliance and visibility: </strong>Clumio Protect provides a centralized view across buckets, AWS Accounts, and AWS Regions to make compliance audits easy. Customers get real-time visibility and alerts when backups are out of compliance.</li><li style=\"margin-bottom:6pt;text-align:justify\"><strong>Low RTOs to meet service level agreements (SLAs): </strong>Clumio Protect reduces recovery time with flexible recovery options for buckets, prefixes, and objects across any AWS Account, reducing restore times from hours or days to minutes. Global search enables quick access to any file, at any point in time.</li><li style=\"margin-bottom:6pt;text-align:justify\"><strong>Simple and cost-effective: </strong>Clumio Protect provides built-in efficiencies by removing the need for versioning, reducing the overhead of small files, and enabling data classification of your most critical datasets.</li></ul><p align=\"justify\"><span>\"Some still may view backup for Amazon S3 as an unnecessary safety net – but this line of thinking is outdated and dangerous. Applications have evolved well beyond the cheap and deep storage use cases of archiving and long-term backup retention,” said </span><a href=\"https://www.globenewswire.com/Tracker?data=MgC3HtUCnNU5xAAsZYKqpDbOtHtG4NeUotanuHAQMZHAuVCwxiLQFLtGFRm2QpLEvZ2czHN2ZFCoLj2s-ls36c9WasbTkFR1iPgXkZTkN-YeDBVWp7gmEXrOHUnDYwSc\"><span><u>Henry Baltazar</u></span></a><span>, Research Director, 451 Research a part of S&amp;P Global Marketing Intelligence. “Clumio SecureVault provides ransomware and bad actor protection, in addition to key features such as file level indexing, cataloging and global search capabilities. This functionality enables Clumio's customers to deliver a compliance-driven, long-term backup solution for their primary Amazon S3 data.”</span></p><p align=\"justify\">More information about Clumio Protect for Amazon S3 is available at <a href=\"https://www.globenewswire.com/Tracker?data=nc7hmyrVnukYmmqrxGOD8MRgcWOlSN6J46PEmzmxbFbPBnjp-yPRETMOIIuLTbIBKjCu1uzIKsdPCXdSGRV9Y-QyYvpz2esJuHFFW-R5JY0=\"><u>www.clumio.com/amazon-S3</u></a>. Clumio Protect is available for the protection of Amazon Elastic Block Store (Amazon EBS), Amazon Elastic Compute Cloud (Amazon EC2), Amazon Relational Database Service (Amazon RDS), Amazon S3, Microsoft 365, and VMware Cloud on AWS with a 30-day free trial in <a href=\"https://www.globenewswire.com/Tracker?data=r_BeqRaUAAr8__iBX_3cyeQayl6c5ptkVn1LL8mkq9W4WbxVpvPxROyOeI3sk12rZkh9n1KPqIK-4WTf_t-81WvYAF3YbFP4Erp-K-NaRyhUKwsLCkOObT_XeTAacPDiF1dYyt20IQ30w9wE8qVIfAcQOtEB8GgeQ626r_4ztgQ501xOZ_wROIHFlrfY3Z5S\"><u>AWS Marketplace</u></a>.<br/>    <br/><strong>Additional Resources</strong></p><p><a href=\"https://www.globenewswire.com/Tracker?data=zS00VkxiQinwSAeChQ3uy48hFqaoD7O2nzBRVQuTfFGw_lD9QQIUuEda2SH_7aEj2Ja3xdUFUuYZmwvOAX_sKFoFem8ga7-95uUvkb2PSYFXWkiGkXJQ4jZ19FlmgFzU\"><u>See Clumio’s upcoming webinars and events</u></a><br/><a href=\"https://www.globenewswire.com/Tracker?data=h9tw2Bot4losTKvUjsj8oJtpGwV_ZWmMgkKlNjnYFp1DkG41UZlHRlZBA2b8vMciga2Zf2LrALRiNkJ_nbxjt5VvoHcW_cdVhM8av3sYQgYEnD2_B2Zx3_5JVs0A2GVE3yUJOB10VA1W8EXdxdNJRg==\"><u>Learn How Clumio is Reimagining Enterprise Backup</u></a><br/><a href=\"https://www.globenewswire.com/Tracker?data=lQO-aeeVKKHTs_tPHu_5WqBhFFLT8Ah7nu1FES8lX8tGsnPKH_yx8vgP-nGjA4n9xF8MfD_olXLEVfMayPEoloPPiqGiMAkuzO_HjpGY0pEagVjI4Uh6bxu9Ky-sCiMR\"><u>Read more about Clumio on our Blogs</u></a></p><p align=\"justify\"><a href=\"https://www.globenewswire.com/Tracker?data=m_P45B7Hhv5Yv2dJ278sd2c0ciYtL9I4tLJopddmMusjRA9YM9zuiX_jTD6qsDvQEqmaD1dNLHVh6QC0flRw2FO9xktstR7kEhPOG6BlTU0=\"><u>Follow Clumio on Twitter</u></a></p><p align=\"justify\"><strong>About Clumio</strong><br/>Clumio helps organizations simplify cloud data protection. Its secure air-gapped SaaS backup solution enables organizations to achieve ransomware protection, stringent compliance requirements, backup and restore data in minutes, and gain better visibility to optimize cloud storage costs. Join a community of passionate users and try Clumio for <a href=\"https://www.globenewswire.com/Tracker?data=0SLsMPWVTBnCR2X3vfaRtR-I0bvDwJQWB75n4rtIHAIbb1dPGAwVm5jlGyFRlLVX2p_WxyO2uSG-urVp9UzhCGQ4VofxWm12Cif0GrWswhHzjXQxiv04BLs7-4hHEUmL\"><u>free today</u></a>.</p><p align=\"justify\"><span>Clumio is a registered trademark of Clumio Inc. All other marks and names mentioned herein may be trademarks of their respective companies. This article may contain hyperlinks to non-Clumio websites that are created and maintained by third parties who are solely responsible for the content on such websites.</span></p><p><strong>Media Contact</strong><br/>John McCartney<br/>Jmac PR for Clumio<br/><a href=\"https://www.globenewswire.com/Tracker?data=9MVCvhY_agXiphyTh_KA8CCOSNnng929TiWEXmuURK2gIP5iLTW_wo2EbLntdzgrMFo6xG92y7I88Bt8HEH6yA==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">john@jmacpr.com</a><br/>646-280-8573</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODQxMzEyNiM0NjE3MjI0IzIxOTQ1NzY=\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RReE16RXlOaU0wTmpFM01qSTBJekl4T1RRMU56WT0=&amp;key=80af469f90595ef1e44e154af8755959d20dad95e46f4c9bcb1b6cfc105c0bc2552049ff6023bc41dcdd7b082e218d843663394392aa38713fbd70cfc6441a70\"/></div></div><br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/Yzg0ZmZhNmItODIzYi00NWUwLTlmNzYtZDQ0ZDRkMWI4MDZiLTEyMDYxMjk=/tiny/Clumio.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9ZemcwWm1aaE5tSXRPREl6WWkwME5XVXdMVGxtTnpZdFpEUTBaRFJrTVdJNE1EWmlMVEV5TURZeE1qaz0vdGlueS9DbHVtaW8ucG5n&amp;key=1bad8c884d0157ffe38686f064b8456d977033b2cd67614f6eaf049756746a5acf5e19febc01b1573f6d92ffe5c19f4de622fadb3b4362de114354d38277751f\"/></div></div><p><a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/3cc4da8b-9ab8-49ac-a82b-90af6eca17bf\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Primary Logo\" border=\"0\" src=\"https://ml.globenewswire.com/media/3cc4da8b-9ab8-49ac-a82b-90af6eca17bf/small/clumio-logo-stacked-png.png\" style=\"max-height:145px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS8zY2M0ZGE4Yi05YWI4LTQ5YWMtYTgyYi05MGFmNmVjYTE3YmYvc21hbGwvY2x1bWlvLWxvZ28tc3RhY2tlZC1wbmcucG5n&amp;key=2fadecf1c2e6d7158b7013ed076a9ef8fe909e44c60a5288d7f6858e6d19dcf632f14a70e1d825642da22436a7c9041995cfbf97ec1abc408012282e842dec59\"/></div></div></a></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">GlobeNewswire, Inc. 2021</p></div>"}