{"date": "2021-11-01 17:16:55.790000+00:00", "ticker": "III", "mrkt_info": {"open": 1362.0, "close": 1368.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 9768QSenior PLC01 November 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>Senior plc</span>\n</p>\n<p>\n<span>Appointment of new non-executive Director</span>\n</p>\n<p>\n<span>Senior plc (\"Senior\"), an international manufacturer of high-technology components and systems, with operations in 12 countries</span>\n<span>, is pleased to announce the appointment of Mary Waldner as a non-executive Director with effect from 1 December 2021.</span>\n</p>\n<p>\n<span>Mary has been the Chief Financial Officer of Lloyd's Register since March 2016. Lloyd's Register is a global professional services company specialising in engineering and technology for the maritime industry. Mary is also a non-executive Director and Chair of the Audit and Risk Committee of Oxford Instruments plc (\"Oxford Instruments\"), having been appointed in February 2016. Oxford Instruments is a provider of high technology products and services to the world's leading industrial manufacturers and scientific research institutes.</span>\n</p>\n<p>\n<span>Mary was previously the Group Finance Director of Ultra Electronics Holdings plc, the Director, Group Finance at QinetiQ Group plc and Group Financial Controller of 3i Group plc. Prior to this, Mary held a number of senior roles at British Airways, General Motors and Vauxhall Motors.</span>\n</p>\n<p>\n<span>Mary holds an MA (Hons) in Physics and is a Fellow of the Chartered Institute of Management Accountants.</span>\n</p>\n<p>\n<span>Senior plc Chairman, Ian King said: \"We are very pleased that Mary has agreed to join the Board. Mary's background and experience in finance and in the engineering sector will complement the current Board membership and prove invaluable to us in Senior's continued development.\"</span>\n</p>\n<p>\n<span>Mary Waldner holds, or has held, in the past 5 years the following positions where she is or was acting in the capacity of a director of a publicly quoted company:</span>\n</p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>Current Directorships</span>\n</p>\n</td>\n<td>\n<p>\n<span>Appointed to Oxford Instruments plc as a non-executive Director on 4 February 2016.</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Previous Directorships</span>\n</p>\n</td>\n<td>\n<p>\n<span>N/A</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>No further information is required to be disclosed pursuant to Listing Rule 9.6.13R.</span>\n</p>\n<p>\n<span>Further information</span>\n</p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>David Squires</span>\n</p>\n</td>\n<td>\n<p>\n<span>Group Chief Executive, Senior plc</span>\n</p>\n</td>\n<td>\n<p>\n<span>+44 (0) 1923 714 738</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Bindi Foyle</span>\n</p>\n</td>\n<td>\n<p>\n<span>Group Finance Director, Senior plc</span>\n</p>\n</td>\n<td>\n<p>\n<span>+44 (0) 1923 714 725</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Richard Webster-Smith</span>\n</p>\n</td>\n<td>\n<p>\n<span>Finsbury</span>\n</p>\n</td>\n<td>\n<p>\n<span>+44 (0) 7796 708 551</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>About Senior</span>\n</p>\n<p>\n<span>Senior is an international manufacturing group with operations in 12 countries. It is listed on the main market of the London Stock Exchange (symbol SNR). Senior designs, manufactures and markets high technology components and systems for the principal original equipment producers in the worldwide aerospace, defence, land vehicle and power &amp; energy markets. Further information on Senior plc may be found at:</span>\n<span>\n<a href=\"http://www.seniorplc.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.seniorplc.com</a>\n</span>\n</p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>BOAGZMGMNMDGMZM</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}