{"date": "2022-02-10 16:41:50.623000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3223.79, "close": 3065.87}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>RACKSPACE TECHNOLOGY INC (\"RXT-Q\")\n- Positioned as a Leader in Three Categories of 2021 ISG Provider\n- Lens(TM) AWS Ecosystem Partners Report for US and Germany\n\n     Rackspace Technology(R), a leading end-to-end, multicloud technology\nsolutions company, today announced it has been named a Leader in three\nquadrants of the 2021 ISG Provider Lens(TM) AWS Ecosystem Partners Report\nfor the US and Germany due to its numerous AWS competencies, partner\nprograms and the extensive AWS certifications.\n\n     The report evaluates the capabilities of 52 providers across six\nareas. Rackspace Technology has been placed as a Leader for Germany in\nConsulting Services, Migration Services, and Managed Services. In addition\nto the Leader positions, Rackspace Technology was also positioned for AWS\nSAP Workloads for the US and Germany.\n\n     \"As companies are making the transition to AWS, they need a trusted\npartner to assist with that transition and to optimize their cloud\nenvironments and tools,\" said Jeff DeVerter, Chief Technology Evangelist at\nRackspace Technology. \"Rackspace Technology provides consulting services\nand migration support during cloud environment development and operations\nphases followed-up by managed services. All of this helps our customers to\nachieve success in the market. ISG's recognition of our leadership in this\nimportant role is quite an honor.\"\n\n     ISG, a leading global technology research and advisory firm.\n\n     Rackspace Technology counts more than 2,700 certifications worldwide\nwith 15 competencies.\n\n     Frank Heuer, Principal Analyst, and study author at ISG says:\n\"Rackspace can showcase its strengths as an AWS partner in the US and\nGermany, especially in the migration services market, because Rackspace is\na particularly competent and experienced service provider for AWS migration\nthat can offer a comprehensive service portfolio.\"\n\n     About Rackspace Technology\nRackspace Technology is a leading end-to-end multicloud technology services\ncompany. We can design, build, and operate our customers' cloud\nenvironments across all major technology platforms, irrespective of\ntechnology stack or deployment model. We partner with our customers at\nevery stage of their cloud journey, enabling them to modernize\napplications, build new products and adopt innovative technologies.\n\nContact:Natalie Silva\nRackspace Technology Corporate Communications\npublicrelations@rackspace.com\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204000652.MNPRE2204002328-08105220220210</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}