{"date": "2021-11-12 08:00:00.245000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3482.05, "close": 3525.15}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Ingram Micro Cloud Now Offers AWS Cloud Services in Hungary and Poland as Part of Continued Global Expansion</b>\n</p><p>\nIngram Micro Cloud today announced that it is now <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fde.cloud.im%2Fen%2Fproducts%2Famazon%2Fweb-services&amp;esheet=52528073&amp;newsitemid=20211112005051&amp;lan=en-US&amp;anchor=distributing&amp;index=1&amp;md5=0cdd899e09495d20beae7feebb3ff5ba\" data-type=\"url\" class=\"tr-link\" translate=\"no\">distributing</a> a full range of Amazon Web Services, Inc. (AWS) products and services to its reseller network in Hungary and Poland. The move bolsters the global offering of Ingram Micro’s Cloud Marketplace, one of the world’s most comprehensive and broadly adopted set of cloud solutions.\n</p><p>\nIngram Micro Cloud, an AWS Advanced Consulting Partner and AWS Distributor,<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.businesswire.com%2Fnews%2Fhome%2F20210309005173%2Fen%2FIngram-Micro-Cloud-Announces-New-Global-Strategic-Collaboration-Agreement-with-AWS&amp;esheet=52528073&amp;newsitemid=20211112005051&amp;lan=en-US&amp;anchor=announced&amp;index=2&amp;md5=4f3f90e3404b8fb1522c95fa3d91db5d\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> announced</a> its global Strategic Collaboration Agreement (SCA) with AWS in March this year. One of the central objectives of the agreement between the business leaders is extending the global reach and footprint of AWS and its partners. As part of this global expansion, Ingram Micro Cloud is now delivering a complete portfolio of AWS solutions to resellers in Hungary and Poland, in addition to its recent launches in France, Mexico, Australia, and New Zealand, which were part of a series of authorizations in 2021. As a result of the SCA with AWS, Ingram Micro expects its large network of partners to see new opportunities to meet customer needs and expand their infrastructure as a service (IaaS) business.\n</p><p>\n\"The distribution alliance between Ingram Micro Cloud and AWS in our region is a great strategic milestone for us,” said Attila Virágh, Managing Director at Ingram Micro Hungary. “Teaming further with AWS brings tremendous opportunity and additional business value to our channel partners within the cloud ecosystem by helping them execute at scale, and quickly meet the business needs of their customers.”\n</p><p>\n“I’m happy to see AWS joining our marketplace offering in Central and Eastern Europe. I am confident this relationship will significantly contribute to the acceleration of as-a-service models and customers’ cloud migration,” said Jacek Jedraszka, Managing Director at Ingram Micro Poland.\n</p><p>\nAWS and Ingram Micro Cloud are working together to bolster Ingram Micro Cloud’s current skills and offerings, as well as develop new resources to support channel partners in managing end customers. Ingram Micro Cloud currently provides an AWS Cloud Center of Excellence (CCoE) team with 200+ AWS Certifications, AWS Professional Services, AWS Managed Services, AWS Well-Architected Services, AWS Operations and Billing Services, and more.\n</p><p>\nIngram Micro Cloud also covers a wide range of partner enablement and support initiatives to help AWS Partners build an AWS practice through its partner programs, which provide end-to-end engagement models for Ingram Micro Cloud to enable systems integrators (SIs) and independent software vendors (ISVs) in their journey on the cloud.\n</p><p>\n“We are pleased to differentiate our broad portfolio of cloud services with the addition of AWS on our Cloud Marketplace,” said Nora Papp, Head of Cloud for Central and Eastern Europe at Ingram Micro. “Through this important expansion of pioneering solutions and services, Ingram Micro Cloud is offering our reseller partners the seamless capability to build a successful AWS practice and deliver greater value to their customers.”\n</p><p>\nFurther information about Ingram Micro Cloud’s AWS offerings can be found <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fde.cloud.im%2Fen%2Fproducts%2Famazon%2Fweb-services%2F%3Futm_campaign%3DAWS%26utm_source%3DPress&amp;esheet=52528073&amp;newsitemid=20211112005051&amp;lan=en-US&amp;anchor=here&amp;index=3&amp;md5=7abab21580ff5af604101fa5e9794d32\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a>.\n</p><p>\n<b>About Ingram Micro Cloud</b>\n</p><p>\nIngram Micro Cloud brings together innovators and problem solvers to help the world accomplish more. It facilitates and manages the cloud’s complex digital value chain—all powered by CloudBlue technology. Ingram Micro Cloud operates in 76 countries with over 55,000 reseller partners, and its Cloud Marketplace serves 17.2 million seats, offering more than 120 cloud solutions. With unmatched global reach, easy access to automated go-to-market and integration tools, deep technical expertise, and a curated selection of scalable SaaS and IaaS solutions, Ingram Micro Cloud helps vendors, resellers and managed service providers by offering More as a Service. Detailed information is available at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.ingrammicrocloud.com%2F&amp;esheet=52528073&amp;newsitemid=20211112005051&amp;lan=en-US&amp;anchor=www.IngramMicroCloud.com&amp;index=4&amp;md5=4e724df2cc8546eb8e66cbf679b7acbf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.IngramMicroCloud.com</a>.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211112005051r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTEyMDA1MDUxcjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=eb373a173e071ce19e9b26753318ac387de1e5f95d98e8d991753f5f00d0c1618afdf5b609e4886813d8ed2f633f2168a869f7804f9d26d10e7cf7dc9b0d9584\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211112005051/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211112005051/en/</a></span></p><p>\nPeter Toth\n<br/>Business Operations Manager\n<br/>Ingram Micro Hungary\n<br/><a href=\"mailto:peter.toth2@ingrammicro.com\" data-type=\"email\" translate=\"no\">peter.toth2@ingrammicro.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: INGRAM-MICRO-CLOUD</p></div>"}