{"date": "2021-11-19 00:03:21.187000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3549.0, "close": 3676.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">Apex and Kitchen United Expand Partnership Adding Two Ghost Kitchen Pickup Locations</p>\n<p>MASON, Ohio and PASADENA, Calif., Feb. 17, 2022</p>\n<p>Apex smart food lockers will increase self-serve pickup options for Kitchen United customers</p>\n<p>\n<span>MASON, Ohio</span> and <span>PASADENA, Calif.</span> , <span>Feb. 17, 2022</span> /CNW/ -- Apex Order Pickup Solutions, a leading global provider of contactless smart order pickup solutions for use in foodservice, retail and B2B ecommerce, and ghost kitchen pioneer, Kitchen United, today announced an expansion of their partnership to offer self-serve automated food lockers at two additional locations in <span>Garden City, New York</span> and <span>Torrance, California</span> for their new Grab Go Eat concept.</p>\n<p>More people than ever before are enjoying the convenience of online and mobile ordering as well as contactless pickup. Smart food lockers for digital order pickup have become more prominent with the growth in the ghost kitchen channel as well as an increased appetite for contactless pickup among customers.</p>\n<p>\"We are thrilled to grow our partnership with Kitchen United as the ghost kitchen concept continues to thrive,\" said Apex Order Pickup Solutions Chief Executive Officer <span>Mike Wills</span> . \"The innovative technology that is the heart of our Apex smart food lockers allows Kitchen United to track their orders from creation to pick up, increase efficiency based on real-time data insights and ensure busy customers can pick up their food orders quickly and safely.\"</p>\n<p>Apex smart food lockers are powered by its next generation software, ApexIQ™, which provides a variety of levels of operator control and real-time analytics that are unmatched. ApexIQ helps operators increase throughput and transactions, reduce lines/wait times, while also providing real-time data and insights to enhance the overall dining experience.</p>\n<p>Customers order from the Kitchen United Mix app, website or kiosks and select the time they want to pick up their food from the locker location that is most convenient for them. Once the order is ready, Kitchen United employees simply scan a code to load the order into the locker. Customers, in turn, receive a unique pickup QR code to scan at the locker, take their order, and go on their way.</p>\n<p>\"Kitchen United has been using the Apex smart food lockers since the beginning of 2021 and we're impressed with how simple they are for both our employees and our customers to use,\" said Kitchen United Chief Operating Officer <span>Joy Lai</span> . \"Placing Apex smart lockers in high-traffic or centrally located sites allows us to bring even more convenience to our customers by offering them not only the ability to order from multiple restaurants via a single platform, but also the option of picking up their food in a simple and quick manner.\"</p>\n<p>\n<span>About Apex Order Pickup Solutions</span> Apex is a leading global provider of contactless smart order pickup solutions for use in foodservice, retail and B2B ecommerce. The Apex Heated Pickup Station was a recipient of the 2019 Kitchen Innovations Award from the National Restaurant Association. Apex self-serve order pickup solutions are in use in over 5,000 locations globally. Apex is headquartered in <span>Mason, Ohio</span> . Learn more at <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3447491-1&amp;h=1632953349&amp;u=https%3A%2F%2Fapexorderpickup.com%2F&amp;a=https%3A%2F%2Fapexorderpickup.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://apexorderpickup.com</a> .</p>\n<p>\n<span>About Kitchen United</span> Founded in 2017, Kitchen United is a leading provider of restaurant hub technology, streamlined logistics and turn-key commercial kitchen space that empowers foodservice operators to tap into the growing off-premise business opportunity and offers consumers a first-of-its-kind to-go experience. The company offers a value-driven, low-risk way for emerging and established restaurant brands to enter into new markets, grow revenue through off-premise dining and expand delivery areas. For additional information, please visit: <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3447491-1&amp;h=695191522&amp;u=https%3A%2F%2Fc212.net%2Fc%2Flink%2F%3Ft%3D0%26l%3Den%26o%3D3248593-1%26h%3D3719372785%26u%3Dhttp%253A%252F%252Fwww.kitchenunited.com%252F%26a%3Dhttp%253A%252F%252Fwww.kitchenunited.com&amp;a=http%3A%2F%2Fwww.kitchenunited.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.kitchenunited.com</a> .</p>\n<p>View original content to download multimedia: <a href=\"https://www.prnewswire.com/news-releases/apex-and-kitchen-united-expand-partnership-adding-two-ghost-kitchen-pickup-locations-301485005.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/apex-and-kitchen-united-expand-partnership-adding-two-ghost-kitchen-pickup-locations-301485005.html</a>\n</p>\n<p>SOURCE Apex Order Pickup Solutions</p>\n<p>View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/February2022/17/c8730.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/February2022/17/c8730.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}