{"date": "2021-11-19 23:46:12.541000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3696.06, "close": 3572.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>BETTER PLANT SCIENCES INC (\"PLNT-Z;VEGGF-0\")\n- Closes Private Placement\n\n     Better Plant Sciences Inc. (\"Better Plant\"), a wellness company that\ndevelops and sells sustainable, plant-based products, announces that today\nit closed a private placement, issuing 3,770,121 units at $0.05 per unit.\nEach unit consisted of 1 common share (each, a \"Share\") and 1 common share\npurchase warrant (each, a \"Warrant\") with each warrant entitling the holder\nto acquire 1 common share at $0.05 for a period of 12 months.  No finders\nfees were paid in connection with the issuance.\n     Of the units issued, 3,288,864 units were issued for debt settlement\nand 1,435,077 units were issued to a related party.  The Shares and\nWarrants are subject to a 4 month hold period.\n     About Better Plant Sciences Inc.\n     Better Plant harnesses plant intelligence and leverages modern science\nto offer sustainable, plant-based products that are better for health and\nbetter for the earth. It makes and sells over 75 proprietary products, all\nmade with 100% natural ingredients, under the brands Jusu, Urban Juve and\nWright &amp; Well.  Better Plant operates Jusu Bar, a quick serve restaurant\nalternative in Victoria, BC, which serves up fresh, healthy, and nutritious\noptions with a focus on Jusu cold-pressed juices. Jusubar.com offers home\ndelivery of refrigerated plant-based beverages consisting of cold-pressed\njuices and packaged juice cleanses. Through its Shopify enabled eCommerce\nsites getjusu.com and urbanjuve.com, Better Plant sells plant-based\npersonal care products and cleaning products. Better Plant products are\nsold through a network of over 150 online and brick and mortar retail\nlocations including Whole Foods Market, Pharmasave, Healthy Planet and\nVitasave. Better Plant also offers operational, financial, and other\nservices to companies with businesses that align with Better Plant's\nmission to help create a better world.\n     For more information on Better Plant, visit betterplantsciences.com or\nfollow on Instagram, Twitter or LinkedIn.\n\nPenny White, President &amp; CEO\npenny@betterplantsciences.com\n1-833-515-2677\n\nInvestor Relations:\nAlexandra Dumanski\ninvest@betterplantsciences.com\n1-833-515-2677\n\nThe Canadian Securities Exchange has not reviewed, approved or disapproved\nthe contents of this news release.\n\nCautionary Statement Regarding Forward-Looking Statements\nThis press release includes forward-looking information and statements\n(collectively, \"forward looking statements\") under applicable Canadian\nsecurities legislation.  Forward-looking statements are necessarily based\nupon a number of estimates, forecasts, beliefs and assumptions that, while\nconsidered reasonable, are subject to known and unknown risks,\nuncertainties, and other factors which may cause actual results and future\nevents to differ materially from those expressed or implied by such\nforward-looking statements.  Such risks, uncertainties and factors include,\nbut are not limited to: risks related to the development, testing,\nlicensing, brand development, availability of packaging, intellectual\nproperty protection, reduced global commerce and reduced access to raw\nmaterials and other supplies due to the spread of COVID-19, the potential\nfor not acquiring any rights as a result of the patent  application and any\nproducts making use of the intellectual property may be ineffective or the\ncompany may be unsuccessful in commercializing them; and other approvals\nwill be required before commercial exploitation of the intellectual\nproperty can happen. Demand for the company's products, general business,\neconomic, competitive, political and social uncertainties, delay or failure\nto receive board or regulatory approvals where applicable, and the state of\nthe capital markets.  Better Plant cautions readers not to place undue\nreliance on forward-looking statements provided by Better Plant, as such\nforward-looking statements are not a guarantee of future results or\nperformance and actual results may differ materially. The forward-looking\nstatements contained in this press release are made as of the date of this\npress release, and Better Plant expressly disclaims any obligation to\nupdate or alter statements containing any forward-looking information, or\nthe factors or assumptions underlying them, whether as a result of new\ninformation, future events or otherwise, except as required by law.\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132205195.MNPRE2132206768-15455620211119</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}