{"date": "2022-01-11 17:32:12.557000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">FH Health Accelerates The Provincial Vaccination Drive By Opening A Mass Booster Vaccination Clinic In Partnership with the Toronto Zoo</p>\n<p>TORONTO, Jan. 11, 2022</p>\n<p>\n<span>TORONTO</span> , <span>Jan. 11, 2022</span> /CNW/ - Beginning <span>January 12, 2022</span> , you will be able to book your booster at the most recent mass vaccination clinic – Your Toronto Zoo!</p>\n<p>\n\n</p>\n<p>In partnership with FH Health, the Toronto Zoo is proud to be supporting this initiative that will add more than 5,000 daily jabs to the Province's booster campaign.</p>\n<p>\"The last mile is always the hardest,\" says <span>Melody Adhami</span> , President of FH Health. \"Our job is to make it as easy as possible for Ontarians to get boosted and that means working hand in hand with the Province and the incredible team at the Toronto Zoo.\"</p>\n<p>\"Your Toronto Zoo plays a vital role in supporting our community, and one of the best ways we can do that right now is by offering our Zoo as a mass booster vaccination location,\" says <span>Dolf DeJong</span> , Chief Executive Officer of the Toronto Zoo. \"We are committed to supporting measures that will keep our community healthy and safe, and one of the best ways for us to do that right now is by hosting thousands of Ontarians here to get their booster shot.\"</p>\n<p>The clinic will start on <span>January 12, 2022</span> and run seven days a week. Appointments are required in advance and can be booked at <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3409744-1&amp;h=3873149114&amp;u=http%3A%2F%2Ffhvax.com%2F&amp;a=fhvax.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">fhvax.com</a>\n</span> .</p>\n<p>\"By bringing vaccines directly to the people through mass vaccination clinics like the one at the Toronto Zoo, we are helping more residents get the protection they need for themselves, their families and their communities,\" said Solicitor General <span>Sylvia Jones</span> . \"I urge everyone who is eligible to get vaccinated whether it's your first, second or booster shot, and advise that we continue to follow public health guidance.\"</p>\n<p>Education and child care staff will be prioritized at the mass vaccination site at the Toronto Zoo. Priority time slots will be made available to education and child care staff outside of school hours. A special booking link is available on <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3409744-1&amp;h=3873149114&amp;u=http%3A%2F%2Ffhvax.com%2F&amp;a=fhvax.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">fhvax.com</a>\n</span> for education and child care staff to access.</p>\n<p>\"Our team has been working around the clock to make this happen. I'm grateful to everyone along the long supply chain that makes this work. All I can say is when you see the relief in people's eyes once they get their boost, that's what makes it worth it. That's what we're here for,\" says Adhami.</p>\n<p>To book an appointment or for more information, please visit <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3409744-1&amp;h=3873149114&amp;u=http%3A%2F%2Ffhvax.com%2F&amp;a=fhvax.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">fhvax.com</a>\n</span> .</p>\n<p>On the day of your scheduled appointment, please arrive at the front entrance gate, located at 2000 Meadowvale Road, <span>Toronto</span> . From there, there will be signage and staff who will be able to assist with getting to the Special Events Centre. Upon arrival, you will be asked to show a proof of double vaccination QR code and ID. Please note there will not be animals available for viewing.</p>\n<p>\n<span>About FH Health</span>\n</p>\n<p>FH Health is a health-tech company on a mission to power the health industry globally through its innovative health-tech stack that modernizes care for patients and clinicians. FH Health's COVID-19 Pilot, has developed the foundations of its proprietary tech based approach that enable its clinical footprint. The company has developed partnerships with airlines, consulates, embassies and leading firms including Amazon, Apple, BMO and Brookfield Asset Management to promote better health outcomes locally and globally.</p>\n<p>\n<span>About Toronto Zoo</span>\n</p>\n<p>Your Toronto Zoo's mission is to connect people, animals and conservation science to fight extinction and our vision is a world where wildlife and wild spaces thrive. An iconic tourist attraction and Conservation organization, the Toronto Zoo boasts a number of leading programs for helping wildlife and their natural habitats – from species reintroduction to reproductive research. A world-class educational centre for people of all ages, the Toronto Zoo is open every day including <span>December 25</span> and attracts approximately 1.2 million guests each year.</p>\n<p>SOURCE FH Health</p>\n<p>View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/January2022/11/c1769.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/January2022/11/c1769.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}