{"date": "2021-12-16 15:00:07.598000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3381.83, "close": 3377.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">Most recent campaign demonstrates potential for YouTube to drive brand lift and conversions in combination with other CTV platforms</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">BOSTON, Dec. 16, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">BOSTON</span>, <span class=\"xn-chron\">Dec. 16, 2021</span> /PRNewswire/ <b>-- </b>Pixability (<a href=\"http://www.pixability.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.pixability.com</a>), the only provider of software and insights for video advertising on YouTube, YouTube on TV, Amazon Fire, Roku, and other Connected TV (CTV) platforms today shared results of a landmark campaign developed together with Saucony and media agency iProspect. The major campaign targeted audiences primarily on CTV using Pixability's optimization and insights platform. Relying heavily on YouTube, in conjunction with other leading CTV platforms, the campaign drove record results.</p>\n<p>In 2020, Saucony launched its first major CTV-focused marketing campaign, working with Pixability and iProspect to optimize targeting across several video platforms. This collaboration recently received a Digiday Technology Award for Best Buy-Side Programmatic Platform. Saucony aimed to expand the scope of the partnership in 2021 to launch the company's new Kinvara 12, Ride 14 and Endorphin Collection, incorporating additional platforms and other shoe franchises. Pixability developed a targeting plan designed for YouTube, Roku and Amazon, optimizing tactics more than 143,000 times on YouTube alone.</p>\n<p>During the campaign, Pixability deployed behavioral targeting tactics to reach potential customers who previously searched for post-workout and recovery products. The campaign led to a 128% lift in Google searches for the Kinvara 12, Ride 14 and Endorphin Collection; a 28.5% lift in Saucony product searches on Amazon.com and the Amazon app; and a 21.2% lift for awareness, consideration and purchase among Roku audiences. According to independently-verified data, the campaign drove nearly 6,000 purchases, and 65% of purchases tracked on Amazon were new to the Saucony brand.</p>\n<p>\"We were extremely happy with the unprecedented lift and purchases that resulted from this campaign,\" said <span class=\"xn-person\">Grace Smith</span>, Senior Digital Marketing Manager at Saucony. \"Our partnership with Pixability demonstrates the reach and results that can be achieved by including YouTube in conjunction with other video platforms in a CTV-focused campaign.\"</p>\n<p>According to Comscore, YouTube represents more than 40% of CTV viewing hours among ad-supported platforms but can often be underrepresented in CTV campaigns. Pixability is the only video technology company to offer access to 99% of viewing hours on CTV for any single campaign, including YouTube on TV, Roku, and Amazon Fire TV.</p>\n<p>\"As we continue to see ad dollars shift from traditional TV to Connected TV advertising, many brands are starting to recognize that YouTube is the leading ad-supported platform in CTV in terms of reach,\" said <span class=\"xn-person\">David George</span>, CEO of Pixability. \"We were proud to work with Saucony and iProspect on these campaigns that included YouTube and other key CTV platforms, and that the campaigns drove both reach and measurable bottom of the funnel results.\"</p>\n<p><b>About Pixability<br/></b>Pixability is a technology and data company that empowers the world's largest brands and their agencies to maximize the value of video advertising on YouTube, YouTube on TV, Amazon Fire, Roku and Hulu. The company's industry-leading optimization and insights solutions are independently verified by the YouTube Measurement Program, DoubleVerify, Oracle Data Cloud's Moat Measurement, Integral Ad Science and other third parties. Pixability's suite of solutions are used by the top media agencies and brands including Dentsu-Aegis, Havas, Interpublic Group, Omnicom, Publicis, and GroupM, as well as Swatch, Bose, KIND, Hilton, Jack in the Box, and Puma. For more information about Pixability, please visit <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3391794-1&amp;h=3960113559&amp;u=http%3A%2F%2Fwww.pixability.com%2F&amp;a=www.pixability.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.pixability.com</a></u>.</p>\n<p><b><span>About Saucony</span></b><span>: <br/></span>Saucony, the 'Original Running Brand' and a division of Wolverine World Wide, Inc. (NYSE: WWW), is a leading global performance running brand that fuses <b>innovation</b>, style and culture. Widely recognized for award-winning technologies including PWRRUN™ PB, PWRRUN+™, and SPEEDROLL™, Saucony creates innovative technical and lifestyle footwear and apparel across Road, Trail and Originals. Founded in 1898, Saucony exists to inspire and serve all humans to live their best life by providing access to running, self-expression and creating a better world. For more information, go to <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3391794-1&amp;h=2544441327&amp;u=https%3A%2F%2Fnam02.safelinks.protection.outlook.com%2F%3Furl%3Dhttp%253A%252F%252Fwww.saucony.com%252F%26data%3D04%257C01%257Cjessica.newton%2540saucony.com%257C5371549570d4448c90ca08d9982a0727%257Cdeace5d6717b4f79ab126357206c0c36%257C0%257C0%257C637708128536282917%257CUnknown%257CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%253D%257C1000%26sdata%3DYTOia2JMplcyMn6GQdFFfbESDrs4B405QxI%252Bi8T0xEM%253D%26reserved%3D0&amp;a=www.saucony.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.saucony.com</a>.</p>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=NE09440&amp;sd=2021-12-16\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1ORTA5NDQwJnNkPTIwMjEtMTItMTY=&amp;key=dcd06b4bc161a87d0b01065ee1730b36988aed44d6bad3bc41ccc671c0090e3f2f5502e673146a7dec8b02e71b5b87f0914dd313f4628813a540b0d506938944\"/></div></div> View original content:<a href=\"https://www.prnewswire.com/news-releases/leading-global-performance-running-brand-saucony-leverages-pixability-to-optimize-connected-tv-campaigns-across-youtube-amazon-fire-tv--roku-301446613.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/leading-global-performance-running-brand-saucony-leverages-pixability-to-optimize-connected-tv-campaigns-across-youtube-amazon-fire-tv--roku-301446613.html</a><p></p>\n<p>SOURCE  Pixability</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: PIXABILITY-tv</p></div>"}