{"date": "2021-12-09 12:25:12.136000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.29, "close": 3483.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p></p><pre>    MILAN (AP) ? Italy's anti-trust authority on Thursday \nfined Amazon 1.13 billion euros ($1.3 billion), accusing the \ncompany of exploiting its dominant position against independent \nsellers on its website in violation of European Union competition \nrules. \n    The fine is one of the largest leveraged in Europe against the \nonline retail giant, which expanded in particular in Italy during \na coronavirus lockdown that prevented residents from going \nto stores to buy items considered nonessential. \n    Europe has pioneered efforts to rein in big tech companies, most \nfamously by slapping Google with multibillion-dollar fines \nin three antitrust cases. The push is gaining steam worldwide \nas regulators and lawmakers take on digital giants over accusations \nof everything from stifling competition to failing to prevent \nharmful content from appearing on their platforms. \n    Amazon said it \"strongly disagreed\" with Italian regulator's \ndecision and would appeal, calling the fines and proposed remedies \n\"unjustified and disproportionate.\" It noted that more than \nhalf of annual sales in Italy are from small and medium businesses \nthat have access to other channels to sell their goods. \n    Italy's AGCM authority said Amazon has required that third-party \nsellers use its own logistics service, called Fulfilment by \nAmazon, harming competitors and strengthening its own position. \n    The e-commerce giant also prevents third-party sellers from \ngaining access to Amazon's Prime loyalty program, \"which makes \nit easier to sell to the more than 7 million most-loyal and highest-spending \nconsumers.\" \n    That means such sellers also are excluded from special events, \nincluding Black Friday, Cyber Monday and Prime Day offers, thereby \nalso decreasing the chances that the sellers' items will appear \nas a \"featured offer.\" \n    \"The investigation showed that such benefits are crucial to \ngain visibility, to boost sales and, in turn, to the success of \nthe sellers' offers on Amazon.it,'' the regulator said. \n    The authority has ordered Amazon to grant sales benefits and \nvisibility on Amazon.it to all third-party sellers able to meet \nthe standards of its Prime service, which it must publish. \n\n\n    Copyright ? 2021 Refinitiv and/or its affiliates. All \nrights reserved. The Refinitiv content received through this \nservice is the intellectual property of Refinitiv or its third \nparty suppliers. Republication or redistribution of content \nprovided by Refinitiv is expressly prohibited without the prior \nwritten consent of Refinitiv, except where permitted by the \nterms of the relevant Refinitiv service agreement. Neither \nRefinitiv nor its third party suppliers shall be liable for any \nerrors, omissions or delays in content, or for any actions taken \nin reliance thereon. Refinitiv and its logo are trademarks or \ntrademarks of the Refinitiv group of companies around the world. \n\n\n    </pre>\n\n<p></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) 2021 Refinitiv. All rights reserved.</p></div>"}