{"date": "2022-01-28 09:56:15.592000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2777.45, "close": 2879.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>An <a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> packer has alleged that she is routinely sexually harassed by male colleagues at the warehouse where she works.</p><p>In a <a href=\"https://www.independent.co.uk/topic/tiktok\" data-type=\"url\" class=\"tr-link\" translate=\"no\">TikTok</a> video on Sunday, Priscilla, who goes by the username @misss_thanggg, posted comments that she receives while she packs at the warehouse.</p></div><div class=\"tr-npp-body\"><p>She captioned the video as \"if you work at Amazon, you know.\"</p><p>The video showed her packing boxes with captions of comments she received.</p><p>The captions included, \"What's your snap [Snapchat]?\", \"Let's chill on break\" and \"Ayye what's your name?\"</p><p>She also refers to a man as a \"thirsty water spider\" as he comes up to her and asks for her number.</p><p>The TikTok video received over 105,000 views and over 10,000 likes by Monday. However, on Tuesday it was deleted.</p><p>Users on the social media platform responded to the clip with sexist comments including blaming her clothes for the harassment she allegedly faces.</p><p>\"Now is the way she's at work the appropriate work clothing. Then calls guys thirsty,\" wrote one user.</p><p>Another user wrote, \"I mean you look very welcoming with that outfit why you complaining.\"</p><p>\"Why dress like that at a warehouse,\" said another comment.</p><p>Priscilla took on some of the sexist comments directed at her and said: \"Boy I can be wearing a damn sweater and joggers they still be attacking like piranhas lmao.\"</p><p>She also found support from other users who defended her and said what she wore is not a cause for harassment.</p><p>\"The fact that you guys are saying because of what she's wearing is what's wrong with the world, a girl she be able to wear what she wants,\" wrote one user.</p><p>Some other users said that they had faced similar incidents while working at Amazon.</p><p>One user wrote: \"She ain't wrong I work at Amazon and most of the guys are like that sum of the girls are like that too.\"</p><p>\"People gotta stop harassing girls at work. You keep your head up. You're gooï ̧\u008fd, stay safe,\" wrote one user.</p><p>Employees at Amazon have flagged instances of sexual harassment in the past.</p><p>Last year in May, women working in corporate roles or warehouse management filed lawsuits against Amazon based on alleged discrimination from white managers, reported Dailydot.</p><p>In May 2020 a Canadian woman alleged that she was groped and forced to kiss an HR manager. She said she was blamed later when she tried to report the incident.</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/travel/news-and-advice/tourist-nazi-salute-auschwitz-poland-b2000072.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Tourist detained by police after making Nazi salute outside Auschwitz</a> </p><p><a href=\"https://www.independent.co.uk/news/uk/home-news/boy-swallowed-magnets-tiktok-challenge-b1920659.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Schoolboy almost dies from swallowing magnets for TikTok challenge</a> </p><p><a href=\"https://www.independent.co.uk/life-style/upper-east-side-apartment-tiktok-b1920202.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Woman shares honest review of New York City apartment</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/tiktok-mom-backlash-son-run-b1919372.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">TikTok mom slammed after making 5-year-old son run in 104 degree heat</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 Independent, The (UK) (Online). All rights reserved.</p></div>"}