{"date": "2021-11-08 11:01:11+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Nupur Anand and Sankalp Phartiyal</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">MUMBAI, Nov 8 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>India's buy-now-pay-later (BNPL) industry is booming and set to surge over ten-fold within four years as tens of millions of online shoppers get lured by interest-free credit with fewer hassles, market players told Reuters.</p><p>Redseer estimates India's BNPL market will rocket to $45-50 billion by 2026 from $3-3.5 billion now. The research firm also estimates that the number of BNPL users in the country may rise to 80-100 million customers by then, from 10-15 million currently. </p><p>However, since the maximum credit currently being offered on BNPL is 100,000 rupees ($1,347.89), much lower than credit card offers, it will take some time before it can disrupt the cards market or wrest market share, said analysts at Macquarie <span class=\"tr-strong\">Research</span>.</p><p>Fintech firm MobiKwik sees BNPL business nearly doubling for the company in two years, in a country where hundreds of millions of people have little access to formal credit.</p><p><span class=\"tr-strong\">MobiKwik, which is among the top BNPL players in India and is backed by the Abu Dhabi Investment Authority, said income from the segment accounted for nearly a fifth of its 3.02 billion rupees revenue for the financial year ending March 31.</span></p><p>\"Only 60-70 million Indians have access to credit today, which means 93% of India has no access to credit,\" said Upasana Taku, co-founder of the firm. </p><p>\"It will become the fastest revenue driver for the business because there has been a 45X growth in the BNPL transactions in the last two years. New user addition is very high; repeat rate and average ticket size is going up.\"</p><p>As the COVID-19 pandemic sent more and more people towards online shopping, <span class=\"tr-strong\">the demand for easy loans has driven more players to enter the BNPL market </span>- Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> <span class=\"tr-strong\">joined the BNPL bandwagon in 2020 while homegrown payments firm BharatPe started the service last month.</span></p><p>\"A very large population of millennials and young customers during the pandemic were looking for credit and to extend their budgets, because of different uncertainties in these times,\" said Vikas Bansal, director of Amazon Pay India, explaining the new-found interest in BNPL.</p><p>To be sure, there are concerns that risk of defaults from the BNPL customers with limited or no credit history could be higher even as some industry experts add that certain players may not be reporting accurate default details to credit bureaus.</p><p>The Reserve Bank of India did not immediately respond to a request seeking comment.</p><p><br/></p><p>ADDITIONAL LINE OF CREDIT</p><p>Mumbai resident Divya Menon said she recently tried the buy-now-pay-later option on an e-commerce website for an item costing less than $10. She said she found it so convenient that she's now opting for it on multiple platforms.</p><p>\"Once BNPL is activated, it is just a one-step process,\" said Menon, who works in human resources at an IT services firm. \"With cards it is a two-step process of keying in the security code and then the one-time password. This just feels more convenient. Plus, it's like having an additional line of credit.\"</p><p>Though BNPL is not the only credit option for Menon, it is for many new online shoppers in India where even small towns and villages are now served by companies such as Amazon and Walmart's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=WMT.N\" data-type=\"ric\" data-ric=\"WMT.N\" translate=\"no\" dir=\"ltr\">WMT.N</a> Flipkart.</p><p>Most payments apps which offer BNPL services need customers to provide government-verified information and bank details before they can avail the service.</p><p>BNPL firm CASHe said Indians are now buying big after a record rise in coronavirus infections between April and May shut most activities.</p><p>\"We are now seeing revenge demand in India,\" CEO Yogi Sadana said. \"Aided by the festival season, we are seeing a 25-30% uptick in demand in the BNPL segment\" from last year. </p><p>($1 = 74.9493 Indian rupees)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Nupur Anand in Mumbai and  Sankalp Phartiyal in New Delhi; Editing by Raju Gopalakrishnan)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:sankalp.phartiyal@thomsonreuters.com\" data-type=\"email\" translate=\"no\">sankalp.phartiyal@thomsonreuters.com</a> ; +91-11-49548064; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: INDIA-PAYMENTS/</p></div>"}