{"date": "2021-11-10 14:30:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Ben Klayman and Paul Lienert</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">DETROIT, Nov 10 (Reuters)</span><span class=\"tr-dl-sep\"> - </span><span class=\"tr-strong\">Electric vehicle startup Rivian Automotive Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RIVN.O\" data-type=\"ric\" data-ric=\"RIVN.O\" translate=\"no\" dir=\"ltr\">RIVN.O</a> plans to be building at least one million vehicles annually by the end of the decade, its chief executive said on Tuesday, as it sets its sights on market leader Tesla Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TSLA.O\" data-type=\"ric\" data-ric=\"TSLA.O\" translate=\"no\" dir=\"ltr\">TSLA.O</a>.</span></p><p><span class=\"tr-strong\">Rivian CEO R.J. Scaringe said the company's push for a larger global footprint would be supported by four assembly plants around the world.</span></p><p><span class=\"tr-strong\">\"We better be growing at least that quick; certainly before the end of the decade is how we think about it,\" Scaringe said in an interview ahead of Rivian's market debut on the Nasdaq on Wednesday.</span></p><p>Irvine, California-based Rivian said it expects to raise almost $12 billion in one of the largest ever initial public offerings (IPOs) in the United States. Prior to the IPO, Rivian had raised $10.5 billion since the start of 2019 from  <span class=\"tr-strong\">Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, Ford Motor Co <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FN.O\" data-type=\"ric\" data-ric=\"FN.O\" translate=\"no\" dir=\"ltr\">FN.O</a> </span>and other investors including T. Rowe Price <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TROW.O\" data-type=\"ric\" data-ric=\"TROW.O\" translate=\"no\" dir=\"ltr\">TROW.O</a> and BlackRock <a href=\"reuters://REALTIME/Verb=FullQuote/ric=BLK.N\" data-type=\"ric\" data-ric=\"BLK.N\" translate=\"no\" dir=\"ltr\">BLK.N</a>. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2S100Q\" data-type=\"storyId\" data-story-id=\"nL1N2S100Q\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>The IPO follows in the footsteps of several other EV startups that have gone public over the past year through reverse mergers with special-purpose acquisition companies (SPACs). Rivian, other startups and established automakers are racing to take on Tesla <span class=\"tr-strong\">as pressure grows in regions including China and Europe on automakers to eliminate vehicle emissions</span>.   </p><p>Rivian has a plant in Normal, Illinois, and has announced plans for a second U.S. factory, as well as eventually plants in Europe and China. <span class=\"tr-strong\">It has not provided a location or timeframe for the second U.S. plant</span>.</p><p>The Illinois plant currently has an annual capacity of 150,000 vehicles and Rivian has said it intends to increase that to 200,000 by 2023 as it adds new vehicles.</p><p>Rivian is building the R1T pickup truck, and soon will add the R1S SUV as well as an electric commercial van for Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, which is the company's largest shareholder with a stake of about 20%. Ford Motor Co<a href=\"reuters://REALTIME/Verb=FullQuote/ric=F.N\" data-type=\"ric\" data-ric=\"F.N\" translate=\"no\" dir=\"ltr\">F.N</a> owns a stake in Rivian that is greater than 5%. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2RP4V6\" data-type=\"storyId\" data-story-id=\"nL4N2RP4V6\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Rivian has sold out its R1 lineup into 2023 <span class=\"tr-strong\">but Scaringe said those vehicles are just the beginning as it expands its lineup.</span></p><p>\"It really serves to open our brand umbrella, under which we can add a whole host of different products, different form factors, different segments, different price points, lower price points, and very much the same way we're doing that with the commercial van space,\" he said, declining to reveal how low in pricing Rivian will move.</p><p>The R1T's starting price is $67,500.</p><p><br/></p><p><span class=\"tr-strong\">VAN PRODUCTION</span></p><p>    In addition to the consumer vehicles, Rivian has a contract to build 100,000 electric delivery vans for Amazon by 2025. Under the deal, Rivian will provide the last-mile vans exclusively to Amazon for four years, with further rights the following two years, but Scaringe emphasized that still leaves opportunity for Rivian in other segments including cargo, mid-mile, commercial van and work van.</p><p><span class=\"tr-strong\">Scaringe added the Illinois plant line dedicated to building the Amazon vans was also designed to build other vehicles.</span></p><p>\"We've designed the line to have head room above and beyond Amazon's needs,\" he said. \"That's what allows us to go into some of these other spaces within the commercial van space.\"</p><p>Scaringe also said he does not plan to raise his presence on social media to match that of Tesla CEO Elon Musk, whose posts on Twitter are heavily followed. Rivian's marketing focus will be customer events and experiences, he said.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Ben Klayman and Paul Lienert in Detroit)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:benjamin.klayman@thomsonreuters.com\" data-type=\"email\" translate=\"no\">benjamin.klayman@thomsonreuters.com</a> ; 313-600-2277; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://benjamin.klayman.thomsonreuters.com@reuters.net\">benjamin.klayman.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: RIVIAN-IPO/CEO (PIX)</p></div>"}