{"date": "2022-02-11 11:59:22.105000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3223.79, "close": 3065.87}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Feb. 11 -- Amazon India launches dedicated storefront for Ayurveda products on its marketplace - Amazon.in.</p><p>The Union Minister of Ayush Sarbananda Sonowal on Friday launched the platform through video conferencing.</p></div><div class=\"tr-npp-body\"><p>The storefront on the marketplace aims to enhance visibility of Ayurveda products such as various kinds of juices, skin-care supplements, immunity boosters, oils and more from small businesses and D2C brands.</p><p>The storefront will also be categorised to suit every kind of buyer such as first time buyer or ones with pre-gained knowledge. The sections will be categorised by selecting focus areas and health benefits such as pain management, immunity boosters, blood purifiers, women's health, weight management, mental wellness etc.</p><p>To give buyers the opportunity to make an informed decision, the sellers have also delineated various commonly used herbs and ingredients in Ayurvedic products and their specific health benefit.</p><p>\"Ayush is the most traditional approach of healing and is part of our rich heritage. Ayush can play a foundational role in maintaining a healthy and disease-free lifestyle, it is more relevant than ever in the ongoing times. I would like to commend Amazon for taking the onus of spreading awareness about Ayush products offered by sellers across India through this initiative and providing impetus to the growth of local entrepreneurs engaged in Ayush business. \"</p><p>The minister further emphasised, \"Ministry is also promoting the Ayu-Raksha kit, Bala-Raksha kit and Swasthya Raksha kit developed by All India Institute of Ayurveda for protecting the people from Covid. These kits are a combo-pack of 3-4 Ayurveda medicines e.g. Samshamani vati, Anu Taila, Ayush kwath and Chyanprash. These kits can be made available to public by Amazon through e-commerce platform.\"</p><p>\"As a nation, we need to take the necessary steps to encourage small and big companies as well as startups to focus on making Ayush a part of our daily lives which will be a step forward towards fulfilling Hon'ble Prime Minister of India's vision of Atmanirbhar Bharat.\" said Sonowal at the launch event.</p><p>Manish Tiwary, Country Manager, India Consumer Business, Amazon India said, \"Ayurveda has always been a part of the Indian way of life and we are happy to launch this dedicated storefront. It will not only showcase a large selection of Ayurveda products from sellers across the country, but also help spread awareness about a healthier lifestyle. The Government of India is putting a special focus on creating awareness about Ayurveda and this storefront is a part of our efforts to contribute to this vision and make Ayurvedic products more accessible to customers. This initiative will enhance the visibility of Ayurveda products on Amazon.in and help thousands of sellers, especially emerging Indian brands to grow their business\".</p><p>India has seen a marked increase in demand for Ayurveda products. The demand has increased nearly 3X in the last two years on Amazon.in.</p><p>New-age Ayurvedic brands and direct-to-consumer start-ups like Kapiva, Upakarma, Auric, Cureveda and thousands of others have found success and scale with Amazon. This storefront will exclusively showcase products from emerging Indian brands, helping generate demand for their products.</p><p>Parag Kaushik, Co-Founder &amp; Director, Upakarma Ayurveda, said, \"We had started Upakarma Ayurveda in 2017 and launched on Amazon.in in June 2018 and since then we have grown constantly with our business growing 100% YOY. We are really excited about this dedicated Ayurveda storefront that will not just bring more visibility to products from sellers like us but also help customers in choosing the healthier option conveniently.\" Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}