{"date": "2021-12-01 19:54:06.857000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwlistdisc{list-style-type:disc;}</style><p class=\"bwalignc\">\n<b>JFrog and AWS Unveil Hybrid Solution for Boosting DevOps Pipelines on Kubernetes Infrastructures</b>\n</p><p class=\"bwalignc\">\n<span>New JFrog Artifactory for Amazon EKS Anywhere Allows Customers to Easily Manage Software Packages on Kubernetes Clusters in the Cloud, On-Premises, or Both</span>\n</p><p>\n<b>(AWS re:Invent) —</b> <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fjfrog.com%2F&amp;esheet=52542376&amp;newsitemid=20211130005752&amp;lan=en-US&amp;anchor=JFrog&amp;index=1&amp;md5=7038b8597ed0fff1b9c2eb8fe712f93d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">JFrog</a> Ltd. (“JFrog”) (NASDAQ: FROG), the Liquid Software company and creators of the <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fjfrog.com%2Fplatform%2F&amp;esheet=52542376&amp;newsitemid=20211130005752&amp;lan=en-US&amp;anchor=JFrog+DevOps+Platform&amp;index=2&amp;md5=c7351cb12f924b8d65d6542944fe5d3b\" data-type=\"url\" class=\"tr-link\" translate=\"no\">JFrog DevOps Platform</a>, today introduced a new container registry and package manager for running JFrog Artifactory with Kubernetes clusters on-premises, in the cloud, or both. Available immediately <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fmarketplace%2Fpp%2Fprodview-336ywgv7fmo4u%3Fsr%3D0-3%26ref_%3Dbeagle%26applicationId%3DAWSMPContessa&amp;esheet=52542376&amp;newsitemid=20211130005752&amp;lan=en-US&amp;anchor=in+the+AWS+Marketplace&amp;index=3&amp;md5=880fbf2dfa30980a103723568630c326\" data-type=\"url\" class=\"tr-link\" translate=\"no\">in the AWS Marketplace</a>, JFrog Artifactory for Amazon EKS Anywhere allows customers to experience all the benefits of cloud-native container technology in an easy-to-manage, private instance so they can rest assured data privacy, security, and regulatory requirements are met. Amazon Elastic Kubernetes Service (EKS) Anywhere is a new deployment option for Amazon EKS that allows Amazon Web Services, Inc. (AWS) customers to create and operate Kubernetes clusters on customer-managed infrastructure.\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: <a href=\"https://www.businesswire.com/news/home/20211130005752/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211130005752/en/</a></p><div id=\"bwbodyimg\" style=\"width:480px;float:left;padding-left:0px;padding-right:20px;padding-top:0px;padding-bottom:0px\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"New Container Registry and Package Manager for Hybrid Kubernetes Deployments (Graphic: Business Wire)\" src=\"https://mms.businesswire.com/media/20211130005752/en/931428/4/1280x960_%28AWS_EKS_Anywhere%29.jpg\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbXMuYnVzaW5lc3N3aXJlLmNvbS9tZWRpYS8yMDIxMTEzMDAwNTc1Mi9lbi85MzE0MjgvNC8xMjgweDk2MF8lMjhBV1NfRUtTX0FueXdoZXJlJTI5LmpwZw==&amp;key=774543004b352d897ee64078638f1f4e95bcfa2358257d7965f5f43a215df1943084bf2e79c8f2da1a95bb1c8adf0a3b3ee566f2e165671d274cbedef7dbb9ae\"/></div></div><p style=\"font-size:85%\">New Container Registry and Package Manager for Hybrid Kubernetes Deployments (Graphic: Business Wire)</p></div><p>\n“When it comes to cloud-native infrastructure, our first objective has always been to offer customers the freedom of choice and flexibility,” said Yoav Landman, Co-Founder and Chief Technology Officer at JFrog. “We’re thrilled to work with AWS on providing a solution that gives customers a new option for scaling and extending their devops pipelines to Kubernetes-based platforms, regardless of physical location, achieving data privacy and proximity for their containers and other binary packages.”\n</p><p>\nJFrog Artifactory for Amazon EKS Anywhere ushers in a new era of flexibility, scalability, and ease-of-use for customers wanting to utilize containers within their self-managed IT environment - whether that be on-prem or in the cloud. Amazon EKS Anywhere offers the same user interface and best-in-class capabilities as the SaaS version of <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Feks%2F%3Ftrk%3Dps_a134p000007CPyjAAG%26trkCampaign%3Dacq_paid_search_brand%26sc_channel%3DPS%26sc_campaign%3Dacquisition_US%26sc_publisher%3DGoogle%26sc_category%3DDatabase%26sc_country%3DUS%26sc_geo%3DAMER%26sc_detail%3Daws%2520eks%26sc_content%3DEKS_e%26sc_matchtype%3De%26sc_segment%3D547620651355%26sc_medium%3DPAC-Paas-P%257CPS-GO%257CBrand%257CAll%257CPA%257CDatabase%257CEKS%257CProduct%257CUS%257CEN%257CText%257Cxx%257CSEM%257CPMO21-06826%26s_kwcid%3DAL%214422%213%21547620651355%21e%21%21g%21%21aws%2520eks%26ef_id%3DCjwKCAiAm7OMBhAQEiwArvGi3Cmw-jPXjF-_L0rlPhl3xdbfmDInirNdIXa2K-q_F6BrojvMd43P0RoCwkgQAvD_BwE%3AG%3As%26s_kwcid%3DAL%214422%213%21547620651355%21e%21%21g%21%21aws%2520eks&amp;esheet=52542376&amp;newsitemid=20211130005752&amp;lan=en-US&amp;anchor=Amazon+EKS&amp;index=4&amp;md5=b7f73fee83f27d51da44ada0793dbd1e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon EKS</a>, delivering a seamless user experience across on-prem, cloud-based, or hybrid environments.\n</p><p>\n“We've been using JFrog Artifactory on AWS at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fmonster.com%2F&amp;esheet=52542376&amp;newsitemid=20211130005752&amp;lan=en-US&amp;anchor=Monster.com&amp;index=5&amp;md5=4f0e222d8f538add44e4fc72c10dfaa8\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Monster.com</a>, and it has been a winning combination for us,” said Martin Eggenberger, Chief Architect, Monster.com. “After evaluating our options, we went with Artifactory because of its breadth of coverage - we were able to avoid the operational challenges of using multiple tools. Artifactory on EKS Anywhere is an exciting next step from the two vendors because it combines a top-notch Kubernetes distribution with a top-notch DevOps solution.”\n</p><p>\nOther key benefits of JFrog Artifactory for Amazon EKS Anywhere include:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\n<b>Seamless User Experience. </b>Whether you choose to run JFrog Artifactory for Amazon EKS on-premises, in the cloud, or hybrid, you will have a familiar interface and functions that make it easy to evolve your instance over time without the pains of re-tooling or training.\n</li>\n<li>\n<b>Quick Start Helm Chart. </b>Get up and running quickly thanks to an enhanced Helm chart that eases the installation process, accelerating your path to value and productivity.\n</li>\n<li>\n<b>One-stop Licensing. </b>Customers only need to purchase one license in AWS Marketplace for a single server instance of JFrog Artifactory and Amazon EKS Anywhere. This results in a simple, single point of contact for managing licenses. They can either purchase outright or use their AWS credits to obtain their license.\n</li>\n<li>\n<b>Simplified Kubernetes Management.</b> JFrog Artifactory for Amazon EKS Anywhere also reduces operational complexity when running Kubernetes by allowing customers to leverage AWS for on-premises support of operating Kubernetes at scale.\n</li>\n</ul><p>\n“AWS is committed to providing the best services for customers to deploy and operate containerized applications,” said Bob Wise, General Manager of Kubernetes, AWS. “The availability of JFrog Artifactory for Amazon EKS Anywhere will allow our joint customers to benefit from containerization at scale, whether their workloads are running in the cloud or on-premises.”\n</p><p>\nIndustry research estimates over <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.globenewswire.com%2Fnews-release%2F2021%2F02%2F18%2F2178094%2F0%2Fen%2FGlobal-Application-Container-Market-2021-to-2026-Growth-Trends-COVID-19-Impact-and-Forecasts.html&amp;esheet=52542376&amp;newsitemid=20211130005752&amp;lan=en-US&amp;anchor=3.5+billion&amp;index=6&amp;md5=cad1a19f407a6d71e803f21bef537579\" data-type=\"url\" class=\"tr-link\" translate=\"no\">3.5 billion</a> applications are currently running in <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aquasec.com%2Fcloud-native-academy%2Fdocker-container%2F&amp;esheet=52542376&amp;newsitemid=20211130005752&amp;lan=en-US&amp;anchor=Docker+containers&amp;index=7&amp;md5=e4c6e3e39095f39d06f02a4d7e0c9072\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Docker containers</a>, and 48% of organizations worldwide are managing containers at hyper-scale using Kubernetes. However, while containers are faster and more lightweight than virtual machines - they can often be difficult to manage. Therefore - until now - many companies have opted to have their container instances managed by third-parties or cloud service providers.\n</p><p>\nFor more information on the features and advantages of JFrog Artifactory for Amazon EKS Anywhere visit us at booth #126 in the Expo Hall during <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fjfrog-aws-reinvent.jfrog.com%2Fjfrog-aws-reinvent%2F&amp;esheet=52542376&amp;newsitemid=20211130005752&amp;lan=en-US&amp;anchor=AWS+re%3AInvent&amp;index=8&amp;md5=9d85c01ef86e1555c0dc8bf0747f15d6\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS re:Invent</a>, taking place November 29 - December 3, 2021 at The Venetian Resort in Las Vegas, Nevada.\n</p><p>\nLike this Story? Tweet this: .@jfrog and @AWS unveil JFrog Artifactory for Amazon EKS Anywhere during @AWSreInvent <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fbit.ly%2F3d1xJFl&amp;esheet=52542376&amp;newsitemid=20211130005752&amp;lan=en-US&amp;anchor=https%3A%2F%2Fbit.ly%2F3d1xJFl&amp;index=9&amp;md5=cac6540d42fed62f222a4e529ff59107\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://bit.ly/3d1xJFl</a>\n</p><p>\n<b>About JFrog</b>\n</p><p>\nJFrog is on a mission to be the company powering all of the world’s software updates, driven by a “Liquid Software” vision to allow the seamless, secure flow of binaries from developers to the edge. The company’s end-to-end DevOps platform – the JFrog Platform - provides the tools and visibility required by modern organizations to solve today’s challenges across critical pieces of the DevOps cycle. JFrog’s hybrid, universal, multi-cloud DevOps platform is available as both self-managed and SaaS services on a number of cloud service provider platforms. JFrog is trusted by millions of users and thousands of customers, including a majority of the Fortune 100 companies that depend on JFrog solutions to manage their mission-critical software delivery pipelines. Learn more at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fjfrog.com%2F&amp;esheet=52542376&amp;newsitemid=20211130005752&amp;lan=en-US&amp;anchor=jfrog.com&amp;index=10&amp;md5=2a65dd42ff66b8e38edbf18732a647fd\" data-type=\"url\" class=\"tr-link\" translate=\"no\">jfrog.com</a>.\n</p><p>\n<b>Cautionary Note About Forward-Looking Statements</b>\n</p><p>\nThis press release contains “forward-looking” statements as that term is defined under the U.S. federal securities laws, including but not limited to statements regarding our plans to, together with AWS, deliver a hybrid solution for simplified kubernetes deployments, our ability to meet the needs of our customers, and expected demand for our products. These forward-looking statements are based on our current assumptions, expectations and beliefs and are subject to substantial risks, uncertainties, assumptions and changes in circumstances that may cause our actual results, performance or achievements to differ materially from those expressed or implied in any forward-looking statement.\n</p><p>\nThere are a significant number of factors that could cause actual results to differ materially from statements made in this press release, including but not limited to: risks associated with managing our rapid growth; risks associated with expanding product capabilities; our ability to retain and upgrade existing customers our ability to attract new customers; our ability to effectively develop and expand our sales and marketing capabilities; risk of a security breach; risk of interruptions or performance problems associated with our products and platform capabilities; our ability to adapt and respond to rapidly changing technology or customer needs; our ability to compete in the markets in which we participate; general market, political, economic, and business conditions; and the duration and impact of the COVID-19 pandemic. Actual results could differ materially from those stated or implied in forward-looking statements due to a number of factors, including but not limited to, risks detailed in our filings with the Securities and Exchange Commission (the “SEC”), including in our Annual Report on Form 10-K for the year ended December 31, 2020, our Quarterly Report on Form 10-Q for the quarter ended September 30, 2021, and other filings and reports that we may file from time to time with the SEC. Forward-looking statements represent our beliefs and assumptions only as of the date of this press release. We disclaim any obligation to update forward-looking statements.\n</p><p><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211130005752/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211130005752/en/</a></span></p><p>\n<b>Press Contact: \n</b><br/><a href=\"mailto:Jfrog@bocacommunications.com\" data-type=\"email\" translate=\"no\">Jfrog@bocacommunications.com</a>\n</p><p>\n<b>Investor Contact: \n</b><br/>JoAnn Horne\n<br/><a href=\"mailto:jhorne@marketstreetpartners.com\" data-type=\"email\" translate=\"no\">jhorne@marketstreetpartners.com</a>\n</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: CA-JFROG-LTD</p></div>"}