{"date": "2021-11-30 16:41:28.522000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>RACKSPACE TECHNOLOGY INC (\"RXT-Q\")\n- Accelerates Momentum with AWS Through Customer Transformations,\n- Partner Designations, and Keynote Presentation at AWS re:Invent 2021\n\n     Rackspace Technology(R) a leading end-to-end multicloud technology\nsolutions company, announced its momentum with Amazon Web Services (AWS)\nthrough customer transformations, Amazon Quicksight Service Delivery\n(Amazon Quicksight SDP) and AWS Shield Advanced partner designations, and\nan upcoming leadership session on the main stage at AWS re:Invent 2021.\n\n     Rackspace Technology is an \"all in\" AWS Partner Network (APN) Premier\nConsulting Partner that has deep AWS expertise and scalability to take on\nthe most complex AWS projects. Rackspace Technology customer Awaze\ndemonstrate those capabilities:\n\n     Awaze\nDue to its transition to AWS public cloud from an on-premises environment,\nsupported by Rackspace Technology, Awaze, Europe's leading managed vacation\nrentals group, has been able to meet the huge volumes of traffic to its\nHoseasons and Cottages.com websites at points this year. Tightly aligning\ncompute resources to demand as part of the multi-million-pound investment\nhas led to a 30% reduction in web session costs for Awaze.\n\n     Awaze, the self-catering giant, which offers over 90,000 accommodation\nchoices in 36 countries to more than six million holidaymakers a year, has\nseen unprecedented surges in demand over the last 12 months thanks to the\nrising popularity of domestic breaks in the wake of the global pandemic.\n\n     \"Our partnership with Rackspace Technology has allowed us to optimize\nour cloud footprint and make it elastic at every layer and across every\npoint of the customer and owner journey,\" said James Baird, Technical\nOperations Director at Awaze. \"This means it seamlessly expands and\ncontracts in line with volatile patterns of demand, maintaining robustly\nconsistent response times and performance whilst also being highly\ncommercially optimised.\"\n\n     Rackspace Technology, combined with the newly formed Onica by\nRackspace Technology business group, achieved 15 AWS Partner competency\ndesignations within the APN, along with 2,700+ AWS Certifications. In\naddition, Onica by Rackspace has attained the AWS Machine Learning\nCompetency designation. This validated designation differentiates Onica by\nRackspace as an APN Partner that has demonstrated expertise in building\nartificial intelligence / machine learning (AI/ML) solutions on AWS and has\nhelped organizations automate and innovate to solve their data challenges\nand gain actionable outcomes.\n\n     Recently, Onica by Rackspace Technology has earned the Quicksight SDP\nand AWS Shield Advanced Partner designations.\n\n     Amazon Quicksight SDP Designation\nRackspace has obtained a service delivery designation for Amazon\nQuickSight. The qualification for the program requires passing\nservice-specific verification of customer references and a technical review\non behalf of AWS. The designation provides customers confidence that they\nare working with AWS Partners who can offer the most up-to-date and\nrelevant cloud solutions.\n\n     The AWS Quicksight SDP showcases APN Partners who have proven\nexpertise delivering specific AWS services, allowing them to differentiate\nthemselves in the marketplace and highlight areas of specialization to AWS\ncustomers.\n\n     AWS Perimeter Protection Managed Security Services Provider (MSSP)\nPartner Certification\nRackspace Technology achieved the AWS Perimeter Protection MSSP Partner\nCertification, recommending Rackspace Elastic Engineering for Security as\nan expert consultative service to manage AWS Edge Security for\norganizations globally.\n\n     Rackspace Elastic Engineering for Security offers global consultative\nservices to help implement and manage the suite of AWS Edge Security\nServices including AWS Shield, AWS Web Application Firewall (AWS WAF), and\nAWS Firewall Manager to protect AWS resources such as Elastic IP, Elastic\nLoad Balancer (ELB), Amazon CloudFront, AWS Global Accelerator, and Amazon\nRoute 53 from application threats like Distributed Denial of Services\n(DDoS), SQL Injection, and Cross-Site Scripting. Rackspace Elastic\nEngineering for Security offers extended visibility and access to a\ndedicated pod of cloud security experts, including pod members who have\nbeen trained and are directly supported by the AWS Shield Response Team\n(ASRT).?\n\n     Rackspace Technology achieved the AWS Perimeter Protection MSSP\npartner certification by being an APN Premier Tier Partner, demonstrating\nan established AWS security practice with Rackspace Elastic Engineering for\nSecurity, providing 24/7 cloud security support, and passing a multi-day\ntraining program with the AWS Shield Response Team (ASRT).\n\n     re:Invent 2021\nOnica by Rackspace Technology is also celebrating ten years of re:Invent as\nan AWS Premier Consulting Partner and Gold Sponsor of AWS re:Invent 2021\nfrom November 28 through December 3 in Las Vegas, Nevada. The Onica by\nRackspace Technology booth will have activities for everyone with labs,\ncustomer presentations, and networking events.\n\n     In addition, Josh Prewitt, Chief Product Officer at Onica by Rackspace\nTechnology will join Bill Vass, Vice President of Engineering - Storage,\nAutomation, and Management at AWS and Nandini Ramani, Vice President at AWS\nfor the main stage presentation Ready, set, operate: The AWS Cloud\noperations model to explain how the AWS Cloud operations model can help\ncustomers build securely and successfully in the cloud.\n\n     For more information on Onica by Rackspace's re:Invent participation\nclick here or visit us at re:Invent at booth 706 at the Venetian Sands Expo\nto try out our interactive activity incorporating Industrial Internet of\nThings (IIoT) and Machine Learning (ML).\n\n     About Rackspace Technology\nRackspace Technology is a leading end-to-end multicloud technology services\ncompany. We can design, build and operate our customers' cloud environments\nacross all major technology platforms, irrespective of technology stack or\ndeployment model. We partner with our customers at every stage of their\ncloud journey, enabling them to modernize applications, build new products\nand adopt innovative technologies.\n\n Contact Information:\n\nContact:Natalie Silva\nRackspace Corporate Communications\npublicrelations@rackspace.com\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133300466.MNPRE2133302532-08145420211130</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}