{"date": "2022-01-24 15:40:58.529000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SCOTIABANK (\"BNS-TN\")\n- Introducing the 2022 Scotiabank Giller Prize Jury\n\n     Elana Rabinovitch, Executive Director of the Scotiabank Giller Prize,\ntoday announced the five-member jury panel for the 2022 Scotiabank Giller\nPrize. This year marks the 29th anniversary of The Prize.\n\n     The 2022 jury members are:\n\n     Award winning Canadian authors Kaie Kellough, Casey Plett and\nWaubgeshig Rice and American authors Katie Kitamura and Scott Spencer.\n\n     Some background on the 2022 jury:\n\n     Kaie Kellough is a novelist, poet, and sound performer. His work\nemerges at a crossroads of social engagement and formal experiment. From\nWestern Canada, he lives in Montreal and has roots in Guyana, South\nAmerica. His books include Dominoes at the Crossroads (short fiction,\nVehicule 2020), Magnetic Equator (poetry, McClelland and Stewart 2019), and\nAccordeon (novel, ARP 2016). He has been awarded the Griffin Poetry Prize\nand the QWF Hugh MacLennan Prize for Fiction. His work has been longlisted\nfor the Scotiabank Giller Prize, and nominated for several other national\nawards. Kaie's vocal performance, recorded audio, and electronic narrative\nexplore migration and futurity. He creates mixed media compositions with\nsaxophonist and synthesist Jason Sharp. Their collaborative audio-visual\nperformances have been filmed and broadcast by jazz festivals in Europe and\nCanada. Kaie has written plays for television and librettos for large\nmusical ensembles. His solo and group sound performances have toured\ninternationally.\n\n     Katie Kitamura's most recent novel is Intimacies. One of The New York\nTimes 10 Best Books of 2021 and a Barack Obama recommended read, it was\nlonglisted for the National Book Award and the Joyce Carol Oates Prize. Her\nthird novel, A Separation, was a finalist for the Premio von Rezzori and a\nNew York Times Notable Book. She is also the author of Gone To The Forest\nand The Longshot, both finalists for the New York Public Library's Young\nLions Fiction Award. Her work has been translated into nineteen languages\nand is being adapted for film and television. A recipient of fellowships\nfrom the Lannan, Santa Maddalena, and Jan Michalski foundations, Katie has\nwritten for publications including The New York Times Book Review, The New\nYork Times, The Guardian, Granta, BOMB, Triple Canopy, and Frieze. She\nteaches in the creative writing program at New York University.\n\n     Casey Plett is the author of A Dream of a Woman, Little Fish, A Safe\nGirl to Love, and the co-editor of Meanwhile, Elsewhere: Science Fiction\nand Fantasy From Transgender Writers. She has written for The New York\nTimes, The Guardian, The Globe and Mail, McSweeney's Internet Tendency, the\nWinnipeg Free Press, and other publications. A winner of the Amazon First\nNovel Award, the Firecracker Award for Fiction, and a two-time winner of\nthe Lambda Literary Award, her work has also been nominated for the\nScotiabank Giller Prize. She splits her time between New York City and\nWindsor, Ontario.\n\n     Waubgeshig Rice is an author and journalist from Wasauksing First\nNation. He has written three fiction titles, and his short stories and\nessays have been published in numerous anthologies. His most recent novel,\nMoon of the Crusted Snow, was published in 2018 and became a national\nbestseller. He graduated from the journalism program at the university\nformerly known as Ryerson in 2002 and spent most of his journalism career\nwith the Canadian Broadcasting Corporation (CBC) as a video journalist and\nradio host. He left CBC in 2020 to focus on his literary career. He lives\nin Sudbury, Ontario with his wife and two sons.\n\n     Scott Spencer is the author of twelve novels, including Endless Love,\nWaking the Dead, A Ship Made of Paper, and Man in the Woods. He has been\nnominated for the National Book Award three times and has taught at\nColumbia University, the Iowa Writers' Workshop, Williams College, the\nUniversity of Virginia, and at Eastern Correctional Facility as part of the\nBard Prison Initiative. He lives with writer Jo Ann Beard in upstate New\nYork.\n\n     Images of the 2022 jurors are available at\nscotiabankgillerprize.ca/media-resources.\n\n     Audible.ca will provide each jury member with a complimentary one-year\nmembership to listen to available submissions, as well as titles by other\nCanadian writers. For all listeners, Audible.ca has a dedicated Scotiabank\nGiller Prize page for easy discovery of some of Canada's most exciting\nliterary voices.\n\n     The longlist will be presented at events in St. John's, Newfoundland\nin early September, with the shortlist announced later in the month in\nToronto, pending Public Health directives related to COVID-19. The winner\nwill be named at a nationally televised black-tie dinner and awards\nceremony in Toronto in November.\n\n     Submissions are now being accepted. The 2022 submission package,\nincluding updated details, can be found at\nscotiabankgillerprize.ca/about/submissions/. The first submission deadline\nfor books published between October 1, 2021, and February 28, 2022, are to\nbe received by February 18, 2022.\n\n     About the Prize The Giller Prize, founded by Jack Rabinovitch in 1994,\nhighlights the very best in Canadian fiction year after year. In 2005, the\nprize teamed up with Scotiabank who increased the winnings four-fold. The\nScotiabank Giller Prize now awards $100,000 annually to the author of the\nbest Canadian novel or short story collection published in English, and\n$10,000 to each of the finalists. The award is named in honour of the late\nliterary journalist Doris Giller by her husband Toronto businessman Jack\nRabinovitch, who passed away in August 2017.\n\n     About Scotiabank Scotiabank is a leading bank in the Americas. Guided\nby our purpose: \"for every future\", we help our customers, their families\nand their communities achieve success through a broad range of advice,\nproducts, and services, including personal and commercial banking, wealth\nmanagement and private banking, corporate and investment banking, and\ncapital markets. With a team of approximately 90,000 employees and assets\nof approximately $1.2 trillion (as of October 31, 2021), Scotiabank trades\non the Toronto Stock Exchange (TSX: BNS) and New York Stock Exchange (NYSE:\nBNS). For more information, please visit <a href=\"http://www.scotiabank.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.scotiabank.com</a> and\nfollow us on Twitter @ScotiabankViews.\n\n     About Audible, Inc. Audible, a leading producer and provider of\noriginal spoken-word entertainment and audiobooks, is committed to\nsupporting talented Canadian authors and creators and is proud to be the\nexclusive audiobook sponsor of the Scotiabank Giller Prize. At Audible.ca,\nan Amazon.com, Inc. subsidiary (NASDAQ: AMZN), we believe storytelling and\nthe spoken word have the power to help people rediscover the joy in\nlistening, making us more informed, more connected, and more human. Audible\ncontent includes hundreds of thousands of audiobooks, podcasts, guided\nwellness programs, theatrical performances, A-list comedy, and exclusive\nAudible Originals you won't find anywhere else.\n\n     Media enquiries: Elana Rabinovitch, Scotiabank Giller Prize,\nElana@scotiabankgillerprize.ca, T: 416-275-5418; Doug Johnson,\ndouglas.johnson@scotiabank.com\n\nTel   : 416-866-3672    BANK OF NOVA SCOTIA\nFax   : 416-866-7767\nEmail : investor.relations@scotiabank.com\nWWW   : <a href=\"https://www.scotiabank.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.scotiabank.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2202300653.MNPRE2202301840-07103320220124</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}