{"date": "2021-09-13 12:36:00+00:00", "ticker": "ABDN", "mrkt_info": {"open": 261.5, "close": 260.4}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds detail on planned transactions</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">BUDAPEST/LONDON, Sept 13 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Hungary's government debt agency (AKK) overhauled its 2021 financing plan on Monday, saying it would raise the equivalent of up to 4.5 billion euros ($5.3 billion), far more than expected to help cover a likely delay in European Union's COVID recovery fund money.</p><p>Refinitiv news service IFR reported that the planned transaction, subject to market conditions, would be a multi-tranche deal including both euro and dollar-denominated bonds, which would mark Hungary's first dip back into dollars since a $3 billion bond issue in early 2014.</p><p>Last November, Finance Minister Mihaly Varga said Hungary would not issue more foreign currency bonds until at least the beginning of 2023 as Prime Minister Viktor Orban's government pursued a strategy of curbing its reliance on foreign investors.</p><p>Hungary and Poland have both been at loggerheads with the bloc's executive over issues ranging from LGBT rights to press freedoms. In July the Commission launched legal action against the two over measures it says discriminate against the gay community. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2OR0VO\" data-type=\"storyId\" data-story-id=\"nL1N2OR0VO\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span><span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2Q350G\" data-type=\"storyId\" data-story-id=\"nL8N2Q350G\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>European Economic Commissioner Paolo Gentiloni said on Friday that the EU executive was still withholding approval for recovery money for the two countries as they have yet to address EU recommendations regarding the rule of law in their countries. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nB5N2N803C\" data-type=\"storyId\" data-story-id=\"nB5N2N803C\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>In July, Orban had flagged a two-month delay in talks with the EU over Hungary's pandemic recovery plan, saying the \"ideological war\" with Brussels would likely hamper access to funding.</p><p>    Facing a tough election next year, Orban has grown increasingly radical on social policy to protect what he says are traditional Christian values from Western liberalism.</p><p>IFR said Hungary has mandated BNP Paribas, Citi, Goldman Sachs Bank Europe SE and J.P. Morgan for a potential bond offering comprising dollar benchmarks across 10-year and 30-year maturities, as well as euro benchmark 7-year and/or 20-year tranches.</p><p>It said the transaction was expected to be launched and priced in the near future, subject to market conditions.</p><p>Viktor Szabo, a portfolio manager at ABRDN in London, said he expected Hungary to be able to sell the bonds as the country was viewed as a safe credit with a positive rating trajectory, adding however that it was raising some ESG question marks.</p><p>In its statement, the AKK said the new borrowing could also finance some 2021 expenditure and pre-finance part of the 2022 budget deficit. It said the government's budget deficit target for 2021 of 7.5% of gross domestic product was unchanged.</p><p>\"The AKK has modified its 2021 financing plan in September, creating the scope for foreign currency bond issuance worth up to 4.5 billion euros to cover any possible delays in advance payments from the European Union's Recovery and Resilience Facility, certain 2021 government expenditures as well as pre-financing part of the 2022 budget deficit,\" it said.</p><p>Even so, the AKK said it aimed to keep the share of forex debt between 10% and 20% of the total debt stock.</p><p> ($1 = 0.8490 euros)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Gergely Szakacs and Marc Jones; Editing by Toby Chopra, Andrew Cawthorne and Hugh Lawson)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:gergely.szakacs@reuters.com\" data-type=\"email\" translate=\"no\">gergely.szakacs@reuters.com</a> ; <a href=\"https://twitter.com/szakacsg\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/szakacsg</a> ; +36 1 882 3606 ; <a href=\"https://www.reuters.com/journalists/gergely-szakacs\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.reuters.com/journalists/gergely-szakacs</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: HUNGARY-DEBT/ (UPDATE 2)</p></div>"}