{"date": "2021-12-06 10:31:56.919000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>service via 5G</p>\n<p>1254435 06.12.2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<pre>EQS-News: Sunrise UPC GmbH / Key word(s): Offer                                \nSunrise UPC continues to expand the world's first 4K cloud gaming service via  \n5G                                                                             \n                                                                               \n06.12.2021 / 11:30                                                             \n                                                                               \n                                                                               \n------------------------------------------------------------                   \n                                                                               \n* Sunrise UPC offers the world's first cloud gaming service with 4K resolution \nvia 5G, now also for iOS (iPhone, iPads) and MacOS devices (MacBooks, iMacs,   \netc.). * Over 100 games are now available via 5G or Wi-Fi on almost all mobile \ndevices and - also new - directly on all Samsung smart TV models. Two new games\nwill be added every month.                                                     \n* Sunrise Mobile Postpaid customers can take advantage of the gaming flat rate \nfree of charge for three months. After this period, the offer costs CHF 9.90   \nper month.                                                                     \n                                                                               \n                                                                               \n«We provide Switzerland's in combination fastest and largest 5G network in     \nSwitzerland (according to the 2022 connect mobile network test) and operate    \nesports.ch - and now all our customers can benefit from this expertise. Thanks \nto our expanded offer, they can enjoy many new and innovative gaming options at\nan attractive flat rate. This will put us in an even stronger position as the  \nleading telecommunications provider in the booming video game market», says    \nStefan Fuchs, Chief Marketing Officer at Sunrise UPC.                          \n                                                                               \n                                                                               \n                                                                               \nMobile gaming is booming in Switzerland                                        \n                                                                               \nAccording to a ZHAW study presented in April 2021, nearly 42% of the Swiss     \npopulation plays video games at least once a week. This is almost 8% more than \nin 2019. Over half of these gamers prefer using their smartphone as a gaming   \ndevice.                                                                        \n                                                                               \nThanks to the outstanding Sunrise 5G network, the in combination fastest and   \nlargest 5G network in Switzerland (according to the 2022 connect mobile network\ntest), stable connections with low latency and high bandwidths for             \nhigh-resolution games are now also available on the go. Whether alone or in    \nmultiplayer mode - there is no better 5G network in Switzerland for an         \nexcellent mobile gaming experience, as was recently confirmed by the «November \n2021 Switzerland 5G Experience Report» from Opensignal. Even with 4G devices,  \nusers can play most of the games on the new mobile gaming platform. In         \naddition, any Sunrise Mobile customer* who also wants to take advantage of the \noffer on a PC or laptop without mobile access can do so via Wi-Fi.             \n                                                                               \n                                                                               \n                                                                               \nIdeal for casual gamers and families                                           \n                                                                               \nThe mobile cloud gaming platform was developed in collaboration with           \nGamestream, the leading provider of cloud gaming solutions for the B2B market. \nFor Gamestream CEO and co-founder Ivan Lebeau, this cooperation is             \ngroundbreaking: «We are proud to be working with Sunrise UPC, the 5G pioneer,  \nto provide the best cloud gaming solution in the industry, offering the entire \nfamily an exceptional gaming experience - everywhere, anytime and on any       \ndevice.» The offer is in fact geared primarily toward casual gamers and        \nfamilies. With a wide range of games, to which two titles are added every      \nmonth, each family member is sure to find the right one. Thanks to newly       \nintegrated parental controls, games can now also be released by age category.  \n                                                                               \nSunrise Mobile Postpaid customers can test the gaming flat rate for smartphones\nfree of charge for three months, after which it costs CHF 9.90 per month. 4K   \ncloud gaming can be purchased online or at any Sunrise or UPC Shop.            \n                                                                               \n                                                                               \n                                                                               \nDirect access via a Samsung Smart TV and integrated gaming console             \n                                                                               \nAdditional features such as the integrated interface to Samsung Smart TV models\n(expected to be available as of early February 2022), a game console integrated\ninto the game or monthly installment payments for a hardware controller        \n(CHF 2.95 per month for 24 months) will make it simple for even those with     \nlittle gaming experience to access the new Sunrise UPC cloud gaming world.     \n                                                                               \n                                                                               \n                                                                               \nSunrise UPC - a gaming and eSports pioneer                                     \n                                                                               \nSunrise UPC is a pioneer in gaming and eSports and is now sharing this         \nexpertise with its customers in the form of the new cloud gaming platform.     \nSunrise UPC established itself in the gaming and eSports sector four years ago \nwith the launch of esports.ch, the largest news site for competitive gaming.   \nAnd two years ago, a cooperation between Sunrise UPC, MySports and esports.ch, \ntogether with Swiss Ice Hockey and gameturnier.ch, resulted in the launch of   \nthe eNationalleague. A net reach of 30,000 viewers on the MySports TV program, \nmore than 3 million impressions on social media channels and regularly around  \n500 viewers of live Twitch broadcasts showcase the increasing popularity of    \ngaming topics and platforms in Switzerland.                                    \n                                                                               \n *) currently, customers with a UPC mobile subscription are not yet able to    \naccess the mobile cloud gaming platform.                                       \n                                                                               \n                                                                               \n                                                                               \nSunrise UPC                                                                    \nMedia Relations                                                                \nmedia@sunrise.net                                                              \nPhone: 0800 333 000                                                            \nOutside Switzerland: +41 58 777 76 66                                          \n                                                                               \n                                                                               \n                                                                               \n------------------------------------------------------------                   \nEnd of Media Release                                                           \n                                                                               \n------------------------------------------------------------                   \n\n\n\nLanguage:    English                        \n\nCompany:     Sunrise UPC GmbH               \n\n             Thurgauerstrasse 101b          \n\n             8152 Glattpark (Opfikon)       \n\n             Switzerland                    \n\nPhone:       0800 333 000                   \n\nE-mail:      sunrisemediaservice@sunrise.net\n\nInternet:    www.sunrise.ch und www.upc.ch  \n\nEQS News ID: 1254435                        \n\n\n\n\n\n\n\n                                      \n\nEnd of News          EQS News Service\n\n\n\n------------------------------------------------------------</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}