{"date": "2022-01-27 13:04:21.755000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2799.72, "close": 2792.75}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>DUKE REALTY CORP (\"DRE-N\")\n- Fourth Quarter and Full Year 2021 Results\n\n  Duke Realty Corporation, the largest domestic-only logistics REIT, today\nreported results for the fourth quarter of 2021.\n\n  \"I am pleased to announce our strong fourth quarter operating results,\ncompleting an extremely successful year that included record company\nperformance in several different metrics,\" said Jim Connor, Chairman and\nChief Executive Officer. \"We delivered significant year-over-year growth in\nall of our earnings metrics, with Core FFO and AFFO increasing by 13.8\npercent and 11.6 percent, respectively. Leasing volume totaled 8.9 million\nsquare feet for the fourth quarter, resulting in 33.5 million square feet\nfor the full year, which is the highest level of annual leasing volume the\ncompany has ever executed. We concluded the year with our total in-service\nportfolio 98.1 percent leased, a company record and particularly impressive\nas it includes the delivery of 7.7 million square feet of development\nprojects in 2021, which were on average 89 percent leased when placed into\nservice throughout the year.\n\n  Rental rate growth on second generation leases, combined with annual\nlease escalations and the expiration of free rent periods, drove 5.2\npercent growth in same-property net operating income compared to the fourth\nquarter of 2020 and 5.3 percent growth compared to the full year 2020.\n\n  Rent growth on second generation leasing activity in the quarter was 40.8\npercent on a net effective basis, which is our highest quarterly growth\never, and 20.6 percent on a cash basis. This level of quarterly rent growth\nexemplifies the potential for rent growth across all of our markets, as\nonly 3 percent of our second generation leasing activity during the quarter\nwas in Coastal Tier One markets. Rent growth on second generation leasing\nfor the full year was 35.3 percent on a net effective basis and 18.7\npercent on a cash basis, which are both our highest-ever levels of annual\ngrowth. Supply and demand fundamentals continue to be exceptional in the\nlogistics real estate business and asking rent levels have increased\nyear-over-year at record levels. The in-place rental rates in our portfolio\nare significantly under current market rates, representing substantial\nembedded upside to drive strong same-property net operating income and Core\nFFO growth for the foreseeable future.\"\n\n  \"Earlier this month we closed on the third contribution of assets to our\njoint venture with CBRE Global Partners, for which our share of the\nproceeds was $269 million,\" stated Mark Denien, Executive Vice President\nand Chief Financial Officer. \"We will use the proceeds from this\ncontribution to finance the redemption next month of our $300 million of\n3.75 percent unsecured notes, which were originally scheduled to mature in\nDecember 2024. After this redemption is completed, we will have no\nsignificant debt maturities until 2026 and ample liquidity to finance our\ncontinued growth. Finally, the outlook on our BBB+ credit rating from\nStandard and Poor's was raised from stable to positive earlier this month,\nwhich we believe is a validation of our balance sheet management.\"\n\n  Quarterly Highlights\n\n  A complete reconciliation, in dollars and per share amounts, of net\nincome to funds from operations (\"FFO\"), as defined by Nareit, as well as\nto Core FFO, is included in the financial tables included in this release.\n\n  *  Net income was $0.27 per diluted share for the fourth quarter of 2021,\ncompared to $0.45 per diluted share for the fourth quarter of 2020. Net\nincome per diluted share for the quarter decreased from the fourth quarter\nof 2020 due to lower gains on property sales partially offset by rental\nrate growth and increased occupancy. Net income for the full year 2021 was\n$2.25 per diluted share compared to $0.80 per diluted share for the full\nyear 2020. Net income per diluted share for the full year 2021 increased\ncompared to 2020 as the result of higher gains on property sales, rental\nrate growth and increased occupancy.\n\n  *  FFO, as defined by Nareit, was $0.44 per diluted share for the fourth\nquarter of 2021, compared to $0.40 per diluted share for the fourth quarter\nof 2020. The increased FFO, as defined by Nareit, was primarily driven by\nrental rate growth and increased occupancy. FFO, as defined by Nareit, was\n$1.65 per diluted share for the full year 2021 compared to $1.40 per\ndiluted share for the full year 2020. The increased FFO, as defined by\nNareit, compared to 2020 was driven by rental rate growth, increased\noccupancy, portfolio growth through highly leased new developments, lower\ninterest expense and lower losses on debt extinguishment in 2021.\n\n  *  Core FFO was $0.44 per diluted share for the fourth quarter of 2021,\ncompared to $0.41 per diluted share for the fourth quarter of 2020. Core\nFFO was $1.73 per diluted share for the full year 2021 compared to $1.52\nper diluted share for the full year 2020. The increased Core FFO per\ndiluted share, for both the fourth quarter and full year, was primarily\ndriven by rental rate growth, increased occupancy, portfolio growth through\nhighly leased new developments and lower interest expense.\n\n  *  Key indicators of the company's operating performance were as follows:\n\n  *  The company's stabilized in-service portfolio was 98.7 percent leased\nat December 31, 2021 compared to 98.3 percent leased at September 30, 2021\nand 98.1 percent leased at December 31, 2020.\n  *  The company's total in-service portfolio was 98.1 percent leased at\nDecember 31, 2021 compared to 97.6 percent leased at September 30, 2021 and\n97.5 percent leased at December 31, 2020.\n  *  The company's total portfolio, including properties under development,\nwas 95.1 percent leased at December 31, 2021 compared to 95.6 percent\nleased at September 30, 2021 and 96.0 percent leased at December 31, 2020.\n  *  Tenant retention was 68.3 percent and 74.5 percent, respectively, for\nthe three and twelve month periods ended December 31, 2021 and 87.7 percent\nand 90.1 percent, respectively, after considering immediate backfills.\n  *  Same-property net operating income growth on a cash basis was 5.2\npercent and 5.3 percent for the three and twelve month periods,\nrespectively, ended December 31, 2021 compared to the same periods in 2020.\n  *  Total leasing activity was 8.9 million square feet for the quarter and\n33.5 million square feet for the year.\n  *  Overall cash and annualized net effective rent growth on new and\nrenewal leases was 20.6 percent and 40.8 percent, respectively, for the\nquarter and 18.7 percent and 35.3 percent, respectively, for the year.\n\n  *  Capital transactions included:\n\n  *  Nine new speculative development projects with expected costs of $466\nmillion started during the quarter, resulting in $1.43 billion of\ndevelopment starts for the full year;\n  *  Income producing real estate acquisitions totaling $206 million for\nthe quarter and $542 million for the year;\n  *  Building dispositions totaling $80 million for the quarter and\nbuilding dispositions and unconsolidated joint venture contributions\ntotaling $1.1 billion for the year;\n  *  Issuance of $500 million of unsecured notes, representing the\ncompany's third green bond issuance, bearing interest at 2.25 percent and\nmaturing in January 2032;\n  *  Issuance of 1.7 million common shares during the quarter, generating\n$95 million of net proceeds, under the company's ATM program at an average\nprice of $56.90 per share.\n\n  Real Estate Investment Activity\n\n  \"During the fourth quarter we started nine speculative development\nprojects, with expected costs of $466 million, which brought full year 2021\ndevelopment starts to $1.43 billion, which is the highest annual volume of\ndevelopments we've ever started,\" said Mr. Connor. \"Our team has continued\nto lease up our speculative projects successfully and even after starting\nthese nine speculative developments and placing four fully leased\ndevelopments in service during the quarter, we finished the quarter with\nour development pipeline at 48 percent leased.\n\n  Acquisition activity for the quarter was highlighted by our purchase of a\n470,000 square foot property in Northern New Jersey, which was constructed\nin 2019, in an off-market transaction as well as our purchase of a 73-acre\ninfill land site in Northern New Jersey, which we plan to redevelop into a\nfuture 1.1 million square foot building once the site is remediated and\nentitled.\n\n  Early in the fourth quarter, we sold a recently completed project in\nColumbus, Ohio, which was 100 percent leased to Amazon, generating proceeds\nof $80 million. Along with these proceeds, we did not fully re-deploy the\n$738 million proceeds from the third quarter's property sales until late in\nthe year, which resulted in a slight temporary dilution of earnings in the\nfourth quarter.\n\n  As reflected in our 2022 guidance, we expect to continue a robust level\nof development which will in large part be fueled by land we already own or\ncontrol, much of which we carry or is under contract at amounts that are\nwell below market.\"\n\n  Development\n\n  The fourth quarter included the following development activity:\n\n  Consolidated Properties\n\n  *  The company started nine speculative development projects, with\nexpected costs of $466 million, totaling 2.4 million square feet. These\ndevelopment starts included four projects in Southern California totaling\n866,000 square feet; a 261,000 square foot project in Seattle; a 157,000\nsquare foot project in Northern California; a 215,000 square foot project\nin Atlanta; and two projects in the Philadelphia metro area totaling\n949,000 square feet.\n  *  Five projects, totaling 1.2 million square feet, were placed in\nservice during the quarter and were comprised of two 100 percent leased\nprojects in Southern California, totaling 293,000 square feet; a 347,000\nsquare foot speculative project in Northern California; and two 100 percent\nleased projects in Atlanta totaling 557,000 square feet. One of the\nproperties in Southern California and one in Atlanta, totaling 386,000\nsquare feet, were started as speculative developments but were leased prior\nto being placed in service.\n\n  Building Acquisitions\n\n  Building acquisitions totaled $206 million in the fourth quarter and\nincluded the following properties:\n\n  *  A 470,000 square foot project in Northern New Jersey, which was 100\npercent leased; and\n  *  Three 100 percent leased projects in Southern California totaling\n134,000 square feet.\n  Building Dispositions\n\n  One fully leased, 517,000 square foot building in Columbus was sold\nduring the fourth quarter.\n\n  Distributions Declared\n\n  The company's board of directors declared a quarterly cash distribution\non its common stock of $0.28 per share, or $1.12 per share on an annualized\nbasis. The fourth quarter dividend will be payable on February 28, 2022 to\nshareholders of record on February 16, 2022.\n\n  2022 Earnings Guidance\n\n  A reconciliation of the company's guidance for diluted net income per\ncommon share to FFO, as defined by Nareit, and to Core FFO is included in\nthe financial tables to this release. The company issued guidance for net\nincome of $1.79 to $2.07 per diluted share. The company issued guidance for\nFFO, as defined by Nareit, of $1.77 to $1.87 per diluted share.\n\n  \"We are introducing 2022 guidance for Core FFO of $1.87 to $1.93 per\ndiluted share, with the midpoint of $1.90 representing a 9.8 percent\nincrease over 2021 results,\" said Mr. Denien. \"Our guidance for growth in\nAFFO ('Adjusted Funds from Operations'), on a share adjusted basis, is\nbetween 8.4 percent and 12.3 percent.\n\n  Our 2022 guidance reflects our expectation that core rental operations in\n2022 will be similar to 2021, and that we will maintain our current high\noccupancy levels and continue to produce rent growth metrics similar to\nrecent history based on our significant embedded mark-to-market on our\nportfolio. As we have recently stated, we believe we can achieve\napproximate ten percent annual growth in Core FFO and AFFO, and our\nguidance for 2022 reflects this.\n\n  We will continue to maintain a strong balance sheet, in alignment with\nour long-term strategic objectives.\n\n  Our guidance for same-property NOI growth is between 5.4 percent and 6.2\npercent on a cash basis and between 4.2 percent and 5.0 percent on a net\neffective basis. Same-property NOI for 2022 is largely driven by a full\nyear of increased rents from leases signed in 2021 and an expected\ncontinuation of rental rate growth on leases to be signed in 2022.\n\n  Our guidance for dispositions of properties is between $600 million and\n$800 million. We have targeted assets with long lease terms and low annual\nrent escalations in our disposition strategy for the year.\n\n  Our guidance for 2022 development starts is between $1.2 billion and $1.4\nbillion with a continuing target to maintain the pipeline at a healthy\nlevel of pre-leasing. Our 2022 development plans include a significant\ncomponent of speculative projects in Coastal Tier One markets, which we\nhave consistently demonstrated a track record of quickly leasing, and which\nwe believe will allow us to take advantage of the continued rental rate\nincreases in those markets.\"\n\n  Ranges for the other key assumptions underlying this guidance are as\nfollows:\n\n  *  Acquisitions of properties in a range of $300 million to $500 million.\n  *  General and administrative expenses ranging from $63 million to $67\nmillion.\n\n  More specific assumptions and components of the company's 2022 guidance\nwill be available by 6 p.m. Eastern Time today through the Investor\nRelations section of the company's website.\n\n  FFO and AFFO Reporting Definitions\n\n  FFO: FFO is a non-GAAP performance measure computed in accordance with\nstandards established by the National Association of Real Estate Investment\nTrusts (\"Nareit\"). It is calculated as net income attributable to common\nshareholders computed in accordance with generally accepted accounting\nprinciples (\"GAAP\"), excluding depreciation and amortization related to\nreal estate, gains and losses on sales of real estate assets (including\nreal estate assets incidental to our business), gains and losses from\nchange in control, impairment charges related to real estate assets\n(including real estate assets incidental to our business) and similar\nadjustments for unconsolidated joint ventures and partially owned\nconsolidated entities, all net of related taxes. We believe FFO to be most\ndirectly comparable to net income attributable to common shareholders as\ndefined by GAAP. FFO does not represent a measure of liquidity, nor is it\nindicative of funds available for our cash needs, including our ability to\nmake cash distributions to shareholders.\n\n  Core FFO: Core FFO is computed as FFO adjusted for certain items that can\ncreate significant earnings volatility and do not directly relate to our\ncore business operations. The adjustments include gains or losses on debt\ntransactions, gains or losses from involuntary conversion from weather\nevents or natural disasters, promote income, severance and other charges\nrelated to major overhead restructuring activities, the expense impact of\nnon-incremental costs attributable to successful leasing activities and\nsimilar adjustments for unconsolidated joint ventures and partially owned\nconsolidated entities. Although our calculation of Core FFO differs from\nNareit's definition of FFO and may not be comparable to that of other REITs\nand real estate companies, we believe it provides a meaningful supplemental\nmeasure of our operating performance.\n  AFFO: AFFO is defined by the company as the Core FFO (as defined above),\nless recurring building improvements and total second generation capital\nexpenditures (the leasing of vacant space that had previously been under\nlease by the company is referred to as second generation lease activity)\nrelated to leases commencing during the reporting period, and adjusted for\ncertain non-cash items including straight line rental income and expense,\namortization of above and below market lease intangibles and lease\nconcession, non-cash components of interest expense including interest rate\nhedge amortization, stock compensation expense and after similar\nadjustments for unconsolidated partnerships and joint ventures.\n\n  Same-Property Performance\n\n  The company includes same-property net operating income growth as a\nproperty-level supplemental measure of performance. The company utilizes\nsame-property net operating income growth as a supplemental measure to\nevaluate property-level performance, and jointly-controlled properties are\nincluded at the company's ownership percentage.\n\n  A reconciliation of income from continuing operations before income taxes\nto same-property net operating income is included in the financial tables\nto this release. A description of the properties that are excluded from the\ncompany's same-property net operating income measure is included on page 19\nof its December 31, 2021 supplemental information.\n\n  About Duke Realty Corporation\n\n  Duke Realty Corporation owns and operates approximately 162.4 million\nrentable square feet of industrial assets in 19 major logistics markets.\nDuke Realty Corporation is publicly traded on the NYSE under the symbol DRE\nand is a member of the S&amp;P 500 Index. More information about Duke Realty\nCorporation is available at www.dukerealty.com.\n\n  Fourth Quarter Earnings Call and Supplemental Information\n\n  Duke Realty Corporation is hosting a conference call tomorrow, January\n27, 2022, at 12:00 p.m. ET to discuss its fourth quarter operating results.\nAll investors and other interested parties are invited to listen to the\ncall. Access is available through the Investor Relations section of the\ncompany's website.\n\n  A copy of the company's supplemental information will be available by\n6:00 p.m. ET today through the Investor Relations section of the company's\nwebsite.\n\n  Cautionary Notice Regarding Forward-Looking Statements\n\n  This news release may contain forward-looking statements within the\nmeaning of the federal securities laws. All statements, other than\nstatements of historical facts, including, among others, statements\nregarding the company's future financial position or results, future\ndividends, and future performance, are forward-looking statements. Those\nstatements include statements regarding the intent, belief, or current\nexpectations of the company, members of its management team, as well as the\nassumptions on which such statements are based, and generally are\nidentified by the use of words such as \"may,\" \"will,\" \"seeks,\"\n\"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"plans,\" \"intends,\"\n\"should,\" or similar expressions although not all forward looking\nstatements may contain such words. Forward-looking statements are not\nguarantees of future performance and involve risks and uncertainties that\nactual results may differ materially from those contemplated by such\nforward-looking statements. Many of these factors are beyond the company's\nabilities to control or predict. Many of these factors are beyond the\ncompany's abilities to control or predict. Such factors include, but are\nnot limited to, (i) general adverse economic and local real estate\nconditions; (ii) the inability of major tenants to continue paying their\nrent obligations due to bankruptcy, insolvency or a general downturn in\ntheir business; (iii) financing risks, such as the inability to obtain\nequity, debt or other sources of financing or refinancing on favorable\nterms, if at all, and the company's ability to retain current credit\nratings; (iv) the company's ability to raise capital by selling its assets;\n(v) the company's continued qualification as a real estate investment\ntrust, or REIT, for U.S. federal income tax purposes; (vi) changes in\ngovernmental laws and regulations; (vii) the level and volatility of\ninterest rates and foreign currency exchange rates; (viii) valuation of\njoint venture investments; (ix) valuation of marketable securities and\nother investments, including volatility in the company's stock price and\ntrading volume; (x) valuation of real estate and other inherent risks in\nthe real estate business, including, but not limited to, tenant defaults,\npotential liability relating to environmental matters and liquidity of real\nestate investments; (xi) increases in operating costs; (xii) changes in the\ndividend policy for the company's common stock; (xiii) the reduction in the\ncompany's income in the event of multiple lease terminations by tenants, as\nwell as competition for tenants and potential decreases in property\noccupancy; (xiv) impairment charges, (xv) a failure or breach of our\ninformation technology systems networks or processes that could cause\nbusiness disruptions or loss of confidential information; (xvi) the effects\nof geopolitical instability and risks such as terrorist attacks and trade\nwars; (xvii) the effects of natural disasters, including floods, droughts,\nwind, tornadoes and hurricanes; (xviii) the impact of the COVID-19 pandemic\non our business, our tenants and the economy in general, including the\nmeasures taken by governmental authorities to address it; and (xiv) the\neffect of any damage to our reputation resulting from developments relating\nto any of items (i) - (xviii). The company refers you to the section\nentitled \"Risk Factors\" contained in the company's Annual Report on Form\n10-K for the year ended December 31, 2020 and the Company's Quarterly\nReport on Form 10-Q for the quarter ended September 30, 2021. Additional\ninformation concerning factors that could cause actual results to differ\nmaterially from those forward-looking statements is contained from time to\ntime in the company's filings with the Securities and Exchange Commission.\nCopies of each filing may be obtained from the company or the Securities\nand Exchange Commission.\n\n  The risks included here are not exhaustive and undue reliance should not\nbe placed on any forward-looking statements, which are based on current\nexpectations. All written and oral forward-looking statements attributable\nto the company, its management, or persons acting on their behalf are\nqualified in their entirety by these cautionary statements. Further,\nforward-looking statements speak only as of the date they are made, and the\ncompany undertakes no obligation to update or revise forward-looking\nstatements to reflect changed assumptions, the occurrence of unanticipated\nevents or changes to future operating results over time unless otherwise\nrequired by law.\n\n Contact Information:\n\nContact:\n  Investors:\nRon Hubbard\n317.808.6060\n\n  Media:\nGene Miller\n317.808.6195\n\n//st\n\nDuke Realty Corporation and Subsidiaries\n\nConsolidated Statement of Operations\n\n(Unaudited and in thousands, except per share amounts)\n\n     Three Months Ended    Twelve Months Ended\n\n     December 31,     December 31,\n\n       2021    2020    2021   2020\n\nRevenues:\n\n    Rental and   $  256,698  $  248,674  $  1,025,663  $  929,194\n    related revenue\n\n    General    7,876    17,616     80,260    64,004\n    contractor and\n    service fee\n    revenue\n       264,574  266,290    1,105,923  993,198\n\nExpenses:\n\n    Rental expenses    19,371   20,008     85,782    76,639\n\n    Real estate    37,070   38,778     159,580    149,295\n    taxes\n\n    General    5,549    16,398     68,118    57,976\n    contractor and\n    other services\n    expenses\n\n    Depreciation    88,813   92,354     362,148    353,013\n    and\n    amortization\n\n       150,803  167,538    675,628    636,923\n\nOther operating activities:\n\n    Equity in   2,980    2,986   32,804    11,944\n    earnings of\n    unconsolidated\n    joint ventures\n\n    Gain on sale    29,930   107,795    585,685    127,700\n    of properties\n\n    Gain on land    126  1,907   12,917    10,458\n    sales\n\n    Other      (834)  (3,779)    (3,607)  (8,209)\n    operating\n    expenses\n\n    Impairment     -    -      -     (5,626)\n    charges\n\n    Non-incremental    (2,983)  (1,675)    (13,302)  (12,292)\n    costs related\n    to successful\n    leases\n\n    General and    (15,306)  (15,596)    (69,554)  (62,404)\n    administrative\n    expenses\n\n       13,913   91,638     544,943    61,571\n\n    Operating   127,684  190,390    975,238    417,846\n    income\n\nOther income (expenses):\n\n    Interest and    882  78     4,451  1,721\n    other income,\n    net\n\n    Interest    (21,261)  (24,048)    (84,843)  (93,442)\n    expense\n\n    Loss on debt    -    (2)    (17,901)  (32,900)\n    extinguishment\n\n    Gain on    -    -      3,222  4,312\n    involuntary\n    conversion\n\nIncome from continuing      107,305  166,418    880,167    297,537\noperations, before income taxes\n\n    Income tax     (3,312)  3,946   (18,549)  5,112\n    (expense)\n    benefit\n\n    Income from    103,993  170,364    861,618    302,649\n    continuing\n    operations\n\nDiscontinued operations:\n\n    Gain on sale    -    -      -     111\n    of properties\n\n    Income from    -    -      -     111\n    discontinued\n    operations\n\nNet income      103,993  170,364    861,618    302,760\n\nNet income attributable to   (1,094)  (1,548)    (8,723)  (2,845)\nnoncontrolling interests\n\n    Net income   $  102,899  $  168,816  $  852,895    $  299,915\n    attributable\n    to common\n    shareholders\n\nBasic net income per common\nshare:\n\n    Continuing   $  0.27  $  0.45  $  2.25   $  0.81\n    operations\n    attributable\n    to common\n    shareholders\n\nDiluted net income per common\nshare:\n\n    Continuing   $  0.27  $  0.45  $  2.25   $  0.80\n    operations\n    attributable\n    to common\n    shareholders\n\n//et\n\n//st\n\n    Duke Realty Corporation and Subsidiaries\n\n    Consolidated Balance Sheets\n\n    (Unaudited and in thousands)\n\n     December 31,   December 31,\n\n       2021      2020\n\n    Assets\n\nReal estate investments:\n\n    Real estate  $  9,616,076   $  8,745,155\n    assets\n\n    Construction   744,871    695,219\n    in progress\n\n    Investments    168,336    131,898\n    in and\n    advances to\n    unconsolidated\n    joint ventures\n\n    Undeveloped    473,317    291,614\n    land\n\n       11,002,600    9,863,886\n\n    Accumulated    (1,684,413)    (1,659,308)\n    depreciation\n\n    Net real   9,318,187     8,204,578\n    estate\n    investments\n\nReal estate investments and     144,651    67,946\nother assets held-for-sale\n\nCash and cash equivalents    69,752    6,309\n\nAccounts receivable     13,449    15,204\n\nStraight-line rents receivable   172,225    153,943\n\nReceivables on construction     57,258    30,583\ncontracts, including retentions\n\nDeferred leasing and other   337,936    329,765\ncosts, net\n\nRestricted cash held in escrow   -     47,682\nfor like-kind exchange\n\nOther escrow deposits and other  332,197    255,384\nassets\n\n     $  10,445,655  $  9,111,394\n\n    Liabilities\n    and Equity\n\nIndebtedness:\n\n    Secured debt,   $  59,418  $  64,074\n    net of\n    deferred\n    financing\n    costs\n\n    Unsecured     3,629,864     3,025,977\n    debt, net of\n    deferred\n    financing\n    costs\n\n    Unsecured     -     295,000\n    line of credit\n\n       3,689,282     3,385,051\n\nLiabilities related to real     6,278     7,740\nestate investments held-for-sale\n\nConstruction payables and    107,009    62,332\namounts due subcontractors,\nincluding retentions\n\nAccrued real estate taxes    77,464    76,501\n\nAccrued interest    20,815    18,363\nOther liabilities      339,023    269,806\n\nTenant security deposits and    66,823    57,153\nprepaid rents\n\n    Total     4,306,694     3,876,946\n    liabilities\n\nShareholders' equity:\n\n    Common shares  3,825     3,733\n\n    Additional    6,143,147     5,723,326\n    paid-in\n    capital\n\n    Accumulated    (28,011)    (31,568)\n    other\n    comprehensive\n    loss\n\n    Distributions  (75,210)    (532,519)\n    in excess of\n    net income\n\n    Total     6,043,751     5,162,972\n    shareholders'\n    equity\n\nNoncontrolling interests    95,210    71,476\n\n    Total equity   6,138,961     5,234,448\n\n     $  10,445,655  $  9,111,394\n\n//et\n\n//st\n\n     Duke Realty Corporation and Subsidiaries\n\n     Summary of EPS, FFO and AFFO\n\n     Three Months Ended December 31,\n\n     (Unaudited and in thousands, except per share amounts)\n\n       2021        2020\n\n           Wtd.      Wtd.\n\n           Avg.  Per      Avg.  Per\n\n      Amount    Shares   Share  Amount    Shares   Share\nNet income attributable to common   $   102,899      $   168,816\nshareholders\n\nLess dividends on participating     (323)      (382)\nsecurities\n\nNet income per common share-basic    102,576  381,679  $  0.27   168,434\n372,087  $  0.45\n\nAdd back:\n\n     Noncontrolling    1,007    3,724      1,499  3,327\n     interest in\n     earnings of\n     unitholders\n\n     Other    131  1,748      382   2,723\n     potentially\n     dilutive\n     securities\n\nNet income attributable to common   $   103,714  387,151  $  0.27   170,315\n378,137  $  0.45\nshareholders-diluted\n\nReconciliation to FFO\n\nNet income attributable to common   $   102,899  381,679    $   168,816\n372,087\nshareholders\n\nAdjustments:\n\n     Depreciation  88,813       92,354\n     and\n     amortization\n\n     Depreciation,    2,873        2,506\n     amortization\n     and other -\n     unconsolidated\n     joint ventures\n\n     Gain on sales    (29,930)      (107,795)\n     of properties\n\n     Gain on land  (126)      (1,907)\n     sales\n\n     Income tax    3,312        (3,946)\n     expense\n     (benefit) not\n     allocable to\n     FFO\n     Gain on sales    (27)      (35)\n     of real estate\n     assets -\n     unconsolidated\n     joint ventures\n\n     Noncontrolling    (627)      166\n     interest share\n     of adjustments\n\nNareit FFO attributable to common    167,187  381,679  $  0.44   150,159\n372,087  $  0.40\nshareholders - basic\n\n     Noncontrolling    1,007    3,724      1,499  3,327\n     interest in\n     income of\n     unitholders\n\n     Noncontrolling    627      (166)\n     interest share\n     of adjustments\n\n     Other      2,435        2,723\n     potentially\n     dilutive\n     securities\n\nNareit FFO attributable to common   $   168,821  387,838  $  0.44  $\n151,492   378,137  $  0.40\nshareholders - diluted\n\n     Loss on debt  -        2\n     extinguishment\n\n     Non-incremental   2,983        1,675\n     costs related\n     to successful\n     leases\n\n     Overhead     -        2,461\n     restructuring\n     charges\n\nCore FFO attributable to common  $   171,804  387,838  $  0.44  $   155,630\n378,137  $  0.41\nshareholders - diluted\n\nAFFO\n\nCore FFO - diluted     $   171,804  387,838  $  0.44  $   155,630   378,137\n$  0.41\n\nAdjustments:\n     Straight-line    (9,107)      (10,168)\n     rental income\n     and expense\n\n     Amortization  (2,925)      (3,159)\n     of above/below\n     market rents\n     and concessions\n\n     Stock based   2,595        2,714\n     compensation\n     expense\n\n     Noncash   2,760        2,342\n     interest\n     expense\n\n     Second    (624)      (349)\n     generation\n     concessions\n\n     Second    (5,036)      (8,115)\n     generation\n     tenant\n     improvements\n\n     Second    (5,660)      (14,891)\n     generation\n     leasing costs\n\n     Building     (6,070)      (2,620)\n     improvements\n\nAFFO - diluted     $   147,737  387,838    $   121,384   378,137\n\n//et\n\n//st\n\n     Duke Realty Corporation and Subsidiaries\n\n     Summary of EPS, FFO and AFFO\n\n     Twelve Months Ended December 31,\n\n     (Unaudited and in thousands, except per share amounts)\n\n       2021         2020\n\n         Wtd.         Wtd.\n\n         Avg.  Per      Avg.  Per\n\n      Amount    Shares   Share  Amount    Shares   Share\nNet income attributable to common   $   852,895       $  299,915\nshareholders\n\nLess dividends on participating     (1,356)      (1,447)\nsecurities\n\nNet income per common share-basic    851,539   377,673  $  2.25   298,468\n370,057  $  0.81\n\nAdd back:\n\n     Noncontrolling    8,354  3,708      2,663  3,303\n     interest in\n     earnings of\n     unitholders\n\n     Other    1,356  2,095      -    796\n     potentially\n     dilutive\n     securities\n\nNet income attributable to common   $   861,249   383,476  $  2.25   $\n301,131   374,156  $  0.80\nshareholders-diluted\n\nReconciliation to FFO\n\nNet income attributable to common   $   852,895   377,673     $  299,915\n370,057\nshareholders\n\nAdjustments:\n\n     Depreciation  362,148       353,013\n     and\n     amortization\n\n     Depreciation,    9,383        9,265\n     amortization\n     and other -\n     unconsolidated\n     joint ventures\n\n     Gain on sales    (585,685)      (127,811)\n     of properties\n\n     Gain on land  (12,917)      (10,458)\n     sales\n\n     Income tax    18,549        (5,112)\n     expense\n     (benefit) not\n     allocable to\n     FFO\n     Impairment    -        5,626\n     Charges\n\n     Gain on sales    (20,106)      (822)\n     of real estate\n     assets -\n     unconsolidated\n     joint ventures\n\n     Noncontrolling    2,222        (1,979)\n     interest share\n     of adjustments\n\nNareit FFO attributable to common    626,489   377,673  $  1.66   521,637\n370,057  $  1.41\nshareholders - basic\n\n     Noncontrolling    8,354  3,708      2,663  3,303\n     interest in\n     income of\n     unitholders\n\n     Noncontrolling    (2,222)      1,979\n     interest share\n     of adjustments\n\n     Other      2,095        2,236\n     potentially\n     dilutive\n     securities\n\nNareit FFO attributable to common   $   632,621   383,476  $  1.65   $\n526,279   375,596  $  1.40\nshareholders - diluted\n\n     Gain on   (3,222)      (4,312)\n     involuntary\n     conversion\n\n     Loss on debt  17,964        32,900\n     extinguishment\n     - including\n     share of\n     unconsolidated\n     joint venture\n\n     Non-incremental   13,302        12,292\n     costs related\n     to successful\n     leases\n\n     Overhead     3,463        4,524\n     restructuring\n     charges\nCore FFO attributable to common  $   664,128   383,476  $  1.73   $\n571,683   375,596  $  1.52\nshareholders - diluted\n\nAFFO\n\nCore FFO - diluted     $   664,128   383,476  $  1.73   $  571,683\n375,596  $  1.52\n\nAdjustments:\n\n     Straight-line    (32,846)      (26,102)\n     rental income\n     and expense\n\n     Amortization  (12,475)      (9,093)\n     of above/below\n     market rents\n     and concessions\n\n     Stock based   25,122        23,049\n     compensation\n     expense\n\n     Noncash   9,834        9,238\n     interest\n     expense\n\n     Second    (2,913)      (743)\n     generation\n     concessions\n\n     Second    (21,725)      (18,188)\n     generation\n     tenant\n     improvements\n\n     Second    (29,479)      (29,017)\n     generation\n     leasing costs\n\n     Building     (10,597)      (3,926)\n     improvements\n\nAFFO - diluted     $   589,049   383,476     $  516,901   375,596\n\n//et\n\n//st\n\nDuke Realty Corporation and Subsidiaries\n\nReconciliation of Same Property Net Operating Income Growth\n\n(Unaudited and in thousands)\n\n     Three Months Ended\n\n     December 31, 2021    December 31, 2020\n\nIncome from   $    107,305   $   166,418\ncontinuing\noperations\nbefore income\ntaxes\n\nShare of same    5,627     5,582\nproperty NOI\nfrom\nunconsolidated\njoint ventures\n\nIncome and      94,482    24,133\nexpense items\nnot allocated\nto segments\n\nEarnings from    (2,327)   (1,218)\nservice\noperations\n\nProperties not   (41,811)   (39,762)\nincluded and\nother\nadjustments\n\nSame property  $    163,276   $   155,153\nNOI - Cash Basis\n\nPercent Change   5.2   %\n\n     Twelve Months Ended\n\n     December 31, 2021    December 31, 2020\n\nIncome from   $    880,167   $   297,537\ncontinuing\noperations\nbefore income\ntaxes\n\nShare of same    22,505    21,880\nproperty NOI\nfrom\nunconsolidated\njoint ventures\n\nIncome and      (88,940)   410,541\nexpense items\nnot allocated\nto segments\n\nEarnings from    (12,142)   (6,028)\nservice\noperations\n\nProperties not   (162,580)   (116,818)\nincluded and\nother\nadjustments\n\nSame property  $    639,010   $   607,112\nNOI - Cash Basis\n\nPercent Change   5.3   %\n\nDuke Realty Corporation and Subsidiaries\n\nReconciliation of 2022 FFO Per Diluted Share Guidance\n\n(Unaudited)\n\n     Pessimistic     Optimistic\n\nNet income    $    1.79  $   2.07\nattributable to\ncommon\nshareholders -\ndiluted\n\nDepreciation    0.95      0.89\n\nGains on land    (0.99)   (1.09)\nand property\nsales\n\nShare of joint   0.02      -\nventure\nadjustments\n\nNareit FFO    $    1.77  $   1.87\nattributable to\ncommon\nshareholders -\ndiluted\n\nLoss on debt    0.05      0.05\nextinguishment\n\nNon-incremental     0.04      0.02\ncosts related\nto successful\nleases\n\nOther      0.01      (0.01)\nreconciling\nitems\n\nCore FFO  $    1.87  $   1.93\nattributable to\ncommon\nshareholders -\ndiluted\n\n//et\n\nTel  : 317-808-6000   DUKE REALTY CORP\nFax  : 317-808-6650\nWWW  : <a href=\"http://www.dukerealty.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.dukerealty.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2202500677.MNPRE2202503098-22424820220126</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}