{"date": "2021-04-13 15:36:07+00:00", "ticker": "AAF", "mrkt_info": {"open": 84.1, "close": 74.55}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .ab{margin:42.55pt 54.0pt 2.0cm 72.0pt;}.storyContent p.aw{margin-top:9.0pt;margin-right:0cm;margin-bottom:0cm;margin-left:0cm;margin-bottom:.0001pt;line-height:16.0pt;font-size:11.0pt;font-weight:bold;text-align:justify;}.storyContent p.ax{margin-top:0cm;margin-right:0cm;margin-bottom:10.0pt;margin-left:0cm;line-height:115%;font-size:11.0pt;font-weight:bold;line-height:11.75pt;margin-bottom:12.1pt;text-align:justify;}.storyContent p.ay{margin-top:0cm;margin-right:0cm;margin-bottom:10.0pt;margin-left:0cm;line-height:115%;font-size:11.0pt;margin-bottom:12.1pt;text-align:justify;line-height:11.75pt;}.storyContent .aq{text-decoration:underline;text-decoration-color:inherit;}.storyContent p.az{margin-top:0cm;margin-right:0cm;margin-bottom:10.0pt;margin-left:0cm;line-height:115%;font-size:11.0pt;text-align:justify;line-height:15.4pt;}.storyContent p.ba{margin-top:9.0pt;margin-right:0cm;margin-bottom:0cm;margin-left:0cm;margin-bottom:.0001pt;line-height:16.0pt;font-size:11.0pt;font-weight:bold;}.storyContent span.an{letter-spacing:.3pt;}.storyContent table.bb{margin-left:-5.4pt;border-collapse:collapse;}.storyContent tr.af{height:60.65pt;}.storyContent td.ai{width:298.9pt;padding:0cm 5.4pt 0cm 5.4pt;height:60.65pt;}.storyContent p.bc{margin-top:0cm;margin-right:0cm;margin-bottom:10.0pt;margin-left:0cm;line-height:115%;font-size:11.0pt;margin-bottom:6.0pt;line-height:normal;}.storyContent p.bd{margin-top:0cm;margin-right:0cm;margin-bottom:10.0pt;margin-left:0cm;line-height:115%;font-size:11.0pt;font-weight:bold;line-height:normal;margin-bottom:6.0pt;}.storyContent td.ag{width:130.65pt;padding:0cm 5.4pt 0cm 5.4pt;height:60.65pt;}.storyContent p.be{margin-top:0cm;margin-right:0cm;margin-bottom:10.0pt;margin-left:0cm;line-height:115%;font-size:11.0pt;line-height:normal;margin-bottom:6.0pt;text-align:right;}.storyContent p.bf{margin-top:0cm;margin-right:0cm;margin-bottom:10.0pt;margin-left:0cm;line-height:115%;font-size:11.0pt;font-weight:bold;}.storyContent p.bg{margin-top:12.0pt;margin-right:0cm;margin-bottom:12.0pt;margin-left:0cm;text-align:justify;font-size:12.0pt;margin-top:6.0pt;margin-right:0cm;margin-bottom:6.0pt;margin-left:0cm;}.storyContent span.ad{font-size:10.5pt;}</style><div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><div style=\"text-align:left;font-size:10pt\"><div>RNS Number : 3491V</div>  <div>J.P. Morgan Securities PLC.</div>  <div>13 April 2021</div>  <div> </div></div>\n<div class=\"ab\">\n<p class=\"aw\"><span class=\"au\">NOT FOR RELEASE, PUBLICATION OR DISTRIBUTION, DIRECTLY OR INDIRECTLY, IN WHOLE OR IN PART, INTO OR IN THE UNITED STATES, CANADA, AUSTRALIA OR JAPAN OR ANY OTHER JURISDICTION IN WHICH OFFERS OR SALES WOULD BE PROHIBITED BY APPLICABLE LAW. THIS ANNOUNCEMENT DOES NOT CONSTITUTE OR FORM AN OFFER OF SECURITIES IN THE UNITED STATES, CANADA, AUSTRALIA, SOUTH AFRICA, JAPAN OR ANY OTHER JURISDICTION. </span></p>\n<p class=\"aw\"><span class=\"au\">PLEASE SEE THE IMPORTANT NOTICE AT THE END OF THIS ANNOUNCEMENT</span></p>\n<p class=\"ax\"><span class=\"as\"> </span></p>\n<p class=\"ay\"><span class=\"aq\" style=\"font-weight:bold\"><span>Press Release, </span></span><span class=\"aq\" style=\"font-weight:bold\"><span class=\"as\">13 April 2021</span></span></p>\n<p class=\"ax\">Proposed secondary placing of shares in Airtel Africa plc</p>\n<p class=\"az\"><span>J.P. Morgan Securities plc, which conducts its UK investment banking activities as J.P. Morgan Cazenove (\"<span style=\"font-weight:bold\">J.P. Morgan Cazenove</span>\"), has been appointed by a</span>n institutional seller (the \"Selling Shareholder\") to sell approximately 50 million ordinary shares in Airtel Africa plc (\"Airtel Africa\" or the \"Company\") (the \"Placing Shares\"), representing approximately 1.3 per cent. of the Company's ordinary issued share capital.</p>\n<p class=\"az\">The price per Placing Share will be determined through an accelerated bookbuild process. The bookbuild process will commence with immediate effect following this announcement and may close at any time at short notice. A further announcement will be made following the completion of the bookbuild and pricing of the Placing.</p>\n<p class=\"az\">The Selling Shareholder will be locked up in respect of its residual holding for a period of 90 days post settlement of the Placing, subject to customary exceptions.</p>\n<p class=\"az\"><span>J.P. Morgan Cazenove </span><span>is acting as sole bookrunner in relation to the Placing.</span></p>\n<p class=\"az\">Airtel Africa will not receive any proceeds from the Placing.</p>\n<p class=\"ba\"><span class=\"an\">Enquiries:</span></p>\n<div class=\"story-table-container\"><table cellpadding=\"0\" cellspacing=\"0\" class=\"bb\">\n<tr class=\"af\">\n<td class=\"ai\" style=\"width:399\">\n<p class=\"bc\"><span style=\"font-weight:bold\"><span>J.P. Morgan Cazenove </span></span><span>        </span></p>\n<p class=\"bc\"><span class=\"ak\">Achintya Mangla</span></p>\n<p class=\"bc\"><span class=\"ak\">Barry Meyers</span></p>\n<p class=\"bd\"><span> </span></p>\n</td>\n<td class=\"ag\" style=\"width:174\">\n<p class=\"be\"><span>+44 207 742 4000</span></p>\n</td>\n</tr>\n</table></div>\n<p class=\"bf\"><span class=\"ak\">IMPORTANT NOTICE</span></p>\n<p class=\"bg\"><span class=\"ad\">This announcement is not for publication, distribution or release, directly or indirectly, in or into the United States of America (including its territories and possessions), Australia, Canada, Japan or the Republic of South Africa or any other jurisdiction where such an announcement would be unlawful.  The distribution of this announcement may be restricted by law in certain jurisdictions and persons into whose possession this document or other information referred to herein comes should inform themselves about and observe any such restriction.  Any failure to comply with these restrictions may constitute a violation of the securities laws of any such jurisdiction.</span></p>\n<p class=\"bg\"><span class=\"ad\">This announcement is not an offer of securities or investments for sale nor a solicitation of an offer to buy securities or investments in any jurisdiction where such offer or solicitation would be unlawful.  No action has been taken that would permit an offering of the securities or possession or distribution of this announcement in any jurisdiction where action for that purpose is required.  Persons into whose possession this announcement comes are required to inform themselves about and to observe any such restrictions.</span></p>\n<p class=\"bg\"><span class=\"ad\">The Placing Shares may not be offered to the public in any jurisdiction in circumstances which would require the preparation or registration of any prospectus or offering document relating to the Placing Shares in such jurisdiction.  No action has been taken by the Selling Shareholder that would permit an offering of the Placing Shares or possession or distribution of this announcement or any other offering or publicity material relating to such securities in any jurisdiction where action for that purpose is required. </span></p>\n<p class=\"bg\"><span class=\"ad\">The securities referred to herein have not been and will not be registered under the U.S. Securities Act of 1933, as amended (the \"Securities Act\"), and, subject to certain exemptions, may not be offered or sold in the United States (as defined in Regulation S under the Securities Act).  Neither this document nor the information contained herein constitutes or forms part of an offer to sell or the solicitation of an offer to buy securities in the United States.  There will be no public offer of any securities in the United States or in any other jurisdiction.</span></p>\n<p class=\"bg\"><span class=\"ad\">In member states of the European Economic Area (\"EEA\") (each, a \"Relevant Member State\"), this announcement and any offer if made subsequently is directed exclusively at persons who are 'qualified investors' within the meaning of the Prospectus Regulation (\"Qualified Investors\").  For these purposes, the expression 'Prospectus Directive' means Regulation (EU) 2017/1129.  </span></p>\n<p class=\"bg\"><span class=\"ad\">In the United Kingdom, this announcement is directed exclusively at persons who are 'qualified 'qualified investors' within the meaning of the UK Prospectus Regulation and (i) who have professional experience in matters relating to investments falling within Article 19(5) of the Financial Services and Markets Act 2000 (Financial Promotion) Order 2005, as amended (the \"Order\") or (ii) who fall within Article 49(2)(A) to (D) of the Order, or (iii) to whom it may otherwise lawfully be communicated. For these purposes, the expression 'UK Prospectus Regulation' means Regulation (EU) 2017/1129 as it forms part of UK domestic law by virtue of the European Union (Withdrawal) Act 2018. </span></p>\n<p class=\"bg\"><span class=\"ad\">In connection with any offering of the Placing Shares, J.P. Morgan Cazenove and any of its affiliates acting as an investor for their own account may take up as a proprietary position any Placing Shares and in that capacity may retain, purchase or sell for their own account such Placing Shares.  In addition, they may enter into financing arrangements and swaps with investors in connection with which they may from time to time acquire, hold or dispose of Placing Shares.  They do not intend to disclose the extent of any such investment or transactions otherwise than in accordance with any legal or regulatory obligation to do so.</span></p>\n<p class=\"bg\"><span class=\"ad\">J.P. Morgan Cazenove is authorised by the Prudential Regulation Authority and regulated by the Financial Conduct Authority and the Prudential Regulation Authority, is acting on behalf of the Selling Shareholder and no one else in connection with any offering of the Placing Shares and will not be responsible to any other person for providing the protections afforded to any of its clients or for providing advice in relation to any offering of the Placing Shares.  J.P. Morgan Cazenove will not regard any other person as its client in relation to the offering of the Placing Shares.</span></p>\n<p class=\"bf\"><span class=\"ak\"> </span></p>\n</div>\n<div style=\"text-align:left;font-size:10pt\"><div>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a>.<br/><br/>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a>.</div><div> </div>  END</div><div> </div><div> </div>IOEBUGDSGDBDGBX</div>"}