{"date": "2021-11-10 11:11:00.164000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwlistdisc{list-style-type:disc;}</style><p class=\"bwalignc\">\n<b>Amazon Announces the Launch of Amazon Music for Colombia and Chile, Giving Customers Access to Millions of Songs in the Highest-Quality Audio, On-Demand and Ad-Free</b>\n</p><p class=\"bwalignc\">\n<span>Amazon Music offers two streaming tiers for Colombia and Chile, including Amazon Music Unlimited, with unlimited access to more than 75 million songs in the highest-quality audio, including today’s hottest new releases and thousands of playlists and stations, on-demand and ad-free</span>\n</p><p class=\"bwalignc\">\n<span>Customers can also access an ad-supported selection of top playlists, thousands of stations, and millions of episodes of podcasts for free on their favorite devices</span>\n</p><p class=\"bwalignc\">\n<span>New customers can subscribe today for three-month trial of Amazon Music Unlimited at no additional cost</span>\n</p><p>\n(NASDAQ: AMZN)—Amazon today announced the launch of Amazon Music for Colombia and Chile, bringing music fans millions of songs streaming in the highest-quality audio, thousands of locally programmed playlists and stations, top podcasts they already know and love, live streaming in partnership with Twitch, and new Original shows produced exclusively for Amazon Music.\n</p><p>\nTo download high-res images, click <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Famznstudios.box.com%2Fs%2Ftjjwttvx5fhtr7qw0lelorxwoc2rs1r5&amp;esheet=52527274&amp;newsitemid=20211110005702&amp;lan=en-US&amp;anchor=here&amp;index=1&amp;md5=042369848f8d4c810033d5f119492ae0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a>.\n</p><p>\nBeginning today, customers in Colombia and Chile can access Amazon Music Unlimited, the music-subscription tier with unlimited access to more than 75 million songs in High Definition, and millions of songs in Ultra High Definition, the highest-quality streaming audio available, ad-free and on-demand. Music fans can also access an ad-supported selection of top playlists and thousands of stations for free, no subscription or credit card required.\n</p><p>\nWith Amazon Music, listeners will enjoy chart-topping releases from local and international artists, including J Balvin, Karol G, and Silvestre Dangond in Colombia and Mon Laferte, Gepe, and Denise Rosenthal in Chile, along with locally curated playlists and stations, developed specifically for today’s music fan in each country.\n</p><p>\n“We’re extremely excited to expand Amazon Music in Latin America and bring music fans even more choice and ways of discovering music,” said Federico Pedersen, head of Latin America for Amazon Music. “This is an innovative time in the industry and we’re looking forward to offering artists in Colombia and Chile the opportunity to engage with their fans in new ways. Our team has focused heavily on curating a wide breadth of content, including podcasts, playlists, and stations, to spotlight the diversity of each country’s music and creators to delight our customers.”\n</p><p>\nAmazon Music customers can choose from a diverse selection of locally curated playlists and stations covering popular genres specific to the regions, including rock, cumbia, folk, and reggaeton, as well as new music from international artists rising on the global charts. Starting today, Amazon Music listeners can begin streaming the following playlists:\n</p><p>\nIn Colombia:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\n<b>“Hecho en Colombia” </b>— Featuring an expertly curated list of local artists across different genres, including Andy Rivera, Bomba Estéreo, Carlos Vives, Juanes, Las Villa, and Monsieur Periné.\n</li>\n<li>\n<b>“Farra Popular” </b>— Updated weekly with top tracks from the biggest names of the genre, like Jessi Uribe, Jhonny Rivera, Paola Jara, Pipe Bueno, and Yeison Jiménez.\n</li>\n<li>\n<b>“Viva Vallenato”</b> — A new global playlist dedicated to the genre, with tunes from Diomedes Diaz, Diego Daza, Felipe Peláez, Los Inquietos del Vallenato, Silvestre Dangond, and more.\n</li>\n</ul><p>\nIn Chile:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\n<b>“Platino”</b> — A global playlist updated every Friday with the hottest Latin hits by artists like Camilo, J Balvin, Jhay Cortez, Karol G, and Maluma.\n</li>\n<li>\n<b>“Las Chilenas” </b>—<b> </b>A new playlist featuring female voices from Chile, like Yorka, Francisca Valenzuela, and SOULFIA.\n</li>\n<li>\n<b>“TOPÍSIMO” </b>—<b> </b>From Chile to the world, a playlist featuring national tracks from Princesa Alba, Cami, Harry Nach and more.\n</li>\n</ul><p>\nWith Amazon Music Unlimited, customers can stream music in High Definition and Ultra HD, the highest quality streaming audio available, at no extra cost to their subscription. Customers can also stream music mixed in spatial audio on multiple devices, including iOS and Android devices, with their existing headphones and on select devices that support Alexa Cast. With Amazon Music Unlimited, customers can stream more than 75 million lossless, High Definition (HD) songs, with a bit depth of 16 bits and a sample rate of at least 44.1 kHz (CD quality). Customers can also stream more than 7 million songs in Ultra HD (better than CD quality), with a bit depth of 24 bits and a sample rate up to 192 kHz, which reveals even more nuances that were once lost in files compressed for digital streaming.\n</p><p>\nAll customers, no matter the streaming tier, will have access to millions of podcast episodes at no additional cost.<b> </b>Since Amazon Music launched podcasts in 2020, it has become a premier destination for podcast listeners and creators. Popular Spanish-language shows such as <span>Despertando Podcast</span>, <span>La Cosa Nostra, Mesa Central, Hablemos de Comedia, Relatos de la Noche, Hablemos en Off, En Terapia con Roberto Rocha</span>, and <span>Relatos en Inglés</span> <span>con</span> <span>Duolingo</span> are now available in Chile, along with millions of additional episodes, and more being added all the time. <span>DianaUribe.fm</span>, <span>Curiosidades de la Historia de National Geographic</span>, <span>Radio Ambulante</span>, <span>El Topo</span>, and <span>Se Regalan Dudas</span> are available now in Colombia. Podcasts from leading media partners COPESA, RDF Media, Radio Cooperativa, National Geographic, Sonoro, and TED in Chile, and Caracol Radio, Blu Radio, National Geographic, Sonoro, and TED in Colombia will be available globally on Amazon Music,<span> </span>including in the United States and anywhere the service is currently available. Original shows produced exclusively for Amazon Music in Spanish in Chile will be launching in the coming months.\n</p><p>\nCustomers in Colombia and Chile can now sign up for a free, three-month trial of Amazon Music Unlimited for a limited time before choosing from three plan options. In Colombia, Amazon Music Unlimited is available at the Echo Plan, which allows unlimited streaming in a single Echo device for $7,105 COP/month, the Individual Plan for $14,900 COP/month, or the Family Plan, which allows up to six members of the same family to use one subscription, for only $23,900 COP/month. In Chile, Amazon Music Unlimited is available at the Echo / Fire TV Plan, which allows unlimited streaming in a single Echo device or Fire TV for CLP$2,200.00/month, the Individual Plan for CLP$4,150.00/month, or the Family Plan, which allows up to six members of the same family to use one subscription, for only CLP$6,290.00/month.\n</p><p>\nFor more information about Amazon Music for Colombia, customers can visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Famazonmusicco&amp;esheet=52527274&amp;newsitemid=20211110005702&amp;lan=en-US&amp;anchor=www.amazon.com%2Famazonmusicco&amp;index=2&amp;md5=b84aa2e29442e5b47b6ed8387245ae2e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/amazonmusicco</a>, follow @<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.instagram.com%2Famazonmusicco&amp;esheet=52527274&amp;newsitemid=20211110005702&amp;lan=en-US&amp;anchor=amazonmusicco&amp;index=3&amp;md5=4c299a2d39e6feb08c1923d3267f6d1a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazonmusicco</a> on Instagram or on Facebook: <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.facebook.com%2FAmazonMusicCO&amp;esheet=52527274&amp;newsitemid=20211110005702&amp;lan=en-US&amp;anchor=https%3A%2F%2Fwww.facebook.com%2FAmazonMusicCO&amp;index=4&amp;md5=7fe677fb751bebd99e600a7fca02c050\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.facebook.com/AmazonMusicCO</a>\n</p><p>\nFor more information about Amazon Music for Chile, customers can visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Famazonmusiccl&amp;esheet=52527274&amp;newsitemid=20211110005702&amp;lan=en-US&amp;anchor=www.amazon.com%2Famazonmusiccl&amp;index=5&amp;md5=5d34d2c61c8ffc02b9df6f46e7b64ce7\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/amazonmusiccl</a> and follow @<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.instagram.com%2Famazonmusiccl&amp;esheet=52527274&amp;newsitemid=20211110005702&amp;lan=en-US&amp;anchor=amazonmusiccl&amp;index=6&amp;md5=e9d3fcb370728902f2e3ece4e63cef16\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazonmusiccl</a> on Instagram or on Facebook: <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.facebook.com%2FAmazon-Music-Chile-103008032178999&amp;esheet=52527274&amp;newsitemid=20211110005702&amp;lan=en-US&amp;anchor=https%3A%2F%2Fwww.facebook.com%2FAmazonMusicCL&amp;index=7&amp;md5=89ed029b762be67722b18385f13fe74d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.facebook.com/AmazonMusicCL</a>\n</p><p>\n<b>About Amazon Music</b>\n</p><p>\nAmazon Music reimagines music listening by enabling customers to unlock millions of songs and thousands of curated playlists and stations with their voice. Amazon Music provides unlimited access to new releases and classic hits across iOS and Android mobile devices, PC, Mac, Echo, and Alexa-enabled devices including Fire TV and more. With Amazon Music, Prime members have access to ad-free listening of 2 million songs at no additional cost to their membership. Listeners can also enjoy the premium subscription service, Amazon Music Unlimited, which provides access to more than 75 million songs and the latest new releases. Amazon Music Unlimited customers also have access to the highest-quality listening experience available, with more than 75 million songs available in High Definition (HD), more than 7 million songs in Ultra HD, and a growing catalog of spatial audio. Customers also have free access to an ad-supported selection of top playlists and stations on Amazon Music. All Amazon Music tiers now offer a wide selection of podcasts at no additional cost, and live streaming in partnership with Twitch. Engaging with music and culture has never been more natural, simple, and fun. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Famazonmusiccl&amp;esheet=52527274&amp;newsitemid=20211110005702&amp;lan=en-US&amp;anchor=www.amazon.com%2Famazonmusic&amp;index=8&amp;md5=54d40e21f4b02905f192cb2623e42b22\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/amazonmusic</a> or download the Amazon Music app.\n</p><p>\n<b>About Amazon</b>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer‑Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Famazon.com%2Fabout&amp;esheet=52527274&amp;newsitemid=20211110005702&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=9&amp;md5=a6a44db191455f4b9b17cbb6392fb250\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211110005702r1&amp;sid=ny6r1&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTEwMDA1NzAycjEmc2lkPW55NnIxJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=337e72162df690c16454abc96b175df4c3d28a34b979b4c98d98a83617616f6d3ff923be3c221145f85766c8b99f55ebff475ddb878db11a950a9784ef251e26\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211110005702/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211110005702/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52527274&amp;newsitemid=20211110005702&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=10&amp;md5=af1cefa0619b9e556cd6c14c30a0e64d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON</p></div>"}