{"date": "2022-01-07 20:11:05+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3265.08, "close": 3229.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SOLUTION CUISINE LTD (\"VEG-V\")\n- Shareholder Approval for Proposed Plan of Arrangement with\n- PlantPlus Foods\n\n   Sol Cuisine Ltd. (\"Sol Cuisine\" or the \"Company\") announces the results\nof its special meeting (the \"Meeting\") of the shareholders of the Company\n(\"Sol Shareholders\") held today. At the Meeting, Sol Shareholders passed a\nspecial resolution to approve the proposed acquisition by PlantPlus Foods\nCanada Inc. of all of the outstanding common shares, all of the outstanding\ncommon share purchase warrants and compensation options, and all of the\noutstanding stock options of Sol Cuisine, pursuant to a plan of arrangement\nunder the Business Corporations Act (Ontario) (the \"Arrangement\").\n\n   The required shareholder approval thresholds were met, with the\nArrangement being approved by (i) 100% of the votes cast by Sol\nShareholders present in person or represented by proxy at the Meeting; and\n(ii) 100% of the votes cast by Sol Shareholders present in person or\nrepresented by proxy at the Meeting, excluding the votes of Dror Balshine,\nMichael Fata and John Flanagan.\n\n   Completion of the Arrangement is subject to the receipt of a final order\nof the Ontario Superior Court of Justice (Commercial List) (the \"Court\"),\nwhich is expected to be sought on January 12, 2022. In addition, certain\nclosing conditions customary in transactions of this nature are required to\nbe satisfied in order for the Arrangement to occur. Provided that approval\nof the Court is granted and all other closing conditions are satisfied or\nwaived, the Company expects the Arrangement to be completed later in\nJanuary 2022, at which time the Company will apply to have its common\nshares de-listed from the TSX Venture Exchange and to cease to be a\nreporting issuer.\n\nFor more details on Sol Cuisine's consumer brands:\nWebsite:    www.solcuisine.com\nInstagram:  @solcuisine\nFacebook:  @solcuisine\nTwitter:     @solcuisine\nLinkedIn:   @solcuisine\n\n   About Sol Cuisine Ltd.\n   Sol Cuisine is the publicly traded parent company of Sol Cuisine Inc.,\nfollowing the completion of its \"qualifying transaction\" on May 19, 2021.\nSol Cuisine is a fast-growing producer of branded and private label,\nconsumer-preferred plant-based protein offerings across key center-of-plate\nand appetizer categories. The Company's products are offered through an\nestablished omni-channel distribution platform in Canada, the U.S. and\nMexico, and are available in over 11,000 stores and more than 41,000 unique\npoints of distribution across four primary channels: Canada Retail Sales &amp;\nClub; U.S. Retail Sales &amp; Club; Food Service &amp; Industrial; and Private\nLabel. Over a history of 20+ years, Sol Cuisine has consistently\ndemonstrated an ability to innovate and delight consumers in Canada and the\nU.S., while remaining true to its commitment to producing great tasting,\nnutritionally superior products. This commitment has resulted in several\nCanadian product wins, including the #1 frozen plant-based burger in\nCanada, the #1 consumer-preferred chicken alternative and the #1 quality\nroast product as determined by Whole Foods Market. The Company's taste and\nnutritional superiority has also resulted in private label contracts with\nsome of the most recognized natural brands in North America. These products\nare all produced at Sol Cuisine's two state of the art facilities, totaling\n35,000 square foot facility in Mississauga, Ontario, capable of supporting\nup to 10 million kilograms of volume per annum.\n\n   Forward-Looking Statements.\n   This press release contains forward-looking statements within the\nmeaning of Canadian securities laws regarding the Company and its business.\nThese forward-looking statements contain statements of intent, belief or\ncurrent expectations of Sol Cuisine. Forward-looking information is often,\nbut not always identified by the use of words such as \"anticipate\",\n\"believe\", \"expect\", \"plan\", \"intend\", \"forecast\", \"target\", \"project\",\n\"may\", \"will\", \"should\", \"could\", \"estimate\", \"predict\" or similar words\nsuggesting future outcomes or language suggesting an outlook.\n\n   The forward-looking statements included in this press release, including\nstatements regarding the Arrangement, the receipt of requisite Court,\nregulatory and stock exchange approvals, and the anticipated timing for the\ncompletion of the Arrangement, are not guarantees of future results and\ninvolve risks and uncertainties that may cause actual results to differ\nmaterially from the potential results discussed in the forward-looking\nstatements.\n\n   In respect of the forward-looking statements and information concerning\nthe completion of the Arrangement and the anticipated timing for completion\nof the Arrangement, the Company has provided such in reliance on certain\nassumptions that it believes are reasonable at this time, including\nassumptions as to the ability of the parties to receive, in a timely manner\nand on satisfactory terms, the necessary regulatory, Court, stock exchange\nand other third party approvals and the ability of the parties to satisfy,\nin a timely manner, the other conditions to the completion of the\nArrangement. These dates may change for a number of reasons, including the\ninability to secure necessary regulatory, Court or other third party\napprovals in the time assumed or the need for additional time to satisfy\nthe other conditions to the completion of the Arrangement. Accordingly,\nreaders should not place undue reliance on the forward-looking statements\nand information contained in this news release concerning these times.\n\n   Risks and uncertainties that may cause such differences include but are\nnot limited to: the risk that the Arrangement may not be completed on a\ntimely basis, if at all; the conditions to the consummation of the\nArrangement may not be satisfied; the risk that the Arrangement may involve\nunexpected costs, liabilities or delays; the possibility that legal\nproceedings may be instituted against the Company and/or others relating to\nthe Arrangement and the outcome of such proceedings; the possible\noccurrence of an event, change or other circumstance that could result in\ntermination of the Arrangement; risks relating to the failure to obtain\nnecessary Court, regulatory and stock exchange approval; other risks\ninherent in the plant-based food industry. Failure to obtain the requisite\napprovals, or the failure of the parties to otherwise satisfy the\nconditions to or complete the Arrangement, may result in the Arrangement\nnot being completed on the proposed terms, or at all. In addition, if the\nArrangement is not completed, the announcement of the Arrangement and the\ndedication of substantial resources of the Company to the completion of the\nArrangement could have a material adverse impact on the Company's share\nprice, its current business relationships and on the current and future\noperations, financial condition and prospects of the Company. When relying\non forward-looking statements to make decisions, investors and others\nshould carefully consider the foregoing factors and other uncertainties and\npotential events. Readers are cautioned that the foregoing list of factors\nis not exhaustive. Additional information on these and other factors that\ncould affect the Company's operations or financial results are included in\nreports on file with applicable securities regulatory authorities and may\nbe accessed through the SEDAR website (www.sedar.com).\n\n   The forward-looking statements in this press release are made as of the\ndate it was issued and the Company does not undertake any obligation to\nupdate publicly or to revise any of the included forward-looking\nstatements, whether as a result of new information, future events or\notherwise, except as required by applicable law. By their very nature,\nforward-looking statements involve inherent risks and uncertainties, both\ngeneral and specific, and risks that outcomes implied by forward-looking\nstatements will not be achieved. The Company cautions readers not to place\nundue reliance on these statements.\n\n   Neither the TSX Venture Exchange nor its Regulation Services Provider\n(as that term is defined in the policies of the TSX Venture Exchange)\naccepts responsibility for the adequacy or accuracy of this press release.\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200600246.MNPRE2200601113-12095120220107</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}