{"date": "2022-02-18 19:52:47.681000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3093.05, "close": 3003.95}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>— <span>Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Keep an immaculate house but have more trouble with your car? To keep your vehicle clean, you need something powerful and portable to capture every spec on the floor and crumb between the seats. That's where the ThisWorx 12-volt car vacuum comes in—it's made for the job, and can be yours for its lowest price of the year right now.</p></div><div class=\"tr-npp-body\"><p><span><span>Get deals and shopping advice delivered straight to your phone.</span> Sign up for text message alerts from the experts at Reviewed.</span> </p><p>Amazon is currently offering a $20 coupon on purchases of the portable vacuum, which is available in both white and black, and comes with a carrying bag, a cleaning brush for the vacuum's filter and three attachments. That means you can get the ThisWorx vacuum, currently priced at $42.99, for $22.99—that's just under half off.</p><p>► <span>Baby formula recall:</span>  FDA warns consumers not to use select Similac, Alimentum and EleCare</p><p>► <span>Allbirds sale:</span>  Allbirds' popular sneakers are never on sale—but right now, they're 20% off</p><p>ThisWorx says the 12-volt vacuum has 110 watts of cleaning power that can be accessed through the auxiliary outlet of most cars and trucks. Lightweight and small in size, it features a washable double filter and a large bin capacity to trap ash, dust and food spills on car floors and seats. The cherry on top is its integrated LED light found between the motor base and the bin that helps illuminate the darker parts of your car. </p><p>No matter the state of your car, ThisWorx 12-volt vacuum is ready to clean it up. Be sure to buy before the deal gets sucked away. </p><p class=\"tr-npp-section-title\">Get the ThisWorx 12-Volt Car Vacuum Cleaner for $22.99 with coupon at Amazon (save $20). </p><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: 10,000 people swear by this car vacuum—and it's on sale for Presidents' Day at Amazon</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}