{"date": "2022-02-25 21:40:15.628000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3027.16, "close": 3071.26}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_9kivle6a&amp;referenceId=1_9kivle6a&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_9kivle6a&amp;referenceId=1_9kivle6a&amp;pageId=RefinitivNewscasts</a></pre>Source: Stocktube<br/><br/>Description: Kovo HealthTech CEO Greg Noble joined Steve Darling from Proactive to share news the company has launched the next generation of its OneRev technology platform, which simplifies the complex process of US healthcare billing for clinics, hospitals and physicians.&amp;#xD;&amp;#xD;Noble telling Proactive, this process has taken two years a two-year of development and is now being used by some of the several of its larger healthcare Billing-as-a-Service clients<br/>Short Link: <a href=\"https://refini.tv/3M5jUFZ\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3M5jUFZ</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; Welcome back inside our proactive newsroom and joining me now is Greg Noble. He is the CEO of Kovo Healthtech. And Greg, welcome back. Good to see you again. &gt;&gt; Thanks Steve. Good to be with you again. Thanks. &gt;&gt; A news release out talking about your OneRev building as a service. Before we get into the news, can you explain what that is? &gt;&gt; Yeah, definitely. So OneRev is our term for main platform that we use to process everything within our services. So it's the seventh iteration of what we call practice management system, manages practices that we use internally [inaudible 00:00:41] I built the first version back in 2002. So this has been a long ongoing process when the company first launched. We now have a full team of in-house, very talented people running these development efforts. I don't have to code anymore, so that's a wonderful thing. And it's really great to witness how the company has grown and matured over the years. And we use this system to track services by patients. So the submission of those services to insurances, posting payments against those services, producing statements for patients, running management reports and so forth. It's the flagship system which we use to support all of our internal service offerings. &gt;&gt; The announcement out was that you've now streamlined the process of this. And as you mentioned, it's been a couple of years in the making to get to this particular point. So tell me what now has improved with the new update. &gt;&gt; Yeah, definitely. This is one of the places that I get really excited about [inaudible 00:01:37] and software development is just really core to who I am. But software requires continuous upgrades to stay relevant, and support modern requirements. How we interface with people and so forth change over time. OneRev has been rebuilt from a very first bit. So this isn't a rewrite of something we've already done. We scrapped everything old, and started 100% new. And this has allowed us to be more fluid with those current requirements. It's what we call a responsive web interface. And what that means is it can run on any size screen, big 54 inch screens down to your mobile app. The code is based on open-source platforms and databases. It's designed to work in cloud environments such as Google Cloud Platform or Amazon Web Services, assuring 100% uptime and geo diverse hosting. So if something happens in California, we're still going to be up and running. This is accomplished with a key on data privacy. And so we're dealing with patient health information. And it's critical that we are HIPAA compliant and we're always protecting that. This system gets us in those spaces. &gt;&gt; Gray, I want to ask you also about growth for the company. Because it seems to me that with this update that you have now and this new area that you're presenting in here, that really is going to drive revenue for the company. Is that fair to say? &gt;&gt; It is fair to say. So what it does from a revenue perspective is it gives us new opportunities. So we are able to connect with more third-party platforms. We do call it winner of a platform because it is something that everything else is based upon. Our connections with health record systems, our connections with patients and so forth. The new system is 60% more efficient than our old system, streamlining manual requirements. So things really are a lot more electronic. And the less we can have people touching that flow, the better off we are, because computers type really fast. And that's what we moved into. It also builds a base for us to be able to do some artificial intelligence and AI and machine learning. These will all work in concert to further push down our costs, along with giving us opportunities in our revenue, more pushing down costs in our net income. &gt;&gt; Alright, well, we'll leave it there. Greg, congratulations on this very exciting time for you and the company, and we look forward to talking again really soon. &gt;&gt; Thanks, Steve. You have a great day. &gt;&gt; Yeah. You as well. There's Greg Noble, the CEO of Kovo Healthtech.<br/></span></div></div></div></div>"}