{"date": "2021-12-08 02:32:48.561000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><p>SINGAPORE, Dec 8, 2021 - (ACN Newswire) - Horangi, today launched Resilience and Excellence with Amazon Web Services (AWS) & Horangi (REA&H), a holistic security offering that provides customers with comprehensive cloud risk assessments and bespoke solutions that align with their desired business outcomes and drive innovation.</p><p class=\"line-break\"><br/></p><p>Cloud-based solutions are becoming ubiquitous in APAC as businesses in the region recognize that they can realize cost savings, gain competitive advantages, especially in crowded markets, and easily achieve scalability. The region's cloud market is forecasted to lead the world in cloud adoption with cloud spending reaching US$200 billion by 2024.</p><p class=\"line-break\"><br/></p><p>To help these organizations, Horangi worked with AWS Professional Services to develop REA&H to provide customers with a solution to protect critical workloads and data through added layers of security on the cloud. In designing the solution, AWS and Horangi identified key drivers and challenges that companies adopting cloud today face, mapping them to frameworks governing cloud security operations, workload control patterns, threats, and other critical components on the cloud.</p><p class=\"line-break\"><br/></p><p>To gain the full benefits of using the cloud, REA&H helps organizations using the cloud gain real-time visibility to risks, rapidly remediate threats, and accelerate compliance with regional financial regulations including BNM-RMiT, OJK and MAS TRM.</p><p class=\"line-break\"><br/></p><p>\"We are thrilled and honored to partner with AWS to launch REA&H as a joint and holistic security offering which draws on our complementary strengths. The AWS Professional Services Team is a world-class service provider trusted by companies, many of which are Fortune 500 organizations. With their collective experience and expertise, the AWS Professional Services Team has helped companies realize business goals for their cloud investments with their unique methodology based on Amazon's internal best practices. We are excited to help companies reinforce their security today and galvanize themselves to defend against tomorrow's cyber threats,\" said Paul Hadjy, CEO and Co-Founder of Horangi.</p><p class=\"line-break\"><br/></p><p>\"Horangi plays a crucial role in helping our customers in the region improve their cyber security,\" said Santanu Dutt, Head of Technology, ASEAN, AWS. \"We recognize Horangi's deep experience working with ASEAN organizations and saw a great opportunity for AWS Professional Services to collaborate with Horangi to enable our customers to innovate securely in the cloud.\"</p><p class=\"line-break\"><br/></p><p>Anand Nirgudkar, CTO at CardUp, commenting at the launch of REA&H, said, \"As our region goes digital at an accelerating pace, consumers will be increasingly reliant on the strong security practices by financial institutions to protect their data. The joint REA&H solution comes at an opportune time when enterprises and cloud-native organizations need to develop robust security programs for growth. We are incredibly excited about the potential impact of this solution created by cloud leaders AWS and Horangi.\"</p><p class=\"line-break\"><br/></p><p>Warden, Horangi's flagship Gartner-recognized Cloud Security Posture Management (CSPM) and Cloud Infrastructure Entitlements Management (CIEM) tool, is part of the product offerings under REA&H.</p><p class=\"line-break\"><br/></p><p>In recognition of the company's work, Horangi was inducted into the <a href=\"mailto:Accreditation@SGD\" data-type=\"email\" translate=\"no\">Accreditation@SGD</a> Programme by Singapore's Infocomm Media Development Authority (IMDA) and was also recently named a partner of the SG Cyber Safe Partnership Programme, a Singapore government initiative to increase cybersecurity awareness and encourage the adoption of good cybersecurity practices.</p><p class=\"line-break\"><br/></p><p>REA&H was launched on 10 November 2021 by Horangi and AWS. For more information on the solution, please visit <a href=\"https://www.horangi.com/about/reach\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.horangi.com/about/reach</a></p><p class=\"line-break\"><br/></p><p>About Horangi</p><p class=\"line-break\"><br/></p><p>Horangi is a leading cybersecurity company founded by ex Palantir Technologies engineers and is headquartered in Singapore. Horangi's best-in-class Warden cloud security platform protects organizations in the public cloud, complemented by an elite team of cybersecurity experts providing CREST-accredited offensive and strategic cybersecurity services to customers across the world.</p><p class=\"line-break\"><br/></p><p>Media Contact\r\n<br/>KeKomunikation for Horangi\r\n<br/>Email: <a href=\"mailto:Horangi@KeKomunikation.com\" data-type=\"email\" translate=\"no\">Horangi@KeKomunikation.com</a>\r\nPhone: +65 6303 0567</p><p class=\"line-break\"><br/></p><p class=\"line-break\"><br/></p><p class=\"line-break\"><br/></p><p class=\"line-break\"><br/></p><p>Source: Horangi</p><p class=\"line-break\"><br/></p><p class=\"line-break\"><br/></p><p class=\"line-break\"><br/></p><p>Copyright 2021 ACN Newswire . All rights reserved.</p></div>"}