{"date": "2021-12-01 19:51:01.929000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Aurora Accelerates Development of the Aurora Driver with AWS</b>\n</p><p class=\"bwalignc\">\n<span>Powered by AWS’s high-performing infrastructure and deep portfolio of capabilities, Aurora uses machine learning and millions of cloud-based simulations per day to safely and quickly train, test, and validate its self-driving vehicle technology</span>\n</p><p>\nToday, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), announced that Aurora (NASDAQ: AUR), a leader in self-driving vehicle technology, has selected AWS as its preferred cloud provider for machine learning training and cloud-based simulation workloads. Aurora uses AWS’s proven infrastructure and unparalleled portfolio of capabilities to safely accelerate the development of the Aurora Driver, its scalable self-driving vehicle technology. The Aurora Driver consists of sensors that perceive the world, software that plans a safe path through it, and a computer that powers and integrates Aurora’s hardware and software with any vehicle platform. For its machine learning training and cloud-based simulation workloads, Aurora is all-in on AWS, and it uses the cloud to process trillions of data points each day. Now, the company is scaling its training workloads in the cloud to complete up to 12 million physics-based driving simulations per day by the end of the year, building on the petabytes of data it collects during real-world road tests.\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: <a href=\"https://www.businesswire.com/news/home/20211201005041/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211201005041/en/</a></p><div id=\"bwbodyimg\" style=\"width:480px;float:left;padding-left:0px;padding-right:20px;padding-top:0px;padding-bottom:0px\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"(Image: Aurora)\" src=\"https://mms.businesswire.com/media/20211201005041/en/930215/4/Aurora_-_Peterbilt_2.jpg\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbXMuYnVzaW5lc3N3aXJlLmNvbS9tZWRpYS8yMDIxMTIwMTAwNTA0MS9lbi85MzAyMTUvNC9BdXJvcmFfLV9QZXRlcmJpbHRfMi5qcGc=&amp;key=11db2132d57997e7c37c7b9f5b1ee09a73efab976ee1d4873c8bce23867b8b59d4306f6a187f3ccc21b9e21dd771db5ea0dcefb8d629fa2e20a259ead3331ed1\"/></div></div><p style=\"font-size:85%\">(Image: Aurora)</p></div><p>\nAutonomous driving is an immensely complex technological challenge that relies heavily on cloud computing to enable breakthroughs in perception, embedded computing, machine learning, motion planning, decision making, and advanced sensor technologies. With AWS’s capabilities in high-performance computing, machine learning, storage, and security, Aurora optimizes and scales its virtual testing efforts to expand the capabilities of the Aurora Driver safely and quickly.\n</p><p>\n“Aurora’s advanced machine learning and simulation at scale are foundational to developing our technology safely and quickly, and AWS delivers the high performance we need to maintain our progress,” said Chris Urmson, CEO of Aurora. “With its virtually unlimited scale, AWS supports millions of virtual tests to validate the capabilities of the Aurora Driver so that it can safely navigate the countless edge cases of real-world driving.”\n</p><p>\nAurora’s AWS-powered Virtual Testing Suite is a unique accelerator for the development of the Aurora Driver. Aurora can use data from just one testing situation it observes in the real world to inspire hundreds of permutations in the Virtual Testing Suite. That virtual testing helps train the Aurora Driver to more quickly and safely navigate complex situations, such as road construction, jaywalkers, and unprotected left-hand turns. For example, before the Aurora Driver ever attempted an unprotected left-hand turn on a physical road, it completed nearly 2.3 million turns in simulation—estimated to be roughly equal to 20,000 hours of real-world driving practice. Aurora has been running simulations at scale on AWS since 2019, and plans to triple the volume of simulations it runs on AWS to more than 12 million per day by the end of 2021.\n</p><p>\nThe offline components of the Aurora Driver software stack all run on AWS, including the Virtual Testing Suite, high-definition road maps (the Aurora “Atlas”), machine learning models, and software development tools. For example, Aurora uses Amazon SageMaker (an AWS service that helps developers and data scientists build, train, and deploy machine learning models quickly) to create, run, and continuously refine the machine learning models that enable its driving simulations. With that service, Aurora accesses Amazon Elastic Compute Cloud (Amazon EC2) instance types like P4d, which deliver the highest performance for machine learning training in the cloud.\n</p><p>\nBefore developing simulations, Aurora uses AWS to securely store and process the petabytes of data it logs during real-world testing, and then train its machine learning models on that data. The pre-processing workloads run on Amazon Elastic Kubernetes Service (Amazon EKS) and Amazon EMR, AWS’s service for processing vast amounts of data in the cloud using open-source tools. Aurora’s machine learning training workloads then rely on AWS-optimized deep learning frameworks, such as TensorFlow and PyTorch. Finally, Aurora orchestrates and auto-scales its simulation workflows over hundreds of thousands of concurrent vCPUs and thousands of concurrent GPUs with Amazon EKS and Amazon EC2, which provides accelerated computing instance types like G4dn.\n</p><p>\n“AWS’s highly scalable compute, machine learning, and analytics services are helping Aurora move self-driving vehicle technology forward, toward broad real-world use,” said Swami Sivasubramanian, Vice President of Machine Learning at Amazon Web Services, Inc. “Our reliable infrastructure and comprehensive set of cloud services, including industry-leading machine learning services like Amazon SageMaker, provide the ideal foundation for Aurora to gain insights from the trillions of data points it generates every day to continuously enhance its technology. We are proud to support the acceleration of autonomous vehicle innovation, and look forward to the improved safety and efficiency the transformation of trucking, delivery, and mobility will allow.”\n</p><p>\n<b>About Amazon Web Services</b>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com&amp;esheet=52539257&amp;newsitemid=20211201005041&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=1&amp;md5=3f2e7d0110658e5b6e575f767934c321\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<b>About Amazon</b>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2F&amp;esheet=52539257&amp;newsitemid=20211201005041&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=2&amp;md5=9e199e0e79b0f2086704572d95caaff8\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p>\n<b>About Aurora</b>\n</p><p>\nFounded in 2017 by experts in the self-driving industry, Aurora is on a mission to deliver the benefits of self-driving technology safely, quickly, and broadly. To move both people and goods, the company is building the Aurora Driver, a platform that brings together software, hardware and data services to autonomously operate passenger vehicles, light commercial vehicles, and heavy-duty trucks. Aurora is backed by Sequoia Capital, Baillie Gifford, funds and accounts advised by T. Rowe Price Associates, among others, and is partnered with industry leaders including Toyota, Uber, Volvo, and PACCAR. Aurora tests its vehicles in the Bay Area, Pittsburgh, and Dallas. The company has offices in those areas as well as in Bozeman, MT; Seattle, WA; Louisville, CO; and Wixom, MI. To learn more, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.aurora.tech&amp;esheet=52539257&amp;newsitemid=20211201005041&amp;lan=en-US&amp;anchor=www.aurora.tech&amp;index=3&amp;md5=9e1d9437e371c2f9fd2da677515c0aeb\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.aurora.tech</a>.\n</p><p><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211201005041/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211201005041/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52539257&amp;newsitemid=20211201005041&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=4&amp;md5=b08f2c7321df4368a2b6580cc1baaee3\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON-WEB-SERVICES</p></div>"}