{"date": "2022-01-17 00:05:32.867000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Why is Amazon doing this, who does it affect – and can a last-minute deal be reached?Last minute deal needed to keep UK-issued Visa credit cards working on Amazon</p><p>Amazon's UK website has told customers it will stop accepting payments made with UK-issued Visa credit cards from 19 January.</p></div><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">Why is Amazon doing this?</p><p>It says this decision is \"due to the high fees Visa charges for processing credit card transactions\".</p><p class=\"tr-npp-section-title\">Who does it affect?</p><p>Millions of people who use a Visa credit card to buy products on Amazon's UK website and/or pay for their Amazon Prime membership are affected.</p><p>Nevertheless, many will have already updated their payment details after the original announcement in November, and will now be using another card.</p><p>Amazon said it would continue to accept all debit cards (including Visa debit cards) and non-Visa credit cards.</p><p class=\"tr-npp-section-title\">Will this definitely happen on Wednesday?</p><p>There has been speculation that an agreement may still be reached between the two sides that means the payment ban is modified or scrapped.</p><p>Some customers who have yet to update their payment details say that, after receiving several emails from Amazon urging them to take action, they have not received any further emails since Christmas – leading them to wonder if the Visa credit card ban might not happen after all. Some also report that when they now log into their Amazon account, the urgent warnings to act that were there before seem to have been watered down or removed.</p><p class=\"tr-npp-section-title\">Are there any exceptions to the ban?</p><p>The change does not apply to Amazon Business, the retailer's physical stores or certain subsidiaries such as Audible.</p><p class=\"tr-npp-section-title\">Will I have the plug pulled on my Amazon TV viewing if I do not do anything? I am only halfway through Mad Men.</p><p>A Prime member who does not update their card details will not have the plug pulled immediately. When a Prime member's payment is declined (most probably pay monthly), they have 30 days to provide a new eligible payment method or their membership will be cancelled.</p><p class=\"tr-npp-section-title\">But it is good to pay for things with a credit card, isn't it?</p><p>Many shoppers choose to use credit cards for large purchases online because of the extra protections offered if things go wrong. Under section 75 of the Consumer Credit Act, if a retailer goes out of business or fails to deliver goods as promised and the items cost more than £100, the credit card provider has an obligation to refund the costs.</p><p>Amazon's decision also deals a blow to people who use their Visa credit card to spread the cost of their spending, or to collect points, air miles or cashback.</p><p>Meanwhile, some people are using a so-called \"credit-builder\" credit card to rebuild their credit history, perhaps after experiencing financial problems in the past.</p><p class=\"tr-npp-section-title\">I'm not sure what to do – I don't want to use my debit card on Amazon.</p><p>The move potentially leaves millions of credit card holders facing a dilemma. For example, Barclaycard is the UK's biggest credit card company, and its credit cards only use the Visa network. An Amazon user who banks with Barclays and has a Barclaycard could decide to switch over to the bank's debit card instead. But that will not suit some people financially – it means they will not benefit from what can be a cheap way of borrowing money for a short period, as well as other perks. If they do not wish to do that and do not own another credit card, their main option if they want to continue using Amazon would be to apply for a Mastercard credit card from another provider. Some may not wish to do this, or may be rejected.</p><p class=\"tr-npp-section-title\">Will people quit Amazon over this?</p><p>Some shoppers with concerns about the ethics of using Amazon may use the inconvenience caused by this week's move – if it happens – as an opportunity to end their relationship with the online giant. For years campaigners have been urging shoppers to <a href=\"https://www.theguardian.com/technology/shortcuts/2019/dec/03/boycott-amazon-christmas-workers-ceo-jeff-bezos\" data-type=\"url\" class=\"tr-link\" translate=\"no\">boycott Amazon</a> over <a href=\"https://www.theguardian.com/business/2019/dec/02/new-study-deems-amazon-worst-for-aggressive-tax-avoidance\" data-type=\"url\" class=\"tr-link\" translate=\"no\">tax avoidance</a> and <a href=\"https://www.theguardian.com/business/2021/jul/23/charities-call-for-amazon-anti-waste-law-after-firm-denies-destroying-in-date-food\" data-type=\"url\" class=\"tr-link\" translate=\"no\">other issues</a> .</p><p>To encourage affected Amazon users to update their payment method, Amazon has been offering some people up to £20 off their next purchase. To get this, they need to add a qualifying debit card, Mastercard or Amex card to their Amazon account.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 theguardian.com-NonSyndicated</p></div>"}