{"date": "2021-11-30 18:30:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Paul Lienert and Ben Klayman</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Nov 30 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon Web Services has launched a new cloud-based data service <span class=\"tr-strong\">that could help automakers </span>remotely diagnose issues in their vehicles to prevent recalls and improve safety, as well as manage related data, the company told Reuters.</p><p>Called AWS IoT FleetWise, the latest tool in the company’s newly branded AWS for Automotive portfolio of products and services for the transportation industry is being rolled out on Tuesday at Amazon.com’s <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> annual re:Invent conference in Las Vegas.</p><p>FleetWise enables customers, including auto suppliers and transportation providers such as Lyft <a href=\"reuters://REALTIME/Verb=FullQuote/ric=LYFT.O\" data-type=\"ric\" data-ric=\"LYFT.O\" translate=\"no\" dir=\"ltr\">LYFT.O</a> and Uber <a href=\"reuters://REALTIME/Verb=FullQuote/ric=UBER.N\" data-type=\"ric\" data-ric=\"UBER.N\" translate=\"no\" dir=\"ltr\">UBER.N</a>, to collect, organize and transfer vehicle data to the cloud, while standardizing different data formats to simplify data analysis, according to Mike Tzamaloukas, general manager of AWS for Automotive.</p><p>“As vehicles become more intelligent and advanced, the sheer amount of data produced from vehicles equipped with cameras, lidars and radars is growing exponentially,” Tzamaloukas said in an interview. FleetWise was developed to allow customers “to easily access fragmented data across the different fleet models and vehicle types,” he added.</p><p>FleetWise also was designed to complement data-driven services offered by automakers, including General Motors Co’s <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GM.N\" data-type=\"ric\" data-ric=\"GM.N\" translate=\"no\" dir=\"ltr\">GM.N</a> OnStar and Ford Motor Co’s <a href=\"reuters://REALTIME/Verb=FullQuote/ric=F.N\" data-type=\"ric\" data-ric=\"F.N\" translate=\"no\" dir=\"ltr\">F.N</a> Ford Pro Intelligence, he said.</p><p>The new service joins a broad range of in-vehicle and cloud-to-vehicle offerings from AWS for Automotive and 185 business partners, according to Dean Phillips, worldwide tech leader for the business unit.</p><p>With a greater focus on the industry’s growing shift to software-defined vehicles and systems, “we’re trying to make it simpler and easier for our customers to discover solutions to their problems,” he said, citing development of self-driving cars to “digital customer engagement,” including streamed services.</p><p>The AWS portfolio includes cloud-based computing, data storage, analytics and application development.</p><p>While Amazon does not break out the value of its automotive cloud services business, the company’s AWS unit continues to grow. </p><p>In 2020, AWS reported operating profit of $13.5 billion on sales of $45.4 billion, up 47% and 30% respectively from the previous year. Through the first nine months of 2021, despite the ongoing pandemic and global supply chain disruptions, AWS’ growth was even more robust: $13.2 billion in operating profit on $44.4 billion in sales, nearly matching its full-year results in 2020.</p><p>According to Synergy Research Group, more than 60% of the $45 billion in enterprise cloud services spending in the third quarter was funneled to three large tech companies: Alphabet Inc’s <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a> Google, with 10%, Microsoft <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MSFT.O\" data-type=\"ric\" data-ric=\"MSFT.O\" translate=\"no\" dir=\"ltr\">MSFT.O</a>, with 20%, and AWS with 33%.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Paul Lienert and Ben Klayman in Detroit; Editing by Dan Grebler)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Paul.Lienert@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Paul.Lienert@thomsonreuters.com</a> ; mobile +1 313-670-2452; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON-AUTOMOTIVE/ (PIX)</p></div>"}