{"date": "2022-02-25 16:11:11.629000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3027.16, "close": 3071.26}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENWAVE CORP (\"ENW-V;NWVCF-0\")\n- 2022 First Quarter Consolidated Interim Financial Results,\n- Including Record Third-Party Royalties and REV(TM) Technology\n- Business Segment Net Profit\n\n     EnWave Corporation (\"EnWave\", or the \"Company\") reported the Company's\nconsolidated interim financial results for the first quarter ended December\n31, 2021.\n\n     *  EnWave's vacuum-microwave machine and royalty segment reported its\nfourth consecutive quarter of revenue growth from machine sales and royalty\nrevenue.\n     *  Quarterly royalty revenue, excluding NutraDried's royalty\ncontribution of $137K, was $505K, the highest ever for the Company and\nreflects the continued commercial progress made in the deployment and\nutilization of REV(TM) machinery across an expanding global Royalty Partner\nportfolio.\n     *  Reported positive consolidated Adjusted EBITDA(1) in Q1 2022,\nmaking progress towards the goal of consistent profitable growth.\nCommercial momentum is building in the U.S. cannabis market; EnWave's\nIllinois-based cannabis royalty partner purchased a second 120kW REV(TM)\nmachine to double capacity; pipeline of prospective new licensees and\nrepeat large-scale orders is growing.\n     *  NutraDried's sales were challenged in the quarter by reduced\nsell-in activity with its two major distributors and weather-related delays\nto large Costco orders scheduled for December being delayed into January.\n     *  NutraDried confirmed material new distribution for Moon Cheese(R)\nwith Kroger, Whole Foods Market and Target that is anticipated to begin\nshipping in Q3/Q4 of the fiscal year.\n\n     Consolidated Financial Performance:\n\n//st\n  ($ '000s)                Three months ended December 31,\n                           2021         2020      Change %\n\n  Revenues                 6,297        7,533     (16   %)\n\n  Direct costs             3,581        5,835     (39   %)\n\n  Gross margin             2,716        1,698     60    %\n\n  Operating Expenses\n\n  General and              1,118        1,126     (1    %)\n  administration\n\n  Sales and marketing      1,132        1,521     (26   %)\n\n  Research and             577          569       1     %\n  development\n\n                           2,827        3,216     (12   %)\n\n  Net loss after taxes     (253     )   (1,371 )   82   %\n\n  Adjusted EBITDA(1)       301          (911   )   133  %\n\n  Loss per share -         (0.00    )   (0.01  )\n  basic and diluted\n//et\n\n     (1) Adjusted EBITDA is a non-IFRS financial measure. Refer to the\nNon-IFRS Financial Measures disclosure below for a reconciliation to the\nnearest IFRS equivalent.\n\n     EnWave's annual consolidated financial statements and MD&amp;A are\navailable on SEDAR at www.sedar.com and on the Company's website\nwww.enwave.net.\n\n     Key Financial Highlights for Q1 (expressed in '000s):\n\n     *  The Company reported consolidated revenue for Q1 2022 of $6,297\ncompared to $6,906 in Q4 2021 and $7,533 in Q1 2021.      *  EnWave's Q1\n2022 business unit revenue was $4,067 compared to $2,676 in Q1 2021, an\nincrease of $1,391. EnWave's royalty revenue for Q1 2022 was $505 compared\nto $320 for Q1 2021, an increase of 58%.\n     *  NutraDried's Q1 2022 revenue was $2,230 compared to $4,857 for Q1\n2021, a decrease of $2,627 largely due to the elimination of a large\nnational buy-one, get-one Costco promotion shipped in Q1 2021. NutraDried\nconfirmed new distribution for Moon Cheese(R) into Costco Canada that was\nsupposed to ship in Q1 2022 but were delayed into Q2 2022 due to weather\nconditions in late December.\n\n     *  Gross margin for Q1 2022 was 43% compared to 23% for Q1 2021, a\nsignificant improvement. Gross margin in Q1 2022 increased due to a change\nin sales mix with higher revenues from the EnWave segment, as well as the\ngrowth in high-margin royalty revenue. In Q1 2022 EnWave redeployed a\nlarge-scale REV(TM) machine that was not being utilized by a Canadian\ncannabis partner to a U.S. cannabis royalty partner for a higher than\ntypical margin.\n     *  Adjusted EBITDA (refer to Non-IFRS Financial Measures section\nbelow) for Q1 2022 was income of $301 compared to a loss of $911 for Q1\n2021, an improvement of $610. The Company is focused on achieving its\ntarget of achieving consistent, growing profitability in the near-term,\nwhich includes NutraDried delivering positive Adjusted EBITDA.\n     *  Trimmed SG&amp;A (inclusive of R&amp;D) across both EnWave and NutraDried,\nreporting a 12% reduction or $381 in operating expenses compared to Q1\n2021. NutraDried's operating expenses have been appropriately reduced, and\nboth business units have the right infrastructure in place to deliver\nscalable profitability.\n     *  Obtained TSX Venture Exchange approval for a normal course issuer\nbid starting on October 29, 2021 and ending on October 28, 2022 whereby\nEnWave is entitled to purchase up to 2,204,101 shares in any 30-day period\nup to a maximum of 10,778,194 shares during the year.\n     Significant Corporate Accomplishments in Q1 2022 and Subsequently:\n\n     *  Commissioned a 120kW REV(TM) machine for EnWave's Illinois-based\ncannabis partner for the rapid processing of premium smokeable cannabis.\nReceived a second purchase order from the Illinois-based cannabis partner\nfor another 120kW REV(TM) system to double its processing capacity.\n     *  Commissioned a 100kW REV(TM) machine for Patatas Fritas Torres\n(\"Torres\") in Spain to scale-up the commercial launch of all-natural cheese\nsnacks for the European market. Torres has launched its \"Just This\" cheese\nsnack brand using the EnWave technology (justthis-snacks.com/en/).\n     *  Sold a second 10kW REV(TM) machine to Dairy Concepts IRL of Ireland\nto scale-up manufacturing of its lineup of Cheese O's shelf-stable cheese\nsnacks (cheeseos.ie).\n     *  Signed a Technology Evaluation Agreement with Protein Isolate Plant\nInternational Inc. (\"PIP International\") to evaluate the potential\ncommercial use of REV(TM) technology in PIP International's large scale\nyellow pea wet fractionation processing facility.\n     *  Received a purchase order from Consulting Fresh Business (d.b.a.\n\"NEOREV\") for a 10kW REV(TM) machine to be installed in Spain for intensive\nnew product research and development using EnWave's technology to develop\nfurther commercial applications in Europe.\n     *  Advanced the Global Strategic Partnership with Dole Worldwide Food\n&amp; Beverage Group (\"Dole\"), with Dole acquiring a second 10kW REV(TM)\nmachine.\n     *  Confirmed the commercial scale-up of EnWave's Italian royalty\npartner, Orto Al Sole, with the purchase of a 120kW REV(TM) machine for the\nlarge-scale drying of premium fruits and vegetables in Italy. Orto Al Sole\npreviously purchased a 10kW system and given recent commercial success has\nexpanded its REV(TM) processing capacity to fulfil demand.\n     *  Launched an exciting lineup of Moon Cheese(R) Sticks, an\nall-natural cheese stick snack that comes in five flavours: Kick It Up A\nNacho, Yum Inferno, Cheesy Does It, Rowdy Ranch and Wild White Chedda'. So\nfar NutraDried has already confirmed national distribution for three\nflavours of Moon Cheese(R) Sticks with Whole Foods Market in the U.S.\n     *  Secured material new distribution for Moon Cheese(R) with major\nU.S. retailers, including up-to 2,200 Kroger stores, 1,300 new Target\nlocations among others. The new distribution confirmed by NutraDried is\nexpected to begin shipping in the second half of Fiscal 2022.\n\n     Conference Call:\n\n     EnWave's executive management will be holding a conference call to\ndiscuss its 2022 First Quarter Financial Results and the Company's state of\naffairs. Prepared remarks will be given followed by a question-and-answer\nsession for shareholders.\n\n//st\n  Date:         February 25, 2022\n\n  Time:         7:00am PST / 10:00am EST\n\n  Participant   1-877-407-2988 (toll free number)\n  Access:\n\n  Webcast:\n<a href=\"https://themediaframe.com/mediaframe/webcast.html?webcastid=UItWY7Ag\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://themediaframe.com/mediaframe/webcast.html?webcastid=UItWY7Ag</a>\n//et\n\n     Non-IFRS Financial Measures:\n\n     This news release refers to Adjusted EBITDA which is a non-IFRS\nfinancial measure. We define Adjusted EBITDA as earnings before deducting\namortization and depreciation, stock-based compensation, foreign exchange\ngain or loss, finance expense or income, income tax expense or recovery,\nnon-recurring impairment, restructuring and/or severance charges, and\ngovernment assistance. This measure is not necessarily comparable to\nsimilarly titled measures used by other companies and should not be\nconstrued as an alternative to net income or cash flow from operating\nactivities as determined in accordance with IFRS. Please refer to the\nreconciliation between Adjusted EBITDA and the most comparable IFRS\nfinancial measure reported in the Company's consolidated financial\nstatements.\n\n//st\n\n                                  Three months ended December 31,\n\n  ($ '000s)                       2021         2020\n\n  Net (loss) income after         (253 )       (1,371   )\n  income tax\n\n  Amortization and depreciation   447          670\n\n  Stock-based compensation        234          254\n\n  Foreign exchange loss (gain)    19           227\n\n  Finance (income) expense, net   1            4\n\n  Income tax expense (recovery)   -            (370     )\n\n  Government assistance           (147     )   (325     )\n\n  Adjusted EBITDA                 301          (911     )\n//et\n\n     Non-IFRS financial measures should be considered together with other\ndata prepared accordance with IFRS to enable investors to evaluate the\nCompany's operating results, underlying performance and prospects in a\nmanner similar to EnWave's management. Accordingly, these non-IFRS\nfinancial measures are intended to provide additional information and\nshould not be considered in isolation or as a substitute for measures of\nperformance prepared in accordance with IFRS. For more information, please\nrefer to the Non-IFRS Financial Measures section in the Company's MD&amp;A\navailable on www.sedar.com.\n\n     About EnWave\n\n     EnWave Corporation, a Vancouver-based advanced technology company, has\ndeveloped Radiant Energy Vacuum (\"REV(TM)\") - an innovative, proprietary\nmethod for the precise dehydration of food and cannabis applications. The\nCompany has developed patented methods for uniformly drying and\ndecontaminating cannabis through the use of REV(TM) technology, shortening\nthe time from harvest to marketable cannabis products. EnWave also holds a\nrobust intellectual property portfolio protecting several unique processes\nrelating to specific food applications produced using vacuum-microwave\ntechnology.\n\n     REV(TM) technology's commercial viability has been demonstrated and is\ngrowing rapidly across several market verticals in the food, and\npharmaceutical sectors, including legal cannabis. EnWave's strategy is to\nsign royalty-bearing commercial licenses with innovative, disruptive\ncompanies in multiple verticals for the use of REV(TM) technology. The\ncompany has signed over forty-five licenses to date spanning twenty\ncountries and five continents. In addition to these licenses, EnWave\nestablished a Limited Liability Corporation, NutraDried Food Company, LLC,\nto manufacture, market and sell REV(TM)-dried snack products in North\nAmerica, including the Moon Cheese(R) brand, as well as co-manufacture for\nthird parties.\n\n     EnWave has introduced REV(TM) as a disruptive dehydration platform in\nthe food and cannabis sectors: faster and cheaper than freeze drying, with\nbetter end product quality than air drying or spray drying. EnWave\ncurrently offers two distinct commercial REV(TM) platforms:\n\n     *  nutraREV(R) which is a drum-based system that dehydrates organic\nmaterials quickly and at low-cost, while maintaining high levels of\nnutrition, taste, texture and colour; and,\n\n     *  quantaREV(R) which is a tray-based system used for continuous,\nhigh-volume low-temperature drying.\n\n     EnWave is also active in the pharmaceutical industry through a joint\ndevelopment agreement with GEA Lyophil, a leader in GMP drying machinery.\n\n     More information about EnWave is available at www.enwave.net.\n\n     EnWave Corporation\n\n     Mr. Brent Charleton, CFA\n     President and CEO\n\n     For further information:\n\n     Brent Charleton, CFA, President and CEO at +1 (778) 378-9616\n     E-mail: bcharleton@enwave.net\n\n     Dan Henriques, CFO at +1 (604) 835-5212\n     E-mail: dhenriques@enwave.net\n\n     Safe Harbour for Forward-Looking Information Statements: This press\nrelease may contain forward-looking information based on management's\nexpectations, estimates and projections. All statements that address\nexpectations or projections about the future, including statements about\nthe Company's strategy for growth, product development, market position,\nexpected expenditures, and the expected synergies following the closing are\nforward-looking statements. All third-party claims referred to in this\nrelease are not guaranteed to be accurate. All third-party references to\nmarket information in this release are not guaranteed to be accurate as the\nCompany did not conduct the original primary research. These statements are\nnot a guarantee of future performance and involve a number of risks,\nuncertainties and assumptions. Although the Company has attempted to\nidentify important factors that could cause actual results to differ\nmaterially, there may be other factors that cause results not to be as\nanticipated, estimated or intended. There can be no assurance that such\nstatements will prove to be accurate, as actual results and future events\ncould differ materially from those anticipated in such statements.\nAccordingly, readers should not place undue reliance on forward-looking\nstatements.\n\n     Neither the TSX Venture Exchange nor its Regulation Services Provider\n(as that term is defined in the policies of the TSX Venture Exchange)\naccepts responsibility for the adequacy or accuracy of this release.\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2205500186.MNPRE2205500796-06203120220225</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}