{"date": "2021-12-06 14:37:15+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Corrects paragraph 2 to say AFL-CIO comprises 57 unions and not 56</p><p class=\"tr-by\">By Nandita Bose</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">WASHINGTON, Dec 3 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>The U.S. tech sector is the next frontier for labor organizing, and its workers are starting to understand the collective power unions have, President of the AFL-CIO Liz Shuler said on Friday at the Reuters Next Conference.</p><p>Shuler said the labor federation - which comprises <span class=\"tr-strong\">57 </span>affiliated unions and 12.5 million workers - wants to enable more organizing in the tech industry under her leadership . </p><p>\"What we are seeing in the tech sector is workers rising up. You look at companies like YouTube, Google, Apple. Their workers have been speaking out. They have been staging walkouts on issues like racial justice and sexual harrassment,\" Shuler said.</p><p>\"...You don't have the collective power that you have when you have a union, and I think tech workers are starting to connect the dots,\" she said.</p><p>The companies did not immediately respond to a request for comment.</p><p>Tech is among the least unionized major industries in the country despite some recent organizing success. In recent years, unions including the Communications Workers of America have launched campaigns in Silicon Valley and organized workers at startups such as Kickstarter and Glitch. The CWA also formed the Alphabet <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a> Workers Union, a so-called minority union that does not have collective bargaining rights.</p><p>But many of the unions' pushes are still at an early stage, and it remains to be seen whether they will catch on widely. </p><p>Shuler said U.S. labor laws in the United States \"are broken.\" Until they are reformed, outcomes like the rejection of a union by workers at an Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> warehouse in Bessemer, Alabama, will be tough to fight.</p><p>Amazon workers in Alabama rejected forming a union by a more than 2-to-1 margin in April. The union said the company interfered in the election, a charge Amazon has denied. Last month, a regional director for the U.S. National Labor Relations Board ordered <a href=\"https://www.reuters.com/business/amazon-alabama-facility-ordered-re-run-union-election-us-labor-board-2021-11-29\" data-type=\"url\" class=\"tr-link\" translate=\"no\">a rerun</a> of the election. </p><p>Shuler said workers will be able to meet in person outside the workplace before this election, something that the COVID-19 pandemic prevented in the first election.  </p><p>President Joe Biden's administration has put unions at the center of policy which Shuler said has offered the U.S. labor movement significant momentum. </p><p>\"We have the public on our side for the first time in a long time,\" she said, citing a recent Gallup poll that showed 68% of people in the country support unions.</p><p>Whether that translates into more workers across sectors joining unions remains to be seen. </p><p>Between 1979 and 2020, the percentage of American workers represented by a union dropped by 14.9 percentage points, according to estimates from the White House. </p><p>Shuler also said the Biden White House is on board with getting the PRO ACT - a sweeping labor reform bill - passed and hopes the legislation will be taken up in the U.S. Senate for debate as soon as January, where it has been stuck after it passed the House of Representatives in March.</p><p>To watch the Reuters Next conference please register here <a href=\"https://reutersevents.com/events/next/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://reutersevents.com/events/next/</a>  </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Nandita Bose in Washington; Editing by Cynthia Osterman)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:nandita.bose@thomsonreuters.com\" data-type=\"email\" translate=\"no\">nandita.bose@thomsonreuters.com</a> ; +12023545868; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://nandita.bose.reuters.com@reuters.net\">nandita.bose.reuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: REUTERS-NEXT/AFLCIO (CORRECTED, PIX, TV)</p></div>"}