{"date": "2021-11-02 13:10:42.498000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SOL CUISINE LTD (\"VEG-V\")\n- Products Selling Faster than Expected in Mexico\n\n     Sol Cuisine Ltd. (\"Sol Cuisine\" or the \"Company\") a growth-oriented\nNorth American plant-based protein leader, announced that the Company's\nBuffalo Cauliflower Chik'n Wings (the \"Products\") have been selling twice\nas quickly as projected since their introduction into the Mexican market\nthrough a US-based wholesaler, in August. The consumer reception has\nresulted in initial sell-through of approximately 60 days.\n\n     John Flanagan, CEO of Sol Cuisine commented, \"We are very pleased with\nthe consumer acceptance and sales performance of our Buffalo Cauliflower\nChik'n Wings, in Sol Cuisine's first foray into the Mexican market. Mexico\nis the country with the most vegans and vegetarians in Latin Americai, and\nwith the significant social media traffic consumers have given Sol Cuisine\nin its early entry, we see a substantial opportunity to continue growing in\nthe market.\"\n\n     For more details, visit Sol Cuisine's IR website at:\ninvestors.solcuisine.com or contact the IR team at\ninvestors@solcuisine.com.\n\n     About Sol Cuisine Ltd.\n\n     Sol Cuisine is the publicly traded parent company of Sol Cuisine Inc.\nfollowing the completion of its \"qualifying transaction\" on May 19, 2021.\nSol Cuisine is a fast-growing producer of branded and private label,\nconsumer-preferred plant-based protein offerings across key center-of-plate\nand appetizer categories. The Company's products are offered through an\nestablished omni-channel distribution platform in Canada, the U.S. and\nMexico, and are available in over 11,000 stores and more than 41,000 unique\npoints of distribution across four primary channels: Canada Retail Sales &amp;\nClub; U.S. Retail Sales &amp; Club; Food Service &amp; Industrial; and Private\nLabel. Over a history of 20+ years, Sol Cuisine has consistently\ndemonstrated an ability to innovate and delight consumers in Canada and the\nU.S., while remaining true to its commitment to producing great tasting\nproducts that are nutritionally superior both to meat-based offerings and\nto competitive plant-based products. This commitment has resulted in\nseveral Canadian product wins, including the #1 frozen plant-based burger\nin Canada, the #1 consumer-preferred chicken alternative and the #1 quality\nroast product as determined by Whole Foods Market. The Company's taste and\nnutritional superiority has also resulted in private label contracts with\nsome of the most recognized natural brands in North America. These products\nare all produced at Sol Cuisine's two state of the art facilities, totaling\n35,000 square foot facility in Mississauga, Ontario, capable of supporting\nup to 10 million kilograms of volume per annum.\n\n     For more details on Sol Cuisine's consumer brands:\n\n     Website: www.solcuisine.com Instagram: @solcuisine Facebook:\n@solcuisine Twitter: @solcuisine LinkedIn: @solcuisine\n\n     Forward Looking Statements\n\n     This press release includes forward-looking information within the\nmeaning of Canadian securities laws regarding the Company and its business.\nOften but not always, forward-looking information can be identified by the\nuse of words such as \"expect\", \"intends\", \"anticipated\", \"believes\" or\nvariations (including negative variations) of such words and phrases, or\nstate that certain actions, events or results \"may\", \"could\", \"would\" or\n\"will\" be taken, occur or be achieved. Such statements are based on the\ncurrent expectations and views of future events of the management of each\nentity, and are based on assumptions and subject to risks and\nuncertainties. Although the management believes that the assumptions\nunderlying these statements are reasonable, they may prove to be incorrect.\nThe forward-looking events and circumstances discussed in this press\nrelease may not occur and could differ materially as a result of known and\nunknown risk factors and uncertainties affecting the company, including\nrisks regarding the size of the industry, the growth of the market for the\nCompany's products, the rate and quantity of production at the Company's\nfacilities, market conditions, economic factors, management's ability to\nmanage and to operate the business of the Company and the equity markets\ngenerally. Although the Company has attempted to identify important factors\nthat could cause actual actions, events or results to differ materially\nfrom those described in forward-looking statements, there may be other\nfactors that cause actions, events or results to differ from those\nanticipated, estimated or intended. Accordingly, readers should not place\nundue reliance on any forward-looking statements or information. No\nforward-looking statement can be guaranteed. Except as required by\napplicable securities laws, forward-looking statements speak only as of the\ndate on which they are made and the Company undertakes no obligation to\npublicly update or revise any forward-looking statement, whether as a\nresult of new information, future events, or otherwise.\n\n     The TSX Venture Exchange has not reviewed, approved, or disapproved\nthe content of this news release.\n\ni NielsenIQ Global Health and Ingredient-Sentiment Survey, 2016\n\nContact Information:\n\nJohn Flanagan, Chief Executive Officer, 905-502-8500; Jonathan Ross, Sol\nCuisine Investor Relations, jon.ross@loderockadvisors.com, 416-283-0178;\nKieran Lawler, Sol Cuisine Public Relations,\nkieran.lawler@loderockadvisors.com, 416-303-0799\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2130500467.MNPRE2130501819-06060320211102</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}