{"date": "2022-02-02 00:01:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Lawrence White</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">LONDON, Feb 2 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Big tech companies whose online platforms carry advertisements for scams should be made to reimburse victims, British lawmakers said, as part of wider efforts to combat a growing epidemic of online fraud in Britain.</p><p>While banks have signed up for a voluntary code to reimburse fraud victims who do enough to protect themselves, there is not sufficient regulation governing social media and other websites where victims are often first lured in, Mel Stride, chairman of the cross-party Treasury committee, told Reuters.</p><p>\"The government should look at some kind of arrangement that makes the polluter pay,\" he said.</p><p>\"Online platforms are hosting this stuff, not really putting enough effort into weeding it out, and indeed financially benefiting because they're getting the advertising revenues,\"  Stride said.</p><p>TechUK, a trade body that represents major tech companies in Britain, including Facebook <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a>, Twitter <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TWTR.N\" data-type=\"ric\" data-ric=\"TWTR.N\" translate=\"no\" dir=\"ltr\">TWTR.N</a> and Microsoft <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MSFT.O\" data-type=\"ric\" data-ric=\"MSFT.O\" translate=\"no\" dir=\"ltr\">MSFT.O</a>, declined to provide an immediate comment.</p><p>Stride's comments came as the Treasury committee on Wednesday published the findings of a report on economic crime, which urged the government to seriously consider forcing online platforms to help to refund victims.</p><p>The report noted that TechUK in December said Facebook (now known as Meta), Twitter and Microsoft had committed to requiring potential financial services advertisers to be authorised by the Britain's Financial Conduct Authority, following similar steps taken by Google, TikTok and Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>.</p><p>But the report said there was no set timeline for these changes and other major online platforms have not followed suit.</p><p>The government is due to respond to the report's findings that not enough is being done to prevent the growing online fraud epidemic, and that fraud-fighting efforts should be centralised under one minister or department.</p><p><a href=\"https://www.reuters.com/world/uk/welcome-britain-bank-scam-capital-world-2021-10-14\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Britain has become a global epicentre for bank scams</a>, Reuters reported in October, with a record 754 million pounds ($1 billion) stolen in the first six months of this year, up 30% from the same period in 2020.</p><p>\"We think the government's been too slow in various areas to really catch up with it...it's people being, quietly in many cases, defrauded of large amounts of money, people losing life savings,\" Stride said.</p><p><br/></p><p><br/></p><p><br/></p><p class=\"tr-signoff\"> (Reporting By Lawrence White, additional reporting by Iain Withers. Editing by Jane Merriman)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:lawrence.white@thomsonreuters.com\" data-type=\"email\" translate=\"no\">lawrence.white@thomsonreuters.com</a> ; +44 20 7513 5083; Reuters Messaging: @ReutersLawrence))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: BRITAIN-FRAUD/</p></div>"}