{"date": "2021-04-12 23:14:25.505000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3757.0, "close": 3809.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>ENPNEWSWIRE-(C)2021 ENPUBLISHING</p><p>Release date- 09042021 - AVEVA And Petronas Strategically Partner to Deliver Digital Transformation.</p></div><div class=\"tr-npp-body\"><p>Petroliam Nasional Berhad (PETRONAS), Malaysia's fully integrated oil and gas multinational, has partnered with AVEVA, a global leader in industrial software, driving digital transformation and sustainability, to provide a modern enterprise solution that promotes integration across the entire value chain.</p><p>PETRONAS selected AVEVATM Unified Supply Chain in the cloud to enable simplified business processes and deeper collaboration, while reducing value leaks and sustaining productivity. As the only industrial software company that offers unified design applications across all supply chain activities, AVEVA's solution uses Enterprise Crude Knowledge Management, to drive Value Chain Optimization for the oil and gas industry.</p><p>Delivering Intuitive Software with Cloud High Performance Computing</p><p>The AVEVA solution will provide easy data management to deliver a single source of crude oil information that is easily shared across different teams and locations. The modern and intuitive software will eliminate the requirement for specific coding, drastically reducing the learning curve delivering high-performance computing and advanced data processing that will enable PETRONAS to run complex planning models at speed using the latest cloud technology.</p><p>'At PETRONAS, we are continuously looking to create value with disruptive technologies that offer optimum solutions. Utilizing AVEVA Unified Supply Chain software, we have been able to adopt a more integrated business process, that optimizes our productivity, allowing us to deliver with less,' said Mr. Yusri Yusof, Vice President of Refining and Trading at PETRONAS.</p><p>Transforming Organizational Operations and Improving the bottom line</p><p>AVEVA solutions have helped the 4 PETRONAS refinery and petrochemical sites improve safe operations while finding the best utilization for feedstock. The technology also ensures the resulting production plan matches the real plant optimization and reduces the gap between planning and scheduling, as well as actual refinery operations.</p><p>'AVEVA Unified Supply Chain software, part of AVEVA's Value Chain Optimization solution, presents a unique opportunity for organizations like PETRONAS to synchronize all business and operations activities across the supply chain from feedstock selection to planning, scheduling, operations and distribution,' said Harpreet Gulati, SVP Planning and Operations, AVEVA. 'Our solutions are helping organizations to change the way they work and operate. We are delivering the digital transformation of PETRONAS' supply chain, by empowering its workforce to make better, more agile decisions with next-generation software that is enhancing the user experience as well as providing built-in collaboration, interactivity and advanced analytics.'</p><p>AVEVA's strategy is to help forward-thinking organizations like PETRONAS create a collaborative environment enabling the business to be managed in a comprehensive, flexible, and connected manner that brings transparency to the decision-making process across the value chain.</p><p>About PETRONAS</p><p>Petroliam Nasional Berhad (PETRONAS) is a global energy and solutions company, ranked amongst the largest corporations on Fortune Global 500.</p><p>We seek opportunities in energy investments both in hydrocarbon and renewables across the globe and maximize value through our integrated business model. Our portfolio includes conventional and unconventional resources as well as a diverse range of fuel lubricant, and petrochemical products. This is further strengthened with a successful product delivery track record. Our customers are at the heart of everything that we do, and our businesses are anchored on meeting their needs.</p><p>Our technology is our differentiator and the key to ensuring excellence in all that we offer - energy, products, and solutions, as well as unlocking new business frontiers. Sustainability is at the core of everything that we do, as we believe in harnessing the good in energy to add quality to everyday lives. People are our strength and partners for growth. We believe in progressing with our partners in addressing the evolving needs in today's changing energy landscape.</p><p>About AVEVA</p><p>AVEVA, a global leader in industrial software, drives digital transformation for industrial organizations managing complex operational processes. Through Performance Intelligence, AVEVA connects the power of information and artificial intelligence (AI) with human insight, to enable faster and more accurate decision making, helping industries to boost operational delivery and sustainability. Our cloud-enabled data platform, combined with software that spans design, engineering and operations, asset performance, monitoring, and control solutions, delivers proven business value and outcomes to over 20,000 customers worldwide, supported by the largest industrial software ecosystem, including 5,500 partners and 5,700 certified developers. AVEVA is headquartered in Cambridge, UK, with over 6,000 employees at 90 locations in more than 40 countries. For more details visit: www.aveva.com</p><p>Copyright 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</p><p>Enquiries:</p><p>AVEVA Media Contacts</p><p>Rose Bambi</p><p>Senior Director Global PR and External Communications</p><p>Tel: +44 (0) 208 323 2789</p><p>rose.bambi@aveva.com</p><p>Caroline Stephens</p><p>Senior Global PR Manager</p><p>caroline.stephens@aveva.com</p><p>Catherine Singh</p><p>Global PR/Social Media Coordinator</p><p>catherine.singh@aveva.com</p><p>External Communications Alias</p><p>external.communications@aveva.com</p><p>[Editorial queries for this story should be sent to abn@enpublishing.co.uk]</p><p>((Comments on this story may be sent to info@enpublishing.co.uk))</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 M2 Communications Ltd.</p></div>"}