{"date": "2022-01-13 19:11:46.019000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3304.14, "close": 3242.76}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>VERIZON COMMUNICATIONS INC (\"VZ-Q\")\n- Verizon Explores the 5G Future of Learning at Arizona State\n- University 5G Innovation Hub\n\n     Verizon and Arizona State University are exploring how 5G can enable\nimmersive educational experiences and transform the future of learning. To\ndo this, Verizon has launched a 5G Innovation Hub at the University's\nLearning Futures Collaboratory, Studios and Emporium. Students, faculty,\nentrepreneurs, and corporate partners can now work together at the Hub to\ntest and create 5G-powered educational experiences that are more inclusive,\nequitable and accessible. Digital equity is on the national agenda as\nleaders aim to address the digital divide, deepened during the pandemic.\nAnd in Arizona where as many as one million residents, including more than\n200,000 students, do not have regular access to the internet, ASU has been\ninstrumental in leading a series of initiatives aimed at surfacing\nsolutions to help further close the digital divide.\n\n     The first program to launch out of the 5G Innovation Hub at ASU will\nbe \"The Digital Equity Jam\" sponsored by Verizon, AWS and Inseego. This\nprogram kicks off in early February 2022. Competing teams will develop use\ncases showcasing how Verizon 5G Ultra Wideband and mobile edge compute can\nbe used to help bridge the digital divide. Focus areas will include health,\nclimate, poverty, human rights and education. The winning team will receive\nproject seed funding, access to intensive summer entrepreneurship training\nin partnership with the Clinton Global Initiative (CGI) and VentureWell,\nand the opportunity to pitch their venture to CGI in fall 2022.\n\n     \"Working with ASU, we have an extraordinary opportunity to research\nand develop new 5G-enabled experiences that can improve remote learning and\nhelp bridge the digital divide,\" said Tami Erwin, Verizon Business CEO.\n\"Verizon 5G Ultra Wideband's super-fast speeds, high bandwidth and low\nlatency can enhance applications ranging from immersive education to\nconnected communities. By collaborating with ASU's researchers, we hope to\naccelerate the innovation process and develop technology that will harness\nthe full potential of 5G and edge compute.\"\n\n     \"We are in the most transformative technological moment since the\nearly stages of the industrial revolution. And even with the social,\npolitical, and economic impacts that we are still learning to navigate as a\nsociety, there have been incredibly meaningful results from this use of\ntechnology,\" said ASU President Michael Crow this morning during a keynote\nwith Erwin at the Smart Region Summit. \"Who gets educated is no longer\nsocially stratified, we are able to unleash human creativity in ways not\npossible before...and so what these technologies that leverage broadband at\nthe fastest speeds and most advanced level imaginable allow us to create is\nan environment in which the person, the learner, becomes emotionally\nconnected in the story around the learning process itself. At ASU, we've\nbecome, with this next phase of our partnership with Verizon, the furthest\nat the tip of the spear to be empowered with technology and continue to\nimprove the ways in which we learn, work and live.\"\n\n     Additionally, ASU plans to continue testing and deploying a variety of\nimmersive educational experiences, powered by Verizon 5G Ultra Wideband and\nmobile edge compute. Students will be able to enter a Dreamscape pod where\nthey can experience a Biology class in virtual reality (VR). Remote\nstudents will have access to a VR and web browser version. 5G use cases\nbeing explored will also include a career arcade using VR, where students\ncan experience a day in the life of certain careers. 5G applications are\nalso being tested for athlete performance analytics applications and\nvirtual fighter pilot training.\n\n     This engagement is part of Verizon's broader strategy to partner with\nenterprises, startups, universities, national labs and government/military\nto explore how 5G can disrupt and transform nearly every industry. Verizon\noperates five 5G Labs in the U.S. and one in London that specialize in\ndeveloping use cases in industries ranging from healthcare to public safety\nto entertainment. In addition, Verizon is collaborating with several\ncustomers to establish 5G Innovation Hubs on-premises as part of an ongoing\ninitiative to co-innovate and create new 5G applications.\n\n     Verizon's long-standing relationship with ASU includes collaboration\nand support for Verizon Innovative Learning, Verizon's award-winning\neducation initiative addressing barriers to digital inclusion and a key\nprogram under Citizen Verizon, the company's responsible business plan for\neconomic, environmental and social advancement. The initiative includes\nbringing 5G to schools, enabling more robust, immersive learning\nexperiences via technologies like artificial intelligence, 3D printing,\naugmented and virtual reality. Students leverage technology, social\ninnovation and design thinking through a project-based online curriculum,\ndeveloped by the J.Orin Edson Entrepreneurship + Innovation Institute at\nASU, to positively impact their communities. Verizon's partnership with ASU\nalso extends to Verizon Innovative Learning HQ, a free next-gen online\neducation portal that includes content curated by ASU, among other academic\ninstitutions, that provides immersive AR and VR experiences paired with\nlesson plans. Through Citizen Verizon, the company is committed to\nproviding 10 million youths with digital skills training by 2030, among\nother goals.\n\n     Learn more about Verizon 5G technology here.\n\n     Verizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30,\n2000 and is one of the world's leading providers of technology and\ncommunications services. Headquartered in New York City and with a presence\naround the world, Verizon generated revenues of $128.3 billion in 2020. The\ncompany offers data, video and voice services and solutions on its\naward-winning networks and platforms, delivering on customers' demand for\nmobility, reliable network connectivity, security and control.\n\n     VERIZON'S ONLINE MEDIA CENTER: News releases, stories, media contacts\nand other resources are available at verizon.com/news. News releases are\nalso available through an RSS feed. To subscribe, visit\nwww.verizon.com/about/rss-feeds/.\n\nMedia\n\nContact Information:\n\ncontact:\nChris Ashraf\nchristina.moon.ashraf@verizon.com\n(201) 320-4259\n@ChrisMoonPR\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201200935.MNPRE2201202866-11021820220113</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}