{"date": "2021-12-17 18:42:16.028000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3377.42, "close": 3341.58}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>FIRST TIDAL ACQUISITION CORP (\"AAA-V\")\n- First Tidal to acquire Toro Beverages as QT\n\n     Not for distribution to United States newswire services or for\ndissemination in the United States\n\n     FIRST TIDAL ACQUISITION CORP. ENTERS INTO A LETTER OF INTENT WITH TORO\nBEVERAGES INC. FOR A PROPOSED QUALIFYING TRANSACTION\n\n     First Tidal Acquisition Corp. (\"First Tidal\" or the \"Company\") is\npleased to announce that it has entered into a letter of intent dated\nDecember 10, 2021 (the \"LOI\") with Toro Beverages Inc. (\"Toro\") regarding a\nproposed transaction to acquire all of the issued and outstanding\nsecurities of Toro (the \"Transaction\"). Upon completion of the Transaction,\nthe combined entity (the \"Resulting Issuer\") will continue the business of\nToro. The Transaction is intended to constitute the \"Qualifying\nTransaction\" of First Tidal, as such a term is defined in Policy 2.4\n\"Capital Pool Companies\" of the TSX Venture Exchange (the \"Exchange\").\n\n     The proposed Transaction is an Arm's Length Qualifying Transaction\npursuant to the policies of the Exchange and, as such, the Company is not\nrequired to obtain shareholder approval for the proposed Transaction.\n\n     About Toro Beverages Inc.\n\n     Toro is a bold, fast-growing beverage company founded in 2017, when it\nrevolutionized the energy drink industry by introducing Canada's first\nmatcha-powered energy drink. The Company now markets natural energy drinks\nunder the brand ToroMatcha, as well as innovative Hard Matcha Seltzers\nunder the brand Matcha Colada. Toro products are carried across Canada and\nthe United Arab Emirates through a distribution network of nearly 800\npoints of sale including select Loblaws, Whole Foods, Sobeys, IGA, Metro\nand Zoom stores. Toro plans to expand into the United States and other\nglobal markets upon completion of this Transaction. The company has built\npowerful brands that resonate with the increasing demand for better-for-you\nproducts. Toro is committed to becoming a global leader in matcha-based\nbeverages across both non-alcoholic and alcoholic categories. For more\ninformation about Toro, visit www.torobeverages.com\n\n     Proposed Management of the Resulting Issuer\n\n     Subject to Exchange approval, on completion of the Transaction, it is\ncurrently anticipated that the board of directors of the Resulting Issuer\nwill consist of five (5) directors. Information with respect to the\nproposed directors and officers of the Resulting Issuer will be included in\na subsequent news release.\n\n     The Qualifying Transaction\n\n     Terms of the Transaction\n\n     Subject to the execution of a definitive agreement (\"Definitive\nAgreement\"), First Tidal proposes to acquire all of the issued and\noutstanding securities of Toro from Toro's securityholders. Each holder of\nClass A shares in the capital of Toro (the \"Toro Shares\") will receive one\ncommon share in the capital of the Resulting Issuer (the \"Resulting Issuer\nShares\"). All outstanding convertible securities of Toro will be exchanged\nor replaced with convertible securities of the Resulting Issuer on a\none-to-one basis and on the economic terms and conditions substantially\nsimilar to the previously issued securities.\n\n     The closing will be conditional upon Toro completing a private\nplacement financing of subscription receipts (the \"Subscription Receipts\")\nat a price of $0.50 per Subscription Receipt, each of which will, prior to\nthe effective time of the Transaction, automatically convert into one Toro\nShare and one-half of one Toro Share purchase warrant (each whole warrant,\na \"Financing Warrant\"), with each Financing Warrant exercisable  into one\nadditional Toro Share at an exercise price of $0.75 (provided that if the\nclosing price of the Resulting Issuer Shares on any stock exchange on which\nthey are then listed is equal to or greater than $1.00 for a period of ten\n(10) consecutive trading days at any time prior to the expiry date of the\nFinancing Warrants, the Resulting Issuer will have the right to accelerate\nthe expiry time of the Financing Warrants by giving notice to the holders\nthat the Financing Warrants will expire on a date that is not less than ten\n(10) days from the date notice is given), for no additional consideration\nupon the satisfaction of certain escrow release conditions, including the\nconditional approval of the Exchange for the Transaction and satisfaction\nor waiver of all of the conditions precedent to the Transaction as set out\nin the Definitive Agreement (the \"Concurrent Financing\"), to raise a\nminimum of gross proceeds of $3,500,000 and a maximum gross proceeds of\n$5,000,000, to be completed within thirty days of receiving conditional\napproval of the Transaction by the Exchange. First Tidal intends to make an\napplication for an exemption from the Exchange's sponsorship requirements.\n\n     The Transaction is conditional upon, among other things:\n\n     (i) the parties will have received all necessary regulatory and\nthird-party consents, approvals and authorizations as may be required in\nrespect of the Transaction, including, but without limitation, acceptance\nof the Exchange;\n\n     (ii) completion of due diligence to the satisfaction of the parties;\n\n     (iii) approval of the board of directors of each of First Tidal and\nToro to final terms and conditions of the Transaction  as set forth in the\nDefinitive Agreement and all other necessary matters related thereto prior\nto the signing of the Definitive Agreement;\n\n     (iv) the signing of the Definitive Agreement;\n\n     (v) completion of all matters, and the satisfaction of all conditions\n(unless waived in writing), under the Definitive Agreement required to be\ncompleted or satisfied on or before closing of the Transaction including\nbut not limited to completion of the Concurrent Financing;\n\n     (vi) the shareholders of Toro will have approved the Transaction; and\n\n     (vii) completion by First Tidal of a consolidation of the First Tidal\nsecurities on a 3 for 1 basis, effective immediately prior to the closing\nof the Transaction (the \"Consolidation\"); and\n\n     (viii) completion by Toro of a split of the Toro securities on a 2 for\n1 basis, effective prior to the closing of the Concurrent Financing and the\nTransaction (the \"Split\").\n\n     Pre-Closing Capitalization of First Tidal\n\n     As of the date hereof, First Tidal's authorized share capital consists\nof an unlimited number of common shares and an unlimited number of\npreferred shares in the capital of First Tidal, issuable in series, of\nwhich 8,000,000 common shares and no preferred shares are issued and\noutstanding. In addition, First Tidal has\n\n     200,000 stock options and 320,000 broker warrants issued and\noutstanding. Prior to the closing of the Transaction, First Tidal will\ncomplete the Consolidation.\n\n     Pre-Closing Capitalization of Toro\n\n     As of the date hereof, 8,438,824 Toro Shares, 3,000,000 Class Seed\nPreferred shares, and 82,680 finder warrants to purchase Class A shares are\nissued and outstanding. In addition, and subject to Exchange approval,\nthere will be on a post-Split basis 3,000,000 performance warrants issued\nto Mr. Sam Saoudi to purchase Toro Shares subject to certain milestone\nrequirements. Prior to the completion of the Concurrent Financing and the\nTransaction, Toro will complete the Split and immediately thereafter the\nClass Seed Preferred shares issued and outstanding will be converted or\nexchanged for Toro Shares.\n\n     Post-Closing Capitalization of the Resulting Issuer\n\n     Upon completion of the Transaction and assuming the completion of the\nminimum Concurrent Financing, it is anticipated that there will be\napproximately 32,544,314 Resulting Issuer Shares issued and outstanding,\n66,666 stock options, 3,772,026 share purchase warrants, and 3,000,000\nperformance warrants. Upon completion of the Transaction and assuming the\ncompletion of the maximum Concurrent Financing, it is anticipated that\nthere will be approximately 35,544,314 Resulting Issuer Shares issued and\noutstanding, 66,666 stock options, 5,272,026 share purchase warrants, and\n3,000,000 performance warrants, as detailed in the following table:\n\n//st\nDescription of                 Number of         Number of\nSecurity                       Securities        Securities\n                               Assuming Minimum  Assuming Maximum\n                               Concurrent        Concurrent\n                               Financing         Financing\n\nFirst Tidal Shares (post-      2,666,666(1)      2,666,666(1)\nConsolidation)\n\nFirst Tidal Stock Options\n(post-Consolidation)           66,666            66,666\n\nFirst Tidal Broker Warrants\n(post-Consolidation)           106,666           106,666\n\nToro Shares (post-Split)       22,877,648(2)(3)  22,877,648(2)(3)\n\nToro Finder Warrants\n(post-Split)                   165,360           165,360\n\nToro Performance Warrants\n(post-Split)                   3,000,000         3,000,000\n\nConcurrent Financing Shares    7,000,000         10,000,000\n\nConcurrent Financing\nWarrants(4)                    3,500,000         5,000,000\n//et\n\n     (1) 1,333,333 of these shares will be subject to an 18-month escrow\nrelease schedule imposed by the Exchange.\n\n     (2) 20,014,244 of these shares will be subject to a three-year escrow\nrelease schedule imposed by the Exchange.\n\n     (3) 2,863,404 of these shares will be subject to a one-year voluntary\nrelease schedule.\n\n     (4) It is anticipated that broker fees consisting of cash and broker\nwarrants will be payable on some of the Concurrent Financing.\n\n     First Tidal will issue additional news releases related to the final\nlegal structure and terms of the Transaction, financing details, financial\ninformation regarding Toro, the names and background of insiders of the\nResulting Issuer and other material information as it becomes available.\n\n     Trading in the shares of First Tidal is presently halted. The shares\nof First Tidal will remain halted until the Transaction is completed and\napproved by the Exchange.\n\n     Contact Information\n     Ian McGavney\n     Chief Executive Officer, Chief Financial Officer,\n     Director and Corporate Secretary\n     Tel: 506-721-6874\n     Email: ianbmcgavney@gmail.com\n\n     This news release does not constitute an offer to sell or a\nsolicitation of an offer to buy any of the securities described\nherein in the United States. The securities described herein have not been\nregistered under the United States Securities\nAct of 1933, as amended (the \"U.S. Securities Act\"), or any state\nsecurities law and may not be offered or sold in the \"United States\", as\nsuch term is defined in Regulation S promulgated under the U.S. Securities\nAct, unless registered under the U.S. Securities Act and applicable state\nsecurities laws or an exemption from such registration requirements is\navailable.\n\n     Completion of the Transaction is subject to a number of conditions,\nincluding but not limited to, Exchange acceptance. There can be no\nassurance that the Transaction will be completed as proposed or at all.\nInvestors are cautioned that, except as disclosed in the filing statement\nto be prepared in connection with the Transaction, any information released\nor received with respect to the Transaction may not be accurate or complete\nand should not be relied upon. Trading in the securities of a capital pool\ncompany should be considered highly speculative. The Exchange has in no way\npassed upon the merits of the proposed Transaction and has neither approved\nnor disapproved the contents of this news release.\n\n     Neither the TSX Venture Exchange nor its Regulation Service Provider\n(as that term is defined in the policies of the TSX Venture Exchange)\naccepts responsibility for the adequacy or accuracy of this release.\n\n     Forward-Looking Statements\n\n     Certain statements in this release contain forward-looking statements\nor information, which include completion of the proposed Transaction and\nrelated Concurrent Financing, future plans, regulatory approvals and other\nmatters. Forward-looking statements consist of statements that are not\npurely historical, including any statements regarding beliefs, plans,\nexpectations or intentions regarding the future. Such information can\ngenerally be identified by the use of forwarding-looking wording such as\n\"may\", \"expect\", \"estimate\", \"anticipate\", \"intend\", \"believe\" and\n\"continue\" or the negative thereof or similar variations. The reader is\ncautioned that assumptions used in the preparation of any forward-looking\ninformation may prove to be incorrect. Events or circumstances may cause\nactual results to differ materially from those predicted, as a result of\nnumerous known and unknown risks, uncertainties, and other factors, many of\nwhich are beyond the control of the Company, including but not limited to,\nbusiness, economic and capital market conditions, the ability to manage\noperating expenses, security threats, and dependence on key personnel. Such\nstatements and information are based on numerous assumptions regarding\npresent and future  business strategies and the environment in which the\nResulting Issuer will operate in the future, including the demand for its\nproducts, anticipated costs, and the ability to achieve goals. Factors that\ncould cause the actual results to differ materially  from those in\nforward-looking statements include, failure to obtain regulatory approval,\nthe continued availability of capital and financing, equipment failures,\nlitigation, increase in operating costs, the impact of Covid-19 or other\nviruses and diseases on the ability to operate, failure of counterparties\nto perform their contractual obligations, government regulations, loss of\nkey employees and consultants, and general economic, market or business\nconditions. Forward-looking statements contained in this news release are\nexpressly qualified by this cautionary statement. The reader is cautioned\nnot to place undue reliance on any forward-looking information.\n\n     There can be no assurance that the proposed Transaction or Concurrent\nFinancing will be completed or, if completed, will be successful. The\nforward-looking statements contained in this news release are made as of\nthe date of this news release. Except as required by law, the Company\ndisclaims any intention and assumes no obligation to update or revise any\nforward-looking statements, whether as a result of new information, future\nevents or otherwise. Additionally, the Company undertakes no obligation to\ncomment on the expectations of, or statements made by, third parties in\nrespect of the matters discussed above.\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2135000344.MNPRE2135001471-10400420211217</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}