{"date": "2022-01-18 19:42:05.157000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>GURU ORGANIC ENERGY CORP (\"GURU-T;GUROF-0\")\n- Hits the Slopes With New Partnerships With Three Major Canadian Ski\n- Resorts\n\n     GURU Organic Energy Corp. (\"GURU\" or the \"Company\"), Canada's leading\norganic energy drink brand, is pleased to announce three new partnerships\nwith major Canadian ski resorts, made possible in part thanks to its\nrecently launched exclusive distribution agreement with PepsiCo(R)\nBeverages Canada.\n\n     Including one of the country's most emblematic ski destinations,\nWhistler Blackcomb in British Columbia, in addition to Quebec's Bromont and\nMont Sutton mountain destinations, these partnerships are part of GURU's\nstrategy to connect with health-conscious Canadians and outdoor enthusiasts\non the slopes. Over the course of the 2022 ski and snowboard season, GURU\nwill be providing its full range of core energy drinks to the winter sports\ncommunity, as well as activating various on-site sampling, sponsorships,\nand other promotional events and activities. The Company will ensure any\npromotional activities undertaken comply with COVID-19 public health\nguidelines in place.\n\n     \"We are pleased to partner with GURU, which will certainly contribute\nto creating links with outdoor enthusiasts and enliven our various activity\nzones and theme days,\" mentioned Marc-Andre Meunier, Bromont's Director of\nSales and Marketing. \"We see this partnership as an opportunity to enhance\nour offer and the experience of Bromont, montagne d'experiences'\ncustomers.\"\n\n     \"Since the beginning of our distribution agreement with PepsiCo(R)\nBeverages Canada in late 2021, we have been quickly ramping up our brand\nawareness and trial activities from coast to coast, and we are already\nseeing our efforts pay off,\" said Carl Goyette, President and CEO of GURU.\n\"The partnerships we've developed with Whistler, Bromont and Sutton are\ndirectly in line with our strategy and who we are as a brand. We are\nexcited to continue making our mark in the Canadian food service sector,\nand are confident that this will be the first of many such partnerships.\nWith more discussions underway with other resorts in Canada, we look\nforward to bringing our good energy to a growing number of Canadians and\ntourists who share our love for the outdoors and who care about energizing\nthemselves with plant-based products with natural, energy boosting, and\nfunctional ingredients,\" he added.\n\n     About GURU Products\n\n  All GURU energy drinks are plant-based, high in natural caffeine, free of\nartificial sweeteners, artificial colours and flavours, and have no\npreservatives. In addition, all drinks are organic, vegan and gluten free -\nand the best thing is their amazing taste.\n\n     About GURU\n\n    GURU Organic Energy Corp. is a dynamic, fast-growing beverage company\nlaunched in 1999, when it pioneered the world's first natural, plant-based\nenergy drink. The Company markets organic energy drinks in Canada and the\nUnited States through a distribution network of more than 21,000 points of\nsale, and through guruenergy.com and Amazon. GURU has built an inspiring\nbrand with a clean list of organic plant-based ingredients. Its drinks\noffer consumers good energy that never comes at the expense of their\nhealth. The Company is committed to achieving its mission of cleaning the\nenergy drink industry in Canada and the United States. For more\ninformation, go to www.guruenergy.com or follow us @guruenergydrink on\nInstagram and @guruenergy on Facebook.\n\nContact:\n\n//st\n  GURU Organic Energy Investors Carl        Media Lyla Radmanovich PELICAN\n  Goyette, President and CEO Ingy           PR 514-845-8763\n  Sarraf, Chief Financial Officer           media@rppelican.ca\n  514-845-4878 investors@guruenergy.com\n\n//et\n\n     Photos accompanying this announcement are available at:\n\n<a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/97812d16-6d76-44b4-b0c2\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.globenewswire.com/NewsRoom/AttachmentNg/97812d16-6d76-44b4-b0c2</a>\n-76469d118e68\n\n<a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/10772324-d074-47a1-9b25\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.globenewswire.com/NewsRoom/AttachmentNg/10772324-d074-47a1-9b25</a>\n-93ad5c10fe10\n\nTel   : 514-845-4878    GURU ORGANIC ENERGY CORP\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201700056.MNPRE2201701123-05412020220118</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}