{"date": "2022-01-27 08:47:07.301000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2799.72, "close": 2792.75}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon is channeling its influence in Washington to drum up bipartisan support for an unlikely cause: legalizing marijuana.</p><p>The company on Tuesday endorsed legislation by Rep. Nancy Mace (R-S.C.) to end the federal prohibition on pot, as Forbes reported, the first time it has backed a GOP-led bill on the issue. In doing so, Amazon is dialing up an unexpected campaign that if successful could make it easier for the e-commerce giant to expand its workforce as it continues a hiring surge.</p></div><div class=\"tr-npp-body\"><p>The tech giant came out in favor of legalization efforts last year and has since lobbied both publicly and privately for other, Democratic-led proposals that like Mace's would remove marijuana from the federal government's list of controlled substances. (Jeff Bezos, who founded Amazon, owns The Washington Post.)</p><p>Now the tech giant is again using its political might to rally lawmakers behind the cause, which Amazon says could widen its applicant pool by helping to ease drug testing requirements and assist with employee retention.</p><p>\"This is not an issue that Amazon would normally engage on,\" Brian Huseman, Amazon's vice president of public policy, said during an interview Tuesday.</p><p>Legalizing marijuana could also open the door to a lucrative new market for the online retailer. But Huseman said Amazon is not interested in selling marijuana.</p><p>\"There are no plans to sell cannabis, and that is not why we're doing this or being involved in this debate,\" he said.</p><p>Instead, he said, the company's focus in pushing for legislation is to remove hiring impediments, which Amazon has found disproportionately affect people of color. \"We realized that it was a hindrance to our ability to hire employees,\" he said.</p><p>That includes endorsing two bills led separately by Senate Majority Leader Charles E. Schumer (D-N.Y.) and Rep. Jerrold Nadler (D-N.Y.) that each would also expunge some marijuana-related crimes, in addition to removing the federal prohibition. The tech giant also tapped its in-house lobbyists to work on both bills in the second half of last year, according to disclosure filings reviewed by the Technology 202.</p><p>But Amazon's latest endorsement is particularly notable given the bill's champion: Mace, a onetime campaign worker for former president Donald Trump who is now making the case that legalizing marijuana is pro-business, states-friendly and anti-big government.</p><p>In a separate interview Tuesday, Mace said it's crucial to have businesses big and small recognize \"the ramifications of cannabis prohibitions . . . and what a detriment it is that the federal government is getting in the way of state law and these kinds of reforms.\"</p><p>And she said Amazon's endorsement goes a long way. \"Having Amazon lean in at this level this early gives this kind of reform great momentum going forward,\" she said.</p><p>Mace's argument could resonate with other economic-minded Republicans, particularly with major corporations such as Amazon backing the effort.</p><p>And it's a case Amazon could now make directly to Mace's colleagues.</p><p>\"We are talking with members of both parties, including Republicans, about why we think this is the right thing to do, especially from the standpoint of a major employer and what this means for our business and our employees and broadening the employee base,\" Huseman said.</p><p>Not all legalization proponents are convinced that Amazon is a true ally, however, nor that it will keep away from selling marijuana down the line.</p><p>\"I'm deeply skeptical that Amazon's lobbying is anything more than a self-interested move to monopolize yet another market, potentially blocking Black and Latino entrepreneurs from an emerging industry,\" Sen. Elizabeth Warren (D-Mass.), a critic who has called for the tech giant to be broken up, told me.</p><p>But both Mace and Huseman said they're hoping to nourish bipartisan support.</p><p>\"One reason why we were particularly excited by Congresswoman Mace's bill is that it shows that there's bipartisan support for this issue, and we think that this is an issue on which both parties can agree,\" Huseman said.</p><p>Mace agrees. \"There's no way that we can do this kind of legislation . . . at the federal level if we don't have Republicans and Democrats coming together and working on it, if we don't have businesses, both large and small, coming together and working on it,\" she said.</p><p>They're hoping to nudge other corporations into following Amazon's lead.</p><p>\"We hope and we think that other large employers in this country should take the same position that we're taking on this, that they should also use their resources to lobby for federal legalization and expungement,\" Huseman said. \"It's the right thing to do.\"</p><p>Amazon's endorsement doesn't come without political risk, given staunch opposition from some Republicans to the legalization push.</p><p>In November, the chairman of the South Carolina Republican Party rebuked Mace's bill, saying that \"unequivocally, the South Carolina Republican Party is against any effort to legalize, decriminalize the use of controlled substances, and that includes this bill.\" Mace is from South Carolina.</p><p>But the prospect of blowback isn't dissuading Amazon.</p><p>\"We do think this policy is the right policy, it's right for the country, it's right for our employees, right for workers, so we're going to push and work on things that we think are good policy, and this is one of them,\" Huseman said.</p><p>cristiano.lima@washpost.com</p><p>aaron.schaffer@washpost.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 The Washington Post</p></div>"}