{"date": "2022-02-08 15:31:07.145000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>PLANTFUEL LIFE INC (\"FUEL-Z;PLFLF-0\")\n- Non-Brokered Private Placement\n\n     PlantFuel Life Inc. (PlantFuelor the Company) announces that it intends\nto complete a private placement (the Private Placement) of up to 6,000,000\nunits (the Units), at a price of $0.50 per Unit, for gross proceeds of up\nto $3,000,000.\n\n     Each Unit will be comprised of one common share (each a Share) and\none-half of one common share purchase warrant (each a Warrant) with each\nwhole Warrant entitling the holder to purchase one additional Share of the\nCompany, at a price of $0.62 per Share for a period of 24 months from the\ndate of issuance.\n\n     The Shares and Warrants issued will be subject to a four-month hold\nperiod, pursuant to securities laws in Canada.\n\n     Brad Pyatt, Founder of PlantFuel, said, Our management team is excited\nto secure this equity financing to drive our business forward.\n\n     The Company intends to use the proceeds from the Private Placement to\nsupport its launch at Amazon and GNC and also for general working capital.\n\n     The company has also launched its investor relations website\nwww.PlantFuellife.com. This will allow investors to access all relevant\ninformation about the company stock, business and products.\n\n     About PlantFuel Life Inc.\n\n     PlantFuel Life Inc is a scientifically focused, plant-based wellness\ncompany managed by successful entrepreneurs with extensive experience in\nthe areas of consumer-packaged goods, manufacturing, logistics, and\ndistribution. <a href=\"https://plantfuellife.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://plantfuellife.com</a>/\n\n     The Canadian Securities Exchange (\"CSE\") has neither approved nor\ndisapproved the contents of this news release. Neither the CSE nor its\nMarket Regulator (as that term is defined in the policies of the CSE)\naccepts responsibility for the adequacy or accuracy of this release.\n\n     This news release does not constitute an offer to sell or a\nsolicitation of an offer to buy any of the securities in the United States.\nThe securities have not been and will not be registered under the United\nStates Securities Act of 1933, as amended (the \"U.S. Securities Act\") or\nany state securities laws and may not be offered or sold within the United\nStates or to U.S. persons unless registered under the U.S. Securities Act\nand applicable state securities laws or an exemption from such registration\nis available.\n\n          __________________________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203800289.MNPRE2203802089-07302820220208</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}