{"date": "2021-12-15 07:01:37.505000+00:00", "ticker": "ABDN", "mrkt_info": {"open": 235.0, "close": 234.9}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 6634VStandard Life Private Eqty Trst PLC15 December 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>Standard Life Private Equity Trust plc</span>\n</p>\n<p>\n<span>Legal Entity Identifier (LEI): 2138004MK7VPTZ99EV13</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>15 December 2021</span>\n</p>\n<p>\n<span>Standard Life Private Equity Trust plc (\"SLPET\" or \"the Company\") announces its estimated net asset value (\"NAV\") at 30 November 2021</span>\n</p>\n<p>\n<span>·</span>\n<span>\n<span>Estimated NAV at 30 November 2021 was 665.3 pence per share (estimated NAV at 31 October 2021 was 613.0 pence per share)</span>\n</span>\n</p>\n<p>\n<span>·</span>\n<span>\n<span>SLPET paid £26.3 million of drawdowns and received £14.0 million of distributions during the month of November</span>\n</span>\n</p>\n<p>\n<span>·</span>\n<span>\n<span>One new primary commitment and four new co-investments completed</span>\n</span>\n</p>\n<p>\n<span>·</span>\n<span>\n<span>Outstanding commitments of £569.8 million at 30 November 2021</span>\n</span>\n</p>\n<p>\n<span>SLPET's valuation policy for private equity funds and co-investments is based on the latest valuations reported by the managers of the funds and co-investments in which the Company has interests. In the case of SLPET's valuation at 30 November 2021, excluding new investments, 96.8% by value of the portfolio valuations were dated 30 September 2021. The value of the portfolio is therefore calculated as the 30 September 2021 valuation, adjusted for subsequent cashflows over the period to 30 November 2021. This is an update from the estimated NAV at 31 October 2021, which was based on valuations dated 30 June 2021, adjusted for subsequent cashflows over the period to 31 October 2021.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Estimated NAV</span>\n</p>\n<p>\n<span>At 30 November 2021, SLPET's estimated NAV was 665.3 pence per share (estimated net assets £1,022.9 million), representing a 8.5% per share increase from the estimated NAV at 31 October 2021 of 613.0 pence per share (estimated net assets £942.5 million). The 52.3 pence increase in NAV per share reflected gains arising primarily from the quarterly revaluation of the portfolio as at 30 September 2021, which resulted in a uplift of 8.0% in the value of the portfolio on a constant currency basis. In addition, the movement in NAV is due to a 0.8% appreciation in the euro versus sterling during November.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Drawdowns and distributions</span>\n</p>\n<p>\n<span>SLPET paid £26.3 million of drawdowns and received £14.0 million of distributions during the month of November.</span>\n<span>The distributions received generated realised gains and income of £7.9 million.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Investment activity</span>\n</p>\n<p>\n<span>A new primary commitment of $20.0 million was made to Great Hill Partners VIII in November. Great Hill Partners are a growth-focused private equity firm based in the United States.</span>\n</p>\n<p>\n<span>The Company also made 4 new co-investments over the course of the month. Firstly, a $11.5 million co-investment has been made into a portfolio of well-known beverage brands, including Tropicana and Naked. The co-investment was made alongside sponsor PAI Partners.</span>\n</p>\n<p>\n<span>A $7.0 million co-investment has also been made into CDL Nuclear Technologies, a provider of turnkey cardiac PET / PET-CT imaging technology solutions and radioisotope delivery to independent cardiology practices and hospitals in the US. The co-investment was made alongside sponsor Excellere Partners.</span>\n</p>\n<p>\n<span>A €8.0 million co-investment was then subsequently made into European Camping Group, a European leader in the premium outdoor vacation accommodation market. The co-investment was made alongside sponsor PAI Partners.</span>\n</p>\n<p>\n<span>Finally, a €10.5 million co-investment has been made into NGE, the leading independent player in the construction and public works sector in France. The co-investment was made alongside sponsor Montefiore Investment.</span>\n</p>\n<p>\n<span>Commitments</span>\n</p>\n<p>\n<span>The Company had £569.8 million of outstanding commitments at 30 November 2021. The Manager believes that around £48.2 million of the Company's existing outstanding commitments are unlikely to be drawn.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Balance sheet and credit facility</span>\n</p>\n<p>\n<span>The Company had cash and cash equivalents of £24.7 million</span>\n<span>at 30 November 2021</span>\n<span>. In addition, the Company at that date had an undrawn £200.0 million syndicated revolving credit facility, provided by Citi, Societe Generale and State Street Bank International, that expires in December 2024.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Update from the Manager</span>\n</p>\n<p>\n<span>The latest update from the Manager is available within the Latest News section of the Company website; www.slpet.co.uk.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Future announcements</span>\n</p>\n<p>\n<span>The Company is expecting to announce its annual results on or around 25 <span> January 2022 and will announce its estimated NAV at 31 December 2021 at the same time.</span>\n<span>\n</span></span></p>\n<p>\n<span>Additional detail about SLPET's NAV and investment diversification can be found on SLPET's website. Neither the contents of the Company's website nor the contents of any website accessible from hyperlinks on the Company's website is incorporated into, or forms part of, this announcement.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>For further information please contact Alan Gauld at SL Capital Partners LLP (0131 528 4424)</span>\n</p>\n<p>\n<span>Note:-</span>\n</p>\n<p>\n<span>Standard Life Private Equity Trust plc is an investment company managed by SL Capital Partners LLP, the ordinary shares of which are admitted to listing by the UK Listing Authority and to trading on the Stock Exchange and which seeks to conduct its affairs so as to qualify as an investment trust under sections 1158-1165 of the Corporation Tax Act 2010. The Board of Standard Life Private Equity Trust plc is independent of abrdn plc and Phoenix Group Holdings.</span>\n</p>\n<p>\n<span>Valuation Methodology</span>\n</p>\n<p>\n<span>Unquoted investments are stated at the directors' estimate of fair value and follow the recommendations of EVCA and BVCA. The estimate of fair value is normally the latest valuation placed on an investment by its manager at the balance sheet date. The valuation policies used by the manager in undertaking that valuation will generally be in line with the joint publication from EVCA and BVCA, 'International Private Equity and Venture Capital Valuation guidelines'. Where formal valuations are not completed at the balance sheet date, the last available valuation from the manager is adjusted for any subsequent cashflows occurring between the valuation date and the balance sheet date. The Company's Manager may further adjust such valuations to reflect any changes in circumstances from the last manager's formal valuation date to arrive at the estimate of fair value.</span>\n</p>\n<p>\n<span>The Company intends to release regular estimated NAV updates around ten business days after each month end, while continuing to issue quarterly updates. A breakdown of SLPET's portfolio can be obtained in the latest monthly factsheet, which is published on SLPET's website at:</span>\n</p>\n<p>\n<span>www.slpet.co.uk</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>NAVFFFFIFRLSLIL</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}