{"date": "2021-11-22 05:01:00.189000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>adidas Migrates SAP Environments to AWS</b>\n</p><p class=\"bwalignc\">\n<span>As the preferred cloud provider for adidas SAP workloads, AWS will help one of the world’s largest sports brands to transform its business by implementing SAP S/4HANA</span>\n</p><p>\nToday, Amazon Web Services (AWS), an Amazon.com, Inc. company, (NASDAQ: AMZN), announced that adidas AG, one of the largest sports brands in the world, has selected AWS as its preferred cloud provider for SAP workloads. With this announcement, adidas will migrate its SAP environment to AWS and implement a modern SAP S/4HANA platform. Running these business-critical SAP workloads in the cloud will enable adidas to digitize core business processes across its value chain to provide better consumer experiences, become a more data-driven business, and support new business models such as direct-to-consumer.\n</p><p>\nModernizing its ERP system with SAP provides adidas with the technology foundation needed to connect its data across its entire global operations. This new cloud-based system will support the company’s physical sales channel by enabling SAP environments to be integrated with AWS capabilities, such as machine learning and analytics, to streamline supply chain, inventory, and merchandising operations for retail stores around the world. By creating a cloud-based consumer experience, adidas can offer personalized discounts, early access to new releases and collaborations, priority consumer service, and the ability to personalize experiences and offers.\n</p><p>\nAWS’s extensive SAP experience allows adidas to closely integrate its SAP S/4HANA environment with AWS technologies to enable advanced analytics capabilities, data science, and enterprise reporting. By building a cloud-based data lake on AWS, adidas will gain visibility across its internal and consumer-facing operations to deliver new business and consumer insights. By applying machine learning capabilities, such as Amazon SageMaker, AWS’s service that helps developers and data scientists build, train, and deploy machine learning models quickly in the cloud and at the edge, adidas data scientists can predict seasonal demand for products to ensure the right product is available at a specific warehouse or retail store at the right time to increase customer satisfaction. In addition, Amazon SageMaker can also be applied to sales data to enable the sports company to provide personalized product and fit recommendations. This capability will help the adidas e-commerce site to match individual consumer’s style preferences and provide a more personal experience that deepens brand loyalty.\n</p><p>\nUsing high performance computing on AWS, adidas is able to run complex workloads simultaneously for design teams around the world to modernize 3D design capabilities at scale. This capability will speed up the design and creation process, reduce costs, and allow for greater collaboration with consumers and designers. AWS enables the sports brand to create digital twins, virtual representation of its product lines, that will speed up the design and creation process, reduce costs, and allow for greater collaboration with consumers and designers. Overall, incorporating these technologies into the design process will result in faster product creation and design for athletic apparel and shoes, enabling designers to quickly incorporate consumer feedback at the early stages of the creation process.\n</p><p>\nIn addition, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fsustainability%2F&amp;esheet=52534721&amp;newsitemid=20211121005008&amp;lan=en-US&amp;anchor=AWS+Sustainability&amp;index=1&amp;md5=65c88da4e2ac32fdbe859f0ce69a848b\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Sustainability</a> programs will help adidas to reduce the environmental impact of their cloud usage. AWS sustainability solutions architects, experienced advisors on sustainable infrastructure and software design, will evaluate current and future cloud architectures, and determine which technology decisions will support adidas’ overall sustainability goals.\n</p><p>\n“We want to drive innovation across our business, which includes everything from how we design our products to how we engage with the consumers who buy them. By committing to cloud infrastructure, we have the scalability and elasticity we need to handle the seasonality of our business during peak demand, and support the projected growth in our e-commerce business in the years to come,” said Markus Rautert, Senior Vice President, Technology Enablement at adidas AG. “Deploying SAP environments on AWS isn’t just about transforming our technology—it’s about transforming business opportunities and using AWS’s wide range of cloud capabilities to create efficiencies and bring us closer to consumers.”\n</p><p>\n<strong><span style=\"font-weight:normal\">“We are seeing a fundamental change in how consumer goods companies run their technology infrastructures. adidas joins the thousands of customers that run SAP on AWS, leveraging AWS’s reliable and scalable global infrastructure and unmatched SAP experience to provide key insights, drive innovation, and support the creation of new products and services,”</span></strong> said Greg Pearson, Vice President of Worldwide Commercial Sales at Amazon Web Services, Inc. “We look forward to working with adidas on its SAP and digital transformation strategies that will help speed the introduction of<strong><span style=\"font-weight:normal\"> new </span></strong>cloud-based customer experiences like its mobile app, tailored shopping, and personalized offers that deepen the consumer relationship.”\n</p><p>\nBacked by its unmatched experience in running SAP workloads, AWS helps customers get the best performance and most value out of their mission-critical SAP platforms. Running SAP on AWS gives customers the control and confidence to securely run their business, leveraging the most reliable and scalable infrastructure, the broadest set of cloud capabilities, and the largest community of technology partners to help with SAP migration and modernization.\n</p><p>\n<strong>About Amazon Web Services</strong>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com&amp;esheet=52534721&amp;newsitemid=20211121005008&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=2&amp;md5=26ff9aa9b4f3554b801a2bf28687d7f1\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<strong>About Amazon</strong>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Famazon.com%2Fabout&amp;esheet=52534721&amp;newsitemid=20211121005008&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=3&amp;md5=ce9aab6e5ae785462a86121a2a4f5dc8\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p>\n<strong>About adidas</strong>\n</p><p>\nadidas is a global leader in the sporting goods industry. Headquartered in Herzogenaurach/Germany, the company employs more than 62,000 people across the globe and generated sales of € 19.8 billion in 2020.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211121005008r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTIxMDA1MDA4cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=840ccc7171e456df0fb6090f82562ba282e0016e2855716cc7e90f72e0f6b90d55389cf6a7e25fdb8ea0ebcd07fff592fe4b7ea25bd5dac8da606a6c39f8543d\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211121005008/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211121005008/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52534721&amp;newsitemid=20211121005008&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=4&amp;md5=256f2f3a84d7bc36c4af135f2520ef9b\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON-WEB-SERVICES</p></div>"}