{"date": "2021-11-30 15:11:14.178000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>VEJII HOLDINGS LTD (\"VEJI-Z\")\n- Local BC Brand Big Mountain Foods Launches Online Across the US\n- Using Vejii's Platform\n\n     Vejii Holdings Ltd. (\"the Company\" or \"Vejii\"), announced today their\npartnership with Big Mountain Foods (\"BMF\"). BMF is a women-owned, and\nfamily-operated company in the heart of Vancouver, British Columbia.\nEstablished in 1987, BMF produces naturally vegan products.\n\n     Led by Kimberly and Jasmine Chamberland, the natural vegan food\nmanufacturer has entered into an agreement with Vejii for distribution and\nmarketing services; including social and email marketing, Pay Per Click\n(\"PPC\") targeted ads, as well as a strategic User Generated Content (\"UGC\")\ncampaign in collaboration with Vejii's internal marketing team. Along with\nsupporting the plant-based community, Big Mountain Foods also aims to have\ntheir facility be zero-waste by 2025, aligning with Vejii's sustainability\ninitiatives.\n\n     Big Mountain Foods, known for its innovation and award-winning\nproducts including the prestigious NEXTY Award in 2021, recently launched\nLion's Mane Mushroom Crumble, an extension to their crumbles and grounds\nline.  Made with a trio of mushrooms including Lion's Mane, Portobello, and\nShiitake, Lion's Mane Mushroom Crumble is packed with a powerhouse of\nhealth benefits and is already in demand across North America.  Launching\nin early 2022 is another first to market innovation, Superfood Fava Tofu,\nand Super Smoked Fava Tofu.  Superfood Fava Tofu will be the only soy-free\ntofu in-market and contains 45% more protein than leading tofu brands. Big\nMountain Foods products are expected to arrive at Vejii's US fulfillment\ncenter in December and will be available immediately, with marketing\nexpected to start in January 2022.\n\n     Vejii is a digital marketplace and fulfillment platform offering\nthousands of plant-based and sustainable-living products, from hundreds of\nvendors in a centralized, online shopping experience. The Vejii marketplace\nwas built to make it easy for brands like Big Mountain Foods to rapidly\nscale sales and distribution nationally and internationally. Vejii will be\nsupporting the company in reaching national exposure across the United\nStates.\n\n     Vejii has created a consolidated platform for a community of\nethically-aligned consumers, with the intention of bettering our planet by\nsupporting sustainable living, allowing brands to reach national exposure,\nutilizing Vejii's infrastructure of data, tech, marketing, and logistics.\n\n     \"As a family-owned business, we pride ourselves on aligning with\ncompanies that have shared values, Vejii is that perfect partner,\" says\nJasmine Byrne, Big Mountain Foods President. \"Vejii has built a very unique\ncommunity that aligns perfectly with our brand. To be able to expedite our\nmarketing efforts with this marketing agreement is something we are very\nexcited about.\"\n\n     \"The Vejii marketplace was built for rapid scale allowing brands to\nreach national exposure utilizing Vejjii's existing infrastructure of data,\ntech, marketing, and logistics,\" said Kory Zelickson, CEO of Vejii. \"This\npartnership with Big Mountain Foods is a great example of how we are able\nto help brands scale internationally. I look forward to building similar\npartnerships with new innovative brands in the plant-based and sustainable\ncommunity.\"\n\n     About Big Mountain Foods\n\n     Kimberly Chamberland and Jasmine Byrne founded Big Mountain Foods in\n1987. They have focused on product innovation while remaining true to their\ncore value of creating food that they would proudly serve their own\nfamilies. All products are sold fresh and are free of gluten, nuts, soy,\nhalal, certified vegan, and non-GMO verified. Products can be found in\nretailers such as Whole Foods, Loblaws, Sobeys, Albertsons, Vons,\nPavilions, and WinCo. Big Mountain Foods remains family-owned and operated\nand has taken on no investors since its inception. bigmountainfoods.com\n\n     About Vejii Holdings Ltd.\n\n     Headquartered in Kelowna B.C., Vejii is a unified digital marketplace\nand fulfillment platform featuring thousands of plant-based and\nsustainable-living products from a growing list of hundreds of vendors. The\nplatform offers an easy-to-use, omnichannel experience for both vendors and\nbuyers, leveraging big data and artificial intelligence to elegantly\nconnect brands with a targeted consumer base, both organically and through\nspecialized marketing programs. Dynamic fulfillment services empower brands\nto offer fast and reliable delivery, with ongoing engagement being driven\nthrough features like smart lists, subscription programs, reordering\nfunctions, sampling programs, and more.\n\n     Information on the Company and its many products can be accessed\nthrough the links below.\n\n     Vejii Holdings.com\n\n     ON BEHALF OF THE BOARD OF DIRECTORS:\n\n     Kory Zelickson\n\n     Director and CEO\n\n     Find Vejii on Social Media: on Instagram, Facebook, Twitter and\nLinkedIn\n\n     No securities regulatory authority has either approved or disapproved\nof the contents of this news release.\n\n     CAUTION REGARDING FORWARD-LOOKING STATEMENTS\n\n     This press release contains certain forward-looking statements within\nthe meaning of applicable securities laws with respect to the Company.\nThese forward-looking statements generally are identified by words such as\n\"believe,\" \"project,\" \"expect,\" \"anticipate,\" \"estimate,\" \"intend,\"\n\"strategy,\" \"future,\" \"opportunity,\" \"plan,\" \"may,\" \"should,\" \"will,\"\n\"would,\" and similar expressions. Forward-looking statements in this press\nrelease include statements relating to the timing and completion of the Veg\nEssentials Transaction, the timing and completion of the conversion of the\nSubscription Receipts and Special Warrants and completion of the listing on\nthe CSE. Although the Company believes that the expectations and\nassumptions on which such forward-looking statements and information are\nbased are reasonable, undue reliance should not be placed on the\nforward-looking statements and information because the Company can give no\nassurance that they will prove to be correct. Since forward-looking\nstatements and information address future events and conditions, by their\nvery nature they involve inherent risks and uncertainties. Many factors\ncould cause actual future events to differ materially from the\nforward-looking statements in this press release including, without\nlimitation, failure to satisfy the conditions precedent to the closing of\nthe Veg Essentials Transaction and the conversion of the Subscription\nReceipts and Special Warrants and failure to receive final approval of the\nlisting on the CSE and other risk factors described in the Final\nProspectus. Readers are cautioned that the foregoing list of factors is not\nexhaustive. The forward-looking statements included in this news release\nare expressly qualified by this cautionary statement. The forward-looking\nstatements and information contained in this news release are made as of\nthe date hereof and the Company undertakes no obligation to update publicly\nor revise any forward-looking statements or information, whether as a\nresult of new information, future events or otherwise, unless so required\nby applicable laws.\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133300174.MNPRE2133301837-06382120211130</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}