{"date": "2022-01-11 14:41:31.076000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>JAMF HOLDING CORP (\"JAMF-Q\")\n- Ends 2021 Helping Over 60,000 Customers Succeed with Apple\n\n     Jamf, the standard in Apple Enterprise Management, today announced it\nis now helping more than 60,000 active customers succeed with Apple and is\nrunning on approximately 26.5 million devices worldwide.\n\n     2021 was a pivotal year for Jamf, as the company added new\nfunctionality to its Apple Enterprise Management platform to help\norganizations connect, manage and secure their devices. Jamf added more\nthan 6 million devices and 13,000 customers in 2021 and is now running on\napproximately 26.5 million devices and serves more than 60,000 customers.\nThese organizations include:\n\n     *  9 of the 10 largest companies, as ranked by Fortune 500\n     *  22 of the 25 most valuable brands, according to Forbes\n     *  10 of the 10 largest U.S. banks, according to Bankrate.com\n     *  10 of the top 10 global universities, according to U.S. News &amp;\nWorld Report\n     *  8 of the top 10 technology companies, as ranked by Fortune\n\n     In 2021, Jamf completed its three largest contracts in its history,\nand ended the year with its highest gross customer revenue retention rate\nsince its founding in 2002.\n\n     \"Exiting 2021, we saw continued strengthening in commercial markets\nacross all geographies,\" said Dean Hager, CEO of Jamf. \"Looking ahead, this\ncommercial momentum, along with continued investments in our go-to-market\nactivities and new products, will help drive strong revenue growth in 2022.\nWe are excited to continue to help our customers empower their end users\nwith technology that is enterprise-secure and consumer-simple, while\nprotecting personal privacy.\"\n\n     Jamf further strengthened its security platform with acquisition of\nWandera and cmdReporter, and rolled out key product enhancements to help\norganizations succeed in today's hybrid work world\nJamf completed its acquisition of cmdReporter, a suite of security and\ncompliance tools purpose-built for macOS, in February of 2021. Jamf also\ncompleted its acquisition of Wandera, a leader in zero trust cloud security\nand access, in July. These acquisitions uniquely position Jamf to help IT\nand security teams confidently protect devices, data and applications while\nextending the intended Apple experience through the most robust and\nscalable Apple Enterprise Management platform in the market.\n\nAt its 12th annual Jamf Nation User Conference in October, Jamf launched\nJamf Private Access, a true zero trust network access solution that\nreplaces legacy conditional access and VPN technology, ensuring that after\na user authenticates into their device business connections are secure,\nalong with Jamf Threat Defense, a mobile security solution that protects\nendpoints from being compromised through mobile threat detection and\nzero-day phishing prevention with a web-based dashboard for real-time\nnotifications and remediation. Jamf also rolled out key functionalities\nacross its platform, including new bring your own device (BYOD)\nfunctionality, application lifecycle management capabilities, integrations\nwith Google, data loss prevention features and more.\n\n     Jamf has seen significant success with its new line of\nsecurity-focused products for commercial organizations, with approximately\n8,000 commercial customers running Jamf Connect, Jamf Private Access, Jamf\nProtect, Jamf Threat Defense, or Jamf Data Policy on millions of Apple\ndevices.\n\nJamf appoints John Strosahl as company president and chief operating\nofficer and Beth Tschida as chief technology officer, while making other\nkey hires to continue to build a world-class team\nAs president of Jamf, Strosahl will be responsible for leading the\ncompany's operations and strategic growth. Strosahl joined Jamf in 2015,\nand since then has been instrumental in driving the company's topline\ngrowth, establishing and growing its international presence, and\ntransitioning the business to a recurring revenue model.\n\n     \"I am proud of the momentum Jamf has entering into 2022 and I\nattribute it to our sharp focus on serving our global customer base and\ntheir ever-changing needs with the most complete and scalable Apple\nEnterprise Management platform available,\" said Strosahl. \"I am honored to\ntake on this additional responsibility and continue to help our customers\nsucceed with Apple well into the future.\"\n\n     Jamf has also appointed Beth Tschida to chief technology officer.\nTschida joined Jamf in 2018 as senior vice president of engineering, and\nsince then has rapidly scaled its global engineering organization and\nexpanded Jamf's product delivery capabilities across its entire Apple\nEnterprise Management platform.\n\n     These two key appointments continue Jamf's momentum in building a\nworld-class team to further its mission of helping organizations succeed\nwith Apple. In 2021 Jamf also hired Linh Lam as its chief information\nofficer. Lam leads Jamf's technology strategy to create and implement a\nmodel for the modern hybrid workplace as the company continues its rapid\ngrowth.\n\n     \"I could not be more excited about the strength of our entire\nleadership team. John's extensive go-to-market experience, combined with\nhis ability to build a stellar organization, will help Jamf continue to\ngrow its reach globally,\" Hager said.\n\n     Jamf certified as a Great Place to Work(R); top workplace for women\nand families\nThis year, Great Place to Work(R), a global leader in workplace culture,\ncertified Jamf as a 'Great Place to Work.' Jamf was also ranked as one of\nthe 2021 Fortune Best Workplaces in Technology and as one of the 2021 Best\nWorkplaces for Women(TM) by Fortune and Great Place to Work(R). Inc also\nnamed Jamf as a 'best-led' company. Jamf finished the year with greater\nthan 90% employee retention.\n\n     Jamf continues to expand educational opportunity worldwide through its\nwork with MATTER\nJamf opened three new MATTER Innovation Hubs in 2021, including one in\nAfghanistan with the Bayat Foundation, bringing the total to nine hubs\nlocated in 6 countries, with four additional hubs planned to open in the\nfirst half of 2022.\n\n     MATTER Innovation Hubs seek to engage students in technology-enabled\nactive learning. This educational model encourages teachers to moderate and\nencourage student learning, discussion, and exploration to set students up\nwith in-demand skills for future success.\n\n     Sponsored and run by Jamf employees, the Jamf Nation Global Foundation\nand other partners, the Hubs are stocked with iPad, OSMO Learning\nmanipulatives, Sphero education technology and dozens of educational apps\nto offer students the technology they need to expand their skills. Thanks\nto Jamf and MATTER's partnership, the MATTER Innovation Hubs are able to\nbring educational opportunity powered by technology to students around the\nglobe.\n\n     Forward-Looking Statements\nThis press release contains \"forward-looking statements\" within the meaning\nof the \"safe harbor\" provisions of the Private Securities Litigation Reform\nAct of 1995, including but not limited to, statements regarding our\nfinancial outlook and market positioning. Forward-looking statements give\nour current expectations and projections relating to our financial\ncondition, results of operations, plans, objectives, future performance and\nbusiness. You can identify forward-looking statements by the fact that they\ndo not relate strictly to historical or current facts. These statements may\ninclude words such as \"anticipate,\" \"estimate,\" \"expect,\" \"project,\"\n\"plan,\" \"intend,\" \"believe,\" \"may,\" \"will,\" \"should,\" \"can have,\" \"likely\"\nand other words and terms of similar meaning in connection with any\ndiscussion of the timing or nature of future operating or financial\nperformance or other events, statements about the potential benefits of the\nacquisition, possible or assumed business strategies, potential growth\nopportunities, and the potential value creation as a result of combined\nofferings. All forward-looking statements are subject to risks and\nuncertainties that may cause actual results to differ materially from those\nthat we expected, including, among others: statements regarding our future\nfinancial and operating performance (including our financial outlook for\nfuture reporting periods); the impact on our operations and financial\ncondition from the effects of the current COVID-19 pandemic; the potential\nimpact of customer dissatisfaction with Apple or other negative events\naffecting Apple services and devices, and failure of enterprises to adopt\nApple products; the potentially adverse impact of changes in features and\nfunctionality by Apple on our engineering focus or product development\nefforts; changes in our continued relationship with Apple; the fact that we\nare not party to any exclusive agreements or arrangements with Apple; our\nreliance, in part, on channel partners for the sale and distribution of our\nproducts; the impact of reputational harm if users perceive our products as\nthe cause of device failure; our ability to successfully develop new\nproducts or materially enhance current products through our research and\ndevelopment efforts; our ability to continue to attract new customers; our\nability to retain our current customers; our ability to sell additional\nfunctionality to our current customers; our ability to meet service-level\ncommitments under our subscription agreements; our ability to correctly\nestimate market opportunity and forecast market growth; risks associated\nwith failing to continue our recent growth rates; our dependence on one of\nour products for a substantial portion of our revenue; our ability to scale\nour business and manage our expenses; our ability to change our pricing\nmodels, if necessary to compete successfully; the impact of delays or\noutages of our cloud services from any disruptions, capacity limitations or\ninterferences of third-party data centers that host our cloud services,\nincluding Amazon Web Services; our ability to maintain, enhance and protect\nour brand; our ability to maintain our corporate culture; the ability of\nJamf Nation to thrive and grow as we expand our business; the potential\nimpact of inaccurate, incomplete or misleading content that is posted on\nJamf Nation; our ability to offer high-quality support; risks and\nuncertainties associated with acquisitions and divestitures, including, but\nnot limited to, disruptions to ongoing operations; diversions of management\nfrom day-to-day responsibilities; adverse impacts on our financial\ncondition; failure of an acquired business to further our strategy;\nuncertainty of synergies; personnel issues; resulting lawsuits and issues\nunidentified in diligence processes; our ability to predict and respond to\nrapidly evolving technological trends and our customers' changing needs;\nour ability to compete with existing and new companies; the impact of\nadverse general and industry-specific economic and market conditions; the\nimpact of reductions in IT spending; our ability to attract and retain\nhighly qualified personnel; risks associated with competitive challenges\nfaced by our customers; the impact of our often long and unpredictable\nsales cycle; our ability to develop and expand our marketing and sales\ncapabilities; the risks associated with sales to new and existing\nenterprise customers; the risks associated with free trials and other\ninbound, lead-generation sales strategies; the risks associated with\nindemnity provisions in our contracts; our management team's limited\nexperience managing a public company; the impact of any catastrophic\nevents; the impact of global economic conditions; risks associated with\ncyber-security events; the impact of real or perceived errors, failures or\nbugs in our products; the impact of interruptions or performance problems\nassociated with our technology or infrastructure; the impact of general\ndisruptions to data transmission; risks associated with stringent and\nchanging privacy laws, regulations and standards, and information security\npolicies and contractual obligations related to data privacy and security;\nthe risks associated with intellectual property infringement claims; our\nreliance on third-party software and intellectual property licenses; our\nability to protect our intellectual property and proprietary rights; the\nrisks associated with our use of open source software in our products; and\nrisks associated with our indebtedness.\n\n     Additional information concerning these and other factors can be found\nin our filings with the Securities and Exchange Commission. Given these\nfactors, as well as other variables that may affect our operating results,\nyou should not rely on forward-looking statements, assume that past\nfinancial performance will be a reliable indicator of future performance,\nor use historical trends to anticipate results or trends in future periods.\nThe forward-looking statements included in this press release relate only\nto events as of the date hereof. We undertake no obligation to update or\nrevise any forward-looking statement as a result of new information, future\nevents or otherwise, except as otherwise required by law.\n\n     About Jamf\nJamf, the standard in Apple Enterprise Management, extends the legendary\nApple experience people love to businesses, schools and government\norganizations through its software and the world's largest online community\nof admins focused exclusively on Apple, Jamf Nation. To learn more, visit:\nwww.jamf.com.\n\nContact:Rachel Nauen\nmedia@jamf.com\n\n     Investor Contact\nJennifer Gaumond\nir@jamf.com\n\nTel   : 612-605-6625    JAMF HOLDING CORP\nFax   : 612-332-9054\nWWW   : <a href=\"https://www.jamf.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.jamf.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201000248.MNPRE2201001706-06352120220111</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}