{"date": "2021-12-15 07:11:36.474000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 6530VBango PLC15 December 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>15 December, 2021</span>\n</p>\n<p>\n<span>BANGO PLC</span>\n</p>\n<p>\n<span>(\"Bango\")</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Pray.com <span>partners with Bango to scale global expansion</span>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Initial launch in USA</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Cambridge, UK, 15 December, 2021 -</span>\n</span>\n<span>Bango (AIM: BGO), the global platform for data-driven commerce, announces an agreement with Pray.com, the world's #1 app for daily prayer &amp; faith-based media content, to expand their global customer base through payment and bundling initiatives. The partnership launched first in USA, where eligible customers can now improve their mental and spiritual health by enabling Pray.com's premium experience using their telco account.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Downloads for Pray.com skyrocketed during the pandemic with subscriber numbers growing by 22X last year, making Pray.com a top 10 grossing lifestyle app in more than 125 countries. The COVID-19 pandemic sparked a massive global surge in mental and spiritual wellness apps over the past two years, with Pray.com leading the way on the religious front. By partnering with Bango and telcos across the globe, Pray.com is increasing the options for users to sign-up giving millions of new people the ability to unlock full access to a wealth of faith-based self-care and well-being content on the Pray.com platform.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Telcos who use the Bango Platform to offer Pray.com to their customers will benefit from Bango data insights technology to identify users who are most likely to be interested in particular services. These insights help them to target offers to users who are interested in paid streaming subscriptions, increasing uptake and customer retention.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Steve Gatena, CEO at Pray.com said:</span>\n</span>\n<span>\" <span>Bango has been a great supporter of Pray.com and is helping us distribute our mental and spiritual health solution to as many people as possible. By leveraging Bango's technology and partnerships, Pray.com is able to increase access to people in markets with a high number of unbanked users, such as Africa, Asia, and Latin America. We are excited to continue working together with Bango to grow faith, cultivate community, and leave a legacy of helping others.\"</span>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Brent McCray, Director of Business Development - Americas at Bango commented:</span>\n</span>\n<span>\" <span>Opening up access to content and services for consumers is a key goal for Bango. Telcos and resellers can now add Pray.com as a complementary offer to the music, video, gaming, and other subscription services they offer through the Bango Platform. Pray.com is one of the top wellbeing apps in the USA, we look forward to spreading the word to millions more people across the world.\"</span>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Pray.com joins Xbox, Spotify, Amazon and other leading digital subscription merchants who use Bango technology and partnerships to power their payment and resale offers.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>-ENDS-</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Contact Details:</span>\n</span>\n<span>\n</span></p>\n<p>\n<span>\n<span>\n</span>\n<span>\n</span></span></p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>\n<span>Bango PLC</span>\n</span>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n<span>FTI Consulting</span>\n</span>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>Liberum Capital</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Tel. +44 1223 617387</span>\n</p>\n<p>\n<span>E. investors@bango.com</span>\n</p>\n</td>\n<td>\n<p>\n<span>Tel. +44 203 727 1000</span>\n</p>\n</td>\n<td>\n<p>\n<span>Tel.</span>\n<span>+44 20 3100 2000</span>\n</p>\n<p>\n<span>\n<span>\n</span></span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Paul Larbey, CEO</span>\n</p>\n<p>\n<span>Matt Garner, CFO</span>\n</p>\n<p>\n<span>Anil Malhotra, CMO</span>\n</p>\n<p>\n<span>Rebecca Jamieson, IR</span>\n</p>\n</td>\n<td>\n<p>\n<span>Rob Mindell</span>\n</p>\n<p>\n<span>Charlotte Stephen</span>\n</p>\n<p>\n<span>Gregory Hynes</span>\n</p>\n</td>\n<td>\n<p>Cameron Duncan</p>\n<p>James Greenwood</p>\n<p>Ed Phillips</p>\n<p>\n<span>Will King</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>About Bango</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The world's largest online merchants, including Amazon (NASDAQ: AMZN), Google (NASDAQ: GOOG) and Microsoft (NASDAQ: MSFT), use Bango technology to acquire more paying users.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Bango has developed unique purchase behavior technology that enables millions more users to buy the products and services they want, using innovative methods of payment including carrier billing, digital wallets and subscription bundling. Bango harnesses this purchase activity into valuable marketing segments, called Bango Audiences. Merchants use these audiences to target their marketing at paying customers based on their purchase behavior. Better targeting increases spend through the Bango payments business, in turn generating more data insights, creating a powerful virtuous circle that drives continuous growth. Everyone connected to the Bango Platform thrives as the virtuous circle grows. For more information, visit</span>\n<span>\n<a href=\"http://www.bango.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.bango.com</a>\n</span>\n<span>.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>This information is provided by Reach, the non-regulatory press release distribution service of RNS, part of the London Stock Exchange. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .Reach is a non-regulatory news service. By using this service an issuer is confirming that the information contained within this announcement is of a non-regulatory nature. Reach announcements are identified with an orange label and the word \"Reach\" in the source column of the News Explorer pages of London Stock Exchange's website so that they are distinguished from the RNS UK regulatory service. Other vendors subscribing for Reach press releases may use a different method to distinguish Reach announcements from UK regulatory news.RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>NRAGPGQPPUPGGMC</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}