{"date": "2021-11-10 06:14:04+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n      SABA welcomes Amazon Air, Alaska Airlines, JetBlue, United Airlines, and aviation customers during United Nations' COP26 sessions.\n    </div>\n              <div>\n                <p>\n        During the <span><a href=\"https://ukcop26.org/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">United Nations Climate Change Conference (COP26)</a></span>in Glasgow, SABA announced the addition of an Aviators Group founded by Amazon Air and other top U.S. air carriers such as Alaska Airlines, JetBlue, and United Airlines in support of its mission to accelerate the transition to net-zero emissions air transport.\n      </p>\n                <p>\n        SABA was launched in April 2021 as a joint initiative by the Rocky Mountain Institute (RMI) and the Environmental Defense Fund (EDF). It brings together organizations across the aviation sector committed to reducing their air transport emissions through investment in high-integrity sustainable aviation fuels (SAF). This announcement sends a strong demand signal for increased production, price reduction, and continued technological innovation for low-carbon fuels that can enable critical emission reductions in this sector.\n      </p>\n                <p>\n        \"We are excited to work together with the Sustainable Aviation Buyers Alliance to launch a new Aviators Group to promote the development of sustainable aviation fuel solutions,\" said Sarah Rhoads, vice president of Amazon Global Air. \"We're already reducing carbon across our air network, from our ground operations-where we were the first to use electric main deck loaders in North America-to our fleet and network design. By working together with other companies, we are demonstrating there is a strong and growing demand for the rapid deployment of cost-effective sustainable aviation fuels, which will help us meet our commitment to reach net-zero carbon by 2040.\"\n      </p>\n                <div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/operations/promoting-a-more-sustainable-future-through-amazon-air\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Promoting a more sustainable future through Amazon Air</a>\n                    </span>\n                  </div>\n                  <div>\n          Amazon Air has secured up to six million gallons of sustainable aviation fuel (SAF) supplied by Shell Aviation and produced by World Energy.\n        </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/operations/promoting-a-more-sustainable-future-through-amazon-air\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read more</a>\n                    </span>\n                  </div>\n                </div>\n                <p>\n        The announcement was revealed during a panel discussion hosted by SABA at the U.S. Center Pavilion at COP26, which included opening remarks by U.S. Transportation Secretary Pete Buttigieg, who lauded the group's work.\n      </p>\n                <p>\n        Nearly 2.5% of today's emissions are a result of global air travel-a figure projected to rise rapidly in coming years, especially as jet fuel demand is expected to reach <span><a href=\"https://cleantechnica.com/2021/03/17/from-wet-waste-to-flight-scientists-announce-fast-track-solution-for-net-zero-carbon-sustainable-aviation-fuel/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">double</a></span>pre-pandemic levels by 2050. SAF has the potential to dramatically reduce the carbon intensity of flying, but currently represents less than 0.1% of global aviation fuel due to insufficient, disaggregated demand and cost barriers.\n      </p>\n                <p>\n        \"Sustainable aviation fuels are critical to decarbonizing aviation and to Alaska's path to reach net zero by 2040,\" said Ben Minicucci, CEO of Alaska Airlines. \"But production and supply are not yet where our industry needs them to be. That's why it's critical we work together to build a robust market for SAF. We recently partnered with fellow SABA member Microsoft to use SAF to decarbonize their West Coast business travel, and today we are excited to join SABA, Amazon Air, and others to create this new airline group focused on tangible steps, at scale, to accelerate progress and increase availability for all.\"\n      </p>\n                <p>\n        \"While SAF is well-proven to meaningfully reduce air travel emissions, it has long suffered from supply and cost challenges that keep overall usage low. JetBlue has been scaling up the use of SAF across our operation, but a broader universe of suppliers and backers is needed to accelerate aviation's ability to reach commercial SAF production at scale-a critical step to advance toward net zero,\" said Robin Hayes, CEO of JetBlue. \"We are excited to join SABA as a founding member of the Aviators Group to partner, advise, and learn from leading SAF experts RMI and EDF, tackling head-on key challenges that will hopefully enable rapid scale-up of a SAF industry.\"\n      </p>\n                <p>\n        EDF and RMI also unveiled SABA's formal membership structure at the event, effectively opening the doors for public and private organizations worldwide.\n      </p>\n                <p>\n        \"Addressing aviation emissions is a sizable and challenging hurdle in the decarbonization journey for many organizations. The Sustainable Aviation Buyers Alliance was created to give aviation customers an avenue to reduce their emissions by investing in high-quality sustainable aviation fuels. We're eager to have climate-leading organizations join us in this effort,\" said Fred Krupp, president of Environmental Defense Fund.\n      </p>\n                <div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/planet/climate-pledge\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Climate Pledge</a>\n                    </span>\n                  </div>\n                  <div>\n          Amazon is committed to building a sustainable business for our customers and the planet. In 2019, Amazon co-founded The Climate Pledge-a commitment to be net zero carbon across our business by 2040, 10 years ahead of the Paris Agreement.\n        </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/planet/climate-pledge\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read more</a>\n                    </span>\n                  </div>\n                </div>\n                <p>\n        Joining SABA reflects Amazon's continuing investment in decarbonizing technologies as part of The Climate Pledge. Amazon and Global Optimism co-founded <span><a href=\"https://www.theclimatepledge.com/us/en\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Climate Pledge</a></span>in 2019 as a commitment to reach the goals of the Paris Agreement 10 years early and be net-zero carbon by 2040. The Pledge now has more than 200 signatories, including Alaska Airlines and JetBlue.\n      </p>\n                <p>\n        To reach its goal, Amazon is focusing on several key areas. The company will continue to reduce emissions across its operations by taking real business actions and establishing a path to power its operations with 100% renewable energy, five years ahead of the company's original target of 2030.\n      </p>\n                <p>\n        Amazon is also delivering on its Shipment Zero vision to make all shipments net-zero carbon, with 50% net-zero carbon by 2030. The company is purchasing 100,000 electric delivery vehicles, the largest order ever of electric delivery vehicles. Amazon is also investing $2 billion in the development of decarbonizing services and solutions through the Climate Pledge Fund, including investments in <span><a href=\"https://www.aboutamazon.com/news/sustainability/amazon-invests-in-beta-technologies-to-accelerate-zero-emission-air-transportation\" data-type=\"url\" class=\"tr-link\" translate=\"no\">BETA Technologies</a></span>and <span><a href=\"https://www.aboutamazon.com/news/sustainability/amazon-invests-in-zeroavia-to-support-the-development-of-sustainable-aviation\" data-type=\"url\" class=\"tr-link\" translate=\"no\">ZeroAvia.</a></span></p>\n                <p>\n        Amazon also recently helped launch Cargo Owners for Zero Emission Vessels, also known as coZEV. The first-of-its-kind platform, in partnership with The Aspen Institute, enables maritime freight customers to come together to accelerate maritime shipping decarbonization.\n      </p>\n              </div>\n              <div>\n                <div>\n        Related Tags\n      </div>\n                <div>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/sustainability\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Sustainability</a>\n                  </span>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/the-climate-pledge\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Climate Pledge</a>\n                  </span>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/prime-air\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Air</a>\n                  </span>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/aircraft\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Aircraft</a>\n                  </span>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/sustainability/amazon-air-joins-the-sustainable-aviation-buyers-alliance-saba\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>10 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>10 November 2021 06:14:04 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}