{"date": "2021-11-30 17:51:35.260000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Customers and partners to gain further application-aware, as a service data protection for AWS-based workloads</strong></p><p>Las Vegas, Nevada, Nov.  30, 2021  (GLOBE NEWSWIRE) -- <a href=\"https://www.globenewswire.com/Tracker?data=rWaK5d2ERPfEWATTLXNML7orh_HGDKBwhlJYt64fAZy0L8SVyMQBDhrYiW1BMC9FLVHUUP4lEdrtw0uT9RAC8w==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">HYCU, Inc.</a>, a pioneering enterprise software as a service company specializing in on-premises and public cloud data backup and recovery as a service, today announced a preview of HYCU Protégé for Amazon Web Services (AWS), the company’s native, as a service solution for workloads on AWS. The new, born in the cloud solution from HYCU will give customers a tightly integrated and application-aware solution to further protect, manage, and recover data for workloads on AWS.</p>   <p>Cloud-first policies and migration to AWS have become top priorities for senior information technology (IT) executives in enterprises. According to the Flexera Cloud Report<a href=\"https://www.globenewswire.com/Tracker?data=gIMGn72d0Rr170h3TBKsXwyD9m3MRhN5o1mz1VKpvzey0JnbJkke_UcygFDAjS3n\" data-type=\"url\" class=\"tr-link\" translate=\"no\">[1]</a>, AWS adoption among enterprises rose 79 percent from 2020 to 2021. With the rise in interest coupled with the growing number of HYCU customers leveraging AWS for their cloud-first deployments, managing, protecting, and recovering associated workloads in a cost-effective and efficient way without additional hardware, agents, or code is essential. HYCU partners and customers understand the importance of leveraging AWS in their organizations’ cloud initiatives.</p>   <p>“A vast percentage of HYCU’s 3,000+ customers and partners have shown strong interest in leveraging AWS as a foundation for their cloud-first initiatives,” said Simon Taylor, Founder and CEO, HYCU. “Within the AWS Shared Responsibility Model, customers are responsible for data protection in the cloud, so HYCU is excited to announce the preview of our cloud-native data protection service for AWS. We have never been prouder of what our team is showcasing at AWS re:Invent this year and we are thrilled to collaborate with the world’s largest hyperscaler to provide data resiliency, mobility, and disaster recovery to AWS customers worldwide.” </p>   <p><a href=\"https://www.globenewswire.com/Tracker?data=J6og6wjDslgjUDfCYnK9mEF1LjPW7y7wq-f7QEAqmpYxJmq8YvV8Rdm2wfKpq8AJFnP8YzTmapFZsXGec6BWd6HonpY0J7f9eM5jXQs8OVs-Ut60G9ndbBB_eNti6UST\" data-type=\"url\" class=\"tr-link\" translate=\"no\">HYCU Protégé</a> was designed and architected to support both on-premises and applications, and virtual machines (VMs) running on public clouds. At the HYCU booth, the team is showcasing how HYCU specifically works on AWS to manage and protect key workloads running on AWS. General Availability of the solution is anticipated in the first quarter of 2022. HYCU Protégé for AWS provides the following benefits. </p>   <p>   </p><ul class=\"bulleted-list arrowlist\"><li>Automated and instantaneous discovery of applications: AWS-based workloads are identified and managed from within one single user interface.</li><li>Assured data protection: With set and forget policy-based data protection, users do not need to be IT backup administrators to use. For developers, this provides ease of use and self-service capabilities to support container-based application development. Protection policies can be applied globally, across container and non-container sources.</li><li>Ability to set different service level agreements (SLAs) for applications within the same cluster: Ease of management and flexibility to provide policy-based SLAs for container-based workloads regardless of location.</li><li>Granular and flexible recovery: Users can recover an entire application, from individual persistent disks and configuration files.</li><li>Ease of recovery validation with selective cross-regional recovery: Users have the flexibility to leverage multi-regions and locations to spin up applications for recovery.</li><li>Simplify dev/test and disaster recovery (DR) with cross project and cross regional cloning: Users gain an extra layer of protection from cyberattacks, erroneous or malicious deletion, and system outages.</li></ul>   <p>   </p><p>For the Director of IT, at a large car rental wholesale company, and a long-standing HYCU user leveraging HYCU to further protect data on Amazon S3, the latest HYCU solution could not come at a better time. “We really appreciate the way in which HYCU works for all our data protection needs and the latest offering that is being shown at AWS re:Invent will help as we continue to grow and embrace our corporate-wide cloud-first initiative. Alternate solutions we have evaluated have presented additional complexity challenges that require incorporating additional hardware, software and resources. The approach HYCU takes is refreshing. It’s easy to use, and it is even easier to manage while allowing us to further protect our AWS-based data.”</p>   <p>For information on HYCU and HYCU Protégé for AWS, stop by the HYCU Booth #958 at AWS re:Invent, visit: <a href=\"https://www.globenewswire.com/Tracker?data=k12AeEpVsQK9m3JSmbUxEBmjVMIB_kf92jR6Ue7hReGu4XSHYGUa9JTIKMJucJBatDzvDFNZZGvAxzkqqbfJBOR_FUXWOt39u3LlBmrrr5aU_Uh1n2pzjQISiJMy_l-hl47oB9vLpsonxlRG_dCgTBdsBqpPqrajbhfDbeJpcl7B65_PVxRpOhMOYEa4MEgzVpnLt5mw9dcJ869kfzcNajygrGWmqW6pjhxAZgV7spzdok5gHUV34QiHoKbKCCPYzpdTVyBGY9kOwRjWdVPa59lgiV9T9T_tLRMDdwcjqBTBpL1du1UT4WVUOzbrmLJxU70XD7MQCLD3gCS7AZ9m4gCObdECbZybU7MoY7GAWm3-QbqT9jS-FYwZOxc0Vjw-TQ-pXeZGFzs7H7Qb0wNnM2xL2U-GR_a9AgGqbe5V11umptSZBbwIf8qjh408-4Rcp_yQhmzaC-wN0W0HGVJfHSOppN2ohSkvxlpBO926ynsH9cmXxHPY0NRhnYDyYR84qXdRpIvMOVmv-0pgaP12yHzd-TNoqaYOZwDS6NQSrodCFFSwSd8ha6BmdfnZlZbNNvEEQOTagrHLhBO-e0S0U5mCt66ehJo8_K0lWWZYO67pAW7Kz0jEQCmq9bur9GPtgHX3bxIy80GlHSsLe1xoV20qRO_xseeR4wTN5JEWu6RyAq6310WTVBazphw25Cu2NzEDDFipDf7osuqjaO0o1T9P6TcDSGhwF3SGUA1Ziv2ZoxrF4vUexeSW8Si8Cgbfyr0RgNdiZyS54Bs9henU4hgeXYa1BgDSErNDHPJ-sRgQkQW_-4QlXXjmWyVFKgZEjhCP6sB-I_F5ybtdnHzSag==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.hycu.com/data-protection/hycu-for-aws/</a>, or follow <a href=\"https://www.globenewswire.com/Tracker?data=3yqF59VkcTK9VC8I5135T7JzEzglBMCclYx-HCDjrMHAkX7pMLvcWLRABZKWEVUxGOLVDV1aK_Kk1O12Q3Errg==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@hycuinc</a> and connect with us on <a href=\"https://www.globenewswire.com/Tracker?data=qUgUNkDynUAuDMTXw5m5MNOf--j2_TaTBuZJ-sykZ_iRYag_sKoCR_yXWSqE8jvN2ZNn0TRV8RWB-by5p8xPGQobA9ZjgJWc5sq0RyIncjo=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LinkedIn</a>.</p>   <p>Pricing and Availability</p>   <p>HYCU Protégé for AWS is in controlled release with customers and will be generally available through authorized HYCU reseller and channel partners worldwide in Q1 2022.</p>   <p align=\"center\">###</p>   <p> About HYCU</p>   <p>HYCU is the fastest-growing leader in the multi-cloud backup and recovery as a service industry. By bringing true SaaS-based data backup to both on-premises and cloud-native environments, the company provides unparalleled data protection, migration and disaster recovery to more than 2,800 companies worldwide. HYCU’s award-winning, purpose-built solutions eliminate the complexity, risk and high cost of legacy-based solutions, providing data protection simplicity in a hyper-connected, multi-cloud world. Customers experience frictionless, cost-effective data backup and recovery, no matter where their data resides. Based in Boston, Mass., the company employs 300 people across the globe. Learn more at www.hycu.com. </p>   <p>   </p><p>  </p><hr/>   <p><a href=\"https://www.globenewswire.com/Tracker?data=ciNAta5dJZDaezvOPAZhPB7d5MWwlUzjBhxeIVpKgHI1WRIFiNgZbkLnxtlbfvjE\" data-type=\"url\" class=\"tr-link\" translate=\"no\">[1]</a> <a href=\"https://www.globenewswire.com/Tracker?data=z3S8c9KPVx6-QlxpuoTza6zx-Dp-HSZppleQt4dVBlUMQqISN-iBFkp53-nRAup5u77SHWtor8a9Z1c2EAicChwcQO37sWNuFEBFWBHJCA4oS58pBlMN2zc-XEFfF2WbCZTnaUbUvZ0vWrakYQ68eg==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Flexera™ 2021 Cloud Report</a></p> <div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODQwMzE3NSM0NTg5NTAwIzIxOTQzOTg=\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RRd016RTNOU00wTlRnNU5UQXdJekl4T1RRek9UZz0=&amp;key=8a112451d484e460dfb0ada3aae0e5ad657636f5620e68d72d4acc9831209359ae9eada4766e6b2ce209996f85bc65038a3a0461a87d34db27fac68e1d4f47c9\"/></div></div> <br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/ZTZmZWUzMDgtNWE3Ny00NjU3LWJjNjktNDQyMTI3YzZlYmUyLTEyMDU5NTE=/tiny/HYCU-Inc-.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9aVFptWldVek1EZ3ROV0UzTnkwME5qVTNMV0pqTmprdE5EUXlNVEkzWXpabFltVXlMVEV5TURVNU5URT0vdGlueS9IWUNVLUluYy0ucG5n&amp;key=534f4e29bb6dd64dbe3e5e96c6332a3928a119e9068a76a6866d7b7da693e99fdbaeb814cdb517fd2b7a2fa0b267d85b74e7c38d3305b22fa27f4ecaca6ca495\"/></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright GlobeNewswire, Inc. 2021</p></div>"}