{"date": "2021-11-29 21:45:10.342000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENTHUSIAST GAMING HOLDINGS INC (\"EGLX-TQ\")\n- Esports Audience Rises in New Nielsen Report\n\n     Enthusiast Gaming Holdings Inc. (\"Enthusiast Gaming\" or the\n\"Company\"), a media and content platform for video game and esports fans to\nconnect and engage, today announced the results of its second collaboration\nwith Nielsen (NYSE: NLSN), the global leading source for media and sports\nmeasurement, to measure the total social reach and Twitch viewership of the\nCompany's Luminosity Gaming esports audience.\n\n     As esports viewership continues to increase for Gen Z and Millennial\naudiences, Nielsen's measurement of Luminosity Gaming's audience provides\ntrusted verification for brands looking to reach and engage this\ndemographic.\n\n     Based on the results of the second Nielsen study for the period of\nOctober 1 - October 31, 2021, Luminosity Gaming's esports audience\ndelivered growth in viewership across all metrics on Twitch. Notably, hours\nwatched on Twitch for Luminosity Gaming increased 20% over the previous\nstudy from July 2021.\n\n     The Nielsen study also showed that Luminosity Gaming remained the No.\n1 ranked esports team on Twitch for hours watched, average concurrent\nviewers, and peak concurrent viewers (CCV) in October 2021. Average CCV and\npeak CCV increased 13% and 7% over the July study, respectively. Moreover,\nLuminosity Gaming's hours watched were 38% higher than the nearest esports\ncompetitor, and this margin grew by 16% since the last study.\n\n     Top Esports Teams on Twitch\n\n//st\n\n            Organization   Hours Watched (000)   Avg CCV   Peak CCV\n\n            Luminosity     24,046                33,717    142,238\n\n            Team 2         17,453                24,618    103,889\n\n            Team 3         17,161                23,096    117,274\n\n            Team 4         12,651                17,027    80,541\n\n            Team 5         9,700                 13,056    55,997\n\n            Team 6         9,025                 12,147    56,019\n\n//et\n\n     Source: Nielsen Sports, custom study commissioned by Enthusiast\nGaming, October 2021\n\n     \"We believe this latest Nielsen data showcases the continued rise of\nesports and the growth of Luminosity Gaming as the most watched esports\norganization in the world,\" commented Adrian Montgomery, CEO of Enthusiast\nGaming. \"We look forward to using Nielsen's trusted research to support our\ngrowing list of brand partners seeking the best platform to reach the\ngaming and esports community.\"\n\n     About Enthusiast Gaming\n\n     Enthusiast Gaming is building the largest media platform for video\ngame and esports fans to connect and engage worldwide. Combining the\nelements of its four core pillars; Media, Talent, Esports and Experiences,\nEnthusiast Gaming provides a unique opportunity and integrated approach to\nreach and connect with its coveted GenZ and Millennial audience. Through\nits proprietary mix of digital media and entertainment assets, Enthusiast\nGaming has built a vast network of like-minded communities to deliver the\nultimate fan experience.\n\nContact:\n\nEric Bernofsky, Chief Corporate Officer\ninvestor@enthusiastgaming.com\n\n     Forward Looking Statements\n\n     Neither the TSX Exchange nor its Regulation Services Provider (as that\nterm is defined in the policies of the TSX Exchange) accept responsibility\nfor the adequacy or accuracy of this release.\n\n     This news release contains certain statements that may constitute\nforward-looking information under applicable securities laws. All\nstatements, other than those of historical fact, which address activities,\nevents, outcomes, results, developments, performance or achievements that\nEnthusiast Gaming anticipates or expects may or will occur in the future\n(in whole or in part) should be considered forward-looking information.\nOften, but not always, forward-looking information can be identified by the\nuse of words such as \"plans\", \"expects\", \"is expected\", \"budget\",\n\"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\", or\n\"believes\" or variations (including negative variations) of such words and\nphrases, or statements formed in the future tense or indicating that\ncertain actions, events or results \"may\", \"could\", \"would\", \"might\" or\n\"will\" (or other variations of the forgoing) be taken, occur, be achieved,\nor come to pass.\n\n     Forward-looking statements are based on assumptions and analyses made\nby the Company in light of its experience and its perception of historical\ntrends, current conditions, and expected future developments, including,\nbut not limited to, statements regarding the growth of Luminosity Gaming's\nviewership, and brand partnerships of the Company.\n     While Enthusiast Gaming considers these assumptions to be reasonable,\nbased on information currently available, they may prove to be incorrect.\nReaders are cautioned not to place undue reliance on forward-looking\nstatements. In addition, forward-looking statements necessarily involve\nknown and unknown risks, including, without limitation, risks associated\nwith general economic conditions; the timing and filing of the final base\nshelf prospectus and corresponding Registration Statement; the potential\noffering of any Securities by the Company; uncertainty with respect to the\ncompletion of any future offering; the ability to obtain applicable\nregulatory approvals for any contemplated offerings; the ability of the\nCompany to negotiate and complete future funding transactions; adverse\nindustry events; and future legislative, tax and regulatory developments.\nReaders are cautioned that the foregoing list is not exhaustive. For more\ninformation on the risk, uncertainties and assumptions that could cause\nanticipated opportunities and actual results to differ materially, please\nrefer to the public filings of Enthusiast Gaming which are available on\nSEDAR at www.sedar.com.\n\n     Readers are further cautioned not to place undue reliance on\nforward-looking statements as there can be no assurance that the plans,\nintentions or expectations upon which they are placed will occur. Such\ninformation, although considered reasonable by management at the time of\npreparation, may prove to be incorrect and actual results may differ\nmaterially from those anticipated. Forward-looking statements contained in\nthis news release are expressly qualified by this cautionary statement and\nreflect our expectations as of the date hereof, and thus are subject to\nchange thereafter. Enthusiast Gaming disclaims any intention or obligation\nto update or revise any forward-looking statements, whether as a result of\nnew information, future events or otherwise, except as required by\napplicable law.\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133200229.MNPRE2133201324-06312620211129</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}