{"date": "2022-01-04 13:37:05+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>REKOR SYSTEMS INC (\"REKR-Q\")\n- David Desharnais as President\n\n     Rekor Systems, Inc. (\"Rekor\" or the \"Company\"), a global AI technology\ncompany with a mission to provide actionable insights to build safer,\nsmarter, and more efficient cities around the world through intelligent\ninfrastructure, today announced the appointment of David Desharnais as\nPresident. Desharnais brings over two decades of experience leading growth\nstrategies for technology driven businesses from start-ups to multinational\ncorporations, including Amazon and American Express, and across multiple\nindustries. He will report to Rekor's CEO, Robert A. Berman, and lead the\nCompany's global engineering, product management, marketing, and strategic\npartnership efforts.\n\n     Most recently, Desharnais was EVP, Chief Digital Product Officer, and\nBoard Director for IDEMIA where he was responsible for global strategy and\nteams across product management, engineering and application development,\ncustomer delivery and integration, cybersecurity, data and analytics,\nstrategic alliances, and digital labs. IDEMIA is a multi-billion-dollar\nglobal technology company focused on biometrics, identity, authentication,\nand digital security. It is the industry standard and trusted partner to\ngovernments and commercial enterprises globally.\n\n     \"This is an exciting time for Rekor, and David will play a key\nleadership role as we capture significant opportunities in the intelligent\ninfrastructure market driven by groundbreaking trends in cloud,\nedge-computing, machine learning, 5G, IoT, and automotive electronics,\namong others in the public and private sector,\" said Berman. \"David is a\nvisionary, an innovator, and a strong team leader with considerable\nexpertise and operational experience across multiple industries, coupled\nwith a proven track record of success. I am delighted to partner with him\nas we accelerate our momentum and drive Rekor's next chapter of growth and\nsuccess.\"\n     Prior to IDEMIA, David was an executive at Amazon where he served as\nthe General Manager of Worldwide Industries for Amazon Web Services (AWS)\nfor more than 200 services across 28 major industries including automotive,\nfinancial services, healthcare and life sciences, media and advertising,\nenergy, retail and CPG, and more where he helped define and deliver new\ncategories of cloud infrastructure and application specific solutions\n(compute, storage, networking, machine learning, IoT, and end user\ncomputing) tuned for high growth industries.\n\n     \"I am excited to join Robert and the strong team at Rekor on its\nmission to be the industry leader of the fast-growing intelligent\ninfrastructure market,\" said Desharnais. \"Rekor's proprietary technology\nplatform, advanced analytics, connectivity, and market-leading data set are\na powerful combination that is enabling the digitization of infrastructure,\nand safer, smarter, and more sustainable cities and communities. The impact\nof data and technology on infrastructure has reached a tipping point, and I\nam thrilled to be coming on board at this important time.\"\n\n     David graduated summa cum laude with a Bachelor of Science in\nelectrical engineering technology and received a Master of Business\nAdministration in strategy, finance, and marketing from the University of\nWashington, Michael G. Foster School of Business. He is also an investor,\nboard director, technology advisor, and frequent tech commentator and\nauthor, including FinTech: Handbook for Investors, Entrepreneurs and\nVisionaries.\n\n     About Rekor Systems\n\n     Rekor Systems, Inc. (NASDAQ: REKR) is a trusted global authority on\nintelligent infrastructure providing innovative solutions that drive the\nworld to be safer, smarter, and more efficient. As a provider of\ncomprehensive, continuous, and real-time roadway intelligence, Rekor\nleverages AI, machine learning, and holistic data to support the\nintelligent infrastructure that is essential for smart mobility. With its\ndisruptive technology, the Company delivers integrated solutions,\nactionable insights, and predictions that increase roadway safety. To learn\nmore please visit our website: <a href=\"https://rekor.ai\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://rekor.ai</a>.\n\nCONTACTS:\n\nBulent Ozcan\nir@rekor.ai\n410-762-0800\n<a href=\"https://www.rekor.ai\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.rekor.ai</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200300159.MNPRE2200301018-05361020220104</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}