{"date": "2021-11-30 23:36:01+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Lisa Baertlein</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">LOS ANGELES, Nov 30 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>The U.S. labor secretary on Tuesday met with unions and employers at the nation's busiest port complex in Southern California as anxiety builds ahead of next year's contract negotiations covering roughly 22,000 West Coast dockworkers.</p><p>The contract expires in July, and the stakes are particularly high at the Los Angeles/Long Beach port complex that handles some 40% of U.S. imports. Docks at the side-by-side ports are crowded with cargo boxes and more than four dozen container ships are waiting to unload as <a href=\"https://www.reuters.com/article/usa-holidayshopping-ships-idCNL1N2QX21I\" data-type=\"url\" class=\"tr-link\" translate=\"no\">retailers like Walmart scramble</a> to stock shelves with holiday gifts. </p><p>The last round of talks in 2014 and 2015 were contentious, leading to <a href=\"https://www.reuters.com/article/us-usa-ports-west/west-coast-ports-undergo-partial-shutdown-idUSKBN0LG2FG20150212\" data-type=\"url\" class=\"tr-link\" translate=\"no\">temporary port shutdowns</a><span class=\"tr-strong\">. </span>A repeat of that could harm a U.S. economy already grappling with inflation fueled by soaring shipping costs and product shortages.</p><p>Labor Secretary Marty Walsh said interested parties are talking and that he is available, should the two sides reach an impasse. \"If need be and I'm asked, I would definitely step in anytime to offer my support to try and get to resolution,\" Walsh said. </p><p>The International Longshore &amp; Warehouse Union (ILWU) that represents workers at 29 ports in California, Oregon and Washington recently rejected a one-year contract extension offer from the 70 ocean carriers and terminal operators represented by the Pacific Maritime Association (PMA).</p><p>The PMA in a statement said it believed that a one-year contract extension with the ILWU would be in the best interests of the national economy, but that it \"will be prepared to meet at the bargaining table next year.\" </p><p>The ILWU said its members had already approved an earlier extension to the contract and that members have been waiting seven years to address issues that are important to dockworkers. </p><p>The contract expiration coincides with a resurgence of <a href=\"https://www.reuters.com/world/us/enoughs-enough-tight-us-job-market-triggers-strikes-more-pay-2021-10-18\" data-type=\"url\" class=\"tr-link\" translate=\"no\">interest in organized labor</a>. U.S. workers - frustrated that wages have severely lagged soaring profits at companies like <a href=\"https://www.reuters.com/business/amazon-alabama-facility-ordered-re-run-union-election-us-labor-board-2021-11-29\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com</a> - are fighting for better pay and the right to unionize. </p><p>To that end, container shipping firm <a href=\"https://www.reuters.com/business/hapag-lloyd-nine-month-net-profit-soars-over-10-fold-record-freight-rates-2021-11-12\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Hapag-Lloyd</a> <a href=\"reuters://REALTIME/Verb=FullQuote/ric=HLAG.DE\" data-type=\"ric\" data-ric=\"HLAG.DE\" translate=\"no\" dir=\"ltr\">HLAG.DE</a>, AP Moller-Maersk <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MAERSKb.CO\" data-type=\"ric\" data-ric=\"MAERSKb.CO\" translate=\"no\" dir=\"ltr\">MAERSKb.CO</a> and other international carriers are reaping big profits from the record-setting, pandemic-fueled cargo surge.</p><p>ILWU International President Willie Adams in a statement  called on shipping companies and terminal operators to invest in good jobs in the communities that support their bottom lines.</p><p>\"These profits show why collective bargaining ... is necessary and hugely beneficial for America's economy,\" Adams said. </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Lisa Baertlein in Los Angeles; editing by Richard Pullin)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:lisa.baertlein@thomsonreuters.com\" data-type=\"email\" translate=\"no\">lisa.baertlein@thomsonreuters.com</a> ; +1 310-491-7241; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://lisa.baertlein.thomsonreuters.com@reuters.net\">lisa.baertlein.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SUPPLY-CHAIN/USA-PORT LABOR</p></div>"}