{"date": "2021-12-23 05:45:20.755000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.34, "close": 3421.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\"><p>NT wins New Market Public Sector category award hosted by Amazon Web Services (AWS) reflecting large growing demand surge in government clients in Thailand NT has won AWS Partner of the Year 2021 Award in the New Market Public Sector category at AWS Partner Summit Online 2021. Hosted by Amazon Web Services (AWS), the accolade is bestowed on National Telecom Company Limited (NT) for its outstanding performance in supporting customers to move forward with digital innovative solutions built on AWS. Dr.</p><p>Wongkot Vijacksungsithi, Senior Executive Vice President Digital Business, said, \"AWS Partner of the Year award hosted by Amazon Web Services affirms our partnership with AWS and our leadership as Thailand's largest comprehensive cloud-based services company. The company plays important roles in stimulating and promoting the expansion of cloud service ecosystems among government and private sectors nationwide.</p><p>We encourage clients to employ innovation as key to driving business growth and performing digital transformation through fundamental IT structures and creative solutions provided on AWS. The clients are offered online seminars as well as technical support for smooth transition and operation on AWS Cloud to achieve innovation development on economic and social fronts.</p><p>\" NT and AWS are in collaboration to provide ASEAN's first AWS Outpost service in 2020, offering AWS hybrid cloud services that respond to national government offices' requirement in sorting and analysing data in Thailand in compliance with National Policy. Furthermore, the services allow customers to operate business efficiently and confidently on AWS public cloud service.</p><p>Dr. Wongkot added, \"AWS Partner of the Year 2021 Award reflects our customers' confidence in collaborating with NT as the global partnership.</p><p>Meanwhile, NT is prompted to move forward to expand cloud-based services to provide innovative solutions and worthwhile outcomes for all sectors, in particular the New Market Public Sector award category. The award is a proven achievement of our collaboration in driving cloud services forward constantly and generating outstanding growth among government sectors throughout several years.</p><p>The surge in customer base reflects high demand for cloud service in Thailand compared to other countries in the region.\" NT's government customers include large and prospective GDCCs, the nationwide patient data network \"Health Link\", and many more.</p><p>NT has supported government digital services development for the public to be in line with the organisation's vision. With these positive trends, NT believes the provision of services is poised for long-term potential and cloud service expansion.</p><p>\"In the years to come, cloud service demand in Thailand will continue to grow as all government offices are urged to develop IT systems to reach the goal of digital government. NT cloud is committed to providing data transfer service as well as increasing cloud system performance to support and develop in-depth IT expertise for customers in all sectors to commence digital operations and resolve challenging and complex issues speedily and efficiently.</p><p>\"a</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Bangkok Post</p></div>"}