{"date": "2021-12-03 03:13:49.140000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3443.72, "close": 3389.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Dec 02, 2021</p></div><div class=\"tr-npp-lead\"><p><span>Amazon</span><a href=\"https://www.zacks.com/stock/quote/AMZN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AMZN</a> ramps up the competition in the cloud market with the introduction of Amazon Web Services' (\"AWS\") Graviton3 processor-backed Amazon Elastic Compute Cloud (Amazon EC2) C7g instances.Cost-efficient C7g instances offer enhanced performance to customers for their compute-intensive workload.Arm-based AWS Graviton3 processors deliver up to three times better performance for machine learning workloads compared with the company's last-generation chips — AWS Graviton2 processors.Graviton3 offers up to two times higher floating-point performance for scientific, machine learning, and media encoding workloads. It further provides up to two times faster performance for cryptographic workloads.The new processors deliver 25% better performance in comparison with Graviton2 processors.</p></div><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">Amazon.com, Inc. Price and Consensus</p><p> </p><p><a href=\"https://www.zacks.com/stock/chart/AMZN/price-consensus-chart?icid=chart-AMZN-price-consensus-chart\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. price-consensus-chart</a> | <a href=\"https://www.zacks.com/stock/quote/AMZN?icid=chart-AMZN-price-consensus-chart\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. Quote</a> </p><p class=\"tr-npp-section-title\">Competitive Edge Over Arm</p><p>Although Amazon, currently carrying a Zacks Rank #5 (Strong Sell), faces stiff competition from its strong peers, namely<span>Microsoft</span><a href=\"https://www.zacks.com/stock/quote/MSFT\" data-type=\"url\" class=\"tr-link\" translate=\"no\">MSFT</a> ,<span>Alphabet</span>'s <a href=\"https://www.zacks.com/stock/quote/GOOGL\" data-type=\"url\" class=\"tr-link\" translate=\"no\">GOOGL</a> Google and<span>Oracle</span><a href=\"https://www.zacks.com/stock/quote/ORCL\" data-type=\"url\" class=\"tr-link\" translate=\"no\">ORCL</a> in the cloud domain, AMZN's strengthening efforts toward bolstering its in-house Arm-based chip portfolio remain noteworthy.The launch of AWS Graviton2 processors is a testament to the same.Notably, Arm architecture has gained momentum with the rise in the demand for cheaper but efficient cloud solutions worldwide in order to lower costs.Cost-effectiveness hugely depends on the energy consumption by the cloud servers. Notably, the lesser the energy consumption, the lower will be the cost. Arm processors, widely used in smartphones and tablets, are commonly known for their low energy consumption. Consequently, the utilization of the processors makes cloud systems more efficient.Therefore, the Arm-based Graviton processors, which do not require an x86 instruction set that is expensive for the scale-out workloads, make AWS a more viable option in lowering costs.AWS offers a wide range of cost-effective and power-efficient compute instances. Apart from Graviton3-powered Amazon EC2 C7g instances, AWS's Graviton2 instance portfolio offers 12 different instances such as accelerated computing instances, storage optimized, compute optimized and memory optimized.</p><p class=\"tr-npp-section-title\">Efforts by Microsoft, Alphabet &amp; Oracle</p><p>Oracle recently introduced its first Arm compute instances called OCI Ampere A1, which leveled up its game with Amazon. Notably, OCI Ampere A1 costs one cent per core hour.Oracle, which currently carries a Zacks Rank #3 (Hold), intends to accelerate app development and improvise application performance on its cloud infrastructure on the back of OCI Ampere A1.You can see<span><a href=\"https://www.zacks.com/stocks/buy-list/?ADID=zp_1link_invideas&amp;ICID=zpi_1link_invideas\" data-type=\"url\" class=\"tr-link\" translate=\"no\">the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.</a> </span>Meanwhile, Microsoft and Google are yet to incorporate Arm-based chips in their cloud platforms.Reportedly, Microsoft has forayed into designing in-house Arm-based chips for Azure servers and Surface PCs. The Zacks Rank #3 company intends to produce a processor for use in its data centers by leveraging Arm designs.Alphabet's Google has hired Intel engineering veteran Uri Frank in an effort to design server chips. This is in sync with the Zacks Rank #1 company's increasing investment in customizing its chips in order to reduce energy use and increase performance across its cloud business.</p><p><span>Zacks Names \"Single Best Pick to Double\"</span></p><p>From thousands of stocks, 5 Zacks experts each have chosen their favorite to skyrocket +100% or more in months to come. From those 5, Director of Research Sheraz Mian hand-picks one to have the most explosive upside of all.</p><p>You know this company from its past glory days, but few would expect that it's poised for a monster turnaround. Fresh from a successful repositioning and flush with A-list celeb endorsements, it could rival or surpass other recent Zacks' Stocks Set to Double like Boston Beer Company which shot up +143.0% in a little more than 9 months and Nvidia which boomed +175.9% in one year.</p><p><a href=\"https://www.zacks.com/registration/ultimatetrader/welcome/eoffer/4e87?add=1590&amp;adid=NEWSTEX_CONTENT_ZU_1S2DREPORT_ANALYSTBLOG_253_IND_12012021&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1834174\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Free: See Our Top Stock and 4 Runners Up &gt;&gt;</a></p><p>Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.</p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=RPT_7BST_LP194&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1834174\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Click to get this free report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=AMZN&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1834174\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. (AMZN): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=MSFT&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1834174\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Microsoft Corporation (MSFT): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=ORCL&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1834174\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Oracle Corporation (ORCL): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=GOOGL&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1834174\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Alphabet Inc. (GOOGL): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/stock/news/1834174/amazon-amzn-gains-competitive-edge-with-graviton3-instances?cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1834174\" data-type=\"url\" class=\"tr-link\" translate=\"no\">To read this article on Zacks.com click here.</a></p><p><a href=\"http://www.zacks.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Zacks Investment Research</a></p><p>The views expressed in any and all content distributed by Newstex and its re-distributors (collectively, the \"Newstex Authoritative Content\") are solely those of the respective author(s) and not necessarily the views of Newstex or its re-distributors. Stories from such authors are provided \"AS IS,\" with no warranties, and confer no rights. The material and information provided in Newstex Authoritative Content are for general information only and should not, in any respect, be relied on as professional advice. Newstex Authoritative Content is not \"read and approved\" before it is posted. Accordingly, neither Newstex nor its re-distributors make any claims, promises or guarantees about the accuracy, completeness, or adequacy of the information contained therein or linked to from such content, nor do they take responsibility for any aspect of such content. The Newstex Authoritative Content shall be construed as author-based content and commentary. Accordingly, no warranties or other guarantees are offered as to the quality of the opinions, commentary or anything else appearing in such Newstex Authoritative Content. Newstex and its re-distributors expressly reserve the right to delete stories at its and their sole discretion.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Zacks Investment Research</p></div>"}