{"date": "2021-11-19 19:31:26+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3696.06, "close": 3572.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The Day Ahead is an email and PDF publication that includes the day's major stories and events, analyses and other features. To receive The Day Ahead, Eikon users can register at <a href=\"reuters://REALTIME/verb=Headlines/ric=DAY/US\" data-type=\"newsExpression\" data-expression=\"DAY/US\" translate=\"no\" dir=\"ltr\">DAY/US</a>. Thomson One users can register at RT/DAY/US. All times in ET/GMT</p><p class=\"tr-story-p1\"></p><p><br/></p><p>ON MONDAY</p><p><br/></p><p>Zoom Video Communications Inc is expected to report a rise in third-quarter revenue, driven by a sustained demand for its video-conferencing service.</p><p><br/></p><p>The National Association of Realtors is expected to report existing home sales likely slipped to a seasonally adjusted annual rate of 6.20 million units in October from 6.29 million units in September. (1000/1500)</p><p><br/></p><p>LIVECHAT - REUTERS GLOBAL MARKETS FORUM</p><p>Reuters FX Buzz Analyst Jeremy Boulton on the weekly outlook for G7 currencies and select EM FX pairs (0700/1200). To join the conversation, <a href=\"https://www.refinitiv.com/en/products/refinitiv-messenger/global-markets-forum\" data-type=\"url\" class=\"tr-link\" translate=\"no\">click here</a></p><p><br/></p><p><br/></p><p>REST OF THE WEEK </p><p><br/></p><p>On Wednesday, Federal Open Market Committee issues minutes from its Nov. 2-3 meeting. Investors will probably look for clues on the central bank's take on inflation.</p><p><br/></p><p>On the U.S. economic front, gross domestic product (GDP) likely rose at a 2.1% annualized rate in the third quarter, the Commerce Department is scheduled to report on Wednesday in its second GDP estimate. Also on Wednesday, the Commerce Department is expected to show consumer spending, which accounts for more than two-thirds of U.S. economic activity, likely rose 1% in October, accelerating from a 0.6% rise in September. Orders for durable goods likely rose 0.2% in October after falling 0.3% in September, a Commerce Department will show on the same day. The University of Michigan's Consumer Sentiment Index for November is also expected on Wednesday, it is likely to have inched up to 67 after a reading of 66.8 in the previous month. While the Labor Department is scheduled to report initial claims for state unemployment benefits likely slipped to 264,000 for the week ended Nov. 15. The Commerce Department is expected to show new home sales likely remained unchanged at a seasonally adjusted rate of 800,000 units in October. Data firm IHS Markit, on Tuesday, is expected to report its flash manufacturing PMI likely rose to 59 in November from a reading of 58.4 in October. The flash services reading is expected to have advanced to 59.1 from a reading of 58.7.</p><p><br/></p><p>Dell Technologies Inc is expected to report a rise in its third quarter revenue on Tuesday as hybrid work continues to boost demand for its products. Investors will be looking out for comments on the impact of costs and supply chain logistics on the company.</p><p><br/></p><p>Gap Inc is set to post a jump in third-quarter revenue on Tuesday, boosted by strong demand for its apparel as shoppers start going out again. Investors will be on the lookout for any supply chain impacts going into the holiday season.</p><p><br/></p><p>On Tuesday, Best Buy Co Inc is expected to report a fall in third-quarter revenue on slowing demand for work-from-home electronics after last year's pandemic-induced boom. The retailer's forecast for the holiday season will be in focus as shipping bottlenecks and semiconductor shortages threaten to constrain supplies to stores.</p><p><br/></p><p>Deere and Co is expected to provide conservative financial guidance for next year when it reports results on Wednesday, but investors will be looking out for commentary on the impact of the workers' strike and supply chain problems that have seen North American farmers grappling for parts.</p><p><br/></p><p>Apparel chain Abercrombie &amp; Fitch Co is expected to post an increase in third-quarter revenue on Tuesday, as people spend more to refresh their wardrobes following the easing of the coronavirus curbs. Investors will be on the lookout for its comments on holiday inventory, supply-chain issues and inflation.</p><p><br/></p><p>Nordstrom Inc is expected to post a jump in third-quarter sales on Tuesday, boosted by shoppers returning to its stores after the easing of COVID-19 curbs. Investors will be looking out for the company's comments on the holiday season as the industry grapples with a tight supply chain that has threatened to create product shortages.</p><p><br/></p><p>Dollar Tree Inc is expected to post a rise in third-quarter revenue on Tuesday, aided by robust demand for its discounted products as more people visit its stores. Investors will be interested in comments on the impact from the supply chain disruptions and labor inflation, and inventory levels ahead of the crucial holiday season.</p><p><br/></p><p>Aerie-parent American Eagle Outfitters Inc is expected to post an increase in third-quarter revenue on Tuesday, as people returning to offices and schools spend more on clothing. Investors will be on the lookout for its comments on holiday inventory, supply-chain issues and inflation.    </p><p><br/></p><p>Pinduoduo Inc is expected to show a rise in third-quarter revenue on Friday boosted by sustained demand for online shopping even after the reopening of economy.</p><p><br/></p><p>Paul Beaudry, deputy governor of the Bank of Canada, will give a speech to the Ontario Securities Commission on risks to the stability of the Canadian financial system on Tuesday.</p><p><br/></p><p>Canadian Prime Minister Justin Trudeau will formally outline his new government's priorities on Tuesday after winning reelection for the second time in September. Aides say he plans to focus on managing COVID-19, bolstering healthcare, fighting climate change, supporting economic growth, delivering national childcare and affordable housing plans.</p><p><br/></p><p>India's Supreme Court on Tuesday is set to hear Amazon.com Inc and Future Group's case on the Indian firm's $3.4 billion sale of retail assets to market leader Reliance Industries. The U.S. firm has accused Future of violating certain contracts by agreeing to the sale while Future has denied any wrongdoing.</p><p><br/></p><p>Mexico's third-quarter GDP data is expected on Thursday. </p><p><br/></p><p>Brazil's IPCA-15 consumer price index data is expected on Wednesday. Argentina trade balance and economic activity data is also expected on the same day.<br/><br/></p><p><br/></p><p class=\"tr-signoff\"> (Compiled by Nachiket Tekawade in Bengaluru;<br/>Editing by Vinay Dwivedi)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Nachiket.Tekawade@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Nachiket.Tekawade@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMERS-WHATTOWATCH/</p></div>"}