{"date": "2022-01-17 14:15:12.547000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>PLANTING HOPE CO INC (\"MYLK-V;MYLKF-0\")\n- Acquires Leading Alternative Rice Brand RightRice(R)\n- from Betterer Foods, Inc.\n\n     The Planting Hope Company Inc. (\" Planting Hope \" or the \" Company \"),\na plant-based food and beverage company focused on producing the world's\nmost nutritious and planet-friendly products, today announces that it has\nsigned a definitive agreement and closed the acquisition of Betterer Foods,\nInc.'s (\" RightRice(R) \") business assets for US$7 million in an all-cash\ntransaction (the \" Transaction \"). The all-cash asset purchase adds\nimmediate growth in revenue and accretive earnings to Planting Hope.\n\n     \"The RightRice(R) brand and products add another high potential line\nof breakthrough innovation to Planting Hope's growing portfolio of\nplant-based, planet-friendly, highly-nutritious brands,\" said Julia\nStamberger CEO and Co-founder of Planting Hope. \"RightRice(R) products are\ntruly a differentiated grain alternative, balancing great flavor and\ncompelling nutritional benefits in the form of rice, a grain that is\nfamiliar to billions of people on the planet. We believe the RightRice(R)\nproducts present meaningful innovation with strong growth potential\nglobally.\"\n\n     Several members of the RightRice(R) team across operations, sales and\nmarketing are expected to join the Company following the acquisition. In\naddition, Keith Belling, Founder and CEO of RightRice(R), and Founder and\nformer CEO of popchips(R), will be supporting the Company as an advisor.\n\n     \"We are excited to have several members of RightRice(R)'s talented and\ninnovative team joining the Company, along with the ongoing advisory\nsupport of Keith Belling, a serial entrepreneur in the better-for-you space\nwhose brands we have long admired,\" said Ms. Stamberger.\n\n     \"I am very proud of what we created at RightRice(R) and would like to\nthank everyone involved in developing the RightRice(R) brand and product\nlines,\" said Keith Belling, Founder and CEO of RightRice(R). \"We recognized\nthe compelling synergies to be gained by combining our plant-based products\nwith a company like Planting Hope that shares our commitment to\ncategory-leading innovation. We believe the Planting Hope team has the\ncapabilities and vision to be a great steward for our brand and take\nRightRice(R) to the next level.\"\n\n     RightRice(R) redefines a household staple with a delicious\nvegetable-based rice grain that's packed with the power of vegetables and\ncomplete plant-based protein. RightRice(R) is the first-of-its-kind: a\nshelf-stable vegetable grain that's a blend of over 90 percent vegetables,\nincluding lentils, chickpeas, green peas and rice, that delivers on both\ntaste and nutrition. With 10g of complete protein and 5g fiber per serving,\nRightRice(R) delivers more than double the protein, five times the fiber\nand almost 40 percent fewer net carbohydrates than traditional white rice,\nand can be prepared in just 10 - 12 minutes. RightRice(R) is now available\nin a range of seasoned flavors, along with RightRice(R) Medley and\nRightRice(R) Risotto, a 100% plant-based risotto that debuted in March\n2021.\n\n     RightRice(R) products are currently sold through more than 7,000 doors\nin leading retailers across North America, including Whole Foods Market,\nWegmans, Kroger, Sprouts, Albertsons/Safeway, HEB, Ahold, Meijer, as well\nas online through Amazon, Thrive Market, Hive, and RightRice.com.\n\n     Details of the Transaction\n\n     Structured as an asset deal with a cash purchase price of US$7\nmillion, Planting Hope acquired certain operating assets of RightRice(R),\nincluding inventory, key contracts, brands, and other intellectual\nproperty, which Planting Hope expects to integrate into its business. In\naddition to Keith Belling, Founder &amp; CEO of RightRice(R) entering into a\nconsulting agreement with the Company, several members of the RightRice(R)\noperations, sales and manufacturing team are expected to be joining\nPlanting Hope.\n\n     The aggregate purchase price of US$7 million is comprised of US$4\nmillion in cash funded at closing, with the balance payable under two\nunsecured promissory notes bearing interest at 5% per annum, with the\ninitial note maturing at the latest March 31, 2022 and the second note\nmaturing January 14, 2023.\n\n     The definitive agreement for the Transaction contains standard terms\nfor a transaction of this nature and type, including non-compete\nprovisions.\n\n     Aspect Consumer Partners acted as exclusive financial advisor and\nMorrison &amp; Foerster LLP acted as legal advisor to RightRice(R) in the\nTransaction. Foster Garvey PC and Miller Thomson LLP acted as legal\nadvisors to Planting Hope.\n\n     About RightRice(R)\n\n     Popchips(R) Founder and former CEO Keith Belling loved rice, but not\nall the empty calories and carbohydrates. That's what inspired him to\ncreate RightRice(R), a breakthrough, shelf-stable veggie rice packed with\nnutritious vegetables (lentils, chickpeas + green peas), that launched in\n2019 and is now available in leading retailers across the US including\nWhole Foods Market, Kroger stores and banners, Sprouts and Wegmans.\nRightRice(R) is also available online on Amazon and RightRice.com and in a\ngrowing number of foodservice accounts, including fast casual restaurants\nand cafes and meal prep and meal delivery services. Every bowl of\nRightRice(R) is deliciously packed with more than double the protein, five\ntimes the fiber, and almost 40% fewer net carbohydrates than a bowl of\nwhite rice. RightRice(R) is faster (and easier) to cook than regular rice\nand anything you can make with rice, you can make with RightRice(R).\nRightRice(R) has continued to reinvent the rice aisle with the March 2021\ndebut of RightRice(R) Risotto, a creamy (and dairy-free!) version of the\nItalian classic that's easy to cook in one pot in just 12 minutes. All\nRightRice(R) plant-based products are made using real herbs and spices, and\nare certified non-GMO, gluten-free, and kosher. RightRice(R) is\nheadquartered in San Francisco.\n\n     About The Planting Hope Company Inc.\n\n     Planting Hope develops, launches and scales uniquely innovative\nplant-based and planet-friendly food and beverage brands. Planting Hope's\naward-winning and cutting-edge products fill key unmet needs in the\nskyrocketing plant-based food and beverage space. Founded by experienced\nfood industry entrepreneurs, Planting Hope is a women-managed and woman-led\ncompany with a focus on nutrition, sustainability and diversity. For more\ninformation visit: www.plantinghopecompany.com .\n\n     Contacts\n\n Contact Information:\n\nContact:\n\n     Julia Stamberger\nCEO and Co-founder\n(773) 492-2243\njulia@plantinghopecompany.com\n\n     Contact:\n\n     Rachel Kay Public Relations\nBecca Stonebraker\n(818) 383-3929\nbecca@rkpr.net\n\n     Investor Relations Contact:\n\n     Caroline Sawamoto\nInvestor Relations\n(773) 492-2243\nir@plantinghopecompany.com\n\n     Neither the TSX Venture Exchange nor its Regulation Services Provider\n(as that term is defined in the policies of the TSX Venture Exchange)\naccepts responsibility for the adequacy or accuracy of this release.\n\n     Forward-Looking Statement\n\n     This news release contains \"forward-looking statements\" or\n\"forward-looking information\" (collectively referred to hereafter as\n\"forward-looking statements\") within the meaning of applicable Canadian\nsecurities legislation. All statements that address activities, events, or\ndevelopments that the Company expects or anticipates will, or may, occur in\nthe future, including statements about the Company's status as an innovator\nin the plant-based space, the projected impact of completion of the\nTransaction on the Company's business, integration plans, estimated revenue\nprojections, potential benefits from the Transaction and the Company's\nbusiness prospects, future trends, plans and strategies. In some cases,\nforward looking statements are preceded by, followed by, or include words\nsuch as \"may\", \"will,\" \"would\", \"could\", \"should\", \"believes\", \"potential\",\n\"expects\", \"plans\", \"intends\", \"proposes\", \"anticipates\", or the negative\nof those words or other similar or comparable words. In preparing the\nforward-looking statements in this news release, the Company has applied\nseveral material assumptions, including, but not limited to, the assumption\nthat demand for RightRice (R) 's and the Company's products will be\nsustained or increase in accordance with management's projections, that the\nCompany will successfully integrate the business, employees and management\nof RightRice (R), that the Company's current business objectives can be\nachieved and that its other corporate activities will proceed as expected,\nand that general business and economic conditions will not change in a\nmaterially adverse manner. Although the management of the Company believes\nthat the assumptions made and the expectations represented by such\nstatements are reasonable, there can be no assurance that a forward-looking\nstatement herein will prove to be accurate. Forward-looking statements\ninvolve known and unknown risks, uncertainties, and other factors which may\ncause the actual results, performance, or achievements of the Company to be\nmaterially different from any future results, performance, or achievements\nexpressed or implied by such forward-looking statements. Although\nmanagement of the Company has attempted to identify important factors that\ncould cause actual results to differ materially from those contained in\nforward-looking information, there may be other factors that cause results\nnot to be as anticipated, estimated, or intended. Risks and uncertainties\napplicable to the Company, as well as trends identified by the Company\naffecting its industry can be found in the Company's annual information\nform dated January 6, 2022 and the Company's continuous disclosure record\navailable on SEDAR at www.sedar.com . Such cautionary statements qualify\nall forward-looking statements made in this news release. The Company\nundertakes no obligation to update or revise any forward-looking\nstatements, whether as a result of new information, future events, or\notherwise, except as required by applicable law.\n\nTel   : 604-889-4790    PLANTING HOPE CO INC\nEmail : kendra@vancouvercorporate.ca\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201600447.MNPRE2201600981-06140820220117</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}