{"date": "2022-01-04 23:30:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Joyce Lee</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">SEOUL, Jan 5 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Samsung Electronics Co Ltd <a href=\"reuters://REALTIME/Verb=FullQuote/ric=005930.KS\" data-type=\"ric\" data-ric=\"005930.KS\" translate=\"no\" dir=\"ltr\">005930.KS</a> is likely to post a record fourth-quarter profit thanks to solid demand for server memory chips and higher margins in contract manufacturing, analysts' estimates showed. </p><p>Operating profit for the world's biggest memory chip and smartphone maker likely hit 15.2 trillion won ($12.7 billion) in the quarter ended December, according to a Refinitiv SmartEstimate from 14 analysts, weighted toward those who are more consistently accurate. </p><p>That would be up 68% from 9.05 trillion won a year earlier and narrowly beat the previous Q4 record profit of 15.15 trillion won reported in 2017. </p><p>Samsung Electronics' shares have climbed about 12% in the last two months in anticipation of higher memory chip prices this year, boosted by new data centres and demand for videos, games, conferencing and other streaming services. </p><p>\"Contrary to previous concerns, the semiconductor industry is likely to see demand increase significantly from customers in both memory and non-memory sectors,\" said Jeff Kim, analyst at KB Securities.</p><p>\"As of December, major data centre companies in North America such as Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, Microsoft <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MSFT.O\" data-type=\"ric\" data-ric=\"MSFT.O\" translate=\"no\" dir=\"ltr\">MSFT.O</a> and Meta <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a> have steadily increased their memory chip orders ... And Samsung's foundry business appears to have won two years' worth of orders until 2023.\"</p><p>This view was supported by its peer Micron Technology Inc's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MU.O\" data-type=\"ric\" data-ric=\"MU.O\" translate=\"no\" dir=\"ltr\">MU.O</a> stronger-than-expected earnings results in December and its positive forecast for the following quarter. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2T6237\" data-type=\"storyId\" data-story-id=\"nL4N2T6237\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Samsung's chip contract manufacturing business, which competes with Taiwan Semiconductor Manufacturing Co (TSMC) <a href=\"reuters://REALTIME/Verb=FullQuote/ric=2330.TW\" data-type=\"ric\" data-ric=\"2330.TW\" translate=\"no\" dir=\"ltr\">2330.TW</a>, has also seen sharply improved profitability from the previous quarter to reach an operating margin between 10% and 20% due to more deliveries and higher prices, analysts said. </p><p>Samsung's overall Q4 chip profit is likely to reach 9.7 trillion won, more than double the previous year's 3.85 trillion won, according to an average forecast of five analysts. </p><p>The South Korean tech giant will announce preliminary results on Friday.</p><p>For Samsung's mobile business, which was recently merged into a single Device Experience (DX) division with TV and home appliances, analysts said shipments likely rose slightly from the previous quarter due to easing component shortages. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2SS00Q\" data-type=\"storyId\" data-story-id=\"nL1N2SS00Q\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>The mobile business likely reported an operating profit of about 3 trillion won, up about 24%, according to five analysts' averaged forecasts. </p><p>Market participants will be tuning into Samsung's full results later this month for any updated impact on its Xian NAND flash chip manufacturing facilities, after the company said it would temporarily adjust operations there due to strict COVID-19 curbs in the Chinese city. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2TF0F0\" data-type=\"storyId\" data-story-id=\"nL4N2TF0F0\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> </p><p>Data firm TrendForce said last week Samsung's Xian plant was manufacturing without significant disruptions for now. </p><p><br/></p><p>($1 = 1,193.0000 won)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Joyce Lee; Editing by Miyoung Kim and Stephen Coates)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:joyce.lee@tr.com\" data-type=\"email\" translate=\"no\">joyce.lee@tr.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SAMSUNG ELEC-RESULTS/ (PREVIEW)</p></div>"}