{"date": "2021-11-12 13:17:07.658000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3482.05, "close": 3525.15}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>BLENDER BITES LTD (\"BITE-Z\")\n- Continues to Secure Valuable Retail Distribution and\n- Launches New Formulations in Sobeys Inc., Canada's Second Largest\n- Grocery Chain\n\n     Blender Bites Ltd. (the \"Company\", \"Blender\" or \"Blender Bites\"), a\nCanadian company that develops and markets premium frozen organic and\nplant-based pre-portioned smoothie products, announces the launch of new\nPower Berry, Vita-Smoothie, and Green D-Tox superfood pucks under Sobeys\nInc.'s three major grocery retail banner stores (\"banners\").\n\n    Sobeys was one of the first grocery chains in Canada to carry the\nBlender Bites' brand and has been a reseller of Blender's original Greens\nand Berries, as well as Greens and Tropicals formulations of superfood\nsmoothie pucks for over a year. Sobeys is Canada's second largest grocery\nchain and has over 1,500 corporate and franchised locations. With the moto\n\"We are a family nurturing families,\" Sobeys is committed to nurturing\ncustomers through the provision of exceptional shopping and food\nexperiences and putting their needs and their families' needs first.\nStaying true to this moto, Sobeys is set to launch Blender's reformulated\nand improved smoothie innovations in its Sobeys, Safeway, and Thrifty Foods\nbanner stores.\n\n     Blender Bites' Greens and Berries and Greens and Tropicals have been\nreformulated and renamed Power Berry and Green D-Tox, respectively. These\nimproved formulations, each contain 15 essential plant-based vitamins and\nminerals derived from whole fruits and vegetables, and each product is\naccompanied with an individual health claim such as high source of fiber\n(Green D-Tox), energizing B vitamins and high in antioxidants (Power\nBerry), and immune supporting vitamins A, C and E (Vita-Smoothie). In\naddition to the new formulations that are impressive in taste and\nfunctional improvements, the Blender brand has also undergone a marketing\nmakeover, transitioning to a bright fresh packaging. The products continue\nto uphold the highest standards by being Organic certified, GMO-free,\ngluten-free, soy-free, dairy-free and contain no additional sweeteners.\n\n     \"The launch of our new product formulations across Sobeys banners\nnationwide in Canada is a major accomplishment for Blender Bites. The\nfeedback we have received from grocery buyers is that the items most in\ndemand include products that are convenient to use and have superior\nnutritional profiles offering enhanced immune support. Blender Bites hits\non all these top trends including plant based, organic and frozen and we\nbelieve that the new and improved formulations will be very well received\nby our consumers; fueling our growth further,\" stated Chelsie Hodge, the\nCompany's CEO.\n\n     About Blender Bites\n\n     Blender Bites is a Canadian company involved in the development and\nmarketing of a line of premium frozen food products with a focus on\nfunctionality. Blender Bites was founded in 2016 and was first to market in\nWestern Canada with a pre-portioned \"easy smoothie\" product that is free of\nany unnecessary inner plastic packaging. Blender Bites products are\ncertified organic, vegan, non-GMO, gluten free, dairy free and soy free.\nThey contain no added sugars and are made in Canada. Blender Bites products\nare distributed internationally across Canada and the US, and are currently\nsold in over 900 stores, including Loblaws, Real Canadian Superstore,\nSobeys, Safeway, Save on Foods, Thrifty Foods, Whole Foods Market, and\nselect Ontario club stores.\n\n     On behalf of the Board of Directors,\n\n     Blender Bites Limited\n     Chelsie Hodge, Chief Executive Officer\n     For further information, contact Blender IR Team at:\n     Email - investors@blenderbites.com\n     Telephone - 1-888-997-2055\n\n     CAUTIONARY DISCLAIMER STATEMENT\n\n     This news release includes certain \"forward-looking statements\" under\napplicable Canadian securities legislation. Forward-looking statements are\nnecessarily based upon a number of estimates and assumptions that, while\nconsidered reasonable, are subject to known and unknown risks,\nuncertainties, and other factors which may cause the actual results and\nfuture events to differ materially from those expressed or implied by such\nforward looking statements. Such factors include, but are not limited to\ngeneral business, economic, competitive, political and social\nuncertainties, and uncertain capital markets. Readers are cautioned that\nactual results and future events could differ materially from those\nanticipated in such statements. Accordingly, readers should not place undue\nreliance on forward-looking statements. The Company disclaims any intention\nor obligation to update or revise any forward-looking statements, whether\nas a result of new information, future events or otherwise, except as\nrequired by law.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2131500066.MNPRE2131500674-05161420211112</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}