{"date": "2021-12-02 17:34:00.250000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3443.72, "close": 3389.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>AWS Announces AWS Cloud WAN</b>\n</p><p class=\"bwalignc\">\n<span>New managed WAN service makes it faster and easier for enterprises to build, manage, and monitor a global network that seamlessly connects cloud and on-premises environments</span>\n</p><p class=\"bwalignc\">\n<span>Cisco, Deloitte, Swisscom, Verizon, VMware, and Flutter among customers and partners using AWS Cloud WAN</span>\n</p><p>\nToday, at AWS re:Invent, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), announced AWS Cloud WAN, a managed wide area network (WAN) service that makes it faster and easier for enterprises to build, manage, and monitor a unified global network that seamlessly connects cloud and on-premises environments. AWS Cloud WAN provides a central dashboard that enterprises can use to connect their on-premises branch offices, data centers, and Amazon Virtual Private Clouds (Amazon VPCs) across the AWS global network in just a few clicks. With AWS Cloud WAN, enterprises can get a complete view of their global network and use simple network policies to centrally configure and automate network management and security tasks. AWS Cloud WAN enables enterprises to use the AWS global network to provide a single unified network, which allows them to improve network health, performance, and security. To learn more about AWS Cloud WAN, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Faws.amazon.com%2Fcloud-wan&amp;esheet=52544273&amp;newsitemid=20211202005813&amp;lan=en-US&amp;anchor=aws.amazon.com%2Fcloud-wan&amp;index=1&amp;md5=0285dbdb8311c3a61043add683c4c695\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com/cloud-wan</a>.\n</p><p>\nMany enterprises today run their operations across multiple environments, including on-premises data centers, branch offices, and AWS. To connect these environments together, customers build and manage their own global networks, while also leveraging networking, security, and internet services from multiple third-party providers. For connectivity between cloud environments, customers use AWS networking services like Amazon VPC to easily build a logically isolated virtual network on AWS, and AWS Transit Gateway to easily interconnect multiple VPCs. For connectivity between cloud and on-premises environments, customers use AWS Direct Connect to easily create a private connection between AWS and their data centers, or create a secure AWS virtual private network (VPN) connection. However, for connectivity between on-premises data centers and branch offices, customers must invest considerable time and money to build their own physical network or build a software-defined overlay network from third-party providers. All of these networks take a different approach to connectivity, security, monitoring, and managing performance, which results in an intricate patchwork of individual networks that is complicated to configure, secure, and manage. As a result of these burdens, networking teams struggle with managing an expanding mix of network technologies that are required to securely build, scale, and operate a global network.\n</p><p>\nAWS Cloud WAN is a managed WAN service that connects on-premises data centers, branch offices, and cloud resources to simplify operating a global network. With AWS Cloud WAN, enterprises can use a central dashboard and network policies to build, manage, and monitor a global network that spans multiple locations and networks—eliminating the need to configure and manage different networks individually using different technologies. Network teams can use simple network policies to specify the Amazon VPCs and on-premises locations they want to connect through AWS VPN, AWS Direct Connect, AWS Transit Gateway, and third-party software-defined WAN (SD-WAN) products, and AWS Cloud WAN generates a complete view of the network to monitor network health, security, and performance. Teams can also use network policies to automate routine network-management tasks like adding new sites or branch locations, isolating traffic between sensitive applications or locations, segmenting groups of networks to make it easier to manage network isolation between AWS and on-premises environments, or enabling specialized network or security services. For example, customers can increase their security posture by creating a policy that ensures that any network traffic from their branch locations must be routed through a network firewall before reaching their cloud resources. AWS Cloud WAN integrates with major SD-WAN and network appliance providers—including Aruba (a Hewlett Packard Enterprise company), Cisco Systems, Palo Alto Networks, and VMware—allowing customers to use and manage products and services from these providers. Enterprises can now use AWS Cloud WAN to simplify the way they build, manage, and monitor their networks with a central control plane.\n</p><p>\n“We hear from customers that they are tired of the complexity of managing multiple networks with different connectivity, security, and monitoring requirements using multiple third-party products and services,” said David Brown, Vice President of Amazon EC2 at AWS. “With AWS Cloud WAN, customers can simplify how they manage a WAN by using a central dashboard to unify the multiple networks they manage today, implement network policies for performance and security, easily add locations, and automate advanced network settings. AWS Cloud WAN removes the difficulty of stitching together and managing multiple third-party tools so customers can now more easily keep their networks securely connected and high performing.”\n</p><p>\nTo get started, customers connect their on-premises environments to AWS with the help of a telecommunications service provider. These connections bridge the gap between the customer’s data centers or colocation facilities and the AWS network, extending their existing WAN network to the cloud. Customers can then deploy a highly available global network by selecting the AWS Regions closest to their on-premises locations and then easily add or remove remote locations, data centers, or Amazon VPCs to and from their global network with just a few clicks in the AWS Cloud WAN console or using the AWS Cloud WAN application programming interface (API). AWS Cloud WAN is available in preview today in US East (N. Virginia), US West (N. California), Africa (Cape Town), Asia Pacific (Mumbai), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Europe (Ireland), Europe (Frankfurt), and South America (São Paulo) with availability in additional AWS Regions coming soon.\n</p><p>\nCisco is the worldwide leader in technology that powers the Internet. “Today’s workforce demands more flexibility, meaning organizations must ultimately rethink how they provide simple, secure connectivity to cloud applications, no matter where the user is located,” said JL Valente, Vice President of Product Management, Enterprise Routing, and SD-WAN at Cisco. “To help our customers not only meet the demands of a hybrid workforce, but also provide true end-to-end connectivity and security, Cisco has integrated Cisco SD-WAN with the AWS Cloud WAN service so customers can use automation to interconnect their users, sites and cloud workloads, reduce deployment time, and increase application performance with AWS’s global cloud network.”\n</p><p>\nDeloitte is one of the largest professional services firms in the world and a leader in digital transformation strategy. Through a network of more than 345,000 professionals, industry specialists, and an ecosystem of alliances, Deloitte assists clients in turning complex business issues into opportunities for growth. “In our work with clients’ networking challenges, Deloitte strives to streamline network configuration and operation/support of large-scale cloud network environments,” said Richard Johnson, DC Managing Director at Deloitte. “AWS Cloud WAN addresses network complexity, provides visibility, and offers opportunity to become more operationally effective.”\n</p><p>\nSwisscom is Switzerland’s leading telecom provider and one of its foremost IT companies, serving customers that range from small-to-medium enterprises to large international corporations that have operations in Switzerland. “We are always looking for innovations that help us deliver the network of the future to our customers, innovating ahead of their needs,” said Christoph Aeschlimann, CTIO at Swisscom. “We look to services like AWS Cloud WAN as a powerful way to help our customers take their business to the next level in agility, scalability, and competitiveness.”\n</p><p>\nVerizon is one of the world’s leading providers of technology and communications services. “As a company that's been a global innovator in SD-WAN since the inception of the technology with the first global SD-WAN offering, we look forward to collaborating with AWS on this service that will give enterprises a new tool set to manage their unified global networks,” said Srini Kalapala, Vice President of Technology Development and Planning at Verizon.\n</p><p>\nVMware is a leading innovator in enterprise software and cloud services for all apps, enabling digital innovation with enterprise control. “AWS and VMware continue to help mutual customers shift to distributed work, extend environments to the edge, and optimize security and performance of their business-critical apps,” said Sanjay Uppal, Senior Vice President and General Manager, Service Provider and Edge Business Unit at VMware. “Enterprises don’t want to just connect to AWS; they want more controlled secure access and reliable connectivity to access apps and data inside AWS. Combining VMware Secure Access Service Edge (SASE) with AWS Cloud WAN enables enterprises to deliver a more optimized and secure on-net experience for distributed environments. VMware SASE will better assure last mile reliability, maintain network segmentation end-to-end, and enable enterprise control and compliance.”\n</p><p>\nFlutter is a global leader in online sports betting and gaming, with over 14 million customers globally. “To keep up with rapid growth and demand for real-time data, we built a global network with services from AWS that seamlessly connects our group divisions around the world. We recently went live and we have already seen significant improvements,” said Rupesh Kapadia, Head of Cloud, Operations &amp; Workplace Technology at Sportsbet, the Australian division of Flutter. “Onboarding a new business to our legacy network would take months, however it now takes about five days to connect a new division to the group. AWS Cloud WAN will help us add new sites to our network even faster, whilst improving the visibility, security posture, and speed to change ahead of business expectations.”\n</p><p>\n<strong>About Amazon Web Services</strong>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Furl9490.notification.gcs-web.com%2Fls%2Fclick%3Fupn%3D9MMhW7V5y3oO-2BrZj6t6Pivz7-2FPnNWpHcYbIhyb-2FrDWy0pXYoufpy8rtMnCyaf6uq-2BQae0IqKEtpzOdPC3YdsjbHWhfVo6qwMk5Zk0-2BwhyDkKFjwfNQeieoOANBe0BcxFZ-2FUqMIMO37Du2tZ8gqR-2FprVKicdqSfmsnidMo-2FxKlrvgN5HG4aQnHooa5W-2BkqNHKKDjtluSLgZMAavkmtqC5-2FKp8FFBSNwqkT-2BXKW8Jjp8p8F1vnCFxPGv4OUUn1PKaF5xJg-2Fo3h-2FHb8f94-2FeLuZPAwp0EaHbMzc7lyd-2F0TwLrs-3Dmc9c_kvpqXzpOim-2BNNB8Qn10CEpLx8Kj9CoZeeOQBrFkNX52tlae4VFGk-2Fk2A536shafwp4DX-2BLfdRqnGgT1Zav1q02tW00B-2FdcMVH-2BqlRutjFfX3oVkxKpjVw9x2MksARZ39JfzH38VXwFJvWg2DdY1N-2FxfdqsxWKKHSSGdrdShVSfohtz0vHhr9GbdIqPiHX3qcKV-2FpH0g1dIkWUqxpOo2EKLTeiA3AX8DAkBbH7Vz4QvC0W6GE-2F1WZzdXKoaVKlnyI4cg9dStAmzKO30Rj2xnhwg-3D-3D&amp;esheet=52544273&amp;newsitemid=20211202005813&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=2&amp;md5=6c9d6c3cf1778ff5477e2cfa26d31926\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<strong>About Amazon</strong>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fabout&amp;esheet=52544273&amp;newsitemid=20211202005813&amp;lan=en-US&amp;anchor=www.amazon.com%2Fabout&amp;index=3&amp;md5=63eac3c82031ee7de45ed50bfa228ba3\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/about</a> and follow <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Ftwitter.com%2FAmazonNews&amp;esheet=52544273&amp;newsitemid=20211202005813&amp;lan=en-US&amp;anchor=%40AmazonNews&amp;index=4&amp;md5=9302a2d9685f2c65d8d2f871414f7b35\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@AmazonNews</a>.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211202005813r1&amp;sid=ucdp3&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMjAyMDA1ODEzcjEmc2lkPXVjZHAzJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=5f2db841e3588c9daafcda0fbe48b996868650d6d418e00c5e3bcbb8b8a8323abd7208f3374c0ade378ab2ec40bda6c36c037871bf3f26da2f6472da2353b8b2\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211202005813/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211202005813/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52544273&amp;newsitemid=20211202005813&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=5&amp;md5=58a27bd7001780b572024ecde55f3b64\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NV-AMAZON-WEB-SERVICES</p></div>"}