{"date": "2021-07-11 06:13:56+00:00", "ticker": "AVV", "mrkt_info": {"open": 3924.0, "close": 3935.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Dubai, UAE:</strong> AVEVA, a global leader in industrial software driving digital transformation and sustainability, today announced it has won the 2021 Microsoft Energy Partner of the Year Award and was also named the finalist (runner-up) of 2021 Microsoft Sustainability Changemaker Partner of the Year Award.  The company was honored among a global field of top Microsoft partners for demonstrating excellence in innovation and implementation of customer solutions based on Microsoft technology.</p>\n<p>“We are delighted to win Microsoft’s prestigious Energy Partner of the Year award and be named a finalist for Sustainability Changemaker Partner of the Year. These awards recognize our industry-specific expertise in enabling energy and manufacturing companies to meet their sustainability goals and achieve business resiliency through advanced digital technologies during these globally transformative times,” said <strong>Kerry Grimes, Head of Global Partners, AVEVA.</strong> “AVEVA empowers customers with real-time energy operational data management, integrated with AI and analytics to help manage their energy consumption and emissions. Our purpose, values and strategy create long term value and we are aspiring to a world, where economic growth supports environmental sustainability.”</p>\n<p>The Microsoft Partner of the Year Awards recognize Microsoft partners that have developed and delivered outstanding Microsoft-based solutions during the past year. Awards were classified in various of categories, with honorees chosen from a set of more than 4,400 submitted nominations from more than 100 countries worldwide. AVEVA was recognized for providing outstanding solutions and services across the energy sector.  </p>\n<p>The Energy Partner of the Year Award recognizes a partner organization that excels at providing innovative and unique services or solutions based on Microsoft technologies to energy companies – which include oil &amp; gas, power &amp; utilities, mining and renewables – demonstrating thought leadership in their industry.</p>\n<p>By collaborating with Microsoft, AVEVA has the power to elevate how the energy industry can operate, by marrying the power of industrial data, AI and human insight with the scale, breadth and latency of cloud. Aligning efforts with Microsoft, AVEVA has templated its best practices and vertical solutions to become repeatable, scalable and adaptable to fit agnostically with other software stacks, thereby enabling rapid implementation and payback. Today, organizations deploying combined AVEVA Energy Management and Performance Solutions can realize reductions in project implementation times of up to 60% when compared to bespoke implementations of intelligent operations – thanks to a real-time, 360-degree view of the value chain, and predictive maintenance and operations.</p>\n<p>As a finalist for the Sustainability Changemaker Partner of the Year Award, AVEVA was recognized for providing innovative and unique solutions based on Microsoft technologies that help customers solve challenges of sustainable digital transformation. Sustainability changemakers drive purpose-driven digital transformation that powers a more sustainable world.</p>\n<p>AVEVA provides industrial software that inspires people to shape a sustainable future. The combined solutions span engineering and operations, enabling AVEVA to be well positioned to help increase energy efficiency, minimize noxious emissions and optimize the effective use of valuable natural resources, advancing sustainable development across diverse sectors.</p>\n<p>“I am honored to announce the winners and finalists of the 2021 Microsoft Partner of the Year Awards,” said <strong>Rodney Clark, corporate vice president, Global Partner Solutions, Channel Sales and Channel Chief, Microsoft.</strong> “These remarkable partners have displayed a deep commitment to building world-class solutions for customers—from cloud-to-edge—and represent some of the best and brightest our ecosystem has to offer.”</p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}