{"date": "2022-01-26 21:41:46.677000+00:00", "ticker": "III", "mrkt_info": {"open": 1307.5, "close": 1347.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENBRIDGE INC (\"ENB-TN\")\n- Lehigh Cement and Enbridge Agree to Advance a CO2 Storage\n- Solution in Alberta\n\n     Lehigh Cement, a division of Lehigh Hanson Materials Limited (Lehigh)\nand Enbridge Inc. (Enbridge) are pleased to announce a memorandum of\nunderstanding to collaborate on a carbon solution for Lehigh's cement\nmanufacturing facility in Edmonton, Alberta.\n\n     Lehigh is developing North America's first full-scale carbon capture,\nutilization and storage (CCUS) solution for the cement industry at its\nEdmonton plant, with the goal of capturing approximately 780,000 tonnes of\ncarbon dioxide (CO2) annually. Captured emissions would be transported via\npipeline and permanently sequestered by Enbridge. Subject to the award of\ncarbon sequestration rights and regulatory approvals, the project could be\nin service as early as 2025.\n\n     With the support of Lehigh and Capital Power Corporation (Capital\nPower) with their local facilities, Enbridge will be applying to develop an\nopen access carbon hub in the Wabamun area, west of Edmonton, Alberta,\nthrough the Government of Alberta's Request for Full Project Proposals\nprocess.\n\n     Combined, the emissions from Capital Power and Lehigh's planned carbon\ncapture projects represent an opportunity to avoid nearly 4 million tonnes\nof atmospheric CO2 emissions. Once built, the Open Access Wabamun Carbon\nHub will be among the largest integrated CCUS projects in the world.\n\n     \"At Lehigh Hanson, we believe that carbon capture and storage\ntechnology will play a key role in transforming the cement industry and\nbuilding a more sustainable future,\" said Joerg Nixdorf, President of\nLehigh Hanson's Canada Region. \"We are excited about taking the next steps\nin our ambitious journey to achieving carbon neutrality across the cement\nand concrete value chain.\n\n     \"Having a carbon hub solution in place by 2025 is essential for the\nsuccessful implementation of the CCUS project at our Edmonton cement\nplant,\" Nixdorf added.\n\n     \"Lehigh Cement's pioneering CCUS project is an exciting addition to\nour proposed Open Access Wabamun Carbon Hub, which is poised to support the\ndecarbonization of multiple industries, including power generation, oil and\ngas, and now cement,\" said Colin Gruending, Enbridge Executive Vice\nPresident and President, Liquids Pipelines. \"This collaboration\ndemonstrates our focus on local, cost-effective, customer-focused carbon\ntransportation and storage solutions that drive scale and competitiveness\nwhile minimizing infrastructure footprint to protect land, water and the\nenvironment.\"\n     \"We applaud Lehigh and Enbridge in advancing plans for definitive\nclimate action in Canada with this full chain CCUS initiative and we are\nproud to be a part of the carbon capture development at Lehigh's Edmonton\ncement plant,\" said Mark Demchuk, National Director, Strategy &amp; Stakeholder\nRelations at the International CCS Knowledge Centre. \"Collaborative CCUS\nsolutions like this are a vital enabler of large-scale emissions\nreductions, across multiple industries, including cement production.\"\n\n     \"The Cement Association of Canada (CAC) welcomes the announcement of\nan MOU between Lehigh Hanson and Enbridge for Lehigh's Carbon Capture\nUtilization and Storage project in Edmonton, Alberta. This is another\npositive step forward in the development of Lehigh Hanson's CCUS project,\nsupporting an end-to-end solution for carbon capture and permanent\nstorage,\" said Michael McSweeney, CAC President/CEO. \"These types of\npartnerships on critical technologies like CCUS are how we will win the\nfight against climate change and demonstrate to Canadians and the world how\nour hard to abate industry will reach its net-zero ambition. We are so\npleased to see this CCUS project moving forward.\"\n\n     Enbridge Forward-Looking Information\n\n     Forward-looking information, or forward-looking statements, have been\nincluded in this news release to provide information about Enbridge Inc.\n(\"Enbridge\" or the \"Company\") and its subsidiaries and affiliates,\nincluding management's assessment of Enbridge and its subsidiaries' future\nplans and operations. This information may not be appropriate for other\npurposes. Forward-looking statements are typically identified by words such\nas \"anticipate\", \"expect\", \"project\", \"estimate\", \"forecast\", \"plan\",\n\"intend\", \"target\", \"believe\", \"likely\" and similar words suggesting future\noutcomes or statements regarding an outlook. Forward-looking information or\nstatements in this news release include statements with respect to Lehigh's\nCCUS Project and Enbridge's proposed Open Access Wabamun Carbon Hub,\nincluding the characteristics and benefits thereof, regulatory applications\nand approvals, and prospective in service date.\n\n     Although Enbridge believes these forward-looking statements are\nreasonable based on the information available on the date such statements\nare made and processes used to prepare the information, such statements are\nnot guarantees of future performance and readers are cautioned against\nplacing undue reliance on forward-looking statements. By their nature,\nthese statements involve a variety of assumptions, known and unknown risks\nand uncertainties and other factors, which may cause actual results, levels\nof activity and achievements to differ materially from those expressed or\nimplied by such statements. Assumptions regarding the expected supply of\nand demand for crude oil, natural gas, natural gas liquids and renewable\nenergy, and the prices of these commodities, are material to and underlie\nall forward-looking statements, as they may impact current and future\nlevels of demand for the Company's services. Similarly, energy transition,\nincluding the drivers and pace thereof, the COVID-19 pandemic, exchange\nrates, inflation and interest rates impact the economies and business\nenvironments in which the Company operates and may impact levels of demand\nfor the Company's services and cost of inputs, and are therefore inherent\nin all forward-looking statements. Due to the interdependencies and\ncorrelation of these macroeconomic factors, the impact of any one\nassumption on a forward-looking statement cannot be determined with\ncertainty. The most relevant assumptions associated with forward-looking\nstatements on announced projects and projects under construction, including\nestimated in-service dates, include the following: the impact of litigation\nand government, regulatory and stakeholder actions and approvals on\nconstruction and in-service schedules; the availability and price of labour\nand construction materials; the effects of inflation and foreign exchange\nrates on labour and material costs; the effects of interest rates on\nborrowing costs; technology-related matters; and the impact of weather.\n\n     Enbridge's forward-looking statements are subject to risks and\nuncertainties, including, but not limited to those risks and uncertainties\ndiscussed in this news release and in the Company's other filings with\nCanadian and United States securities regulators. The impact of any one\nrisk, uncertainty or factor on a particular forward-looking statement is\nnot determinable with certainty as these are interdependent and Enbridge's\nfuture course of action depends on management's assessment of all\ninformation available at the relevant time. Except to the extent required\nby applicable law, Enbridge assumes no obligation to publicly update or\nrevise any forward-looking statements made in this news release or\notherwise, whether as a result of new information, future events or\notherwise. All subsequent forward-looking statements, whether written or\noral, attributable to Enbridge or persons acting on the Company's behalf,\nare expressly qualified in their entirety by these cautionary statements.\n\n     About Lehigh Cement and Lehigh Hanson\n\n     Since 1956, Lehigh Cement has been an innovator, partner and\ncollaborator in advancing the cement and concrete industry, and supporting\nAlberta's economy. Lehigh Cement is an affiliated company of Lehigh Hanson,\nthe North American operations of HeidelbergCement. For more info:\n<a href=\"https://www.lehighhanson.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.lehighhanson.com</a>.\n\n     Lehigh Hanson is part of HeidelbergCement, one of the world's largest\nintegrated manufacturers of building materials and solutions, with leading\nmarket positions in aggregates, cement, and ready mixed concrete. Around\n54,000 employees at more than 3,000 locations in over 50 countries deliver\nlong-term financial performance through operational excellence and openness\nfor change. At the center of actions lies the responsibility for the\nenvironment. As forerunner on the path to carbon neutrality,\nHeidelbergCement crafts material solutions for the future.\n\n     About Enbridge Inc.\n\n     Enbridge Inc. is a leading North American energy infrastructure\ncompany. We safely and reliably deliver the energy people need and want to\nfuel quality of life. Our core businesses include Liquids Pipelines, which\ntransports approximately 25 percent of the crude oil produced in North\nAmerica; Gas Transmission and Midstream, which transports approximately 20\npercent of the natural gas consumed in the U.S.; Gas Distribution and\nStorage, which serves approximately 3.8 million retail customers in Ontario\nand Quebec; and Renewable Power Generation, which owns approximately 1,766\nMW (net) in renewable power capacity in North America and Europe. The\nCompany's common shares trade on the Toronto and New York stock exchanges\nunder the symbol ENB. For more information, visit www.enbridge.com.\n\n     FOR FURTHER INFORMATION PLEASE CONTACT:\n\n//st\n\n  Lehigh Hanson\n\n  Media &amp; Investor Relations\n\n  Jeff SiegDirector, Corporate\n  Communications972-653-6011[email protected]\n\n  Enbridge\n\n  Media                                             Investment Community\n\n  Jesse Semko                                       Jonathan Morgan\n\n  Toll Free: (888) 992-0997                         Toll Free: (800)\n                                                    481-2804\n\n  Email: [email protected]                          Email: [email\nprotected]\n\n//et\n\nTel   : 403-231-3900    ENBRIDGE INC\nFax   : 403-231-5929\nEmail : CorporateSecretary@enbridge.com\nWWW   : <a href=\"https://www.enbridge.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.enbridge.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2202500063.MNPRE2202500836-05350020220126</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}