{"date": "2021-11-30 13:00:01.262000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>\n<b>Ness Achieves Premier Partner Status in the AWS Partner Network</b>\n</p><p>\nNess, a Full-Lifecycle Digital Services Transformation company, announced today that is has achieved Premier Partner status in the Amazon Web Services (AWS) Partner Network (APN). Achieving APN Premier Partner status differentiates Ness as an AWS Partner who demonstrated expertise and notable success in helping customers design, architect, build, migrate, and manage their workloads on AWS.\n</p><p>\n“Ness is proud to achieve Premier Status in the AWS Partner Network,” said Ranjit Tinaikar, CEO. “Our mission is to help our enterprise clients in their digital transformation process and we believe that this can only be achieved by combining our industry domain expertise with depth in key technologies such as AWS. Our recognition by AWS is a testament not just to the hard work and positive results we have achieved, but also to our joint obsession with putting our clients’ successes above all else”\n</p><p>\nTo become an AWS Premier Partner, companies must complete a rigorous approval process through accreditations and certifications, must demonstrate a long-term investment in their relationship with AWS, and must have extensive expertise in deploying customer solutions on AWS. AWS Premier Partners also have a strong team of AWS Trained &amp; Certified technical consultants and have deep expertise in project management and professional services.\n</p><p>\nIn addition to the Premier Partner status within APN, Ness has the AWS DevOps, AWS Migration, and AWS Financial Services competencies. Its offerings range from small starter engagements like AWS Well Architected Reviews, AWS Immersion Days, and AWS GameDay to large-scale migrations on AWS.\n</p><p>\nNess has been engaged at Instinet, “the Original Fintech”, since 2019 to help facilitate a digital transformation and migration of core data systems on AWS. “Ness is helping us achieve our strategic plans to extend our data strategy by leveraging AWS. We’ve seen an improvement in the velocity to resolve both our short-term challenges and long-range opportunities. AWS allows Instinet to address our compute requirements by harnessing the efficiencies of on-demand computing,” said Minor Huffman, Instinet Chief Technology Officer. “It’s no surprise that they have become an AWS Premier Partner, since we’ve experienced firsthand that Ness has deep technical expertise in financial services with AWS.”\n</p><p>\n<b>About Ness</b>\n</p><p>\nNess is a full lifecycle digital engineering firm offering digital advisory through scaled engineering services. Combining our core competence in engineering with the latest in digital strategy and technology, we seamlessly manage Digital Transformation journeys from strategy through execution to help businesses thrive in the digital economy. As your tech partner, we help engineer your company’s future with cloud and data. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.ness.com%2F&amp;esheet=52541821&amp;newsitemid=20211130005150&amp;lan=en-US&amp;anchor=www.ness.com&amp;index=1&amp;md5=66ffebc1a1b7e8a1de69fce189fc1724\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.ness.com</a>.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211130005150r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTMwMDA1MTUwcjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=110e91810e9b23338942a43ff69f3652d77dcf3576a3e2f8e4c1c5139006a2c8d10daec508a0f85f8e3577ca959834af2a178c4656ccea628b32d85aecdb352f\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211130005150/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211130005150/en/</a></span></p><p>\nAngela Christoforos\n<br/>508-801-2391\n<br/><a href=\"mailto:achristoforos@greenough.biz\" data-type=\"email\" translate=\"no\">achristoforos@greenough.biz</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NJ-NESS</p></div>"}