{"date": "2022-02-18 19:12:48.985000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3093.05, "close": 3003.95}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>— <span>Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Looking to get a relaxing foot massage from the comfort of your easy chair? With the Cloud Massage shiatsu foot massager, you can—at a discount.</p></div><div class=\"tr-npp-body\"><p><span><span>Get deals and shopping advice delivered straight to your phone.</span> Sign up for text message alerts from the experts at Reviewed.</span> </p><p>Right now, Amazon is offering the device for $125 off its list price of $299.99 when you use the coupon on the product page, you can get the Cloud Massager device for $174.99. </p><p>► <span>Baby formula recall:</span>  FDA warns consumers not to use select Similac, Alimentum and EleCare</p><p>► <span>Allbirds sale:</span>  Allbirds' popular sneakers are never on sale—but right now, they're 20% off</p><p>We found the Cloud Massage device to be one of the best foot massagers we've ever tested, and the best upgrade option for those wanting the best. Both of the device's massage beds are lined with rollers covered by a lightweight microfiber that our tester described as silky and luxurious. Its most outstanding element is a rotating bar that loops around the machine to let you adjust the height and angle to set the machine to massage your feet, your ankles or your calves. </p><p>It has five different massage modes: a rolling massage, compression therapy, a sway function, heat therapy and a quiet mode. You can also adjust the intensity of each massage.</p><p>Get some real rest and relaxation with the Cloud Massage shiatsu massager—but shop fast while this coupon still applies.</p><p class=\"tr-npp-section-title\">Get the Cloud Massage Shiatsu Foot Massager Machine for $174.99 with coupon at Amazon (save $125).</p><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: The Cloud Massage foot massager is one of the best we've ever tested—get it for $125 off</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}