{"date": "2022-01-07 12:15:03.271000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3287.14, "close": 3251.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Jan. 7 -- The iPhone maker Apple has announced massive price drops in iPhone 12 series models that released in 2020.</p><p>The price cut is live on e-commerce sites Amazon and Flipkart.</p></div><div class=\"tr-npp-body\"><p>Apple announced massive price drop on iPhone 12 mini, iPhone 12 to facilitate buyers to purchase the series at a cheaper price than retail outlets.</p><p>The price drop has brought an almost Rs.10,000 difference, depending on the specific phone model.</p><p>The dual-SIM (Nano + eSIM) iPhone 12 and iPhone 12 mini are powered by Apple's A14 Bionic chip and sport Super Retina XDR OLED displays, which are protected by Apple's Ceramic Shield glass. iPhone 12 is equipped with a 6.1-inch screen, while iPhone 12 mini features a smaller 5.4-inch display.</p><p>The smartphones were launched with iOS 14 and were updated to iOS 15 in 2021.</p><p>Both the models come with a 12-megapixel dual rear cameras that include a wide-angle camera and an ultra-wide-angle camera, with an f/1.6 aperture for iPhone 12 and an f/2.4 aperture for iPhone 12 mini, respectively.</p><p>One should note that the prices may vary depending on the colour and variant one opts for.</p><p>Check the slashed prices and other details below</p><p>iPhone 12- The 64GB variant is available for a revised price of Rs.53,999 on Flipkart, while on Amazon the model is listed at Rs.63,900. The retail price of the smartphone is Rs.65,900, after Apple cut overall prices following the launch of the iPhone 13 series.The 128GB variant of iPhone 12 is listed at Rs.64,999 on Flipkart, while the price on Amazon and retail outlets is 70,900.</p><p>iPhone 12 mini- The 64GB storage variant, on Flipkart is available at a discounted price of Rs.40,999 and Rs.53,900 on Amazon. The retail price of the this model is Rs59,900.The 128GB variant is available on Flipkart at Rs.54,999.However Amazon has retained the price at which the model is available in all retail outlet, that is, Rs.64,900. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}