{"date": "2021-12-16 21:17:39.722000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3466.3, "close": 3400.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Plus, Rebag closes $33M Series E to enhance Clair technology.</p><p>Guram Gvasalia.</p></div><div class=\"tr-npp-body\"><p>Photo: Victor Boyko/Getty Images For AZ Factory</p><p>These are the stories making headlines in fashion on Wednesday.</p><p>Vetements names Guram Gvasalia creative director <a href=\"https://fashionista.com/designers/vetements\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Vetements</a> announced Guram Gvasalia as its new creative director on Wednesday. The Georgian-born co-founder of the label served as its chief executive officer since its inception, and is stepping into the role left vacant by his brother and co-founder, <a href=\"https://fashionista.com/designers/demna-gvasalia\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Demna Gvasalia</a> , in 2019. { <a href=\"https://wwd.com/fashion-news/designer-luxury/vetements-creative-director-guram-gvasalia-1235017790/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">WWD</a> }</p><p>How Shein beat Amazon Reporters Louise Matsakis, Meaghan Tobin and Wency Chen take us inside the complex ecosystem of <a href=\"https://fashionista.com/designers/shein\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Shein</a> in a new piece for Rest of World. They explore how Shein and other fast-fashion operations differ from traditional retail and how algorithm shopping is becoming second nature to us. And while the company's growth has brought with it a series of controversies, the piece acknowledges its smart approach to marketing, which has involved pouring funds into Google and Facebook advertising campaigns, influencer deals and a social-media reality show co-hosted by <a href=\"https://fashionista.com/tag/khloe-kardashian\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Khloe Kardashian</a> . { <a href=\"https://restofworld.org/2021/how-shein-beat-amazon-and-reinvented-fast-fashion/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Rest of World</a> }</p><p>Rebag closes Series E to enhance Clair technology <a href=\"https://fashionista.com/tag/rebag\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Rebag</a> announced its largest funding round to date on Wednesday, closing a $33M Series E funding round led by high-growth PE firm Novator with return participation from General Catalyst. This round brings the company's total funding raised to over $100M. The new influx of cash will go towards scaling its tech-enabled brick-and-mortar business, as well as enhancements made to its Clair Technology Suite. {Fashionista inbox}</p><p>Vacation and Poolsuite earned almost as much from NFTs as they did VCs In a new piece for Business of Fashion, Alexandra Mondalek looks at the unique approach to community marketing that the sunscreen brand Vacation, and its radio-station sister project Poolsuite, took when they dropped blockchain tokens ahead of an event at Art Basel Miami. \"With those NFTs, Vacation was not only able to attract attendees to its event and attention to its brand but raise meaningful capital. The sales totaled 624 ETH, or about $2.6 million including royalties from aftermarket sales — nearly as much as the company has raised in venture capital funding from investors,\" Mondalek writes. \"That Vacation, a brand that's still relatively unknown, could not only grab attention with its NFTs but break through the noise at one of the industry's buzziest events is a prime example of how digital metrics of engagement and success — like number of Instagram followers — are becoming less important than creating a product or service that actually offers its community value.\" { <a href=\"https://www.businessoffashion.com/articles/marketing-pr/how-these-two-brands-raised-nearly-as-much-from-nfts-as-vcs/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Business of Fashion</a> }</p><p><a href=\"https://breakingmedia.us1.list-manage.com/subscribe?u=9ddd1593650687cb23ac29940&amp;id=a23c93579d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Never miss the latest fashion industry news. Sign up for the Fashionista daily newsletter.</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Breaking Media, Inc. All rights reserved. Provided by SyndiGate Media Inc. (Syndigate.info).</p></div>"}