{"date": "2022-01-26 15:11:26.140000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MAMAMANCINI'S HOLDINGS INC (\"MMMB-Q\")\n- National Authorization with Amazon Fresh for its Branded Retail - Line\nIncluding Plant-Based Meatballs\n\n   MamaMancini's Holdings, Inc., a marketer and distributor of specialty\npre-prepared all-natural foods, today announced that it has received a\nnationwide authorization from Amazon Fresh, an online grocery delivery\nservice operated by Amazon.com, with shipments to consumers beginning in\nFebruary.\n\n   Amazon Fresh is currently available in most major U.S. cities as well as\n23 physical locations in key domestic markets. Amazon Fresh has a wide\nassortment of national brands and high-quality produce, meat and seafood,\nas well as a range of prepared foods. Items can be ordered online 24/7\nthrough the Amazon Fresh website and are available for home delivery on the\nsame day or the next day, depending on the time of the order and the\navailability of delivery slots.\n\n   Six (6) consumer-oriented products including beef meatballs and sauce,\ncheese-stuffed beef meatballs and sauce, plant-based meatballs and sauce,\nturkey meatballs and sauce, cocktail beef meatballs and sauce, and jumbo\neconomy pack beef meatballs and sauce were ordered as part of the new\nauthorization.\n\n   \"Inclusion in Amazon Fresh's invitation-only family of online and\nin-store grocery products - part of the largest e-commerce retailer in the\nworld - is a highly promising milestone in MamaMancini's direct-to-consumer\nbusiness,\" said Carl Wolf, Chairman and Chief Executive Officer of\nMamaMancini's. \"Online grocery sales are expected to represent 20% of the\noverall U.S. grocery retail market in the next five years, significantly\naccelerated by consumer trends resulting from the COVID-19 pandemic,\naccording to a new Mercatus/Incisiv study.\n\n   \"In addition to its ongoing home delivery or in-store pick up offerings,\nAmazon Fresh started opening brick-and-mortar grocery stores in new markets\nin 2021 and is rapidly announcing new locations. While initial shipments\nwill be modest, we see a significant long-term opportunity in further\npenetration as Amazon Fresh scales operations nationwide. I look forward to\nserving its large base of satisfied customers, helping to build sustainable\nvalue for all stakeholders,\" concluded Wolf.\n\n   About MamaMancini's Holdings, Inc.\n\n   MamaMancini's Holdings, Inc. (NASDAQ: MMMB) is a marketer and\ndistributor of specialty pre-prepared, all-natural foods. MamaMancini's\nbroad product portfolio consists of meatballs, meat loaf, sausages and\npasta bowls with beef, turkey, chicken and pork varieties - as well as an\nassortment of chicken-based dishes, olives, savory products and salads\nthrough its T&amp;L Creative Salads and Olive Branch subsidiaries. The\nCompany's products are sold in over 45,000 locations nationwide, including\nat regional delis and well-known retailers such as Sam's Club, ALDI\nMarkets, Schnuck Markets, Whole Foods, Publix, ShopRite, Stop &amp; Shop,\nCostco and Albertsons - as well as through national distributors such as\nSysco and United Natural Foods. The Company also maintains a\ndirect-to-consumer presence on QVC and through Amazon Fresh. For more\ninformation, please visit www.mamamancinis.com.\n\n   Forward-Looking Statements\n\n   This press release may contain \"forward-looking statements\" within the\nmeaning of Section 27A of the Securities Act of 1933, as amended, and\nSection 21E of the Securities Exchange Act of 1934. \"Forward-looking\nstatements\" describe future expectations, plans, results, or strategies and\nare generally preceded by words such as \"may,\" \"future,\" \"plan\" or\n\"planned,\" \"will\" or \"should,\" \"expected,\" \"anticipates,\" \"draft,\"\n\"eventually\" or \"projected.\" You are cautioned that such statements are\nsubject to a multitude of risks and uncertainties that could cause future\ncircumstances, events, or results to differ materially from those projected\nin the forward-looking statements, including the risks that actual results\nmay differ materially from those projected in the forward-looking\nstatements as a result of various factors, and other risks identified in\nthe Company's 10-K for the fiscal year ended January 31, 2021 and other\nfilings made by the Company with the Securities and Exchange Commission.\n\nLucas A. Zimmerman\nDirector\nMZ Group - MZ North America\n(949) 259-4987\nMMMB@mzgroup.us\nwww.mzgroup.us\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2202500355.MNPRE2202501614-07020120220126</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}