{"date": "2021-12-01 14:47:49+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.presidio.com/presidios-comprehensive-managed-detection-and-response-cybersecurity-defense-platform-now-listed-in-aws-marketplace/#respond\" data-type=\"url\" class=\"tr-link\" translate=\"no\">0</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.presidio.com/presidios-comprehensive-managed-detection-and-response-cybersecurity-defense-platform-now-listed-in-aws-marketplace/#\" data-type=\"url\" class=\"tr-link\" translate=\"no\">0</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.presidio.com/cybersecurity-leader-dan-lohrmann-joins-presidio-as-new-field-chief-information-security-officer/\" data-type=\"url\" class=\"tr-link\" translate=\"no\"></a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.presidio.com/category/news/\" data-type=\"url\" class=\"tr-link\" translate=\"no\"></a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.presidio.com/presidio-crowdstrike-and-aws-team-up-to-reduce-ransomware-attacks-with-new-ransomware-mitigation-kit/\" data-type=\"url\" class=\"tr-link\" translate=\"no\"></a>\n                    </span>\n                  </div>\n                  <div>\n                    <span>By Presidio</span>\n                    <span>\n                      <a href=\"https://www.presidio.com/category/news/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">News</a>\n                    </span>\n                    <span>December 1, 2021</span>\n                  </div>\n                </div>\n                <p>\n                  <span>Automated cybersecurity defense and industry-leading threat intelligence is easily available with Presidio MDR</span>\n                </p>\n                <p>\n        December 1, 2021, NEW YORK, NY - With new cybersecurity threats constantly emerging, <a href=\"https://www.presidio.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Presidio, Inc</a>., a global digital services and solutions provider, today announced its new Presidio <a href=\"https://aws.amazon.com/marketplace/pp/prodview-7yxzbucpaqs7q?ref_=srh_res_product_title\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Managed Detection and Response (MDR)</a>has been selected by Amazon Web Services (AWS) for its end-to-end cybersecurity protection and is now listed in AWS Marketplace.\n      </p>\n                <p>\n        Presidio MDR combines an automated and significantly faster approach to threat mitigation with the depth and power of Presidio Threat Strike Team, an expert team of cybersecurity professionals. By aligning with multiple security frameworks, Presidio MDR ensures the right coverage for end-to-end threat mitigation across the entire infrastructure. It monitors the constantly changing landscape, can detect a threat and automatically initiate protective action in seconds and learns to protect against emerging threats. Top advantages include:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          End-to-end protection through the Presidio Threat Engine that aims to deliver end-to-end visibility to security threats across on-premise and AWS infrastructure\n        </li>\n                  <li>\n          Active Response takes immediate actions can be automated from disabling accounts, removing phishing emails, adding/removing indicators from whitelist or blacklists, quarantining endpoints and more\n        </li>\n                  <li>\n          Actionable insights include a real-time dashboard that consolidates important threat/risk alerts in one place for faster and more accurate diagnosis and simplified remediation planning\n        </li>\n                  <li>\n          Fast customizable deployment and fully managed services include the highly skilled Presidio Threat Strike Team\n        </li>\n                </ul>\n                <p>\n        \"Cyber threats are an epidemic that can be extremely costly and are a top concern of any technology organization, yet many of them don't have the right staffing or expertise to sort through and implement the right solution for them,\" said Dave Trader, Field CISO, Client Advisor at Presidio. \"AWS is a leading cloud vendor and we're excited to have our MDR solution selected by them to be available to their customers in AWS Marketplace.\"\n      </p>\n                <p>\n        The Presidio Cybersecurity Practice covers a broad security services portfolio. Highly skilled and tenured cybersecurity practitioners maintain leading industry certifications, provide thought leadership and practical industry experience. The team has conducted thousands of engagements across all major industry segments.\n      </p>\n                <p>\n                  <strong>About Presidio</strong>\n                </p>\n                <p>\n        Presidio is a global digital services and solutions provider accelerating business transformation through secured technology modernization. Extensive teams of engineers and solutions architects with deep expertise across cloud, security, networking and modern data center infrastructure help customers acquire, deploy and operate technology that delivers impactful business outcomes. Presidio is a trusted strategic advisor with a flexible full life cycle model of professional, managed, and support and staffing services to help execute, secure, operationalize and maintain technology solutions. For more information visit <a href=\"http://www.presidio.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.presidio.com</a>.\n      </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.presidio.com/presidios-comprehensive-managed-detection-and-response-cybersecurity-defense-platform-now-listed-in-aws-marketplace/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Presidio Inc.</strong> published this content on <strong>01 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>01 December 2021 14:47:49 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Presidio Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Presidio-Inc.</p></div>"}