{"date": "2021-11-14 19:44:21.228000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Concept: Amazon has launched a cloud service named Lookout for Vision to detect anomalies and defects in manufactured products. Available in select Amazon Web Services (AWS) regions with the AWS console and supporting partners, the solution leverages computer vision and can train an AI model using few baseline images.</p><p>Nature of Disruption: Lookout for Vision applies AI to detect manufacturing and production anomalies. Defects include cracks, dents, incorrect color and irregular shape in products from their appearance. The solution can compute a huge volume of images per hour and needs no upfront commitment or minimum fee. To use the service, customers can pay per hour to train the model and detect anomalies or defects. Next, Lookout for Vision reports the analyzed image data deviating from the baseline on the service dashboard or a real-time API. Amazon has developed Lookout for Vision to be able to maintain accuracy with variances in camera angle, pose, and lighting due to varied work environments. Customers are empowered to give feedback on the results and whether a prediction has accurately identified an anomaly and Lookout for Vision will automatically retrain the rudimentary model so the service improves continuously.Outlook: Guaranteeing the best quality products is fundamental to all manufactured products. Amazon Lookout for Vision ensures superior quality control in industrial pipelines to customers of all sizes and across all industries by quickly and cost-effectively detecting anomalies at scale to save time and money while maintaining the best quality.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}