{"date": "2022-01-04 12:49:06+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>WONDERFI TECHNOLOGIES INC (\"WNDR-V\")\n- To Acquire Bitbuy, Canada's First Approved Crypto Marketplace\n- with Over $4.4B Transacted\n\n     WonderFi Technologies Inc. (the \"Company\" or \"WonderFi\") announced\nthat it has entered into a definitive agreement to acquire First Ledger\nCorp., the parent company of Bitbuy Technologies Inc. (\"Bitbuy\"), a leading\ncryptocurrency platform and the first approved crypto marketplace in\nCanada. The acquisition and integration will establish WonderFi as a\nleading end-to-end consumer platform for people seeking access to crypto\nand decentralized finance (\"DeFi\").\n\n     \"The integration of WonderFi and Bitbuy is a huge step forward in our\nmission of democratizing finance through easy and secure access to DeFi and\ncrypto,\" said Ben Samaroo, CEO of WonderFi. \"A licensed marketplace serves\nas a crucial gateway to the digital asset economy, and facilitates a robust\nend-to-end, unified client experience. The integration of Bitbuy's product\nsuite will accelerate and expand the reach and scope that WonderFi can\noffer to the market, and will drive long-term growth and value for the\nCompany.\"\n     Bitbuy was founded in 2016 and has grown to become one of North\nAmerica's leading crypto marketplaces. Today, Bitbuy is a trusted execution\nplatform that services over 375,000 users, with more than $4.4 billion\ntransacted through the platform.\n\n     In November 2021, Bitbuy became Canada's first approved crypto\nmarketplace, and was recently ranked 9th in the Deloitte Technology Fast\n50(TM) program, with 3,379% in revenue growth from 2017 to 2020 making it\nthe highest-ranking crypto asset trading platform amongst the Fast 50\nwinners. In the twelve months ended September 30, 2021, Bitbuy generated\nover $31.0 million in revenue.\n\n     Kevin O'Leary, globally renowned investor, ambassador and strategic\nadvisor to WonderFi commented: \"this is a combination of two management\nteams with excellent executional skills that now have the bandwidth, assets\nand licenses to provide an institutional grade compliant crypto platform to\ninvestors interested in exposure to centralized and decentralized financial\nservices.\"\n\n     \"This transaction represents an exciting new chapter for Bitbuy,\" said\nDean Skurka, President and CFO of Bitbuy. \"The alignment with WonderFi's\ntalented team, along with numerous operational synergies, represents\nopportunities for future growth we can collectively share with our clients,\nstaff and shareholders.\"\n\n     Key Transaction Benefits\n\n//st\n\n  * In-houses one of Canada's fastest growing crypto platforms with leading\nmarket share in BTC/CAD and ETH/CAD and a demonstrated history of material\nrevenue growth\n  * Introduces multiple new business lines to WonderFi, including an\napproved crypto marketplace and OTC business which services both retail and\ninstitutional clients\n  * Introduces a strong front-end business line to WonderFi, enabling\nlicensed fiat on-ramp and platform to a growing Canadian market segment\n  * Adds over 375,000 registered users to the WonderFi ecosystem and over\n$455 million of assets under custody as at December 31, 2021.\n  * Presents the ability to bring new features, offerings and functionality\nto an existing user base on the Bitbuy platform\n  * Establishes WonderFi as the owner and operator of the first crypto\nmarketplace license in Canada\n  * Accelerates product development capabilities and scaling potential by\nadding over 80 staff including engineers and other personnel\n  * Material revenue and cost synergies expected via user base integration,\ncross selling services and a combined global offering\n//et\n\n     Transaction Details\n\n     Under the terms of the agreement, the consideration to Bitbuy\nshareholders will consist of 70 million newly issued common shares of\nWonderFi, $20 million in upfront cash and $30 million in deferred cash via\na vendor-takeback note due in 12 months, implying an aggregate transaction\nvalue of approximately $206 million. WonderFi will use its balance sheet to\nfund the cash consideration.\n\n     WonderFi will retain substantially all current Bitbuy employees and\nenter into employment agreements with key members of the management team.\nUpon closing, WonderFi will appoint one Bitbuy nominee as an independent\nmember of WonderFi's Board of Directors and, at the next annual meeting of\nshareholders, will nominate Dean Skurka to the Board. Mark Binns resigned\nfrom the WonderFi Board of Directors effective January 3, 2022.\n\n     The transaction has been approved by the boards of directors of both\nWonderFi and Bitbuy. The acquisition is expected to close in the first\nquarter of 2022, subject to approval by WonderFi and Bitbuy shareholders,\nas well as certain related matters and other acquisition-related closing\nconditions and regulatory approvals. WonderFi and Bitbuy have received\nvoting support agreements for the transaction from the holders of more than\ntwo-thirds of all classes of Bitbuy shares.\n\n     Advisors\n\n     Cassels Brock &amp; Blackwell LLP is acting as legal advisor to WonderFi\non this transaction and Haywood Securities Inc. provided a fairness opinion\nto the Board of Directors of WonderFi. Canaccord Genuity Corp. is acting as\nfinancial advisor and Chitiz Pathak LLP and Wildeboer Dellelce LLP are\nacting as legal advisors to Bitbuy on this transaction.\n\n     Additional Information\nFor additional information, please contact:\n\n     WonderFi Technologies Inc.\nBen Samaroo, CEO\nben@wonder.fi\n(778) 843-9637\n\n     Investor Relations Contact: invest@wonder.fi\nMedia Contact: press@wonder.fi\n\n     Bitbuy Technologies Inc.\nDean Skurka, President\ndean@bitbuy.ca\n\n     Media Contact: binu.koshy@bitbuy.ca\n     ABOUT WONDERFI\n\n     WonderFi is a leading technology company with the mission of creating\nbetter access to DeFi through the core principles of simplicity and\neducation. WonderFi has a multi-pronged business strategy which includes a\nhigh-growth consumer finance app which will serve as a trusted gateway to\nthe new financial system, and a digital asset portfolio which consists of\nleading crypto and DeFi assets. WonderFi's executive team and Board of\nDirectors have an established track record in finance and crypto, with\nprevious experience at Amazon, Shopify, PayPal, Galaxy Digital and Hut 8.\nWonderFi's core team of engineers and technologists believe that everyone\nshould have equal access to finance, and are aligned in the mission to\nempower people around the world to access DeFi in a simple, smart and\nsecure way. For more information, visit www.wonder.fi.\n\n     ABOUT BITBUY\n\n     Bitbuy is a Canadian owned and operated digital asset marketplace and\nrestricted dealer.  Bitbuy's mission is to provide its clients the best\nglobal prices, the deepest liquidity, and the most digital asset products\nin Canada with a convenient, dependable, and secure platform. Bitbuy is\nproudly registered as a restricted dealer and is Canada's first registered\ndigital asset marketplace in Canada. Bitbuy's head office is in downtown\nToronto, with over 85 employees. In addition to its registration as a\nMarketplace and Restricted Dealer, Bitbuy is also registered with FINTRAC\nas a Money Services Business under the Virtual Asset Service Provider\ncategory. Bitbuy was founded in 2016 and is currently one of Canada's\nlargest cryptocurrency platforms by trading volume. Bitbuy offers crypto\ntrading services to beginners, advanced traders, and corporations making it\nThe crypto destination of investors.TM\n\n     Forward-Looking Information and Statements\n\n     This press release contains certain \"forward-looking information\"\nwithin the meaning of applicable Canadian securities legislation and may\nalso contain statements that may constitute \"forward-looking statements\"\nwithin the meaning of the safe harbor provisions of the United States\nPrivate Securities Litigation Reform Act of 1995. Such forward-looking\ninformation and forward-looking statements are not representative of\nhistorical facts or information or current condition, but instead represent\nonly the Company's beliefs regarding future events, plans or objectives,\nmany of which, by their nature, are inherently uncertain and outside of the\nCompany's control. Generally, such forward-looking information or\nforward-looking statements can be identified by the use of forward-looking\nterminology such \"could\", \"intend\", \"expect\", \"believe\", \"will\",\n\"projected\", \"estimated\", or variations of such words, and includes the\nanticipated benefits of the transaction, the ability of the Company and\nBitbuy to obtain all necessary shareholder and regulatory approvals, and\nthe ability of the Company and Bitbuy to close the transaction on the terms\nand timing described herein, or at all.\n\n     By identifying such information and statements in this manner, the\nCompany is alerting the reader that such information and statements are\nsubject to known and unknown risks, uncertainties and other factors that\nmay cause the actual results, level of activity, performance or\nachievements of the Company to be materially different from those expressed\nor implied by such information and statements. In addition, in connection\nwith the forward-looking information and forward-looking statements\ncontained in this press release, the Company has made certain assumptions.\nAmong the key factors that could cause actual results to differ materially\nfrom those projected in the forward-looking information and statements are\nthe following: the inability of the Company and Bitbuy to integrate\nsuccessfully such that the anticipated benefits of the transaction are\nrealized, the inability of the Company and Bitbuy to obtain the necessary\nregulatory and shareholder approvals for the transaction, the inability of\nthe Company and Bitbuy to close the transaction on the terms and timing\ndescribed herein, or at all, the inability of the Company to work\neffectively with strategic investors; and material adverse changes in\ngeneral economic, business and political conditions, including changes in\nthe financial markets, changes in applicable laws, and compliance with\nextensive government regulation. Should one or more of these risks,\nuncertainties or other factors materialize, or should assumptions\nunderlying the forward-looking information or statements prove incorrect,\nactual results may vary materially from those described herein.\n\n     Although the Company believes that the assumptions and factors used in\npreparing, and the expectations contained in, the forward-looking\ninformation and statements are reasonable, undue reliance should not be\nplaced on such information and statements, and no assurance or guarantee\ncan be given that such forward-looking information and statements will\nprove to be accurate, as actual results and future events could differ\nmaterially from those anticipated in such information and statements. The\nforward-looking information and forward-looking statements contained in\nthis press release are made as of the date of this press release, and the\nCompany does not undertake to update any forward-looking information and/or\nforward-looking statements that are contained or referenced herein, except\nin accordance with applicable securities laws. All subsequent written and\noral forward- looking information and statements attributable to the\nCompany or persons acting on its behalf is expressly qualified in its\nentirety by this notice.\n\n     Neither NEO Exchange nor its Regulation Services Provider (as that\nterm is defined in policies of the NEO Exchange) accepts responsibility for\nthe adequacy or accuracy of this news release.\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200300057.MNPRE2200300587-04472620220104</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}