{"date": "2021-12-16 20:45:53.884000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3466.3, "close": 3400.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Levels of plastic pollution caused by online retailer Amazon's deliveries increased by 29% over the course of one year, according to a report from non-profit ocean conservation organisation Oceana.</p><p>The report revealed that up to 23.5 million pounds of the retailer's plastic packaging found its way into waterways and oceans last year, in turn polluting the world's water bodies.Surveying 1,400 Amazon Prime customers across 25 cities, Oceana found that only 39% of the respondents delivered plastic from their packages into municipal recycling bins, while 91% of the respondents urged Amazon to cut down the use of plastic packaging.Oceana said that this proved Amazon's recycling promises were not helping to reduce plastic pollution.Oceana Strategic Initiatives senior vice-president Matt Littlejohn said: \"Our report found that Amazon's plastic packaging pollution problem is growing at a frightening rate at a time when the oceans need corporate leaders like Amazon to step up and meaningfully commit to reducing their use of single-use plastic.\"Amazon has shown it can do this in large markets like India and Germany. It now needs to commit to doing so worldwide.\"The advocacy group has urged Amazon to commit to cutting down its use of plastic packaging across the world, as it has already done in Germany and India.In a statement, an Amazon spokesperson said: \"Amazon shares Oceana's ambition to protect the world's oceans and respects their work but, for a second year, their calculations are seriously flawed.\"They have overestimated our plastics usage by more than 300% and use outdated assumptions about the sources of plastic waste entering our oceans.\"The latest peer-reviewed scientific research finds that the majority of plastic waste that ends up in the ocean comes primarily from takeaway food and drink and fishing activities.\"Last month, Amazon pledged to reduce its use of plastic packaging in Germany by the end of the year.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}