{"date": "2022-01-25 06:43:32+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Aditya Kalra</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW DELHI, Jan 25 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>India's Future Group on Tuesday challenged its own lenders in the Supreme Court in a bid to avoid being named a defaulter for missing payments, citing its ongoing dispute with partner Amazon.com Inc, according to a legal filing seen by Reuters.</p><p>Future, the country's second-largest retailer, has since 2020 <a href=\"https://reut.rs/3nHvlsU\" data-type=\"url\" class=\"tr-link\" translate=\"no\">failed to complete</a> its $3.4 billion retail asset sale to a rival due to a row with Amazon, which argues the Indian group violated certain non-compete contractual terms the two sides had. Future denies any wrongdoing.</p><p>Future told Indian exchanges this month it was unable to pay 35 billion rupees ($470 million) it owed to its lenders on Dec. 31 as it could not sell certain small stores due to the dispute with Amazon. It had hoped to use a 30-day grace period to resolve the situation.</p><p>In its filing on Tuesday, Future urged the Supreme Court to ask lenders and the country's central bank to grant more time to execute the sale. Reuters is the first to report the petition, which is not public. </p><p>Future's main retail arm, Future Retail, also asked judges to quash default notices it had received from its lenders, including the State Bank of India, warning of action against the company.    </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Aditya Kalra in New Delhi; Editing by Sanjeev Miglani)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:aditya.kalra@tr.com\" data-type=\"email\" translate=\"no\">aditya.kalra@tr.com</a> ; +91-11-49548021; Twitter <a href=\"https://twitter.com/adityakalra\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/adityakalra</a>; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-INDIA/FUTURE-RELIANCE (PIX)</p></div>"}