{"date": "2021-12-07 19:42:02.577000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>TENABLE HOLDINGS INC (\"TENB-Q\")\n- Introduces Tenable.cs to Provide Security from Code to Cloud\n\n     Tenable(R), Inc., the Cyber Exposure company, announced the release of\nTenable.cs, adding new cloud-native security capabilities to its platform.\nComing on the heels of its acquisition of Accurics, Tenable.cs enables\norganizations to accelerate innovation by aligning development, operational\nand security teams behind security and resiliency goals.\n\n     With the release of Tenable.cs, Tenable will help organizations\nprotect the full cloud-native stack throughout the DevOps lifecycle, from\nthe time applications and infrastructure are defined in code through\nproduction usage. Tenable.cs scans Infrastructure as Code (IaC) to detect\nand remediate any flaws, policy violations and potential breach paths\nbefore provisioning to the cloud infrastructure.\n\n     Implementing secure and compliant IaC is a cornerstone to aligning\nDevOps, security and compliance, which helps prevent cloud security risk,\nimprove developer productivity and ultimately strengthen security and\ncompliance. DevOps and security teams today face the challenge of \"staying\nin their lanes\" while attempting to effectively collaborate without\nimpeding innovation. This pursuit is further complicated by cloud-native\nenvironments that are ever evolving and increasing in complexity.\n\n     Tenable.cs brings the Accurics platform into the Tenable ecosystem,\ngiving teams pragmatic, real-world solutions from build through runtime.\nThe solution also delivers a best practices framework that unites DevOps\nand Security teams so companies can innovate in the cloud with confidence.\n\n     \"Tenable.cs expands our capabilities further into the cloud stack,\"\nsaid Nico Popp, chief product officer, Tenable. \"Our aim is to enable\norganizations to embrace both the technical and cultural change that is\nDevSecOps. This is a natural evolution as services increasingly leverage\nthe cloud and IaC. By analyzing this codified state of cloud environments,\nwe enable users to shift security left and address misconfigurations and\nvulnerabilities before they are deployed.\"\n\n     This inaugural release of Tenable.cs builds on established Accurics\ncapabilities by optimizing the user experience, enhancing runtime\ncapabilities and reporting and enabling tighter integration with\ndevelopment workflows.\n\n     *  Optimized user experience:       *  Unified management console for\nmultiple control planes including code repositories, cloud accounts,\nKubernetes clusters &amp; CI/CD or GitOps pipelines\n     *  A streamlined user experience for configuring complex AWS, Azure\nand GCP environments and projects\n     *  A new low code security policy editor which simplifies management\nof policy logic while eliminating the need to learn another policy language\n\n     *  Enhanced runtime capabilities and reporting:       *  Continuous\nmonitoring of AWS configuration changes, enabling real-time management of\ncloud posture\n     *  Comprehensive posture management for Kubernetes applications,\nincluding detecting configuration drifts in Kubernetes runtime\ninfrastructure\n\n     *  Tighter integration with development workflows:       *  Improved\nintegration into development pipelines, including new policies for\napplication vulnerabilities and the ability to enforce policies during\nbuild time\n     *  Kubernetes policy guardrails based on recent NSA &amp; CISA Kubernetes\nHardening Guidance\n\n     For more information about Tenable.cs, visit\ntenable.com/products/tenable-cs.\n\n     About Tenable\nTenable(R), Inc. is the Cyber Exposure company. Over 30,000 organizations\naround the globe rely on Tenable to understand and reduce cyber risk. As\nthe creator of Nessus(R), Tenable extended its expertise in vulnerabilities\nto deliver the world's first platform to see and secure any digital asset\non any computing platform. Tenable customers include more than 50 percent\nof the Fortune 500, more than 30 percent of the Global 2000 and large\ngovernment agencies. Learn more at www.tenable.com.\n\n Contact Information:\n\nContact:Tenable\ntenablepr@tenable.com\n\nTel   : 410-872-0555    TENABLE HOLDINGS INC\nEmail : investors@tenable.com\nWWW   : <a href=\"https://www.tenable.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.tenable.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134000430.MNPRE2134002595-09234720211207</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}