{"date": "2021-12-14 05:16:00.137000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>AWS Launches Region in Indonesia</b>\n</p><p class=\"bwalignc\">\n<span>New AWS Asia Pacific (Jakarta) Region allows customers to run workloads and securely store data in Indonesia while serving end users with even lower latency</span>\n</p><p class=\"bwalignc\">\n<span>Newly released AWS economic impact study estimates that the new AWS Region will create 24,700 direct and indirect jobs through a planned investment of $5 billion (IDR$71 trillion) in Indonesia over the next 15 years</span>\n</p><p class=\"bwalignc\">\n<span>Hundreds of thousands of customers across Asia Pacific are innovating on AWS, including Halodoc, MNC Group, Optik Melawai, PT Pos Indonesia, Shipper, and XL Axiata</span>\n</p><p>\nAmazon Web Services, Inc., an Amazon.com, Inc. company (NASDAQ: AMZN), today announced the launch of the AWS Asia Pacific (Jakarta) Region. Starting today, developers, startups, entrepreneurs, and enterprises as well as government, education, and nonprofit organizations can run their applications and serve end users from data centers located in Indonesia leveraging advanced AWS technologies to drive innovation. AWS also released an economic impact study (EIS) estimating that the company’s spending on the construction and operation of the new AWS Asia Pacific (Jakarta) Region will create 24,700 direct and indirect jobs with an estimated $5 billion (IDR$71 trillion) in planned investment in the local economy. The Region will also add an estimated $10.9 billion (IDR$155 trillion) over the next 15 years to Indonesia’s Gross Domestic Product (GDP). For more information about AWS Global Infrastructure, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fabout-aws%2Fglobal-infrastructure%2F&amp;esheet=52549184&amp;newsitemid=20211212005164&amp;lan=en-US&amp;anchor=aws.amazon.com%2Fabout-aws%2Fglobal-infrastructure&amp;index=1&amp;md5=2ac20ef2c851bf3c00c7f63d6b7c480e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com/about-aws/global-infrastructure</a>.\n</p><p>\n“The cloud provides organizations of all types and sizes—from businesses to educational institutions to government agencies—opportunities to transform their operations and reinvent experiences for their customers and end users,” said Prasad Kalyanaraman, Vice President of Infrastructure Services at AWS. “AWS is excited to announce our new Region in Asia Pacific and help Indonesian institutions, innovative startups, and world-leading companies deliver cloud-powered applications to fuel economic development across the country. Organizations across industries in Indonesia can now take advantage of the AWS Asia Pacific (Jakarta) Region to lower costs, increase agility, and drive innovation.”\n</p><p>\n“Infrastructure from the world’s leading cloud provider plays a critical role in accelerating our digital economy,” said Perry Warjiyo, Governor of Bank Indonesia, the nation’s central bank. “We expect that AWS’s cloud technology will help us achieve our vision and goals outlined in the Indonesia Payment Systems 2045 blueprint, fully digitalizing the nation’s payment systems and integrating a multitude of stakeholders and economic activities under the guiding principles of security and data protection.”\n</p><p>\nWith the launch of the AWS Asia Pacific (Jakarta) Region, AWS has 84 Availability Zones across 26 geographic regions globally, with announced plans to launch 24 more Availability Zones and eight more AWS Regions in Australia, Canada, India, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. AWS Regions are composed of Availability Zones that place infrastructure in separate and distinct geographic locations. Availability Zones are located far enough from each other to support customers’ business continuity but near enough to provide low latency for high availability applications that use multiple Availability Zones. Each Availability Zone has independent power, cooling, and physical security and is connected through redundant, ultra-low latency networks. AWS customers focused on high availability can design their applications to run in multiple Availability Zones to achieve even greater fault tolerance. The launch of an AWS Region in Indonesia provides customers with even lower latency across the country and supports disaster recovery applications for business continuity.\n</p><p>\nAWS is planning to invest an estimated $5 billion (IDR$71 trillion)<span> </span>in Indonesia over the next 15 years through the new AWS Asia Pacific (Jakarta) Region, which includes capital expenditures on the construction of data centers, operational expenses related to ongoing utilities and facility costs, and purchases of goods and services from regional businesses. The investment is also estimated to sustain an average of 24,700 direct and indirect jobs annually during this time. These jobs will be part of the AWS supply chain in Indonesia, including construction, facility maintenance, engineering, telecommunications, and jobs within the broader Indonesian economy. The construction and operation of AWS infrastructure in Indonesia is also estimated to add over $10 billion (IDR$155 trillion) to Indonesia’s GDP over the next 15 years.\n</p><p>\n<b>Customers and AWS Partners welcome the news of the AWS Asia Pacific (Jakarta) Region</b>\n</p><p>\nCustomers in Indonesia join millions of active customers using AWS every month in over 190 countries around the world to accelerate innovation, increase agility, and drive cost savings. Organizations across Indonesia that have moved their mission-critical workloads to the cloud include Adskom, Amartha, Anter Aja, ASEAN Foundation, Bhinekka, Bizzy, Bridestory, Bank Commonwealth Indonesia, Dinas Komunikasi dan Informatika Jawa Barat, Elevenia, FinAccel, Happyfresh, Haldin, Hara Token, Halodoc, Jawa Pos, Kumparan, Kompas, Lion Air, MNC Group, Mamikos, Optik Melawai, Optik Seis, Sayurbox, Sekolah.mu, Shipper, SiCepat, Simak Online, Sociolla, The Body Shop, Tokopedia, Traveloka, and XL Axiata.\n</p><p>\nMNC Group, an Indonesian multinational conglomerate in the media, financial services, entertainment hospitality, ecommerce, and other digital businesses, picked AWS as its preferred cloud provider to further drive its digital transformation and improve customer experience. “AWS Cloud capabilities successfully drive the performance of MNC Portal Indonesia, providing unparalleled experience for its viewers. We have transformed our media business with AWS and are now looking to repeat this success with our digital financial services business,” said Yudi Hamka, CTO of MNC Group. “We are looking forward to using advanced AWS capabilities like analytics and machine learning to better understand our customers, predict future trends and preferences, and solve their financial challenges in a more meaningful way. The AWS Asia Pacific (Jakarta) Region will be instrumental in achieving this by providing the highest levels of security at reduced latency, which is of paramount importance for the financial services industry.”\n</p><p>\nPT Pos Indonesia (Persero), provider of the nation’s postal services, works with AWS as part of its digitalization journey. “The AWS Asia Pacific (Jakarta) Region will help us align and digitally transform our business and social priorities to provide more efficient public services for the benefit of all Indonesians,” said Dr. Faizal Rochmad Djoemadi, CEO of PT Pos Indonesia (Persero). “The digitization and automation of traditional processes, along with business expansion enabled by digital applications, will play a huge role in PT Pos Indonesia (Persero)’s future strategy. PT Pos Indonesia (Persero) plans to move its critical and core workloads including digital money transfer to AWS in the AWS Asia Pacific (Jakarta) Region.”\n</p><p>\nRuparupa.com is one of the leading online shopping sites in Indonesia with over 700,000 customers in the country. The site combines online and conventional shopping experiences with STOPS (Store Pick Up Service), allowing customers to shop online and collect orders at selected stores throughout Indonesia. \"Our ecommerce platform is growing rapidly as the COVID-19 pandemic has encouraged more consumers to shop online, and with the scalability of AWS, we can easily handle this rising demand,\" said Ronny Winoto, CTO of Ruparupa.com. \"We're already running the majority of our infrastructure on the world's leading cloud, and by tapping into the AWS Asia Pacific (Jakarta) Region, we can further improve our customer experience with innovative ecommerce services.\"\n</p><p>\nHalodoc, a Jakarta-based health-tech startup running on AWS, is supporting Indonesia’s national COVID-19 vaccination, testing, and telemedicine initiatives. “COVID-19 has pushed many to look for alternative, remotely accessible health care services. When our traffic soared significantly at the start of the pandemic, we were confident we could weather the challenges because of the solid extended team that includes AWS. Currently, we are also exploring other AWS technologies, such as machine learning, to elevate the user experience when using our application,” said Alfonsius Timboel, Chief Product Officer of Halodoc. “The availability of the AWS Asia Pacific (Jakarta) Region helps us meet our mission to make quality health care accessible to all through our network of 20,000 licensed doctors, 2,000 hospitals/clinics/labs, and 4,000 registered pharmacies, which are spread across hundreds of cities in Indonesia and connected by our digital platform that uses AWS’s reliable technology.”\n</p><p>\nTokopedia, an Indonesian technology company and a leading online marketplace with over 100 million monthly active users and 11 million merchant partners, entrusts its mission-critical workloads to AWS. “Indonesia is seeing a surge in digital adoption and accelerated growth in ecommerce. Cloud services, such as AWS, reduce the heavy lifting needed to manage infrastructure and enable us to focus on our customers’ needs. The AWS Asia Pacific (Jakarta) Region will allow us to continue to focus on building and strengthening our business capabilities while using the best technology in terms of core computing and technology infrastructure to serve the needs of our business and customers,” said Herman Widjaja, CTO of Tokopedia.\n</p><p>\nThe AWS Partner Network (APN) includes tens of thousands of independent software vendors (ISVs) and systems integrators (SIs) around the world. AWS Partners build innovative solutions and services on AWS, and the APN provides business, technical, marketing, and go-to-market support to customers. AWS SIs, consulting partners, and ISVs help enterprise and public sector customers migrate to AWS, deploy mission-critical applications, and provide a full range of monitoring, automation, and management services for customers’ cloud environments. Examples of AWS Partners in Indonesia include Metrodata, PT Berca Hardayaperkasa, PT Innovation Cloud Services (ICS Compute), Salesforce, and many others. For the full list of AWS Partners, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fpartners&amp;esheet=52549184&amp;newsitemid=20211212005164&amp;lan=en-US&amp;anchor=aws.amazon.com%2Fpartners&amp;index=2&amp;md5=36bab5d595b8f10d128752019068809e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com/partners</a>.\n</p><p>\nPT Innovation Cloud Services (ICS Compute) is a cloud consulting and systems integration firm. “AWS provides us with a Well-Architected Framework to optimize time, costs, and the quality of the services we deliver. As a result, our sales value has grown 19 times since we founded the company,\" said Budhi Wibawa, founder and CEO of ICS Compute. \"With the new AWS Asia Pacific (Jakarta) Region, we look forward to helping our customers scale their innovation and accelerate growth. The Region launch further improves the security, scalability, flexibility, and reliability we offer to our 115-plus enterprise customers, including getplus and e-wallet mobile app LinkAja!. AWS’s continuous innovation and infrastructure investments will also enable us to expand our business and help drive the growing tech community in Indonesia by hiring and training more cloud professionals to further support the local workforce.”\n</p><p>\nLeading global customer relationship management (CRM) platform, Salesforce, is planning to accelerate the digital transformation of their Indonesian customer base with the new AWS Asia Pacific (Jakarta) Region. “We are excited to combine AWS's cloud services with our trusted Hyperforce platform to empower Indonesian companies, from startups to enterprises, to sell, service, market, and conduct commerce,” said Sujith Abraham, Senior Vice President and General Manager, ASEAN at Salesforce. “AWS’s continuous investments in new infrastructure Regions bring our Hyperforce platform to markets that are new to us like Jakarta, enabling customers to securely deploy Salesforce apps and services from anywhere with the scale and agility of the AWS Cloud.\"\n</p><p>\n<b>AWS Investing in Indonesia</b>\n</p><p>\nThe new AWS Asia Pacific (Jakarta) Region is the latest in AWS’s ongoing investments in Indonesia. In 2018, AWS opened an office in Jakarta to support its rapidly growing customer base across the country with new jobs including technical experts, solutions architects, technical account managers (TAMs), partner managers, systems engineers, and professional services providers. In April 2020, AWS launched AWS Outposts, which offers Indonesian customers and partners access to the same AWS infrastructure, AWS services, application programming interfaces (APIs), and tools in virtually any data center, colocation space, or on-premises facility for a truly consistent hybrid experience. Today, AWS Outposts enable customers and partners to run key AWS services in their own data centers, while connecting to a broader range of services in the AWS Global Infrastructure. In March 2021, AWS launched its first Amazon CloudFront edge location in Indonesia, offering customers in Indonesia up to 30% lower latency. Amazon CloudFront is a highly secure and programmable content delivery network (CDN) that accelerates the delivery of data, videos, applications, and APIs to users worldwide with low latency and high transfer speeds.\n</p><p>\nIn 2019, AWS made a commitment to empower hundreds of thousands of Indonesians from all backgrounds with cloud proficiency by 2025 in support of the “Freedom of Learning” (Merdeka Belajar) national initiative. To date, 200,000 Indonesians have been trained in cloud skills in collaboration with the Indonesian government and other agencies, including educational institutions and AWS Partners. The program invests in initiatives to help Indonesia’s workforce prepare for the technology-focused, high-paying, in-demand jobs of the future.\n</p><p>\nAWS also remains strongly committed to supporting startups and businesses in Indonesia. Since 2017, AWS has helped more than 1,700 Indonesian startups build and scale their businesses on AWS. In the next five years, AWS plans to reach more than 1 million beneficiaries in Indonesia through corporate social responsibility initiatives under AWS InCommunities, which include science, technology, engineering, arts, and math (STEAM) education, local tech workforce development, community development, and environmental initiatives.\n</p><p>\n<b>About Amazon Web Services</b>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 84 Availability Zones within 26 geographic regions, with announced plans for 24 more Availability Zones and eight more AWS Regions in Australia, Canada, India, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com&amp;esheet=52549184&amp;newsitemid=20211212005164&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=3&amp;md5=9bbd974155ac044af1116a166a72c517\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<b>About Amazon</b>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Famazon.com%2Fabout&amp;esheet=52549184&amp;newsitemid=20211212005164&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=4&amp;md5=da67249fe90b41f42abe3e5e65a957ee\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211212005164r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMjEyMDA1MTY0cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=f79dadee194625537477c5bb0dd547e0a7dd0627431da91f5026543e129c44ae237863c895fa5cce3a5be3a36df0652303dd42beec442584cd3b8e985e638860\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211212005164/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211212005164/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52549184&amp;newsitemid=20211212005164&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=5&amp;md5=44bb055cee2069d138d966ca10d9740c\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON-WEB-SERVICES</p></div>"}