{"date": "2021-12-29 13:04:19+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3393.39, "close": 3384.02}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ATERIAN INC (\"ATER-Q\")\n- Signs A $50 Million Credit Facility With MidCap Financial Trust\n\n     Aterian, Inc. (\"Aterian\") announced today that it has signed an asset\nbacked credit facility with MidCap Financial Trust (\"MidCap\"), which is\nmanaged by a subsidiary of Apollo Global Management, Inc. The credit\nfacility has a three year term and gives Aterian access to up to $50\nmillion in total credit, consisting of $40 million in commitments with an\naccordion facility of an additional $10 million. On the closing, Aterian\nhas repaid in cash and satisfied all outstanding obligations under its\nexisting $25.0 million term loan with High Trail.\n\n     Aterian's Chief Executive Officer, Yaniv Sarig, commented, \"This\ncredit facility is a testament to MidCap's understanding of our business,\nstrong expertise in E-Commerce and their commitment to support growth\noriented companies. We are also pleased to announce that we have repaid our\nremaining loan to High Trail with cash proceeds from the MidCap facility.\nIn the past five months, our team has worked tirelessly to turn around a\nchallenging disruption to our business caused by the impact of the supply\nchain crisis on our costs of shipping. We are entering 2022 with a stronger\nbalance sheet, preferred shipping rates from our logistics partners and\nexciting new initiatives to resume organic and M&amp;A driven growth.\"\n\n     MidCap's Product Head of Asset Based Lending, Garrett Fletcher,\ncommented \"We have a great deal of familiarity with Aterian stemming from\nfinancing the company at an earlier stage in its development. We have\nconfidence in the management team and are delighted that they chose to\npartner with us again as we look forward to continuing to support the\ncompany's growth and development.\"\n\n     About MidCap Financial\n\n     MidCap Financial is a middle market focused specialty finance firm\nthat was formed in 2008. As of June 30, 2021, Midcap Financial provides\nmanagement or other services for over $31.6 billion of commitments, of\nwhich approximately $5.0 billion is managed by Midcap Financial Services\nCapital Management LLC, a registered investment adviser. MidCap Financial\nrefers to MidCap FinCo Designated Activity Company, a designated activity\ncompany limited by shares incorporated under the laws of Ireland, and its\nsubsidiaries, including MidCap Financial Trust. MidCap Financial is managed\nby Apollo Capital Management, L.P., a subsidiary of Apollo Global\nManagement, Inc. MidCap Financial Services, LLC provides sourcing, due\ndiligence and portfolio management services to MidCap Financial. Loans made\nor arranged by MidCap Financial Trust pursuant to a California Finance\nLenders Law License. For more information about MidCap Financial, please\nvisit <a href=\"http://www.midcapfinancial.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.midcapfinancial.com</a>.\n\n     About Aterian, Inc.\n\n     Aterian, Inc. (Nasdaq: ATER), is a leading technology-enabled consumer\nproducts platform that builds, acquires, and partners with best-in-class\ne-commerce brands by harnessing proprietary software and an agile supply\nchain to create top selling consumer products. The Company's cloud-based\nplatform, Artificial Intelligence Marketplace Ecommerce Engine (AIMEE(TM)),\nleverages machine learning, natural language processing and data analytics\nto streamline the management of products at scale across the world's\nlargest online marketplaces, including Amazon, Shopify and Walmart. Aterian\nhas thousands of SKUs across 14 owned and operated brands and sells\nproducts in multiple categories, including home and kitchen appliances,\nhealth and wellness, beauty and consumer electronics.\n\n     Forward Looking Statements\n\n     All statements other than statements of historical facts included in\nthis press release that address activities, events or developments that we\nexpect, believe or anticipate will or may occur in the future are\nforward-looking statements including, in particular, the statements\nregarding our growth plans for 2022, both organically and through M&amp;A.\nThese forward-looking statements are based on management's current\nexpectations and beliefs and are subject to uncertainties and factors, all\nof which are difficult to predict and many of which are beyond our control\nand could cause actual results to differ materially and adversely from\nthose described in the forward-looking statements. These risks include, but\nare not limited to; those related to the global shipping disruptions, our\nability to continue as a going concern, our ability to meet financial\ncovenants with our lenders, our ability to create operating leverage and\nefficiency when integrating companies that we acquire, including through\nthe use of our team's expertise, the economies of scale of our supply chain\nand automation driven by our platform; those related to our ability to grow\ninternationally and through the launch of products under our brands and the\nacquisition of additional brands; those related to the impact of COVID-19,\nincluding its impact on consumer demand, our cash flows, financial\ncondition and revenue growth rate; our supply chain including sourcing,\nmanufacturing, warehousing and fulfillment; our ability to manage expenses,\nworking capital (including for PPE products) and capital expenditures\nefficiently; our business model and our technology platform; our ability to\ndisrupt the consumer products industry; our ability to grow market share in\nexisting and new product categories, including PPE; our ability to generate\nprofitability and stockholder value; international tariffs and trade\nmeasures; inventory management, product liability claims, recalls or other\nsafety and regulatory concerns; reliance on third party online\nmarketplaces; seasonal and quarterly variations in our revenue;\nacquisitions of other companies and technologies, our ability to continue\nto access debt and equity capital (including on terms advantageous to the\nCompany) and the extent of our leverage and other factors discussed in the\n\"Risk Factors\" section of our most recent periodic reports filed with the\nSecurities and Exchange Commission (\"SEC\"), all of which you may obtain for\nfree on the SEC's website at www.sec.gov.\n\n347-676-1681\n<a href=\"https://www.aterian.io\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.aterian.io</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2136000096.MNPRE2136000736-17405720211227</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}