{"date": "2021-11-04 12:45:35.376000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>BLENDER BITES LTD (\"BITE-Z\")\n- Record 2934% Increase in Production for October\n\n     Blender Bites Ltd. (the \"Company\", \"Blender Bites\" or \"Blender\"), a\nCanadian company involved in the development and marketing of a line of\nfrozen premium organic and plant-based pre-portioned frozen smoothie pucks,\nannounces a significant increase in the production of its smoothie pucks in\nthe month of October.\n\n     Blender Bites is the first company to produce a pre-portioned smoothie\npuck in the Canadian market and its certified organic, non-GMO, plant-based\nconvenient smoothie pucks are currently available in over 800 retail stores\nacross Canada. In the month of October, the Company saw a significant\nproduction increase which can be attributed to an expanded consumer base as\na result of a number of Canadian Club store locations being added to its\ndistribution channels, and the need to fulfill orders to meet increasing\nconsumer demand.\n\n     The Company is pleased to announce that in the month of October the\nproduction of Blender Bites' superfood smoothie pucks increased by 2934%\ncompared to the same period in 2020. In October 2020 the Company produced\n9,216 of its superfood smoothie pucks, whereas in the same period of the\ncurrent year has produced 279,648 smoothie pucks.\n\n     These production numbers are a direct result the Company's newly\nintroduced distribution venues, rapidly growing demand for its product, and\nthe Company's foresight to upgrade its production facility in the months\nleading up to its September 2021 transition from a privately held company\nto a publicly listed issuer on the Canadian Securities Exchange.\n\n     \"Blender Bites continues to set records with its production for the\nmonth of October. Due to the implementation of its significant expansion\nplans, the company forecasts November will be its highest producing month\nsince inception\" stated Chelsie Hodge, the Company's CEO.\n\n     In the month of October 2021, the Company also secured its first US\ndistribution partnership with Active Marketing Group Inc. (\"AMG\"). It is\nanticipated that production numbers will continue to grow as AMG and\nBlender seek to secure first orders in the US grocery retail market. As a\nresult of its recently announced partnership with AMG, Blender Bites\nproducts could be exposed to over 50,000 US retail locations and introduce\nits product to an even larger number of new customers.\n\n     About Blender Bites\n\n     Blender Bites is a Canadian company involved in the development and\nmarketing of a line of premium frozen food products with a focus on\nfunctionality. Blender Bites was founded in 2016 and was first to market in\nWestern Canada with a pre-portioned \"easy smoothie\" product that is free of\nany unnecessary inner plastic packaging. Blender Bites products are\ncertified organic, vegan, non-GMO, gluten free, dairy free and soy free.\nThey contain no added sugars and are made in Canada. Blender Bites products\nare distributed internationally across Canada and the US, and are currently\nsold in over 900 stores, including Sobeys, Safeway, Save on Foods, Whole\nFoods Market, Buy-Low/Nesters, IGA and Fresh Street.\n\nOn behalf of the Board of Directors,\nBlender Bites Limited\nChelsie Hodge, Chief Executive Officer\n\nFor further information, contact Blender IR Team at:\nEmail - investors@blenderbites.com\nTelephone - 1-888-997-2055\n\n     CAUTIONARY DISCLAIMER STATEMENT\n\n     This news release includes certain \"forward-looking statements\" under\napplicable Canadian securities legislation. Forward-looking statements are\nnecessarily based upon a number of estimates and assumptions that, while\nconsidered reasonable, are subject to known and unknown risks,\nuncertainties, and other factors which may cause the actual results and\nfuture events to differ materially from those expressed or implied by such\nforward looking statements. Such factors include, but are not limited to\ngeneral business, economic, competitive, political and social\nuncertainties, and uncertain capital markets. Readers are cautioned that\nactual results and future events could differ materially from those\nanticipated in such statements. Accordingly, readers should not place undue\nreliance on forward-looking statements. The Company disclaims any intention\nor obligation to update or revise any forward-looking statements, whether\nas a result of new information, future events or otherwise, except as\nrequired by law.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2130700183.MNPRE2130701338-05423020211104</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}