{"date": "2021-11-12 13:48:22.890000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3482.05, "close": 3525.15}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>E-commerce giant Amazon on Friday announced that it has completed the integration of its grocery stores Fresh and Pantry into a single unified store called Amazon Fresh. The new store, available across over 300 cities in India, continues to offer customers unbeatable savings, a wide selection of products, and fast and convenient delivery options in one single online destination.</p><p>\"We are a customer obsessed company and continue to listen to our customers to offer them enhanced shopping experiences, a wide range of selection, and the best value and convenience. In February this year, we announced the integration of the Pantry store into Fresh in select cities and customers loved the convenience of shopping for daily groceries coupled with unmatched savings,\" said Siddharth Nambiar, Director, Category Management, Amazon India. \"Today, we've completed the integration of both stores into a single online store called Amazon Fresh across 300+ cities in India. Customers will continue to enjoy super value savings, a wide selection of products, and convenient delivery options. They also get an upgraded shopping experience, with a dedicated app-in-app for grocery, and convenient features like personalized widgets and reminders to ensure that frequently shopped items aren't forgotten during checkout.\"</p></div><div class=\"tr-npp-body\"><p>Nambiar said the firm is laser-focused on providing customers the best online shopping experience, coupled with quick and safe delivery.</p><p>This launch has allowed the e-commerce firm to simplify the shopping experience for groceries via its dedicated Amazon Fresh app-in-app experience, and sets us up to deliver many new features and enhancements in the coming months. Apart from offering great savings, Amazon Fresh will also reduce barriers to grocery shopping online.</p><p>Clicking on the Amazon Fresh icon on the homepage takes the customer to the dedicated grocery shopping store, where they will find features that help you build your weekly/monthly basket in a few minutes. Shopping for groceries online has become more rewarding, fast, safe and convenient with Amazon Fresh.</p><p>Amazon Fresh will offer a selection of perishable products such as fruits and vegetables, frozen and chilled products like dairy and meats, dry grocery items, beauty, baby, personal care, and pet products, across our top 14 cities including Bengaluru, Delhi, Faridabad, Gurgaon, Ghaziabad, Amazon Fresh will offer a selection of perishable products such as fruits and vegetables, frozen and chilled products like dairy and meats, dry grocery items, beauty, baby, personal care, and pet products,. Customers in these cities will also be able to enjoy two-hour delivery slots starting 6 AM to midnight.</p><p>For the remaining cities, customers can shop for dry groceries across staples, cooking essentials, snacks, personal care, skin care, pet food, baby products, with delivery within 1-3 days.</p><p>\"We are humbled that millions of Indian customers have made us a part of their everyday lives,\" said Nambiar. \"With this new launch, all items will get delivered in a single convenient shipment delivered between 1-3 days depending on the customer\u0092s location.\"</p><p>Over the last 18 months, Amazon has seen a lot of customers move online. Nearly 65 per cent of orders and over 85 per cent of new customers on Amazon.in are from Tier II &amp; III cities. Usually their first buy is a grocery product.</p><p>\"We've observed an uptick in customers buying cooking ingredients like flour, ghee, maida, sugar, packaged sweets, dry fruits, gift boxes, and snacks and beverages,\" said Nambiar</p><p>In top cities such as Bhubaneshwar, Patna, and Lucknow, Amazon has seen a lot of adoption for online grocery shopping post pandemic. \"We will continue to build on our presence and quality of service in these cities to further accelerate new customer adoption,\" said Nambiar.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}