{"date": "2021-11-09 20:14:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        Brian Huseman, vice president of public policy at Amazon, said the Seattle, Washington-based internet retail giant is proud to expand its investment in Alabama with new state-of-the-art operations facilities that will support thousands of good jobs.\n      </p>\n                <p>\n        \"Our success would not be possible without our great employees, and we are grateful for the enthusiasm and strong state and local support we have received since first launching operations in 2020,\" Huseman said.\n      </p>\n                <p>\n        \"We look forward to continued investment as we innovate and grow to better serve our customers across the state.\"\n      </p>\n                <p>\n        GROWTH PLANS\n      </p>\n                <p>\n        The new Amazon facilities coming to Alabama are:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          Birmingham Delivery Station<strong>:</strong> In November, Amazon plans to expand delivery services in greater Birmingham. This new station will employ approximately 150 people and create indirect job opportunities for hundreds of people through the empowerment of the Delivery Service Partner program.\n        </li>\n                  <li>\n          Huntsville XL Fulfillment Center: In 2022, Amazon will open its third fulfillment center in the state. This \"XL\" Non-Sortable facility is designed to receive, store, and package heavy or bulky items like home appliances. The 1 million-square-foot facility in Limestone County will provide more than 250 full-time jobs and will utilize innovative technologies and energy-efficient, zero-emission power industrialized truck (PIT) equipment.\n        </li>\n                  <li>\n          Montgomery Receive Center: In 2022, Amazon will open an Inbound Cross Dock facility that will receive and consolidate items from vendors and facilitate shipment to fulfillment centers. This 650,000-square-foot facility will provide more than 500 full-time jobs.\n        </li>\n                </ul>\n                <p>\n        Amazon also said its new Huntsville Non-Sortable Fulfillment Center is now open for business. <strong><a href=\"https://www.madeinalabama.com/2021/11/amazon-expands-alabama-investment-with-4-new-operational-sites/v\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The facility was first announced in May 2021</a></strong>.\n      </p>\n                <p>\n        The first of two fulfillment centers in the area, this nearly 1 million-square-foot facility has created hundreds of full-time jobs and allows Amazon employees to pick, pack, and ship larger items to customers, such as bulk paper goods, outdoor equipment, or rugs.\n      </p>\n                <p>\n        Greg Canfield, Secretary of the Alabama Department of Commerce, said Amazon is one of the world's most dynamic companies and its continued growth in the state strengthens strategic efforts to bring in more high-tech employers.\n      </p>\n                <p>\n        \"Amazon's presence in Alabama helps the state's economic development team advance its goal of recruiting high-caliber projects with technology-focused jobs,\" Secretary Canfield said.\n      </p>\n                <p>\n        \"This is a priority as we continue to work toward evolving Alabama's economy and preparing our workers for 21st Century careers.\"\n      </p>\n                <p>\n        EXPANDING FOOTPRINT\n      </p>\n                <p>\n        With a fulfillment center in Bessemer, delivery stations in Birmingham and a sortation center in Mobile, Amazon has created more than 9,000 direct jobs statewide and invested more than $1 billion in Alabama in infrastructure and compensation to employees.\n      </p>\n                <p>\n        The company's fulfillment and transportation jobs support communities of all sizes, pay a minimum starting wage of $15 per hour-which is more than double the federal and state minimum wage and provide comprehensive health benefits on the first day of employment, paid time off, up to 20 weeks of fully paid parental leave, and more for employees and their families.\n      </p>\n                <p>\n        Positions are available at all new operations facilities in Alabama. Interested candidates can visit <strong><a href=\"https://www.madeinalabama.com/2021/11/amazon-expands-alabama-investment-with-4-new-operational-sites/v\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon's hiring site</a></strong> to learn more.\n      </p>\n                <p>\n        Local officials welcomed Amazon's growth plans for their communities.\n      </p>\n                <p>\n        \"The growth of Huntsville and North Alabama is a natural fit for Amazon's fulfillment centers as the company expands its physical distribution network,\" Huntsville Mayor Tommy Battle said. \"We welcome the new job opportunities and service options Amazon will bring to the region.\"\n      </p>\n                <p>\n        \"Amazon's major investment shows that Montgomery is on the map and an essential part of logistics solutions for major brands and industries,\" Montgomery Mayor Steven L. Reed said. \"We're eager to grow this partnership on behalf of the Montgomerians who will benefit from the careers that this new facility will bring.\"\n      </p>\n                <p>\n                  <a href=\"https://press.aboutamazon.com/news-releases/news-release-details/amazon-expands-investment-four-new-operations-sites-alabama\">\n                    <strong>Read Amazon's full announcement.</strong>\n                  </a>\n                </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.madeinalabama.com/2021/11/amazon-expands-alabama-investment-with-4-new-operational-sites/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Alabama Department Of Commerce</strong> published this content on <strong>09 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>09 November 2021 20:14:00 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Alabama Department Of Commerce</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Alabama-Department-Of-Commerce</p></div>"}