{"date": "2021-12-05 09:01:15+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3389.79, "close": 3523.29}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>Dubai, UAE – Sophos, a global leader in next-generation cybersecurity, today unveiled advancements to Sophos Cloud Optix that automate and simplify the detection and response of security incidents across Amazon Web Services (AWS) infrastructure.<br/>\n<br/>\nPowered by new machine learning models from SophosAI, the Sophos Cloud Optix cloud security posture management solution now continuously analyzes AWS CloudTrail to build a picture of individual user activity. It brings AWS CloudTrail events to life in a clear and detailed timeline view of user activities, high risk anomalies and security and compliance incidents across all AWS accounts with remediation guidance for security teams.</p>\n<p>“Sorting through and making sense of potentially thousands of user activity events to identify suspicious activity used to be near impossible,” said Scott Barlow, Sophos vice president of global MSP and cloud alliances. “Sophos is transforming this resource intensive process, giving security teams the answers they need with the click of a button. Security teams can instantly pinpoint unusual activity – such as actions not previously taken by a user or actions being performed outside of normal business hours, for example – and focus their investigations on the most high-risk alerts with confidence.”</p>\n<p><strong>Accelerate with AWS, Secure with Sophos Cloud Optix</strong></p>\n<p>Sophos Cloud Optix provides unmatched visibility into risky blind spots. It secures AWS and other cloud workloads against advanced threats and cloud environment misconfigurations, and is easily managed in the cloud-based Sophos Central platform alongside Sophos’ entire portfolio of next-generation cybersecurity solutions and services.</p>\n<p>Sophos Cloud Optix offers extensive AWS security service integrations – including integration with the new Amazon Inspector. Sophos Cloud Optix also integrates with AWS Security Hub, Amazon GuardDuty, AWS CloudTrail, Amazon Macie, AWS Systems Manager and Patch Manager, AWS Firewall Manager, AWS IAM Access Analyzer, Amazon Detective, and Amazon Elastic File System.</p>\n<p>As an AWS Level 1 Managed Security Service Provider (MSSP) Competency program partner, Sophos’ unique threat protection, monitoring and response package fulfills a critical market need for managed security services, validated by AWS. Now available on AWS Marketplace, the package fuses automated protection and 24/7 managed threat response into a single, comprehensive offering. Designed specifically for AWS customers, the offering combines cloud security posture management; endpoint, cloud workload and network security; vulnerability scanning; inventory visibility; and compliance tracking. Organizations further benefit with a dedicated 24/7 Sophos Managed Threat Response security team that monitors AWS environments and responds to neutralize threats and in-progress attacks.</p>\n<p><strong>Sophos at AWS re:Invent</strong></p>\n<p>AWS re:Invent attendees are invited to attend a session, “AWS cybersecurity as a system,” to learn how workforce management software provider Celayix secures its AWS environments with Sophos to ensure maximum uptime, speed and efficiency. The session will take place on Wednesday, Dec. 1, at 4:45 pm PST at the Venetian Resort, meeting room Lando 4305.</p>\n<p>Attendees can schedule a complimentary cloud security assessment, addressing their cloud security risks with prioritized actions to yield immediate and significant improvements at Sophos’ AWS re:Invent booth #263.</p>\n<p>-Ends-</p>\n<p><strong> About Sophos</strong></p>\n<p><span>Sophos is a worldwide leader in next-generation cybersecurity, protecting more than 500,000 organizations and millions of consumers in more than 150 countries from today’s most advanced cyberthreats. Powered by threat intelligence, AI and machine learning from SophosLabs and SophosAI, Sophos delivers a broad portfolio of advanced products and services to secure users, networks and endpoints against ransomware, malware, exploits, phishing and the wide range of other cyberattacks. Sophos provides a single integrated cloud-based management console, Sophos Central – the centerpiece of an adaptive cybersecurity ecosystem that features a centralized data lake that leverages a rich set of open APIs available to customers, partners, developers, and other cybersecurity vendors. Sophos sells its products and services through reseller partners and managed service providers (MSPs) worldwide. Sophos is headquartered in Oxford, U.K. More information is available at <a href=\"http://www.sophos.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.sophos.com</a>. </span></p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}