{"date": "2021-12-02 17:05:11.861000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3443.72, "close": 3389.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>QUIX (\"QUIX-Q\")\n- Delivers Platform to Accelerate Live Data-Driven Products\n\n     Data stream processing platform Quix announced the first online\nintegrated development environment (IDE) for live data-driven products.\nWith built-in connectors to live data streams such as currency markets,\nTwitter and AWS Kinesis, Quix's platform radically accelerates development\ntime.\n\n     The technology transfer from Formula One, where Quix founders\noriginated data stream processing capabilities, helps developers write and\ntest code on real-world data sets that mirror production, without breaking\nproduction environments.\n\n     \"Organizations with high-value streaming data recognize that this\ncutting-edge technology can be breakable, so they're reluctant to give\npeople access,\" said Michael Rosam, CEO and co-founder of Quix. \"But this\nundermines their ability to extract value from live data. We've created a\nplatform that lets anyone -- data teams, product teams and business units\n-- access real-time data. They build with it more easily, iterate rapidly,\nand do it all without jeopardizing mission-critical production.\"\n\n     The new Quix platform accelerates time to market for data-driven\nproducts by:\n\n     *  Offering an IDE for Python with Git, Pip and autocomplete\n     *  Handling all setup, including broker configuration, security and\nencryption\n     *  Offering pre-built connectors to streaming data sources, including\nConfluent Kafka, AWS Kinesis and Google Pub/Sub\n     *  Providing a cloud-based environment to run and test code against\nlive data within the IDE, instead of deploying it to a staging environment\n     *  Giving developers self-service access to real data, and\n     *  Enabling integration to any system with live and historic data\nAPIs.\n\n     \"We took into account all of the major hurdles development teams face\nwhen working with streaming data,\" said Tomas Neubauer, CTO and co-founder\nof Quix. \"Quix eliminates the complexity and hassle associated with stream\nprocessing. Our latest release enables you to seamlessly develop, test and\nrun code in our IDE, without having to deploy it to your company's staging\nor production environments.\"\n\n     Message brokers are gaining rapid adoption in companies across every\nindustry. However, access to this infrastructure is often hampered by IT\nsilos. In some cases, live data is \"dumped\" into a data lake, where its\nvalue rapidly declines.\n\n     \"Quix offers a simple, intuitive interface into the complex world of\nstream processing,\" said Rosam. \"Quix is doing for the Kafka message broker\nwhat DBT did for the data warehouse.\"\n\n     Learn more about Quix's new online IDE in this in-depth technical blog\npost.\n\n     About Quix\nQuix brings the power of stream processing to data scientists, developers\nand product teams. With Quix, organizations can go to market faster,\nintegrate ML and AI, and avoid the massive costs of data infrastructure.\n\n      Founded in the UK by Formula One engineers with deep streaming data\nexperience, Quix's platform is trusted by developers at McLaren, Deloitte,\nthe National Health Service (UK), and across industries including\nmanufacturing, financial services, gaming, and automotive. For a free trial\nand to learn more, visit <a href=\"https://quix.ai\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://quix.ai</a>\n\n     Media contacts\n\n     Heidi Joy Tretheway, VP Marketing\n\n     heidijoy@quix.ai\n\n     @Quix_ai   |   LinkedIn\n\n     Related Images\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133500550.MNPRE2133502288-09033520211202</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}