{"date": "2021-11-23 23:34:11.029000+00:00", "ticker": "AAF", "mrkt_info": {"open": 129.8, "close": 129.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Moody's Investors Service on Tuesday revised Bharti Airtel's ratings outlook to positive from stable. The announcement comes a day after the telco announced hike in mobile tariffs by 20%-25% effective Novemeber 26, which prompted Vodafone Idea to announce a similar hike on Tuesday.</p><p>At the same time, Moody's has affirmed Bharti's Ba1 corporate family rating (CFR) and senior unsecured rating, as well as the Ba1 rating on the backed senior unsecured notes issued by Bharti Airtel Int'l (Netherlands) B.V.</p></div><div class=\"tr-npp-body\"><p>\"The outlook change to positive reflects Bharti's improving operating performance and credit metrics which, if sustained, could support an upgrade to investment grade within the next 12-18 months,\" said Annalisa Di Chiara, a Moody's Senior Vice President.</p><p>\"The continued expansion of profitability, particularly at its core Indian mobile business, together with a steady reduction in its balance sheet debt, is needed to mitigate the potential effect on Bharti's credit metrics of significant investments in 5G and the compounding growth of deferred liabilities during the moratorium period,\" added Di Chiara, who is also Moody's lead analyst for Bharti.</p><p>RATINGS RATIONALE</p><p>Bharti's Ba1 CFR considers the company's position as one of the largest telecom service operators globally in terms of subscribers (471 million), its solid market position in India's (Baa3 stable) high-growth mobile market and its large spectrum holdings. Bharti's proven ability to access capital markets and the benefits of its strong and supportive shareholder base are also reflected in the ratings.</p><p>The company reported a 27% increase in its consolidated reported EBITDA to Rs 27,200 crore for the six months ended September 30, 2021 compared with the same period in 2020. Moody's expects Bharti's consolidated adjusted EBITDA to increase toward Rs 57,000 crore-Rs 58,500 crore by the end of FY22, around a 25% increase over FY21.</p><p>This expectation is based on its continued expansion of its 4G subscriber base and the increase in average revenue per user (ARPU) at the company's core Indian mobile services segment, which contributes around 53% of consolidated EBITDA. The company's recently announced tariff increase is a meaningful step to drive ARPUs higher and supports our expectation of rising profitability over the next 12-18 months.</p><p>At the same time, Moody's forecasts stable EBITDA growth in the 10%-15% range for Bharti's African operations, which are held through its 56%-owned subsidiary, Airtel Africa Limited, and contribute around 30% of consolidated EBITDA.</p><p>In August 2021, Bharti announced a Rs 21,000-crore rights issue that included an upfront payment and two tranches to be raised over the next three years. The company raised the upfront amount of Rs 5,250 crore in October 2021, the proceeds of which Moody's expects will be used to reduce debt. Bharti has said it will close on additional tranches to support debt reduction and its 5G investments as needed.</p><p>Moody's believes the Government of India's recently announced reform package for the financially stressed telecommunications industry will not only help strengthen Bharti's cash flow, but will help ensure the longer-term health of the sector.</p><p>Bharti has accepted the four-year moratorium for payment of its statutory dues payable to the government comprising around Rs 50,000 crore of spectrum liabilities and Rs 28,000 crore of annual gross revenue (AGR) dues (both amounts as of 31 March 2021). Moody's estimates that the deferment option saves the company around Rs 40,000 crore-Rs 45,000 crore of cash payments to the government over the same period.</p><p>However, the moratorium is only up to September 30, 2025. The deferred amounts will be spread equally over the remaining instalments to be paid, without any increase in the existing time period specified for making the instalment payments, such that the net present value of the payable amount is protected.</p><p>As a result, the compounding effect over the moratorium period means that the aggregated deferred liability could grow considerably from the current INR785 billion as of March 2021, while the annual cash payments to the government would also increase significantly beginning in 2025.</p><p>As a result, Moody's expects Bharti to redeploy cash flow savings over the moratorium period, together with organic cash flow generation, to permanently reduce balance sheet debt at its Indian operations.</p><p>In addition, the extended moratorium helps boost Bharti's capacity to invest in its 5G networks in efforts to solidify its competitive position against potential competition when 5G services are commercially launched in India over the next 18-24 months.</p><p>Moody's also expects investments in 5G spectrum, should an auction occur in the first half of 2022, will not worsen the company's leverage profile. This is based on Moody's assumption of a spend of around INR 370 billion at the auction, to be partially funded by proceeds from additional calls for the rights issue. That said, uncertainty remains regarding the timing of the auction and Bharti's ultimate participation -- which could be higher than Moody's assumed amount.</p><p>Moody's expects Bharti's leverage, as measured by adjusted debt/EBITDA, to decline toward 3.2x by fiscal 2022 from 3.7x for the 12 months ended 30 September 2021. Moody's includes Bharti's perpetual securities as debt in its calculations. A permanent reduction in its balance sheet debt, including its deferred liabilities, would also preemptively build additional financial capacity at the core Indian mobile operations.</p><p>The positive outlook reflects Bharti's improving operating profile credit metrics, including Moody's expectation of growing free cash flows and liquidity over the next 12-18 months, particularly at the core Indian operations. Moody's expects consolidated adjusted debt/EBITDA to steadily decline, even with investments in 5G spectrum, and that cash flow savings from the moratorium are redeployed to reduce debt permanently.</p><p>Moody's said it may upgrade the rating if Bharti delivers on further improvement in profitability leading to solid free cash flow generation and permanent debt reduction - particularly at the Indian operations -- such that consolidated leverage trends below 2.5x on a sustained basis. To that end, Moody's will also look for further clarity around 5G investments, particularly related to spectrum spend and funding thereof, in the upcoming auction and its competitive positioning and readiness in advance of 5G rollout.</p><p>A downgrade is unlikely over the next 12-18 months, given the recovery in Bharti's operating performance and the positive outlook, the ratings agency said. However, Moody's could return the outlook to stable if there is a reversal in the company's profitability, a significant deterioration in its liquidity position or any adverse changes in the competitive or regulatory environments that would derail the continued improvement in profitability, cash flows and leverage.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}