{"date": "2022-01-18 17:00:00.168000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>What you need to know:</strong></p><ul class=\"bulleted-list arrowlist\"><li><strong>Developers and businesses can now build and deploy applications at the edge of Verizon’s wireless network in Charlotte, Detroit, Los Angeles and Minneapolis.<br/><br/></strong></li><li><strong>Easy Aerial and Fermata Energy use Verizon 5G Edge with AWS Wavelength for drone and energy management applications that require latency many times faster than the blink of an eye.<br/><br/></strong></li><li><strong>Verizon and AWS teaming with SaaS providers Couchbase and Confluent to give developers seamless access to Verizon 5G Edge with AWS Wavelength.</strong></li></ul><p>BASKING RIDGE, N.J., Jan.  18, 2022  (GLOBE NEWSWIRE) -- Verizon and AWS are now offering mobile edge computing in more U.S. metro areas with the addition of Charlotte, Detroit, Los Angeles and Minneapolis. Verizon 5G Edge with AWS Wavelength, a real-time cloud computing platform, brings AWS compute and storage services to the edge of Verizon’s wireless network. The combination minimizes the latency and network hops required to connect from an application hosted on the platform to the end user’s device. Launched in <a href=\"https://www.globenewswire.com/Tracker?data=03opJ5fEO5Jtj1lx_U73hccXOyjOS4IBw_Jv6QO-nZ9L3_M2F-OHLaMHpah9-Gyz2KKZU8J8qaTR1evgpoHOOy69YXv2Ekrz1dD3R3ebPkA-MC_Fx9_6nqtGnllWvfiT\"><u>August 2020</u></a>, the companies currently offer mobile edge computing via AWS Wavelength Zones in 17 locations in the U.S. Using 5G Edge with AWS Wavelength allows developers and businesses to build and deploy a variety of applications such as machine learning, Internet of Things (IoT), and video and game streaming.  </p><p><strong>Using Verizon 5G Edge with AWS Wavelength for drone and energy management applications</strong></p><p>Fermata Energy, a Verizon Ventures company, and Easy Aerial are among the innovators who participated in the <a href=\"https://www.globenewswire.com/Tracker?data=STcVAVqZCkK3ZI4TGQXu0X8tGzOHvq6-OFBUdc0RlDlJ83iBLklV7Gycov3hE9dSWbjHk74SAsFXAcvqqb-NXg6yJws9cLfmvbwHx2FqlXWfBuDnWfl3rqDyZmNjn2Dm1eSdOymGgR6bHUqsFXx90Fb5MT3VtDUXz4U5dFZgMS8=\"><u>5G Studio</u></a>, a collaboration between Verizon and Newlab, to develop transformative technology solutions leveraging Verizon’s 5G Ultra Wideband network technology and Verizon 5G Edge with AWS Wavelength at Newlab. </p><p>Easy Aerial is a leading provider of American-made, military-grade, autonomous drone-in-a-box-based monitoring and inspection solutions for commercial, government, and military applications. With the low end-to-end latency enabled by Verizon 5G Edge with AWS Wavelength, Easy Aerial was able to collect and transfer live drone video for near real-time object detection and telemetry data for rapid processing and analysis. 5G and mobile edge computing also allowed expensive compute to be removed from the drone, reportedly saving about 10% in drone costs and increasing flight time by approximately 40%. </p><p>“Being able to utilize the high bandwidth for unmanned aerial vehicles (UAVs) that Verizon 5G Edge with AWS Wavelength provides is a game changer,” said Ivan Stamatovski, CTO of Easy Aerial. “It shifts the paradigm on what is possible to achieve with airborne sensors by processing data at the edge of the network in near real-time.”</p><p>Fermata Energy’s Vehicle-to-Everything (V2X) technology turns electric vehicles (EVs) into mini power plants by discharging energy services from EVs’ batteries to the home, building, or energy grid. Using a bidirectional charger connected both to an EV and a building’s energy load, Fermata Energy’s cloud-based software, running on Verizon 5G Edge with AWS Wavelength, reacted to changes in the grid and, as a result, load-balance data in near real-time with very low latency, according to Fermata Energy. This allows Fermata Energy to dispatch an EV as a valuable energy resource providing near real-time response to the state of the grid. </p><p>Watch the <a href=\"https://www.globenewswire.com/Tracker?data=LmO0eBKOCzLKkqiBPmQ-aSM5556myM2gT0MGdxdckeeGlqK5CdNc7P-_oZpbySPQ_guCj7EGbXfSuhDPz8oXNTUmlZwIRdNG85V0hky4mA0=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Fermata video</a> for more.</p><p><strong>Teaming with SaaS providers to make it a breeze for developers</strong></p><p>Verizon and AWS are also working with software as a service (SaaS) providers Couchbase and Confluent to make it easier for developers who use their platforms to create applications running on Verizon 5G Edge with AWS Wavelength. Using infrastructure templates, Verizon and AWS seamlessly extended the capabilities of these providers to the edge to automate the complexity of edge networking, core compute, and the software itself. </p><p>Couchbase empowers developers to build, deploy and run their most mission-critical applications by providing a high-performance, flexible and scalable modern database that runs across the data center and any cloud. By working with Couchbase, Verizon and AWS are enabling native data storage and processing at the network edge at high performance and scale. </p><p>View the <a href=\"https://www.globenewswire.com/Tracker?data=EvGfEkoWU3DfLEkXRZVF6haHyzVodrlRWNz2IvFKaaA8veD8KmGRTu8rCpQnJT_7UVLhuLpzNnFFnu7Iwe9owv9feHvi1lHW5UTnODvSUZK5UW5TRBhvsmn-A8rSaF1n\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Couchbase video</a>.  </p><p>Confluent’s data in motion platform enables enterprises to connect and process real-time data across multi-cloud and hybrid environments to power new IoT analytics and applications.        </p><p>“Using Verizon 5G Edge with AWS Wavelength and Confluent, our joint customers are able to build real-time IoT connections with ultra-low latency. This allows organizations to intelligently respond to events happening essentially in real-time as they deploy more 5G-enabled devices across their organizations to power next-generation digital experiences and business processes,” said Gerry Fierling, Sr. Director, Global AWS Alliance, Confluent.</p><p>To easily integrate the entire 5G Edge footprint into mobile applications, Verizon also offers developers the 5G Edge Discovery Service that seamlessly discovers the optimal mobile edge compute location for any Verizon mobile client. The Edge Discovery Service, alongside a broader suite of APIs, is available on the <a href=\"https://www.globenewswire.com/Tracker?data=FxIYP3DAVXgOxwzri_W1Wle6dGHjzNmplMVbfheiaTy-kWXiY_CXz0eUV9Eg7TDQvURY-ucdqhK-rjeHn9CLLmwiUY1p3ucpxCIZo1wdb2TFeMNS18KOQBmpxeuml2yuJs5-wQIPw-z68TdCSHoiuQ==\"><u>5G Edge developer porta</u></a>l.</p><p>“Through our continued collaboration with AWS, we’re helping developers and businesses in every industry create truly transformational applications for use cases such as immersive VR gaming, video distribution, and connected and autonomous vehicles,” said Tami Erwin, CEO of Verizon Business. “By expanding our 5G Edge locations across the U.S., we’re enabling developers to quickly and easily build apps and services that take advantage of the low latency, massive bandwidth and strong reliability of 5G and edge computing.”</p><p>“Customers that want to build ultra-low latency applications need access to compute, storage, and advanced cloud services at the edge of the 5G network. They tell us that broad coverage is very important to ensure consistent application experiences, wherever their end-users may be,” said George Elissaios, general manager of AWS Wavelength and Director of Product Management, AWS. “With the continued and rapid expansion of AWS Wavelength Zones across the US and around the world, we are delivering on that, while also broadening access to advanced 5G and edge capabilities to every AWS customer, small or large. We’re excited to see the innovation that customers like Easy Aerial and Fermata Energy bring with novel applications that transform consumers’ experiences by leveraging AWS Wavelength on Verizon 5G Edge.”   </p><p>Verizon 5G Edge with AWS Wavelength is currently available in 17 locations including Atlanta, Boston, Charlotte, Chicago, Dallas, Denver, Detroit, Houston, Las Vegas, Los Angeles, Miami, Minneapolis, New York City, Phoenix, the San Francisco Bay Area, Seattle and Washington DC. </p><p>Learn more information about <a href=\"https://www.globenewswire.com/Tracker?data=iYQxJGjQmI6sKg7wl0cy5kgpdq1KXxnyBpZI892MIUo8KveGQsipfpOIJwYscw-GjUmbdFi35DUPd0Tggx6GCtE0OUDx51r1hoYxvsW_81cXqpQHNhspTMU9PRm-uGdkNx7XBhIXOVulCIe78hbh9w==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Verizon 5G Edge</a> and <a href=\"https://www.globenewswire.com/Tracker?data=iYQxJGjQmI6sKg7wl0cy5k2W2V-3K3lMoWMtgI1MeIsIM-0wqaGduHxdXnpUR5MW53AJQzzYiPZCSkPO2-_dlm1jMJwNN5VV8LwpC2Xg40o_T4cLcR0o8QxkPwE2UhrF\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Verizon’s 5G technology</a>.</p><p>Verizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $128.3 billion in 2020. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control.</p><p>VERIZON’S ONLINE MEDIA CENTER: News releases, stories, media contacts and other resources are available at <a href=\"https://www.globenewswire.com/Tracker?data=zJklaSV3sXAz1r0U_WKioeie72OPeCMKdZCLzIVXPbBNnqYlOBEIA4AAVrixxrRpWRb4bJgZh9FIXGvcdBKncYbmNeWGFHEofbcrms7n_Y4=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">verizon.com/news</a>. News releases are also available through an RSS feed. To subscribe, visit <a href=\"https://www.globenewswire.com/Tracker?data=LgXUgUtEnvF63kB_Magd-rHLZ7QLQ5aWzt4rgatKvcvn0uWUreMAv5VbrovUqkn_mjdk_MK4LGWcLzYoPCikeInNA9F-GLUmxu1Mz4Xm2E5wwM4RpkNM9XbjhjgoXgmo\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.verizon.com/about/rss-feeds/</a>. </p><p><strong>Media contact: </strong><br/>Chris Ashraf<br/><a href=\"https://www.globenewswire.com/Tracker?data=EoVsU1aSyR06biyFKvX1pn1SaJ8ag690H-V7rxadFk_iMacG4u2Tphlc6AU6Dq-2-tq2WSHIY4OiOgDegr766Uj5PVU_3AQMyqDLmL-g0ZRtUPZ5F7gAYZA1S80hMsXrmxL8ZgblfhUefQfUia2wPg==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">christina.moon.ashraf@verizon.com</a> <br/>(201) 320-4259<br/>@ChrisMoonPR</p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODQyODY3NCM0NjU3Mzk4IzIwMDg2NjQ=\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RReU9EWTNOQ00wTmpVM016azRJekl3TURnMk5qUT0=&amp;key=81ef25fcc187d67e9142b317c49db339011797b43e8b9ae463198985f3f566a89d3fb93fc1d80a330d341ed2beb23f7e77050d4616ba37fc18876d4b58377ffd\"/></div></div><br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/NTEwNjA0ZGYtMDI5Yi00NDc1LThlNjYtYzNiMzk4Yzk0ZTJiLTEwMjAyMzc=/tiny/Verizon-Sourcing-LLC.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9OVEV3TmpBMFpHWXRNREk1WWkwME5EYzFMVGhsTmpZdFl6TmlNems0WXprMFpUSmlMVEV3TWpBeU16Yz0vdGlueS9WZXJpem9uLVNvdXJjaW5nLUxMQy5wbmc=&amp;key=505182c533b864259cd34435ebe2f956bc11a7e9d398d18d73eaee2fb12f42e19403ce23c9cb8ae2d58d6468564c2e357d4eb5ea4d4df3374b930d3275228c05\"/></div></div><p><a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/e797a73c-ce36-447f-bf12-b80cc2238f0d\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Primary Logo\" border=\"0\" src=\"https://ml.globenewswire.com/media/e797a73c-ce36-447f-bf12-b80cc2238f0d/small/verizon-logo-1300x400-jpg.jpg\" style=\"max-height:46px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9lNzk3YTczYy1jZTM2LTQ0N2YtYmYxMi1iODBjYzIyMzhmMGQvc21hbGwvdmVyaXpvbi1sb2dvLTEzMDB4NDAwLWpwZy5qcGc=&amp;key=6805306f310ffd352d18d02a4323972673e77ed9a5be8e0572b9d8773b7bd5eda5aac5bb148901d032cd061ddc24bcb603297d6d0658a92f2a37884f65d7d664\"/></div></div></a></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">GlobeNewswire, Inc. 2022</p></div>"}