{"date": "2021-11-28 20:00:41+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Mike Spector</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW YORK, Nov 28 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>A senior Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> executive said it remains too early to predict how the Omicron coronavirus variant will impact consumer spending during the holiday season but suggested that shoppers will press ahead for now. </p><p>\"It’s very early in the process of understanding what’s happening with the new variant,\" said Dave Clark, chief executive of Amazon's worldwide consumer business, during a Sunday morning interview on CBS' \"Face the Nation.\"</p><p>Clark said he was \"incredibly optimistic\" about the ability of scientists and pharmaceutical companies that have developed effective vaccines to respond to the new variant while shoppers take stock of developments. </p><p>\"Consumers are going to wait and see in terms of what happens ... but are going to move on with their lives into this holiday season,\" Clark said. </p><p>Clark's comments came amid a backdrop of recent supply chain disruptions the Biden administration has linked to the spread of another coronavirus variant, Delta. </p><p>The United States and other countries are now imposing travel restrictions after the emerging Omicron variant, first detected in South Africa, began spreading to other parts of the world. In the Netherlands, Dutch health authorities said 13 cases were found among passengers on two flights that landed in Amsterdam on Friday after departing South Africa.</p><p>Britain, Denmark and Australia have also found cases in recent days. While there are not documented cases yet in the United States, health experts said the variant could already be present.</p><p>Clark said consumers for now are forging ahead with reconnecting after prolonged periods of government-mandated lockdowns and other pandemic restrictions.  </p><p>\"People want to have a very thoughtful holiday season and want to prepare themselves to go back out into the world, if you will. And that’s what we’re seeing in their spending,\" Clark said.</p><p>Separately, he said the pandemic had induced people to reconsider how they structure their lives and work, contributing to hiring challenges.</p><p>\"People are looking at their lives so differently through the course of the pandemic,\" Clark said. \"People have evaluated what kind of jobs do they want to have, do they want to be in the food service business, do they want to be in retail, do they want to be in fulfillment, do both people in the family want to work? What’s the life structure and setup?\"</p><p>While Amazon has successfully hired people during the current labor shortage, \"it is a challenge,\" he said. </p><p>Inflation, meanwhile, is not currently dragging down consumer spending, Clark said. Amazon had \"a record-breaking Black Friday,\" he said. </p><p>Shoppers are spending on apparel and home decor, an indication they are planning to come back together, he said. Spending on electronics has dipped, he said, after people invested in home offices for remote work.</p><p><br/></p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Mike Spector in New York; Additional reporting by Elizabeth Piper in London; Editing by Mark Porter)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:mike.spector@thomsonreuters.com\" data-type=\"email\" translate=\"no\">mike.spector@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: HEALTH-CORONAVIRUS/VARIANT-AMAZON</p></div>"}