{"date": "2021-11-29 21:41:51.597000+00:00", "ticker": "III", "mrkt_info": {"open": 1388.0, "close": 1433.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>CAPITAL POWER CORP (\"CPX-T\")\n- Enbridge Collaborate to Reduce CO2 Emissions in Alberta\n\n   Capital Power Corporation and Enbridge Inc. are pleased to announce a\nmemorandum of understanding to collaborate on carbon capture and storage\n(CCS) solutions in the Wabamun area west of Edmonton, Alberta, near Capital\nPower's Genesee Generating Station.\n\n   Enbridge and Capital Power have agreed to jointly evaluate and advance a\nCCS project, with Enbridge as the transportation and storage service\nprovider and Capital Power as the CO(sub)2 (/sub)provider, subject to the\nGovernment of Alberta's competitive carbon hub selection process and a\nfuture final investment decision. Enbridge, with the support of Capital\nPower, is applying to develop an open access carbon hub in the Wabamun area\nthrough the Government of Alberta's Request for Full Project Proposals\nprocess, which is expected to start as early as December 2021.\n\n   \"Capital Power is helping build a carbon-neutral future in Alberta by\nadvancing the Genesee CCS Project at our Genesee Generating Station,\" said\nChris Kopecky, Capital Power Senior Vice President and Chief Legal,\nDevelopment and Commercial Officer. \"It's exciting to partner with Enbridge\n- a sustainability leader - on this project and support their efforts in\npursuit of the Open Access Wabamun Carbon Hub. Collaborative development\nthroughout the CCS value chain is key to ensuring that CCS can be deployed\nin a safe, responsible, and cost-effective manner.\"\n\n   \"We're excited to be partnering with Capital Power in support of their\ncommitment to a low-carbon energy future,\" said Colin Gruending, Enbridge\nExecutive Vice President and President, Liquids Pipelines. \"Collaboration\nlike this is critical as we look to advance cost-effective,\ncustomer-focused carbon capture, transportation and storage solutions in\nAlberta and across North America, with a commitment to protecting land,\nwater and the environment and engaging meaningfully with local Indigenous\ncommunities.\"\n\n   The proposed project would serve Capital Power's Genesee Generating\nStation near Warburg, Alberta which currently provides over 1,200 megawatts\nof baseload electricity generation to Albertans. Capital Power is currently\nrepowering the Genesee 1 and 2 units, to create North America's most\nefficient natural gas combined cycle power generation units, positioning\nthem to deliver reliable and affordable electricity for generations to\ncome. The Genesee CCS Project is expected to capture up to 3 million tonnes\nof CO(sub)2 (/sub)annually from the repowered units, which would be\ntransported and stored through Enbridge's open access carbon hub that could\nalso serve several other local industrial companies. Subject to the award\nof carbon sequestration rights and regulatory approvals, the proposed\nproject could be in service as early as 2026.\n\n   In October, with Capital Power's support, Enbridge responded to the\nGovernment of Alberta's call for Expressions of Interest to construct and\noperate carbon storage hubs. Within its proposal, Enbridge outlined its\nplans to develop an open access carbon storage hub with cost-effective,\ncustomer-focused CCS solutions in the Wabamun area while minimizing any\ninfrastructure footprint to protect land, water and the environment.\n\n   Capital Power Forward-Looking Information\n\n   Certain information in this news release is forward-looking information\nfor Capital Power within the meaning of Canadian securities laws as it\nrelates to anticipated financial or operating performance or events. When\nused in this context, words such as \"expect\" or similar words suggest\nfuture outcomes. By their nature, such statements are subject to\nsignificant risks, assumptions and uncertainties, which could cause Capital\nPower's actual results and experience to be materially different than the\nanticipated results. Forward-looking information or statements included in\nthis news release are provided to inform Capital Power's shareholders and\npotential investors about management's assessment of future plans and\noperations. This information may not be appropriate for other purposes.\nMaterial forward-looking information in this press release includes\nexpectations around the Genesee CCS project including (i) timing of\ncommencement of the Government of Alberta's Request for Full Project\nProposals process, (ii) in-service timing, and (iii) the volume of CO2 to\nbe captured annually from the repowered Genesee 1 and 2 units.\n\n   These statements are based on certain assumptions and analyses made by\nCapital Power in light of its experience and perception of historical\ntrends, current conditions, expected future developments, and other factors\nit believes are appropriate, including assumptions around: (i) performance;\nand (ii) the status of and impact of policy, legislation and regulations.\nWhether the actual outcomes will conform to Capital Power's expectations is\nsubject to a number of known and unknown risks and uncertainties which\ncould cause the actual outcomes to differ materially from Capital Power's\nexpectations. Such material risks and uncertainties are: (i) regulatory and\npolitical environments including changes to environmental legislation; and\n(ii) changes in general economic and competitive conditions. See Risk\nFactors in Capital Power's 2020 Integrated Annual Report, for further\ndiscussion of these and other risks.\n\n   Readers are cautioned not to place undue reliance on any such\nforward-looking statements, which speak only as of the news release date.\nCapital Power does not undertake or accept any obligation or undertaking to\nrelease publicly any updates or revisions to any forward-looking statements\nto reflect any change in Capital Power's expectations or any change in\nevents, conditions or circumstances on which any such statement is based,\nexcept as required by law.\n\n   Enbridge Forward-Looking Information\n\n   Forward-looking information, or forward-looking statements, have been\nincluded in this news release to provide information about Enbridge Inc.\n(\"Enbridge\" or the \"Company\") and its subsidiaries and affiliates,\nincluding management's assessment of Enbridge and its subsidiaries' future\nplans and operations. This information may not be appropriate for other\npurposes. Forward-looking statements are typically identified by words such\nas \"anticipate\", \"expect\", \"project\", \"estimate\", \"forecast\", \"plan\",\n\"intend\", \"target\", \"believe\", \"likely\" and similar words suggesting future\noutcomes or statements regarding an outlook. Forward-looking information or\nstatements in this news release include statements with respect to the\nGenesee CCS Project and Enbridge's proposed Open Access Wabamun Carbon Hub,\nincluding the benefits thereof and prospective in service date.\n\n   Although Enbridge believes these forward-looking statements are\nreasonable based on the information available on the date such statements\nare made and processes used to prepare the information, such statements are\nnot guarantees of future performance and readers are cautioned against\nplacing undue reliance on forward-looking statements. By their nature,\nthese statements involve a variety of assumptions, known and unknown risks\nand uncertainties and other factors, which may cause actual results, levels\nof activity and achievements to differ materially from those expressed or\nimplied by such statements. Assumptions regarding the expected supply of\nand demand for crude oil, natural gas, NGL and renewable energy, and the\nprices of these commodities, are material to and underlie all\nforward-looking statements, as they may impact current and future levels of\ndemand for the Company's services. Similarly, energy transition, including\nthe drivers and pace thereof, the COVID-19 pandemic, exchange rates,\ninflation and interest rates impact the economies and business environments\nin which the Company operates and may impact levels of demand for the\nCompany's services and cost of inputs, and are therefore inherent in all\nforward-looking statements. Due to the interdependencies and correlation of\nthese macroeconomic factors, the impact of any one assumption on a\nforward-looking statement cannot be determined with certainty. The most\nrelevant assumptions associated with forward-looking statements on\nannounced projects and projects under construction, including estimated\nin-service dates, include the following: the impact of litigation and\ngovernment, regulatory and stakeholder actions and approvals on\nconstruction and in-service schedules; the availability and price of labour\nand construction materials; the effects of inflation and foreign exchange\nrates on labour and material costs; the effects of interest rates on\nborrowing costs; technology-related matters; and the impact of weather.\n\n   Enbridge's forward-looking statements are subject to risks and\nuncertainties, including, but not limited to those risks and uncertainties\ndiscussed in this news release and in the Company's other filings with\nCanadian and United States securities regulators. The impact of any one\nrisk, uncertainty or factor on a particular forward-looking statement is\nnot determinable with certainty as these are interdependent and Enbridge's\nfuture course of action depends on management's assessment of all\ninformation available at the relevant time. Except to the extent required\nby applicable law, Enbridge assumes no obligation to publicly update or\nrevise any forward-looking statements made in this news release or\notherwise, whether as a result of new information, future events or\notherwise. All subsequent forward-looking statements, whether written or\noral, attributable to Enbridge or persons acting on the Company's behalf,\nare expressly qualified in their entirety by these cautionary statements.\n\n   About Capital Power\nCapital Power (TSX: CPX) is a growth-oriented North American wholesale\npower producer with a strategic focus on sustainable energy headquartered\nin Edmonton, Alberta. We build, own, and operate high-quality,\nutility-scale generation facilities that include renewables and thermal. We\nhave also made significant investments in carbon capture and utilization to\nreduce carbon impacts and are committed to be off coal in 2023. Capital\nPower owns over 6,400 MW of power generation capacity at 26 facilities\nacross North America. Projects in advanced development include 425 MW of\nowned renewable generation capacity in North Carolina and Alberta and 560\nMW of incremental natural gas combined cycle capacity from the repowering\nof Genesee 1 and 2 in Alberta.\n\n   About Enbridge Inc.\nEnbridge Inc. is a leading North American energy infrastructure company. We\nsafely and reliably deliver the energy people need and want to fuel quality\nof life. Our core businesses include Liquids Pipelines, which transports\napproximately 25 percent of the crude oil produced in North America; Gas\nTransmission and Midstream, which transports approximately 20 percent of\nthe natural gas consumed in the U.S.; Gas Distribution and Storage, which\nserves approximately 3.8 million retail customers in Ontario and Quebec;\nand Renewable Power Generation, which owns approximately 1,766 megawatts\n(net) in renewable power generation capacity in North America and Europe.\nThe Company's common shares trade on the Toronto and New York stock\nexchanges under the symbol ENB. For more information, visit\nwww.enbridge.com.\n\n//st\nMedia Relations                  Investor Relations\nKatherine Perron                 Randy Mah\nMedia Relations &amp; Communications Director, Investor Relations\nManager\nEmail: kperron@capitalpower.com  Email: investor@capitalpower.com\nPhone: 1-780-392-5335            Phone: 780-392-5305\nAfter-hours contact:             Toll-Free: 1-866-896-4636\n1-780-392-5234\n\nEnbridge\nMedia       Investment Community\nJesse Semko     Andrew Swales\nToll Free: (888) 992-0997   Toll Free: (800) 481-2804\nEmail: media@enbridge.com   Email: investor.relations@enbridge.com\n//et\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133200285.MNPRE2133201443-06593320211129</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}