{"date": "2021-11-26 20:24:34.945000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3504.56, "close": 3507.07}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>November 26, 2021</p></div><div class=\"tr-npp-lead\"><p>When fall hits, I get more and more calls on my national radio show from people looking for easy ways to make extra cash. I get it. When you're buying gifts for lots of friends and family, it adds up quickly.</p><p>Sadly, remote job scams are everywhere. The worst thing you can do is search for \"make money online.\" I have your back.</p></div><div class=\"tr-npp-body\"><p>During this time of year, look for ways to save hard-earned dollars, too.</p><p>Every holiday shopping season, I like to revisit Amazon security essentials, so you don't have to worry about spoiling a surprise or putting your privacy at risk.</p><p>1. Stop Amazon from tracking your browsing</p><p>Amazon tracks your entire browsing activity by default. The company saves your searches, including items you recently viewed along with product categories.</p><p>These details let Amazon create ads that specifically target you and your interests. The bad news is that anyone you share a computer or an account with can also see those ads.</p><p>Here's how to stop Amazon from tracking your browsing activity:</p><p>Log in to your account at Amazon.com.</p><p>On the upper menu under the Amazon search bar, click on Browsing History.</p><p>On the next page, click on the Manage history drop-down arrow.</p><p>Toggle Turn Browsing History on/off to Off.</p><p>You also can click Remove all items from view to clear out your history.</p><p>Then turn off personalized ads in a few clicks:</p><p>Go to Your Account page.</p><p>Under Communication and content, click Advertising preferences.</p><p>On this page, select Do not show me interest-based ads provided by Amazon, then click Submit.</p><p>It feels like the tracking never ends ... because it doesn't.</p><p>2. Don't let Alexa spoil the surprise</p><p>If you have an Echo device, Alexa can automatically give you delivery updates for items you order. This convenience could be a big problem during the holidays. Alexa loudly announces the delivery, ruining the surprise. Now, your gift recipient knows what to expect.</p><p>To keep the element of surprise for your gift orders, follow these steps to disable the feature in the Alexa app:</p><p>Open the Alexa app on your phone.</p><p>Tap More &amp;gt; Settings &amp;gt; Notifications.</p><p>Select Amazon Shopping. Here you can set your preferences for allowing Alexa to say or show what you've purchased, announce deliveries, and give you updates on returns.</p><p>Alexa is helpful, but she's nosy, too.</p><p>3. Make your lists private</p><p>There are two main \"lists\" on Amazon: The Shopping List and the Wish List. Your wish lists keep track of everything you want to buy later for yourself or your friends and family.</p><p>These lists are private by default now, but you may have set one to public years ago without realizing it.</p><p>If so, anyone in the world could find your wish list by searching your name. If you have a common name, it's tougher to sniff you out. But if strangers find out where you live, they may deduce and identify your profile.</p><p>To check the privacy settings of your Amazon Lists:</p><p>Click on the Accounts &amp; Lists drop-down box next to the search bar, then select Wish List.</p><p>Click the three dots next to Send list to others on the top right, then select Manage List.</p><p>Here, you can change your list details. This includes your list name, the name of the recipient, email, birthday, and privacy.</p><p>To change the list's privacy settings from Public, click on and select Private on the drop-down box.</p><p>4. Remove your public profile</p><p>People are always surprised when I tell them they have a public Amazon profile. It is created automatically, whether you want it or not. It contains comments, ratings, public wish lists, biographical information, and other site interaction.</p><p>It doesn't include your purchases or browsing history, but it's still very informative. If you want to control what activity is visible on your public profile, follow these steps:</p><p>Sign in to your Amazon account. Click Accounts &amp; Lists.</p><p>Scroll down. Under Ordering and shopping preferences, click Your Amazon profile.</p><p>Click the yellow box marked Edit your public profile. Here, you'll see Edit profile and Edit privacy settings.</p><p>If you want a quick look at what information you're sharing publicly, click View your profile as a visitor. If your profile shows your real name or other information you don't want, go back to the profile settings page and click the Edit profile tab. It's located right next to the Edit privacy settings tab.</p><p>You can edit or delete any information like your bio, occupation, and location. You can even change the \"public name\" on your profile and post reviews anonymously.</p><p>5. Protect yourself from accidental purchases</p><p>When I'm in gift-buying mode, I don't think as much about every package that shows up at my door. I might just grab it and tuck it away in a closet for wrapping up later. How annoying would it be to open a box a few weeks later and realize it's something you never meant to order?</p><p>Voice ordering through an Echo speaker sounds convenient, but it's probably something you only run into by accident for most people.</p><p>Disable voice purchasing by following these steps:</p><p>Open your Alexa app.</p><p>Tap the three bars in the lower right corner and select Settings &amp;gt; Account Settings.</p><p>Tap Voice Purchasing &amp;gt; Purchase controls. Here, you can enable a 4-digital code, allow anyone to make purchases, or disable voice purchasing altogether.</p><p>If you set up the 4-digital Voice Code, it must be spoken out to complete a purchase on your Alexa-enabled device. Of course, anyone can listen in and reuse your code.</p><p>A voice-purchasing PIN adds a bit of security, but it's hardly foolproof.</p><p>The views and opinions expressed in this column are the author's and do not necessarily reflect those of USA TODAY.</p><p>Tech Talk</p><p>Kim Komando</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Gannett</p></div>"}