{"date": "2022-01-13 19:33:58.070000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3304.14, "close": 3242.76}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>TORONTO and SAN FRANCISCO, Jan.  13, 2022  (GLOBE NEWSWIRE) -- <a href=\"https://www.globenewswire.com/Tracker?data=z7EVxrM0IFs64RmVvo0yHnN06QkwkvSdtDvzGrOsuLJZBxVxzchTQKOjzcrhz47XfsugEVpGwRMqUMT6o3icCg==\"><u>Perpetua</u></a>, a global leader in eCommerce advertising and intelligence software today released their <a href=\"https://www.globenewswire.com/Tracker?data=bmF-Idh3OJtqIvaTnHnixUC7nkUo_WkYlpKvb2H_d-L38U0LN_a2prN1-QQgvkNMQecEoV7YBpZPL8JEGUnZiFpoiPgNSo_R73z1KwkUe4F5YWCVbasWbYEoQlwJ3BsKMWdK0XP_BHXmurhXrXuCv5EdbGMKUvkfx0XZIcZqvZiPvSlA__UCssKi8o19pE75ncxu4U5vOzFUHx6g1SthDLohzq_q2b-4rCti5WhXz-VcFIIMnD5N_AGYJznXabwe\"><u>2021 Q4 Benchmark Report</u></a> showcasing the most important trends and metrics on Amazon, to help inform marketplace advertising strategy.<strong> Included in the report this year are Q4 benchmark ad performance for Instacart, Walmart and Target.</strong><br/></p><p>Perpetua's 2021 Q4 Benchmark Report is based on performance data from campaigns under Perpetua's management. With Q4 being the most competitive quarter of the year with Black Friday Cyber Monday, and holiday shopping, Sponsored Display CPC was up 20% quarter-over-quarter. This is the highest jump across all paid search ad units on Amazon and may partly be attributed to more advertisers taking advantage of Sponsored Display's newly released features (including custom creatives and purchases remarketing). Along with placements being more expensive, there was also a drop off in CTR and ROAS. It is worth noting however, despite all the above, customers who are clicking through are converting at a 13% higher rate compared to Q3.</p><p>“Advertising proved to be an important piece of this holiday season as consumers increased the rate at which they clicked on ads while reducing the amount of products they considered. This led to a relatively steady ROAS for advertisers despite CPCs rising over 30%,” says Adam Epstein, President at Perpetua. “Also worth noting, in Q4 we saw more advertisers push their marketing budgets higher up the funnel with a goal to attract more new-to-brand customers. We expect this to continue through 2022 as Amazon continues to increasingly capture more brand-awareness budgets from advertisers with DSP and OTT to drive incremental sales growth.”</p><p>While Amazon Sponsored Brand ads are typically an upper-funnel strategy, it has become increasingly effective at driving sales with greater efficiency than Sponsored Product ads. As such, advertisers have shifted budget towards Sponsored Brands where spend has increased 39% in Q4. Increasing competition and CPCs has been the story of Amazon Advertising for the last year. It is an optimistic sign to see CPCs flatten this quarter amid the most competitive season of the year, along with the expected increase in CVR, sellers are seeing an overall boost in Sponsored Product efficiency.</p><p>Q4 represents a season with higher traction and engagements across all Amazon Advertising campaigns. Q4 2021 saw brands’ focus largely placed on top of funnel campaigns to reach new-to-brand shoppers, and to drive brand and product awareness ahead of Black Friday and Cyber Monday, and Holiday shopping. As a result, new-to-brand purchases significantly increased, up 159% over Q3, and aided in growing the retargeting audience pools. In addition, within Amazon DSP, Amazon Publisher Services (AZPS) saw a significant increase in CPM costs but did not decrease in ROAS, and actually hugely improved in both Purchase Rate and New-to-brand Purchase Rate in Q4. This could be a signal towards a change in shopping behavior during the busier Black Friday Cyber Monday and Holiday shopping season, in which shoppers are making quicker purchases after being exposed to display ads outside of Amazon on publisher sites.</p><p>Perpetua Q4 Benchmark Report also examines ad performance on Instacart where advertisers increased investment by over 30%, contributing to proportionate rise in sales growth. Advertisers on Instacart maintained ROAS and conversion despite increasing competition during Q4. Despite cost-per-click and a significant drop in click-through-rate, advertisers were able to maintain conversion rates and ROAS during this peak shopping period.</p><p><strong>New to the report this year Perpetua includes Target and Walmart Q4 ad performance</strong>.</p><ul type=\"disc\" class=\"bulleted-list arrowlist\"><li style=\"margin-top:12pt\">Through the holiday season, advertisers continued to invest in Target driving a strong 33% growth in sales quarter-over-quarter. A huge 85% increase in CTR balanced out rising CPCs to make the 2021 holiday season profitable for advertisers</li><li style=\"margin-bottom:12pt\">Holiday season pushes advertisers to scale investment towards Walmart, driving a strapping 75% growth in incremental sales in November month-over-month. Walmart has proven its potential and quickly became one of the primary eCommerce advertising platforms, as the holiday shopping season sent many consumers to the eCommerce giant. With a surge in traffic across the month of November due to their Black Friday Deals for Days events and many others, advertisers increased ad investment by 76% from October to November in order to maintain market visibility and conversions.</li></ul><p><strong>Q4 2021 Amazon Benchmark Report Highlights</strong>:</p><ul type=\"disc\" class=\"bulleted-list arrowlist\"><li style=\"margin-top:12pt\">With more advertisers leaning to Sponsored Brands video to attract shoppers to their product, there was a decrease in CPC and CPA in Q4 compared to Q3.<br/></li><li>Compared to Q4 2020, Sponsored Brands saw a 33% increase in attributed sales in Q4 2021.<br/></li><li>Along with the increase in sales, spend and impressions, Sponsored Display saw a 12% drop off in clicks signalling less engagement with the ad unit quarter-over-quarter.<br/></li><li>Sponsored Display CPC was up 20% quarter-over-quarter. This is the highest jump across all paid search ad units.<br/></li><li>Responsive eCommerce Creatives, within Amazon DSP, had the highest avg CPM growth at 40% higher than previous quarter.<br/></li><li>Category Highlights<br/> <ul type=\"disc\" class=\"bulleted-list arrowlist\"><li>Holiday season resulted in huge growth for Toys + Kids category, with a 324% increase. Books also saw a surge with 254% increase.</li><li>Beauty has the highest CVR &amp; CTR of all of the categories - 43% average CVR &amp; 0.72% average CTR.</li><li>Food was the 4th biggest growing category in Q4</li><li style=\"margin-bottom:12pt\">Electronics saw a 2% decrease in sales in Q4</li></ul> </li></ul><p><strong>About Perpetua.</strong></p><p>Perpetua is building the growth infrastructure for eCommerce which includes optimization and reporting technology for the world's smartest eCommerce businesses. Through the platform, advertisers create goals based on strategy and leverage Perpetua's best in class experts and automation to execute tactically. Integrations with Amazon, Instacart and Google ensure brands achieve optimal reach and engagement across the full shopper journey, and provide unified performance intelligence for maximum visibility. Perpetua is an Ascential company and has offices in San Francisco, Toronto, London and Tokyo. To learn more, visit <a href=\"https://www.globenewswire.com/Tracker?data=jSkpGDm2xibadrBxKBoGbFjBu8z6C5Uxh-hkE9ewxRhrQZlzWcN99Pt748-4dq02ePDOdK16AKi0h57wVIr3mw==\"><u>perpetua.io</u></a></p><p><strong>For media interviews please contact:</strong></p><p>Wendy Bairos</p><p>wendy@perpetua.io</p><p>416-831-9820</p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODQyNjY5NyM0NjU1MDM5IzUwMDA4NDA4Mw==\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RReU5qWTVOeU0wTmpVMU1ETTVJelV3TURBNE5EQTRNdz09&amp;key=6ad16401af3787603d7f847e4a3d21c4e8aa199431db991239fd604c068105f7dd6ca185a621c8bec68a33d7fc7d72713f9c7ec3e45a486a52de3edfc6d6a182\"/></div></div><br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/YzIwM2EyNTctNzMwYS00YTMyLThiY2ItZjQzYjZjNzU1NjMwLTUwMDA4NDA4Mw==/tiny/Perpetua-Labs.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9Zekl3TTJFeU5UY3ROek13WVMwMFlUTXlMVGhpWTJJdFpqUXpZalpqTnpVMU5qTXdMVFV3TURBNE5EQTRNdz09L3RpbnkvUGVycGV0dWEtTGFicy5wbmc=&amp;key=55ce91deaf6056d031383c30549e67d15c879248be8961c04265683e5bd0c19f51a00ffdd786f070d63d36cf9353109ebb61b44871a0bb6c239ed0d16ff23071\"/></div></div><p><a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/656198e3-3b1a-4f68-84ed-b940e997ed41\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Primary Logo\" border=\"0\" src=\"https://ml.globenewswire.com/media/656198e3-3b1a-4f68-84ed-b940e997ed41/small/perpetua-c2e60-png.png\" style=\"max-height:32px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS82NTYxOThlMy0zYjFhLTRmNjgtODRlZC1iOTQwZTk5N2VkNDEvc21hbGwvcGVycGV0dWEtYzJlNjAtcG5nLnBuZw==&amp;key=d962530753ad672eb3038741bd6c982f5d21b9a5e642045c703dbcfbd954df0b6eb4083c1ed9e59d54919b5cc08f5793c8da7a836b48d6c8567ce760bb3d991a\"/></div></div></a></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">GlobeNewswire, Inc. 2022</p></div>"}