{"date": "2022-01-09 16:52:35.644000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon has filed a legal challenge at the National Company Law Appellate Tribunal (NCLAT) against the Competition Commission of India\u0092s (CCI) suspension of the US e-commerce giant\u0092s 2019 deal with Future Retail (FRL). Amazon has challenged the CCI order on at least five grounds, and the matter is likely to be listed this week, according to the sources.</p><p>Last year in December, the CCI suspended Amazon\u0092s 2019 deal worth Rs 1500 crore with Future Retail (FRL), citing the company\u0092s alleged deliberate design to suppress information about the scope and purpose of the deal. The antitrust regulator had imposed a penalty of Rs 200 crore on Amazon to be paid within 60 days of receipt of the order. In its 57-page order, the competition watchdog said it considered it necessary to examine the combination afresh, given that the two players were known in the online marketplace and offline retailing and had contemplated strategic alignment between their businesses. It had said for the intervening period the CCI approval provided in 2019 \u0091shall remain in abeyance\u0092.</p></div><div class=\"tr-npp-body\"><p>However, according to people familiar with Amazon\u0092s strategy, when the firm submitted the document to CCI, it clearly mentioned that the company\u0092s investment in Future Coupons was a strategic investment as the government at some point in time may allow investment into the multi-brand retail sector in the country. Amazon\u0092s legal team is expected to make the argument that there was no misrepresentation of facts and all the information had been clearly mentioned.</p><p>\u0093CCI does not have authority to unwind the deal approval post 12 months. The 'abeyance' won\u0092t be applicable. CCI either had to approve or revoke the deal within 12 months,\u0094 said a person familiar with Amazon\u0092s strategy. \u0093Also, it would be contended that CCI did say that all information was there but Amazon should have emphatically pointed out FRL.\u0094</p><p>A query sent to Amazon related to this development remained unanswered till the time of going to press.</p><p>\u0093It would also be contended that Future Coupons which was a joint applicant and a beneficiary post receiving funds from Amazon is now a complainant and seeking cancellation of the deal post receiving the money and using it,\u0094 said the person familiar with Amazon\u0092s strategy.</p><p>This issue goes back to August 2019, when Amazon acquired 49 per cent stake in Future Coupons, the promoter entity of FRL (Future Retail), for around Rs 1,500 crore. One year later, in August 2020, Future Group struck a $3.4-billion asset-sale deal with Reliance Industries (RIL).</p><p>In October 2020, Amazon had sent a legal notice to Future for striking a deal with RIL. It alleged that Future\u0092s $3.4-billion asset sale deal with RIL breached an agreement with Amazon. It cited its non-compete agreement with the Kishore Biyani-led chain. The deal specified any disputes would be arbitrated under the Singapore International Arbitration Centre (SIAC) rules. The same month, October 2020, Amazon got a favourable ruling for its plea in SIAC against the deal.</p><p>In November 2020, Future moved the Delhi High Court (HC) against Amazon, alleging interference by the US firm in the deal with RIL. Since then, Amazon has been fighting a legal battle with FRL to stop Future\u0092s $3.4-billion deal with RIL.</p><p>In August last year, the Supreme Court (SC) had ruled in favour of Amazon, upholding the Singapore emergency arbitrator award against the Future-Reliance deal as enforceable in India. But in a major relief to Future Group, the SC stayed proceedings before Delhi HC in September last year, ordering no coercive action. The court also directed the National Company Law Tribunal, CCI, and the Securities and Exchange Board of India to not pass any final order in relation to the dispute for four weeks.</p><p>In November last year, the SC extended by two weeks the time granted to CCI by Delhi HC to take a decision with respect to the show-cause notice issued by it to Amazon over the deal with Future Group.</p><p>However, this year, the Delhi High Court (HC) on Wednesday stayed the arbitration proceedings in relation to Future Group\u0092s 2019 deal with Amazon before the Singapore tribunal. This is a major relief to Kishore Biyani and his retail group Future. A division Bench also stayed the order of the single judge who had refused to intervene in the matter, dismissing the pleas filed by the two subsidiaries of Future Group on Tuesday. The single judge of the HC had denied interfering in the ongoing arbitration proceedings before the Singapore International Arbitration Centre (SIAC).</p><p>However, legal experts said the order has created a 'conflict of laws' situation, defeats the sole crux of the contractual arrangement, and may dissuade foreign companies from entering the Indian market.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Business Standard Ltd.</p></div>"}