{"date": "2021-12-13 18:34:50.259000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>In Illinois, at least two people were killed after severe weather</p><p>blew the roof off an Amazon warehouse. That`s in Edwardsville, about 25</p></div><div class=\"tr-npp-body\"><p>miles east of St. Louis. We`re going to keep you posted as the morning</p><p>progresses. But as we`ve been seeing these pictures, already so devastating</p><p>and that`s before first light. Still waiting to assess, but there`s the</p><p>potential of this being the longest tornado track in U.S. recorded history,</p><p>so it`s very bad.</p><p>DANA JACOBSON: Welcome back to CBS SATURDAY MORNING. Recapping the latest and the on our breaking news this morning. There are damage assessments and fears over the missing after a series of deadly storms struck parts of the nation`s midsection overnight. At least five people were killed in the suspected tornadoes which barreled through Arkansas and Tennessee. But concerns are growing in Kentucky. The Governor there says a roof collapsed, likely trapped workers inside a candle factory in Mayfield. He fears the death toll is over 50 and could even hit as many as 100. That number has not yet been confirmed.</p><p>In Illinois, at least two people were killed after severe weather blew the roof off an Amazon warehouse. That`s in Edwardsville, about 25 miles east of St. Louis. We`re going to keep you posted as the morning progresses. But as we`ve been seeing these pictures, already so devastating and that`s before first light.</p><p>JERICKA DUNCAN: Oh, yeah. And here as Berardelli talked about just how long it lasted, over 200 miles and on the ground for hours and hours, just devastating those communities.</p><p>JEFF GLOR: Still waiting to assess, but there`s the potential of this being the longest tornado track in U.S. recorded history, so it`s very bad. And as these pictures come in, you`re seeing how bad the damage of these buildings was and, of course, our concern for all the workers who were inside.</p><p>DANA JACOBSON: Yeah. And we`ll keep everybody updated here. Also CBSN, our streaming service, will have the very latest for you.</p><p>To some other news now, we want to turn to some news that is making -- some of the stories that are making news this morning, our headlines for you.</p><p>There is reaction this morning to the Supreme Court`s ruling on the controversial Texas abortion law on Friday. The court said clinics in Texas can sue over the most restrictive abortion law in the nation while maintaining the State`s ban on abortions.</p><p>The White House said President Biden is, quote, \"very concerned\" by the high court`s decision. A group against abortion rights interpreted the ruling as the court`s way of stepping back from the debate, suggesting the law be decided by state legislatures.</p><p>JEFF GLOR: Long-time Kansas senator and Republican statesman Bob Dole was remembered in two services in Washington Friday. At the World War II Memorial, Dole who suffered lifetime injuries during that war was credited with bringing that site to life. At the funeral inside the National Cathedral, President Biden eulogized his friend of 50 years, calling him a genuine hero, and a man of enormous integrity, who was not afraid to reach across the aisle.</p><p>PRESIDENT JOE BIDEN: He wanted government to work -- to work for folks like him who came up the hard way. \"Just give everybody a chance, Joe. Just a chance.\"</p><p>JEFF GLOR: The flag-draped casket will be in Dole`s hometown of Russell, Kansas this weekend before being interred at Arlington National Cemetery. Bob Dole was 98 years old.</p><p>JERICKA DUNCAN: Well, the CEO of <a href=\"http://better.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">better.com</a> is taking some time off after a video of a Zoom call showing him firing 900 workers went viral this week. Vishal Garg apologized for, quote, \"blundering the execution\" of communicating the layoffs at the mortgage company.</p><p>He says they were based on the market performance and productivity of the workers in the U.S. and India markets. The company`s board says it`s hiring an outside group to conduct what it has described as a leadership and cultural assessment.</p><p>DANA JACOBSON: Cybersecurity experts are racing to fix one of the worst known software vulnerabilities in years. The flaw was discovered in the online game Minecraft. If you have kids, most likely they are very into this game.</p><p>It is expected to hit millions of servers. The trouble was discovered Friday in an open source utility that`s widely used by government and the tech industry. It could allow criminals to steal valuable data and let them plant malware or erase crucial information. The fallout won`t be known for several days.</p><p>We have much more news ahead, but right now we want to get a quick check of the weather for your weekend.</p><p>(LOCAL WEATHER)</p><p>DANA JACOBSON: He made his name as a member of The Monkees. But Michael Nesmith had an eclectic career in music as a songwriter, a music video pioneer, and even as a founder of a new style of rock. We`ll remember him next. You`re watching CBS SATURDAY MORNING.</p><p>(ANNOUNCEMENTS)</p><p>END</p><p>(Copy: Content and programming Copyright MMXXI CBS Broadcasting Inc. ALL RIGHTS RESERVED. Copyright 2021 ASC Services II Media, LLC. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of ASC Services II Media, LLC. You may not alter or remove any trademark, copyright or other notice from copies of the content.)</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021</p></div>"}