{"date": "2021-12-09 11:04:24.639000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.29, "close": 3483.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">Italy's anti-trust authority has fined Amazon 1.13 billion euros, accusing the company of exploiting its dominant position against independent sellers on its website in violation of European Union competition rules</p><p class=\"tr-npp-section-title\">A growing effort to unionize Starbucks stores is facing its first major test</p><p class=\"tr-npp-section-title\">The head of Instagram, appearing before a Senate panel, met with deep skepticism over new measures the platform is adopting to protect young users nd the company's commitment to transparency</p><p class=\"tr-npp-section-title\">Global stocks are mostly higher as investors wait for U.S. inflation data that might influence the Federal Reserve's decision on when to roll back economic stimulus</p><p class=\"tr-npp-section-title\">China's central bank governor says financial markets can cope with the impact of a real estate developer that is struggling to avoid defaulting on $310 billion in debt</p><p class=\"tr-npp-section-title\">The European Union has unveiled plans to improve conditions for the growing number of gig economy workers that could reclassify some as employees who must earn benefits</p><p class=\"tr-npp-section-title\">British Prime Minister Boris Johnson has apologized and ordered an inquiry after a leaked video showed senior members of his staff joking about holding a lockdown-breaching Christmas party</p><p class=\"tr-npp-section-title\">Banana peels, chicken bones and leftover veggies won't have a place in California trashcans under a mandatory residential food waste recycling program set to go into effect across the state in January</p><p class=\"tr-npp-section-title\">Olaf Scholz has become Germany's ninth post-World War II chancellor, opening a new era for the European Union's most populous nation and largest economy after Angela Merkel's 16-year tenure</p><p class=\"tr-npp-section-title\">A company once owned by \"Pharma Bro\" Martin Shkreli will pay up to $40 million to settle allegations that it jacked up the price of a life-saving medication by roughly 4 ,000% after obtaining exclusive rights to the drug</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 The Associated Press.  All rights reserved. This material may not be published, broadcast, rewritten or redistributed.</p></div>"}