{"date": "2022-01-04 14:57:06+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>VISTAS MEDIA ACQUISITION CORP (\"VMAC-Q\")\n- Anghami Delivers a New Interactive Experience Through\n- Partnership With Amazon Alexa\n\n     Anghami Inc. (\"Anghami\" or the \"Company\"), the leading music streaming\nplatform and service in the Middle East and North Africa, is now providing\nusers in KSA and UAE a seamless innovative experience by rolling out access\nto its skills in not only English but also in Arabic language through its\npartnership with Alexa, Amazon's smart assistant technology.\n\n     Being among the first Arabic and English skills built for Alexa,\nAnghami aims to deliver a seamless localized music experience in a Khaleeji\nArabic voice, as well as in English, embodying the rich Arab culture by\noptimizing the experience for both its Arabic and English-speaking users.\n\n     These skills offer Anghami users in the UAE and KSA an enhanced\ninteractive experience that allows them to play music that fits their mood,\nstream their favourite podcasts, listen to religious content and control\nmillions of songs by simply conversing with Alexa using local\npronunciations and intonation in both Arabic and English dialects.\nCustomers with smart devices will simply need to connect their Anghami\naccounts to their Alexa device and start the conversation by saying \"Alexa,\nstart Anghami music\" and the skill will welcome them providing a wide range\nof Arabic content available on the platform.\n\n     \"In recognition of the importance of our Arabic language, this\npartnership will further enhance the experience for our customers and help\nto spread our culture worldwide\", commented Elie Habib, Co-Founder and CTO\nof Anghami. He added, \"As part of our continued commitment to elevating the\nmusic industry and incorporating leading technology capabilities, we are\nthrilled to partner with Amazon to bring an innovative experience to our\ncustomers in KSA and UAE.\"\n\n     \"We are very excited to team up with Anghami, the region's leading\ndigital music platform, giving customers access to millions of\ninternational and Arabic songs and podcasts. Only by using their voice,\ncustomers can ask Alexa to play their favorite songs from the region's\nlargest music catalog in Arabic\", said Eric Saarnio, VP Devices and\nServices, Amazon.\n\n     On October 14, 2021, Vistas Media Acquisition Company Inc.\n(NASDAQ:VMAC), a publicly traded special purpose acquisition company\n(\"SPAC\") led by CEO F. Jacob Cherian and co-founders Saurabh Gupta and\nAbhayanand Singh, and Anghami announced the submission of a Registration\nStatement on Form F-4 to the U.S. Securities and Exchange Commission with\nrespect to their proposed business combination. The business combination is\nsubject to customary closing conditions, including the approval of VMAC's\nstockholders, and is expected to be consummated in the first quarter of\n2022. Upon the closing of the business combination, the Company will\noperate under the Anghami name and is expected to be listed on NASDAQ\ntrading under the new symbol \"ANGH\". For more information about the\ntransaction, please visit <a href=\"https://vmac.media\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://vmac.media</a>/.\n\n     About Anghami\n\n     Anghami is the leading digital music entertainment technology platform\nin the Middle East and North Africa, with the largest catalog comprising\nmore than 57 million songs available for more than 70 million users. When\nit launched in 2012, Anghami was the first music-streaming platform in\nMENA. In digitizing the region's music, it has become the best-known and\nbest-loved brand in music streaming in MENA. Today, Anghami features\nlicensed content from leading Arabic labels, independent artists, and\ndistributors. Anghami also features music from the major international\nlabels such as Universal, Sony, Warner and is continuously licensing new\ncontent.\n\n     Headquartered in Abu Dhabi, it has offices in Beirut, Dubai, Cairo,\nand Riyadh and operates in 16 countries across MENA. It is the only service\navailable in English, Arabic and French, and remains close to its customer\nbase, not only thanks to its pan-regional presence but also via the 56\nmillion user data points it generates every day.\n\n     To learn more about Anghami, please visit www.anghami.com\n\n     About Vistas Media Acquisition Company Inc.\n\n     Vistas Media Acquisition Company Inc. is a blank check company, also\ncommonly referred to as a Special Purpose Acquisition Company, or SPAC,\nformed for the purpose of effecting a merger, stock exchange, asset\nacquisition, stock purchase, reorganization or similar business combination\nwith one or more businesses or entities in the Global Media and\nEntertainment sector.\n\n     To learn more about Vistas Media Acquisition Company Inc., please\nvisit <a href=\"https://vmac.media\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://vmac.media</a>.\n\nContact:\n\nF. Jacob Cherian, CEO\n+1 212- 859-3525\nfjc@vmac.media\n\nAshley DeSimone\nAshley.Desimone@icrinc.com\n\nBrett Milotte, ICR\nBrett.Milotte@icrinc.com\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200300544.MNPRE2200301932-06555320220104</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}