{"date": "2021-12-17 01:08:09.895000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3466.3, "close": 3400.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Tech Mahindra, a leading provider of digital transformation, consulting, and business re-engineering services and solutions, announced today its new Premier Consulting Partner status in the AWS Partner Network (APN). This tier is awarded through successful demonstration of competence on multiple fronts such as technical proficiency, customer satisfaction, thought leadership, and revenue recognition.</p><p>This recognition reiterates Tech Mahindra?s position as a dominant leader in cloud and reflects its differentiated industry expertise and notable success in helping customers design, architect, build, migrate, and manage their workloads on AWS. With this collaboration, Tech Mahindra joins a select group of 125 Partners who have achieved the Premier status so far out of the total 6,000+ global AWS Partners.</p></div><div class=\"tr-npp-body\"><p>Sudhir Nair, Senior Vice President and Global Head, Infrastructure and Cloud Services at Tech Mahindra said, ?Tech Mahindra has been at the forefront of delivering human-centric experiences and enabling seamless digital transformation for customers across the globe by leveraging innovative technological solutions. Being recognized as Premier Consulting Partner in the AWS Partner Network is a testament to our commitment towards the same.?</p><p>As an AWS Premier Consulting Partner and AWS Managed Service Provider (MSP) Partner, Tech Mahindra holds certified qualifications like Migration Consulting Competency, Well Architected Framework (WAF), and AWS Solution Provider. This allows Tech Mahindra to help customers become agile, lean, and build reliable platforms and applications on AWS. Over the last five years, Tech Mahindra has built a strong AWS Practice with over 1700+ AWS-accredited associates, including more than 1,000+ AWS-certified engineers and architects across various streams of transformation and a dedicated AWS CoE (Centre of Excellence).</p><p>Tech Mahindra believes in DigitALL philosophy for comprehensive Business Transformation. Digital technologies catalyze the transformations ? they humanize businesses by helping them think, sense, connect, communicate, secure and act better than before. As part of NXT.NOWTM framework, which aims to enhance ?Human Centric Experience?, Tech Mahindra focuses on investing in emerging technologies and solutions that enable digital transformation and meet the evolving needs of the customer.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}