{"date": "2021-11-26 16:12:10.945000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3504.56, "close": 3507.07}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_xdf0k5hp&amp;referenceId=tag:reuters.com,2021:newsml_OVF58Q4CR_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_xdf0k5hp&amp;referenceId=tag:reuters.com,2021:newsml_OVF58Q4CR_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: Climate activists blocked access to some Amazon depots in Europe on Black Friday, saying the firm was a symbol of overconsumption. Julian Satterthwaite reports.<br/>Short Link: <a href=\"https://refini.tv/3rhTzgd\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3rhTzgd</a><br/><br/>Video Transcript:<br/><br/>Climate activists targeted Amazon depots in Europe on Friday. Members of the Extinction Rebellion group blocked access to one warehouse near London. The move was timed to coincide with the Black Friday only shopping event. Activists say it, and Amazon, are symbols of global overconsumption. Banners read \"Black Friday exploits people and the planet\". The group says Amazon has stoked rampant consumerism at the environment's expense. In all 13 depots were targeted around the UK. There were moves to blockade facilities in Germany and the Netherlands too. Some labor organizations also called on warehouse workers to strike in protest over pay. Germany's Verdi union said around 2,500 workers joined industrial action there. Responding, Amazon said it took its social and environmental responsibilities very seriously. The firm says it has committed to going net-zero on emissions by 2040, 10 years ahead of the Paris climate agreement.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}