{"date": "2022-02-01 11:02:53.530000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>India</p></div><div class=\"tr-npp-lead\"><p>India, Feb. 1 -- The Supreme Court on Tuesday set aside Delhi high court's orders in 2021 against the Future Group over its proposed $3.4 billion retail assets sale to Reliance.</p><p>A single judge high court bench's orders in February and March last year put the Future-Reliance deal on hold on the basis of the restraining order by the Singapore International Arbitration Centre (SIAC). By its order in October 2020, SIAC, on a plea by Amazon, stopped Future Group from acting on its resolution to go ahead with its deal with Reliance until the Delhi-seated tribunal finally decided the matter.</p></div><div class=\"tr-npp-body\"><p>The top court referred the matter back to the high court to hear the dispute afresh and deliver a final judgment on the enforceability of the arbitral award and other contentions raised by the two sides.</p><p>\"We have set aside the orders of the Delhi high court dated February 2, 2021, and March 18, 2021. We have also set aside the latest orders passed by the high court and have remanded the matter back to the high court for a decision on merits,\" said a bench headed by Chief Justice of India (CJI) NV Ramana, declaring the verdict on a clutch of petitions arising out of the orders of the high court.</p><p>In a setback for Amazon, the bench, which also included justices AS Bopanna and Hima Kohli, pointed out that the high court's October 2021 order on refusing to stay SIAC's emergency award has also been nixed.</p><p>The Delhi high court's justice JR Midha affirmed the SIAC's emergency arbitrator's order and also ordered attachment of properties of Kishore Biyani and other promoters of the Future Group. The judge issued a show-cause notice to Biyani and others as to why they should not be sent to civil prison, compelling Future Group to approach the top court in August.</p><p>Simultaneously, Future Group moved the tribunal asking for a vacation of the interim stay against it. But SIAC refused to lift its restraint in October 2021.</p><p>The top court on January 11 reserved its verdict in the case while underlining the latest turn of events whereby SIAC rejected Future Group's application to vacate the restraining order. It then observed the previous orders of the single-judge bench in February and March 2021 may not be relevant in view of the latest order of SIAC. The top court said therefore the high court should be asked to decide the case in the light of new developments. It also indicated it would partly set aside the high court order in March 2021, imposing a penalty and issuing a show-cause notice to Biyani and others for breaching SIAC's order.</p><p>Senior advocate Harish Salve, representing Future Group, agreed to sending the matter back to the high court. He added that Future Group is in a financially precarious situation and that 30,000 of its employees will lose their jobs if their deal with Reliance did not go through.</p><p>Senior lawyer Gopal Subramanium, who represented Amazon, emphasised that Future Group must be bound by SIAC's restraining order even if the matter was to go back to the high court.</p><p>The operative part of the judgment, read out by the CJI on Tuesday, said the high court orders have been set aside in their entirety leaving Amazon to press for a restraining order against Future Group afresh. Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}