{"date": "2021-11-08 13:00:06.885000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">Applications Open Now to Prepare Students Nationwide for In-Demand Tech Jobs</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">NASHVILLE, Tenn., Nov. 8, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">NASHVILLE, Tenn.</span>, <span class=\"xn-chron\">Nov. 8, 2021</span> /PRNewswire/ -- The nation's first non-profit software bootcamp,<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3349576-1&amp;h=2049377821&amp;u=https%3A%2F%2Fnashvillesoftwareschool.com%2F&amp;a=%C2%A0\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> </a><u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3349576-1&amp;h=1126015120&amp;u=https%3A%2F%2Fnashvillesoftwareschool.com%2F&amp;a=Nashville+Software+School\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Nashville Software School</a></u> (NSS), announces today it is launching a new software engineering program in collaboration with Amazon to expand opportunities and access to tech careers in <span class=\"xn-location\">Nashville</span> and beyond. The Software Engineering with Java/AWS Specialization online program is available to highly motivated adults across the U.S. who want to acquire the skills necessary to build complex and high-performance software applications, and qualify for in-demand, entry-level software engineering jobs at tech companies and enterprise IT organizations. </p>\n<p>The U.S. Department of Labor projects growth for software engineers at 22% through 2029 and that rate is even higher, and is projected to continue to run higher, in <span class=\"xn-location\">Nashville</span>. A key driver for this growth is building and deploying—or redeploying and modernizing—applications to public cloud platforms like Amazon's AWS. According to a recent Deloitte survey, 68% of CIOs ranked migrating to the public cloud and/or expanding the private cloud as the top IT spending driver in 2020.</p>\n<p>\"We were excited when Amazon approached us with the chance to collaborate with them on using Amazon Technical Academy's proven in-house curriculum as the basis for our Software Engineering program. This is a major milestone in our nine years of opening doors to tech careers in <span class=\"xn-location\">Nashville</span>,\" says <span class=\"xn-person\">John Wark</span>, founder and CEO, Nashville Software School. \"Our new program opens yet another pathway for both local residents and those outside our region to acquire the skills required to launch a rewarding and lucrative career in software development. Consistent with our mission and our other programs, this program is for motivated adults with aptitude—irrespective of whether they have any prior tech training—including the underemployed, financially fragile, or economically disadvantaged as well as those from backgrounds underrepresented in tech careers, including Blacks, Hispanics, women, and veterans.\"</p>\n<p>The NSS program is based on the curriculum from<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3349576-1&amp;h=2767338124&amp;u=https%3A%2F%2Fwww.aboutamazon.com%2Fnews%2Fworkplace%2Famazon-helps-employees-become-software-engineers-in-9-months&amp;a=%C2%A0\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> </a>Amazon Technical Academy, one of Amazon's unique skills training programs, developed by Amazon engineers, to help non-technical Amazon employees with no prior coding experience move into entry-level software engineer roles. Amazon Technical Academy has placed 98% of its internal graduates into software development engineer roles at Amazon. The program is part of Amazon's <span class=\"xn-money\">$1.2 billion</span> <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3349576-1&amp;h=3923281713&amp;u=https%3A%2F%2Fwww.aboutamazon.com%2Fworkplace%2Fupskilling-commitments&amp;a=Upskilling+2025\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Upskilling 2025</a> pledge to help more than 300,000 of its own employees transition into higher paying, in-demand roles at Amazon and beyond by 2025. </p>\n<p>\"At Amazon, we work to eliminate barriers like time and money for our employees so they can pursue skills training and education opportunities critical for the jobs of the future. This aligns well with the Nashville Software School's nonprofit mission and focus on affordability and reducing financial barriers,\" said <span class=\"xn-person\">Sarah Castle</span>, director, Amazon Technical Academy. \"We are excited to work with the Nashville Software School because of their proven track record of increasing the diversity of the <span class=\"xn-location\">Nashville</span> tech community and their strong employment outcomes. We are hopeful that Amazon Technical Academy's curriculum will help more prospective students advance their careers and pursue in-demand software engineering roles.\"</p>\n<p><b>Preparing Students for Success </b><br/>NSS is adapting Amazon Technical Academy's original curriculum in a number of ways for this new program. Commonly used industry developer tools and technologies are being integrated into the curriculum and the instructional approach will also incorporate techniques used in other NSS programs such as the broad use of real-world, hands-on group projects.</p>\n<p>Software Engineering with Java/AWS Specialization combines practical training in on-the-job software engineering practices and tools, with a comprehensive introduction to applied computer science concepts and training in cloud computing concepts and technologies. Students apply the skills learned in class through hands-on coding exercises and building and deploying server-side applications. Students will also work with NSS' career development team so they are prepared to succeed in the job search after graduation. Software Engineering is a nine month, full-time program delivered in an online, synchronous classroom. Classes are Monday through Friday from <span class=\"xn-chron\">9:00 a.m. to 4:00 p.m. CT</span>.</p>\n<p>Graduates of the program will earn an NSS software engineering certificate with specializations in Java and AWS and will be able to apply for junior software engineering roles with the most selective employers. For example, NSS graduates who apply at Amazon for full-time, entry-level software development engineer roles will undergo the same hiring and evaluation process as graduates from four-year computer science Bachelor's degree programs.</p>\n<p>Students will have access to multiple tuition options including payment plans, student loans, and scholarships. The NSS Opportunity Tuition Plan, a shared risk deferred tuition plan plus scholarship, will also be available to qualified applicants in this program.</p>\n<p>NSS is also rolling out a number of ways to help interested adults with no prior programming experience determine if they want to pursue this career path and gain the coding skills required for enrollment in Software Engineering. These prework options combine self-study, mentoring, and instructor-led pathways to learning introductory programming concepts and the Java programming language.</p>\n<p>The first cohort will launch in <span class=\"xn-chron\">June 2022</span>. Students can apply at <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3349576-1&amp;h=795015218&amp;u=http%3A%2F%2Fnashvillesoftwareschool.com%2Fprograms%2Fsoftware-engineering&amp;a=nashvillesoftwareschool.com%2Fprograms%2Fsoftware-engineering\" data-type=\"url\" class=\"tr-link\" translate=\"no\">nashvillesoftwareschool.com/programs/software-engineering</a>.</p>\n<p><b>About Nashville Software School<br/></b>Started in 2012, Nashville Software School was the nation's first non-profit software bootcamp. The mission is to prepare adults with motivation and aptitude for careers in tech. NSS is committed to creating opportunities to access high-paying tech careers for individuals who are financially disadvantaged or are from groups underrepresented in tech careers. There are currently 1,600 alumni of NSS and approximately 275 students in session. NSS is authorized by the<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3349576-1&amp;h=1691908600&amp;u=https%3A%2F%2Fwww.tn.gov%2Fthec%2F&amp;a=%C2%A0\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> </a><u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3349576-1&amp;h=1610791813&amp;u=https%3A%2F%2Fwww.tn.gov%2Fthec%2F&amp;a=Tennessee+Higher+Education+Commission\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Tennessee Higher Education Commission</a></u> and evaluated annually to meet quality standards. NSS earned the 2020 Best in Business Award by the <span>Nashville Business Journal</span> and <span>Nashville Scene's</span> Best of <span class=\"xn-location\">Nashville</span> in 2016. Learn more at<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3349576-1&amp;h=2049377821&amp;u=https%3A%2F%2Fnashvillesoftwareschool.com%2F&amp;a=%C2%A0\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> </a><u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3349576-1&amp;h=2799048618&amp;u=https%3A%2F%2Fnashvillesoftwareschool.com%2F&amp;a=https%3A%2F%2Fnashvillesoftwareschool.com%2F\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://nashvillesoftwareschool.com/</a></u>.</p>\n<p><b>Media Contact:<br/></b><span class=\"xn-person\">Julie Lilliston</span><br/>Julie Lilliston Communications<br/>615-663-2121<br/><a href=\"mailto:julie@julielilliston.com\" data-type=\"email\" translate=\"no\">julie@julielilliston.com</a> </p>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=CL66345&amp;sd=2021-11-08\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1DTDY2MzQ1JnNkPTIwMjEtMTEtMDg=&amp;key=dd003176495add5b2840c4b6305b7e813a9bf2edc851dbe65d35543329b23f029406bdaf77a65fcf9aab609e0b0e4ca652e8e241a59d9f198ee78d81d76e47c5\"/></div></div> View original content:<a href=\"https://www.prnewswire.com/news-releases/nashville-software-school-launches-software-engineering-program-with-amazon-301417950.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/nashville-software-school-launches-software-engineering-program-with-amazon-301417950.html</a><p></p>\n<p>SOURCE  Nashville Software School</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NASHVILLE-SWR-SCHOOL</p></div>"}