{"date": "2022-02-17 13:44:03.798000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3130.21, "close": 3093.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">Bansal will drive company's leadership in moving from the Internet of Things to the IoT2 - Internet of Trillions.  Beyond just a few billion expensive things, this new IoT2 will connect trillions of everyday things - revolutionizing global manufacturing and supply chains.</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">SAN DIEGO, Feb. 17, 2022</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">SAN DIEGO</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">Feb. 17, 2022</span></span> /PRNewswire/ -- Wiliot, the Internet of Things pioneer whose combination of self-powered, stamp-sized computers and cloud-based automation enables trillions of \"things\" to communicate with manufacturers, today named <span class=\"xn-person\">Manish Bansal</span> Chief Product Officer.</p>\n<p>Bansal joins the company after a successful 15-year career with Amazon, and will be responsible for developing and scaling Wiliot's breakthrough IoT platform that brings benefits to both profits and the planet.</p>\n<p>\"The IoT industry is on the verge of explosive innovation and growth, evolving from connecting billions of expensive things to trillions of everyday things,\" stated Wiliot CEO <span class=\"xn-person\">Tal Tamir</span>. \"A new IoT enabling universal connectivity has arrived.  It will connect almost everything to the internet – big and small – food, crates, apparel, medicine, and more; trillions of objects communicating critical data about their location, handling, and environment.  We describe this important moment as the Internet of Trillions (IoT2), a paradigm shift that will change industries and alter the way things are made, distributed, used and reused. This is the future, and Wiliot will be its key enabler.\"</p>\n<p>Continued Tamir, \"With Manish leading our product team, we can accelerate the adoption of both our IoT platform and this IoT2 vision. His 15+ years leading teams at Amazon, one of the world's preeminent supply chain companies, gives Manish the unique ability to help create a Wiliot-enabled IoT2.\"</p>\n<p>Prior to joining Wiliot, Bansal served as Amazon's Director and General Manager in Supply Chain Optimization Technology organization, leading Amazon's EDI platform, dropship business, and inbound supply chain product and technology teams. He managed over 450 employees across 10 countries and was directly responsible for the planning and execution of Amazon's best-in-class global supply chain solutions. Before leading Supply Chain areas, Bansal served in various other management positions within Amazon, most notably as a Director and General Manager of Amazon Gift Cards business and Amazon Local UK.</p>\n<p>\"The breakthrough innovation at the core of Wiliot's technology isn't just incrementally better than what's currently on the market; it's orders of magnitude better than even today's state-of-the-art,\" stated Bansal. \"Based on my experience at Amazon, I understand the potential Wiliot offers in equipping global supply chains with real-time transparency. New levels of efficiency will increase profitability, reduce waste, and bolster sustainability for companies across all markets. The industry is ready for large-scale disruption, and I'm thrilled to be a part of the team that will make this a reality.\"</p>\n<p>The Wiliot platform connects the digital and physical worlds using IoT Pixel tagging technology, computers the size of a postage stamp that power themselves in revolutionary ways. This includes powering themselves by harvesting the energy from the radio waves that surround us such as Wi-Fi and Bluetooth.  IoT Pixels attach to any product or packaging to sense physical and environmental data that is then fed to the Wiliot Cloud, where it's translated into actions and insights for businesses across a broad range of industries.</p>\n<p>Bansal joins other recent Wiliot executive appointments that include <span class=\"xn-person\">Tony Small</span>, formerly of Microsoft, Amazon and Zillow, as Chief Business Officer, and <span class=\"xn-person\">Roee Zeiler</span>, formerly of Blue Dot, Beamr and Ernst &amp; Young, as Chief Financial Officer. These appointments come on the heels of Wiliot's recent <span class=\"xn-money\">$200-million</span> series C round led by <span>SoftBank Vision Fund 2</span>.</p>\n<p>For more information on Wiliot,<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3446693-1&amp;h=1760161314&amp;u=https%3A%2F%2Fwww.wiliot.com%2F&amp;a=%C2%A0\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> </a><u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3446693-1&amp;h=4126351157&amp;u=https%3A%2F%2Fwww.wiliot.com%2F&amp;a=click+here\" data-type=\"url\" class=\"tr-link\" translate=\"no\">click here</a></u>. For high-resolution imagery, click <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3446693-1&amp;h=103038708&amp;u=https%3A%2F%2Fwww.wiliot.com%2Fpress%2304&amp;a=here\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a>.</p>\n<p><b>About Wiliot<br/></b>Wiliot is a SaaS company whose platform connects the digital and physical worlds using its IoT Pixel tagging technology, computers the size of a postage stamp that power themselves in revolutionary ways. Our vision is to expand the Internet of Things to include everyday products, adding intelligence to plastic crates, pharmaceuticals, packaging, clothes, and other products, connecting them to the internet and changing the way things are made, distributed, sold, used, reused, and recycled. <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3446693-1&amp;h=2070197799&amp;u=http%3A%2F%2Fwiliot.com%2F&amp;a=wiliot.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">wiliot.com</a>.</p>\n<p><b>Media Contact:<br/></b><span class=\"xn-person\">Daniel Griffin</span><br/>Griffin360<br/>+1 845 536 2200<br/><a href=\"mailto:330073@email4pr.com\" data-type=\"email\" translate=\"no\">330073@email4pr.com</a></p>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=PH65149&amp;sd=2022-02-17\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1QSDY1MTQ5JnNkPTIwMjItMDItMTc=&amp;key=92b0ff4c2b04256acc40192c2d39bca5892ffc5dd8a0161455f655d1754553ee15c620b3b02a78bf658534f89b6f12586f4f394206018b110f36d9af64d9c962\"/></div></div> View original content:<a href=\"https://www.prnewswire.com/news-releases/wiliot-names-former-amazon-supply-chain-executive-manish-bansal-as-chief-product-officer-301484190.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/wiliot-names-former-amazon-supply-chain-executive-manish-bansal-as-chief-product-officer-301484190.html</a><p></p>\n<p>SOURCE  Wiliot</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WILLOT-named</p></div>"}