{"date": "2021-12-13 15:41:56.450000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ATERIAN INC (\"ATER-Q\")\n- And Recurrent Announce A Strategic Online Media and E-Commerce\n- Partnership\n\n     Aterian, Inc. (\"Aterian\") announced that it plans to partner with\nRecurrent Ventures Inc. (\"Recurrent\") for strategic marketing efforts. As\npart of the collaboration, Recurrent and Aterian intend to combine\nRecurrent's iconic digital media brands and publishing business with\nAterian's data and E-Commerce platform to promote products through\naffiliate marketing and editorial coverage as well as launching new\nco-branded products and brands.\n\n     Aterian's Chief Executive Officer, Yaniv Sarig, commented,\n\"Recurrent's combination of iconic brands, world class editorial\ncapabilities and performance marketing expertise make them a perfect\nstrategic partner for Aterian. We believe that the power of publishers and\ntheir authentic connection with their audiences will pair well with our\nE-commerce platform to create a strong opportunity to drive growth for both\ncompanies. We look forward to working closely with the Recurrent team to\ndrive more sales to Aterian's existing brands through Recurrent's portfolio\nof online editorial publications reaching over 60 million monthly unique\nvisitors. We are particularly excited also about the potential prospect of\nlaunching co-branded products designed through our data driven methodology\nand promoted through Recurrent's channels.\"\n\n     \"We're thrilled to partner with Aterian to expand our content driven\ncommerce initiatives and help both our companies accelerate growth,\" added\nRecurrent CEO, Lance Johnson. \"There is such a natural synergy between\nAterian's technology-enabled consumer products and our digital media\nportfolio, especially with our science, technology, home, and outdoor\nbrands. Our teams are also incredibly excited about the newfound ability to\ncollaborate with the experts at Aterian on new products and packages that\nare aligned with our audiences' interests as well as those of the general\npublic.\"\n\n     About Aterian, Inc.\nAterian, Inc. (Nasdaq: ATER), is a leading technology-enabled consumer\nproducts platform that builds, acquires, and partners with best-in-class\ne-commerce brands by harnessing proprietary software and an agile supply\nchain to create top selling consumer products. The Company's cloud-based\nplatform, Artificial Intelligence Marketplace Ecommerce Engine (AIMEE(TM)),\nleverages machine learning, natural language processing and data analytics\nto streamline the management of products at scale across the world's\nlargest online marketplaces, including Amazon, Shopify and Walmart. Aterian\nhas thousands of SKUs across 14 owned and operated brands and sells\nproducts in multiple categories, including home and kitchen appliances,\nhealth and wellness, beauty and consumer electronics.\n\n     About Recurrent Ventures\n\n     Recurrent is an innovative digital media company that empowers brands\nto grow, and connect with consumers in a way that is enjoyable,\nsustainable, inspiring, and profitable--while maintaining editorial\nintegrity. Its best-in-class brands like Popular Science, The Drive,\nDomino, MEL, Field &amp; Stream, SAVEUR, Futurism, and Task &amp; Purpose engage a\ncombined audience of more than 60 million monthly unique visitors.\nInitially founded in late 2018 with the acquisition of The Drive, the\nportfolio rapidly expanded under the ownership and backing of North Equity\nLLC to include 20 digital media brands across automotive, home, lifestyle,\nmilitary, outdoors, and science and tech verticals.\n\n     Forward Looking Statements\n\n     All statements other than statements of historical facts included in\nthis press release that address activities, events or developments that we\nexpect, believe or anticipate will or may occur in the future are\nforward-looking statements including, in particular, the statements\nregarding our partnership with Recurrent and its ability to drive sales and\ngrowth, and our ability to launch co-branded products. These\nforward-looking statements are based on management's current expectations\nand beliefs and are subject to uncertainties and factors, all of which are\ndifficult to predict and many of which are beyond our control and could\ncause actual results to differ materially and adversely from those\ndescribed in the forward-looking statements. These risks include, but are\nnot limited to; those related to the negotiation and agreement of a\ndefinitive agreement with Recurrent; those related to the global shipping\ndisruptions, our ability to continue as a going concern, our ability to\nmeet financial covenants with our lenders, our ability to create operating\nleverage and efficiency when integrating companies that we acquire,\nincluding through the use of our team's expertise, the economies of scale\nof our supply chain and automation driven by our platform; those related to\nour ability to grow internationally and through the launch of products\nunder our brands and the acquisition of additional brands; those related to\nthe impact of COVID-19, including its impact on consumer demand, our cash\nflows, financial condition and revenue growth rate; our supply chain\nincluding sourcing, manufacturing, warehousing and fulfillment; our ability\nto manage expenses, working capital (including for PPE products) and\ncapital expenditures efficiently; our business model and our technology\nplatform; our ability to disrupt the consumer products industry; our\nability to grow market share in existing and new product categories,\nincluding PPE; our ability to generate profitability and stockholder value;\ninternational tariffs and trade measures; inventory management, product\nliability claims, recalls or other safety and regulatory concerns; reliance\non third party online marketplaces; seasonal and quarterly variations in\nour revenue; acquisitions of other companies and technologies, our ability\nto continue to access debt and equity capital (including on terms\nadvantageous to the Company) and the extent of our leverage and other\nfactors discussed in the \"Risk Factors\" section of our most recent periodic\nreports filed with the Securities and Exchange Commission (\"SEC\"), all of\nwhich you may obtain for free on the SEC's website at www.sec.gov.\n\nContact:\n\nIlya Grozovsky\nDirector of Investor Relations &amp; Corp. Development\nAterian, Inc.\nilya@aterian.io\n917-905-1699\n\nTel   : 347-676-1681    ATERIAN INC\nWWW   : <a href=\"https://www.aterian.io\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.aterian.io</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134600285.MNPRE2134601653-07303020211213</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}