{"date": "2021-10-05 23:11:16.076000+00:00", "ticker": "III", "mrkt_info": {"open": 1252.0, "close": 1247.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENBRIDGE INC (\"ENB-TN\")\n- To Host Webcast to Discuss 2021 Third Quarter Results on Nov. 5\n\n     Enbridge Inc. (Enbridge or the Company) will host a conference call\nand webcast to provide a business update and review 2021 third quarter\nresults on Nov. 5, 2021 at 7:00 a.m. MT (9:00 a.m. ET).\n\n     The conference call format will include prepared remarks from the\nexecutive team followed by a question and answer session for the analyst\nand investor community only. Enbridge's media and investor relations teams\nwill be available after the call for any additional questions.\n\n     Enbridge will announce its financial results before markets open on\nNov. 5, 2021.\n\n     2021 Third Quarter Earnings Webcast and Conference Call\n\n     Details of the webcast\n\n//st\n\n  When:      Friday Nov. 5, 2021\n\n             7:00 a.m. MT (9:00 a.m. ET)\n\n  Webcast:   Sign-up\n\n  Call:      Dial-in (Audio only - please dial in 15 minutes ahead):\n\n             North America Toll Free:                         (833)\n233-4460\n\n             Outside North America:                           (647)\n689-4543\n\n             Conference ID:                                   9798691\n\n//et\n\n     A webcast replay, as well as a transcript which will be posted to\nEnbridge's website, will be available shortly after the conclusion of the\nevent.\n\n     About Enbridge Inc.\n     Enbridge Inc. is a leading North American energy infrastructure\ncompany. We safely and reliably deliver the energy people need and want to\nfuel quality of life. Our core businesses include Liquids Pipelines, which\ntransports approximately 25 percent of the crude oil produced in North\nAmerica; Gas Transmission and Midstream, which transports approximately 20\npercent of the natural gas consumed in the U.S.; Gas Distribution and\nStorage, which serves approximately 3.8 million retail customers in Ontario\nand Quebec; and Renewable Power Generation, which generates approximately\n1,766 MW of net renewable power in North America and Europe. The Company's\ncommon shares trade on the Toronto and New York stock exchanges under the\nsymbol ENB. For more information, visit www.enbridge.com.\n\n     FOR FURTHER INFORMATION PLEASE CONTACT:\n\n     Media Toll Free: (888) 992-0997 Email: media@enbridge.com\n\n     Investment Community Toll Free: (800) 481-2804 Email:\ninvestor.relations@enbridge.com\n\n\nWWW   : <a href=\"https://www.enbridge.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.enbridge.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2127700932.MNPRE2127703749-15564720211005</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}