{"date": "2021-12-01 19:53:08.143000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>AWS Announces AWS IoT TwinMaker</b>\n</p><p class=\"bwalignc\">\n<span>New service makes it faster and easier to create digital twins of real-world systems like buildings, factories, industrial equipment, and production lines—helping many more customers build applications that improve operational efficiency and reduce downtime</span>\n</p><p class=\"bwalignc\">\n<span>Carrier, Siemens, and Accenture among customers and partners using AWS IoT TwinMaker</span>\n</p><p>\nToday, at AWS re:Invent, Amazon Web Services, Inc. (AWS), an <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2FAmazon.com&amp;esheet=52542110&amp;newsitemid=20211130005972&amp;lan=en-US&amp;anchor=Amazon.com&amp;index=1&amp;md5=a1b865a1529091b2184b81432a7ed896\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com</a>, Inc. company (NASDAQ: AMZN), announced AWS IoT TwinMaker, a new service that makes it faster and easier for developers to create digital twins of real-world systems like buildings, factories, industrial equipment, and production lines. Digital twins are virtual representations of physical systems that are regularly updated with real-world data to mimic the structure, state, and behavior of the objects they represent. AWS IoT TwinMaker makes it easy for developers to integrate data from multiple sources like equipment sensors, video cameras, and business applications, and combines that data to create a knowledge graph that models the real-world environment. With AWS IoT TwinMaker, many more customers can use digital twins to build applications that mirror real-world systems to improve operational efficiency and reduce downtime. There are no up-front commitments or fees to use AWS IoT TwinMaker, and customers only pay for the AWS services used. To get started with AWS IoT TwinMaker, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fiot-twinmaker&amp;esheet=52542110&amp;newsitemid=20211130005972&amp;lan=en-US&amp;anchor=aws.com%2Fiot-twinmaker&amp;index=2&amp;md5=d7355b7834f32bfce74f644caecc140e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.com/iot-twinmaker</a>.\n</p><p>\nIndustrial companies collect and process vast troves of data about their equipment and facilities from sources like equipment sensors, video cameras, and business applications (e.g. enterprise resource planning systems or project management systems). Many customers want to combine these data sources to create a virtual representation of their physical systems (called a digital twin) to help them simulate and optimize operational performance. But building and managing digital twins is hard even for the most technically advanced organizations. To build digital twins, customers must manually connect different types of data from diverse sources (e.g. time-series sensor data from equipment, video feeds from cameras, maintenance records from business applications, etc.). Then customers have to create a knowledge graph that provides common access to all the connected data and maps the relationships between the data sources to the physical environment. To complete the digital twin, customers have to build a 3D virtual representation of their physical systems (e.g. buildings, factories, equipment, production lines, etc.) and overlay the real-world data on to the 3D visualization. Once they have a virtual representation of their real-world systems with real-time data, customers can build applications for plant operators and maintenance engineers that can leverage machine learning and analytics to extract business insights about the real-time operational performance of their physical systems. Because of the work required, the vast majority of organizations are unable to use digital twins to improve their operations.\n</p><p>\nAWS IoT TwinMaker makes it significantly faster and easier to create digital twins of real-world systems. Using AWS IoT TwinMaker, developers can quickly get started building digital twins of devices, equipment, and processes by connecting AWS IoT TwinMaker to data sources like equipment sensors, video feeds, and business applications. AWS IoT TwinMaker contains built-in connectors for AWS IoT SiteWise, Amazon Kinesis Video Streams, and Amazon S3 (or customers can add their own connectors for data sources like Amazon Timestream or Snowflake) to make it easy to gather data from a variety of sources. AWS IoT TwinMaker automatically creates a knowledge graph that combines and understands the relationships of the connected data sources, so it can update the digital twin with real-time information from the system being modeled. Customers can import existing 3D models (e.g. CAD and BIM files, point cloud scans, etc.), directly into AWS IoT TwinMaker to easily create 3D visualizations of the physical systems (e.g. buildings, factories, equipment, production lines, etc.) and overlay the data from the knowledge graph on to the 3D visualizations to create the digital twin. Once the digital twin has been created, developers can use an AWS IoT TwinMaker plugin for Amazon Managed Grafana to create a web-based application that displays the digital twin on the devices plant operators and maintenance engineers use to monitor and inspect facilities and industrial systems. For example, developers can create a virtual representation of a metals processing plant by associating data from the plant’s equipment sensors with real-time video of the various machines in operation and the maintenance history of those machines. Developers can then set up rules to alert plant operators when anomalies in the plant’s furnace are detected (e.g. temperature threshold has been breached) and display those anomalies on a 3D representation of the plant with real-time video from the furnaces, which can help operators make quick decisions on predictive maintenance before a furnace fails. With AWS IoT TwinMaker, many more customers can use digital twins to build applications that simulate their real-world systems to improve operational efficiency and reduce downtime.\n</p><p>\n“Customers are excited about the opportunity to use digital twins to improve their operations and processes, but the work involved in creating a digital twin and custom applications for different use cases is complicated, expensive, and prohibitive for most,” said Michael MacKenzie, General Manager, AWS IoT. “AWS IoT TwinMaker includes the built-in capabilities most customers need for their digital twins, such as connecting to data across disparate sources, modeling physical environments, and visualization of data with spatial context. With today’s launch of AWS IoT TwinMaker, more customers can now have a holistic view of their industrial equipment, facilities, and processes to monitor and optimize all of their operations in real time.”\n</p><p>\nAWS IoT TwinMaker is available today in preview in US East (N. Virginia), US West (Oregon), Asia Pacific (Singapore), and Europe (Ireland) with availability in additional AWS Regions coming soon.\n</p><p>\nCarrier Global is a leading provider of healthy, safe, sustainable, and intelligent building and cold chain solutions. “Today, our objectives extend beyond HVAC and refrigeration and into the development of healthy, safe, and sustainable intelligent buildings. With our Abound platform, we aggregate building performance data from a variety of systems and sensors, offering customers real-time insight into their connected spaces. Enhancing this platform with digital twins of buildings for their owners and operators has been a top priority for us,” said Dan Levine, Sr. Director of Digital and Cloud at Carrier. “However, in-house development of that capability threatened to be difficult, costly, and slow. With AWS IoT TwinMaker, we see a key enabler for us to significantly accelerate the technology strategy of our Abound platform. AWS IoT TwinMaker will help our development team focus on rapidly creating differentiated customer outcomes rather than the heavy lifting of digital twin data abstraction and adding 3D visualization to our solutions.”\n</p><p>\nSiemens is a leader in providing software to create comprehensive digital twins for design, manufacturing, and service. “We are excited to work with AWS and expand connections between our Xcelerator portfolio and AWS services including the new AWS IoT TwinMaker service. Through this collaboration, developers will be able to create digital twin solutions that can scale from the simplest to the most complex use cases by combining our rich application services for low-code, visualization, simulation, and industrial IoT with AWS IoT TwinMaker and other AWS services,” said Brenda Discher, Senior Vice President for Industry Marketing &amp; Strategy at Siemens Digital Industries Software. “As part of our open ecosystem, this expanded collaboration between AWS and Siemens will increase the breadth of services we offer so together we can deliver new digital twin solutions that help our customers accelerate their digital transformation.”\n</p><p>\nAccenture is a global professional services company with leading capabilities in digital, cloud, and security. “Digital transformation of manufacturing is a huge opportunity for our clients who often face challenges with fragmented, siloed, and unstructured industrial data, leaving many proofs of concept unscalable,” said Maikel van Verseveld, Global Technology Lead for Digital Manufacturing &amp; Operations, Industry X, at Accenture. “As our clients look to start and scale their digital manufacturing journey, having tools that can quickly address these challenges is vital. With AWS IoT TwinMaker, they can now easily create digital twins for a more contextualized, data-driven, and real-time view of their manufacturing operations from disparate IT and OT systems, allowing end users to make better decisions and optimize operations. Through the Accenture AWS Business Group, we have been able to start leveraging AWS IoT TwinMaker and we are excited for the value it can bring our customers.”\n</p><p>\nINVISTA, a subsidiary of Koch industries, is a leading global manufacturer of fiber, resins, and chemical intermediates. “Working closely with AWS over many years, we have been building a strong analytics and data science capability to support our manufacturing operations and find new and better ways to improve our products and processes,” said Jerry Grunewald, Vice President of Operations Innovations at INVISTA. “Our field personnel need to efficiently address operational notifications and alerts from the plant floor, however, equipment information is distributed across different systems. Using AWS IoT TwinMaker, we can now build a digital twin of our manufacturing operations into a Connected Worker application that brings this disparate information into a consolidated view that represents our real environment. This has improved productivity and efficiency in field operations, supports environmental health and safety performance, and provides further opportunities to leverage employee expertise in finding new and better ways to create value for our customers.”\n</p><p>\n<b>About Amazon Web Services</b>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com&amp;esheet=52542110&amp;newsitemid=20211130005972&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=3&amp;md5=d0203357421bd6591ace6559e655aef0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<b>About Amazon</b>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Famazon.com%2Fabout&amp;esheet=52542110&amp;newsitemid=20211130005972&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=4&amp;md5=08a6f3efff094da8e68f89f0e7f39414\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211130005972/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211130005972/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52542110&amp;newsitemid=20211130005972&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=5&amp;md5=65dcb5b1ad6c923a139a7c8fe3614128\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NV-AMAZON.COM-INC</p></div>"}