{"date": "2021-12-14 08:21:49+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-story-p1\"><span class=\"tr-dateline\">MUMBAI, Dec 14 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Netflix <a href=\"reuters://REALTIME/Verb=FullQuote/ric=NFLX.O\" data-type=\"ric\" data-ric=\"NFLX.O\" translate=\"no\" dir=\"ltr\">NFLX.O</a> slashed on Tuesday the prices of its streaming services in India, for the first time since launching five years ago in the South Asian nation, as it moves to better compete with fierce rivals Disney <a href=\"reuters://REALTIME/Verb=FullQuote/ric=DIS.N\" data-type=\"ric\" data-ric=\"DIS.N\" translate=\"no\" dir=\"ltr\">DIS.N</a> and Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>. </p><p>The streaming giant cut prices by 60%, to 199 rupees ($2.62) a month, for its basic plan that lets users watch content on a single device, it said in a blogpost.</p><p>The price of its mobile-only plan will drop a quarter to 149 rupees, with overall prices of various plans falling 18% to 60%.</p><p>The new prices were the \"real 'Money Heist'\", Netflix said in its announcement, using the name of one of its popular television shows, but without giving any rationale for them.</p><p>For years, Netflix priced its products far above competitors in India such as Disney and Amazon, citing the much higher income of households that spoke English and watched entertainment in the language. </p><p>The Netflix move reflects its effort to target expansion beyond the biggest cities, said an entertainment industry analyst who sought anonymity.</p><p>\"To capture this market, it needs to bring down\" costs, added the analyst, based in the financial capital of Mumbai, as the firm competes with big rivals.</p><p>Amazon Prime Video charges 179 rupees ($2.36) a month but, unlike Netflix, it allows users to simultaneously watch content on multiple devices from the same account, and offers a cheaper annual payment plan.</p><p>Disney + Hotstar offers an annual premium plan with access to all its content in 4K at 1,499 Indian rupees ($19.76).</p><p>Disney + Hotstar made up a little less than 40% of the total subscriber base of 116 million of Disney+, the company said in an earnings call this year. Netflix and Amazon do not reveal their figures by country, however.</p><p>In 2018, Netflix said India could deliver its next 100 million subscribers.</p><p>At the time, Chief Executive Reed Hastings had <a href=\"https://reut.rs/2JTtRGN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">told Reuters</a> in an interview that the company had no plans to lower its prices in India, adding, \"We don’t have a pricing issue.\"  </p><p>Netflix has previously said 2021 will be its biggest year in India, with the release of more than 40 new titles, among them films featuring top Bollywood actors, stand-up comedy shows and original series. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL3N2L12OY\" data-type=\"storyId\" data-story-id=\"nL3N2L12OY\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>($1=75.8600 Indian rupees)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Shilpa Jamkhandikar in Mumbai, additional reporting by Chandini Monappa in Bengaluru; Editing by Aditya Kalra and Clarence Fernandez)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:shilpa.jamkhandikar@thomsonreuters.com\" data-type=\"email\" translate=\"no\">shilpa.jamkhandikar@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: INDIA-NETFLIX/ (PIX)</p></div>"}