{"date": "2021-11-24 15:42:05.919000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>PLANTFUEL LIFE INC (\"FUEL-Z;PLFLF-0\")\n- PlantFuel(R) a premium plant-based nutritional supplement brand\n- Is now available on Amazon\n\nPlantFuel plans to turbo charge its digital channel sales with help from\nthe world's biggest online marketplace.\n\n     PlantFuel Life Inc. (\"PlantFuel\" or the \"Company\"), the scientifically\nfocused plant-based wellness company,today announces its plant-based\nsupplements are now available on Amazon.\n\n     PlantFuel was founded byBrad Pyatt, a nutrition industry veteran and\nformer NFL athlete, who is bringing the next big thing to sports nutrition\nand plant-based consumers.\n\n     \"We are excited to launch on Amazon, which we believe will enable us\nto reach a broader audience, introduce much-needed alternatives to current\nwhey-based supplements and solidify PlantFuel as a category leader in\nperformance nutrition,\" comments Pyatt. \"After our initial conversations\nwith Amazon, the interest was high on both sides to introduce our\ninnovative plant-based products to millions of Amazon's customers who are\nlooking for premium nutrition but may not have found much in the\nplant-based space, until now.\"\n\n     Furthermore, in the coming weeks, PlantFuels Brand Store will launch\non Amazon, which will include PlantFuels branded content. According to\nstatista.com and eMarketer, 63 percent of online shoppersgo to Amazon to\nstart searching for products, which we believe will increase brand\nawareness and customer acquisition.\n\n     \"As the founder of PlantFuel, my mission was simple: to create a new\nfrontier in plant-based supplement initiatives by expanding the current\nlandscape with the ingredient technologies. We are only using the latest,\ngreatest innovations for our wellness platform,\"confirms Pyatt. \"Our team\nof leading physicians and formulators has worked for years to bridge the\ngap between traditional sports nutrition and plant-based ingredients. Until\nnow, no plant-based products could match what the sports nutrition category\nwas doing. Our trailblazing line of plant-based sports nutrition\nsupplements solves this dilemma, finally giving athletes and consumers\neffective plant-based sports nutrition products to maximize peak\nperformance.\"\n\n     About PlantFuel Life Inc.\n\n     PlantFuel Life Inc is a scientifically focused plant-based wellness\ncompany managed by a group of successful entrepreneurs who have extensive\nexperience in the areas of consumer-packaged goods, manufacturing,\nlogistics, and distribution. FUEL is a CPG life science company focused on\nthe plant-based foods and supplements industry.https://plantfuel.com/\n\n     The Canadian Securities Exchange (\"CSE\") has neither approved nor\ndisapproved the contents of this news release. Neither the CSE nor its\nMarket Regulator (as that term is defined in the policies of the CSE)\naccepts responsibility for the adequacy or accuracy of this release.\n\n          __________________________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132700432.MNPRE2132701443-07103420211124</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}