{"date": "2021-11-02 16:26:10+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>\n      The Federal Trade Commission is sending nearly $60 million to more than 140,000 Amazon drivers. The funds will serve as reimbursement for tips that Amazon allegedly illegally withheld from drivers between 2016 and 2019.\n    </p>\n              <p>\n      In 2021, the <a href=\"https://www.ftc.gov/system/files/documents/cases/192_3123_-_amazon_flex_complaint_final_not_signed.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">FTC brought a suit against Amazon</a> and its subsidiary, Amazon Logistics, alleging that the company failed to fully pay tips that drivers in its Amazon Flex program had earned. Amazon Flex drivers deliver goods and groceries ordered through programs like Prime Now and AmazonFresh. The complaint alleged that the company secretly kept drivers' tips over a two-and-a-half year period and only stopped the practice after becoming aware of the FTC's investigation in 2019.\n    </p>\n              <p>\n                <a href=\"https://www.ftc.gov/news-events/press-releases/2021/02/amazon-pay-617-million-settle-ftc-charges-it-withheld-some\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon agreed to settle the case</a> and surrender all the money it withheld from its drivers. The settlement also prohibits Amazon from misrepresenting any driver's likely income or rate of pay, how much of their tips will be paid to them, as well as whether the amount paid by a customer is a tip. Amazon also will be prohibited from making any changes to how a driver's tips are used as compensation without the driver's express informed consent.\n    </p>\n              <p>\n      The FTC will be sending 139,507 checks and 1,621 PayPal payments to Amazon Flex drivers. Drivers who had more than $5 withheld by Amazon will receive the full amount of their withheld tips. The highest amount going to a single Amazon Flex driver is more than $28,000, while the average amount is $422.\n    </p>\n              <p>\n      People who receive checks should deposit or cash them before January 7, 2022, as indicated on the check. Recipients who have questions about their checks should call the refund administrator, Rust Consulting, at 1-800-654-8874. The FTC never requires people to pay money or provide account information to cash a refund check.\n    </p>\n              <p>\n      Drivers whose payments total more than $600-19,980 drivers in total-will receive an IRS Form 1099 with their payment and should report this income on their tax return.\n    </p>\n              <p>\n      The FTC's <span><a href=\"https://public.tableau.com/profile/federal.trade.commission#!/vizhome/Refunds_15797958402020/RefundsbyCase\" data-type=\"url\" class=\"tr-link\" translate=\"no\">interactive dashboards for refund data</a></span><span>provide a state-by-state breakdown of FTC refunds. In 2020, FTC actions led to more than $483 million in refunds to consumers across the country, but the United States Supreme Court ruled earlier this year that the FTC lacks authority under Section 13(b) to seek monetary relief in federal court going forward. The <a href=\"https://www.ftc.gov/news-events/press-releases/2021/04/ftc-asks-congress-pass-legislation-reviving-agencys-authority\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Commission has urged Congress</a></span>to restore the FTC's ability to get money back for consumers.\n    </p>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.ftc.gov/news-events/press-releases/2021/11/ftc-returns-nearly-60-million-drivers-whose-tips-were-illegally\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Federal Trade Commission</strong> published this content on <strong>02 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>02 November 2021 16:26:10 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Federal Trade Commission</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Federal-Trade-Commission</p></div>"}