{"date": "2021-12-02 19:48:39+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3443.72, "close": 3389.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n                  <span>\n                    <strong>Introduction</strong>\n                  </span>\n                </p>\n                <p>\n                  <span>We are proud to announce that Snort 3 is officially</span>\n                  <a href=\"https://aws.amazon.com/marketplace/pp/prodview-wlbkrhn5n4vy2?sr=0-1&amp;ref_=beagle&amp;applicationId=AWSMPContessa\">\n                    <span>available</span>\n                  </a>\n                  <span>in a container form factor (called \"Snort 3 Anywhere\") on AWS Marketplace to be consumed in your Kubernetes cluster either running on AWS or On-prem. It's yet another way that we are fulfilling our vision to simplify security for networks, workloads, and applications across your multi-cloud world.</span>\n                </p>\n                <p>\n                  <span>I am pretty sure you know about Snort, Cisco's very own piglet. Snort has a long history and is the most recommended, de facto intrusion prevention engine in the industry which is in the hall of fame of greatest open-source software of all time. Snort is widely used, in several of our own products including Cisco Secure Firewall, Cisco Umbrella, Meraki MX, and used by other industry partners. It is also available as a stand-alone open-source</span>\n                  <a href=\"https://snort.org/\">\n                    <span>package</span>\n                  </a>\n                  <span>.</span>\n                </p>\n                <p>\n                  <span>The time has come to send Snorty, our pig mascot, on another journey to secure the container revolution…</span>\n                </p>\n                <p>\n                  <span>\n                    <strong>The Container Revolution</strong>\n                  </span>\n                </p>\n                <p>\n                  <span>The past couple of years there has been a tremendous increase in demand for container technologies, and the need to consume capabilities in a containerized form factor. This has fueled the evolution of Cloud Native architectures both on-prem and in the cloud.</span>\n                </p>\n                <p>\n                  <span>As a natural reaction, everyone in the market has started to deliver container-based solutions to satisfy customer needs. Some of the most popular solutions leverage Docker and Kubernetes technologies.</span>\n                </p>\n                <p>\n                  <span>A short clarification here if you're lost: Docker itself is an open-source technology (and container file format) which provides a way to containerize applications. It allows you to build and run containers while you develop them. When you have so many containers that you can't handle them, that's where Kubernetes become effective. It provides an ecosystem to deal with scaling, complexity, self-healing, deploying, and orchestrating your containers across multiple servers.</span>\n                </p>\n                <p>\n                  <span>One more technology worth mentioning is called Helm. It plays a key role in the solution described below. Quoting from</span>\n                  <a href=\"https://helm.sh/docs/topics/architecture/\">\n                    <span>Helm's site</span>\n                  </a>\n                  <span>: \"Helm is a tool for managing Kubernetes packages called charts.\" In essence, you can use Helm charts to bundle all the information required for Kubernetes to instantiate containers. (Think about bootstrap parameters, dependency management, release metadata for lifecycle management.)</span>\n                </p>\n                <p>\n                  <span>\n                    <strong>The Challenge</strong>\n                  </span>\n                </p>\n                <p>\n                  <span>Recently, the growth of distribution channels for containers has made it challenging for customers to consume these products from a single secure and trusted catalogue. If you have hybrid-cloud (a mix of on-prem and cloud) environments - the challenge is even greater.</span>\n                </p>\n                <p>\n                  <span>In more technical terms, there are many different \"Artifact Registries\" that customers can use in their Kubernetes deployments to access/consume/deploy different solutions provided in a container form factor.</span>\n                </p>\n                <p>\n                  <span>This creates multiple challenges for procurement, security, compliance, and finance teams to manage all the relations, contracts, certify container applications, and release them for consumption in production environments. The pain this challenge creates will only worsen over time, if not addressed.</span>\n                </p>\n                <p>\n                  <span>\n                    <strong>The Solution</strong>\n                  </span>\n                </p>\n                <p>\n                  <span>With the latest addition to AWS Marketplace, which is called \"Containers Anywhere\" - AWS took a bold step to offer a</span>\n                  <a href=\"https://aws.amazon.com/marketplace/features/containers\">\n                    <span>solution</span>\n                  </a>\n                  <span>for the above-mentioned challenges customers face.</span>\n                </p>\n                <p>\n                  <span>With the help of AWS Marketplace Container Anywhere - customers can browse, subscribe to, and deploy third party Kubernetes applications through the marketplace. This helps to ease constraints about security, relationship management with different vendors, monitor utilization and billing. The containers offered in the marketplace are vetted through AWS to ensure safety and security.</span>\n                </p>\n                <p>\n                  <span>How does our little Snorty piglet come into play here?</span>\n                </p>\n                <p>\n                  <span>The new offer called \"Snort 3 Anywhere\" is delivered via Helm chart on the AWS Marketplace which can be easily deployed and used both in AWS and on-prem Kubernetes clusters.</span>\n                </p>\n                <p>\n                  <span>The</span>\n                  <a href=\"https://aws.amazon.com/marketplace/pp/prodview-wlbkrhn5n4vy2?sr=0-1&amp;ref_=beagle&amp;applicationId=AWSMPContessa\">\n                    <span>offer</span>\n                  </a>\n                  <span>includes a 1 year Business Subscription for the proprietary snort rules, hence the price tag. (Snort3 itself is open-source and free to use under GPLv2 - so you essentially need to pay for the business rule subscription)</span>\n                </p>\n                <p>\n                  <span>\n                    <strong>Use Cases</strong>\n                  </span>\n                </p>\n                <p>\n                  <span>Now a little bit about the specifics…</span>\n                </p>\n                <p>\n                  <span>Use cases supported by this offer in AWS Container environments:</span>\n                </p>\n                <p>\n                  <span>Snort has been enhanced with a new data acquisition module (DAQ) - that handles the Geneve Encapsulated packets coming out from a</span>\n                  <a href=\"https://aws.amazon.com/elasticloadbalancing/gateway-load-balancer/\">\n                    <span>GWLB</span>\n                  </a>\n                  <span>.</span>\n                </p>\n                <p>\n                  <span>Implementing like this enables flexibility for inspecting packets inline or passive mode, but transparently to your environment, leveraging the power of Snort to secure your resources in Amazon ECS, EKS or EKS Anywhere environments. In case of passive mode, the snort instance will be still forwarding traffic, but it will only generate \"would have been blocked\" events - this is required because we need to send back the inspected traffic to the wire towards the GWLB and encapsulate it with Geneve.</span>\n                </p>\n                <p>\n                  <span>The use cases supported by this offer in an On-prem Kubernetes environment:</span>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <span>Inline mode deployment</span>\n                  </li>\n                  <li>\n                    <span>Passive mode deployment</span>\n                  </li>\n                </ul>\n                <p>\n                  <span>In an on-prem environment for both inline and passive modes we use the well-known afpacket DAQ module.</span>\n                </p>\n                <p>\n                  <span>The DAQ configuration needs to be edited depends on whether you will use snort in AWS or On-prem Kubernetes environment. You can find the daq parameter under the snort3 section in the \"values.yaml\" file which is part of the Helm chart. You can set it to \"gwlb\" in case of AWS or \"afpacket\" for on-prem. In this file you can also configure custom interfaces and set snort from inline to passive mode. The rest of snort parameters and other configuration can be accessed under this</span>\n                  <a href=\"https://github.com/snort3/snort3/releases/download/3.1.16.0/snort_user.pdf\">\n                    <span>link</span>\n                  </a>\n                  <span>.</span>\n                </p>\n                <p>\n                  <span>As you can see with the help of the Snort 3 Anywhere solution, you can harness the power of Snort in both on-prem and AWS Kubernetes environments, and you can build and customize it to your needs.</span>\n                </p>\n                <p>\n                  <span>In case if you need a more robust cloud native security solution which is orchestrated by Kubernetes and provides REST API support, please check out our</span>\n                  <a href=\"https://www.cisco.com/c/en/us/products/security/secure-firewall-cloud-native/index.html#~features\">\n                    <span>Cisco Secure Firewall Cloud Native</span>\n                  </a>\n                  <span>product.</span>\n                </p>\n                <p>\n                  <span>\n                    <strong>Further resources:</strong>\n                  </span>\n                </p>\n                <p>\n                  <span>We'd love to hear what you think. Ask a Question, Comment Below, and Stay Connected with Cisco Secure on social!</span>\n                </p>\n                <p>\n                  <strong>Cisco Secure Social Channels</strong>\n                </p>\n                <p>\n                  <strong>\n                    <a href=\"https://www.instagram.com/CiscoSecure/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Instagram</a>\n                  </strong>\n                  <br/>\n                  <strong>\n                    <a href=\"https://www.facebook.com/ciscosecure/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Facebook</a>\n                  </strong>\n                  <br/>\n                  <strong>\n                    <a href=\"https://twitter.com/CiscoSecure\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Twitter</a>\n                  </strong>\n                  <br/>\n                  <strong>\n                    <a href=\"https://www.linkedin.com/showcase/cisco-secure\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LinkedIn</a>\n                  </strong>\n                </p>\n                <p>\n        Share:\n      </p>\n                <br/>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://blogs.cisco.com/security/snort-3-anywhere\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Cisco Systems Inc.</strong> published this content on <strong>02 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>02 December 2021 19:48:39 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Cisco Systems Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Cisco-Systems-Inc.</p></div>"}