{"date": "2022-01-05 12:32:54+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds context</p><p class=\"tr-by\">By Aditya Kalra and Abhirup Roy</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW DELHI, Jan 5 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>A Delhi court has halted arbitration proceedings between Indian conglomerate Future Group and its estranged U.S. partner Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> in light of the national antitrust agency's suspension of a 2019 deal between the two sides.</p><p>The decision on Wednesday is a setback for U.S. e-commerce giant Amazon, which had successfully used the terms of its 2019 investment in a Future unit to <a href=\"https://reut.rs/2JcHaGd\" data-type=\"url\" class=\"tr-link\" translate=\"no\">block</a> the Indian company's attempt to sell retail assets to a rival.</p><p>But after the Competition Commission of India (CCI) <a href=\"https://reut.rs/3qAZqLu\" data-type=\"url\" class=\"tr-link\" translate=\"no\">suspended the 2019 deal</a> last month, citing suppression of information by Amazon while seeking clearances, Future argued there was no legal basis for the arbitration between the two sides to continue in Singapore.</p><p>A two-judge bench led by Chief Justice D. N. Patel of the Delhi High Court agreed with Future's arguments, putting the arbitration proceedings on hold. If the proceedings are not halted, Justice Patel said this would cause an \"irreparable loss\" to Future. </p><p>\"We hereby stay further proceedings of arbitral tribunal till next date of hearing,\" said Patel, adding the court will reconvene on Feb. 1 to hear the case again.</p><p>Future and Amazon did not respond to requests for comment. </p><p>A source familiar with the case said that Amazon was likely to legally challenge the Delhi High Court's decision.</p><p>The long-running dispute is being heard by a Singapore arbitration panel, but the so-called \"seat of the arbitration\" is New Delhi, meaning proceedings are governed by Indian law.    </p><p>Amazon has long argued that Future violated the terms of its 2019 deal in deciding to sell retail assets to market leader Reliance Industries <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RELI.NS\" data-type=\"ric\" data-ric=\"RELI.NS\" translate=\"no\" dir=\"ltr\">RELI.NS</a>, and the U.S. company's position had so far been backed by the Singapore arbitrator and Indian courts. Future denies any wrongdoing.</p><p>The dispute over Future Retail, which has more than 1,500 supermarket and other outlets, is a flashpoint between Jeff Bezos' Amazon and Reliance, run by tycoon Mukesh Ambani, as they try to gain the upper hand in Indian retail.</p><p>Future had approached the Delhi High Court after the Singapore arbitration panel did not agree to its immediate demands to terminate the proceedings after antitrust suspension of the 2019 deal.</p><p>Amazon has said it will legally challenge the CCI's suspension of the 2019 deal.</p><p>Future has said it is staring at liquidation if the Reliance asset sale deal fails after its retail businesses were hit hard during the COVID-19 pandemic.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Aditya Kalra in New Delhi and Abhirup Roy in Mumbai; editing by Sanjeev Miglani and Jason Neely)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:aditya.kalra@tr.com\" data-type=\"email\" translate=\"no\">aditya.kalra@tr.com</a> ; +91-11-49548021; Twitter <a href=\"https://twitter.com/adityakalra\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/adityakalra</a>; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON-INDIA/FUTURE-RELIANCE (UPDATE 2, PIX)</p></div>"}