{"date": "2022-01-26 13:41:38.741000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>CANADIAN IMPERIAL BANK OF COMMERCE (\"CM-TN\")\nNVIDIA CANADIAN DEPOSITARY RECEIPTS (CAD HEDGED) (\"NVDA-V\")\nHOME DEPOT CANADIAN DEPOSITARY RECEIPTS (CAD HEDGED) (\"HD-V\")\nGOLDMAN SACHS CANADIAN DEPOSITARY RECEIPTS (CAD HEDGED) (\"GS-V\")\nBANK OF AMERICA CANADIAN DEPOSITARY RECEIPTS (CAD (\"BOFA-V\")\nWALMART CANADIAN DEPOSITARY RECEIPTS (CAD HEDGED) (\"WMT-V\")\n- Introduces additional Canadian Depositary Receipts (\"CDRs\")\n\n     CIBC announced the addition of five new Canadian Depositary Receipts\n(\"CDRs\"), now listed on the NEO Exchange.\n\n     CDRs make it easy to invest in some of the world's largest companies -\nin Canadian dollars. Offered at a fraction of the price per share of the\nunderlying reference share, and with a built-in notional currency hedge,\nCDRs provide investors with affordable access to foreign stocks while\nmitigating the currency risk associated with global investing.\n\n     The five new CDRs available for trading on the NEO Exchange are listed\nbelow:\n\n//st\n\n  * Nvidia Canadian Depositary Receipts (CAD Hedged) - NVDA\n  * Home Depot Canadian Depositary Receipts (CAD Hedged) - HD\n  * Goldman Sachs Canadian Depositary Receipts (CAD Hedged) - GS\n  * Bank of America Canadian Depositary Receipts (CAD Hedged) - BOFA\n  * Walmart Canadian Depositary Receipts (CAD Hedged) - WMT\n\n//et\n\n     These five will add to the existing lineup of CDRs which are available\nfor trading on the NEO Exchange:\n\n//st\n\n  * Alphabet Canadian Depositary Receipts (CAD Hedged) - GOOG\n  * Amazon.com Canadian Depositary Receipts (CAD Hedged) - AMZN\n  * Apple Canadian Depositary Receipts (CAD Hedged) - AAPL\n  * Netflix Canadian Depositary Receipts (CAD Hedged) - NFLX\n  * Tesla Canadian Depositary Receipts (CAD Hedged) - TSLA\n  * Microsoft Canadian Depositary Receipts (CAD Hedged) - MSFT\n  * Walt Disney Canadian Depositary Receipts (CAD Hedged) - DIS\n  * Visa Canadian Depositary Receipts (CAD Hedged) - VISA\n  * Meta Canadian Depositary Receipts (CAD Hedged) - MVRS\n  * PayPal Canadian Depositary Receipts (CAD Hedged) - PYPL\n  * Advanced Micro Devices Canadian Depositary Receipts (CAD Hedged) - AMD\n  * Berkshire Hathaway Canadian Depositary Receipts (CAD Hedged) - BRK\n    (underlying shares Berkshire Hathaway Inc. Class B Common Stock (NYSE:\n    BRK.B))\n  * Costco Canadian Depositary Receipts (CAD Hedged) - COST\n  * Salesforce.com Canadian Depositary Receipts (CAD Hedged) - CRM\n  * IBM Canadian Depositary Receipts (CAD Hedged) - IBM\n  * JPMorgan Canadian Depositary Receipts (CAD Hedged) - JPM\n  * Mastercard Canadian Depositary Receipts (CAD Hedged) - MA\n  * Pfizer Canadian Depositary Receipts (CAD Hedged) - PFE\n\n//et\n\n     The Prospectus Supplement for this latest Series of CDRs has been\nfiled on SEDAR. For more information about CDRs, please visit\n<a href=\"https://cdr.cibc.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://cdr.cibc.com</a>\n\n     About CIBC\n     CIBC is a leading North American financial institution with 11 million\npersonal banking, business, public sector and institutional clients. Across\nPersonal and Small Business Banking, Commercial Banking and Wealth\nManagement, and Capital Markets businesses, CIBC offers a full range of\nadvice, solutions and services through its leading digital banking network,\nand locations across Canada, in the United States and around the world.\nOngoing news releases and more information about CIBC can be found at\nwww.cibc.com/ca/media-centre.\n\nFor further information:\nCIBC Media Contact:\nFor media inquiries: Kathryn Lawler, CIBC Communications &amp; Public Affairs\n416-242-1943\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2202500073.MNPRE2202500862-05360520220126</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}