{"date": "2021-06-30 15:20:12.438000+00:00", "ticker": "III", "mrkt_info": {"open": 1185.5, "close": 1173.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>ENPNEWSWIRE-(C)2021 ENPUBLISHING</p><p>Release date- 29062021 - Fraudulent activity by this third-party sterilisation provider has been identified. Multiple medical device manufacturers are affected. Manufacturers are advising customers of actions required to mitigate risks.</p></div><div class=\"tr-npp-body\"><p>Steril Milano is a third-party supplier of sterilisation services to manufacturers of medical devices. It is based in Italy. Fraudulent activities by the company became apparent in early 2021 after it was bought by a new parent company, Ionisos. Once the fraudulent activities were uncovered, the certification for the sterilisation plant was withdrawn, meaning it could no longer provide sterilisation services. The scale of the problem is limited to products which had already been sterilised when the certification was withdrawn on 14 April 2021.</p><p>For devices processed before this date, a sterilisation process had been carried out and the devices are likely to be sterile, but they may not have been sterilised in line with the documented, validated process. However, for the majority of devices the risk to patients is low. The MHRA is not aware of adverse incidents reported to us which can be linked back to Steril Milano.</p><p>The MHRA was advised of 88 medical device manufacturers for whom Steril Milano provided sterilisation services.? Additional companies, that are part of the supply chain for the affected manufacturers, have also been identified.</p><p>What the MHRA has done</p><p>To assess and mitigate the risk of further incidents, the MHRA proactively contacted manufacturers in April 2021.? Manufacturers were asked to undertake a risk assessment and notify the MHRA of planned action in relation to products sold into the UK. ?As of 29 June 2021, 28 manufacturers have informed the MHRA of field safety corrective actions (FSCA) relating to Steril Milano. Where the UK is affected, all manufacturers' field safety notices (FSNs) relating to Steril Milano are in this folder.</p><p>The MHRA has prioritised engagement with affected manufacturers known to have significant supply into the UK. We have conducted thorough risk assessments and have worked with cross-system groups to minimise disruption and ensure appropriate actions. Amongst others, we have worked with DHSC Supply Resilience team, the devolved administrations, NHSE&amp;I, Public Health England, National Clinical Cells, patient groups, manufacturers, NHS Supply Chain, sterilisation facilities and notified bodies.</p><p>Work undertaken includes sharing risk assessments to inform clinical decision-making, negotiating with manufacturers to ensure the feasibility of actions in FSNs and developing supporting guidance for healthcare professionals and patients.</p><p>This joint work has led to the MHRA publishing additional safety information relating to specific manufacturers:</p><p>National Patient Safety Alert: Supply disruption of sterile infusion sets and connectors manufactured by Becton Dickinson (BD) (NatPSA/2021/001/MHRA).</p><p>Total parenteral (TPN) and enteral nutrition bags manufactured by Diffuplast: Sterilisation issue (DSI/2021/005).</p><p>We are collaborating with international medical device regulators, sharing best practice and information on field safety corrective actions and recalls.</p><p>Actions for patients</p><p>If you are concerned by this issue, please contact your healthcare professional. Report any suspected infections involving affected devices to the MHRA through the Yellow Card Scheme.</p><p>Actions for manufacturers</p><p>If you have not already done so: if you are a customer of Steril Milano, conduct a risk assessment and determine if you need to carry out a FSCA if you have supplied devices to another medical device company, tell them that products are affected by this issue identify if your medical devices have been supplied to the UK market. This may be directly or indirectly, for example under the name or brand of another medical device manufacturer or distributor if a FSCA will be conducted in the UK,pleasefollowthe MHRA'sguidanceon field safety corrective actions</p><p>[Editorial queries for this story should be sent to newswire@enpublishing.co.uk]</p><p>((Comments on this story may be sent to info@enpublishing.co.uk))</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 M2 Communications Ltd.</p></div>"}