{"date": "2022-01-13 17:12:32.494000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3304.14, "close": 3242.76}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>It's been nearly two years since COVID-19 first reared its ugly head. Perhaps you've found what works for you when it comes to PPE—may it be a favorite type of mask, favorite brand of hand sanitizer or a face shield you like to use in high-risk settings. These precautions, particularly face masks, have played a key role in slowing the spread of COVID-19 throughout the pandemic and have become staples to have at home and on the go.</p></div><div class=\"tr-npp-body\"><p>The coronavirus pandemic is ever-evolving, as is our response to it. Experts are now calling for better mask-wearing with growing evidence that common cloth masks are not protective enough against COVID-19 anymore. As new variants continue to emerge, including the incredibly contagious omicron variant, experts are calling for upgraded protective options such as N95 and KN95 masks. </p><p><span>►Related: </span> How to find the best KN95 masks for kids because the cloth face mask isn't cutting it</p><p><span><span>Start off the New Year with deals and shopping advice delivered straight to your phone.</span> Sign up for text message alerts from the experts at Reviewed.</span> </p><p>Finding and buying non-counterfeit N95 masks isn't necessarily as straightforward as purchasing cloth or surgical masks. With limited supplies early on, many manufacturers only offered N95 respirators in bulk for healthcare settings at the beginning of the pandemic.</p><p>That said, finding and purchasing real N95 masks on the consumer market at a fair price is possible now—and it just might be the next best purchase you can make to protect yourself and others during the COVID-19 pandemic. Here's what you should know about N95 and KN95 masks and where you can buy them online.</p><p><span>►More: </span> Most people are still wearing cloth masks. Here's why that's a problem with omicron</p><p class=\"tr-npp-section-title\">Why choose N95 masks?</p><p>N95 masks have been predominately used in healthcare settings even before the COVID-19 pandemic as a tool to achieve highly efficient filtration against airborne particles. However, as the virus evolves and becomes more contagious, many experts are advocating for the widespread use of N95 masks among the general public.</p><p>The argument for wearing an N95 is that it's the gold standard of face coverings. With the proper fit, masks approved by the National Institute of Occupational Safety and Health (NIOSH) can filter up to 95% of particles in the air. When dealing with a respiratory virus like this coronavirus, N95 masks can make a large difference in protection from infection.</p><p>Several studies have and continue to explore the efficacy of different kinds of masks, especially as the pandemic continues to evolve. Take this experiment researchers at Duke University conducted last year, testing different kinds of masks against each other to see which mask was the most effective in blocking respiratory droplets. Taking factors like correct fit and environmental variables into account, the N95 masks were the most effective in blocking droplets—99% to be exact. The next best mask? Surgical masks, followed by a double-layered, polypropylene-cotton mask (a.k.a., a cloth mask).</p><p>Dr. Sabrina Assoumou, an infectious disease physician at Boston Medical Center, is among the experts recommending upgraded masks: \"If you're in an indoor public setting, that's where we recommend that you wear a well-fitted, high-quality mask. With omicron and how transmissible it is, I feel that we should all be moving to wearing a higher quality, better mask.\"</p><p class=\"tr-npp-section-title\">N95 vs KN95 vs KF94: What to know</p><p>You may have seen talk about both N95 and KN95 masks, sometimes—and inaccurately—used interchangeably. At face value, they're similar, and both are rated with 95% filtration efficiency. The main difference between the two boils down to what country or organization certified the standard of quality of the masks. N95 masks are NIOSH-certified, while KN95s—which the CDC notes are the most widely available mask—are manufactured in China and meet standards specific to China. KF94 masks, which provide a unique shape in comparison to N95s and KN95s, are manufactured in Korea and meet the Korean standard requirements.</p><p>In 2020, the FDA granted emergency-use authorization (EUA) for some KN95 masks due to N95 masks supply being scarce. However, the FDA has since revoked the EUA of non-NIOSH-approved respirators because some KN95 masks may not necessarily meet U.S. standards in terms of filtration. Even more, the CDC estimates that about 60% KN95 respirators in the U.S. are counterfeit as well as fail to meet NIOSH standards. Because of this gap, it may be best to stick to NIOSH-approved respirators approved by the CDC.</p><p>However, some people may prefer KN95s and KF94s for everyday use in non-medical settings. N95s can feel restrictive for some due to their protective layered construction, so a KN95 or KF94 could be a suitable alternative for those who are not comfortable wearing an N95 for long periods of time. \"I recently upgraded to using more KN95s —upgrading meaning from either cloth masks or surgical masks—for indoor public settings,\" says Assoumou. \"If you can find a KN95 or KF94 mask, those are helpful because they're just a little more comfortable and tolerable.\"</p><p class=\"tr-npp-section-title\">Where to buy N95s and KN95s masks online</p><p class=\"tr-npp-section-title\">Project N95</p><ul class=\"bulleted-list arrowlist\"><li><span>Get the BYD Flat Fold DE2322 N95 Respirators (NIOSH-Approved) (20-Pack) from Project N95 for $39.95</span> </li><li><span>Get the Harley Flat Fold L-188 (NIOSH-Approved) (20-Pack) from Project N95 for $45</span> </li><li><span>Get the Demetech Flat Fold DT-N95-FHS Respirator (NIOSH-Approved) (20-Pack) from Project N95 for $50</span> </li> </ul><p class=\"tr-npp-section-title\">Bona Fide Masks</p><ul class=\"bulleted-list arrowlist\"><li><span>Get the Powecom KN95 Respirator Face Mask (10-Pack) from Bona Fide Masks for $11</span> </li><li><span>Get the Harley N95 Respirator Face Mask (NIOSH-Approved) (20-Pack) from Bona Fide Masks for $45</span> </li><li><span>Get the Smaller or Children's Sized Powecom KN95 Respirator Mask (10-Pack) from Bona Fide Masks for $12.50</span> </li> </ul><p class=\"tr-npp-section-title\">Amazon</p><ul class=\"bulleted-list arrowlist\"><li><span>Get the Powecom KN95 Face Mask (10-Pack) from Amazon for $16.07</span> </li><li><span>Get the 3M Performance Particulate Respirator (2-Pack) (NIOSH-Approved) from Amazon for $5.98</span> </li> </ul><p class=\"tr-npp-section-title\">The Home Depot</p><ul class=\"bulleted-list arrowlist\"><li><span>Get the HDX N95 Respirator Mask (10-Pack) (NIOSH-Approved) from The Home Depot for $19.97</span> </li><li><span>Get the 3M Aura Particulate Respirator N95 (10-Pack) (NIOSH-Approved) from The Home Depot for $21.47</span> </li> </ul><p class=\"tr-npp-section-title\">WellBefore</p><ul class=\"bulleted-list arrowlist\"><li><span>Get the KN95 Masks from WellBefore from $1.19/mask</span> </li><li><span>Get the KN95 Kids Masks from WellBefore from $1.19/mask</span> </li> </ul><p class=\"tr-npp-section-title\">Vida</p><ul class=\"bulleted-list arrowlist\"><li><span>Get the NIOSH and FDA Authrozied N95 Mask (NIOSH-Approved) (10-Pack) from Vida from $38 </span> </li> </ul><p class=\"tr-npp-section-title\">How to tell if an N95 mask is a counterfeit</p><p>When shopping for an N95, the possibility of coming across counterfeit respirator masks is a reality, especially as demand for these masks continues to surge. \"Counterfeit manufacturers are becoming more and more sophisticated,\" says Jim Churchman, vice president, procurement and supply chain, at Duke University Health System. \"As a result, the ability to discern nuances that alert to a product being counterfeit is becoming increasingly difficult.\"</p><p>These masks may look and even feel like N95 masks, but they may not meet the necessary testing and criterion of real N95s. The most important thing to look for to judge authenticity that the respirator has been tested and certified by the National Institute for Occupational Safety and Health (NIOSH). \"Both the mask and its packaging should be labeled \"NIOSH-approved,\" says Dr. Stella Hines, associate professor at the University of Maryland School of Medicine. </p><p>The CDC says some signs of a counterfeit respirator include \"NIOSH\" being spelled incorrectly or the lack of an approval number on the respirator or headband. In addition, N95s specifically should use headbands, not ear loops—ones with ear loops may be real KN95s or KF94s, but <span>not</span> real N95s. You can double-check to see if a particular N95 brand or model is NIOSH-approved by taking a look at the NIOSH-Certified Equipment List.</p><p class=\"tr-npp-section-title\">How to reuse your N95 masks</p><p>N95 masks are the optimal choice—but they typically happen to be the most expensive, too. Using masks designed to be disposable like N95s or surgical masks can also feel like a wasteful choice in comparison to a reusable cloth mask. While N95 and KN95 masks are single-use masks, many people have found ways to reuse them effectively.</p><p>For crisis capacity with \"adapting spaces, staff and resources\" such as a shortage of PPE, the CDC approves of strategies like the limited re-use of face masks if necessary. In addition, one study—which, we should note, has not been peer-reviewed—explored how N95 respirators can be reused with a variety of \"cleaning\" strategies, such as rotating multiple masks or exposing them to heat.</p><p>You may also consider rotating N95 masks every couple of days, storing the mask in a breathable paper bag in between uses, a method that many healthcare professionals used when PPE supply was limited. \"For an N95, we'd recommend you switch [the mask] every day,\" says Assoumou. \"But, you can rotate them. If you have three masks, [for example], you could number them and switch them around.\" </p><p>Keep in mind that, over time, reusing your mask can begin to degrade its protective qualities over time. Reuse at your discretion and look for any visible signs of mask wear and tear, such as fraying, stretched-out straps or deterioration of the mask itself.</p><p class=\"tr-npp-section-title\">How to maximize your protection from any mask</p><p>While N95 respirators are best in class, you can still achieve a level of protection and fit from other masking methods. Mask efficacy greatly depends on factors like the fit on your face, so it's important when you're wearing your mask, you're wearing it  <span>correctly</span> .  </p><p>\"You'll always want to think about fit and filtration,\" says Assoumou. \"You can wear a surgical mask and put a cloth mask over it. This is what the CDC was recommending for a while,\" referring to the CDC's recommendations for double-masking. She explains: \"What the cloth mask does is that it improves the fit—it fits better around your mouth and prevents gaps. That's a problem with a lot of surgical masks—you get the filtration, but there are gaps along the way. That would be the easy way to improve what you're using right now.\"</p><p>While you can double mask with a cloth mask and surgical mask to add more protective layers and achieve a better fit, that is the  <span>only</span> way you should be double-masking. The CDC says to <span>never combine two medical procedure masks</span> —this means no layering of multiple surgical masks. Surgical masks are not designed to fit tightly to begin with, so doubling up on surgical masks won't help to improve the fit. </p><p>In addition, the CDC says you should <span>never combine a KN95 mask with any other mask</span> —this means no layering or double-masking at all when you're wearing a KN95.</p><p><span>Additional reporting by Amanda Tarlton.</span> </p><p><span><span>Make 2022 the year of good decisions.</span> Start by signing up for our newsletter for twice-weekly tips, reviews and more from our experts.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: N95 masks are your best mask option—here's where to buy them online</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}