{"date": "2022-02-16 16:18:54.538000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3130.21, "close": 3093.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Every day, we scour Amazon to find the best deals available. Whether it's something for your kitchen or top-rated tech to give your smart home an upgrade, the online shopping giant offers some of the best prices on a  <span>very</span> wide range of items. Whatever you need, Amazon has you covered.</p></div><div class=\"tr-npp-body\"><p><span><span>Get deals and shopping advice delivered straight to your phone.</span> Sign up for text message alerts from the experts at Reviewed.</span> </p><p>Below, you'll find our top Amazon deals today, including a stain-fighting water flosser, one of our favorite air fryers and an ultra-portable Bluetooth speaker, all of which have been vetted by our team of deals experts to make sure they're \"best of web\" prices. If you're looking for N95 and KN95 masks right now, Amazon also has plenty of choices on sale today, too.</p><p>► <span>Presidents' Day: </span> Shop the best deals on mattresses, furniture and everything in between</p><p>► <span>Meal kit delivery services: </span> Kick takeout to the curb with these brands you need to check out.</p><p>If you're not already an Amazon Prime subscriber, you can sign up for a 30-day membership for free. An Amazon Prime subscription gets you free two-day shipping and tons of other benefits for $12.99 a month ($6.49 for students and $5.99 for those receiving qualifying government assistance).</p><p>Better still, right now, shoppers can receive a $5 discount on their first $10-or-more Amazon app purchase. </p><p class=\"tr-npp-section-title\">The best Amazon deals of the day</p><p><big>1. Save $40: This widescreen tablet</big> </p><p>The Amazon Fire HD 10 tablet usually starts from $149.99, but you can get one for 27% off right now, bringing the price down to $109.99. We ranked the Fire HD 10 as one of the best tablets we've ever tested thanks to its large display, which is capable of playing 1080p-resolution videos with reasonably true colors and black levels, and the relatively quick charging time. Though it doesn't have the strongest app collection compared with the competition from Apple and Google, it's hard to beat its current discounted price.</p><p><span>Get the Amazon Fire HD 10 from $109.99 (Save $40)</span> </p><p><big>2. 10% off: One of our favorite air fryers </big> </p><p>Air fryers make the daily kitchen workload a whole lot easier, but some of the best models can be pretty pricey. Fortunately, the Cosori Max XL is a quality kitchen appliance at a more wallet-friendly price. Typically listed for $119.99, you can get this 5.8-quart fryer for as low as $107.94. The Max XL is our pick for the best affordable air fryer thanks to its digital controls with preset cooking programs for whatever you're in the mood for. Not only does it prepare crispy french fries, but its parts are also dishwasher safe.</p><p><span>Get the Cosori 5.8-Quart Max XL Air Fryer from $107.94 (Save $12.05)</span> </p><p><big>3. 43% off: This stain-removing water flosser</big> </p><p>Bring some extra shine to your teeth with the Waterpik WF 05 water flosser. Normally priced at $119.99, this powerful dental tool is now available for 43% off at $68.26, and it comes with 30 of the brand's teeth-whitening tablets. Waterpik says you can insert one tablet into the top infuser of the flosser and it helps remove stains from hard-to-reach areas between the tooth and gum line. The brand says the use of the flosser with whitening tablets can restore your smile's natural whiteness within four weeks.</p><p><span>Get the Waterpik WF 05 Whitening Water Flosser for $68.26 (Save $51.73)</span> </p><p><big>4. Less than $60: One of our favorite webcams</big> </p><p>Upgrade the quality of your home Zoom calls with the Logitech C920x Pro webcam. Typically listed for $69.99, this HD computer accessory is now $59.99, or $10 off. We picked the C920x as one of the best webcams we've ever tried for its display of sharp images and video quality, with our tester saying she could see the rims of her glasses in crisp focus. It's also got a hard plastic shell that we felt to be strong and durable, along with a layer of glass protecting its lens. </p><p><span>Get the Logitech C920x Pro HD Webcam for $59.99 (Save $10)</span> </p><p><big>5. 17% off: This compact Bluetooth speaker</big> </p><p>Taking your favorite songs on the go with you is now easier (and more affordable!) than ever with the Bose SoundLink Micro. Normally priced at $119, this palm-sized speaker is now just $99 thanks to a $20 price cut. The SoundLink Micro is one of the best portable Bluetooth speakers we've ever tested, having impressed us with its surprisingly soft silicone finish and waterproof material. Despite its lightweight and smaller size, the Micro still provides impeccable sound expected from the SoundLink line.</p><p><span>Get the Bose SoundLink Micro for $99 (Save $20)</span> </p><p class=\"tr-npp-section-title\">The best Amazon deals from this week</p><p><big>1. Tineco iFLOOR3 Cordless Wet Dry Vacuum</big> </p><p>Tackle drink spills, pet hair and chip crumbs at home with the Tineco iFLOOR3 wet dry vacuum, on sale at Amazon. Currently listed for $299.99, you can get this cordless appliance for $50 off by checking off the coupon on the product page. Tineco says iFLOOR3 can vacuum and wash solid floors including hardwood, tile, laminate, vinyl, marble and linoleum. You can get up to 25 minutes of cleaning power with each charge of the vacuum's battery.</p><p><span>Get the Tineco iFLOOR3 Cordless Wet Dry Vacuum from $249.99 with coupon (Save $50 to $60)</span> </p><p><big>2. Keurig K-Slim Coffee Maker</big> </p><p>Get the power of your favorite coffee shop's equipment in a size fit for any kitchen counter with the Keurig K-Slim coffee maker. Typically listed from $129.99, you can get this single-serve brewer for as low as $89.99 in white thanks to a $40 price cut. Keurig says the K-Slim has a 46-ounce water reservoir that lets you brew up to four cups of coffee before refilling. It can prepare 8-, 10- and 12-ounce brews and at only five inches wide, it's a fit for any spot in your kitchen.</p><p><span>Get the Keurig K-Slim Coffee Maker from $89.99 (Save $20 to $40)</span> </p><p><big>3. Logitech G Pron Wireless Gaming Mouse</big> </p><p>PC gamers can get a faster performance in their next streaming session with the Logitech G Pro wireless mouse. Normally priced at $129.99, this lightweight computer accessory is on sale for 40% off at $78.17. Logitech says the G Pro has a response rate time of one millisecond thanks to its sensor technology. It also has a weight of just 80 grams and is developed with esports maneuverability in mind for quick and easy use.</p><p><span>Get the Logitech G Pro Wireless Gaming Mouse for $78.17 (Save $51.82)</span> </p><p><big>4. Blink smart home security devices</big> </p><p>Keep a close eye on what's going on inside and outside your house with these select Blink smart home devices. The Blink Mini smart camera, typically listed for $34.99, is on sale now for 29% off at $24.99. We ranked the Blink Mini as one of the best smart indoor cameras we've ever tried, after it impressed us with its uber-small design and lightweight feel that both make for an easy installation process anywhere at home. You can also pick up a two-pack of Blink Outdoor cameras for $114.99—a 36% discount from the pack's standard price of $179.99. The Blink Outdoor is one of our favorite smart outdoor cameras for its easy setup and seamless connection to Amazon Alexa. We also appreciated the punctual smart alerts it sends to the app, though we did miss the video or image preview that most other cameras provide (but Blink doesn't).</p><p><span>Save up to 36% on select Blink smart home security devices</span> </p><p><big>5. Ultimate Ears BOOM 3 Portable Speaker</big> </p><p>Blast your favorite songs at any house party or outdoor adventure with the Ultimate Ears BOOM 3 speaker available for $129.99. Normally priced at $149.99, you can get this cylindrical portable speaker for 13% off in four different colors. The brand says the BOOM 3 not only has a water and dustproof design, but it even floats and can totally be submerged in water for up to 30 minutes. The BOOM 3 also offers up to 15 hours of playtime in a single charge and has what the brand dubs a \"Magic Button\" on its top to let you play, pause and skip songs with one touch.</p><p><span>Get the Ultimate Ears BOOM 3 Portable Waterproof Speaker for $129.99 (Save $20)</span> </p><p class=\"tr-npp-section-title\">Other noteworthy Amazon deals we found </p><ul class=\"bulleted-list arrowlist\"><li>Save up to 88% on select Kindle romance novels</li><li>HotHand Hand Warmers Value Pack for $5.79 (Save $7.16)</li><li>One month of Amazon Music Unlimited with an Echo Dot (3rd Generation) for $14.98 (Save $35)</li><li>Hertzko Self-Cleaning Slicker Brush for Dogs and Cats for $14.99 (Save $15.29)</li><li>Bella 17288 Double Cooker from $16.98 with coupon (Save $3.49 to $5)</li><li>Venus Visage Teeth Whitening Pen for $16.99 with coupon (Save $10)</li><li>Lement KN95 Face Mask 50-Pack for $19.99 (Save $40)</li><li>Magicteam Sound Machines White Noise Machine for $23.99 (Save $6)</li><li>H&amp;R Block Tax Software Deluxe + State 2021 PC Download for $25.83 (Save $19.16)</li><li>Hilife HL7 Steamer for $29.99 (Save $6)</li><li>MySmile Powerful Cordless Water Dental Flosser from $47.59 (Save $33 to $36.40)</li><li>Philips Hue White and Color Ambiance A19 E26 LED Smart Bulb 3-Pack for $72.24 with coupon (Save $62.75)</li><li>Bissell Power Fresh Steam Mop for $82.69 (Save $10)</li><li>Apple AirPods (Second Generation) for $98.98 (Save $60.02)</li><li>All-Clad D3 Stainless-Steel 12-Inch Fry Pan with Lid for $129.95 (Save $90.05)</li><li>Apple AirPods Pro for $174.98 (Save $74.02)</li><li>Bissell Crosswave Pet Pro All in One Wet Dry Vacuum Cleaner and Mop for $269.59 (Save $60)</li><li>Amazon Fire TV Omni Series from $284.99 (Save $125 to $230)</li><li>Tuft &amp; Needle Mint Queen Mattress for $956 (Save $239)</li><li>Vizio 75-Inch M7 Series Premium 4K UHD Quantum Color LED HDR Smart TV for $999.99 (Save $300)</li> </ul><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Updated daily: Here are the 10 best Amazon deals today</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}