{"date": "2021-12-23 01:57:41.333000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.34, "close": 3421.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>United Kingdom : Travelport Accelerator Winners: Taguchi And Data Appeal Selected To Work With Travelport And Aws To Hyper-personalize Travel Marketing</p><p>Launched in September, Travelport Accelerator called on tech innovators and startups to present solutions to revolutionize hyper-personalized digital marketing for travel</p></div><div class=\"tr-npp-body\"><p>Travelport and AWS selected six finalists from 120 global applicants to pitch their solutions to an industry judging panel that included some of travel?s biggest names</p><p>The final judging round saw Australia-based TaguchiMarketing and Italy-based The Data Appeal Company selected by the panel of judges as winners</p><p>Both companies will work with Travelport and AWS to develop their individual solutions in 2022</p><p>Travelport, a global technology company that powers bookings for hundreds of thousands of travel suppliers worldwide, today announced that TaguchiMarketing (Taguchi), an Australian tech company, and The Data Appeal Company (Data Appeal), an Italian ?scale-up?, have won the first travel retailing challenge from Travelport Accelerator, a new global accelerator program launched in collaboration with Amazon Web Services (AWS).</p><p>?Travelport Accelerator was created to foster collaboration with innovative thinkers who bring revolutionary ideas to the table,? said Tom Kershaw, Chief Product and Technology Officer at Travelport. ?Together with a panel of leading industry experts, we heard some truly unique concepts and viable product ideas. In the end, the solutions presented by Taguchi and Data Appeal were the most compelling as they have the potential to quickly deliver a significant improvement to the personalization of travel marketing by utilizing Travelport+.?</p><p>One hundred and twenty (120) tech startups and innovative companies responded to the Travelport Accelerator this year, bringing a variety of digital marketing capabilities to the table such as creating dynamic, personalized video content, ensuring price consistency across multiple retailing channels and visualizing data and sentiment based on social and review posts.</p><p>Six companies were then selected to pitch their solutions to experts and decision-makers from some of the world?s most renowned travel companies during an exclusive Industry Pitch Day event held in New York City. The six finalists selected to pitch their solutions were:</p><p>Taguchi</p><p>Adobe</p><p>Stackla</p><p>Everymundo</p><p>Dynamo Video</p><p>The Data Appeal Company</p><p>The panel of industry judges that participated in the first Travelport Accelerator Industry Pitch Day represented American Express Global Business Travel, Priceline, Southwest Airlines, Internova Travel Group, Direct Travel and Christopherson Business Travel.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}