{"date": "2021-11-04 13:14:13+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Repeating to fix formatting, no change to content of story</p><p class=\"tr-by\">By Jeffrey Dastin and Julia Love</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Nov 4 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Earlier this year, Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> handily defeated a historic union drive at a warehouse in Bessemer, Alabama. But with the prospect of another vote looming, the online retailer is leaving nothing to chance.</p><p>Over the past few weeks, Amazon has ramped up its campaign at the warehouse, forcing thousands of employees to attend meetings, <span class=\"tr-strong\">posting signs critical of labor groups </span>in bathrooms, and flying in staff from the West Coast, according to interviews and documents seen by Reuters.</p><p>It is an indication that Amazon is sticking to its aggressive playbook. In August, a U.S. National Labor Relations Board hearing officer said <span class=\"tr-strong\">the company's conduct around the previous vote interfered with the Bessemer union election</span>. An NLRB regional director's decision on whether to order a new vote is forthcoming. Amazon has denied wrongdoing and said it wanted employees' voices to be heard.</p><p>Still, the <span class=\"tr-strong\">moves </span>to discourage unionization ahead of any second election, previously unreported, <span class=\"tr-strong\">show </span>how Amazon is fighting representation at its U.S. worksites.</p><p>An uptick in labor activity since workers in April rejected joining the Retail, Wholesale and Department Store Union (RWDSU), including organizing drives in New York and Canada, has pushed Amazon to react.</p><p>Other <span class=\"tr-strong\">prominent </span>unions like the <span class=\"tr-strong\">International Brotherhood of Teamsters </span>are also vowing to organize Amazon. The risk: unions could alter how Amazon manages its vast, finely tuned operation and drive up costs at a time when a labor shortage is taking a toll on its profit.</p><p>Wilma Liebman, a former NLRB chair, said the stakes are high. </p><p>\"They really, really fear any toe in the door to unionization,\" Liebman said. \"There's nothing like a win, and a win can be contagious.\"</p><p>In a statement, Amazon spokesperson Kelly Nantel said a union \"will impact everyone at the site so it's important all employees understand what that means for them and their day-to-day life working at Amazon.\"</p><p>In the new campaign, Amazon has dedicated a week of mandatory meetings to warn staff that unions will force them to strike and forgo pay, a nod to the recent stoppages roiling workplaces across the country.</p><p>And like last time, Amazon has said unions are a business taking workers' money and told staff to consider what it can guarantee and what unions cannot - now in panels in bathroom stalls and above urinals. The panels carry information unrelated to unions as well.</p><p>\"Unions can make a lot of promises, but cannot guarantee you will receive better wages, benefits, or working conditions,\" read a photo shared with Reuters.</p><p><br/></p><p>UNION SUPPORTERS PUSH BACK</p><p>Some staff have challenged Amazon's claims and posted their own pro-union signs in warehouse bathrooms, according to worker accounts.</p><p>The RWDSU, meanwhile, has flown in personnel to Bessemer, facilitated nightly chats at a burger joint, and ramped up door-knocking. Home visits are a crucial part of organizing drives because unions have no guaranteed worksite access under U.S. law, said John Logan, a professor at San Francisco State University.</p><p>Stuart Appelbaum, the RWDSU's president, said the union has heard from employees who now would change their vote to join. He said he believes door-knocking gives the union a new edge.</p><p>\"We have a greater opportunity to engage with people every day than during the height of the pandemic,\" said Appelbaum. Organizers did not conduct home visits last time because of COVID-19 fears.</p><p>He added that the RWDSU's effort is about more than Amazon. \"It's about the future of work.\"</p><p>A Teamsters spokeswoman said the union has attended strategy meetings on Amazon <span class=\"tr-strong\">with other unions coordinated by </span>the biggest U.S. labor federation, the AFL-CIO. Tim Schlittner of the AFL-CIO said the federation is \"bringing the resources of the labor movement\" to support Amazon workers.</p><p>Roadblocks abound, not least that the RWDSU has to reach new staff joining the company without knowing their names until an official election is ordered. Appelbaum estimated that Amazon was hiring 200 people a week in Bessemer.</p><p>Amazon had no comment on turnover. The warehouse headcount numbers more than 5,800.</p><p><br/></p><p>SCARE TACTIC</p><p>On Oct. 10, <span class=\"tr-strong\">just when </span>Amazon raised hourly wages by 25 cents for more veteran staff, the company re-started mandatory weekly meetings in Bessemer to highlight different messages about unions. Amazon said the pay increase was unrelated to the meetings.</p><p>For Darryl Richardson, an outspoken union supporter at the facility, strikes were a bigger focus of Amazon's new campaign.</p><p>\"They're trying to scare you more now,\" Richardson said. \"You don't get paid going on a strike.\"</p><p>According to Richardson, Amazon falsely said a union would force workers to walk off the job and fine them if they crossed a picket line. The <span class=\"tr-strong\">52</span>-year-old said Amazon has treated him differently as well: he was denied transfer requests, and an official walking through the warehouse to ask workers how they felt about unions had little to say after scanning Richardson's badge ... \"'You're Darryl,' she said. 'Your mind is made up.'\"</p><p>Amazon had no comment on Richardson's remarks.</p><p>Though the company told employees they can turn away organizers showing up at their doorsteps, Richardson said he and peers have kept knocking, while Amazon is making its case on home turf.</p><p>In one table-top sign Amazon put up at the warehouse, the company exhorted workers to \"FOLLOW THE MONEY,\" claiming the RWDSU gave Appelbaum a \"$30,000 raise paid for by union dues\" and <span class=\"tr-strong\">last year </span>spent <span class=\"tr-strong\">nearly </span>$100,000 on cars for <span class=\"tr-strong\">its officials</span>.</p><p>Asked for comment, Appelbaum said he has no union car and that transportation is for field representatives whose jobs require travel to workplaces.</p><p>Amazon is \"misrepresenting the information,\" he said.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting By Jeffrey Dastin and Julia Love in San Francisco; Editing by Anna Driver and Bernard Orr)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Jeffrey.Dastin@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Jeffrey.Dastin@thomsonreuters.com</a> ; +1 424 434 7548; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-UNIONS/ (FOCUS, PIX)</p></div>"}