{"date": "2021-11-12 19:33:27.118000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3472.5, "close": 3545.68}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon has launched a new click &amp; collect option Amazon Counter, a network of staffed pick up points that allows customers to collect their Amazon parcels in-store at a partner location.</p><p>Currently, customers in the UK and Italy have access to thousands of Counter locations. Amazon Counter went live yesterday, with British retailer Next, Italian bookstore chain Giunti and Fermopoint and SisalPay stores across Italy as launch partners.The service will continued to be rolled out across partner stores throughout this year, with more partners and locations across Europe to be included.Next PLC CEO Lord Wolfson said: \"The ability to collect Amazon parcels from hundreds of NEXT's UK stores provides a helpful and exciting new service for UK consumers.\"Amazon Counter combines the internet's power to offer unprecedented choice with all the convenience of local stores. In a tough retail environment, our aim is that Amazon Counter will contribute to the continued relevance and vibrancy of our stores.\"Amazon.co.uk and Amazon.it currently have delivery available for numerous products at the Amazon Counter location, with standard shipping and one-day shipping options.Prime members do not need to pay any additional charges for this service.Amazon Lockers and Pickup director Patrick Supanc said: \"With Counter, we've used technology to enhance and redesign the click-and-collect experience.\"We're excited for customers to experience this service at one of the thousands of stores now available for Counter, but we're not stopping there. We're now actively looking to bring even more partners onboard across Europe - from family-run corner shops to retail chains - businesses of all sizes can take advantage of the opportunity as we expand the Counter network for customers.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}