{"date": "2022-02-24 16:41:07.383000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2896.54, "close": 3075.77}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MACE SECURITY INTERNATIONAL INC (\"MACE-0\")\n- Sanjay Singh on Fox Business Live with Neil Cavuto\n\n     Mace Security International, Inc. a globally recognized leader in\npersonal safety products, was featured nationally on Fox News' Cavuto:\nCoast to Coast for its role in providing community and family safety\nthrough individual empowerment.\n\n     Sanjay Singh, Mace's Chairman and CEO, shared on the Cavuto show the\ncompany's focus on providing a heightened awareness surrounding personal\nsafety. \"People want to feel safe and be able to protect themselves, said\nMr. Singh. \"We are a mission-based company founded on empowerment of\nfamilies and individuals for personal safety.\" The company strives to\neducate the public by offering suggested safety measures on its website and\nYouTube channel.\n\n     In response to recent personal attacks, the company donated Mace\npepper spray products to Soar Over Hate, a New York City-based non-profit\norganization providing care and protection to Asian Americans and Pacific\nIslanders, the AAPI community. Mr. Singh added, \"Providing these units to\nthose in need, speaks to our overall mission of keeping our communities\nsafe.\"\n\n     To view the news segment that aired on Fox News, follow the attached\nlink.\n\n     Mace Chairman and CEO Sanjay Singh on Fox News' Cavuto: Coast to Coast\n\n     About Mace Security International, Inc.\n\n     Mace(R) Security International, Inc. (MACE) is a globally recognized\nleader in personal safety and security. Based in Cleveland, Ohio, the\ncompany has spent more than 40 years designing and manufacturing consumer\nand tactical products for personal defense and security under its\nworld-renowned Mace(R) Brand - the original trusted brand of defense spray\nproducts. The company also offers aerosol defense sprays and tactical\nproducts for law enforcement and security professionals worldwide through\nits Mace(R) Take Down(R) brand, KUROS!(R) Brand personal safety products,\nVigilant(R) Brand alarms, and Tornado(R) Brand pepper spray and stun guns.\nMACE(R) distributes and supports Mace(R) Brand products through mass market\nretailers, wholesale distributors, independent dealers, Amazon.com,\nMace.com, and other channels. For more information, visit www.mace.com.\n\n     Mace Security International distributes and supports its products and\nservices through mass-market retailers, wholesale distributors, independent\ndealers, e-commerce channels and through its website, www.Mace.com. For\nmore information, please visit www.mace.com.\n\n     Forward-Looking Statements\n\n     Certain statements and information included in this press release\nconstitute \"forward-looking statements\" within the meaning of the Federal\nPrivate Securities Litigation Reform Act of 1995. When used in this press\nrelease, the words or phrases \"will likely result,\" \"are expected to,\"\n\"will continue,\" \"is anticipated,\" \"estimate,\" \"projected,\" \"intend to\" or\nsimilar expressions are intended to identify \"forward-looking statements\"\nwithin the meaning of the Private Securities Litigation Reform Act of 1995.\nSuch statements are subject to certain risks, known and unknown, and\nuncertainties, including but not limited to economic conditions, dependence\non management, our ability to compete with competitors, dilution to\nshareholders, and limited capital resources.\n\nContact Information:\n\nContact:\n\nMike Weisbarth\nChief Financial Officer\nmweisbarth@mace.com\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2205400594.MNPRE2205402438-08234620220224</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}