{"date": "2022-02-04 19:11:37.174000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2776.91, "close": 3158.71}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>GAMEON ENTERTAINMENT TECHNOLOGIES INC (\"GET-Z;GMETF-0\")\n- Completes Acquisition of FanClash\n\n     GameOn Entertainment Technologies Inc. (\"GameOn\" or the \"Company\"), a\nleading game technology provider to media, sports and entertainment\ncompanies, is pleased to announce that, further to its press release dated\nNovember 2, 2021, it has completed its acquisition of certain assets from\nInplay Labs pursuant to an asset purchase agreement dated February 4, 2022\n(the \"APA\").\n\n     Created by London-based Inplay Labs, FanClash uses proprietary\nreal-time fantasy technology to create innovative gameplay around live\nevents. Leveraging their technology, a tournament like the World Cup can\nhave 64 individual fantasy contests, as opposed to one tournament-long\ncontest, and features innovative boosts to power up points or trade players\nin-game, all in real time. FanClash was created by the team behind the hit\napp UFL, which boasted 1.6 million users and 14 million gameplays while\nbeing featured as the no. 1 sports app in 24 countries.\n\n     The integration of FanClash's technology is expected to provide GameOn\nwith access to the expanding fantasy sports and entertainment market. As\npreviously announced, GameOn anticipates that it will white label the\nreal-time fantasy technology to broadcasters, TV networks, streaming\nplatforms, leagues, tournaments, sportsbooks and NFT projects to drive\nlicense and revenue share partnerships. GameOn plans to leverage the\ntechnology not only for sports, but for other verticals such as reality TV,\nnews and elections. Additionally, Inplay Labs Founder Sohail Godall will be\nappointed as VP of Product and Head of Europe to spearhead the Company's\nEuropean operations.\n\n     \"The acquisition of FanClash strengthens our tech stack and provides\nus with an opportunity to broaden our market footprint as we enter the\nflourishing fantasy sports industry,\" said GameOn CEO Matt Bailey. \"Given\nthe inherent similarities of our companies to maximize fan engagement, the\nimplementation of FanClash's technology will be complementary and\nsynergistic to our core business. We have already commenced go-to-market\nefforts and are encouragingly receiving initial traction from customers,\nwhich we are confident will lead to imminent executed deals. This new year\nwill be an inflection point for GameOn as we look to sign on new customers\nand increase revenues by continuing to grow our workforce, discover\naccretive ways to enhance our technology and begin to commercially scale\nglobally.\"\n\n     Terms of the Acquisition\n\n     Pursuant to the terms of the APA, between GameOn, InPlay and a\ndirector of InPlay, GameOn acquired certain assets from InPlay, including\nall of the intellectual property that is used in or necessary for the\nconduct of the business of InPlay, for aggregate upfront consideration of\n$500,000 (the \"Upfront Purchase Price\"). The Upfront Purchase Price is\npayable as follows: (i) $200,000 in cash with on the date of closing of the\nTransaction (the \"Closing Date\"), and (ii) 1,538,461 common shares of the\nCompany (\"GameOn Shares\") with an aggregate value of $300,000 at a deemed\nprice per GameOn Share equal to $0.195, which such shares are subject to\nsecurities law mandated hold period lasting until June 5, 2022 and\ncontractual escrow with tranched release over a period of 24 months.\n\n     In addition to the Purchase Price, subject to applicable laws and\napproval of the Canadian Securities Exchange (the \"CSE\"), GameOn has agreed\nto pay the Vendor up to $500,000, subject to and upon the achievement of\ncertain performance milestones, payable through the issuance of that number\nof GameOn Shares being equal to a fraction, the numerator of which is\n$50,000 dollars, and the denominator of which is the greater of (i) the\ntrading volume weighted average trading price of the GameOn Shares as\nquoted on the CSE, calculated by dividing the total value by the total\nvolume of GameOn Shares traded for the period ending 10 CSE trading days\nprior to the date of the satisfaction of the performance milestone and (ii)\nthe lowest price permissible under the rules and policies of the CSE.\n\nContact:\nMatt Bailey\nDirector &amp; Chief Executive Officer\nGameOn Entertainment Technologies Inc.\n917-834-4921\n\n     Investor Relations Contact:\nGateway Group, Inc.\nJohn Yi\nGET@gatewayir.com\n949-574-3860\n\n     ABOUT GAMEON ENTERTAINMENT TECHNOLOGIES INC.\n\n     GameOn (CSE: GET) (OTCQB: GMETF) powers the biggest sports, media and\nentertainment companies with the most innovative white label game\ntechnologies. GameOn provides broadcasters, TV networks, streaming\nplatforms, leagues, tournaments, sportsbooks and NFT projects with white\nlabel prediction games, fantasy games and NFT-based games. Since completing\nthe Comcast NBCUniversal LIFT Labs Accelerator powered by Techstars in\n2018, GameOn has secured revenue-generating partnerships with global\ncompanies including NBCUniversal, Bravo and MX Player.\n\n     GameOn has a dynamic and experienced management team led by CEO, Matt\nBailey (Brooklyn Nets, Barclays Center), Chief Product Officer, Santiago\nJaramillo (Dapper Labs, NBA Top Shot, EA Sports) and VP of Partnerships,\nRyan Nowack (Madison Square Garden, New York Knicks, New York Rangers), as\nwell as its Directors, J Moses (Take-Two Interactive), Shafin Tejani\n(Victory Square Technologies), Katrina Palanca (Twitch, Brooklyn Nets, San\nAntonio Spurs) and Carey Dillen (YYOGA, FIFA, IOC).\n\n     FORWARD-LOOKING INFORMATION\n\n     This news release contains \"forward-looking information\" and\n\"forward-looking statements\" (collectively, \"forward-looking information\")\nwithin the meaning of applicable securities laws. Forward-looking\ninformation is generally identifiable by use of the words \"believes,\"\n\"may,\" \"plans,\" \"will,\" \"anticipates,\" \"intends,\" \"could,\" \"estimates,\"\n\"expects,\" \"forecasts,\" \"projects\" and similar expressions, and the\nnegative of such expressions. All statements other than statements of\nhistorical facts contained in this news release are forward looking\nstatements. Forward-looking information in this news release includes,\nwithout limitation, statements regarding the future plans and objectives of\nthe Company, execution of business strategy, future performance and future\ngrowth, business prospects, synergies and opportunities of the Company and\nits related subsidiaries, and other factors beyond the Company's control.\n\n     Forward-looking information is subject to known and unknown risks,\nuncertainties and other factors that may cause the Company's actual\nresults, level of activity, performance or achievements to be materially\ndifferent from those expressed or implied by such forward-looking\ninformation. Forward-looking information is based on the reasonable\nassumptions, estimates, analysis and opinions of management made in light\nof its experience and perception of trends, current conditions and expected\ndevelopments, and other factors that management believes are relevant and\nreasonable in the circumstances at the date such statements are made\n,including, but not limited to the Company being able to capitalize on the\nacquired assets, the ability of acquired assets to maintain its value as\npresently contemplated, the synergies of the acquired assets with the\nCompany's operations, and such other assumptions presented in the Company's\ndisclosure record. Although the Company has attempted to identify important\nfactors that could cause actual results to differ materially from those\ncontained in forward-looking information, there may be other factors that\ncause results not to be as anticipated. There can be no assurance that such\ninformation will prove to be accurate, as actual results and future events\ncould differ materially from those anticipated in such information.\nAccordingly, readers should not place undue reliance on forward-looking\ninformation. All forward-looking information herein is qualified in its\nentirety by this cautionary statement, and GameOn disclaims any obligation\nto revise or update any such forward-looking information or to publicly\nannounce the result of any revisions to any of the forward-looking\ninformation contained herein to reflect future results, events or\ndevelopments, except as required by law.\n\n     Neither the CSE nor its Regulation Services Provider (as that term is\ndefined in the policies of the CSE) accepts responsibility for the adequacy\nor accuracy of this release.\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203400264.MNPRE2203401170-10484220220204</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}