{"date": "2021-11-04 05:55:58.709000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>November 4, 2021</p></div><div class=\"tr-npp-lead\"><p>Over 140,000 Amazon drivers are being repaid nearly $60 million in tips that the company allegedly withheld from them, the Federal Trade Commission announced Tuesday.</p><p>The FTC and Amazon reached a settlement in February, with the company agreeing to pay more than $61.7million, the full amount the tech giant allegedly withheld which will be used by the FTC to compensate Amazon Flex drivers.</p></div><div class=\"tr-npp-body\"><p>The FTC said in February that Amazon Flex drivers were told they would be paid $18 to $25 an hour, with many statements saying things such as \"you will receive 100% of the tips you earn while delivering with Amazon Flex.\"</p><p>\"Rather than passing along 100% of customers' tips to drivers, as it had promised to do, Amazon used the money itself,\" Daniel Kaufman, acting director of the FTC's Bureau of Consumer Protection, said in February.</p><p>The FTC is sending out 139,507 checks and 1,621 PayPal payments to drivers. The average check for Amazon Flex drivers included in the settlement will be $422, but 19,980 drivers will receive checks for more than $600. The highest amount going to a single Amazon Flex driver is $28,000.</p><p>Amazon Flex drivers are independent contractors who can download an app to select different orders they want to deliver. Flex drivers deliver goods and groceries ordered through Amazon Prime Now and AmazonFresh programs, according to the FTC. These allow for customers to tip their drivers.</p><p>Affected drivers should deposit or cash their checks before Jan. 7.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Gannett</p></div>"}