{"date": "2022-01-31 16:12:17.289000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>IZEA WORLDWIDE INC (\"IZEA-Q\")\n- BrandGraph(r) 500 Year in Review Released: WhatsApp Ranks #1 for\n- 2021\n\n     IZEA Worldwide, Inc., the premier provider of influencer marketing\ntechnology, data, and services for the world's leading brands, today\nreleased its BrandGraph(R) 500 Year in Review ranking that highlights\nfascinating social media trends and brand-consumer conversations in 2021.\n\n     The BrandGraph platform analyzed 741 million pieces of content across\n16.6 million different social media accounts in 2021 to determine which\nbrands were most often mentioned by social media influencers across the\nleading social media platforms. The content index now contains more than\n1.3 billion posts.\n\n     Highlights of the 2021 BrandGraph(R) 500:\n\n     *  Two tech giants dominate the top 10: Meta/Facebook accounts for the\nNo. 1 (WhatsApp), No. 2 (Instagram) and No. 5 (Facebook) spots in the\nBrandGraph 500, while Alphabet/Google owns the No. 3 and 9 spots -- YouTube\nand Google. Other mega-companies -- TikTok (No. 4), Twitter (No. 6), Nike\n(No. 7), Disney (No. 8) and Apple's iPhone (No. 10) -- were top of mind for\nsocial media users in 2021. Netflix is making a play for a top-10 spot,\nrising two spots to No. 11.\n     *  Entertainment brands and performers generated the most buzz on\nsocial media and were the biggest movers on the BrandGraph 500. The most\nsignificant jump came from \"Wandavision\"; the Marvel Studio superhero show\nskyrocketed 257 places to No. 123 on the BrandGraph 500. The Academy Awards\ndropped 172 spots to No. 423 after ratings for the 2021 show tanked and\ngarnered negative reviews.\n     *  It was also a big year for British singers, especially former One\nDirection members, who generated the highest engagement among entertainers\non social media. Harry Styles rose 15 places to No. 95 while going on tour;\nZayn Malik jumped 36 spots to No. 200 while breaking up with model Gigi\nHadid and releasing new music; and Liam Payne dropped 26 places to No. 285\non the list after releasing the popular song \"Sunshine.\" Singer Dua Lipa,\nwhose song \"Levitating\" was one No. 1 on Billboard's Hot 100 list for 2021,\nascended 32 places to No. 194. Ed Sheeran joined the list as he soared 141\npositions to No. 292, one of the biggest jumps of 2021.\n     *  Nine American rappers made the BrandGraph 500: Cardi B at No. 128;\nTravis Scott at No. 152; Doja Cat at No. 240; Snoop Dogg at No. 263; Megan\nThee Stallion at No. 275; DaBaby at No. 286; Lil Wayne at 291; Juice WRLD\nat No. 381; and Offset at No. 401. Among those, only Lil Wayne saw a spike\nin the ranking, jumping 46 places.\n     *  Virtual worlds and video games got people talking, like Roblox,\nwhich rose 113 positions to No. 149, and Fortnite, which dropped 16 spots\nbut was still in the top 50, at No. 40. The well-known game Minecraft was\nup 17 spots to No. 72. Pokemon's popularity surged in 2021, which was\nhighlighted by an 82-place jump in the ranking to No. 191. Resident Evil\nhad a spike as well, rising 76 places to No. 243.\n     *  Social media users also showed an interest in crypto. Bitcoin rose\n45 spots in the ranking to No. 19, illustrating the increasing\nconversations surrounding cryptocurrencies and their future. Other\ncryptocurrencies that joined BrandGraph in 2021: Dogecoin, XRP, Binance\nCoin, Bitcoin Cash, Litecoin, Cardano and Ethereum.\n\n     \"BrandGraph gives brands unparalleled social media and consumer\ninsights to kick-start their 2022 marketing campaigns and monitor their\nprogress over time\" said Ted Murphy, Founder and CEO of IZEA. \"The\ncapability of the platform has grown immensely over the past year, both in\nfunctionality and in the sheer volume of data we are analyzing for over\n5,000 brands across a wide range of industries.\"\n\n     For the complete analysis of the BrandGraph 500, read our blog post\nhere: izea.com/resources/brandgraph-500-year-in-review-2021.\n\n     Core BrandGraph Functionality Added Throughout 2021\n\n     Full TikTok Platform Support\nA first in competitive benchmarking, BrandGraph reports now include TikTok\ncontent, as do brand profiles, and BrandGraph trends.\n\n     BrandGraph Compare\nBrandGraph Compare enables marketers to benchmark social media activity\namong brands across the entire BrandGraph universe. The Compare feature\nprovides a slew of comparison data sets (including a breakdown of key\nsocial media content statistics), identifies influencers, benchmarks\nengagement rates, and more.\n\n     Example: Benchmark the brands Ford vs. Pepsi vs. Dunkin' vs. CVS\n\n     BrandGraph Themes\nThemes are \"super classifiers\" that enable BrandGraph to connect wildcard\nbrands, categories, mentions, keywords, hashtags -- even emoji -- together\ninto a singular concept for identification and classification. Themes are\nused to contextually group content and provide insights both within\nBrandGraph and across the IZEA software ecosystem.\n\n     Example: The video game theme includes over 1,000 identifiers\nincluding game titles (Fortnite), game consoles (Xbox), game streaming\n(Twitch), and game hashtags (#gamergirl).\n     Creator Interests\nBrandGraph is now able to provide insights related to the content being\nproduced about a brand. This information can be used by marketers to better\nunderstand the \"content culture\" of their own brand or a competing brand.\n\n     Example: Jeep has a high concentration of influencers posting about\ncamping, photography, sunsets, and the military. Tesla influencers post\nmore about space travel, memes, consumer electronics, and climate change.\n\n     Brand-Produced Content\nBrandGraph now provides marketers with a tool to see the content themes of\nposts made by brands themselves. This tool can be used to quickly view\ncontent strategies for competitive or collaborative evaluation, similar to\ninfluencer profiles in IZEAx.\n\n     Example: BrandGraph programmatically identified that Lego has shared\ncontent to promote Star Wars, Nintendo, and Nasa.\n\n     With BrandGraph(R), brands can now see not only their ranking against\ncompetitors, but the brand universe at large, all curated programmatically\nby IZEA technology. Get more insights at brandgraph.izea.com. All product\nnames, logos, and brands are property of their respective owners. All\ncompany, product, and service names used in this press release are for\nidentification purposes only. Use of these names, logos, and brands does\nnot imply endorsement.\n\n     About IZEA\n\n     IZEA Worldwide, Inc. (\"IZEA\") is a marketing technology company\nproviding software and professional services that enable brands to\ncollaborate and transact with the full spectrum of today's top social\ninfluencers and content creators. The company serves as a champion for the\ngrowing Creator Economy, enabling individuals to monetize their content,\ncreativity, and influence. IZEA launched the industry's first-ever\ninfluencer marketing platform in 2006 and has since facilitated nearly 4\nmillion transactions between online buyers and sellers. Leading brands and\nagencies partner with IZEA to increase digital engagement, diversify brand\nvoice, scale content production, and drive measurable return on investment.\n\n     Safe Harbor Statement\n\n     All statements in this release that are not based on historical fact\nare \"forward-looking statements\" intended to qualify for the safe harbor\nfrom liability established by the Private Securities Litigation Reform Act\nof 1995. Forward-looking statements, which are based on certain assumptions\nand describe our future plans, strategies and expectations, can generally\nbe identified by the use of forward-looking terms such as \"may,\" \"will,\"\n\"would,\" \"could,\" \"should,\" \"expect,\" \"anticipate,\" \"hope,\" \"estimate,\"\n\"believe,\" \"intend,\" \"likely,\" \"projects,\" \"plans,\" \"pursue,\" \"strategy\" or\n\"future,\" or the negative of these words or other words or expressions of\nsimilar meaning. Examples of forward-looking statements include, among\nothers, statements we make regarding expectations concerning IZEA's ability\nto increase revenue and bookings, growth or maintenance of customer\nrelationships, and expectations concerning IZEA's business strategy.\nForward-looking statements involve inherent risks and uncertainties which\ncould cause actual results to differ materially from those in the\nforward-looking statements, as a result of various factors including, among\nothers, the following: competitive conditions in the content and social\nsponsorship segment in which IZEA operates; failure to popularize one or\nmore of the marketplace platforms of IZEA; our ability to establish\neffective disclosure controls and procedures and internal control over\nfinancial reporting; our ability to satisfy the requirements for continued\nlisting of our common stock on the Nasdaq Capital Market; changing economic\nconditions that are less favorable than expected; and other risks and\nuncertainties described in IZEA's periodic reports filed with the\nSecurities and Exchange Commission. The forward-looking statements made in\nthis release speak only as of the date of this release, and IZEA assumes no\nobligation to update any such forward-looking statements to reflect actual\nresults or changes in expectations, except as otherwise required by law.\n\n    Attachment\n\n\n\n                 *\n        BrandGraph(r) 500 Year in Review\n\nTel   : 1-407-674-6911    IZEA INC\nEmail : pr@izea.com\nWWW   : <a href=\"https://www.izea.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.izea.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203000586.MNPRE2203001840-07214820220131</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}