{"date": "2022-01-06 14:02:49.034000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3350.44, "close": 3265.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>On Dec. 30, a tipster called local authorities to report a significant number of items dumped near an intersection in Luther, Okla., police said.</p><p>When the Luther Police Department and the Oklahoma County Sheriff's Office arrived at the scene later that day, officers discovered nearly 600 discarded Amazon packages scattered on the ground and in garbage bags, authorities said. (Jeff Bezos, Amazon's founder, owns The Washington Post.)</p></div><div class=\"tr-npp-body\"><p>Inside one of the garbage bags, investigators found an envelope with a name and an address that eventually led them to an even larger discovery inside a home in Luther, Sheriff Tommie Johnson III said during a Wednesday news conference.</p><p>There, police found thousands of stolen Amazon packages stored in closets, attics, a detached garage and an underground storm shelter, Oklahoma County Sheriff's Office Capt. Robert Tye said during the news conference. Some items found in the home were still wrapped on pallets, Tye said.</p><p>\"Everywhere we looked there were packages,\" Tye said.</p><p>On Wednesday, the Oklahoma County Sheriff's Office announced it had arrested and charged three people in connection with the \"massive Amazon theft ring\" that left thousands of customers without packages they were supposed to receive by Christmas.</p><p>Those charged include Cesar Yasnier Cerqueira Rojas, a third-party driver for Amazon; 37-year-old Dinneris Matos Delgado, the owner of the truck allegedly used in the scheme; and 38-year-old Maikel Perez Laurencio, also a third-party driver.</p><p>The three face 15 felony counts of possession of stolen property and embezzlement. Matos was also charged with possession of a controlled dangerous substance after authorities found meth in her personal belongings, police said.</p><p>Cerqueira, Matos and Perez could not immediately be reached by The Post early Thursday. It is unclear whether they have lawyers.</p><p>The Oklahoma case is the latest example of delivery drivers being accused of tampering with customers' purchases during the holiday shopping season. In late November, police accused an unidentified FedEx Ground driver of tossing hundreds of packages in an Alabama ravine. The motive remains unclear.</p><p>At the Wednesday news conference, police said they obtained a search warrant shortly after discovering the envelope containing a name and home address at the first reported dump site in late December. Only books, a calendar and a copy of the Koran were left at the first site, KFOR reported.</p><p>That same day, authorities learned about a second dump site, where they say they discovered more empty Amazon packages before arriving at the house on Tuesday.</p><p>When authorities entered the home, they found thousands of Amazon packages and boxes stored in almost every room of the residence — enough to fill a 26-foot truck from \"top to bottom\" and \"front to back,\" Tye said. At least one undelivered shipment was worth nearly $15,000, according to Tye.</p><p>\"Amazon told us that's just going to be the tip of the iceberg,\" he added.</p><p>Police said they believe the packages were stolen from an Amazon distribution center in Oklahoma City. Authorities said they suspect Cerqueira and Perez loaded extra pallets into a truck when they arrived at the warehouse. Instead of taking the merchandise to the U.S. Postal Service or UPS so the items could be delivered, Tye said, the men allegedly took the packages to the home in Luther. There, police said, some items were opened for their own use and others were possibly sold online.</p><p>Most of the packages recovered by authorities were meant to be delivered in southern Oklahoma, while some had Kansas and Texas labels, police said. Authorities said they believe the alleged thefts dated back several months.</p><p>\"There were several thousand packages there,\" Tye said. \"That's something you're not going to do overnight, or even in a month or two. I believe they lived at the residence in Luther for approximately one year, so it could have been going on for at least a year.\"</p><p>At the news conference, police also said they had been informed of a possible third dump site in the Luther area.</p><p>\"There are probably going to be some more packages that will be recovered as well,\" Tye said. He said the third dump site is probably connected to the first two, along with the Amazon packages found inside the Luther residence.</p><p>Tye said Amazon is now in possession of all packages recovered at the Luther residence so the company can redeliver them.</p><p>\"If you're missing a package, please don't call us. We … have reached out to Amazon, so someone should contact you soon,\" Tye said.</p><p>Amazon did not immediately respond to a request for comment when contacted by The Post early Thursday. In a statement shared with NBC News, a spokesperson asked customers to report delays to the company and thanked local authorities for the discovery.</p><p>Police said they expect more charges to be filed.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 The Washington Post</p></div>"}