{"date": "2022-02-01 17:28:07.465000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The new Amazon space-saving furniture store has pieces to maximize space and storage, like folding desks, storage ottomans, lift-top coffee tables and daybeds.</p><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p></div><div class=\"tr-npp-body\"><p>Whether you just moved into a new place or want to redecorate your current abode, you're in the market for some new decor. Buying furniture online can be fun, but it can also be stressful, especially if you live somewhere that isn't exactly a palace. For those of us who live in a small apartment, condo or house—or for those of us with a close-quarters room to design—we want pieces that make the most of the small space available.</p><p>Fortunately, Amazon just launched a space-saving furniture store on its website just for that purpose. The curated selection includes \"flexible furniture that collapses, folds and stacks\" for every room in your house or apartment, from the kitchen to the bedroom to the living room.</p><p>Ready to redecorate? Here's what our experts recommend from Amazon's new store, including a highly rated folding desk and a storage ottoman that's equal parts stylish and functional.</p><p><span><span>Get deals and shopping advice delivered straight to your phone.</span> Sign up for text message alerts from the experts at Reviewed.</span> </p><p class=\"tr-npp-section-title\">What to buy from Amazon's new space-saving furniture store</p><p>You can shop plenty of great buys at the new Amazon space-saving furniture store, many of which have thousands of 5-star reviews from shoppers. Prices range from $20 all the way up to $2,000, and there are pieces in almost every decor style, from farmhouse-chic to modern industrial. You'll find desks, storage bins and cubes, coffee tables, trundles and daybeds and more. Even better? Many ship free—and even next-day—with Amazon Prime. </p><p>Below are our top picks from the collection, based on customer ratings and reviews:</p><ul class=\"bulleted-list arrowlist\"><li><span>Eknitey Folding Metal Side Table from Amazon for $36.80</span> </li><li><span>WoneNice Folding Storage Ottoman Cube from Amazon for $37.99</span> </li><li><span>Wee's Beyond Cushioned Padded Folding Stool from Amazon for $37.99</span> </li><li><span>Velvet Storage Ottoman Bench from Amazon for $65.99</span> </li><li><span>Coavas Folding Desk from Amazon for $73.93</span> </li><li><span>GreenForest Folding Desk from Amazon for $89.99</span> </li><li><span>Wlive Wood Lift-Top Coffee Table from Amazon for $149.99</span> </li><li><span>Zinus Suzanne Twin Daybed and Trundle from Amazon for $225</span> </li> </ul><p class=\"tr-npp-section-title\">Shop the Amazon space-saving furniture store</p><p><span><span>There's a lot more where this came from.</span> Sign up for our twice-weekly newsletter to get all our reviews, expert advice, deals and more.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Amazon just launched a store for space-saving furniture—here's what to buy</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}