{"date": "2021-12-07 17:24:32+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        It's no longer enough to simply move your workloads into the cloud and forget about them. From reduced costs to increased performance, the cloud provides the foundation your business needs to deliver results.\n      </p>\n                <p>\n        But, how can you tell if you're getting the most from your cloud infrastructure?\n      </p>\n                <p>\n        If you're working in the Amazon Cloud, the <a href=\"https://aws.amazon.com/blogs/apn/the-5-pillars-of-the-aws-well-architected-framework/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS well-architected framework</a> could be the solution. The framework covers <a href=\"https://aws.amazon.com/blogs/apn/the-5-pillars-of-the-aws-well-architected-framework/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">five core pillars</a>, all of which work to improve your cloud environment. These are:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          Operational excellence\n        </li>\n                  <li>\n          Security\n        </li>\n                  <li>\n          Reliability\n        </li>\n                  <li>\n          Performance efficiency\n        </li>\n                  <li>\n          Cost optimisation\n        </li>\n                </ul>\n                <p>\n        These pillars are synchronistic and help to <strong>optimise your software infrastructure.</strong> They work together to unshackle your software, so you don't have to worry about poor performance or frequent downtime.\n      </p>\n                <h4>\n        The 5 pillars of the AWS well-architected framework\n      </h4>\n                <p>\n        Let's take things further by unpacking the five pillars and displaying the benefits your business stands to gain.\n      </p>\n                <ol>\n                  <li>\n                    <h4>\n            Operational excellence\n          </h4>\n                  </li>\n                </ol>\n                <p>\n        Testing small, incremental changes, learning from failures, refining procedures, and improving documentation all lead to greater operational standards. With the AWS well-architected framework, your infrastructure isn't a tacked-on component, but a <strong>key accelerant of business success.</strong></p>\n                <p>\n        What's more, this pillar allows you to perform your operations as code, in turn automating your procedures and cutting out room for human error.\n      </p>\n                <p>\n        This, in effect, allows you to streamline your processes and delve into business insights to identify room for operational <strong>growth</strong>.\n      </p>\n                <ol>\n                  <li>\n                    <h4>\n            Security\n          </h4>\n                  </li>\n                </ol>\n                <p>\n                  <a href=\"https://www.independent.co.uk/news/uk/home-news/uk-businesses-cyber-attacks-security-breach-figures-fraud-hackers-government-report-a8321931.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Forty-three percent</a> of businesses suffer data breaches. And, with data regulations becoming more and more stringent, the damage of a breach is more expensive than ever before.\n      </p>\n                <p>\n        However, there's no need for your business to become part of these data breach statistics. The well-architected AWS framework delivers <strong>strong security improvements</strong> by keeping your data out of the wrong hands.\n      </p>\n                <p>\n        For instance, identity access management (IAM) ensures employees only have access to the information they need. This is important, as it cuts out the likelihood of damaging <a href=\"https://www.cpni.gov.uk/insider-threat\" data-type=\"url\" class=\"tr-link\" translate=\"no\">insider threats.</a></p>\n                <p>\n        More than this, however, the AWS well-architected framework:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          Enables <strong>complete trace-ability</strong>, allowing you to monitor threats, view logs and keep a close eye on your sensitive data\n        </li>\n                  <li>\n          Encourages you to <strong>classify, label and action your sensitive data</strong></li>\n                  <li>\n                    <strong>Automates</strong> code-based security mechanisms and controls\n        </li>\n                </ul>\n                <p>\n        These <a href=\"https://d1.awsstatic.com/whitepapers/architecture/AWS-Security-Pillar.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">features</a> align to deliver <strong>a</strong><strong>complete protection</strong><strong>strategy</strong> for your information, systems, and assets.\n      </p>\n                <ol>\n                  <li>\n                    <h4>\n            Reliability\n          </h4>\n                  </li>\n                </ol>\n                <p>\n        Cloud failures and IT downtime are costly. The average cost per hour of downtime to an enterprise is <a href=\"https://www.liquidweb.com/blog/downtime-numbers-stats-show-managed-hosting-saves-costs/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">£521,000.</a></p>\n                <p>\n        But the well-architected AWS framework ensures high levels of business continuity by applying the following five principles:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          Manage change in automation\n        </li>\n                  <li>\n          Automatic recoveries\n        </li>\n                  <li>\n          Scale horizontally to increase system availability\n        </li>\n                  <li>\n          Test procedures for recovery\n        </li>\n                  <li>\n          End guessing capacity\n        </li>\n                </ul>\n                <p>\n        With the AWS well-architected framework, your business is more resistant to disruption. Equally, your team will become better prepared for unexpected downtime.\n      </p>\n                <p>\n        By following these best practices, your business will stay productive no matter what.\n      </p>\n                <ol>\n                  <li>\n                    <h4>\n            Performance efficiency\n          </h4>\n                  </li>\n                </ol>\n                <p>\n        Wasteful cloud infrastructure can lead to unnecessary overspending, as well as major inefficiencies. To address these shortfalls, the well-architected AWS framework uses five design principles to drive your cloud performance:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <strong>Go global, fast</strong> - this allows you deploy your applications globally in just a few clicks.\n        </li>\n                  <li>\n                    <strong>Democratised technologies</strong> - this makes advanced (and <a href=\"https://aws.amazon.com/new/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">evolving</a>) technologies accessible for everyone.\n        </li>\n                  <li>\n                    <a href=\"https://searchaws.techtarget.com/feature/For-AI-on-AWS-it-all-starts-with-experimentation\" data-type=\"url\" class=\"tr-link\" translate=\"no\">More experimentation</a> - change is an opportunity, so mimic the start-up approach and innovate where possible.\n        </li>\n                  <li>\n                    <strong>Mechanical sympathy</strong> - understand how to get the most from the tools you use.\n        </li>\n                  <li>\n                    <strong>Use serverless architectures</strong> - the cloud removes the worry and headache of managing dedicated on-site servers.\n        </li>\n                </ul>\n                <p>\n        By working smarter, not harder, you can make the most of your existing cloud infrastructure and optimise your performance accordingly. With quicker deployment, no server management and more experimentation, you're free to innovate as much as you'd like.\n      </p>\n                <ol>\n                  <li>\n                    <h4>\n            Cost optimisation\n          </h4>\n                  </li>\n                </ol>\n                <p>\n        When it comes to improving business results, <a href=\"https://hbr.org/2018/06/the-6-ways-to-grow-a-company\" data-type=\"url\" class=\"tr-link\" translate=\"no\">cost optimisation</a> is often an important low-hanging fruit. But it can be tricky to optimise costs when you don't know where to look.\n      </p>\n                <p>\n        So, how does AWS well-architected framework help?\n      </p>\n                <p>\n        The answer is simple. The AWS well-architected framework optimises costs by not only cutting out infrastructure management costs, but right-sizing virtual instances to your actual usage levels, too. Or, in other words, you <strong>only pay for the computing capacity you need.</strong></p>\n                <p>\n        On top of this, the framework allows you to <a href=\"https://d1.awsstatic.com/whitepapers/architecture/AWS-Cost-Optimization-Pillar.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">track your usage</a>, analyse your workload performances, and attribute your expenditure accordingly.\n      </p>\n                <h4>\n        Unshackle your software - drive business growth\n      </h4>\n                <p>\n        Currently, <a href=\"https://ec.europa.eu/eurostat/statistics-explained/index.php?title=Cloud_computing_-_statistics_on_the_use_by_enterprises&amp;oldid=416727\" data-type=\"url\" class=\"tr-link\" translate=\"no\">42 percent</a> of UK businesses use the cloud to help drive growth. But in order to drive growth and keep your workloads running efficiently, you'll need to tailor your cloud infrastructure to suit your needs.\n      </p>\n                <p>\n        The AWS well-architected framework is a powerful way to <strong>get the most from your cloud infrastructure</strong>. From security, to cost and performance, the well-architected framework can help to speed up your processes, cut your expenditures and facilitate business-driven innovation.\n      </p>\n                <p>\n        For more on how the AWS well-architected framework can help, book a <strong>FREE infrastructure review</strong> with our cloud experts.\n      </p>\n                <div>\n                  <div>\n          First Name<sup>*</sup></div>\n                  <div>\n          Last Name<sup>*</sup></div>\n                  <div>\n          Company<sup>*</sup></div>\n                  <div>\n          Email<sup>*</sup></div>\n                  <div>\n          Telephone\n        </div>\n                  <div>\n                    <div>\n            Message\n          </div>\n                    <div>\n                      <span>Please leave this field empty.</span>\n                    </div>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.redcentricplc.com/cloud/aws-well-architected-framework/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Redcentric plc</strong> published this content on <strong>07 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>07 December 2021 17:24:32 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Redcentric plc</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Redcentric-plc</p></div>"}