{"date": "2022-01-26 19:37:12.347000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2799.72, "close": 2792.75}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Former Amazon delivery contractor Ahaji Amos has filed a lawsuit against Amazon over fair standards of labor. </p><p>According to Protocol, Amos filed the lawsuit Monday after setting up a corporation in North Carolina to deliver packages for Amazon and alleged that Amazon made it impossible for her corporation to become profitable or independent because of its unrealistic performance standards.</p></div><div class=\"tr-npp-body\"><p>Amos was a Delivery Service Partner (DSP) for Amazon, meaning that she ran her own full-time business and was in charge of a team of employees and a fleet of vans. Amazon first launched its delivery partnership program in 2018, allowing entrepreneurs to start last-mile courier companies that drop packages off at customers' doors.</p><p>The startup cost for running a DSP was about $10,000, according to Amazon Logistics. The attorneys involved in the lawsuit said Amazon advertised to people that they could make as much as $300,000 a year, Protocol says.</p><p>Amos says drivers were held to unrealistic standards and continuously monitored for \"delivery completion rate, safe driving scores, seatbelt off rates, speeding event rate, distractions rate, picture quality, door scan rate, and attended delivery rate\" as well as \"customer complaints, picture opportunities, and customer contact opportunities,\" according to Insider. </p><p>Based on those metrics, Amazon would rate DSPs as \"Poor, Fair, Great, Fantastic and Fantastic Plus,\" and only if those companies reached \"Fantastic\" or \"Fantastic Plus\" could they turn a profit, Insider says.</p><p><span><span>Amazon cuts delivery jobs</span> : Amazon severs ties with delivery firms, more than 1,200 drivers may get laid off</span> </p><p>Amazon has been hit with multiple lawsuits surrounding its practices with DSP.</p><p>According to Bloomberg, two delivery contractors in Oregon sued Amazon for $15 million, accusing the company of setting  unreasonable expectations for drivers and creating burdensome requirements for their business.</p><p><span>You can follow the author @michelle_shen10 on Twitter. </span> </p><p><span>This article originally appeared on USA TODAY: Woman who ran package delivery for Amazon files lawsuit over its labor standards</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}