{"date": "2022-01-25 17:33:16.882000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>India</p></div><div class=\"tr-npp-lead\"><p>India, Jan. 25 -- If you have been eyeing that favourite pair of truly wireless earbuds for long on Amazon, then this is the time to buy it. Offering huge discounts are major brands and some of them go up to as much as 65%. At that rate, it is nothing short of a steal.</p><p>Wireless earbuds are a great way to enjoy a truly cable-free experience. Working or listening to music or talking to friends can be quite a bother with cables hanging loose around us. These earbuds provide a truly wireless experience and come with huge battery life.</p></div><div class=\"tr-npp-body\"><p>The sound quality too is a big attraction. What's more is that they also have noise cancellation features which help block out outside sound. If you are interested then, we have shortlisted a number of earbuds which you might want to consider. Brands such Blaupunkt, boAt and Redmi among others have products in the category. Take a look.</p><p>1) Blaupunkt Germany's BTW01 Bluetooth Truly Wireless in Ear Earbuds with Mic</p><p>If you are keen on cutting-edge audio quality, then opting for this pair of earbuds is a good idea. Among its central attractions is its light and small design which nonetheless packs a lot of high tech features. It comes with high definition stereo sound that allows for pleasant listening experience. Its silicon mic provides conversation clarity of the highest levels. It has play time of up to 9 hours with each charge. Additionally, it gives 24 hours of play time with the charging case.</p><p>2) boAt Airdopes 441 Pro Bluetooth Truly Wireless in Ear Earbuds with Mic</p><p>This pair of earbuds comes with the following features: talk time/music time of up to 5 hours per bud and charging time of 1.5 hours. It has a standby time of 70 hours. It offers wireless experience, thanks to its latest Bluetooth v5.0 technology.</p><p>3) Noise Air Buds+ Truly Wireless Earbuds</p><p>This pair of earbuds offers a play time of up to 4 hours on a single charge and a total of up to 20 hours with the charging case. In case you have forgotten to charge your earbuds, then this product comes with feature called Instacharge. In such a scenario, this feature takes over to give you 80-minutes play time in just 8-minutes of charge.</p><p>4) Redmi Earbuds 2C in-Ear Truly Wireless Earphones</p><p>These earbuds give up to 12 hours of playback time with the case and up to 4 hours of playback time in a single charge. At just 4.1 grams, they are super lightweight and easy to carry around. They come with a voice assistant support. You can access your favorite voice assistant - Alexa, Google Assistant, or Siri - with a click of a button.</p><p>At Hindustan Times, we help you stay up-to-date with latest trends and products. Hindustan Times has affiliate partnership, so we may get a part of the revenue when you make a purchase. Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}