{"date": "2022-01-26 20:46:34.385000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2799.72, "close": 2792.75}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Welcome to The Technology 202! Today marks six months that I've been working at The Washington Post, which I can still hardly believe. Send salutations (along with some news tips) to: cristiano.lima@washpost.com.Below: A lawsuit against Google is going to trial, and a government report highlights the chip shortage. First up:</p><p>Why Amazon is ramping up its push for legalizing marijuana</p></div><div class=\"tr-npp-body\"><p>Amazon is channeling its influence in Washington to drum up bipartisan support for an unlikely cause: legalizing marijuana. </p><p>The company on Tuesday endorsed legislation by Rep. Nancy Mace (R-S.C.) to end the federal prohibition on pot, as Forbes reported, the first time it has backed a GOP-led bill on the issue. In doing so, Amazon is dialing up an unexpected campaign that if successful could make it easier for the e-commerce giant to expand its workforce as it continues a big hiring surge.</p><p>The tech giant came out in favor of legalization efforts last year and has since lobbied both publicly and privately for other, Democratic-led proposals that like Mace's would remove marijuana from the federal government's list of controlled substances. (Jeff Bezos, who founded Amazon, owns The Washington Post.)</p><p>Now the tech giant is again flexing its political might to rally lawmakers behind the cause, which Amazon says could widen its applicant pool by helping to ease drug testing requirements and assist with employee retention.</p><p>\"This is not an issue that Amazon would normally engage on,\" Brian Huseman, Amazon's vice president of public policy, told me during an interview Tuesday. </p><p>Legalizing pot could also open the door to a lucrative new market for the online retailer. But Huseman said Amazon is not interested in selling pot.</p><p>\"There are no plans to sell cannabis and that is not why we're doing this or being involved in this debate,\" he said.</p><p>Instead, he said, their focus in pushing for legislation is to remove hiring impediments, which Amazon has found disproportionately impact individuals of color. \"We realized that it was a hindrance to our ability to hire employees,\" he said.</p><p>That includes endorsing two bills led separately by Senate Majority Leader Chuck Schumer (D-N.Y.) and by Rep. Jerry Nadler (D-N.Y.) that each would also expunge some marijuana-related crimes, in addition to removing the federal prohibition. The tech giant also tapped its in-house lobbyists to work on both bills in the second half of last year, according to disclosure filings reviewed by The Technology 202.</p><p>But Amazon's latest endorsement is particularly notable given the bill's champion: Mace, a one-time campaign worker for former president Donald Trump who is now making the case that legalizing pot is pro-business, states-friendly and anti-big government. </p><p>In a separate interview Tuesday, Mace said it's crucial to have businesses big and small recognize \"the ramifications of cannabis prohibitions … and what a detriment it is that the federal government is getting in the way of state law and these kinds of reforms.\"</p><p>And she said Amazon's endorsement goes a long way. \"Having Amazon lean in at this level this early gives this kind of reform great momentum going forward,\" she said.</p><p>Mace's argument could resonate with other economic-minded Republicans, particularly with major corporations like Amazon backing the effort.</p><p>And it's a case Amazon could now make directly to Mace's colleagues. </p><p>\"We are talking with members of both parties, including Republicans, about why we think this is the right thing to do, especially from the standpoint of a major employer and what this means for our business and our employees and broadening the employee base,\" Huseman said.</p><p>Not all legalization proponents are convinced Amazon is a true ally, however, nor that it'll keep away from selling marijuana down the line.</p><p>\"I'm deeply skeptical that Amazon's lobbying is anything more than a self-interested move to monopolize yet another market, potentially blocking Black and Latino entrepreneurs from an emerging industry,\" Sen. Elizabeth Warren (D-Mass.), a staunch critic that has called for the tech giant to be broken up, told me.</p><p>But both Mace and Huseman said they're hoping to nourish bipartisan support.</p><p>\"One reason why we were particularly excited by Congresswoman Mace's bill is that it shows that there's bipartisan support for this issue, and we think that this is an issue on which both parties can agree,\" said Huseman. </p><p>Mace agrees. \"There's no way that we can do this kind of legislation … at the federal level, if we don't have Republicans and Democrats coming together and working on it, if we don't have businesses, both large and small, coming together and working on it,\" she said.</p><p>They're hoping to nudge other corporations into following Amazon's suit, too.</p><p>\"We hope and we think that other large employers in this country should take the same position that we're taking on this, that they should also use their resources to lobby for federal legalization and expungement,\" Huseman said. \"It's the right thing to do.\"</p><p>Amazon's endorsement doesn't come without political risk, given staunch opposition from some Republicans to the legalization push. </p><p>In November, the chairman of the South Carolina Republican Party rebuked Mace′s bill, saying that \"unequivocally, the South Carolina Republican Party is against any effort to legalize, decriminalize the use of controlled substances, and that includes this bill.\" Mace is from South Carolina.</p><p>But the prospect of blowback isn't dissuading Amazon. </p><p>\"We do think this policy is the right policy, it's right for the country, it's right for our employees, right for workers, so we're going to push and work on things that we think are good policy, and this is one of them,\" Huseman said.</p><p><span>Our top tabs</span> </p><p>Another Google lawsuit is going to trial</p><p>An Arizona judge ruled that the state attorney general's lawsuit against the tech giant alleging that it broke the state's consumer fairness law by not telling people who bought phones running Google's Android operating system that it would track their location can go ahead, Gerrit De Vynck reports for The Technology 202. The ruling comes days after four attorneys general sued Google, arguing that it tricked consumers into handing over access to their location data.</p><p>Both sides claimed victory, with Arizona Attorney General Mark Brnovich (R) saying it was a \"huge win\" for consumers and Google putting out an unsigned blog post saying \"the AG is somehow claiming this as a big victory but in reality, a judge rejected his central argument.\"</p><p>The judge ruled that the state's arguments are valid enough to be heard by a court on all but one point: that Google's sales of advertisements to third-party advertisers should be considered part of the consumer relationship the company has with regular users. It's possible including that in the case could have significantly widened the scope of the trial and potential impact Google could have had if its actions are found to be illegal. </p><p>Google also asked the court to rule on the attorney general's contention that when people use Google apps they are engaging in a transaction with the company, essentially buying Google services by selling their data, including location information. It's an interesting argument that could have ramifications for other Big Tech business models that provide free services but sell ads based on user data. The court didn't rule on whether that was a legitimate argument or not, and it will have to be decided at trial.</p><p>Chip manufacturers have tiny supplies amid shortage, Commerce Department says</p><p>The Commerce Department highlighted the severity of the shortage in a report as it pushed Congress to give chip makers federal subsidies, Jeanne Whalen reports. The Senate passed the measure last year, and House Democrats just released their version of the legislation.</p><p>The median chip inventories of manufacturers has tanked from 40 days' supply in 2019 to less than five days, according to the September survey conducted by the Commerce Department. \"This means a disruption overseas, which might shut down a semiconductor plant for 2-3 weeks, has the potential to disable a manufacturing facility and furlough workers in the United States if that facility only has 3-5 days of inventory,\" the department said.</p><p>Auto manufacturers and other chip users have \"no room for error\" because of the lack of inventory, Commerce Secretary Gina Raimondo said.</p><p>A Human Rights Watch official was targeted with NSO's Pegasus spyware</p><p>Lamah Fakih, Human Rights Watch's crisis and conflict director and the head of its Beirut office, was targeted by Pegasus, according to the group. Fakih, a U.S.-Lebanon dual-citizen, said she doesn't know why she was targeted or by which of NSO's government clients, but she spent much of last year studying a 2020 explosion in Beirut that killed more than 200 people and caused billions of dollars in damage, Craig Timberg reports.</p><p>Revelations about the targets of Pegasus keep coming. On Tuesday, research group Citizen Lab reported that two Polish citizens had their phones hacked with Pegasus.</p><p>The report comes \"as the NSO Group, which makes Pegasus and licenses its use to dozens of government clients worldwide, has been the subject of a growing number of news reports about financial, corporate and legal struggles,\" Craig writes. \"The departure of the company's chairman, Asher Levy, became public on Tuesday. A newly appointed chief executive announced his resignation in November after just two weeks on the job.\" NSO told news outlets that Levy's departure had been previously planned, and that reports of financial and other troubles are unfounded.</p><p>\"The Human Rights Watch report quotes the NSO Group saying it was 'not aware of any active customer using [its] technology against a Human Rights Watch staff member' and would investigate the findings,\" Craig writes. \"The forensic investigation has been reviewed by Amnesty International's Security Lab, an expert in tracking Pegasus.\"</p><p><span>Rant and rave</span> </p><p>Google has scrapped its successor to cookies — which it called \"FLOC\" — in favor of a new system called Topics. The new system will \"track users on Google's Chrome browser and assign them a set of advertising categories, like travel or fitness, based on the sites they visit,\" my colleague Gerrit De Vynck reports. Johns Hopkins University associate professor Matthew D. Green:</p><p>Writer and media analyst Thomas Baekdal:</p><p>Game designer Adam Saltsman and v buckenham, who makes online tools:</p><p><span>Agency scanner</span> </p><p>A fashion brand is fined for suppressing negative reviews, putting retailers on alert (The New York Times)</p><p><span>Workforce report</span> </p><p>Amazon pauses 'pay to quit' offers for warehouse workers (The Information)</p><p>High Amazon turnover could shift Alabama union election vote (Bloomberg Law)</p><p><span>Inside the industry</span> </p><p>Google proposes a new way to track people around the Web. Again. (Gerrit De Vynck)</p><p>European Union pushes Big Tech to do more on child sex abuse material (Forbes)</p><p>Mark Zuckerberg's stablecoin ambitions unravel with Diem sale talks (Bloomberg)</p><p>Start-up Muzmatch entwined in naming battle with dating giant Match (Financial Times)</p><p><span>Mentions</span> </p><p>Jenna Hopkins joined the Anti-Defamation League as its director of technology policy. She previously worked for Rep. Bennie G. Thompson (D-Miss.) and was detailed to the House Jan. 6 committee, which is chaired by Thompson.</p><p><span>Trending</span> </p><p>Crypto collapse erases more than $1 trillion in wealth, forcing a reckoning for everyday investors (Tory Newmyer, Jeff Stein and Nitasha Tiku)</p><p><span>Daybook</span> </p><p>FTC Commissioner Noah Phillips discusses data privacy at an event hosted by the National Cybersecurity Alliance and LinkedIn today.</p><p>Sindy Benavides, the CEO of the League of United Latin American Citizens, discusses the digital divide at a Georgetown University Center for Business &amp; Public Policy event today at noon. </p><p>Sens. Ron Wyden (D-Ore.) and Marsha Blackburn (R-Tenn.) speak at an R Street Institute event about a future federal privacy law on Thursday at 2:30 p.m.</p><p>Apple holds a conference call to discuss its earnings on Thursday at 5 p.m.</p><p>The Brookings Institution hosts an event on ethical use of artificial intelligence on Monday at 11 a.m.</p><p><span>Before you log off</span> </p><p>That's all for today — thank you so much for joining us! Make sure to tell others to subscribe to The Technology 202 here. Get in touch with tips, feedback or greetings on Twitter or email. </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 The Washington Post</p></div>"}