{"date": "2021-11-05 12:14:00.090000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3384.0, "close": 3518.99}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Four hours from Nauta, in the Loreto region, is the Dos de Mayo native community, the place where a technical team from the National Telecommunications Program (PRONATEL) traveled, with the aim of talking with the authorities and citizens about the implementation march of the Conecta Selva initiative, which will benefit more than 260,000 Peruvians in the Amazon through satellite Internet access.</p><p>The meeting was attended by the president of the Cocama Association for Development and Conservation San Pablo de Tipishca (ACODECOSPAT), Alfonso L?pez, the apu of the V?ctor Ra?l community, Wilfredo Salas, the apu of the San Jos? Sarapanga community, Juan Huaqari, as well as others authorities and neighbors. In addition to representatives of the company Telespazio Argentina, contractor in charge of the implementation, operation and maintenance during the service life of the Conecta Selva initiative.</p></div><div class=\"tr-npp-body\"><p>The meeting served to resolve doubts, inform about the scope and beneficiaries, collect suggestions in favor of the implementation and request support from the apus to facilitate the entry and deployment of the initiative in their communities, since -in this way- PRONATEL seeks to benefit to the citizens of these remote areas of the country, to which telecommunications projects have not reached for a long time.</p><p>To date, 335 satellite Internet access services have already been implemented, with which 287 schools and 36 health establishments are now connected to the satellite Internet service free of charge. In this way, Conecta Selva is operating in 231 locations, which -in some cases- are accessing tele-education and telehealth services for the first time, as well as expanding their digital skills and personal and academic development.</p><p>It is important to highlight that Conecta Selva includes the installation of satellite Internet service in educational institutions and health centers, located in Amazonas, Loreto, Ucayali and Madre de Dios.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}