{"date": "2022-01-21 18:12:04+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3033.35, "close": 2890.88}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-story-p1\"><span class=\"tr-dateline\">CAPE TOWN, Jan 21 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>A South African court on Friday postponed a ruling on a lawsuit from descendants of South Africa's earliest inhabitants, the Khoi and San, to try to halt construction of Amazon's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> new Africa headquarters on what they say is sacred land.</p><p>The 70,000-square metre development in Cape Town includes plans for a hotel, retail offices and homes, and with Amazon - which employs thousands of people in data hubs in the city - its main tenant. But it has faced a backlash from Khoi and San community leaders, who say they represent the majority of their people.</p><p>The Khoi and the San were the earliest inhabitants of South Africa, the latter roaming as hunter gatherers for tens of thousands of years, and the former joining them as pastoralists more than 2,000 years ago.</p><p>\"The judgement has been reserved and we will probably get the judgement next week,\" one of the lawyers said.</p><p>The proposed building site lies at the confluence of two rivers, the Black River and the Liesbeek, that is sacred to both groups, and objectors fear it will also block their view to the equally sacred Lion's Head, part of Table Mountain.    </p><p>Not everyone identifying with these groups are against the project - an association of Khoi and San who support the development are among the respondents in the case.</p><p>    They and the other respondents, which include the project developer Liesbeek Leisure Properties Trust, the City of Cape Town and Western Cape Province, argue they have fulfilled all regulatory requirements and it is unreasonable to jettison the prospect of investment and jobs from a major tech company in a country in which a third of people are out of work.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Shafiek Tassiem and Wendell Roelf; Writing by Tim Cocks; Editing by Susan Fenton)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:tim.cocks@thomsonreuters.com\" data-type=\"email\" translate=\"no\">tim.cocks@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SAFRICA-AMAZON (PIX)</p></div>"}