{"date": "2021-12-12 14:02:55.468000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3444.24, "close": 3381.83}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Even if you're not an Amazon fan, you can't deny how easy it is to find just about anything you want. That includes, of course, holiday gifts.</p><p>This year, be an Amazon shopping ninja. <span>Tap or click here for clever ways to hide your gift orders, get Amazon Prime for less money, trade in your older gadgets for credit, and more.</span> </p></div><div class=\"tr-npp-body\"><p>There's also account security to consider. You should remove your Amazon public profile, for one. <span>Tap or click for five security steps every Amazon shopper should take.</span> </p><p>Then we get to the money. Whether you're buying presents, getting yourself a few gifts, or doing your regular shopping, there are tricks you can use to save a pretty penny.</p><p><span>1. Sign up for an Amazon Business account</span> </p><p>If you shop on Amazon a lot, you likely have a Prime account. <span>Here are some of my favorite perks included with the subscription.</span> </p><p>An Amazon Business account gives you perks that you don't get with a Prime account. You get exclusive discounts and can sell products and services to other businesses. You still get free shipping and access to Prime Day deals, Lightning Deals and Prime Early Access too.</p><p><span>Tap or click here to start your free Amazon Business account.</span> </p><p><span><span>Life tip you won't find on TikTok:</span> 9 photos you should always have on your phone at your fingertips</span> </p><p><span>2. Don't forget about Lightning Deals</span> </p><p>Unlike Prime Days, Lightning Deals happen all the time. Lightning Deals generally include products with limited stock or a set time limit. For example, a smart speaker could be on sale for 75% for the next three hours or until it sells out. If you see a deal you like, grab it before it's gone.</p><p>Lightning Deals can be found throughout Amazon and are available on the Today's Deals page. You can also browse upcoming deals and add yourself to the waitlist, so you get an alert when the deal is active. Don't wait, though. You'll only have a limited amount of time to make a purchase.</p><p><span><span>Here's the bad news:</span> Amazon shares your private info – unless you do something about it.</span> </p><p><span>3. Don't forget to cut coupons</span> </p><p>No scissors are necessary for these coupons. When you're shopping, look for a checkbox near the item's price. If you click, a virtual coupon will be applied. If you don't click, you don't get the discount. Check to make sure you've saved all you can before submitting your order.</p><p><span>4. Be patient</span> </p><p>Do you need every item rushed to your door? Gifts you might need as soon as possible, but when you can wait, you'll get a little something in return.</p><p>Select a later shipping date to get credit toward future orders or media at checkout. When you select a delivery date, you'll see any available incentives for no-rush delivery. These are often just small credits toward media like audiobooks, but it all adds up.</p><p><span><span>Struggling with what to buy all your favorite people this holiday season?</span> My team and I put together gift guides for everyone on your list.</span> </p><p><span>5. Check out the Amazon credit card</span> </p><p>This is not financial advice, and you shouldn't spend money you don't have. That said, the Amazon Prime Rewards credit card has some pretty darn good benefits when you use it to shop on Amazon.com.</p><p>• You get 5% cash back on purchases from Amazon and Whole Foods Market</p><p>• Earn 2% back at restaurants, gas stations and drugstores</p><p>• Get 1% back from utilities, ride-share and all other purchases</p><p>• You can even get 10% or more back on select Prime products</p><p>You also get an Amazon Gift Card upon approval.</p><p>As for interest, you can choose a percentage back or 0% APR for 6-18 months on $50 or more purchases. After the 0% promo period ends, a variable APR of 14.24% to 22.24% applies.</p><p><span>Tap here to fill out an application for an Amazon Rewards card and see if you qualify.</span> </p><p><span>6. Another way to score discounted products</span> </p><p>Amazon Warehouse features items that were returned or slightly used. This includes refurbished or open-box items. It's a great source for video games, appliances, power tools, cameras, school supplies and electronics in general. You can use your Prime benefits for free shipping, and there's a good return policy.</p><p><span>Tap or click here to check out some wares from Amazon Warehouse.</span> Be sure to check out the item's condition, so you know what you're getting.</p><p>On the other hand, Amazon Outlet includes closeout, clearance, and overstock items. For example, you may find holiday items that are out of season for ridiculously cheap.</p><p>You probably won't find popular high-end items from Apple and Sony, but you can find good deals on accessories and lesser-known brands. <span>Tap or click here to check out Amazon Outlet.</span> </p><p><span>Bonus Tip:</span> 10 security terms you need to know right now</p><p>You can't protect your privacy and security if you don't know the lingo. This episode covers 10 important security terms you need to know and tells you why they're so crucial.</p><p>Check out my podcast \"Kim Komando Explains\" on Apple, Google Podcasts, or your favorite podcast player.</p><p>Listen to the podcast here or wherever you get your podcasts. Just search for my last name, \"Komando.\"</p><p><span>Learn about all the latest technology on the Kim Komando Show, the nation's largest weekend radio talk show. Kim takes calls and dispenses advice on today's digital lifestyle, from smartphones and tablets to online privacy and data hacks. For her daily tips, free newsletters and more, visit her website at Komando.com.</span> </p><p><span>The views and opinions expressed in this column are the author's and do not necessarily reflect those of USA TODAY.</span> </p><p><span>This article originally appeared on USA TODAY: How to take full advantage of your Amazon account and save money</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}