{"date": "2022-01-15 17:08:43.402000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3242.76, "close": 3125.98}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The police in <a href=\"https://www.independent.co.uk/topic/connecticut\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Connecticut</a> are investigating a <a href=\"https://www.independent.co.uk/topic/home-invasion\" data-type=\"url\" class=\"tr-link\" translate=\"no\">home invasion</a> from earlier this week when two armed intruders broke into a house in Milford while disguised as <a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> delivery workers.</p><p>The two not only wore Amazon delivery worker uniforms but also carried a package on 10 January, the Milford police said. The two men forced their way into the home at 494 Naugatuck Avenue that day when the resident opened the door to accept the package.</p></div><div class=\"tr-npp-body\"><p>In a statement, the Milford police spokesperson said that this was an isolated incident and that there was no threat to the public.</p><p>\"The victim reports that there were two armed suspects, both wearing Amazon delivery uniforms and carrying a package, who forced their way into the residence after the victim opened the door to take the delivery,\" Milford Police Department said in a statement.</p><p>The incident was captured on CCTV cameras and shared by CBS-affiliate WFSB.</p><p>Screams could be heard in the video when the person who opened the door struggled to fight the two men. The package that the intruders held can also be seen falling to the ground.</p><p>Police have not yet confirmed if the intruders took anything from the house. \"Please avoid the area as investigation continues,\" the police said in a statement on Facebook.</p><p>Meanwhile, Amazon spokesperson Loni Monroe said the two men didn't work for Amazon.</p><p>\"We are glad the family is safe after this horrible incident,\" the statement said. \"We take these matters seriously and are working with law enforcement as they continue to investigate.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 Independent, The (UK) (Online). All rights reserved.</p></div>"}