{"date": "2021-12-30 23:12:36.672000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3384.02, "close": 3334.34}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>AMDOCS LTD (\"DOX-Q\")\n- Analyst Reports and Industry Awards Highlight Amdocs' Leadership in\n- 5G, Digital Transformation, Cloud and Customer Experience in 2021\n\n     Amdocs, a leading provider of software and services to communications\nand media companies, today announced it has been named a leader in multiple\ndomains by global analyst firms and highly-regarded awards programs\ncovering the industry's vendor landscape.\n\n     Through a series of award wins and analyst commendations, Amdocs has\nbeen recognized for its market leadership in the technologies and trends\nthat are driving innovation in communications and media and enabling\nnext-generation experiences for both consumers and enterprises.\n\n     AMDOCS SUSTAINS AND GROWS MARKET-SHARE LEADERSHIP IN MONETIZATION AND\nREVENUE MANAGEMENT\n\n     *  Analysys Mason recognized Amdocs as the global leader in the\noverall monetization platforms product-related market for the 14th\nconsecutive year with an estimated market share of 24 per cent.\n     *  Analysys Mason ranked Amdocs as the leader in global monetization\nplatforms in professional services with an estimated market share of 9 per\ncent.\n     *  GlobalData ranked Amdocs as a global leader in revenue management.\n     *  Amdocs MarketONE won the Excellence in Payment/Crypto/Commerce\nAward at the 13th annual Media Excellence Awards, which honor global\ninnovation and leadership in mobile, technology and entertainment.\n     *  The International Trade Association for the Broadcast &amp; Media\nIndustry awarded its 2020 BaM(R) award in the Monetize category to Amdocs\nMarketONE in another win for the cloud-native, SaaS, scalable platform.\n\n     A GLOBAL LEADER IN DIGITAL TRANSFORMATION, CUSTOMER EXPERIENCE,\nTELCO/IT SERVICES AND QUALITY ENGINEERING\n\n     *  Amdocs took home the Outstanding Digital Enablement Vendor Award at\nLight Reading's Leading Lights Awards for the second year running.\n     *  A GlobalData report recognized Amdocs as a leader in Digital\nTransformation Platforms.\n     *  Omdia ranked Amdocs as the global leader for both Telecom IT\nApplications Services (market share = 16 per cent) and Telco IT Software &amp;\nServices (market share = 14 per cent).\n     *  The TM Forum Excellence Awards 2021 saw Amdocs and Airtel claim\nvictory in the Customer Experience and Trust category following Amdocs'\nintroduction of AI-driven automated operations that dramatically improved\nAirtel's digital operations and reduced customer frustration to near-zero\nlevels.\n     *  A NelsonHall report ranked Amdocs first for market share (14 per\ncent) in Quality Engineering Services for Telecoms.\n\n     A PIONEER IN CLOUD AND 5G INNOVATION\n\n     *  Amdocs was a 2021 Global Amazon Web Services (AWS) Partner Network\n(APN) Public Sector Partner Award winner for its Customer Experience Suite\n(CES). This award recognizes leaders who play a key role helping customers\ndrive innovation and build solutions using AWS Cloud technology.\n     *  Amdocs was formally recognized as the industry leader in cloud\ntechnology innovation at Total Telecom's Asia Communication Awards by\nwinning the Cloud Technology Initiative award for its \"game-changing\"\nMicroservices360 (MS360) platform.\n     *  The Asia Communication Awards also saw success for Amdocs in the 5G\nTechnology Initiative category, with Amdocs Monetization Suite being named\nthe winner.\n     *  GlobalData named Amdocs a leader in both Product Configuration &amp;\nCapacity in Policy Control and Standards &amp; Interface Support in Policy\nControl.\n\n     CONTINUED LEADERSHIP IN SERVICE AND NETWORK AUTOMATION\n\n     *  Analysys Mason ranked Amdocs as the global leader in service design\nand orchestration product revenue for the fourth year in a row, with an\nestimated market share of 14 per cent.\n     *  Amdocs was named the winner of the Most Innovative Hybrid\nNetworking Strategy Award at Light Reading's Leading Lights Awards.\n     *  GlobalData named Amdocs a leader for both Portfolio Scope in\nNetwork Service Orchestration and Standards &amp; Interface Support in Network\nService Orchestration.\n\n     Supporting Resources\n\n     *  Keep up with Amdocs news by visiting the company's website\n     *  Follow us on Twitter, Facebook, LinkedIn and YouTube\n\n     About Amdocs\nAmdocs helps those who build the future to make it amazing. With our\nmarket-leading portfolio of software products and services, we unlock our\ncustomers' innovative potential, empowering them to provide next-generation\ncommunication and media experiences for both the individual end user and\nenterprise customers. Our 28,000 employees around the globe are here to\naccelerate service providers' migration to the cloud, enable them to\ndifferentiate in the 5G era, and digitalize and automate their operations.\nListed on the NASDAQ Global Select Market, Amdocs had revenue of $4.3\nbillion in fiscal 2021. For more information, visit www.amdocs.com\n\n     Amdocs' Forward-Looking Statement\n\n    This press release includes information that constitutes forward-looking\nstatements made pursuant to the safe harbor provision of the Private\nSecurities Litigation Reform Act of 1995, including statements about\nAmdocs' growth and business results in future quarters. Although we believe\nthe expectations reflected in such forward-looking statements are based\nupon reasonable assumptions, we can give no assurance that our expectations\nwill be obtained or that any deviations will not be material. Such\nstatements involve risks and uncertainties that may cause future results to\ndiffer from those anticipated. These risks include, but are not limited to,\nthe effects of general economic conditions, Amdocs' ability to grow in the\nbusiness markets that it serves, Amdocs' ability to successfully integrate\nacquired businesses, adverse effects of market competition, rapid\ntechnological shifts that may render the Company's products and services\nobsolete, potential loss of a major customer, our ability to develop\nlong-term relationships with our customers, and risks associated with\noperating businesses in the international market. Amdocs may elect to\nupdate these forward-looking statements at some point in the future;\nhowever, the Company specifically disclaims any obligation to do so. These\nand other risks are discussed at greater length in Amdocs' filings with the\nSecurities and Exchange Commission, including in our Annual Report on Form\n20-F for the fiscal year ended September 30, 2021 filed on December 10,\n2021.\n\nMedia Contacts\n\nMichael Youds\nAmdocs Public Relations\nTel: +44 7855 827 038\nEmail: michael.youds@amdocs.com\n\nHolly Abbott\nBabel PR for Amdocs\nTel: +44 (0)7527 521057\nEmail: amdocs@babelpr.com / holly.abbott@babelpr.com\n\nTel   : 314-212-8328    AMDOCS LTD\nFax   : 314-212-7500\nEmail : dox_info@amdocs.com\nWWW   : <a href=\"https://www.amdocs.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.amdocs.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2136301014.MNPRE2136301698-14530820211230</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}