{"date": "2021-11-25 16:16:37+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3580.41, "close": 3561.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Asif Shahzad</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">ISLAMABAD, Nov 25 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Pakistan's largest e-commerce retail platform Daraz aims to host    up to 300,000 small to medium enterprises (SMEs) in two years, its CEO said, as the firm seeks to bolster its position in its home market in the face of potential competition from global giant Amazon.</p><p>E-commerce growth in the country of 220 million is yet to take off fully, like in neighbouring India where the market features retail heavyweights such as Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and Walmart <a href=\"reuters://REALTIME/Verb=FullQuote/ric=WMT.N\" data-type=\"ric\" data-ric=\"WMT.N\" translate=\"no\" dir=\"ltr\">WMT.N</a> and large local platforms run by India's Reliance <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RELI.NS\" data-type=\"ric\" data-ric=\"RELI.NS\" translate=\"no\" dir=\"ltr\">RELI.NS</a> and Tata groups.</p><p>Daraz, founded in 2012 in Pakistan and acquired by Chinese giant Alibaba <a href=\"reuters://REALTIME/Verb=FullQuote/ric=9988.HK\" data-type=\"ric\" data-ric=\"9988.HK\" translate=\"no\" dir=\"ltr\">9988.HK</a> in 2018, has 100,000 SMEs in Pakistan on its platform. </p><p>\"We want to get to 300,000 active and educated SMEs selling on our platform within the next two years, and that will basically create a million jobs,\" CEO Bjarke Mikkelsen told Reuters in an interview on Wednesday.</p><p>Pakistan's rapidly growing middle class, over 60% youth population and broadband subscriptions of over 100 million,</p><p>makes it a lucrative destination for e-commerce platforms.</p><p>Amazon announced earlier this year that it will allow Pakistani entrepreneurs to sell products on its marketplace. </p><p>Before the interview, Mikkelsen met Prime Minister Imran Khan and his finance and investment teams to discuss coordination on free zones where tech companies would get special incentives to flourish, and an e-commerce university Khan said Pakistan will be opening.</p><p>Daraz operates in four other South Asian nations - Sri Lanka, Bangladesh, Nepal and Mayanmar - with access to 500 million customers with a team of 10,000 employees. It has invested $100 million in Pakistan and Bangladesh over the last two years, Mikkelsen said.</p><p>It is targeting sales this year of nearly $1 billion through its platform, having seen 100% order growth year-on-year in the last four years, he said. </p><p>The e-commerce sector in Pakistan grew over 35% in value in the first quarter of 2021 to 96 billion Pakistani rupees ($548.89 million) compared to 71 billion ($405.95 million) over the same period of last year, according to commerce ministry data. </p><p>Out of the 70 million users who visited the Daraz website  last month, 35 million were from Pakistan. Mikkelsen said Pakistan was seeing more people now ready to use digital services. </p><p>He added that e-commerce in the South Asian nations where Daraz operates was only 2% of the retail market, which could be scaled up 10 to 20 times.  </p><p>($1 = 174.9000 Pakistani rupees)</p><p><br/></p><p class=\"tr-signoff\"> (Writing by Asif Shahzad; Editing by Emelia Sithole-Matarise)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:asif.shahzad@thomsonreuters.com\" data-type=\"email\" translate=\"no\">asif.shahzad@thomsonreuters.com</a> ; +923018463683; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: PAKISTAN-ECONOMY/ECOMMERCE (PIX)</p></div>"}