{"date": "2021-11-24 13:30:48.267000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Read Article Amazon Web Services (AWS) announced that Apollo Tyres, India's leading tyre manufacturer, is going all-in on AWS to digitally transform. By moving all of its IT infrastructure to AWS, Apollo Tyres can use AWS's broad portfolio of services ...</p><p>Amazon Web Services (AWS) announced that Apollo Tyres, India's leading tyre manufacturer, is going all-in on AWS to digitally transform. By moving all of its IT infrastructure to AWS, Apollo Tyres can use AWS's broad portfolio of services to innovate new customer experiences while driving productivity, compliance, and process efficiency gains globally, across seven factories. Apollo Tyres will draw on the breadth and depth of AWS capabilities, including Internet of Things (IoT), data and analytics, and machine learning, to transform into an agile, data-driven enterprise. Using data from the factory floor and real-time information from production machines, like tyre rubber mixer machines, Apollo Tyres can expand operational intelligence capabilities and more accurately manage machine utilisation, ensuring high quality levels and machine efficiency. With AWS, Apollo Tyres is connecting all of its factories in the cloud this year in India and Europe. By 2022, Apollo Tyres plans to migrate all mission-critical enterprise applications, including its SAP applications, to AWS to enhance customer experience, improve process efficiency, and enable process automation. <br/><br/> Apollo Tyres produces more than 2,425 tons (2,200 metric tons) of tyres daily in its seven factories worldwide. Each factory previously ran their on-premises infrastructure in silos, which provided limited visibility into global manufacturing efficiencies. Apollo Tyres needed to upgrade its infrastructure to develop new ways of engaging with fleet operators, tyre dealers, and consumers, while delivering tyres and services efficiently at competitive prices. The company's first step was to create a data lake on AWS, which centrally stores Apollo Tyres' structured and unstructured data at scale. This data lake provides the foundation for an integrated data platform, which enables Apollo Tyres' engineers around the world to collaborate in developing cloud-native applications and improve enterprise-wide decision making. The integrated data platform enables Apollo Tyres to innovate new products and services, including energy-efficient tires and remote warranty fulfillment. <br/><br/> Using AWS IoT SiteWise, a managed service that makes it easy to collect, store, organise, and monitor data from industrial equipment at scale, and AWS IoT Greengrass, an open-source edge runtime and cloud service for building, deploying, and managing device software, Apollo Tyres developed an IoT-in-a-box solution. The solution connects production machines on the factory floor to AWS in as few as five days. Once connected, the solution captures data from multiple machines-including mixers, tyre building equipment, and curing presses-and feeds it to the data lake. Apollo Tyres uses Amazon Redshift, a cloud data warehouse, to create a global dashboard for visualising production information from the data lake, providing business teams and plant managers with real-time visibility into the manufacturing process. This visibility improves production efficiency and productivity, for example by reducing the idle time of curing presses that shape the tyre in a mold by 50%. <br/><br/> Apollo Tyres also launched an automated tyre inspection program that checks for tyre defects using photos of the tyres taken as they progress along the production line. Based on Amazon Rekognition, a machine learning service that automates image and video analysis, this automation allows factory supervisors to intervene when manufacturing anomalies occur, providing customers with high-quality tyres that meet strict safety standards. Using Amazon Elastic Kubernetes Service (Amazon EKS), which gives AWS customers the flexibility to start, run, and scale Kubernetes applications in AWS or on premises, Apollo Tyres is building new digital products using microservices that support any application architecture, regardless of scale, load, or complexity. For example, the manufacturer is building a suite of applications to help commercial vehicle fleet operators track the status of their vehicles' tyres, prompting them to replace a tyre before it fails, to ensure road safety and minimise vehicle downtime. <br/><br/> \"By digitally transforming with AWS, we can unlock productivity and efficiency gains in our factories globally, innovate new products and services faster, and enhance customer experience,\" said Hizmy Hassen, Chief Digital Officer, Apollo Tyres. \"We are using AWS capabilities, like IoT and machine learning services, to connect our factories and make them smarter. This fosters collaboration between our IT and business teams to make the production process more efficient, while delivering higher quality products at lower cost.\" <br/><br/> \"Apollo Tyres is using the cloud to digitally transform, improve the tyre manufacturing process, and deliver better value to customers,\" said Vaishali Kasture, Head of Enterprise, Mid-Market, and Global Businesses, AWS India and South Asia, Amazon Internet Services Private Limited (AISPL). \"By moving its entire infrastructure to AWS, Apollo Tyres creates an environment of rapid and continuous innovation to provide safer and better quality tyres, and enhanced customer service experiences.\"</p></div><div class=\"tr-npp-body\"><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}