{"date": "2021-12-22 23:17:27.493000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.34, "close": 3421.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon workers at a key warehouse in Staten Island, N.Y., refiled an application on Wednesday to hold a vote on unionization with the federal government, after withdrawing their application last month.</p><p>The Amazon Labor Union, an independent group of workers at the facility that isn't connected to a major national union, had its petition rejected by the National Labor Relations Board in November for not meeting the threshold for enough workers who had signed authorization cards, typically 30 percent. Organizing leader Chris Smalls said at the time that the group would refile once it got enough signatures.</p></div><div class=\"tr-npp-body\"><p>In an email, the group said it had thousands of signatures and was resubmitting the petition to vote on Wednesday. NLRB spokesperson Kayla Blado confirmed that the agency had received the petition and would be reviewing the signatures over the coming days.</p><p>Union organizers asked Amazon to voluntarily recognize the union even without a vote, and said workers were planning a walkout and rally in New York's Times Square to draw attention to the unionization drive.</p><p>Amazon did not respond to a request for comment. It has previously said that workers are better served by working with the company directly. (Amazon founder Jeff Bezos owns The Washington Post.)</p><p>The NLRB filing is the latest step in a broad attempt by labor activists and some Amazon workers to form unions at warehouses, dozens of which dot the country and allow the company to deliver millions of products to homes and businesses in short time frames. The company has become one of the nation's largest employers, often providing one of the few sources of employment in smaller cities and towns that had previously lost manufacturing jobs.</p><p>Amazon has ardently fought any attempts at unionization, most notably last year in Bessemer, Ala., where the national Retail, Wholesale and Department Store Union led an organizing drive that resulted in a unionization vote that drew support from national political figures, including Sens. Bernie Sanders (I-Vt.) and Elizabeth Warren (D-Mass.). The majority of workers voted against the union, but the NLRB ruled in November that there should be a re-vote because Amazon had improperly pressured workers to oppose the union.</p><p>\"Last year's Bessemer experience shows that long drawn-out voting processes are controlled by the bosses who use that period to lie to, intimidate and threaten the workers into voting no for the union,\" Smalls, the New York labor organizer, said in an email. \"The Amazon Labor Union has already signed up thousands of Staten Island Amazon warehouse workers who want a union. Amazon should recognize the union now.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 The Washington Post</p></div>"}