{"date": "2021-11-08 10:04:18+00:00", "ticker": "AAF", "mrkt_info": {"open": 122.5, "close": 131.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The author is a Reuters Breakingviews columnist.  The opinions expressed are his own.</p><p class=\"tr-by\">By Ed Cropley</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">LONDON, Nov 8 (Reuters Breakingviews)</span><span class=\"tr-dl-sep\"> - </span>Africa’s telecoms companies are finally getting their hands on the continent’s big fintech prize. After years of delay, Nigeria’s central bank has given <a href=\"https://www.mtnonline.com/wp-content/uploads/2021/11/MTN-Nigeria-NGX-notification-Momo-PSB-051121.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">MTN</a> <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MTNJ.J\" data-type=\"ric\" data-ric=\"MTNJ.J\" translate=\"no\" dir=\"ltr\">MTNJ.J</a> and <a href=\"https://polaris.brighterir.com/public/airtel_africa/news/rns/story/xoze82w\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Airtel Africa</a> <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAF.L\" data-type=\"ric\" data-ric=\"AAF.L\" translate=\"no\" dir=\"ltr\">AAF.L</a> the green light to offer basic banking via mobile phone. For the regulator, it’s an attempt to keep a grip on technological disruption. For the operators, it’s a potential multibillion-dollar payday.</p><p>Nigerian central bank Governor Godwin Emefiele first published guidelines for mobile money in Africa’s biggest economy in 2018. That approval has taken this long is a testament to the power of the country’s traditional lenders. With their nationwide network of airtime-selling agents, telecoms companies have unrivalled access to Nigeria’s 200 million people, only half of whom have a normal bank account. Most of those would have jumped at the ease and simplicity of mobile money, which lets users send cash balances to friends or businesses via text message. Kenya, which pioneered the system a decade ago, boasts 68 million accounts in a country of 53 million people.</p><p>These figures point to rapid takeup when Airtel Money or MTN’s MoMo get up and running in Nigeria. Using nearby Ghana as a yardstick, MTN can reasonably expect to convert 44% of its 77 million Nigerian voice subscribers into MoMo users. Assuming similar levels of usage and profitability, each Nigerian MoMo customer will generate $9.5 of annual EBITDA, or $320 million overall. JPMorgan analysts value Kenyan operator Safaricom’s <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SCOM.NR\" data-type=\"ric\" data-ric=\"SCOM.NR\" translate=\"no\" dir=\"ltr\">SCOM.NR</a> M-Pesa unit at 18 times EBITDA. On a similar multiple, MoMo’s Nigerian business would have an enterprise value of nearly $6 billion – equivalent to a quarter of its parent company’s total worth.</p><p>That’s probably an overestimate. After all, MoMo won’t achieve those levels of penetration or profitability overnight. But if it gets there in three years, the business is worth nearly $4 billion, assuming a 15% discount rate. The 13% jump in Johannesburg-based MTN’s shares on Friday, which added $2.6 billion to the company’s market value, suggests investors see similar potential.</p><p>There’s upside for Nigerian authorities, too. Onerous foreign-exchange controls and dollar shortages have pushed citizens to circumvent the central bank by using cryptocurrencies for overseas transactions. Many will also be doing so for domestic commerce, sidestepping the taxman. Emefiele’s jitters at the prospect of Nigerians merrily zapping each other money via their phones are understandable. But the alternatives are much worse.</p><p>Follow <a href=\"https://twitter.com/edwardcropley\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@edwardcropley</a> on Twitter</p><p><br/></p><p>CONTEXT NEWS</p><p>- MTN and Airtel Africa on Nov. 5 said Nigeria’s central bank had granted the telecommunication companies “approval in principle” to operate mobile payment services in Africa’s most populous nation.</p><p>- London-listed Airtel Africa said full approval for a financial services licence was subject to the company fulfilling “certain standard conditions” within six months. The central bank made no announcement.</p><p>- Airtel Africa shares closed up 11.9% on Nov. 5. Shares in Johannesburg-listed MTN ended 13% higher.</p><p><br/></p><p> </p><p><br/></p><p class=\"tr-signoff\"> (Editing by Peter Thal Larsen and Karen Kwok)</p><p class=\"tr-contactinfo\">((For previous columns by the author, Reuters customers can click on <a href=\"reuters://REALTIME/verb=Headlines/ric=CROPLEY/\" data-type=\"newsExpression\" data-expression=\"CROPLEY/\" translate=\"no\" dir=\"ltr\">CROPLEY/</a> <br/> SIGN UP FOR BREAKINGVIEWS EMAIL ALERTS <a href=\"https://bit.ly/BVsubscribe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://bit.ly/BVsubscribe</a> | <a href=\"mailto:ed.cropley@thomsonreuters.com\" data-type=\"email\" translate=\"no\">ed.cropley@thomsonreuters.com</a> ; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://ed.cropley.thomsonreuters.com@reuters.net\">ed.cropley.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: MTN GROUP-NIGERIA/BREAKINGVIEWS</p></div>"}