{"date": "2021-12-08 15:41:27.787000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>DAVIDSTEA INC (\"DTEA-Q\")\n- Partners with BetterSleep App to Support the Connection Between\n- Tea and Healthy Sleep\n\n     DAVIDsTEA Inc. a leading tea merchant in North America, is pleased to\nannounce a new partnership with wellness and sleep tracking app BetterSleep\n(formerly Relax Melodies), uniquely designed to help people stress less,\nand sleep better.\n\n     \"DAVIDsTEA has always had great success with sleep and relaxation\nblends and infusions, and the partnership we're announcing with BetterSleep\nhelps to bring this expertise, one step further,\" said Sarah Segal, Chief\nExecutive Officer and Chief Brand Officer, DAVIDsTEA. \"More than ever,\npeople are willing and eager to make simple but meaningful changes to their\ndaily routines to improve their overall well-being. By partnering with\nBetterSleep, we aim to make sleep and wellness more accessible by offering\nour communitea the perfect complement to their self-care routines,\" she\nadded.\n\n     The partnership includes pairing specific wellness focused DAVIDsTEA\nblends with BetterSleep's curated collection of guided meditations,\nsoothing music, playlists, and bedtime stories for adults. For example,\nDAVIDsTEA's Blood Orange Boost, which helps to enhance focus, has been\npaired with BetterSleep's Energized Morning guided meditation. It's the\nperfect combination to practice gratitude and positivity, while the\nfriendly scent of rosemary lifts the spirit and enhances concentration.\nMore expertly curated tea pairings that promote relaxation and help users\nfall into a peaceful slumber can be found on the DAVIDsTEA x BetterSleep\npage.\n\n     To ensure each customers' wellness journey starts on the right foot,\nmembers of DAVIDsTEA's Frequent Steeper(TM) program will receive an\nexclusive offer to try BetterSleep free of charge, for the first 30 days.\nMoreover, all DAVIDsTEA employees and Super Steepers, the VIP tier of the\nbrand's Frequent Steeper(TM) loyalty program, will be treated to a 50%\ndiscount on one-year app memberships.\n\n     \"BetterSleep is happy to embark on this exciting partnership with\nDAVIDsTEA. Health and wellness start with sound sleeping habits, and we\nhope that this partnership will encourage people to create their own\nhealthy routines,\" said Simon Alex Berube, CEO and Co-founder, BetterSleep.\n\n     Follow DAVIDsTEA on Instagram (@davidstea), Facebook (@davidstea), and\non TikTok (@davidstea_official) to enhance your wellness journey.\n\n     About DAVIDsTEA\n\n     DAVIDsTEA offers a specialty branded selection of high-quality\nloose-leaf teas, pre-packaged teas, tea sachets, tea-related accessories\nand gifts through its e-commerce platform at www.davidstea.com, the Amazon\nMarketplace, its wholesale customers which include over 3,300 grocery\nstores and pharmacies, and 18 company-owned stores across Canada. It offers\nprimarily proprietary tea blends that are exclusive to the Company, as well\nas traditional single-origin teas and herbs. The team's passion for and\nknowledge of tea permeates the Company's culture and is rooted in an\nexcitement to explore the taste, health and lifestyle elements of tea. With\na focus on innovative flavours, wellness-driven ingredients and organic\ntea, the Company launches seasonally driven \"collections\" with a mission of\nmaking tea fun and accessible to all. The Company is headquartered in\nMontreal, Canada.\n\n     About BetterSleep\n\n     BetterSleep (formerly Relax Melodies) contains soothing sounds, music,\nmeditations, and bedtime stories. The application has over 55 million\ndownloads and over 700,000 positive user reviews across various app stores\nincluding Apple's App Store, Google Play, and Amazon. It is available in 10\nlanguages, has facilitated over 2 billion meditation sessions, and has been\nfeatured in by The Guardian, CNN, The Today Show, Women's Health, Elle, GQ,\nand many more. BetterSleep combines science-backed techniques, innovative\npersonalization features, and premium sleep content to help people across\nthe world sleep soundly and feel great. BetterSleep is a proud part of the\nTeladoc Health Inc. and BetterHelp family.\n\nFor more information or media requests, please\n\n Contact Information:\n\ncontact:\n\n     Sarah Vincent, Public Relations and Partnerships Specialist, DAVIDsTEA\ns.vincent@davidstea.com\n\n     Maxime-E. Illick, PELICAN PR\nmedia@rppelican.ca\n\nTel   : 888-873-0006    DAVIDSTEA INC\nFax   : 514-739-0200\nWWW   : <a href=\"https://www.davidstea.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.davidstea.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134100788.MNPRE2134102305-07273920211208</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}