{"date": "2021-11-21 21:46:22.549000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Bhopal</p></div><div class=\"tr-npp-lead\"><p>Bhopal, Nov. 21 -- The Madhya Pradesh Police have booked an executive director of e-commerce site Amazon under the Narcotics Drugs and Psychotropic Substances (NDPS) in a drug peddling case, police said.</p><p>The case pertains to the arrest of four people for supplying weed from Visakhapatnam in Andhra Pradesh through a company they registered on Amazon under the guise of selling stevia, a plant-based sweetener. The action against the firm's director was taken two days after state home minister Narottam Mishra asked the company officials to support in the investigation or face action.</p></div><div class=\"tr-npp-body\"><p>\"Bhind police arrested four members of the gang who had registered their company as a seller of stevia leaves but supplied marijuana to selected customers. The accused had supplied at least 1,000kg of marijuana from Visakhapatnam,\" said the SP,\" Bhind superintendent of police Manoj Kumar Singh said.</p><p>The SP said that during the investigation, they found that Amazon director was involved in supporting the accused logistically.</p><p>\"The executive director has been booked on the basis of documents provided by Amazon for allowing a seller to supply marijuana in different parts of the country as stevia leaves, \" Singh said.</p><p>In a statement, an Amazon spokesperson said: \"Amazon operates a marketplace in India, which enables third-party sellers to display, list and offer for sale, products to end-customers directly... We do not allow the listing and sale of products which are prohibited under law to be sold in India. However, in case sellers list such products, as an intermediary, we take strict action as may be required under the law, when the same is highlighted to us. The issue was notified to us and we are currently investigating it.\" Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}