{"date": "2021-12-09 07:15:29.404000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.29, "close": 3483.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 0516VWANdisco Plc09 December 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>09 December 2021</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>WANdisco plc</span>\n</p>\n<p>\n<span>(\"WANdisco\" or the \"Company\")</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Largest Ever multi-year contract win with large global automotive supplier</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Contract valued at $6m over five years</span>\n</p>\n<p>\n<span>Opens new IoT market beyond the Hadoop market</span>\n</p>\n<p>\n<span>Client committed to replicating a minimum of 60PB per month, with potential for expansion</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>\n<a href=\"http://www.wandisco.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">WANdisco</a>\n</span>\n</span>\n<span>(LSE: WAND), the LiveData company, has won an inaugural IoT (Internet of Things) contract with a large European automotive components supplier ('the Client'). The Client has entered into a 'Commit to Consume' contract valued at a minimum of $6m over five years, to replicate over an exabyte of automobile sensor data to the Google cloud.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The Client is deploying WANdisco's LiveData Migrator to support its edge computing platform to replicate sensor data from automotive components in an on-premise data centre to the Google cloud for use in multiple analytics platforms. The Client's objective is to create multiple services in the cloud to be consumed by automotive manufacturers and insurance companies.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>WANdisco's unique technology was the only solution capable of moving the sensor data to the cloud within Google's ecosystem effectively and without disruption. This represents the first contract win in the IoT space, and opens up a new and significant, market opportunity for WANdisco.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>This contract with the customer marks another 'Commit to Consume' contract as described in its half year report and aligns revenue to the consumption of services, as is the standard in the cloud, while enhancing the predictability of future revenues. The Client committed a minimum of $100k of revenue per month for five years. Additionally, the Client expects significant data growth over the life of the contract, representing a potentially large expansion opportunity for WANdisco.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>WANdisco CEO and Chairman David Richards, commented:</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\"This contract win marks a significant moment for WANdisco and represents what is believed to be the largest ever data movement to cloud. It is the largest to date 'Commit to Consume' contract that we have signed and illustrates how we are aligning our business to the consumption models of our cloud and analytics partners. Our 'Commit to Consume' model will also offer the business improved revenue predictability, and easier upsell potential. Additionally, this is the first IoT use case served by our LiveData Migration solution opening up another significant market opportunity outside of the Hadoop market.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The use case of moving sensor data to the cloud and the Client creating its own cloud service is a prime example of how customers can use WANdisco's technology on an ongoing basis, with the potential to expand and increase the amount of data being consumed over time.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>For further information, please contact:</span>\n</p>\n<p>\n<span>\n</span></p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>WANdisco plc</span>\n</p>\n</td>\n<td>\n<p>\n<span>via FTI Consulting</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>David Richards, Chief Executive Officer and Chairman</span>\n</p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Erik Miller, Chief Financial Officer</span>\n</p>\n<p>\n<span>Daud Khan, VP Corporate Development</span>\n</p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>FTI Consulting</span>\n</p>\n</td>\n<td>\n<p>\n<span>+44 (0)20 3727 1137</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Matt Dixon / Kwaku Aning / Tom Blundell</span>\n<span>\n\n</span>\n</p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\n<span>Stifel</span>\n</span>\n<span>(Nomad and Joint Broker)</span>\n</p>\n</td>\n<td>\n<p>\n<span>\n<span>+44 (0)20 7</span>\n</span>\n<span>\n<span>710 7600</span>\n</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Fred Walsh / Richard Short</span>\n</p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\n<span>Panmure Gordon</span>\n</span>\n<span>(Joint Broker)</span>\n</p>\n<p>\n<span>Erik Anderson / Alina Vaskina</span>\n</p>\n</td>\n<td>\n<p>\n<span>+44 (0)20 7886 2500</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>This announcement contains inside information as defined in Article 7 of the Market Abuse Regulation No. 596/2014 (\" <span>MAR</span> \") as retained as part of UK law by virtue of the European Union (Withdrawal) Act 2018 as amended. Market Soundings, as defined in MAR, were taken in respect of the proposed Placing with the result that certain persons became aware of this inside information, as permitted by MAR. Upon the publication of this announcement, this inside information is now considered to be in the public domain. The person responsible for arranging for the release of this announcement on behalf of WANdisco is David Richards, Chief Executive Officer and Chairman of WANdisco.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>About WANdisco</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>WANdisco is the LiveData company. WANdisco solutions enable enterprises to create an environment where data is always available, accurate and protected, creating a strong backbone for their IT infrastructure and a bedrock for running consistent, accurate machine learning applications. With zero downtime and zero data loss, WANdisco's products keep geographically dispersed data at any scale consistent between on-premises and cloud environments allowing businesses to operate seamlessly in a hybrid or multi-cloud environment. WANdisco has over a hundred customers and significant go-to-market partnerships with Microsoft Azure, Amazon Web Services, Google Cloud, Oracle, and others as well as OEM relationships with IBM and Alibaba. For more information on WANdisco, visit</span>\n<span>\n<span>\n<a href=\"http://www.wandisco.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.wandisco.com</a>\n</span>\n</span>\n<span>\n<span>www.wandisco.com</span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>CNTDKFBBDBDBFBK</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}