{"date": "2021-11-23 05:20:26.441000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Apple makes some of the most instantly recognizable headphones on the market. Though you see them in the ears of every other person on the street, on the subway or at the gym, they can be hard to find at affordable prices. Fortunately, some of the many deals on display for Black Friday are for Apple AirPods.</p></div><div class=\"tr-npp-body\"><p><span><span>Tackle your holiday shopping with deals and expert advice delivered straight to your phone.</span> Sign up for text message alerts from the deal-hunting team at Reviewed.</span> </p><p>Amazon (and its deals site Woot!) currently has the best deals on Apple's powerful wireless headphones for the holiday shopping event. Whether you need something so compact it can fit in your pocket or something to cover your ears for a deeper listening experience, you save up to $109 this week at the online shopping giant. </p><p>For instance, you can get the latest model of the Apple AirPods Pro earbuds for $169.99. Normally listed for $249, these updated wireless headphones are now 32% off and come with MagSafe, which means you can hold it near a MagSafe charger and it will snap firmly into place and start charging. We named the older model of the AirPods Pro one of the best headphones we've ever tried thanks to the customizable fit of the buds and active noise cancellation that dampened environmental noise. </p><p>That's just one of the best deals we found on Apple's popular headphones. Check out more ways you can save on Apple AirPods today.</p><p class=\"tr-npp-section-title\">The best Black Friday deals on AirPods, AirPods Pro and AirPods Max</p><ul class=\"bulleted-list arrowlist\"><li><span>Apple AirPods (2nd Generation) with Wired Charging Case at Amazon for $114.99 (Save $44.01)</span> </li><li><span>Apple AirPods with Wireless Charging Case at Woot! for $132.99 (Save $67)</span> </li><li><span>Apple AirPods (3rd Generation) for $154.99 at Amazon (Save $24.01)</span> </li><li><span>New Apple AirPods Pro with MagSafe at Amazon for $169.99 (Save $79.01)</span> </li><li><span>Apple AirPods Max at Amazon from $439.99 (Save $70 to $109.01)</span> </li> </ul><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Save big during these Black Friday deals on AirPods from Amazon and more</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}