{"date": "2021-11-18 16:10:50.952000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3549.0, "close": 3676.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NEXTECH AR SOLUTIONS CORP (\"NTAR-Z;NEXCF-0\")\n- Launches Major 3D Metaverse Upgrade To Its Events Platform\n\n    Nextech AR Solutions Corp. (\"Nextech\" or the \"Company\"), a Metaverse\nCompany and leading provider of augmented reality (\"AR\") experience\ntechnologies and services is pleased to announce the integration of\nNextech's redesigned virtual events platform, now rebranded as \"ARitize\nEvents 3D\". With this integration, immersive virtual events are now\navailable as part of its growing suite of metaverse solutions. \"ARitize\nEvents 3D\" is now able to showcase 3D products seamlessly with its existing\nsuite of Augmented Reality solutions, creating a first of its kind\nmetaverse event platform.\n\n    The company sees a variety of different uses for its new Metaverse\nevents offering including education, auctions, ecommerce, new product\nlaunches, training and more.\n\n    Click here to see a video preview of ARitize Events 3D\n\n    With the major 3D Metaverse upgrade to its events platform the company\nexpects to generate positive revenue growth for its technology services\nbusiness in 2022 and beyond. To date, Nextech's events platform has hosted\nevents with notable brands such as, Johnson and Johnson, Amazon, Broad,\nHarvard, MIT, UNESCO, Restaurants Canada, TedX, Enterprise Florida,\nCarnegie Mellon, Bell Mobility / Virgin Mobile, Royal College of Physician\nand Surgeons, and many more.\n\n    The upgraded features on \"ARitize Events 3D\" bring 3D objects into the\nevents space and peoples homes, creating interactivity between the audience\nand the presenters which is not available on other platforms. The\nintegrated experience consists of two main components: 3D Virtual Sets and\n3D AR Showrooms:\n\n    3D VIRTUAL SETS\n\n//st\n\n* Brandable\n* Human Presenter on 3D Virtual Stage\n* Incorporate Presentation Slides\n* Incorporate Augmented Reality Objects as Overlay\n* Include QR Codes for Immersive AR Experience\n\n//et\n\n  3D AR SHOWROOMS\n\n//st\n\n* Feature within Vendor Booths\n* Allows for the presentation and interaction of products\n* Nextech can create 3D AR content for the vendors\n* Each vendor can have their own \"showroom\", showcasing numerous 3D AR\n  products\n* Incorporate QR Code so the user can launch the experience in their own\n  space\n* Incorporates WebAR, so the user can spin, rotate, and zoom in on the\n  product using their computer\n* Can link to further information about each individual product (website,\n  purchase option, etc).\n\n//et\n\n    As a result of successfully integrating their suite of products, the\nCompany is able to expand ARitize Events 3D into the metaverse, positioning\nit to become a premier service provider for the fast growing virtual/hybrid\nevents industry.\n\n    Recently, Nextech announced its plans to launch its SaaS Metaverse\nStudio SDK - integrating Nextech's entire suite of augmented reality\nsolutions and enabling its customers to create their own metaverses. With\ntoday's news of \"ARitize Events 3D\", Nextech continues to showcase the\nsuccessful integration of its technology and products, with a clear vision\nof creating and populating the Metaverse.\n\n    To learn more, please follow us on Twitter, YouTube, Instagram,\nLinkedIn, and Facebook, or visit our website: <a href=\"https://www.Nextechar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.Nextechar.com</a>.\n\n    About Nextech AR\n\n    Nextech AR Solutions is a Metaverse company that develops and operates\naugmented reality (\"AR\") platforms, transporting three-dimensional (\"3D\")\nproduct visualizations, human holograms and 360 portals to its audiences\naltering e-commerce, digital advertising, hybrid virtual events (events\nheld in a digital format blended with in-person attendance) and learning\nand training experiences.\n\n    Nextech focuses on developing AR solutions for the Metaverse, however\nmost of the Company's revenues are derived from three e-Commerce platforms:\nvacuumcleanermarket.com (\"VCM\"), infinitepetlife.com (\"IPL\") and\nTrulyfesupplements.com (\"TruLyfe\"). VCM and product sales of residential\nvacuums, supplies and parts, and small home appliances sold on Amazon.\n\n    Forward-looking Statements\n\n    The CSE and the NEO have not reviewed and do not accept responsibility\nfor the adequacy or accuracy of this release.\n\n    Certain information contained herein may constitute \"forward-looking\ninformation\" under Canadian securities legislation. Generally,\nforward-looking information can be identified by the use of forward-looking\nterminology such as, \"will be\" or variations of such words and phrases or\nstatements that certain actions, events or results \"will\" occur.\nForward-looking statements in this release include statements regarding the\nprospective nature of the metaverse and \"mini-metaverse\" and the Company's\npotential leadership position in the market are subject to known and\nunknown risks, uncertainties and other factors. These factors include risks\nassociated with the development of the operations of the Company as the\nCompany's plans are refined, the development of a market and successful\napplications for the metaverse and \"mini-metaverse\", availability of\nfinancing and other risk factors identified in the Company's public\ndisclosure documents from time to time. There can be no assurance that such\nstatements will prove to be accurate, as future events could differ\nmaterially from those anticipated in such statements. Accordingly, readers\nshould not place undue reliance on forward-looking statements and\nforward-looking information. Nextech will not update any forward-looking\nstatements or forward-looking information that are incorporated by\nreference herein, except as required by applicable securities laws.\n\n     Contact Information:\n\n     Nextech AR Solutions Corp.\n     Contact: Lindsay Betts\n     investor.relations@nextechar.com\n     866-ARITIZE (274-8493) Ext 7201\n\n                            ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132100233.MNPRE2132101814-06385920211118</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}