{"date": "2022-02-03 22:00:00.086000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3012.25, "close": 3152.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p align=\"left\">ATLANTA, Feb.  03, 2022  (GLOBE NEWSWIRE) -- <a href=\"https://www.globenewswire.com/Tracker?data=xz24qwX8izNUv_PUmYnOIxoCEtKdmgehn0NO8NLs2Lybtg3qWCd3hesBoSM-bE57WWohDYNPfMcEh_pQIDn2_A==\"><u>Lemongrass</u></a>, the “SAP in the Cloud” company, has commenced a multi-year strategic agreement with <a href=\"https://www.globenewswire.com/Tracker?data=xnPwMATE_xvXOOZr_8BmTCe9OXw87lt6I4WuiGHzlpgzoErITwxIt-34Qwgxswt7YQL08Fuxt9TEa_VC73_sWOhddiLORLM295jfnaOIxDU=\"><u>Sarawak Energy</u></a> to help migrate and run its SAP systems on Amazon Web Services (AWS). The project, which is being led by Lemongrass’s SAP-on-AWS professional and managed services experts in Asia-Pacific, aligns with Sarawak Energy’s aim to improve its digitalization infrastructure to give Sarawakians a more modern electricity system.<br/></p><p>Sarawak Energy’s goal is to achieve sustainable growth and prosperity by meeting the need for reliable and renewable energy for the Malaysian state of Sarawak. Sarawak Energy provides electricity to over three million people and serves a customer base of over 700,000 companies in the domestic, commercial, industrial and export space.</p><p>Digitalization of key business systems contributes to this goal by enabling the company to drive excellence in its operations, advance its sustainable growth agenda and deliver value to all its stakeholders and customers.</p><p>As part of this process, Sarawak Energy has begun a journey to transition its existing SAP S/4HANA to AWS. A consolidation between the larger and more critical SAP ERP Central Component 6.0 system with the existing S\\4HANA will start next year.</p><p>The move will provide Sarawak Energy a more secure, stable, flexible, and cost-effective environment for its SAP assets. Following a thorough search and evaluation of various value-added service providers, the company is made the decision to partner with Lemongrass to migrate and manage its core system.</p><p>“Sarawak Energy aspires to become a sustainable digital utility by 2025, as part of our Sarawak Energy Excellence 2022 roadmap. We continue to learn and adopt new technologies to maintain our relevance and grow value, leveraging digital technologies to stay competitive in this age of rapid change. This also requires us to establish purposeful collaboration with partners who have the required expertise and tools. We are happy to have Lemongrass onboard to help support our digitalization journey,” said Sim Ko Sin, Senior Vice President (ICT), at Sarawak Energy.</p><p>Lemongrass is well-known as a leader in the planning, migration, operation and automation of SAP in the cloud. Its Lemongrass Cloud Platform and Managed Services provide clients with near-zero downtime migrations and operations for SAP and its related workloads. The company has been migrating SAP users to the cloud since 2010 and currently has 6,000+ SAP servers and 300,000+ users under management.</p><p>“We couldn’t be more excited about the opportunity to engage with Sarawak Energy as it continues its digital transformation,” said Jason Nicholl, Executive Vice President of Asia-Pacific at Lemongrass. “Our work together will result in a highly secure, stable and flexible SAP environment on AWS with enhanced levels of automation. Malaysia remains an important market for Lemongrass and we look forward to a long partnership with Sarawak Energy locally, regionally and globally.”</p><p><strong>About Lemongrass</strong><br/>Lemongrass is a software-enabled services provider, synonymous with SAP on Cloud, focused on delivering superior, highly automated Managed Services to Enterprise customers. With a unique combination of experience, expertise and best practices designed to deliver the desired outcomes from an SAP transformation, Lemongrass engineers strategies and services that enable the economics, scale and agility of hyperscale computing while unlocking business innovation and controlling the risks and uncertainties. Lemongrass Cloud Platform (LCP) enables near zero downtime migrations to Cloud and differentiated Managed Services for SAP and its related workloads. Our customers span multiple verticals and geographies across the Americas, EMEA and APAC and we partner with SAP, AWS, Microsoft, Google and other global technology leaders. More info at <a href=\"https://www.globenewswire.com/Tracker?data=jcjPl65Tqp7fN5E_CO3XnRX1GFYLumKhLNBnTdmu-f9rMTogtt-FnSFAO_QdU6gHOLXqp-tAD8SaQH4I4xYvuDY7tL8-d2RZhsCiVHbdK8Q=\"><u>www.lemongrasscloud.com</u></a>.</p><p>Media contact:<br/>Kevin Wolf<br/>Owner - TGPR<br/><a href=\"https://www.globenewswire.com/Tracker?data=ZXbdC-u2Jks_2Pn3K_AZoKG-Q57dlglMIdNjj408KcbpeGsEXee3DUQUHPssY4w3imORxmcQz46J31cpkZDmZA==\"><u>Kevin@tgprllc.com</u></a></p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODQ2NzYyNCM0NzA1OTU1IzIyMDIxMTY=\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RRMk56WXlOQ00wTnpBMU9UVTFJekl5TURJeE1UWT0=&amp;key=b834e726725d81bec355fae2f9f8218836168d73261ddcf283046fd53897f715ca93f818233878c31da281d76b65563e140adbea81e6db9e80e9fa96a79d464d\"/></div></div><br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/NjA2MTFhZjItMWVjYy00NTNiLTlmZjUtMDQ0YzZmZmM3NTM2LTEyMTM2Njk=/tiny/Lemongrass.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9OakEyTVRGaFpqSXRNV1ZqWXkwME5UTmlMVGxtWmpVdE1EUTBZelptWm1NM05UTTJMVEV5TVRNMk5qaz0vdGlueS9MZW1vbmdyYXNzLnBuZw==&amp;key=ce1513e1a7ba596d954acb88c7b573c9898e1ac3a763c17401f3e01913a29215df983c416f0f2dd6942adacb1276ca3adc4c0525f54d99f86591123aea7c85fb\"/></div></div><p><a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/0cbbd73b-29bd-48ff-a511-2e674c9abd98\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Primary Logo\" border=\"0\" src=\"https://ml.globenewswire.com/media/0cbbd73b-29bd-48ff-a511-2e674c9abd98/small/lemongrass-logo-jpg.jpg\" style=\"max-height:31px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS8wY2JiZDczYi0yOWJkLTQ4ZmYtYTUxMS0yZTY3NGM5YWJkOTgvc21hbGwvbGVtb25ncmFzcy1sb2dvLWpwZy5qcGc=&amp;key=b48e34a713c2bb2bfa97afe3b13e3522fd0e94ebda32962dae3f4103be9d831c897c2800bcf77666029d4133457244ee90f2944ea630f84ffe044f7c66aa354d\"/></div></div></a></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">GlobeNewswire, Inc. 2022</p></div>"}