{"date": "2022-02-15 16:10:46+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>WAVEDANCER INC (\"WAVD-Q\")\n- Blockchain approved for use on Amazon Web Services (AWS)\n- Marketplace for GovCloud\n\n     WaveDancer, a transformational leading-edge technology company,\nannounced today that its groundbreaking supply chain management blockchain\nplatform is being offered on Amazon Web Services (AWS) Marketplace for\nGovCloud to support secure supply chain requirements for critical\ngovernment missions. Fueled by Amazon Web Services, WaveDancer's blockchain\nis a new technology engine for cloud services. WaveDancer first developed\nits blockchain as part of advanced research and development in support of a\nglobal national security-focused organization. The ground-breaking\ntechnology that was developed is now being made available to the entirety\nof the United States Government.\n\n     This move releases the power of an operational blockchain on the AWS\nGovCloud for all U.S. Government agencies. WaveDancer's mission critical\ntechnology provides the capabilities our government partners need -\nmanaging \"big data\" and sensitive information while using blockchain to\nprovide visibility and discern access and controls for complex global\noperations. The deployment to GovCloud this month is the first of many\nsteps WaveDancer will implement to continue to integrate cutting edge\nsolutions for the United States Government.\n\n     Jamie Benoit, CEO of WaveDancer said, \"I'm ecstatic that just 60 days\nafter partnering with Gray Matters, we are able to announce our blockchain\nenabled technology has made it through the rigorous AWS process and will\nnow be available in the AWS GovCloud Marketplace. As part of our larger\ntransformation, this move will enable government customers in need of\ncloud-based blockchain solutions to reach WaveDancer's unique capabilities\nand will enhance the ability of our government partners to better solve\ncomplex global supply chain and logistics problems.\"\n\n     Jeff Gerald, WaveDancer's chief blockchain developer said, \"Our unique\ncombination of blockchain, Artificial Intelligence (AI) and Internet of\nThings (IoT) capabilities provides the U.S. Government with a scalable,\nsecure and solution-driven offering for worldwide, complex supply chain\nchallenges. We know many government organizations face similar problems and\nthis launch underscores our total commitment to enabling the entire US\nGovernment.\"\n\n     WaveDancer's blockchain will soon be made available in the AWS\nGovCloud Marketplace portal.\n\n     About WaveDancer\n\n     WaveDancer (www.wavedancer.com), headquartered in Fairfax, Virginia,\nis a provider of zero trust software solutions, specializing in secure\nsupply chain management, asset tracking and security. Our software\nsolutions are in production in support of the complex global missions of US\nGovernment customers.\n     Additional information for investors\n\n     This release may contain forward-looking statements regarding the\nCompany's business, customer prospects, or other factors that may affect\nfuture earnings or financial results. Such statements involve risks and\nuncertainties which could cause actual results to vary materially from\nthose expressed in the forward-looking statements. Investors should read\nand understand the risk factors detailed in the Company's 10-K for the\nfiscal year ended December 31, 2020 and in other filings with the\nSecurities and Exchange Commission.\n\n     For additional information\n\ncontact:\n\n     Jeremy Hellman, CFA\nVice President\nThe Equity Group Inc.\njhellman@equityny.com\n(212) 836-9626\n\nTel   : 703-383-3000    INFORMATION ANALYSIS INC\nFax   : 703-293-7979\nEmail : sales@infoa.com\nWWW   : <a href=\"https://www.infoa.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.infoa.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204500512.MNPRE2204502399-07492920220215</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}