{"date": "2022-02-08 12:00:01.582000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p align=\"center\"><span>Cellebrite’s industry-leading Digital Intelligence Platform continues to provide flexible options for law enforcement agencies to efficiently collect and review, analyze, manage, and share digital evidence to accelerate justice</span><br/></p><p align=\"center\"><span>Additional AWS data center deployments are planned for Canada, Singapore, and Australia </span><br/></p><p>PETAH TIKVA, Israel and TYSONS CORNER, Va., Feb.  08, 2022  (GLOBE NEWSWIRE) -- Cellebrite (Nasdaq: CLBT), a global leader in Digital Intelligence (DI) solutions for the public and private sectors, today announced that Cellebrite Guardian (Guardian), a cloud-based investigative digital evidence management solution designed specifically for investigators, examiners, and attorneys, is now available in the United Kingdom via Amazon Web Services (AWS). Guardian is part of Cellebrite’s industry-leading DI Platform that offers customers an end-to-end investigative platform covering data collection, review, analysis, and management, supporting the widest variety of digital evidence from the crime scene to the court. <br/><br/>In addition to the United States and United Kingdom, Cellebrite also disclosed plans to deploy Guardian in AWS Data Centers in Canada, Singapore, and Australia before the end of 2022. The local data center deployments, including today’s roll out in the UK, are expected to better serve local law enforcement agencies and help them maintain data sovereignty in the region. By deploying Cellebrite Guardian to manage, store, share, and review evidence, law enforcement agencies in the United Kingdom are expected to process evidence four times faster than the present rate, according to Cellebrite’s estimates.</p><p align=\"left\">Ronnen Armon, Chief Product and Technology Officer at Cellebrite, commented: “Through this expansion, Cellebrite is addressing the growing global demand for Investigative Digital Evidence Management Systems (IDEMS) that allow law enforcement agencies to efficiently manage a rapidly increasing volume of evidence within their investigations. We intend to continue to build our leading position in the IDEMS market by bringing our cloud-based solutions to data centers across the world in 2022.”</p><p>For more information on Cellebrite Guardian, please visit <a href=\"https://www.globenewswire.com/Tracker?data=4l57QwG3iBhEm_FRdgb1kItvhrLZ_RHaJRzTY9BMYNHyUyw_5DeDE9uRLkyD_7hTqa-jwloXEa5GYrEb54Q2nM7DmMJqVAgFgFAai6EuqKs=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a>.</p><p><strong>About Cellebrite</strong><br/>Cellebrite’s (Nasdaq: CLBT) mission is to enable its customers to protect and save lives, accelerate justice, and preserve privacy in communities around the world. We are a global leader in Digital Intelligence solutions for the public and private sectors, empowering organizations in mastering the complexities of legally sanctioned digital investigations by streamlining intelligence processes. Trusted by thousands of leading agencies and companies worldwide, Cellebrite’s Digital Intelligence platform and solutions transform how customers collect, review, analyze and manage data in legally sanctioned investigations. <br/><br/>To learn more visit us at <a href=\"https://www.globenewswire.com/Tracker?data=AzSV-SMl94SqGG_rTDnaN9HlsqiEUU1pTk7PFG9HaLqaG675hdGM_KSo0K5zdpMxWjkDxpfC-j8n-0VHnUQh0UXAvNlkHxl6I-ke67CIXrU=\"><strong>www.cellebrite.com</strong></a> and <a href=\"https://www.globenewswire.com/Tracker?data=bE39KzxDI1hFtuiz8EA5x_V4Ad5kszr0CPMA9B0iWQTEz8mIBP9WY5YYpdpRsnpOVFxYdey3DvtHWZsLn8-USYEYCmoGD84sYt4LH92_cg8HcyUvb2rJzGsT0ZIdSJ7j\"><strong>https://investors.cellebrite.com</strong></a>.<br/></p><p><strong>Caution Regarding Forward Looking Statements</strong></p><p>This document includes “forward looking statements” within the meaning of the “safe harbor” provisions of the United States Private Securities Litigation Reform Act of 1995. Forward-looking statements may be identified by the use of words such as “forecast,” “intend,” “seek,” “target,” “anticipate,” “believe,” “could,” “continue,” “expect,” “estimate,” “may,” “plan,” “outlook,” “future” and “project” and other similar expressions that predict, project or indicate future events or trends or that are not statements of historical matters. Such forward looking statements include estimated financial information. Such forward looking statements with respect to revenues, earnings, performance, strategies, prospects, and other aspects of the business of Cellebrite are based on current expectations that are subject to risks and uncertainties. A number of factors could cause actual results or outcomes to differ materially from those indicated by such forward looking statements. These factors include, but are not limited to: Cellebrite’s ability to develop technologically advanced solutions and successfully integrate with the software solutions used by customers; acceptance of solutions by customers; errors, failures, defects or bugs in solutions; a failure to maintain sales and marketing personnel productivity or hire, integrate and retain additional sales and marketing personnel; the impact of the global COVID-19 pandemic; the impact of competition on pricing and on Cellebrite’s market share; sub-optimal results from products due to misuse by customers; Cellebrite’s failure to maintain and enhance its reputation and brand; inaccuracy of the estimates of Cellebrite’s market opportunity and forecasts of market growth; changes to packaging and licensing models that adversely affect the ability to attract or retain customers; failure to manage future growth effectively; failure to introduce new solutions and add-ons; issues in the use of artificial intelligence resulting in reputational harm or liability; the need for additional capital to support the growth of Cellebrite’s business; a failure to maintain the security of operations and the integrity of software solutions; the impact of government budgeting cycles and appropriations, early termination, audits, investigations, sanctions and penalties; a decline in government budgets, changes in spending or budgetary priorities, or delays in contract awards; a failure to adequately obtain, maintain, protect and enforce Cellebrite’s intellectual property or infringement of the intellectual property rights of others; perceptions or court or regulatory decisions that Cellebrite’s solutions violate privacy rights; the use of solutions by customers in a way that is, or that is perceived to be, incompatible with human rights; failure to comply with laws regarding privacy, data protection and security, technology protection, sanctions, export controls and other matters; and other factors, risks and uncertainties set forth in the sections titled “Risk Factors” and “Cautionary Note Regarding Forward-Looking Statements” in the final proxy statement/prospectus relating to Cellebrite’s consummated business combination filed with the SEC on August 5, 2021 and in other documents filed by Cellebrite with the SEC, which are available free of charge at <a href=\"https://www.globenewswire.com/Tracker?data=bPvs5h7WY6WtHriPYegyKC1i2i-xLWH7DtMGX9ZAywjChDoLCORo76Ktv5FytfXEjcLk7cR4pVcJkWT8fVw-FQ==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.sec.gov</a>. You are cautioned not to place undue reliance upon any forward-looking statements, which speak only as of the date made, in this communication or elsewhere. Cellebrite undertakes no obligation to update its forward-looking statements, whether as a result of new information, future developments or otherwise, should circumstances change, except as otherwise required by securities and other applicable laws.</p><p><strong>Media</strong><br/>Adam Jaffe<br/>VP of Global Communications<br/>+1 973 206 7643<br/><a href=\"https://www.globenewswire.com/Tracker?data=9ZmBhdFYaE-B9Pz9UMVupWSH57KLb-B8CoXnLUPA3KnykZh9ryRrWLN2B1mrn3ZDyR76oewcWsDg3S-NN9pbYV-ydc3DcPuXlwAxmZpdJ_0fEIK7RSU6Twg7IIdj5oTo\" data-type=\"url\" class=\"tr-link\" translate=\"no\">adam.jaffe@cellebrite.com </a>– or –<br/><a href=\"https://www.globenewswire.com/Tracker?data=m3e6-eXHLUXDYcNucQFFOKSD_jN74zMWCznzS8xncT4au4fg1P6VdpbpPcDxtKVQ8yO1C-iWAo0RAQqhxhSk4_0lcgakhJTn_57jNMpnf0aeN5GX3lVe73TJt_leJySN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">RapidResponse@cellebrite.com</a></p><p><strong>Investors</strong><br/>Anat Earon-Heilborn<br/>VP Investor Relations<br/>+972 73 394 8440<br/><a href=\"https://www.globenewswire.com/Tracker?data=Swv5zTZdrZqISXr7UXGCP8wuVKLdYK-9aPnAUNiAcxRseH3N931xCbhlw_G3jlwhvC2on4ZRAprSHa0fX4pfMwU71i_JqEPCsKYopS3JRV8=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">investors@cellebrite.com</a></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODQ3MDgzMiM0NzE1MzE0IzIwMTc4OTc=\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RRM01EZ3pNaU0wTnpFMU16RTBJekl3TVRjNE9UYz0=&amp;key=d7c98b642c663a9a2267851af89d25fbaac3069153aa8d622303e33f1b6a4a6c6566ddbdccc4237e17269af449ebc6ba8e4f457c6757639cd60381b71a23f3c3\"/></div></div><br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/MTg0ZWRmOTAtOWZkZS00NDk4LWIyNmQtYWI5NjY0OTEyNzUzLTEwMjk0Njg=/tiny/Cellebrite-DI-Ltd.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9NVGcwWldSbU9UQXRPV1prWlMwME5EazRMV0l5Tm1RdFlXSTVOalkwT1RFeU56VXpMVEV3TWprME5qZz0vdGlueS9DZWxsZWJyaXRlLURJLUx0ZC5wbmc=&amp;key=c76d93222be3c5922ba9359b18dd3c2fe7d684dd4b757692a2105b93e19fb8a17e3e12f8e55d4e0107d2bdf7e8de92e2cb995afcf5eab940afa1ac7a9d6906e4\"/></div></div><p><a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/4286afa1-55a1-4d14-b6a4-f48b320d9b0a\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Primary Logo\" border=\"0\" src=\"https://ml.globenewswire.com/media/4286afa1-55a1-4d14-b6a4-f48b320d9b0a/small/notag-2x-2-png.png\" style=\"max-height:37px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS80Mjg2YWZhMS01NWExLTRkMTQtYjZhNC1mNDhiMzIwZDliMGEvc21hbGwvbm90YWctMngtMi1wbmcucG5n&amp;key=d233f5bf25314e34b34c47436dc03d3ff2520f8035f461097251b1b26c76d11e62f8cd3184d20d7ae84a6a7ece004e92fc94924ff725115ee4b6ab2d556f07ec\"/></div></div></a></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">GlobeNewswire, Inc. 2022</p></div>"}