{"date": "2022-01-13 13:53:01.750000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3307.24, "close": 3224.28}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">INWOOD, N.Y., Jan. 13, 2022</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">INWOOD, N.Y.</span>, <span class=\"xn-chron\">Jan. 13, 2022</span> /PRNewswire/ -- Amazon revenue over the past several years<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3412356-1&amp;h=160608282&amp;u=https%3A%2F%2Fwww.macrotrends.net%2Fstocks%2Fcharts%2FAMZN%2Famazon%2Frevenue&amp;a=%C2%A0has+grown+in+the+30%25+range+year-over-year\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> has grown in the 30% range year-over-year</a>. Winning products on Amazon can be immensely profitable. In particular, many private brands with custom \"Designed for Amazon\" products have been tremendously successful. Over <span class=\"xn-money\">ten billion dollars</span> of debt and equity has been allocated worldwide to over one hundred Amazon brand acquisition firms like <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3412356-1&amp;h=2460536445&amp;u=https%3A%2F%2Fwww.crunchbase.com%2Forganization%2Fthrasio%2Finvestor_financials&amp;a=Thrasio%E2%84%A2\">Thrasio<span>™</span></a> to acquire private, \"Amazon-centric\" brands and products.</p>\n\n<p><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3412356-1&amp;h=2827957703&amp;u=http%3A%2F%2Fwww.albertscott.com%2F&amp;a=Albert+Scott\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Albert Scott</a> is an eCommerce Management company that helps brands market and grow on Amazon.com. We have assembled a rich solution of custom software, business models and professional talent to enable our clients to become market leaders. These capabilities are instrumental in their rapid growth on Amazon.com. </p>\n<p>As a part of the Albert Scott mission, we help brands innovate winning products with our \"Designed for Amazon<span>™</span>\" service. Our sophisticated service identifies and helps the brand create products that will succeed on Amazon. Here is how the \"Designed for Amazon\" service works: </p>\n<p><b>Product Identification</b>: To identify \"homerun Amazon products\" we use a proprietary set of research tools that analyze \"big data\" available from the Amazon platform. We study the nuances of Amazon searches for features that Amazon buyers want. We study price points, how much marketing is being invested and at what cost, what are the reviews saying, who are the competitors, etc. Ultimately, we can \"hone in\" on the detailed specs for a winning product and features that we are confident will succeed.</p>\n<p><b>Complete Product Definition</b>: Albert Scott professionals then define what the actual product should be. Using the results specs and features from the Product Identification, we define the product packaging with consideration for shipping cost limitations, product attractiveness, product durability, expected manufacturing or landed costs, etc. With this information, we can pinpoint the \"cost of goods\" and profit.</p>\n<p><b>Marketing Projection</b>: We understand that a new product will need marketing investment. We create the financial model for an array of on-Amazon and off-Amazon marketing programs that will promote the new product. Our models are built on measured experience. With these projections, we can tell the brand when we expect profitability and what that profit will be.</p>\n<p><b>Manufacturing/Sourcing</b>: If the brand wishes, Albert Scott will work with them to create and test a product with the features and cost determined by our research.</p>\n<p><b>Listing Creation</b>: Albert Scott has spun-off a company, ListingBaby.com, focused on very high-quality listing development. We make sure the product listing that is created amplifies the nuances of or product which make it unique. Creative videos for Video in Search (\"VIS\") are often developed to accelerate sales.</p>\n<p><b>Sales Testing</b>: Albert Scott tests product sales by an actual marketing effort. We sell the product on Amazon, and with a small marketing budget. We compare marketing costs by analyzing the ACOS (Average Cost of Sale) of different marketing channels. We watch reviews, feedback and customer returns issues to see what needs to be changed or improved in the product.</p>\n<p><b>Go To Market</b>: We now have created a winning new product <span>empirically</span> - based on real data, market testing and real customer experience. </p>\n<p>Our unique Designed for Amazon service can be used by existing brands or by investors to build new, winning brands. The possibilities for product innovation are endless. These Designed for Amazon products later become winning products in the brick-and-mortar channel!</p>\n<p><b>About Albert Scott, LLC<br/></b>Albert Scott, LLC, represents many of the world's leading brands on Amazon.com. Through its highly-developed infrastructure, Albert Scott provides listing, marketing, and retail services for brands. All the Albert Scott services are provided by a team of experienced Amazon professionals.</p>\n<p>Media Contact:<br/>Yoni Lebovits <br/><a href=\"mailto:327535@email4pr.com\" data-type=\"email\" translate=\"no\">327535@email4pr.com</a>  <br/>347-388-9725</p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n</div>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=PH30441&amp;sd=2022-01-13\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1QSDMwNDQxJnNkPTIwMjItMDEtMTM=&amp;key=85ac67dd33eb030f73cc64dacb458e21abfd7f90d5077df44b3fd86c1c63c971e14d1b4025a76cefa7663fe32e6de931ea378ca0ea68ac89c825280fae556fd8\"/></div></div> View original content to download multimedia:<a href=\"https://www.prnewswire.com/news-releases/albert-scott-innovates-winning-products-with-its-designed-for-amazon-service-301460418.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/albert-scott-innovates-winning-products-with-its-designed-for-amazon-service-301460418.html</a><p></p>\n<p>SOURCE  Albert Scott, LLC</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: ALBERT-SCOTT-Service</p></div>"}