{"date": "2021-12-10 19:42:19.801000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3483.42, "close": 3391.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>CINEDIGM CORP (\"CIDM-Q\")\n- Renews Prime Video Agreement For Five of the Company's\n- Streaming Channels\n\n     Cinedigm announced that the Company has renewed its agreement with\nPrime Video Channels for five of its most popular streaming channels. This\nincludes go-to indie platform Fandor, popular horror service Screambox, the\nfamily-friendly destination Dove Channel, fanboy-centric CONtv and the\ndocumentary-focused Docurama.\n\n     *  Fandor: with a library of more than 1,000 hours of film and\ntelevision series, Fandor features some of the best independent cinema from\naround the world. Recent additions include the ensemble comedy Distancing\nSocially, starring Alan Tudyk (Resident Alien) and Sarah Levy (Schitt's\nCreek) and Our Father, the acclaimed 2021 SXSW Grand Jury Award nominee.\n     *  Screambox: with a broad mix of content for casual and die-hard\nhorror fans alike, the service features films and series that deliver every\ntype of terror imaginable. The platform was named one of the Best Streaming\nServices for 2021 by PC Mag.\n     *  CONtv: carries a diverse range of film and television essentials\nfocusing on action/thriller, horror, anime and sci-fi/fantasy genres. With\nfilms featuring superstars like Milo Gibson and Peter Facinelli (Gangster\nLand) &amp; Tito Ortiz and Chuck Liddell (Silencer), as well as anime hits from\nthe Yu-Gi-Oh franchise, the channel is packed with content for pop culture\nfans to enjoy.\n     *  Dove Channel: a top source for family-friendly content suitable for\nall audiences. Featuring comedy classics like The Little Rascals, young\nadult series The Saddle Club, family-friendly dramas Sue Thomas F.B. Eye,\nand faith favorites like The Ultimate Gift, the channel has thousands of\nhours of content for the whole family to enjoy.\n     *  Docurama: a one-of-a kind streaming service dedicated to bringing\naudiences acclaimed, cutting-edge documentaries. From biographies to\ntrue-crime stories the channel informs, educates, and engages audiences\nwith award-winning documentary films &amp; TV series. Popular titles include\nAnthony Bourdain's A Cook's Tour, Hell And Back Again &amp; Rick Steves'\nEurope.\n\n     \"We've seen strong growth in each of our Prime Video Channel, and we\nlook forward to additional momentum as we continue to work with the Prime\nVideo Channels team to extend the reach of Fandor, Dove Channel, Screambox,\nCONtv, and Docurama,\" said Daniel Schneider, Senior Vice President, Revenue\nat Cinedigm. \"Prime Video's vast reach to millions of customers allows\nCinedigm to bring these enthusiast channels to new audiences who may not\nhave been previously aware of the rich set of titles available to stream.\"\n\n     An innovator in the digital transformation of the entertainment\nindustry for more than two decades, Cinedigm's core mission is to entertain\nthe world by building the world's best portfolio of enthusiast channels and\nservices for the streaming generation. Through a diverse mix of premium\nSVOD services and dedicated AVOD and FAST channels, Cinedigm's streaming\nportfolio reaches indie film (Fandor), horror (Screambox) and family\nentertainment (Dove Channel), as well as dedicated channels for iconic\nentertainers, led by Bob Ross (The Bob Ross Channel). Cinedigm's ultimate\ngoal is to build destinations that immerse viewers in content they love\nwhile staying at the forefront of technology as the streaming industry\ncontinues to evolve.\n\n     Find these channels on Amazon in the United States now:\n\n     Fandor (AVOD &amp; SVOD at $3.99/month): <a href=\"https://amzn.to/3DCkGFg\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://amzn.to/3DCkGFg</a>\n\n     Screambox (SVOD at $4.99/month): <a href=\"https://amzn.to/3pIjYB5\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://amzn.to/3pIjYB5</a>\n\n     CONtv (AVOD &amp; SVOD at $4.99/month): <a href=\"https://amzn.to/3GmWok4\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://amzn.to/3GmWok4</a>\n\n     Dove Channel (AVOD &amp; SVOD at $4.99/month): <a href=\"https://amzn.to/3dyKAiE\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://amzn.to/3dyKAiE</a>\n\n     Docurama (AVOD &amp; SVOD at $4.99/month): <a href=\"https://amzn.to/3Iv95eN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://amzn.to/3Iv95eN</a>\n\n     Bob Ross (AVOD): <a href=\"https://amzn.to/3lN8lrD\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://amzn.to/3lN8lrD</a>\n\n     About Cinedigm:\n\n     For more than 20 years, Cinedigm (NASDAQ: CIDM) has led the digital\ntransformation of the entertainment industry. Today, Cinedigm entertains\nconsumers around the globe by providing premium feature film and television\nseries, enthusiast streaming channels and technology services to the\nworld's largest media, retail and technology companies. As a leader in the\nrapidly evolving streaming ecosystem, Cinedigm continues its legacy as an\ninnovator through its adoption of next-generation technologies, such as\nartificial intelligence and machine learning, through its proprietary,\nhighly-scalable Matchpoint(TM) technology platform. For more information,\nvisit www.cinedigm.com.\n\n     Cinedigm uses, and will continue to use, its website, press releases,\nSEC filings, and various social media channels, including Twitter\n(https://twitter.com/cinedigm), LinkedIn\n<a href=\"https://www.linkedin.com/company/cinedigm\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.linkedin.com/company/cinedigm</a>/), Facebook\n(https://facebook.com/Cinedigm), StockTwits\n(https://stocktwits.com/CinedigmCorp) and the Company website\n(www.cinedigm.com) as additional means of disclosing public information to\ninvestors, the media and others interested in the Company. It is possible\nthat certain information that the Company posts on its website,\ndisseminated in press releases, SEC filings, and on social media could be\ndeemed to be material information, and the Company encourages investors,\nthe media and others interested in the Company to review the business and\nfinancial information that the Company posts on its website, disseminates\nin press releases, SEC filings and on the social media channels identified\nabove, as such information could be deemed to be material information.\n\nPRESS CONTACT FOR CIDM:\n\nDKC Public Relations\ncinedigm@dkcnews.com\n\nHigh Touch Investor Relations\nCinedigm@htir.net\n\nTel   : 212-206-8600    CINEDIGM CORP\nEmail : jcalcaterra@cinedigm.com\nWWW   : <a href=\"https://www.cinedigm.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.cinedigm.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134300270.MNPRE2134301064-09400720211210</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}