{"date": "2021-12-06 15:11:12.674000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>TERADATA CORP (\"TDC-N\")\n- Chooses Teradata Vantage on AWS to Modernise Data Analytics\n- and Transform Supply Chain Management\n\n  Teradata, the connected multi-cloud data platform for enterprise\nanalytics company, today announced that Target, an iconic Australian\nretailer, has migrated its Demand Chain Management (DCM) architecture to\nTeradata Vantage in the cloud - delivered as-a-service, on Amazon Web\nServices (AWS).\n\n  DCM is a solution suite that employs customer demand data to help Target\ndevelop accurate daily or weekly sales forecasts which ensures in-store and\nonline inventory are available to meet their customers' needs.\n\n  Continuing its established relationship with Teradata, Target selected\nVantage for its proven enterprise scale and performance in the cloud, its\nflexible deployment options for multi-cloud environments, and its rich\nsuite of analytical and data management capabilities that have been rated\nbest-in-class by leading analysts. The initiative was led by Target's\nDelivery Manager, Eesha Gupta and involved collaboration from multiple\nparties.\n\n  \"We are excited to continue our long-standing relationship with Target\nand migrate their workloads to Vantage in the cloud on AWS,\" said Keith\nBudge, Executive Vice President for Asia Pacific and Japan at Teradata.\n\"Identifying areas of focus within demand planning and supply chain\nmanagement were key drivers for Target and the Vantage multi-cloud\nenvironment will allow Target to extract much more from its data assets to\nmore optimally serve the business, drive operational excellence and to take\na more data-driven approach for improved decision making.\"\n\n  \"As part of our ongoing work to modernise our DCM technology stack, we\nknew we had to leverage the cloud for our data analytics platform,\" said\nSamantha McIntyre, General Manager, Technology, Target. \"We recognised that\nwe needed the latest analytics innovation to help us understand demand and\nsupply chain performance, accurately predict consumer demand, and align\ninventory exceptions at the most granular level of store SKU, and to\naggregate views across our entire business.\"\n\n  Teradata Vantage is the connected multi-cloud data platform for\nenterprise analytics. It enables ecosystem simplification by unifying\nanalytics, data lakes and data warehouses. With Vantage, enterprise-scale\ncompanies like Target can eliminate silos and cost-effectively query all\ntheir data, all the time, regardless of where the data resides - in the\ncloud using low-cost object stores, on multiple clouds, on-premises or any\ncombination thereof - to get a complete view of their business.\n\n  About Target\n\n  Target is an iconic Australian retailer dedicated to fashion, style, and\nreal quality that's really affordable. We're famous for creating products\nthat stand up to the test of everyday life, inspiring families to live that\nlittle bit better every day. That's Target.\n\n  About Teradata\n\n  Teradata is the connected multi-cloud data platform for enterprise\nanalytics company. Our enterprise analytics solve business challenges from\nstart to scale. Only Teradata gives you the flexibility to handle the\nmassive and mixed data workloads of the future, today. Learn more at\nTeradata.com.\n  The Teradata logo is a trademark, and Teradata is a registered trademark\nof Teradata Corporation and/or its affiliates in the U.S. and worldwide.\n\nJeff Kaplan\n+61 421 964 454\njeff.kaplan@allisonpr.com\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133900346.MNPRE2133901577-07001420211206</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}