{"date": "2021-11-29 23:53:00.332000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>—Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Say goodbye to frizzy hair! If you're looking to create salon-quality styles from the comfort and convenience of your home, we have good news. You can pick up one of our favorite do-it-all hairstyling tools, the Revlon One-Step hair dryer and volumizer, for the lowest price we've ever seen at Amazon during the retailer's Cyber Monday sales. </p></div><div class=\"tr-npp-body\"><p><span><span>Tackle your holiday shopping with deals and expert advice delivered straight to your phone. </span> Sign up for text message alerts from the deal-hunting team at Reviewed.</span> </p><p>The Revlon One-Step acts as a hair dryer, brush <span>and</span> flat iron, and if you act fast, you can take home the 3-in-1 hair essential for just $22.28. We've seen it retail for as high as $59.99, so that's more than a 50% discount. </p><p>When put to the test, the cult-favorite hair dryer and volumizer was easily one of the best hairstyling tools we've ever used. The One-Step consistently left our locks looking smooth and shiny and cut our styling routine in half. While it was a bit bulky and required two hands to hold, we found it was easier than managing a traditional hair dryer and brush. </p><p><span>►Cyber Monday 2021:</span> Scammers are sending fake 'store' surveys and impersonating Amazon. Here's what to watch out for. </p><p>\"With this tool, you don't need a straightener or curling iron to leave the house with a sleek, finished-looking style,\" Reviewed's beauty editor, Jessica Kasparian, said. \"With minimal effort, you can dry your hair from root to tip and customize your 'do to have more or less volume and curls inward or outward at the ends.\" </p><p>If you're after lush hairstyles and silky, straight strands, the Revlon One-Step has your back. Pick up the best-selling hairstyling tool and tons of other discounted hair essentials right now at Amazon. </p><p class=\"tr-npp-section-title\">Get the Revlon One-Step Hair Dryer and Volumizer at Amazon for $22.28 (Save $37.71)</p><p class=\"tr-npp-section-title\">Shop Amazon Cyber Monday sales</p><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Cyber Monday deals: Save $37 on Revlon's One-Step hair dryer brush at Amazon</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}