{"date": "2021-10-03 06:42:25+00:00", "ticker": "AVV", "mrkt_info": {"open": 3516.0, "close": 3516.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p> Dubai, UAE - Schlumberger and AVEVA today announced an agreement to integrate edge, AI and cloud digital solutions to help operators optimize oil and gas production. The companies will work together to streamline how energy operators acquire, process and action field data for enhanced wellsite efficiency and performance. Initial focus of the collaboration includes linking edge systems to applications in the DELFI* cognitive E&amp;P environment to better manage equipment health and optimize performance.</p>\n<p>“This partnership brings together our edge and cloud solutions with the AVEVA PI System™ to seamlessly liberate access to data accelerating insights and action,” said Rajeev Sonthalia, president, Digital &amp; Integration, Schlumberger. “By integrating our domain expertise, secure edge technology and digital applications in the DELFI environment with AVEVA, we will enable customers to increase efficiency and transform their production operations.”</p>\n<p>“Digital transformation of critical infrastructure requires a strategic vision that transcends technology to drive efficiency, achieve profitable business outcomes and deliver sustainability,” said Andrew McCloskey, Chief Technology Officer, AVEVA. “Recent macroeconomic events have highlighted the need for agility throughout all industries. Our collaboration with Schlumberger will drive operational agility and engineering efficiency, while also enabling swifter delivery of new products and services to make assets and operations run more smoothly.”</p>\n<p>The collaboration will bring to market the IoT and cloud capabilities of both companies. This includes the data management platform capabilities of the AVEVA PI System and Schlumberger domain expertise and analytics capabilities provided by Agora* edge AI and IoT solutions and the DELFI environment. The companies also plan joint technology integrations, sales and service support, and go-to-market activity.</p>\n<p>-Ends-<strong> </strong></p>\n<p><strong>About Schlumberger</strong></p>\n<p><span>Schlumberger (SLB: NYSE) is a technology company that partners with customers to access energy. Our people, representing over 160 nationalities, are providing leading digital solutions, and deploying innovative technologies to enable performance and sustainability for the global energy industry. With expertise in more than 120 countries, we collaborate to create technology that unlocks access to energy for the benefit of all.</span></p>\n<p><span>Find out more at <a href=\"http://www.slb.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.slb.com</a>. </span></p>\n<p><strong>About AVEVA</strong></p>\n<p><span>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence.  AVEVA’s comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries. Learn more at <a href=\"http://www.aveva.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.aveva.com</a>. </span></p>\n<p><strong>Cautionary Statement Regarding Forward-Looking Statements</strong></p>\n<p><span>This press release contains “forward-looking statements” within the meaning of the U.S. federal securities laws — that is, statements about the future, not about past events. Such statements often contain words such as “expect,” “may,” “can,” “estimate,” “intend,” “anticipate,” “will,” “potential,” “projected\" and other similar words. Forward-looking statements address matters that are, to varying degrees, uncertain, such as forecasts or expectations regarding the deployment of, or anticipated benefits of, digital technologies and partnerships. These statements are subject to risks and uncertainties, including, but not limited to, the inability to recognize intended benefits from digital strategies, initiatives or partnerships; and other risks and uncertainties detailed in Schlumberger’s most recent Forms 10-K, 10-Q and 8-K filed with or furnished to the U.S. Securities and Exchange Commission. If one or more of these or other risks or uncertainties materialize (or the consequences of such a development changes), or should underlying assumptions prove incorrect, actual outcomes may vary materially from those reflected in these forward-looking statements. Statements in this press release are made as of the date of this release, and Schlumberger disclaims any intention or obligation to update publicly or revise such statements, whether as a result of new information, future events, or otherwise.</span></p>\n<p>*Mark of Schlumberger</p>\n<p>Copyright © 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</p>\n<p>For further Schlumberger information, contact:<br/>\nMedia<br/>\nGiles Powell – Director of Corporate Communication, Schlumberger Limited<br/>\nTel: +1 (713) 375-3494<br/>\n<a href=\"mailto:communication@slb.com\" data-type=\"email\" translate=\"no\">communication@slb.com</a><br/>\nHilary Cecconi – Head of External Communications, AVEVA<br/>\nTel: +1.919.802.7787<br/>\n<a href=\"mailto:external.communications@aveva.com\" data-type=\"email\" translate=\"no\">external.communications@aveva.com</a><br/>\nInvestors<br/>\nNdubuisi Maduemezia – Vice President of Investor Relations, Schlumberger Limited<br/>\nJoy V. Domingo – Director of Investor Relations, Schlumberger Limited<br/>\nTel: +1 (713) 375-3535<br/>\n<a href=\"mailto:investor-relations@slb.com\" data-type=\"email\" translate=\"no\">investor-relations@slb.com</a> </p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}