{"date": "2021-12-23 14:41:14.913000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.34, "close": 3421.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MAMAMANCINI'S HOLDINGS INC (\"MMMB-Q\")\n- Acquisition of Two Premier Gourmet Food Manufacturers\n\n   MamaMancini's Holdings, Inc., a marketer of specialty pre-prepared,\nfrozen and refrigerated food products, today announced the signing of\ndefinitive agreements for two acquisitions - T&amp;L Creative Salads, Inc.\n(\"T&amp;L\") and Olive Branch, LLC, which are related premier gourmet food\nmanufacturers based in New York. Closing is expected to occur on or about\nDecember 29, 2021, subject to closing conditions.\n\n   Over several decades, brothers Anthony, Michael, and Joseph Morello have\nowned and operated T&amp;L Creative Salads, offering a full line of foods for\nretail food chains and club stores, delis, bagel stores, caterers and\ndistributors. T&amp;L uses high-quality meats, seafood and vegetables, prepared\nto meet the standards set forth by the USDA and the FDA.\n\n   T&amp;L sales are spearheaded by a line of chicken products, including\ngrilled and breaded chicken breasts, chicken strips as well as a kosher\nsalad line. T&amp;L's SQF level 2 state-of-the-art USDA facility in\nFarmingdale, New York has positioned it to expand its operations nationally\ninto MamaMancini's network of retailers and Club Stores. T&amp;L actively sells\nits salads and prepared products to over 250 delis, bagel shops, smaller\nretail accounts and food distributors in the New York metropolitan area,\nrepresenting over 35% of T&amp;L's current sales volume.\n\n   Olive Branch started operations six years ago as a separate company to\nconcentrate on selling olives, olive mixes, and savory products to a\nlimited number of large retail customers, primarily in pre-packaged\ncontainers. Olive Branch products are manufactured at the same facility as\nT&amp;L in Farmingdale, NY.\n\n   MamaMancini's management believes that taken together, T&amp;L and Olive\nBranch are positioned to generate over $30 million in sales in calendar\n2021, have the potential to drive sales of $35 million in 2022 and\nsignificantly increase MamaMancini's net income. Management further\nbelieves that significant growth opportunities exist in leveraging the\nMamaMancini's network of tier-1 distribution partners paired with the newly\nacquired product portfolio, which have relatively limited national\ndistribution at this time.\n\n   MamaMancini's will acquire T&amp;L and Olive Branch for a combined purchase\nprice of $14.0 million, including $11 million in cash at closing and $3\nmillion in a four-year note to the principals of T&amp;L. The cash payment was\nchiefly funded through the MamaMancini's cash on hand and a $7.5 million\nlong-term acquisition note from M&amp;T Bank. Management's analysis is that\nthis acquisition will be substantially accretive to EBITDA and earnings in\nthe future. Anthony Morello will remain as CEO of T&amp;L and Olive Branch with\na five-year contract.\n\n   Anthony Morello, CEO of T&amp;L, said: \"We are excited to become part of the\nMamaMancini's team and believe we can rapidly expand sales as well as\nincorporate their best practices across both T&amp;L and Olive Branch, helping\nto create value for MamaMancini's shareholders.\"\n\n   Carl Wolf, CEO of MamaMancini's, added: \"With T&amp;L's decidedly unique\nproducts, we believe that we can achieve a substantial increase in sales\nand EBITDA in the rapidly growing fresh prepared food section. We plan to\nquickly integrate T&amp;L and Olive Branch into MamaMancini's distribution\nnetwork which would continue to build on our growth trajectory, leveraging\nestablished national distribution partnerships. In addition, T&amp;L's\nmanufacturing facilities are available to augment MamaMancini's production\ncapabilities, particularly in the new ready to eat meals product line.\n\n   \"This announcement marks the first step in our growth through\nacquisition strategy, as we advance promising candidates through our due\ndiligence pipeline. We continue to see attractive multiples in the food\nspace with complementary food product companies generating positive EBITDA\nwith a product that is symbiotic to their existing distribution network. I\nlook forward to continued shareholder value creation in the months ahead as\nwe continue our rapid pace of operational execution,\" concluded Wolf.\n\n   About MamaMancini's Holdings, Inc.\n   MamaMancini's Holdings, Inc. (NASDAQ: MMMB) is a marketer and\ndistributor of specialty prepared, refrigerated and frozen all-natural\nItalian foods. MamaMancini's product portfolio consists of over 40 products\nincluding meatballs, meat loaf, chicken parmesan, sausages and pasta bowl\nkits, with beef, turkey, chicken and pork varieties. The Company's products\nare sold in over 45,000 locations nationwide, including at well-known\nretailers such as Sam's Club, Whole Foods, Publix, Costco and Albertsons,\nas well as through national distributors such as Sysco and United Natural\nFoods. The Company also regularly maintains a direct-to-consumer presence\nthrough presentations on QVC. For more information, please visit\nwww.mamamancinis.com.\n\n   Forward-Looking Statements\n\n   This press release may contain \"forward-looking statements\" within the\nmeaning of Section 27A of the Securities Act of 1933, as amended, and\nSection 21E of the Securities Exchange Act of 1934. \"Forward-looking\nstatements\" describe future expectations, plans, results, or strategies and\nare generally preceded by words such as \"may,\" \"future,\" \"plan\" or\n\"planned,\" \"will\" or \"should,\" \"expected,\" \"anticipates,\" \"draft,\"\n\"eventually\" or \"projected.\" You are cautioned that such statements are\nsubject to a multitude of risks and uncertainties that could cause future\ncircumstances, events, or results to differ materially from those projected\nin the forward-looking statements, including the risks that actual results\nmay differ materially from those projected in the forward-looking\nstatements as a result of various factors, and other risks identified in\nthe Company's 10-K for the fiscal year ended January 31, 2021 and other\nfilings made by the Company with the Securities and Exchange Commission.\n\nLucas A. Zimmerman\nDirector\nMZ Group - MZ North America\n(949) 259-4987\nMMMB@mzgroup.us\nwww.mzgroup.us\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2135600199.MNPRE2135600658-06314420211223</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}