{"date": "2022-02-23 11:48:17.517000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Vodafone in talks to sell 5% stake in Indus Towers to Bharti Airtel: Report</p><p>British telecom giant Vodafone is in discussions to sell around five per cent stake in Indus Towers to Bharti Airtel, according to industry sources.</p></div><div class=\"tr-npp-body\"><p>When contacted, Vodafone refused to comment on the matter.</p><p>Vodafone currently holds about 28 per cent in Indus Towers. Read more</p><p>SC asks Amazon, Future to urge NCLAT to decide on plea against CCI order</p><p>The Supreme Court on Wednesday asked Amazon and Future group to request the NCLAT to decide a plea challenging the revocation of sanction to the US e-commerce major for its deal with Future group's firm by the Competition Commission of India.</p><p>The suggestion was mooted by a bench headed by Chief Justice N V Ramana while adjourning to March 9 the hearing on Amazon's appeal against the January 5 order of the Delhi High Court staying the ongoing arbitration proceedings before an arbitral tribunal over Future Retail's Rs 24,500-crore merger deal with Reliance Retail. Read more</p><p>Money laundering case: ED arrests NCP leader Nawab Malik after questioning</p><p>The Enforcement Directorate (ED) arrested Maharashtra Minority Affairs Minister Nawab Malik on Wednesday in a money-laundering probe linked to the activities of fugitive gangster Dawood Ibrahim and his aides, officials said.</p><p>The 62-year-old NCP leader was taken into custody after he was questioned for about five hours at the ED office in south Mumbai's Ballard Estate area since around 8 AM. Read more</p><p>India could export $500-bn green energy over 20 years: Mukesh Ambani</p><p>As India shapes its energy transition to cleaner fuels, billionaire Mukesh Ambani on Wednesday said technological advancements will make India a global new energy leader, exporting half a trillion dollars worth of clean energy in two decades.</p><p>Ambani, who is helming a transition to green hydrogen production at its oil-dominant conglomerate, said India is today one of the most attractive opportunities for renewable energy investment anywhere in the world. Read more</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Business Standard Ltd.</p></div>"}