{"date": "2021-12-11 19:15:35.076000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3444.24, "close": 3381.83}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">The designation recognizes Seeq's expertise in enabling faster insights for energy customers via advanced analytics features and innovations.</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">SEATTLE, Nov. 30, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">SEATTLE</span>, <span class=\"xn-chron\">Nov. 30, 2021</span> /PRNewswire/ -- <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3374112-1&amp;h=315001397&amp;u=https%3A%2F%2Fwww.seeq.com%2F&amp;a=Seeq+Corporation\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Seeq Corporation</a>, a leader in manufacturing and Industrial Internet of Things (IIoT) advanced analytics software, announced today that it has achieved Amazon Web Services, Inc. (AWS) Energy Competency status. This designation recognizes that Seeq has demonstrated deep expertise helping customers leverage AWS cloud technology to transform complex systems and accelerate the transition to a sustainable energy future. </p>\n\n<p>Achieving the AWS Energy Competency differentiates Seeq as an AWS Partner with extensive knowledge and technical proficiency within this unique industry, including proven customer success developing solutions across the value chain from production operations and optimization to commodities trading, new energy solutions, and more. To receive the designation, AWS Partners undergo a rigorous technical validation process, including a customer reference audit. The AWS Energy Competency provides energy customers with the ability to more easily select skilled Partners to help accelerate their digital transformations with confidence. </p>\n<p>\"Seeq is proud to be among the first AWS Partners to achieve the AWS Energy Competency status,\" says Dr. <span class=\"xn-person\">Lisa Graham</span>, CEO at Seeq. \"Seeq and AWS are complementary solutions for the advancement of the energy industry. By choosing Seeq on AWS, energy companies can leverage the big data, machine learning, and computer science innovations they need to improve production and business outcomes.\" <br/><br/>AWS is enabling scalable, flexible, and cost-effective solutions from startups to global enterprises. To support the seamless integration and deployment of these solutions, AWS established the <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3374112-1&amp;h=3096861426&amp;u=https%3A%2F%2Faws.amazon.com%2Fpartners%2Fprograms%2Fcompetencies%2F&amp;a=AWS+Competency+Program\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Competency Program</a> to help customers identify AWS Partners with deep industry experience and expertise. To receive the designation, AWS Partners undergo a rigorous technical validation process, including a customer reference audit. Seeq also achieved the <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3374112-1&amp;h=1518782777&amp;u=https%3A%2F%2Faws.amazon.com%2Fmanufacturing%2Fpartner-solutions%2F&amp;a=AWS+Industrial+Software+Competency\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Industrial Software Competency</a> in 2019.</p>\n<p>Seeq's advanced analytics application is a preferred solution for upstream production optimization in AWS Marketplace, enabling customers to rapidly investigate and share insights from process data stored on premise or in the cloud. Energy industry customers can also use Seeq to improve sustainability efforts, including carbon recapture, greenhouse gas detection and mitigation, and more. <br/><br/>Examples of use cases for energy customers using Seeq on AWS include one company deploying a real-time event detection model for analyzing well production performance across its asset base. A second company is reducing unplanned downtime and unifying data to optimize asset uptime by using Seeq to connect to Amazon Simple Storage Service (Amazon S3) and its on-premises historic data.</p>\n<p>Seeq on AWS can be procured in AWS Marketplace, which simplifies the procurement process and provides incentives for enterprise customers through the AWS Enterprise Discount Program. In addition, all AWS Marketplace sellers are verified as \"ready-to-run\" on AWS, expediting the purchase process. This streamlined approach to technology deployment enables companies using Seeq to quickly and easily realize the benefits of advanced analytics.  </p>\n<p>In addition to AWS data services, Seeq connects to an extensive set of data storage platforms from vendors including OSIsoft, Siemens, GE, Honeywell, Inductive Automation, AVEVA, AspenTech, Yokogawa, InfluxDB, Snowflake, and others. Seeq is available worldwide through a global partner network of system integrators, which provides training and resale support for Seeq in over 40 countries, in addition to its direct sales organization in <span class=\"xn-location\">North America</span> and <span class=\"xn-location\">Europe</span>.</p>\n<p>To learn more about Seeq, visit Seeq.com. </p>\n<p><b>Media Contact</b><br/><span class=\"xn-person\">Sydney DeLosh</span><br/>734-776-0900<br/><a href=\"mailto:324862@email4pr.com\" data-type=\"email\" translate=\"no\">324862@email4pr.com</a> </p>\n<p><b>About Seeq<br/></b>Founded in 2013, Seeq publishes software applications for manufacturing organizations to rapidly find and share insights. Oil &amp; gas, pharmaceutical, specialty chemical, utility, renewable energy and numerous other vertical industries rely on Seeq to improve production outcomes, including yield, margins, quality, and safety. Headquartered in <span class=\"xn-location\">Seattle</span>, Seeq is a privately held virtual company with employees across <span class=\"xn-location\">the United States</span> and sales representation in <span class=\"xn-location\">Asia</span>, <span class=\"xn-location\">Canada</span>, <span class=\"xn-location\">Europe</span>, and <span class=\"xn-location\">South America</span>. To learn more about Seeq visit <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3374112-1&amp;h=223472180&amp;u=http%3A%2F%2Fwww.seeq.com%2F&amp;a=www.seeq.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.seeq.com</a>.</p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n</div>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=PH91328&amp;sd=2021-11-30\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1QSDkxMzI4JnNkPTIwMjEtMTEtMzA=&amp;key=79121a7cd4c4fa7214733e7324fc1f5bf4935ddd5c708962c641ab1121b0710d56476ce1ef04cf7518f8fb25f59da93c577e7dd2f07dfb6c06528256b373e4b6\"/></div></div> View original content to download multimedia:<a href=\"https://www.prnewswire.com/news-releases/seeq-corporation-achieves-aws-energy-competency-status-301433836.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/seeq-corporation-achieves-aws-energy-competency-status-301433836.html</a><p></p>\n<p>SOURCE  Seeq Corporation</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SEEQCORP-AWSStatus</p></div>"}