{"date": "2021-12-01 11:25:29.487000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Read Article Qlik deepened its work with Amazon Web Services (AWS)  with the release of an advanced analytics connector for Amazon SageMaker and integration with Amazon SageMaker Autopilot. These integrations increase the breadth of advanced analytics ...</p><p>Qlik deepened its work with Amazon Web Services (AWS)  with the release of an advanced analytics connector for Amazon SageMaker and integration with Amazon SageMaker Autopilot. These integrations increase the breadth of advanced analytics capabilities already available in Qlik Cloud (R), providing seamless integration to Amazon's advanced machine learning capabilities all via Qlik's Active Intelligence Platform.</p></div><div class=\"tr-npp-body\"><p>\"Advanced machine learning capabilities to drive more predictive and prescriptive analytics is an important part of our vision for Active Intelligence, where businesses can seize every business moment. Now users of Amazon SageMaker can take advantage of their offerings directly in our SaaS platform, opening up even more opportunities,\" said James Fisher, Chief Product Officer at Qlik. \"This capability supplements what is available today via Qlik AutoML, and illustrates our ongoing commitment to being a fully open, independent platform for data.\"</p><p>The new Amazon SageMaker connector is part of Qlik's Advanced Analytics Integration strategy, offering native, engine-level integrations built directly into Qlik's cloud analytics. It enables direct data exchange between Qlik's Analytics Engine and Amazon SageMaker to deliver a set of predictive data and updated calculations in real time as the user interacts with the data. Additionally, the new integration with SageMaker Autopilot, available through Qlik Application Automation (TM), will enable less technical users to create their own predictive models, expanding the potential of predictive analytics to more analytics users in the organization.</p><p>These new integrations further extend Qlik's existing augmented analytics capabilities through Insight Advisor, which auto-generates advanced analytics and insights, automates creation and data preparation, and supports natural language interaction. Qlik expanded its augmented analytics capabilities recently with Qlik AutoML, a no-code automated ML capability aimed at helping business analysts and analytics teams create models and perform predictive analytics in a complementary fashion to data scientists. Together, users can now leverage the sophisticated models created in Amazon SageMaker to make business decisions, with AutoML alongside to generate additional value where data scientists don't focus.</p><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}