{"date": "2021-11-16 13:00:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Tito Correa</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">SINANGOE, Nov 16 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Ecuador's constitutional court judges traveled to the heart of the Amazon to hear indigenous communities defend their right to oppose mining projects in their territories during a historic hearing in the jungle. </p><p>\"We want our feelings to be heard and reflected in a document that guarantees the protection of our territories,\" said Wider Guaramag, leader of the A'i Cofan community in Sinangoe.</p><p>The hearing took place on Monday, just days after the U.N. climate conference in Glasgow wrapped up with agreements to curb climate change and phase down the use of fossil fuels, such as coal.</p><p>Ecuador's President Guillermo Lasso, a conservative ex-banker, wants to expand mining to attract private investment and has promised legal stability and respect for concessions that have already been granted.</p><p>In 2018 the community succeeded in convincing a lower court to reverse dozens of previously granted mining concessions along the Aguarico river, arguing they had not been properly consulted about the developments.  </p><p>The case could set a precedent regarding rights of indigenous communities to be free and informed consultations about extractive projects, the constitutional court has said. </p><p><span class=\"tr-strong\">\"A historical event happened today and it sets an important precedent for every community and nationality,\" Marlon Vargas, president of the Confederation of Indigenous Nationalities of the Ecuadorian Amazon, said during a press conference. </span></p><p><span class=\"tr-strong\">\"The constitutional court will have to work in every territory, especially where they have been drastically affected,\" he said. </span></p><p>Ecuador expects four copper and gold mines will begin producing in 2025, and has set its sights on boosting oil production to 1 million barrels per day. </p><p>Yet while two mines currently operate in the country's Amazon, other large projects have been held up due to conflicts with indigenous communities.</p><p>Though Lasso supports prior consultations, Cofan communities are now fighting for the right to be included in the process of granting concessions. </p><p>\"Our territory is our decision - we are its only owners,\" said Alexandra Narvaez, the first woman to join the Cofan people's guard.</p><p>Another indigenous community, the Waorani, also attended the hearing to demand the same rights, after they won a lawsuit to stop the development of an oil concession in their territory.</p><p>\"The Ecuadorian government must respect our decision for our home, which is the jungle,\" said Nemonte Nenquimo, a Waorani community leader. </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Tito Correa<br/>Writing by Oliver Griffin <br/>Editing by David Gregorio)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Oliver.Griffin@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Oliver.Griffin@thomsonreuters.com</a> ; +57 304-583-8931; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: ECUADOR-INDIGENOUS/ (PIX, TV)</p></div>"}