{"date": "2022-02-24 18:12:34.972000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2896.54, "close": 3075.77}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>CINEDIGM CORP (\"CIDM-Q\")\n- Fandor to Present Inaugural 'Fandor New Voices Award' at 29th\n- Annual SXSW(R) Film Festival, March 11-20\n\n     Cinedigm the leading independent streaming company super-serving\nenthusiast fan bases, announced that Fandor, the premier destination for\ncinephiles, will present its inaugural Fandor New Voices Award to one\nindependent filmmaker as part of this year's South by Southwest(R) Film\nFestival (SXSW(R)), March 11-20 in Austin, Texas.\n\n     Fandor elevates the work of inspiring and imaginative independent\nfilmmakers and will present the Fandor New Voices Award to a female or\nperson of color who is making their directorial debut with a SXSW(R) World\nPremiere narrative feature or documentary.\n\n     In the award's first year, the winner will be selected by a Fandor\njury panel and announced during the festivals' film awards ceremony on\nTuesday, March 15 at 7:30 p.m. CT at the Paramount Theatre.\n\n     The Fandor New Voices Award winner will receive a $7,500 cash prize\nand will have the opportunity to distribute their film on Fandor's\nindependent film streaming service, available across multiple devices\nincluding web, iOS, Android and Roku. The winner will also have the\nopportunity to be featured on the Fandor Festival Podcast and Fandor's\ndigital editorial hub, Keyframe.\n\n     Celebrating its 29th year, the SXSW(R) Film Festival has been an\nintegral support of Fandor, which first announced the launch of its\nindependent streaming service in 2011 and returned to mark its new chapter\nwith the relaunch of the service in 2021. Fandor also features SXSW(R)\nfeatures and documentaries on its independent streaming service, including\nthe comedic odyssey Our Father (2019), starring Baize Buzan and Allison\nTorem, with direction from Bradley Grant Smith.\n\n     Said Phil Hopkins, President of Fandor, \"Uplifting the work of\nindependent filmmakers has always been at the core of Fandor's mission and\nthe New Voices Award embodies our dedication to celebrating their essential\nwork. It is our goal to continue to foster diversity and inclusion in\nHollywood by recognizing an exceptional filmmaker making their directorial\ndebut who is a woman or a person of color. We are honored to be able to\npresent the award to a rising talent at South by Southwest, a festival that\nis so important to our company's history.\"\n\n     Said Janet Pierson, VP, Director of Film, SXSW, \"At SXSW we love\ndiscovering work from new voices. We're thrilled that Fandor approached us\nto create this significant award for a filmmaker at SXSW 2022 and will join\nus in creating transformative experiences for these talented newcomers.\"\n\n     Fandor features thousands of independent films, documentaries,\ninternational titles and classics on web, iOS, Android, Roku, Comcast\nXfinity X1 and Xfinity Flex, YouTube TV and Amazon.\n\n     About Cinedigm:\n\n     For more than 20 years, Cinedigm has led the digital transformation of\nthe entertainment industry. Today, Cinedigm entertains hundreds of millions\nof consumers around the globe by providing premium content, streaming\nchannels and technology services to the world's largest media, technology\nand retail companies.\n\n     About Fandor:\n\n     Fandor streams thousands of handpicked, award-winning movies from\naround the world. With dozens of genres that include Hollywood classics,\nundiscovered gems, and the latest festival favorites, Fandor provides\ncurated entertainment and original editorial offerings on desktop, iOS,\nAndroid, Roku, YouTube TV, and Amazon Prime. With a rapidly expanding\nlibrary and innovative partnerships, Fandor's goal is to captivate and\ninspire a global community of movie lovers. Learn more at\n<a href=\"http://www.Fandor.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.Fandor.com</a>.\n\n     About SXSW Film Festival\n\n     Now in its 29th year, SXSW Film Festival brings together creatives of\nall stripes over nine days to experience a diverse lineup and access to the\nSXSW Music and Comedy Festivals plus SXSW Conference sessions with\nvisionaries from all corners of the entertainment, media, and technology\nindustries.\n\n     About SXSW\n\n     SXSW dedicates itself to helping creative people achieve their goals.\nFounded in 1987 in Austin, Texas, SXSW is best known for its conference and\nfestivals that celebrate the convergence of tech, film, music, education,\nand culture. An essential destination for global professionals, the annual\nMarch event features sessions, music and comedy showcases, film screenings,\nexhibitions, professional development and a variety of networking\nopportunities. SXSW proves that the most unexpected discoveries happen when\ndiverse topics and people come together. SXSW 2022 will take place March 11\n- 20, 2022. For more information, please visit sxsw.com. To register for\nthe event, please visit sxsw.com/attend.\n\n     SXSW 2022 is sponsored by White Claw, Blockchain Creative Labs,\nPorsche and The Austin Chronicle.\n\n# # #\n\nPRESS CONTACT FOR CIDM:\nDKC Public Relations\ncinedigm@dkcnews.com\n\nHigh Touch Investor Relations\nCinedigm@htir.net\n\nTel   : 212-206-8600    CINEDIGM CORP\nEmail : jcalcaterra@cinedigm.com\nWWW   : <a href=\"https://www.cinedigm.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.cinedigm.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2205400538.MNPRE2205402168-07235620220224</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}