{"date": "2021-11-29 09:04:05+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          Highest partner level of the Amazon Web Services (AWS) Partner Program achieved\n        </li>\n                  <li>\n          One of the select few German-based Premier Consulting Partners\n        </li>\n                  <li>\n          Global experience and high quality with AWS <span>Cloud</span>.\n        </li>\n                </ul>\n                <div>\n                  <p>\n          T-Systems is moving up in the partner program to become a Premier Consulting Partner of Amazon Web Services (AWS).\n        </p>\n                </div>\n                <p>\n        In its latest achievement, T-Systems has reached AWS Premier Tier as a Consulting Partner. T-Systems made the announcement ahead of AWS re:Invent 2021, the meeting of AWS' global <a href=\"https://www.telekom.com/en/glossary#glossar381510\" data-type=\"url\" class=\"tr-link\" translate=\"no\">cloud</a> community. The award requires a great deal of experience. Among other things, Premier Consulting Partners must have a successful and proven track record of consulting and supporting the development, architecture, build, migration and operation of their applications on AWS.\n      </p>\n                <p>\n        The successful path began in 2018. By May 2020, T-Systems became part of the AWS Managed Service Provider (\"MSP\") Program. In late 2020 T-Systems added SAP on AWS competency and extended it with the migration competency earlier this year.\n      </p>\n                <p>\n        To become an AWS Premier Consulting Partner, T-Systems had to complete a rigorous approval process through accreditations and certifications, demonstrate a long-term investment in their relationship with AWS, and show extensive expertise in deploying customer solutions on AWS. Premier Consulting Partners also require a strong team of AWS trained and certified technical consultants along with deep expertise in project management and professional services. The strategic collaboration agreement, signed by AWS and T-Systems in 2020, formed the foundation for this achievement.\n      </p>\n                <p>\n        \"When we achieved the MSP Program status, we have previously shown that we understand the AWS philosophy. The global transformation of <a href=\"https://www.telekom.com/en/glossary#glossar381614\" data-type=\"url\" class=\"tr-link\" translate=\"no\">IT</a> landscapes to the cloud has virtually only just begun but it is already spreading rapidly. This makes the designation as a Premier Consulting Partner all the more important, as it certifies our international experience in this process,\" explains Frank Strecker, Global SVP for Public <a href=\"https://www.telekom.com/en/glossary#glossar381510\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Cloud</a> at T-Systems. Strecker continues: \"with our expertise in the SAP and migration environment, among others, we have continued to pave the way. I am proud of my team, whose commitment made the award possible.\" In addition to the Premier Tier, T-Systems is also an AWS Direct Connect Delivery Partner, providing customers with secure access networks to AWS.\n      </p>\n                <p>\n        \"We are pleased to recognize T-Systems as an AWS Partner Network (APN) Premier Consulting Partner,\" said Christopher Sullivan, Global Director WW System Integrators &amp; Strategic Alliances, AWS. \"T-Systems is helping organizations around the world accelerate their adoption of cloud technologies. The expansion demonstrates our mutual commitment to help customers transform their business with the scale, security, and agility of AWS.\"\n      </p>\n                <h4>\n        Leaders in three categories\n      </h4>\n                <p>\n        ISG (Information Service Group), a leading global technology research and advisory firm, attests to T-Systems' strong momentum and significant progress in working with AWS. In the latest ISG Provider Lens TM report for \"AWS - Ecosystem Partners, Germany 2020\", T-Systems was ranked as a leader in all three categories: Managed Services, Consulting Services, and Migration and Container Solutions.\n      </p>\n                <h4>\n        Successes confirm international expertise\n      </h4>\n                <p>\n        In a migration project for Indonesian hospital group Mitra Keluarga, T-Systems helped the group migrate its on-premises SAP landscape to the AWS cloud in Singapore. As a result of this migration, the healthcare provider now benefits from greater reliability through more stable and scalable infrastructures. Johan Soegiarto, Corporate IT Director at Mitra Keluarga said: \"With the help of T-Systems, we were able to transfer our applications to a more powerful infrastructure without any downtime. By operating in the AWS Cloud, we are future-proof and can quickly adapt to changing requirements.\"\n      </p>\n                <p>\n        T-Systems plans to continue driving value through the company's strong relationship with AWS. One of the short-term goals is achieving the AWS Security Competency early in 2022. Another one is to enable extended managed cloud solutions with a strong focus on security and data privacy.\n      </p>\n                <p>\n        More information <a href=\"https://cloud.telekom.de/en\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a>.\n      </p>\n                <p>\n                  <strong>About Deutsche Telekom:</strong>\n                  <span>\n                    <a href=\"https://www.telekom.com/en/company/companyprofile/company-profile-625808\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Deutsche Telekom at a glance</a>\n                  </span>\n                </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.telekom.com/en/media/media-information/archive/tsi-becomes-an-amazon-web-services-premier-consulting-partner-641780\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Deutsche Telekom AG</strong> published this content on <strong>29 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>29 November 2021 09:04:05 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Deutsche Telekom AG</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Deutsche-Telekom-AG</p></div>"}