{"date": "2021-12-31 13:41:28.962000+00:00", "ticker": "III", "mrkt_info": {"open": 1467.5, "close": 1449.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENBRIDGE INC (\"ENB-TN\")\n- Normal Course Issuer Bid\n\n     Enbridge Inc. (Enbridge or the Company) announced that the Toronto\nStock Exchange (TSX) has approved the Company's normal course issuer bid\n(NCIB) to purchase, for cancellation, up to 31,062,331 of its outstanding\ncommon shares to an aggregate amount of up to $1.5 billion.\n\n     Purchases under the NCIB may be made through the facilities of the\nTSX, the New York Stock Exchange (NYSE) and other designated exchanges and\nalternative trading systems, commencing on January 5, 2022 and continuing\nuntil January 4, 2023, when the bid expires, or such earlier date on which\nthe Company has either acquired the maximum number of common shares\nallowable under the NCIB or otherwise decides not to make any further\nrepurchases under the NCIB. The maximum number of common shares that\nEnbridge may repurchase for cancellation represents approximately 1.53% of\nthe 2,026,085,179 common shares issued and outstanding as at December 22,\n2021.\n\n     Share repurchases made pursuant to the Company's NCIB will be\npredicated upon maintaining a strong balance sheet, performance of the\nbusiness, and the availability and attractiveness of alternative capital\ninvestment opportunities. The price that Enbridge will pay for common\nshares in open market transactions will be the market price at the time of\npurchase and common shares purchased under the NCIB will be cancelled. The\nactual number of common shares purchased under the NCIB, the timing of\npurchases, and the price at which the common shares are acquired will\ndepend upon future market conditions.\n\n     The NCIB will be effected in accordance with the TSX's NCIB rules and\nRule 10b-18 under the U.S. Securities Exchange Act of 1934, as amended,\nwhich contain restrictions on the number of common shares that may be\npurchased on a single day, subject to certain exceptions for block\npurchases, based on the average daily trading volumes of Enbridge's common\nshares on the applicable exchange. Subject to exceptions for block\npurchases, Enbridge will limit daily purchases of common shares on the TSX\nin connection with the NCIB to no more than 25 percent (1,929,706 common\nshares) of the average daily trading volume of the common shares on the TSX\nfrom June 1, 2021 to and including November 30, 2021 (7,718,824 common\nshares) during any trading day.\n\n     The Company has engaged TD Securities Inc. as its broker to effect\nrepurchases of the Company's common shares under the NCIB within a defined\nset of criteria.\n\n     About Enbridge Inc.\n\n     Enbridge Inc. is a leading North American energy infrastructure\ncompany. We safely and reliably deliver the energy people need and want to\nfuel quality of life. Our core businesses include Liquids Pipelines, which\ntransports approximately 25 percent of the crude oil produced in North\nAmerica; Gas Transmission and Midstream, which transports approximately 20\npercent of the natural gas consumed in the U.S.; Gas Distribution and\nStorage, which serves approximately 3.8 million retail customers in Ontario\nand Quebec; and Renewable Power Generation, which owns approximately 1,766\nmegawatts (net) in renewable power generation capacity in North America and\nEurope. The Company's common shares trade on the Toronto and New York stock\nexchanges under the symbol ENB. For more information, visit\nwww.enbridge.com.\n\n     Forward-Looking Information\n\n     Forward-looking information, or forward-looking statements, have been\nincluded in this news release to provide information about Enbridge and its\nsubsidiaries and affiliates, including management's assessment of Enbridge\nand its subsidiaries' future plans and operations. This information may not\nbe appropriate for other purposes. Forward-looking statements are typically\nidentified by words such as \"anticipate\", \"expect\", \"project\", \"estimate\",\n\"forecast\", \"plan\", \"intend\", \"target\", \"believe\", \"likely\", \"will\" and\nsimilar words suggesting future outcomes or statements regarding an\noutlook. Forward-looking information or statements in this news release\ninclude statements with respect to Enbridge's intention to commence the\nNCIB, the purpose of the NCIB, and the timing, methods and quantity of any\npurchases of common shares under the NCIB.\n\n     Although Enbridge believes these forward-looking statements are\nreasonable based on the information available on the date such statements\nare made and processes used to prepare the information, such statements are\nnot guarantees of future performance and readers are cautioned against\nplacing undue reliance on forward-looking statements. By their nature,\nthese statements involve a variety of assumptions, known and unknown risks\nand uncertainties and other factors, which may cause actual results, levels\nof activity and achievements to differ materially from those expressed or\nimplied by such statements. Assumptions regarding the expected supply of\nand demand for crude oil, natural gas, NGL and renewable energy, and the\nprices of these commodities, are material to and underlie all\nforward-looking statements, as they may impact current and future levels of\ndemand for the Company's services. Similarly, energy transition, including\nthe drivers and pace thereof, the COVID-19 pandemic, exchange rates,\ninflation and interest rates impact the economies and business environments\nin which the Company operates and may impact levels of demand for the\nCompany's services and cost of inputs, and are therefore inherent in all\nforward-looking statements. Due to the interdependencies and correlation of\nthese macroeconomic factors, the impact of any one assumption on a\nforward-looking statement cannot be determined with certainty.\n\n     Enbridge's forward-looking statements are subject to risks and\nuncertainties, including but not limited to those risks and uncertainties\ndiscussed in this news release and in the Company's other filings with\nCanadian and United States securities regulators. The impact of any one\nrisk, uncertainty or factor on a particular forward-looking statement is\nnot determinable with certainty as these are interdependent and Enbridge's\nfuture course of action depends on management's assessment of all\ninformation available at the relevant time. Except to the extent required\nby applicable law, Enbridge assumes no obligation to publicly update or\nrevise any forward-looking statements made in this news release or\notherwise, whether as a result of new information, future events or\notherwise. All subsequent forward-looking statements, whether written or\noral, attributable to Enbridge or persons acting on the Company's behalf,\nare expressly qualified in their entirety by these cautionary statements.\n\n     FOR FURTHER INFORMATION PLEASE CONTACT:\n\n     Media Toll Free: (888) 992-0997 Email: media@enbridge.com\n\n     Investment Community Toll Free: (800) 481-2804 Email:\ninvestor.relations@enbridge.com\n\nWWW   : <a href=\"https://www.enbridge.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.enbridge.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2136400018.MNPRE2136400190-05121320211231</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}