{"date": "2021-12-01 12:42:08.325000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>BLENDER BITES LTD (\"BITE-Z\")\n- CEO to Host Special Conference Call for Shareholders and\n- Investors on Friday, December 3, 2021\n\n     Blender Bites Limited (the \"Company\", \"Blender Bites\" or \"Blender\"), a\nCanadian company involved in the development and marketing of a line of\nfrozen premium organic and plant-based pre-portioned frozen smoothie pucks,\nis pleased to announce that Chelsie Hodge, Blender Bites' CEO and Founder,\nwill host special conference call for investors (the \"Conference Call\"), on\nFriday, December 3, 2021 at 1:30 p.m. PST/4:30 p.m. Eastern/10:30 p.m. CET.\n\n     During this special investors' address, Ms. Hodge will touch on some\ncurrent and relevant events which the Company believes will impact future\ndevelopments and will provide participants with an overview of the\nCompany's direction for 2022.\n\n     CONFERENCE CALL:\n\n     The conference call will be held on Friday, December 3, 2021, at 1:30\np.m. Pacific, 4:30 p.m. Eastern, 10:30 p.m. CET.\n\n     Please call in 10 minutes before the conference call starts and stay\non the line. Questions will be answered at the end of the call.\n\n     CONFERENCE PARTICIPANT ID: BITES\n\n     DIAL-IN NUMBERS:\n\n     Toll: 785 424 1061\n\n     Toll-Free Canada &amp; the US: 800 895 2195\n\n     Toll-Free Germany: 0 800 186 2030\n\n     About Blender Bites\n\n     Blender Bites is a Canadian company involved in the development and\nmarketing of a line of premium frozen food products with a focus on\nfunctionality. Blender Bites was founded in 2016 and was first to market in\nWestern Canada with a pre-portioned \"easy smoothie\" product that is free of\nany unnecessary inner plastic packaging. Blender Bites products are\ncertified organic, vegan, non-GMO, gluten free, dairy free and soy free.\nThey contain no added sugars and are made in Canada. Blender Bites products\nare distributed internationally across Canada and the US, and are currently\nsold in over 900 stores, including Sobeys, Safeway, Save on Foods, Whole\nFoods Market, Buy-Low/Nesters, IGA and Fresh Street.\n\n     On behalf of the Board of Directors,\n\n     Blender Bites Limited\n\n     Chelsie Hodge, Chief Executive Officer\n\n     For further information, contact Blender IR Team at:\n\n     Email - investors@blenderbites.com\n\n     Telephone - 1-888-997-2055\n\n     CAUTIONARY DISCLAIMER STATEMENT\n\n     This news release includes certain \"forward-looking statements\" under\napplicable Canadian securities legislation. Forward-looking statements are\nnecessarily based upon several estimates and assumptions that, while\nconsidered reasonable, are subject to known and unknown risks,\nuncertainties, and other factors which may cause the actual results and\nfuture events to differ materially from those expressed or implied by such\nforward looking statements. Such factors include, but are not limited to\ngeneral business, economic, competitive, political, and social\nuncertainties, and uncertain capital markets. Readers are cautioned that\nactual results and future events could differ materially from those\nanticipated in such statements. Accordingly, readers should not place undue\nreliance on forward-looking statements. The Company disclaims any intention\nor obligation to update or revise any forward-looking statements, whether\nas a result of new information, future events or otherwise, except as\nrequired by law.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133400302.MNPRE2133400866-04400620211201</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}