{"date": "2021-11-17 17:00:26+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Repeats, without change to story, to fix metadata</p><p class=\"tr-advisory\">Adds comments from Visa, UK Trade Commission, background</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Nov 17 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> <span class=\"tr-strong\">will stop </span>accepting Visa Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=V.N\" data-type=\"ric\" data-ric=\"V.N\" translate=\"no\" dir=\"ltr\">V.N</a> credit cards issued in the United Kingdom from next year <span class=\"tr-strong\">because of the </span>high <span class=\"tr-strong\">transaction fees </span>charged by the payment processor, <span class=\"tr-strong\">the e-commerce giant said on Wednesday</span>.</p><p>\"As a result of Visa's continued high cost of payments, we regret that Amazon.co.uk will no longer accept UK-issued Visa credit cards as of 19 January, 2022,\" an Amazon spokesperson said in an emailed statement. </p><p>Amazon customers can still use Visa debit cards, Mastercard and Amex credit cards, and Eurocard, the company said in a note to its customers.</p><p><span class=\"tr-strong\">\"We are very disappointed that Amazon is threatening to restrict consumer choice in the future,\" a Visa spokesperson said in a statement.</span></p><p><span class=\"tr-strong\">\"We continue to work toward a resolution, so our cardholders can use their preferred Visa credit cards at Amazon UK without Amazon-imposed restrictions come January 2022.\"</span></p><p>S<span class=\"tr-strong\">ince Brexit, an EU-enforced cap on fees charged by card issuers is no longer in place in the UK.  </span></p><p><span class=\"tr-strong\">The move by Amazon, earlier reported by Bloomberg News, has prompted the UK Trade Commission to call on the government to improve the UK-EU trade agreement and analysts to call on British regulators to look into the fees in the credit card market.</span></p><p><span class=\"tr-strong\">\"If Amazon can't make it work, with all their resources and ability to navigate legislation to avoid costs, then small businesses have no chance and so the government must improve the UK-EU trade and cooperation agreement to keep British businesses competitive,\" said Tamara Cincik from UK Trade and Business Commission </span></p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Bhargav Acharya, Maria Ponnezhath and Yadarisa Shabong in Bengaluru; additional reporting by Huw Jones; Editing by Subhranshu Sahu and Uttaresh.V)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Bhargav.Acharya@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Bhargav.Acharya@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: BRITAIN-AMAZON.COM/VISA (UPDATE 3, REPEAT)</p></div>"}