{"date": "2022-02-12 15:13:31.458000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3180.07, "close": 3103.34}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Imitaz Ali's daughter and filmmaker Ida Ali has written Amazon miniTV's new short film Uljhe Hue, a romantic drama starring Sanjana Sanghi and Abhay Verma.</p><p>Imtiaz Ali's daughter Ida Ali helmed her first film Lift, a contemporaneity love story, at the age of 17. Ida, 20, is currently studying filmmaking at a university in California. She recently turned screenwriter for Amazon miniTV's new short film Uljhe Hue, a romantic drama starring Sanjana Sanghi and Abhay Verma.</p></div><div class=\"tr-npp-body\"><p>In this interview with indianexpress.com, Ida talks about Uljhe Hue, her father Imtiaz Ali and her take on love which is way different than what her father portrays in his films.</p><p>Excerpts from the conversation:</p><p>Uljhe Hue has a young vibe to it. You seem to have had fun writing it.</p><p>I had a lot of fun writing the story. From where the story started out to where it ended, it's just become a little bigger and more relatable to young people. It is the story of a lot of people I know in these two characters. It was fun watching the movie and thinking about all the characters that were in my mind.</p><p>You started off your journey as a filmmaker at the age of 17. How different is it now at the age of 20?</p><p>When I started, I wanted to know if I have it in me or is it just because of my surroundings that I am getting into films. So, I wrote something and made a film. It was more about the excitement of making my first film. However, artistically and stylistically I don't think I gave it what I give my films now.</p><p>How has it been growing up in the shadows of filmmaker, father Imtiaz Ali?</p><p>Firstly, the biggest contribution from my family in terms of filmmaking is not just that I have a father who is a filmmaker, but I was surrounded by sets all the time. I used to go on location and hang out in production room, office. Dinner table conversations were about films. We used to discuss tiny details of films as well. I think that must have definitely contributed. But going back to the start, it was the idea of stories, as I was always told one bed time story every night. Hence, storytelling became very important to me, and I started telling stories. After that I couldn't imagine not being a storyteller. And that's why I wanted to make a film when I was that young. I wanted to know if I had it in me or is it just the pressure.</p><p>Your father has worked with some phenomenal actors. Would you like to work with some of them in the future?</p><p>Yes. He works with really great actors. I would be very excited to work with everyone he's worked with. During the shoot of Rockstar, I was very young. I was that kid on set that everyone would play with. It was exciting. As a kid you get a little stars-truck talking to them, as they're all so nice to you. Now that I am thinking about it professionally, they're all very good actors and I'd love to work with them.</p><p>A post shared by Ida Ali (@idaali11)</p><p>Do you share your work with your father and does he give you feedback?</p><p>Yes. We both share each other's stories and give each other feedback. He's been sharing stories for longer obviously and now that I am writing stories, he gives me feedback.</p><p>Does being Imtiaz Ali's daughter help you in any way, or you carry that baggage?</p><p>Of course, it's the reason why I'm here. The perception is that because I am his daughter I have some kind of credibility. I don't think that would be the case for creative professionals because they see quality.</p><p>I feel like I have to do my best to now prove myself. I can't let it be on the perception of bad or good because some people might like my father's stuff and think that his daughter will also be good. Some people will be like I am here just because of him, and that I don't have that much substance. So I have to constantly prove that I have substance.</p><p>Of course, there is baggage and a lot of pressure. But then how can this job not have pressure. I feel like if there is something that is good, people will see it. I am at an advantageous and a disadvantageous position because of who I am but everyone has that as well. So, these are the challenges that I'll face.</p><p>As an aspiring filmmaker, how would you want to change the way Indian films are seen today?</p><p>Right now I am studying filmmaking in California. One thing that I realised after coming here is that I want to tell Indian stories. But I don't want to be limited by industries like Bollywood or Hollywood. I sometimes sit in my class and we talk about Indian films. And for some reason I get this feeling that people don't respect it as much. It is such a vast industry. India makes the most number of films, and still we have very few movies that get global recognition. So, if anything, I want to get that recognition for our films.</p><p>How different do you see love than what your father has shown in his films?</p><p>I think one difference is that he is a little more romantic whereas I am a little more realist. He goes into a little bit of mysticism and poetry whereas I just haven't grasped that concept. I am still young. When I think about relationships, it is very honest and brutal because of the age I am born in where everything is fast paced. Today, relationships are changing all the time. It is not like 'janam janam ka rishta' and I guess that would be the difference. I also don't only write love stories and I feel like the more I explore my writing, the more I'll know what kind of writer I am. I haven't done much to know what I am yet.</p><p>Copyright 2022 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}