{"date": "2021-11-17 03:03:03.263000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><p>SINGAPORE, Nov 17, 2021 - (Media OutReach) - Okta, Inc. (NASDAQ:OKTA), a leading independent provider of identity for the enterprise, today announced the availability of the Okta Identity Cloud and its products in AWS Marketplace in the Asia Pacific region.</p><p class=\"line-break\"><br/></p><p>AWS Marketplace is a curated digital catalogue that makes it easy for organisations to discover, procure, entitle, provision, and govern third-party software. Businesses across APAC are now able to quickly and seamlessly purchase both Okta's Customer Identity and Workforce Identity products in AWS Marketplace, while benefiting from integrations that take advantage of both Okta and AWS, including AWS Control Tower, a service that provides the easiest way to set up and govern a secure, multi-account AWS environment.</p><p class=\"line-break\"><br/></p><p>AWS Control Tower makes Okta more powerful and effective for enterprises. Through this new integration with AWS Control Tower, organisations can further optimise identity management with simplified single sign-on experiences, user provisioning and password management to streamline multi-cloud access management.</p><p class=\"line-break\"><br/></p><p>Cloud migration is a top imperative for the world's largest organisations. Businesses migrating to the cloud need to provide rapid connectivity and security for employees and customers as dynamic working practices become the norm. Identity for the enterprise plays a critical role in helping organisations securely and efficiently run their businesses in the cloud, enabling seamless access for employees while maintaining visibility and control over sensitive data and information. With AWS, Okta can help streamline enterprises' identity strategy and software development approach, supporting businesses as they accelerate digital transformation.</p><p class=\"line-break\"><br/></p><p>\"Okta and AWS are playing a pivotal role in providing infrastructure and secure access capabilities for organisations everywhere in their move to the cloud,\" said Graham Sowden, General Manager, Asia Pacific, Okta. \"By working together, we are ensuring that businesses have simplified access to our market-leading technologies that help them solve complex challenges, with an added layer of security and compliance.\"</p><p class=\"line-break\"><br/></p><p>Stephen Orban, General Manager, Marketplace and Control Services, AWS said, \"As more businesses move their application portfolio to the cloud, modernised identity and access management has become increasingly important. \"We welcome Okta Identity Cloud to AWS Marketplace in APAC to help meet the identity needs of customers using multiple third-party software vendors. More than 310,000 builders and buyers around the world use AWS Marketplace to find, buy, deploy, and govern their preferred third-party software. We look forward to seeing Okta leverage AWS Marketplace to innovate faster and more securely.\"</p><p class=\"line-break\"><br/></p><p>Commenting on the availability of the Okta Identity Cloud and its products in the AWS Marketplace, Velchamy Sankarlingam, President of Product and Engineering, Zoom Video Communications, Inc. said, \"Zoom has always strived to bring teams together in a frictionless and secure video environment, and it's our ability to innovate that has enabled us to grow. Working with AWS and Okta helped us to deliver on our strategic technology initiatives to meet this goal. We look forward to tighter integrations and a more robust cooperation that ultimately makes it faster, easier, and more productive for us to digitally transform.\"</p><p class=\"line-break\"><br/></p><p>Okta is an AWS Advanced Technology Partner that has achieved the AWS Security Competency, AWS Government Competency, and AWS Digital Workplace Competency designations.</p><p class=\"line-break\"><br/></p><p>To learn more about Okta in AWS Marketplace, visit: <a href=\"https://aws.amazon.com/marketplace/pp/B08NM2CCL2\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://aws.amazon.com/marketplace/pp/B08NM2CCL2</a></p><p class=\"line-break\"><br/></p><p>About Okta</p><p class=\"line-break\"><br/></p><p>Okta is the leading independent identity provider. The Okta Identity Cloud enables organizations to securely connect the right people to the right technologies at the right time. With more than 7,000 pre-built integrations to applications and infrastructure providers, Okta provides simple and secure access to people and organizations everywhere, giving them the confidence to reach their full potential. More than 13,050 organizations, including JetBlue, Nordstrom, Siemens, Slack, Takeda, Teach for America, and Twilio, trust Okta to help protect the identities of their workforces and customers.</p><p class=\"line-break\"><br/></p><p>#Okta</p><p class=\"line-break\"><br/></p><p class=\"line-break\"><br/></p><p class=\"line-break\"><br/></p><p class=\"line-break\"><br/></p><p>Source: Okta</p><p class=\"line-break\"><br/></p><p class=\"line-break\"><br/></p><p class=\"line-break\"><br/></p><p>Copyright 2021 ACN Newswire . All rights reserved.</p></div>"}