{"date": "2022-01-20 22:18:17.582000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3125.98, "close": 2852.86}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon is taking another step into the physical retail space.</p><p>The tech giant announced Thursday that it is adding its first in-person clothing store dubbed \"Amazon Style\" to its lineup, joining its cashierless convenience locations, grocery and book stores.</p></div><div class=\"tr-npp-body\"><p>The first apparel store, which will sell women and men's clothes, shoes and accessories, is set to open \"later this year\" in The Americana at Brand, a Los Angeles shopping complex in Glendale, California, Simoina Vasen, Amazon Style managing director, told USA TODAY.</p><p>\"We believe our unique store design, our advanced technology and thoughtful curation will make it easier than ever for customers to have an inspiring, convenient, enjoyable and ultimately successful shopping experience,\" Vasen said.</p><p><span><span>►Oscar Mayer bologna masks?:</span> Oscar Mayer bologna-inspired skin care mask sells out on Amazon, but could be restocked</span> </p><p><span><span>►Amazon deals:</span> Updated daily: Here are the 10 best Amazon deals today in January 2022</span> </p><p>Last August, the Wall Street Journal was the first to report that Amazon was looking at opening several large stores that were 30,000 square feet and similar to department stores, which are typically around 100,000 square feet.  </p><p>Neil Saunders, managing director of research firm GlobalData, said other retailers should worry about Amazon's new store because if successful it would give the company \"a presence in malls and locations where traditional retailers have reigned supreme.\"</p><p>\"With its new venture, Amazon will be testing whether it can widen its customer base, carve out more of a name for itself in fashion, and learn more about shopper behavior,\" Saunders said in a statement. \"Like most things Amazon does, this is an experiment and may, or may not be, one that is rolled out on a national basis.\"</p><p class=\"tr-npp-section-title\">Amazon app key to shopping at Amazon Style</p><p>Vasen called the 30,000-square-foot store \"an entirely reimagined shopping experience\" and said that customers will notice a few differences when they walk through the front door.</p><p>The store displays one of each item \"so we've taken all of the size and color variations and we put them in our back of house,\" Vasen said. \"This allows us to offer more selection without requiring customers to sift through racks to find the right color, size and fit.\"</p><p>This allows the store to carry more styles, she said, adding there's also a physical lookbook of styles curated by top influencers.</p><p>As shoppers walk through the store, they use the Amazon shopping app to scan an item's QR code and can add the item to a physical fitting room to try on or directly to the pickup counter, Vasen said.</p><p>When the fitting room is ready, shoppers will get a notification on the app and the app is then the key to opening the room. </p><p>Shoppers can request additional items from a fitting room touchscreen which are then placed in the room's closet. \"It's like a magic closet with seemingly endless selection,\" Vasen said.</p><p>For shoppers who decide not to make a purchase during the in-store shopping trip, they'll be able to see what they tried on later.</p><p><span><span>►Government COVID tests:</span> Free COVID test kits website officially launches Wednesday. How to order free at-home tests.</span> </p><p><span><span>►Save better, spend better:  </span> Money tips and advice delivered right to your inbox. Sign up here</span> </p><p><span>Follow USA TODAY reporter Kelly Tyko on Twitter:  <a href=\"https://twitter.com/KellyTyko\">@KellyTyko.  <span>For shopping news, tips and deals, join us on our Shopping Ninjas Facebook group. </span> </a> </span> </p><p><span>This article originally appeared on USA TODAY: Amazon to open its first in-person clothing store. What we know about the new Amazon Style.</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}