{"date": "2022-02-09 04:01:15.704000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>A plan to temporarily dismantle a recently restored historic bridge in the heart of <a href=\"https://www.independent.co.uk/topic/dutch\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Dutch</a> port city <a href=\"https://www.independent.co.uk/topic/rotterdam\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Rotterdam</a> so that a huge yacht, reportedly being built for <a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> founder <a href=\"https://www.independent.co.uk/topic/jeff-bezos\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Jeff Bezos</a> can get to the <a href=\"https://www.independent.co.uk/topic/north-sea\" data-type=\"url\" class=\"tr-link\" translate=\"no\">North Sea</a> is unlikely to be plain sailing.</p><p>Reports this week that the city had already agreed to take apart the Koningshaven Bridge, known locally as De Hef, sparked anger with one Facebook event set up calling for people to pelt the multimillion dollar yacht with rotten eggs.</p></div><div class=\"tr-npp-body\"><p>However, a spokeswoman for Mayor Ahmed Aboutaleb told The Associated Press on Friday that while a request has been submitted by a shipbuilder for the bridge to temporarily be taken apart over the summer, no permit has yet been sought or granted.</p><p>\"I think it's easy to understand why it's so controversial because this is a very beautiful, recently restored old bridge,\" said Rotterdam resident Lizette Touber. \"It really is our heritage. And I think that if the rich can pay for it to be opened, which normally nobody else could do, then you get controversy.\"</p><p>In a written statement, Aboutaleb, who is on a visit to Colombia, said that once a request for a permit is submitted it will be assessed based on factors including economic impact, environmental nuisance and possible risks to the \"monumental structure\" of the bridge.</p><p>\"When the permit has been applied for, the municipality can make a decision about this, details can be further elaborated and a plan can be made in the event of a positive decision,\" the statement said.</p><p>The municipality declined to comment on who owns the yacht in question or identify the shipbuilder. An email sent to Amazon seeking comment went unanswered.</p><p>The current Hef railway bridge was opened for trains to cross the Maas River in 1927 and taken out of service in 1993 when it was replaced by a tunnel. Public protests spared it from demolition and it eventually underwent a three-year renovation that ended in 2017. The middle section of the bridge can be raised to allow ships to pass underneath, but apparently not high enough for the new yacht's masts.</p><p>Ton Wesselink, chairman of a Rotterdam historical society, feared that a decision to allow one yacht through the bridge could set a precedent for others.</p><p>\"The thing we don't want is that this yacht issue will open the possibility for shipbuilders to use it the same way,\" he said in an email to AP.</p><p>But there were voices of support for the proposal.</p><p>\"I think it's fine. Let Bezos pay a high price. It creates work. I only see upsides,\" said Rotterdam resident Ria van den Vousten.</p><p>\"If it is paid for and everybody makes some money, don't complain. Don't talk, but act, as we say in Rotterdam,\" she added.</p><p>____</p><p>Corder reported from The Hague.</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/news/world/europe/rotterdam-jeff-bezos-superyacht-bridge-b2007572.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Rotterdam mayor says 'no request' to dismantle bridge for Bezos' yacht</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/jeff-bezos-yacht-bridge-netherlands-b2007262.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Historic Dutch bridge to be dismantled for Jeff Bezos' giant superyacht</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/jon-stewart-jeff-bezos-obama-revolution-b2000416.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Jon Stewart told Bezos his vision for future was a 'recipe for revolution'</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/amazon-law-washington-personnel-file-b1995720.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The drone worker taking on Amazon's secretive management system</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/us-politics/romney-cheney-kinzinger-capitol-riot-b2007839.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">'Shame': Romney calls out GOP censure of Cheney and Kinzinger for Jan 6 investigation</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/us-politics/oklahoma-bill-religion-rob-standridge-b2007505.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Oklahoma bill to fine teachers $10k for contradicting religion</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 Independent, The (UK) (Online). All rights reserved.</p></div>"}