{"date": "2021-11-14 07:12:05+00:00", "ticker": "AVV", "mrkt_info": {"open": 3359.0, "close": 3361.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>Dubai, United Arab Emirates - AVEVA, a global leader in industrial software, driving digital transformation and sustainability, announced that AITS (Advanced Integrated Tech Solution), a provider of innovative technologies for the fourth industrial revolution, has become an AVEVA Select partner for the Gulf region, under a new name ‘AVEVA Select Gulf’. Being an AVEVA Select partner allows AITS to deliver AVEVA's full portfolio of leading-edge industrial software solutions to regional customers that will help them become more sustainable and profitable.</p>\n<p>As AVEVA’s partner for the Gulf region, AITS has won major contracts across industries over the past four years. These include successful implementations for the Utilities sector as well as deploying Unified Operations Center, AVEVA’s command-and-control solution for operators, for Water Wastewater, Roads Management, Oil and Gas operations and Smart City projects in the region.</p>\n<p>The coveted ‘AVEVA Select Partner’ designation allows distributors to enable customers simplify design, optimize production, and maximize performance. By leveraging the breadth of the AVEVA software portfolio, AVEVA Select partners can take advantage of programs designed to suit every product and solution specialization in the engineering and industrial segments. The AVEVA Select Program offers an effective way for partners to penetrate new markets and build upon existing solutions and local relationships.</p>\n<p>The AVEVA Select partnership has accelerated the value that AVEVA Select Gulf can provide, empowering their customers and partners to optimize engineering, operations, and asset performance. A common digital thread across all enterprise pillars is enabling a new level of Performance Intelligence using bedrock technologies from Artificial Intelligence (AI), Industrial Internet of Things (IIoT), big data to the cloud and hybrid solutions. </p>\n<p>As an authorized AVEVA Select partner, AVEVA Select Gulf can leverage AVEVA’s comprehensive software portfolio, enabling them to help organizations accelerate their digital transformation journeys. With AVEVA’s Engineering solutions, they can assist customers in efficiently delivering capital projects on time and within budget. The AVEVA Operations suite eliminates supply chain value leaks while improving operational efficiency and enhancing collaboration. AVEVA Select Gulf can also empower customers and partners to balance operating expenses and risk to optimize performance with AVEVA Asset Performance Management.</p>\n<p>“AITS customers and partners will continue to get the same premium support, with an impressive added value of wider access to AVEVA’s complete portfolio, which assures a new level of Performance Intelligence using technologies such as AI, IIoT, big data and cloud. The AVEVA Select program helps our distributors to optimize on opportunities and to support their customers in digital transition,” said Georges Millet, EMEA Partners Vice President, AVEVA. “We are pleased to welcome AITS to the AVEVA Select family and look forward to developing and capitalizing on mutually beneficial growth strategies.”</p>\n<p>“The current transformation in the GCC is taking place on the digital, social and economic fronts with leaders of all six counties focusing on the promotion of creativity, youthful innovation and sustainable economic growth.  This transformation is underpinned by technological developments in cloud computing, AI and enterprise software solutions. At AVEVA Select Gulf, we believe in the created opportunities and are excited to offer AVEVA solutions to our customers and partners,” concluded Abdallah Abdallah, Managing Director, AVEVA Select Gulf.</p>\n<p>-Ends-<strong> </strong></p>\n<p><strong>About AVEVA Select</strong></p>\n<p><span>The AVEVA Select program is designed for partners with full access to AVEVA’s comprehensive software portfolio, enabling them to help companies accelerate their digital transformation journey. AVEVA Select aligns to both market and technology trends, with programs designed to suit every product and solution specialization in the engineering and industrial segments. By leveraging the breadth of the AVEVA software portfolio, AVEVA Select partners can now help customers simplify design, optimize production, and maximize performance. More at <a href=\"https://www.aveva.com/en/about/partners/aveva-select/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.aveva.com/en/about/partners/aveva-select/</a> </span><strong> </strong></p>\n<p><strong>About AITS</strong></p>\n<p><span>AITS provides innovative technologies for the fourth industrial revolution. With the goals of increased productivity, performance, quality, and energy efficiency, industries are evolving. AITS’s advanced industrial automation and digital factory solutions integrate the four levels of automation while ensuring the absolute availability of those systems. More at: <a href=\"https://aitsmena.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://aitsmena.com/</a> </span></p>\n<p><strong>About AVEVA</strong></p>\n<p><span>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence.  AVEVA’s comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries. Learn more at <a href=\"http://www.aveva.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.aveva.com</a>. </span></p>\n<p><span>Copyright © 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</span></p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}