{"date": "2021-11-05 06:33:07+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3384.0, "close": 3518.99}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Nov 5 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Polish e-commerce group Allegro <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ALEP.WA\" data-type=\"ric\" data-ric=\"ALEP.WA\" translate=\"no\" dir=\"ltr\">ALEP.WA</a> has agreed to buy Czech online retailer Mall Group for 881 million euros ($1.02 billion) to create a regional platform in what would be its first significant international deal.</p><p>Allegro said late Thursday that it would acquire e-commerce assets of Mall Group and the logistics assets of WE|DO from Jakub Havrlant's Rockaway Capital investment group, PPF Group, and Daniel Kretinsky's and Patrik Tkac's EC Investments.</p><p>Operating across the Czech Republic, Slovakia, Hungary, Slovenia, Croatia and Poland, the merged company will gain wider access to an addressable retail market of 70 million people worth 1.14 trillion zlotys, Allegro said.</p><p>\"Buyers will benefit from the improved selection, price, and convenience, while a joint base of around 135,000 merchants will be able to 'list once, sell everywhere',\" Allegro Chief Executive Officer François Nuyts said in a statement.</p><p>Allegro's dominant position in Poland is being put to test following the entrance of online retail group Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and Sea Ltd's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SE.N\" data-type=\"ric\" data-ric=\"SE.N\" translate=\"no\" dir=\"ltr\">SE.N</a> Shopee this year.</p><p>The Polish company, which has started deliveries to its own network of parcel lockers, said the deal will also give it access to WE|DO's cross-border fulfilment and last-mile logistics infrastructure.</p><p>The acquired business reported gross merchandise value (GMV), a widely watched figure for the e-commerce industry's performance, of 4.3 billion zlotys in the fiscal year ended March, versus Allegro's GMV of 10.4 billion zlotys in the second quarter.</p><p>The final price might be increased by up to 50 million euros based on specific short-term objectives and the deal is expected to close in the second half of 2022. </p><p>The deal will be financed through a stock-and-cash consideration, Allegro said.</p><p><br/></p><p>     ($1 = 0.8655 euros)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Anna Pruchnicka in Gdansk; Editing by Sherry Jacob-Phillips)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:anna.pruchnicka@thomsonreuters.com\" data-type=\"email\" translate=\"no\">anna.pruchnicka@thomsonreuters.com</a> ; +48 58 769 65 14; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: MALL GROUP-M&amp;A/ALLEGRO</p></div>"}