{"date": "2022-01-13 15:10:59.542000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3307.24, "close": 3224.28}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>HEALTHY EXTRACTS INC (\"HYEX-0\")\n- Appoints J. Scott Landers as Executive Vice President of Sales and\n- Marketing\n\n     Healthy Extracts Inc., a leading innovator of clinically proven\nplant-based products for heart and brain health, has appointed J. Scott\nLanders to the new position of executive vice president of sales and\nmarketing.\n\n     Landers brings to Healthy Extracts more than two decades of senior\nexecutive experience where he has led the successful launch and revenue\ngrowth of new product and service offerings for KPMG, IBM, DISH Network,\nCenturyLink, NEC and other industry leaders.\n\n     \"I'm excited to join Healthy Extracts at this pivotal stage in its\ngrowth and development, as demonstrated by its strong ramp up in sales over\nthe last year,\" stated Landers. \"The company's expanding portfolio of\nnaturally formulated, clinically-backed supplements are uniquely capable of\ndelivering heart and brain benefits, which has become increasingly\nimportant to consumers in today's post-COVID world.\"\n\n     \"I see tremendous opportunities for further expanding Healthy\nExtracts' distribution channels and product offerings, and accelerating\ngrowth across the board,\" added Landers.\n\n     Landers most recently served as managing director of Jaybird Group, a\nleading web and app developer for major enterprises and brands. At Jaybird,\nhe helped build a $2 million software development business from the ground\nup using Agile Marketing methodologies and leading a team of full-stack\ndevelopers.\n\n     Prior to Jaybird, he served as managing director of Moonlight Media,\nan online marketing agency that focused on SEO, content and pay-per-click,\nwhere he was responsible for developing and implementing operational and\nmarketing strategies that helped drive annualized revenues from zero to\nover $8 million in less than a year. For Moonlight Media clients he\ndeveloped automated tools that analyzed ad inventory yields and optimized\nper inquiry ad placements, ultimately achieving an industry-leading yield\nof 40% above industry average.\n\n     Landers has also served as marketing director for DISH Network, and\nvice president of sales for Meridian Investment Management's ICON Funds.\n\n     He holds a Bachelor of Science in industrial management and computer\nscience from Purdue University, and an MBA in finance and financial\nmanagement services from the University of Denver. He began his career in\nthe U.S. Army, where he served five years as a helicopter pilot.\n\n     Duke Pitts, president of Healthy Extracts, commented: \"We expect\nScott's wealth of knowledge and experience, and his outstanding record of\nachievement with major brands, to drive our sales growth, expand sales\nchannels, and increase market reach. We see his contributions becoming\nespecially important as we continue to ramp our B2B distribution segment\nand grow our subscription-based direct-to-consumer offerings in 2022 with\nthe major products we introduced last year.\"\n\n     Healthy Extracts' Expanding Portfolio of Clinically Proven\nFormulations\n\n     July 2021: Launched Ultimate Brain Nutrients (UBN) ACTIVATE, a\nclinically proven proprietary formulation that naturally increases key\nbrain activity by as much as 46%.\n\n     August 2021: Introduced Ultimate Brain Nutrients RELIEF(TM), a\nproprietary, patent-pending natural formulation that provides relief from\nsymptoms associated with migraine headaches, as well as increases brain and\ncognitive activation.\n\n    October 2021: Rolled out two new high-potency natural formulations,\nOrganic Citrus Bergamot for Women and Organic Citrus Bergamot, available\ntoday only on Amazon.\n\n    December 2021: Introduced a line of brain, physical performance and\nwomen's hormone health products for Whitney Johns, the company's first\nmajor influencer under its recently launched brand influencer program.\n\n     To learn more about Healthy Extracts products, go to bergametna.com\nand tryubn.com.\n\n     About Healthy Extracts \"Live Life Young Again\"\n\n    Healthy Extracts Inc. is a platform for developing or acquiring\nscience-forward, clinically proven, plant-based proprietary products in\nselect high-growth categories within the multibillion-dollar nutraceuticals\nmarket.\n\n     The company's subsidiaries, BergametNA(TM) and Ultimate Brain\nNutrients(TM) (UBN), offer nutraceutical natural heart and brain health\nsupplements. This includes the only heart health supplement containing\nCitrus Bergamot SuperFruit(TM). This superfruit is known to have the\nhighest quality and concentration of polyphenols and flavonoids, and with\nhealthy heart benefits backed by more than 17 clinical studies.\n\n     UBN KETONOMICS(R) proprietary formulations have been clinically shown\nto improve brain health, including memory, cognition, focus and\nneuro-energy. UBN is pursuing intellectual property license opportunities\nfor monetizing its IP portfolio of multiple issued and pending patents.\n\n     For more information visit healthyextractsinc.com, bergametna.com or\ntryubn.com.\n\n     Forward-Looking Statements and Safe Harbor Notice\n\n     All statements other than statements of historical facts included in\nthis press release are \"forward-looking statements\" (as defined in the\nPrivate Securities Litigation Reform Act of 1995). Such forward-looking\nstatements include our expectations and those statements that use\nforward-looking words such as \"projected,\" \"expect,\" \"possibility\" and\n\"anticipate.\" The achievement or success of the matters covered by such\nforward-looking statements involve significant risks, uncertainties and\nassumptions. Actual results could differ materially from current\nprojections or implied results. Investors should read the risk factors set\nforth in the Company's Annual Report on Form 10-K filed with the SEC on\nFebruary 19, 2021, and future periodic reports filed with the SEC. All of\nthe Company's forward-looking statements are expressly qualified by all\nsuch risk factors and other cautionary statements.\n\n     The Company cautions that statements and assumptions made in this news\nrelease constitute forward-looking statements and make no guarantee of\nfuture performance. Forward-looking statements are based on estimates and\nopinions of management at the time statements are made. The information set\nforth herein speaks only as of the date hereof. The Company and its\nmanagement undertake no obligation to revise these statements following the\ndate of this news release.\n\n     Food and Drug Administration Disclosure\n\n     The products and formulations featured in this release are not for use\nby or sale to persons under the age of 12. These products should be used\nonly as directed on the label. Consult with a physician before use if you\nhave a serious medical condition or use prescription medications. A\ndoctor's advice should be sought before using these and any supplemental\ndietary product. These statements have not been evaluated by the FDA. These\nproduct and formulation are not intended to diagnose, treat, cure or\nprevent any disease.\n\n     BergametNA(TM), Ultimate Brain Nutrients(TM), UBN(TM), Citrus Bergamot\nSuperFruit(TM) and F4T(R) are registered trademarks of Healthy Extracts\nInc.(TM)\n\nHealthy Extracts Company Contact\nDuke Pitts, President\nHealthy Extracts Inc.\nTel (720) 463-1004\nEmail contact\n\nContact:Ronald Both or Justin Lumley\nCMA Investor &amp; Media Relations\nTel (949) 432-7566\nEmail contact\n\n     A photo accompanying this announcement is available at\n<a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/dc870545-fd5d-4c72-b71d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.globenewswire.com/NewsRoom/AttachmentNg/dc870545-fd5d-4c72-b71d</a>\n-f0b144c3141d\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201200676.MNPRE2201201905-06464920220113</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}