{"date": "2022-01-17 20:11:48.932000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>AMAZON COM INC (\"AMZN-Q\")\n- Kinetic GPO Selects Amazon Business to Provide Fast and\n- Efficient Shipping Services to Organizations Across Canada\n\n   Kinetic GPO, a cooperative purchasing organization that services\nCanadian public sector and nonprofit organizations, announced today it has\nentered into a three-year contract with Amazon Business Canada as of July\n1, 2021.\n\n   This agreement allows Kinetic GPO's members across Canada to experience\nfast, efficient and convenient shipping options on hundreds of millions of\nproducts across categories like office, IT, janitorial, food service and\nprofessional medical supplies. In addition, Amazon Business helps public\nentities achieve their goal of allocating more of their spending to small,\ndiverse and local sellers.\n\n   \"We're excited to be working with Kinetic GPO,\" said Nick Georgijev,\ncountry manager for Amazon Business Canada. \"Making online procurement\neasier for broader public sector customers of all sizes is among our top\npriorities and one we share with Kinetic GPO.\"\n\n   \"Amazon Business delivers the buying experience Kinetic GPO members\nwant, and we are pleased to provide a contract vehicle for this extensive\nnationwide online marketplace. Public entities and non-profits will be able\nto benefit from the product offering, convenience and value you expect from\nAmazon. Customers also have access to a variety of business-tailored\nfeatures and benefits, including a curated site experience, Business Prime,\nbusiness-only pricing and selection, single or multiuser business accounts,\napprovals workflow, purchasing system integrations, payment solutions, tax\nexemptions, dedicated customer support, and more. In essence, this contract\nwill help participating members manage their supply chain in a compliant\nand efficient manner,\" said Chris Penny, CEO of Kinetic GPO.\n\n   Kinetic GPO conducts procurement in a fair, open and transparent manner\ncompliant with the International and Regional Trade Agreements. A\nmembership is also free with no volume commitments.\n\n   About Kinetic GPO Kinetic GPO is a national broader public sector\ncollaborative purchasing organization, established in 2017, whose contracts\nhave been competitively bid in a fair, open, and transparent manner to\nvendors for commonly purchased products and services including, technology,\nfleet, office supplies, maintenance, HVAC, roofing, groundskeeping,\nplayground, operations, furniture, managed print services, and construction\nconsistent with the regional and national trade agreement requirements.\nEntities that must comply with regional and national trade agreements, such\nas municipalities, higher education, schools, healthcare, non-profit, and\nall other public sector entities, use Kinetic GPO contracts to increase\ntheir efficiency and economy when procuring goods and services. As a\nnational purchasing cooperative, Kinetic GPO leverages a large pool of\npurchasing potential and allows entities to receive a combined buying power\nregardless of the entity's size. For more information about Kinetic GPO or\nto become a member, please visit www.kineticgpo.ca.\n\n   About Amazon Business Amazon Business combines the selection,\nconvenience and value customers have come to know and love from Amazon,\nwith new features and unique benefits tailored to the needs of businesses.\nAmazon Business provides easy access to hundreds of millions of products\nand a variety of benefits, including business-only pricing and selection,\nsingle or multi user business accounts, Business Prime, approval workflow,\npurchasing system integrations, payment solutions, tax exemptions,\ndedicated customer support and more. Amazon Business is currently available\nfor the United States, Canada, United Kingdom, Germany, France, Italy,\nSpain, Japan and India. To register for a free Amazon Business account,\nvisit www.amazon.com/business.\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201600594.MNPRE2201601496-11422620220117</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}