{"date": "2022-01-26 20:55:22.630000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2799.72, "close": 2792.75}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>SEATTLE (AP) — Amazon will end its \"Sold by Amazon\" program after an investigation by Washington state's attorney general found it was anticompetitive and violated antitrust laws, according to court documents filed Wednesday.</p><p>The company engaged in unlawful price fixing and unreasonably restrained competition to maximize its own profits via the program that set a minimum price for certain third-party products sold on the platform, according to the lawsuit and consent decree filed in King County Superior Court in Seattle.</p></div><div class=\"tr-npp-body\"><p>The Seattle Times reported that as a result of the investigation, Amazon will shut down the program nationwide and pay $2.25 million to the attorney general's office, as well as provide annual updates on its compliance with antitrust laws.</p><p>The funds will go toward antitrust enforcement.</p><p>\"Sold by Amazon\" ran from 2018 to 2020 and the program didn't include all of the third-party sellers on the e-commerce platform. The company characterized it as a small program offering another tool to businesses.</p><p>Through the program, third-party sellers entered into an agreement with Amazon that set a minimum payment rate for products sold on the platform, according to the lawsuit. If the sales exceeded the agreed upon minimum, Amazon would take a cut of the additional revenue.</p><p>The Times said a spokesperson for Amazon that the newspaper did not name said the company believes the program was legal and good for consumers. Amazon acted as the retailer and purchased products from suppliers to fill customer orders, ensuring low prices for consumers.</p><p>But Washington Attorney General Bob Ferguson's investigation concluded the program boosted Amazon's sales and ensured it didn't have to compete with third-party sellers.</p><p>\"Consumers lose when corporate giants like Amazon fix prices to increase their profits,\" Ferguson said Wednesday.</p><p>Amazon in 2020 generated $80.5 billion in third-party seller services, according to market and consumer data firm Statista. Third-party sales account for more than 50% of all the sales on Amazon.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.</p></div>"}