{"date": "2022-01-19 07:11:29.554000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 9303YEast Imperial PLC19 January 2022</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>19 January 2022</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>East Imperial plc (the \"Company\")</span>\n</p>\n<p>\n<span>US Distribution Agreement</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>East Imperial, the global purveyor of ultra-premium beverages, is pleased to announce it has signed a long-term distribution agreement with Republic National Distributing Company <span>(RNDC),</span> one of the largest distributors in the US operating across 37 states.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Under the terms of the agreement, RNDC will commence distributing to the on-trade and off-trade markets from March 2022 across eight US states; California, Washington, Colorado, Arizona, Maryland, Illinois, Washington DC &amp; Florida. These states have been experiencing rapid growth in demand for premium mixers and represent an opportunity for East Imperial to achieve a step-change in the scale of the business across the US. RNDC already provides distribution for East Imperial's best-selling beverages in California, which has experienced strong sales growth.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Following the agreement with RNDC, the US is expected to make up an increasing and significant proportion of East Imperial's revenues. East Imperial is actively seeking a US-based third-party bottling provider in anticipation of the increased demand and to significantly improve the efficiency of operations. This is a strategic priority for the management team.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>While RNDC's distribution will focus on the on-trade and off-trade market, East Imperial will continue to provide a direct-to-consumer offer in the US through Amazon Marketplace as part of a multi-channel strategy. East Imperial's canned product range became available on Amazon in November last year and has seen strong demand throughout the US.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Tony Burt, Founder and CEO, said:</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\"This US distribution agreement is a huge milestone for East Imperial. RNDC is the second-largest distributor in the US and our partnership with them will transform our presence in this major market. The global trend towards premiumisation is rapid and the US is driving that demand. We have a great opportunity now to capture a huge slice of this valuable market and I'm confident we can achieve that and deliver a step-change in the scale of our business as a result.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Enquiries:</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>MHP Communications</span>\n</p>\n<p>\n<span>Peter Hewer +44 (0) 770 9326 261</span>\n</p>\n<p>\n<span>Rachel Mann +44 (0) 758 5301 464</span>\n</p>\n<p>\n<span>\n<a href=\"mailto:eastimperial@mhpc.com\" data-type=\"email\" translate=\"no\">eastimperial@mhpc.com</a>\n</span>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>AGRBKCBNABKKCDD</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}