{"date": "2022-01-20 14:49:17.128000+00:00", "ticker": "AVV", "mrkt_info": {"open": 2930.0, "close": 3058.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SCHNEIDER ELECTRIC SA (\"SBGSF-0\")\n- Introduces Infrastructure of the Future\n\n   Schneider Electric, the leader in the digital transformation of energy\nmanagement and automation, is introducing Infrastructure of the Future, an\nintegrated solutions suite tailored to creating smart, green\ninfrastructure.\n\n   Infrastructure of the Future is a powerful holistic approach to power\ntomorrow's businesses and economies while tackling the challenges of\nongoing global urbanization and the causes and impacts of climate change.\nIts integrated solutions encompass software for data-driven insights,\nservices for enhanced operations and business continuity, solutions for\nelectric mobility and green technologies and programs to accelerate the\nenergy transition.\n\n   The need for green infrastructure\n\n   \"Resilient infrastructure is a key enabler of productivity and economic\ndevelopment. However, climate change and rapid growth in urbanization have\nmade it even more crucial for governments, municipalities, public\ninfrastructure owners, energy networks, and transport providers to make\nwell-planned investments in smarter, greener solutions to support economic\ngrowth,\" said Frederic Godemel, Executive Vice President for Power Systems\nand Services at Schneider Electric.\n\n   \"In a time of climate change, intensifying natural disasters and rapid\nurbanization, infrastructure systems are under immense pressure to deliver\nresilient and reliable services. With urban environments also relying\nheavily on infrastructure's ability to handle electrification of public\ntransport, we need a green revolution in infrastructure to keep energy\nflowing, transport moving and protect business and society against climate\nchange,\" he added.\n\n   The rising number of extreme weather events around the world is a\nleading cause of disruption to power, water and transport infrastructure.\nThis disruption takes a $300 billion toll on businesses every year.\nMoreover, with more than six billion people projected to be living in urban\nareas by 2050, demand for resilient, low carbon infrastructure is rising.\nCities will need to handle mass adoption of electric vehicles (EVs),\nelectrified public transport and smart buildings supplied with reliable and\nrenewable sources of energy and new microgrid technologies.\n\n   The expansion of population and growth in demand for energy will also\nlead to fluctuating demands and the development of energy \"prosumers\" with\nself-generated power sources. This will put further stress on aging energy\ninfrastructure, which will need to be more efficient and resilient to stay\nahead of the energy transition.\n\n   Data-driven Infrastructure of the Future\n\n   Uniquely tailored for urban infrastructure, Infrastructure of the Future\ncomprises a set of open and interoperable software solutions that help\ninfrastructure owners bridge progress and sustainability for all,\nincluding:\n//st\n\n* EcoStruxure(TM) for E-mobility: an end-to-end connected solution that\n  goes beyond EV chargers that is easy to install, maintains buildings'\n  power reliability and provides a convenient experience for EV drivers.\n* ETAP Train Power Simulation - eTraX(TM): validated, user-friendly and\n  flexible software tools for designing, analyzing and managing AC and DC\n  railway infrastructure by ETAP (part of Schneider agnostic software\n  portfolio).\n* AVEVA Unified Operations Centre: a central hub solution for\n  infrastructure operators that transforms the control room into a\n  collaborative workspace.\n* EcoStruxure(TM) Energy and Sustainability Services: energy and\n  sustainability expertise to help companies turn energy into a\n  controllable spend, increase efficiency and meet sustainability goals.\n* EcoStruxure(TM) Microgrid Advisor: a cloud-based, demand-side energy\n  management software platform that allows users to collect, forecast, and\n  automatically optimize the operation of distributed energy resources\n  using predictive algorithms.\n\n//et\n\n   What's more, Schneider's award-winning SF6-free pure air MV technology\nprovides a way to make infrastructure projects more sustainable. With an\ninnovative combination of shunt vacuum interruption(SVI)(TM) and pure air\ninsulation, MV switchgear such as SM AirSeT(TM) or RM AirSeT(TM) MV are\ngreen and digital alternatives to traditional technology and replace SF6\ngreenhouse gas with pure air. SM AirSeT MV switchgear has been integral to\nprojects such as a renewed medium-voltage electrical distribution system\nfor electric bus depots in Milan, Italy.\n\n   These capabilities are all part of Schneider Electric's end-to-end\nintegrated portfolio of software and services that help governments, cities\nand companies involved in public and private infrastructure projects to\nmake them smarter, greener and more efficient to support future demand and\nhelp address and combat the challenges posed by climate change.\n\n   About Schneider Electric\n\n   Schneider's purpose is to empower all to make the most of our energy and\nresources, bridging progress and sustainability for all. We call this Life\nIs On.\n\n   Our mission is to be your digital partner for Sustainability and\nEfficiency.\n\n   We drive digital transformation by integrating world-leading process and\nenergy technologies, endpoint to cloud connecting products, controls,\nsoftware and services, across the entire lifecycle, enabling integrated\ncompany management, for homes, buildings, data centers, infrastructure and\nindustries.\n\n   We are the most local of global companies. We are advocates of open\nstandards and partnership ecosystems that are passionate about our shared\nMeaningful Purpose, Inclusive and Empowered values.\n\nRachel Hawkins, [email protected],\n+44 (0)20 7802 2602\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201900415.MNPRE2201901740-06461720220120</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}