{"date": "2021-11-05 14:16:46.906000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3384.0, "close": 3518.99}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 5437RLeverage Shares PLC05 November 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>\n</span></p>\n<p>\n<span>Leverage Shares plc</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>5 November 2021</span>\n</p>\n<p>\n<span>THIS NOTICE IS IMPORTANT AND REQUIRES THE IMMEDIATE ATTENTION OF THE HOLDERS OF THE ETP SECURITIES. IF ANY ETP SECURITYHOLDER IS IN ANY DOUBT AS TO THE ACTION THEY SHOULD TAKE, THEY SHOULD CONSULT THEIR OWN INDEPENDENT PROFESSIONAL ADVISERS IMMEDIATELY</span>\n</p>\n<p>\n<span>If you have recently sold or otherwise transferred your entire holding(s) of ETP Securities referred to below, you should immediately forward this notice to the purchaser or transferee or to the stockbroker, bank or other agent through whom the sale or transfer was effected for transmission to the purchaser or transferee.</span>\n</p>\n<p>\n<span>Notice to ETP Securityholders of the following series of ETP Securities issued by Leverage Shares plc (the \"Issuer\")</span>\n</p>\n<p>\n<span>Leverage Shares 2x Alphabet ETP Securities (ISIN: IE00BF01VY89) Leverage Shares 2x Amazon ETP Securities ( <span>ISIN: IE00BF03XH11)</span> Leverage Shares 2x Apple ETP Securities ( <span>ISIN: IE00BF03XJ35)</span> Leverage Shares 2x Citigroup ETP Securities ( <span>ISIN: IE00BF03XL56)</span> Leverage Shares 2x Facebook ETP Securities ( <span>ISIN: IE00BF03XP94)</span> Leverage Shares 2x Goldman Sachs ETP Securities ( <span>ISIN: IE00BF03XR19)</span> Leverage Shares 2x JPMorgan ETP Securities ( <span>ISIN: IE00BF03XW61)</span> Leverage Shares 2x Microsoft ETP Securities ( <span>ISIN: IE00BF03XY85)</span> Leverage Shares 2x Netflix ETP Securities ( <span>ISIN: IE00BD09ZW40)</span> Leverage Shares 2x NVIDIA ETP Securities ( <span>ISIN: IE00BD09ZX56)</span> Leverage Shares 2x Salesforce.com ETP Securities ( <span>ISIN: IE00BD09ZY63)</span> Leverage Shares 2x Visa ETP Securities ( <span>ISIN: IE00BD09ZV33)</span> (the \"Relevant Series\")</span>\n</p>\n<p>\n<span>Capitalised terms used, but not defined, in this notice shall have the meaning given thereto in the Notice to ETP Securityholders dated 27 September 2021, attached as Schedule 1 hereto.</span>\n</p>\n<p>\n<span>The Issuer hereby notifies the ETP Securityholders of the Relevant Series that the Change of Portfolio Administrator and Change of Margin Account Agreement will occur on 15 November 2021.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Certain amendments may be required to the terms and conditions of the Relevant Series to take account of the Change of Portfolio Administrator and Change of Margin Account Agreement. Details of such amendments will be notified to ETP Securityholders of the Relevant Series in due course.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>If you have any queries arising from this notice, please contact us at</span>\n<span>\n<a href=\"mailto:info@leverageshares.com\" data-type=\"email\" translate=\"no\">info@leverageshares.com</a>\n</span>\n<span>.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Yours sincerely</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The Directors</span>\n</p>\n<p>\n<span>Leverage Shares plc</span>\n</p>\n<p>\n<span>SCHEDULE 1</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Leverage Shares plc</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>27 September 2021</span>\n</p>\n<p>\n<span>THIS NOTICE IS IMPORTANT AND REQUIRES THE IMMEDIATE ATTENTION OF THE HOLDERS OF THE ETP SECURITIES. IF ANY ETP SECURITYHOLDER IS IN ANY DOUBT AS TO THE ACTION THEY SHOULD TAKE, THEY SHOULD CONSULT THEIR OWN INDEPENDENT PROFESSIONAL ADVISERS IMMEDIATELY</span>\n</p>\n<p>\n<span>If you have recently sold or otherwise transferred your entire holding(s) of ETP Securities referred to below, you should immediately forward this notice to the purchaser or transferee or to the stockbroker, bank or other agent through whom the sale or transfer was effected for transmission to the purchaser or transferee.</span>\n</p>\n<p>\n<span>Notice to ETP Securityholders of the following series of ETP Securities issued by Leverage Shares plc (the \"Issuer\")</span>\n</p>\n<p>\n<span>Leverage Shares 2x Alphabet ETP Securities (ISIN: IE00BF01VY89) Leverage Shares 2x Amazon ETP Securities ( <span>ISIN: IE00BF03XH11)</span> Leverage Shares 2x Apple ETP Securities ( <span>ISIN: IE00BF03XJ35)</span> Leverage Shares 2x Citigroup ETP Securities ( <span>ISIN: IE00BF03XL56)</span> Leverage Shares 2x Facebook ETP Securities ( <span>ISIN: IE00BF03XP94)</span> Leverage Shares 2x Goldman Sachs ETP Securities ( <span>ISIN: IE00BF03XR19)</span> Leverage Shares 2x JPMorgan ETP Securities ( <span>ISIN: IE00BF03XW61)</span> Leverage Shares 2x Microsoft ETP Securities ( <span>ISIN: IE00BF03XY85)</span> Leverage Shares 2x Netflix ETP Securities ( <span>ISIN: IE00BD09ZW40)</span> Leverage Shares 2x NVIDIA ETP Securities ( <span>ISIN: IE00BD09ZX56)</span> Leverage Shares 2x Salesforce.com ETP Securities ( <span>ISIN: IE00BD09ZY63)</span> Leverage Shares 2x Visa ETP Securities ( <span>ISIN: IE00BD09ZV33)</span> (the \"Relevant Series\")</span>\n</p>\n<p>\n<span>Capitalised terms used, but not defined, in this notice shall have the meaning given thereto in the Amended and Restated Master Definitions Schedule dated 18 December 2020 in relation to the Issuer's collateralised exchange traded securities programme (the \" <span>Programme</span> \").</span>\n</p>\n<p>\n<span>The Issuer hereby gives notice that on 16 <span>th</span> September 2021 the Issuer issued a notice of termination to Interactive Brokers (UK) Limited (\" <span>IB UK</span> \"), Interactive Brokers LLC (\"I <span>B LLC</span> \") and the Trustee with respect to the First Portfolio Administration Agreement. IB UK will be replaced as portfolio administrator with respect to the Relevant Series by GWM Limited. GWM Limited is currently appointed as portfolio administrator with respect all other Series of ETP Securities issued by the Issuer under the Programme. The appointment of GWM Limited as portfolio administrator with respect to the Relevant Series will be governed by the terms of an amended and restated portfolio administration agreement, originally dated 5 February 2020 and as amended and restated on 6 November 2020, entered into between the Issuer, the Trustee and GWM Limited (the \" <span>GWM Portfolio Administration Agreement</span> \").</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Additional information in relation to the GWM Portfolio Administration Agreement can be found on pages 151-152 of the Base Prospectus of the Issuer dated 18 December 2020 (the \" <span>Base Prospectus</span> \") and information in relation to GWM Limited can be found on pages 174-175 of the Base Prospectus.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The Base Prospectus is available on the website of the Issuer</span>\n<span>\n<a href=\"http://www.leverageshares.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.leverageshares.com</a>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>(the \" <span>Change of Portfolio Administrator</span> \").</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>As a consequence of the termination of the appointment of Interactive Brokers (UK) Limited as portfolio administrator with respect to the Relevant Series, the First Margin Account Agreement, pursuant to which IB LLC was appointed as custodian and margin loan provider with respect to the Relevant Series will also be terminated. Post termination of the First Margin Account Agreement, the Margin Accounts with respect to the Relevant Series will continue to be held with IB LLC, however the terms of the Margin Accounts will be governed by the terms of the margin account entered into between the Issuer and IB LLC on 16 March 2020 (the \" <span>Second Margin Account Agreement</span> \").</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Additional information in relation to the Second Margin Account Agreement can be found on pages 23-24 and page 149 of the Base Prospectus.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>(the \" <span>Change of Margin Account Agreement</span> \").</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>ETP Securityholders of the Relevant Series will be notified of the specific dates upon which the Change of Portfolio Administrator and the Change of Margin Account Agreement will occur.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Certain amendments may be required to the terms and conditions of the Relevant Series to take account of the Change of Portfolio Administrator and Change of Margin Account Agreement. Details of such amendments will be notified to ETP Securityholders of the Relevant Series.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>ETP Securityholders of the Relevant Series who do not agree with the Change of Portfolio Administrator and / or Change of Margin Account Agreement may sell their ETP Securities in advance of the changes becoming effective through trading on the stock exchanges on which they are admitted to trading.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>If you have any queries arising from this notice, please contact us at</span>\n<span>\n<a href=\"mailto:info@leverageshares.com\" data-type=\"email\" translate=\"no\">info@leverageshares.com</a>\n</span>\n<span>.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Yours sincerely</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The Directors</span>\n</p>\n<p>\n<span>Leverage Shares plc</span>\n</p>\n<p>\n<span>\n<span>\n<a href=\"http://www.rns-pdf.londonstockexchange.com/rns/5437R_1-2021-11-5.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.rns-pdf.londonstockexchange.com/rns/5437R_1-2021-11-5.pdf</a>\n</span>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>MSCMZMGMDKFGMZM</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}