{"date": "2021-11-03 09:45:54.987000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Bengaluru (Karnataka) [India], November 3 (ANI/PRNewswire): Rapyder Cloud Solutions Pvt. Ltd. (Rapyder) announced that it has won the AWS Consulting Partner of the Year 2021 (India) award at the Amazon Web Services (AWS) Partner Summit Online in India.</p><p>Bengaluru (Karnataka) [India], November 3 (ANI/PRNewswire): Rapyder Cloud Solutions Pvt. Ltd. (Rapyder) announced that it has won the AWS Consulting Partner of the Year 2021 (India) award at the Amazon Web Services (AWS) Partner Summit Online in India.</p></div><div class=\"tr-npp-body\"><p>The AWS Consulting Partner of the Year award recognizes AWS Partners who play a key role in helping their customers drive innovation and digital transformation of their businesses through creative and optimum use of their IT infrastructure with impactful solutions built on AWS.</p><p>The AWS Partner Awards recognize a wide range of born-in-the-cloud and traditional consulting and independent software vendor (ISV) partners whose business models have embraced specialization and collaboration.</p><p>Rapyder is an AWS Advanced Consulting Partner which is all-in on AWS, offering end-to-end cloud solutions across industry verticals.</p><p>Rapyder's service offering includes applications and infrastructure migrations to the cloud, consulting and architecture services, DevOps, and Managed Services. With a focus on strengthening its technical capabilities, Rapyder has achieved two AWS Competencies, the AWS DevOps Competency and AWS Microsoft Workloads Competency. Rapyder also participates in seven AWS Service Delivery Programs and five AWS Partner Programs.</p><p>An established player in the cloud-tech space in India, Rapyder has proven capabilities and offerings in AWS cloud migration, adoption and optimization for business relating to security, assessment, pinpoint, business continuity and many more.</p><p>Rapyder enables its customers across education, healthcare, retail, manufacturing, financial services, and other industry verticals to accelerate their cloud journeys effectively and quickly.</p><p>Speaking about the achievement, Amit Gupta, founder and CEO of Rapyder, said, \"It is an honor to receive the AWS Consulting Partner of the Year 2021 Award for India. It speaks a lot about how fast and far we have come in just four and half years of our journey. This achievement further strengthens our collaboration with the AWS Partner Network (APN) and encourages us to further transform enterprises on the cloud. It's still Day One at Rapyder and we are looking to continue our momentum.\"</p><p>This story is provided by PRNewswire. ANI will not be responsible in any way for the content of this article. (ANI/PRNewswire)</p><p>Copyright © 2021 aninews.in All rights reserved. Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SyndiGate. All Rights Reserved.</p></div>"}