{"date": "2021-12-01 11:45:14.310000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon shareholders might have cause to thank America's National Labour Relations Board. They mightn't see it that way after the board ordered a fresh union ballot at the company's facility in the now internationally famous town of Bessemer, Alabama. But the ruling could actually be of benefit to them.</p><p>The company pulled out all the stops in its attempt to frustrate the unionisation drive there, a drive which drew favourable comment from president Joe Biden – who urged workers to \"make your voice heard\" – as well as other prominent Democrats and even the odd Republican.</p></div><div class=\"tr-npp-body\"><p>Amazon was ultimately successful. The bid was soundly defeated with less than 30 per cent voting in favour. But the tactics used to achieve that result generated considerable controversy and led the Retail, Wholesale and Department Store Union to launch its successful challenge.</p><p>The union alleged \"illegal misconduct\" and said the decision \"confirms what we were saying all along – Amazon's intimidation and interference prevented workers from having a fair say in whether they wanted a union in their workplace\".</p><p>Ohio senator Sherrod Brown, a notably pro-labour Democrat, went so far as to accuse the company of \"dirty tricks\".</p><p>Needless to say, Amazon said it disagreed with the decision.</p><p>But whether it agreed or not, that decision says the company crossed a line, a line which will be watched very closely next time around. As it should be.</p><p>The value to shareholders is simple: Amazon has become a frighteningly powerful entity. It can get in politicians' ears. It can influence public opinion. It can, and does, employ people to keep watch on employees' activities.</p><p>It was arrogant enough to think it could get away with driving a steamroller over a democratic process.</p><p>In such arrogance can lie the doom of even the most powerful of corporations. When it takes hold, customer service gets slack, managers start to rest on the laurels of easy bonuses, workers get fed up, companies start to ossify. It mightn't feel like Amazon could ever end up like that, but the same would probably have once been said of the formerly iconic General Electric, which is now splitting itself into three separate units after years of under-performance.</p><p>So, yes, the group's shareholders could emerge as winners from this ruling. But the group's put-upon employees will win bigger still if this leads to a fairer fight and if it ultimately forces the company to address the persistent issues that have been raised about the conditions at its vast fulfilment centres.</p><p>They have produced a steady stream of negative stories about the treatment of workers, focusing on their working conditions, the health risks they have potentially faced during Covid and the productivity targets they are set.</p><p>Amazon has sought to fight back, issuing denials, running ads designed to humanise its operations, even offering tours. But it hasn't been able to shake off the bad publicity.</p><p>In this country, the GMB once again raised the issue of ambulance callouts to the company's UK warehouses in the run-up to the Black Friday shopping event, making deft use of freedom of information requests to ambulance services.</p><p>National officer Mick Rix told me the ruling offered \"hope for workers elsewhere ... This shows that it doesn't matter how much money and power you think you have, you still have to abide by norms of behaviour.\"</p><p>He said he was encouraged by the response to the union's Black Friday campaign and said that his union's efforts in this country are starting to bear fruit. Good.</p><p>Amazon has always maintained that it favours direct contact between its workers and their managers over dealing with unions. But if that was working as it should, these stories would die a death. That shows no sign of happening as the company squares up for the battle of Bessemer round 2.</p><p>The US union challenging it still looks like a long shot but it has delivered a powerful left jab, leaving the company with a bloody nose, and it looks fighting fit as the bell rings ahead of the crucial second round.</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/independentpremium/business/amazon-visa-mastercard-retail-payment-fees-b1959395.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon kicking out Visa credit cards over charges: A case of Thanos v Magneto?</a> </p><p><a href=\"https://www.independent.co.uk/independentpremium/business/masks-covid-omicron-rules-economy-b1966262.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Mask mandates are back now omicron is here but they should never have been dropped</a> </p><p><a href=\"https://www.independent.co.uk/independentpremium/business/brexit-staff-shortage-hospitality-b1964917.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Customer experiences are crashing in the post-Brexit hospitality world</a> </p><p><a href=\"https://www.independent.co.uk/independentpremium/business/masks-covid-omicron-rules-economy-b1966262.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Mask mandates are back now omicron is here but they should never have been dropped</a> </p><p><a href=\"https://www.independent.co.uk/independentpremium/business/brexit-staff-shortage-hospitality-b1964917.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Customer experiences are crashing in the post-Brexit hospitality world</a> </p><p><a href=\"https://www.independent.co.uk/independentpremium/business/fca-wants-to-empower-staff-to-take-on-miscreants-but-will-they-b1965022.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">FCA wants staff to take on rogues. Will they when Sunak wants lighter touch?</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Independent, The (UK) (Online). All rights reserved.</p></div>"}