{"date": "2022-01-06 14:34:44.870000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3350.44, "close": 3265.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Jan. 6 -- One small step for Future Group, a giant leap backward for India's business credibility: that is the upshot of a Delhi High Court ruling stopping the ongoing arbitration, of a dispute between Amazon and the Future Group over the sale of Future Retail to Mukesh Ambani's organized retail business, by the Singapore International Arbitration Centre.</p><p>This is the second time a division bench of the Delhi High Court has overturned a single-bench order allowing the arbitration to proceed. On the previous occasion, an Amazon appeal to the Supreme Court had restarted the arbitration.</p></div><div class=\"tr-npp-body\"><p>It is important to not miss the wood for the trees in the ongoing case, in which Future Group wants to wriggle out of an agreement it entered into with Amazon to seek its approval for selling Future Retail to a third party. Future wants to sell the retail operation to Reliance Retail Ventures.</p><p>Future has been using the courts and the Competition Commission of India (CCI) to get its way. The Sangh-Parivar-leaning Confederation of All India Traders (CAIT) has also been mobilized to lobby against Amazon, and CAIT petitioned the CCI to foil Amazon's attempt to block the deal.</p><p>In 2019, the competition regulator had given its approval to Amazon buying a 49% stake in Future Coupons Ltd, a holding company for Future Retail. Now, the Commission has had second thoughts on its approval. The unstated subtext would appear to be that if Amazon were to control Future, which operates Big Bazaar, there would be violation of competition, but if Reliance were to buy Future, competition would not be vitiated.</p><p>Can Amazon control Future at all, given restrictions on foreign direct investment in multi-brand retail? If it cannot, why should it play dog-in-the-manger vis-a-vis Reliance Retail? True, Amazon cannot directly own Future, but nothing prevents ownership being structured in such a way that the majority stake in Future is held by multiple companies in which Amazon has large minority stakes and majority stakes are held by wholly Indian entities that are happy to serve as passive investors who allow Amazon to exercise control.</p><p>The larger public good lies in retail industry turning efficient and the Indian economy attracting ever larger dollops of investment, foreign as well as domestic, not in one corporate group trumping another corporate group. Corporate rivalry is good, to the extent it leads to competition that lowers prices for end consumers, but bad if it subverts institutional integrity and the country's credibility in the eyes of global investors.</p><p>The specific provisions of the agreement between Amazon and Future matter, for the courts and the arbitrators. But from the point of view of the Indian economy's attractiveness as a business destination, what matters is the big picture. The big picture is that the government of India has put in place regulatory restrictions on foreign Big Retail, while allowing domestic Big Retail to do as it pleases.</p><p>That is at the level of policy. Then, there is the working of India's institutions, the courts and regulators such as CCI. What the conduct of the Commission and the courts tell foreign observers of the Indian economy is that India's institutions can be used to put obstacles in the path of foreign companies in India, whatever their actual level of compliance with policy and the law.</p><p>Big Retail's market share is hardly 15% of the total retail trade, as of now, even if it could rise fast. So, the rise of Big Retail, whether foreign-owned or domestic, cannot harm the consumer. Rather, it can only benefit the consumer, with economies of scale and innovations in logistics that eliminate layers of intermediation and cost.</p><p>So, the use of the courts and regulators such as CCI in a dispute between foreign and domestic Big Retail is not about consumer interest, but about corporate interests. It does not add to India's reputation as a market economy where foreign companies are treated on par with domestic ones, once entry conditions are met, if domestic institutions can be used to hinder foreign companies when these conflict with the interests of domestic companies. For things to appear fair, globally respected international arbitration, such as by the Singapore International Arbitration Centre, must be seen to work, instead of being thwarted by legal and regulatory spanners being thrown into the arbitration machinery's wheels.</p><p>The Supreme Court should allow the arbitration to continue and both sides to the dispute must accept the arbitration award. That will go some distance towards restoring India's credibility as an economy that is run by laws and rules. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}