{"date": "2022-02-17 10:36:03.166000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3130.21, "close": 3093.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>India</p></div><div class=\"tr-npp-lead\"><p>India, Feb. 17 -- Are you new to makeup? Are you keen on learning a new skill? Are you an amateur dabbling with new products in the market? Are you a veteran with a keen eye for details? Well, whatever be your background in makeup, you would know that a contour stick, cream or powder is a vital item to always have in your makeup box.</p><p>To those who are new to makeup, here's why: A contour stick or powder is so designed to make your face look different from what it normally does. The purpose is to enhance or change the shape of your face with makeup. Usually, it is used to make the face look leaner than it normally does.</p></div><div class=\"tr-npp-body\"><p>A makeup contour comes in the form of powder, cream and as a roll-on stick. For this article, we have considered sticks.</p><p>Now if we have convinced you to give it a shot, then online e-commerce platform Amazon would be a good place to begin looking for it.1) StarStruck Contour Stick for Women | Deep Brown</p><p>This contour is available in dark brown as well as light brown colours and comes in a matte finish. This contour has been formulated using Jojoba oil, Castor oil and Shea butter. While its principle function is to give a shape to your face, it also moisturizes and nourishes your face. It is suitable for all skin types and is perfect to structure your face. This richly pigmented stick is designed to give buildable coverage (which means one can add an additional layer without making the coat of makeup look cakey) and blends easily into the skin. There is no need for touch ups. It is non-greasy but creamy enough to glide easily on the skin.</p><p>2) Wet n Wild Megaglo Dual (Contour), Ended Contour Stick</p><p>This dual ended contour stick can be used for defining and highlighting the face. Because it is a stick, it is easy to carry around and easily fits into a vanity bag. It does not crease or look cakey and hence gives that perfect look. This multipurpose stick is also free of the following - paraben, sulfate, and gluten.3) Insight Cosmetics Duo Stick Conceal Contour + Highlighter</p><p>As the name suggests, this stick works both as a contour and as a highlighter. The good news is that it can also be used as a concealer too. It comes in a creamy texture which blends effortlessly into the skin and gives a streak-free finish. You can use the darker shade to contour and the lighter shade to highlight your features. You can easily blend it using your fingers or with a brush/sponge. It can be carried along while travelling too.</p><p>4) Blue Heaven HD All In One Makeup Stick</p><p>This is a makeup item which can be effectively used to contour your face. It is water-proof and smudge-proof and lasts up to 12 hours. It is available in five other colours apart from cream. These include caramel, chocolate, honey, toffee and vanilla.At Hindustan Times, we help you stay up-to-date with latest trends and products. Hindustan Times has affiliate partnership, so we may get a part of the revenue when you make a purchase. Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}