{"date": "2022-01-21 19:38:17.270000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3033.35, "close": 2890.88}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>E-commerce retailer Amazon has launched its first-ever physical apparel store with the aim of offering a 'seamless' and 'personalised' shopping experience.</p><p>Named Amazon Style, the store will offer women's and men's apparel, shoes and other accessories from various brands.It is scheduled to open later this year at The Americana at Brand in Glendale, California.The store allows customers to scan an item's QR code to see its sizes, colours, overall customer ratings and other product details through the Amazon Shopping app.With one button press, they can add the item to a fitting room or send it directly to the pickup counter.The store also enables shoppers to continue their shopping from the fitting room.Amazon Style will also support Amazon One, which enables customers to make payments using palm recognition technology.Amazon Style managing director Simoina Vasen said: \"We're excited to introduce Amazon Style, our first-ever physical fashion store where customers can find a selection of women's and men's apparel, shoes and accessories.\"Amazon Style brings together the best of shopping on Amazon--great prices, selection and convenience--with an all-new in-store shopping experience built to inspire.\"Customers can browse brands they know and love while also discovering new and emerging designers across hundreds of top brands throughout the store.\"Using the Amazon Shopping app, customers can send items to a fitting room, where they can use a touchscreen to browse more options, rate items and request more sizes or styles that are delivered directly to their room within minutes.\"In October last year, Amazon expanded its physical presence in the UK by opening its first 4-star retail outlet at the Bluewater shopping mall near Dartford, Kent.The 4-star store concept exclusively sells products that are rated four or more stars, top sellers and new and trending products on Amazon's website.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}