{"date": "2021-05-05 06:32:30+00:00", "ticker": "AVV", "mrkt_info": {"open": 3330.0, "close": 3317.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Dubai, UAE</strong>– AVEVA, a global leader in industrial software, driving digital transformation and sustainability, has signed a memorandum of understanding (MoU) with engineering, procurement and construction (EPC) contractor Tecnimont, a subsidiary of the Maire Tecnimont Group, a leader in the global natural resource processing industry, to create new digital predictive and prescriptive maintenance services that drive enhanced business outcomes.</p>\n<p>This partnership will extend usage of AVEVA’s Asset Performance Management (APM) solutions across the Maire Tecnimont Group, globally, enhancing plant operability and lowering maintenance costs. This will in turn deliver increased information availability empowering better, more informed decision-making, and ultimately improving overall business performance. As part of the agreement, the two companies will work together over a twelve-month period on a defined number of customer projects to promote the application of predictive maintenance technology for critical plant assets.</p>\n<p> “Digital transformation is one of the technology drivers most needed to give our industry a much-needed boost. This MoU with AVEVA aligns seamlessly with Maire Tecnimont’s strategy for digital transformation: it complements our value proposition which focuses on NextPlant, our new digital services and solutions portfolio that has been designed to fully meet customer’s needs, while simultaneously improving our operational model through the creation of digital enablers,” commented Pierroberto Folgiero, CEO Maire Tecnimont Group.</p>\n<p>“AVEVA’s Asset Performance Management suite is well positioned to advance industrial operations of the future. By enabling companies to predict failures before they occur, we are helping to reduce unplanned downtime as well as drive efficiency and safety throughout plant operations. We are excited about the partnership with Maire Tecnimont and look forward to supporting our joint customers in overcoming today’s industrial challenges by leveraging human experience with artificial intelligence.” commented Kim Custeau, Vice President, Asset Performance Management, AVEVA.</p>\n<p>As an EPC contractor and global leader in the transformation of natural resources, Maire Tecnimont will leverage its unique process, automation, and maintenance competencies to supply plant owners with perfectly customized digital products and solutions that are tailor-made for their maintenance needs. The combination of Maire Tecnimont’s proven market experience and AVEVA’s leadership as an industrial technology provider will deliver improved analytics which in turn will help to reduce inefficiencies, optimize operations, and improve our customer’s profitability. With this MoU, Maire Tecnimont Group has reached a new milestone in its digital transformation journey, with the activation of a new technology-enabled value stream which is a crucial part of its roadmap. To achieve its drive to become the ‘contractor of the future’, Maire Tecnimont is enhancing overall value for plant owners through a suite of advanced digital products and services geared towards EPC customers.</p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}