{"date": "2021-11-09 22:37:39.295000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Mindy Kaling's Amazon Handmade Holiday Collection is finally here! The line includes great gifts, like a cheese board, vase and candles—all made by artisans.</p><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p></div><div class=\"tr-npp-body\"><p>Whether you know her as Kelly Kapoor from \"The Office\" or Dr. Mindy Lahiri from \"The Mindy Project,\" if you're a Mindy Kaling fan, you're in luck. The famously hilarious actress just released a new collection on Amazon Handmade—just in time for prime holiday shopping season.</p><p>The curated collection includes a wide variety of must-have gifts, all made by six artisans from around the world. Some of the pieces are even co-designed by Mindy herself. \"I'm super passionate about supporting small businesses, so I'm very excited for you to shop our unique items and help these brands grow,\" she said. </p><p>Want to shop the Mindy Kaling Amazon Handmade Holiday Collection for yourself? Here's everything you need to know, including our top picks.</p><p><span><span>Tackle your holiday shopping</span> with deals and expert advice delivered straight to your phone. Sign up for text message alerts from the deal-hunting team at Reviewed.</span> </p><p class=\"tr-npp-section-title\">What to buy from Mindy Kaling's Amazon Handmade Holiday Collection</p><p>Mindy's new Amazon Handmade Holiday Collection consist of 23 giftable handcrafted products ranging in price from $16 to $80. For her, you can snag an elegant leather jewelry holder or a minimalist ring holder. For him, consider a monogrammed leather toiletry bag. And for your friends, parents or coworkers—or anyone else, really—on your list, a classy ceramic cake stand, deliciously scented candles or gorgeous maple and mahogany cheese board make for wonderful presents this season.</p><ul class=\"bulleted-list arrowlist\"><li><span>Get the Honeycomb Studio Minimalist Ceramic Ring Holder from Amazon for $16</span> </li><li><span>Get the Sweetwater Decor Candle from Amazon for $20</span> </li><li><span>Get the Specialty Wood Designs Small Multi Wood Cutting Board from Amazon for $27.95</span> </li><li><span>Get the Northwind Leather Jewelry Tray from Amazon for $38.50</span> </li><li><span>Get the Northwind Leather Personalized Dopp Kit from Amazon for $42.50</span> </li><li><span>Get the Specialty Wood Designs Large Ambrosia Maple Wood Cutting Board from Amazon for $48.99</span> </li><li><span>Get the Honeycomb Studio White and Gold Ceramic Cake Stand from Amazon for $80</span> </li> </ul><p>Note that given Mindy's celebrity status, these pieces may sell out so you'll want to scoop them up quickly if you see something you like.</p><p class=\"tr-npp-section-title\">Shop the Mindy Kaling Amazon Handmade Holiday Collection</p><p><span><span>Don't get thwarted by shipping delays or sold-out favorites this holiday season.</span>  Sign up for our free weekly newsletter and get the product reviews, deals and holiday gift guides you need to start shopping now.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Mindy Kaling just released a holiday collection on Amazon—here's what to buy</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}