{"date": "2021-11-04 09:18:39.027000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Oct 29, 2021</p></div><div class=\"tr-npp-lead\"><p><span>Amazon.com</span><a href=\"https://www.zacks.com/stock/quote/AMZN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AMZN</a> reported third-quarter 2021 earnings of $6.12 per share, missing the Zacks Consensus Estimate by 29.7%. The bottom line also declined 50.5% from the year-ago quarter and 59.5% from the previous quarter.Net sales of $110.81 billion rose 15% year over year but declined 2% sequentially. Notably, the figure was within the management's guidance of $106-$112 billion. However, it missed the Zacks Consensus Estimate of $111.83 billion.North America revenues (59% of sales) rose 10% from the year-ago quarter to $65.6 billion. International revenues (26% of sales) climbed 16% year over year to $29.1 billion. Amazon Web Services (\"AWS\") revenues (15% of sales) rose 39% year over year to $16.1 billion.Year-over-year revenues growth was driven by a solid AWS momentum.Strong momentum across Prime members remained another positive. The company witnessed strong growth in its subscription services in the reported quarter. Sales from the services went up 24% from the prior-year quarter to $8.15 billion.Strengthening relationships with third-party sellers remained a major positive. In the reported quarter, sales generated by third-party seller services rose 19% on a year-over-year basis to $24.2 billion.Strengthening smart device offerings continued to benefit the company's third-quarter performance. Favorable foreign exchange rates drove top-line growth further.However, sluggish growth in the company's e-commerce sales affected its third-quarter results. Online store sales rose 3% from the prior-year quarter to $49.9 billion in the reported quarter.Uncertainties related to the coronavirus pandemic, foreign exchange fluctuations, changing customer preferences, labor shortages in the market and supply-chain disruptions remain overhangs for the company.Amazon expects to incur huge expenses in the fourth quarter, owing to supply-chain constraints, labor supply shortages, and rising freight and shipping costs.Nevertheless, the company's strong global presence, growing Prime momentum, robust data center network and an increasing number of AWS regions, improving Alexa skills, expanding smart devices portfolio, and growing efforts toward gaining strong traction among small and medium businesses are likely to drive its near-term financial performance.</p></div><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">Amazon.com, Inc. Price, Consensus and EPS Surprise</p><p> </p><p> </p><p><a href=\"https://www.zacks.com/stock/chart/AMZN/price-consensus-eps-surprise-chart?icid=chart-AMZN-price-consensus-eps-surprise-chart\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. price-consensus-eps-surprise-chart</a> | <a href=\"https://www.zacks.com/stock/quote/AMZN?icid=chart-AMZN-price-consensus-eps-surprise-chart\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. Quote</a> </p><p class=\"tr-npp-section-title\">Expanding AWS Portfolio: A Key Catalyst</p><p>AWS, which witnessed strong top-line growth, continued to gain customer momentum in the third quarter, courtesy of its highly reliable services portfolio.In the third quarter, Amazon unveiled three capabilities for Amazon Connect, namely, Amazon Connect Wisdom, Amazon Connect Voice ID and automated outbound communications, which are well-equipped to aid contact centers in delivering better customer services.The company made its new capability in QuickSight called Amazon QuickSight Q and Amazon Managed Service for Prometheus generally available. Amazon made its new storage service called Amazon FSx for NetApp ONTAP generally available as well.It made its fully managed data visualization service called Amazon Managed Grafana generally available.The company announced the general availability of managed in-memory database — Amazon MemoryDB for Redis. Amazon MemoryDB is Redis-compatible, which helps in the storage of the entire datasets in memory.Coming to regions and Availability Zones, the company has 81 Availability Zones across 25 geographic regions. The company intends to roll out additional 24 Availability Zones and eight AWS regions.On the heels of the expanding services portfolio, regions and Availability Zones, AWS experienced strong growth in its clientele with the addition of Arctic Wolf Networks, which selected AWS as its primary cloud provider.Sun Life picked AWS as its long-term cloud technology provider. Sun Life will leverage analytics, ML, storage, security and databases to deliver an enhanced digital experience to customers.Further, Wyndham Hotels &amp; Resorts selected AWS as its preferred cloud provider.</p><p class=\"tr-npp-section-title\">Prime &amp; Retail Efforts</p><p>The company continued to make strong efforts toward bolstering its Prime program and retail business.It expanded its Same-Day Delivery service, allowing Prime members to receive their orders within five hours, to Atlanta, Baltimore, Charlotte, Chicago, Detroit, Houston, Miami, Minneapolis, and Tampa. Now, the service is available in 15 cities.The company rolled out automatic delivery features for Personal Shopper by Prime Try Before You Buy to strengthen its offerings in fashion retail.In addition to these, the global expansion of Prime remained noteworthy. Amazon made Prime available in Sweden and Poland in the third quarter.The company launched Amazon.eg in Egypt in order to strengthen its global e-commerce footprint.Apart from this, Amazon announced the introduction of Just Walk Out technology at two of its upcoming Whole Foods Market stores — one located in Washington, DC's Glover Park neighborhood, and another in Sherman Oaks, CA.Expanding original content and the overall content portfolio on Prime Video continued to accelerate Prime engagement.We note that Prime Video streamed a series named <span>The Lord of the Rings</span> and released the Amazon Original movie — <span>Cinderella</span> — in the third quarter. <span>Union of European Football Associations (UEFA) Champions League</span> soccer matches in Germany and Italy, and the first <span>Ligue 1</span> soccer matches in France were streamed on Prime Video.The company expanded its regional original content portfolio by debuting 28 local originals across Argentina, Australia, Brazil, Canada, France, Germany, India, Italy, Japan, Mexico, Spain, and the U.K.Apart from this, the increasing number of original podcasts on Amazon Music remained noteworthy.</p><p class=\"tr-npp-section-title\">Robust Smart Devices Portfolio</p><p>Amazon's expanding portfolio of Echo smart speakers remained beneficial. Notably, the company unveiled the Echo Show 15 in the third quarter.Apart from this, Amazon introduced Halo View, Halo Nutrition and Halo Fitness in a bid to expand its personal health monitoring efforts. Notably, the move expanded the company's Halo offerings.The company launched a home robot called Astro, which rolls around the house autonomously.Amazon unveiled the Echo Show 15 in a bid to expand its portfolio of smart speakers as well as smart displays.The company also unveiled an interactive device called Amazon Glow. Further, the company rolled out 'Hey, Disney!', a new kind of voice assistant, in collaboration with<span>Disney</span><a href=\"https://www.zacks.com/stock/quote/DIS\" data-type=\"url\" class=\"tr-link\" translate=\"no\">DIS</a> .Amazon introduced the first doorbell from Blink, namely Blink Video Doorbell, in a bid to expand its portfolio of smart home security products.Apart from these, advancing the skills and features of Alexa helped the company in winning deals in the reported quarter.</p><p class=\"tr-npp-section-title\">Quarter in Detail</p><p>Product sales (49.5% of sales) increased 3.9% year over year to $54.9 billion. Service sales (50.5% of sales) rose 28.9% from the year-ago quarter to $55.9 billion.Operating expenses were $105.9 billion, up 17.8% from the year-ago quarter. As a percentage of revenues, the figure expanded 200 basis points (bps) on a year-over-year basis to 95.6%.Cost of sales, fulfillment, technology &amp; content, marketing, and general &amp; administrative expenses increased 10.2%, 25.8%, 31%, 47.4% and 29.1% to $62.9 billion, $18.5 billion, $14.4 billion, $8.01 billion and $2.15 billion, respectively, on a year-over-year basis.Other operating income was $11 million in the reported quarter against $62 million of other operating expenses in the year-ago quarter.Overall operating income decreased 21.7% from the year-ago quarter to $4.9 billion. The operating margin contracted 250 bps from the year-ago quarter to 3.9%.Operating income for AWS was $4.9 billion, up 38% year over year. The same for North America declined 61% from the prior-year quarter to $880 million. The International segment generated an operating loss of $911 million against the operating income of $407 million in the prior-year quarter.</p><p class=\"tr-npp-section-title\">Balance Sheet &amp; Cash Flow</p><p>As of Sep 30, 2021, cash and cash equivalents were $29.9 billion, down from $40.4 billion as of Jun 30, 2021. Marketable securities totaled $49.04 billion at the end of the third quarter, down from $49.5 billion at the end of the second quarter.Long-term debt was $50.1 billion in the reported quarter compared with $50.3 billion in the previous quarter.The company generated $7.3 billion in cash from operation in the third quarter, which decreased from $12.7 billion in the prior quarter.On a trailing 12-month basis, free cash flow was $2.6 billion in the reported quarter, down from $12.1 billion in the prior quarter.</p><p class=\"tr-npp-section-title\">Guidance</p><p>For fourth-quarter 2021, Amazon expects net sales between $130 billion and $140 billion. The figure is anticipated to improve 4-12% on a year-over-year basis. The Zacks Consensus Estimate for net sales is pegged at $141.9 billion.Management projects an unfavorable foreign exchange impact of 60 bps.Income from operational activities is likely to be between $0 and $3 billion.</p><p class=\"tr-npp-section-title\">Zacks Rank &amp; Stocks to Consider</p><p>Currently, Amazon carries a Zacks Rank #4 (Sell).<span>AutoNation, Inc.</span><a href=\"https://www.zacks.com/stock/quote/AN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AN</a> and<span>Revolve Group, Inc.</span><a href=\"https://www.zacks.com/stock/quote/RVLV\" data-type=\"url\" class=\"tr-link\" translate=\"no\">RVLV</a> are some better-ranked stocks in the broader Retail-Wholesale sector. Both companies currently sport a Zacks Rank #1 (Strong Buy). You can see<span><a href=\"https://www.zacks.com/stocks/buy-list/?ADID=zp_1link&amp;ICID=zpi%20_1link\" data-type=\"url\" class=\"tr-link\" translate=\"no\">the complete list of today's Zacks #1 Rank stocks here</a> </span>.Long-term earnings growth rates for AutoNation and Revolve are pegged at 19.08% and 20.71%, respectively.</p><p><span>Tech IPOs With Massive Profit Potential:</span>Last years top IPOs surged as much as 299% within the first two months. With record amounts of cash flooding into IPOs and a record-setting stock market, this year could be even more lucrative. </p><p><a href=\"https://www.zacks.com/registration/ultimatetrader/welcome/eoffer/4e87?add=2116&amp;adid=NEWSTEX_CONTENT_ZU_IPOREPORT_2A_ANALYSTBLOG_210_10292021&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cearnings_article-1820145\" data-type=\"url\" class=\"tr-link\" translate=\"no\">See Zacks' Hottest Tech IPOs Now &gt;&gt;</a></p><p>Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.</p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=RPT_7BST_LP194&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_210&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cearnings_article-1820145\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Click to get this free report</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=AMZN&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_210&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cearnings_article-1820145\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. (AMZN): Free Stock Analysis Report</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=AN&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_210&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cearnings_article-1820145\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AutoNation, Inc. (AN): Free Stock Analysis Report</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=DIS&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_210&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cearnings_article-1820145\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Walt Disney Company (DIS): Free Stock Analysis Report</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZR_LINK&amp;d_alert=rd_final_rank&amp;t=RVLV&amp;ADID=NEWSTEX_CONTENT_ZR_ARTCAT_ANALYSTBLOG_210&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Cearnings_article-1820145\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Revolve Group, Inc. (RVLV): Free Stock Analysis Report</a></p><p> </p><p><a href=\"http://www.zacks.com/stock/news/1820145/amazon-amzn-q3-earnings-miss-estimates-sales-rise-y-y?cid=CS-NEWSTEX-FT-analyst_blog%7Cearnings_article-1820145\" data-type=\"url\" class=\"tr-link\" translate=\"no\">To read this article on Zacks.com click here.</a></p><p> </p><p><a href=\"http://www.zacks.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Zacks Investment Research</a></p><p>The views expressed in any and all content distributed by Newstex and its re-distributors (collectively, the \"Newstex Authoritative Content\") are solely those of the respective author(s) and not necessarily the views of Newstex or its re-distributors. Stories from such authors are provided \"AS IS,\" with no warranties, and confer no rights. The material and information provided in Newstex Authoritative Content are for general information only and should not, in any respect, be relied on as professional advice. Newstex Authoritative Content is not \"read and approved\" before it is posted. Accordingly, neither Newstex nor its re-distributors make any claims, promises or guarantees about the accuracy, completeness, or adequacy of the information contained therein or linked to from such content, nor do they take responsibility for any aspect of such content. The Newstex Authoritative Content shall be construed as author-based content and commentary. Accordingly, no warranties or other guarantees are offered as to the quality of the opinions, commentary or anything else appearing in such Newstex Authoritative Content. Newstex and its re-distributors expressly reserve the right to delete stories at its and their sole discretion.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Zacks Investment Research</p></div>"}