{"date": "2021-12-14 14:09:22+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n        How Alexa helped one stranded couple get help.\n      </div>\n                <div>\n                  <p>\n          As temperatures drop across the country, snowfalls and clear nights are creating wintry wonderlands that are sights to behold. However, if you decide to take a peek at these icy scenes, Oregon-based resident Rikke and her husband would kindly remind you to bring a jacket. Just before Thanksgiving of this year, Rikke and her husband decided they wanted to admire the starry landscape near their home-but then found themselves locked out in the snow. Thankfully, Alexa was nearby and ready to help.\n        </p>\n                  <p>\n          Read more about Rikke's story, in her own words:\n        </p>\n                  <p>\n                    <span>My husband and I had recently moved into a new home in Oregon, and one night as we were getting ready for bed, we thought we'd take a look at the stars. The stars are extremely clear here, so it's easy to enjoy them. We stepped out onto the third-story balcony and intended to take a quick peek, as it was below freezing outside. However, when we turned to go back inside, we realized our balcony door had latched and locked behind us.</span>\n                  </p>\n                  <p>\n                    <span>Immediately, I started panicking. There we were, standing in onesies, with no slippers and no phones. All we had was the one empty mug of tea we'd been drinking. I began yelling for help, and my husband tried to break down the glass door with his shoulder and our mug. We were so loud, but still, no one could hear us. Nothing was working. I looked down at the three-story drop to the ground and realized that if we tried to climb down, we would get seriously injured. We were stuck.</span>\n                  </p>\n                  <p>\n                    <span>We had been out in the cold for about half an hour, when one of our Echo devices from inside the house started playing a reminder for my usual nighttime routine. At our wits' end, I yelled out and told Alexa to stop-the last thing we needed in that moment was more noise! To my surprise, Alexa stopped. My husband and I then realized-Alexa could hear us through the door.</span>\n                  </p>\n                  <p>\n                    <span>I called out to Alexa again and got a response. In that moment, I felt the most indescribable sense of relief. I have never been so relieved to hear Alexa's voice before, just knowing that we weren't alone in this. We started asking Alexa to call our contacts, people we knew in the area, and then eventually people all over the country. We were just looking for anyone to pick up after midnight!</span>\n                  </p>\n                  <p>\n                    <span>Finally, a friend of ours picked up the call, and after he was done laughing, he was able to call our local sheriff who came by and saved us. Because my husband and I both love technology, we have smart devices all over the house, and it was easy to tell the sheriff how to help us back inside.</span>\n                  </p>\n                  <p>\n                    <span>It's a funny story now, but at the time I really thought we were stranded. I believed that night would end with one of us getting seriously injured. I was so grateful that we had the technology on hand to help us out when we needed it most.</span>\n                  </p>\n                  <p>\n          We are thankful to hear that Rikke and her husband are doing well, and that Alexa was able to assist them in their moment of need. <span><a href=\"https://www.amazon.com/alexa-drop-in-calling-intercom/b?ie=UTF8&amp;node=21393410011&amp;ref=_alxhb_tpnv_cmnc\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Learn more about Alexa's Communication features</a></span>, including Calling, Announcements, and Drop In, to explore how you can use Alexa to easily connect with your friends and family.\n        </p>\n                  <p>\n          If you have a story of your own about how you use Alexa, we'd love to hear it and will continue sharing some of our favorite #AlexaStories. You can <span><a href=\"mailto:alexastories@amazon.com\" data-type=\"email\" translate=\"no\">email us</a></span>or tag us on <span><a href=\"https://twitter.com/alexa99\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Twitter</a></span>@alexa99 or on <span><a href=\"https://www.instagram.com/alexa99/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Instagram</a></span>with #AlexaStories. Additionally, to learn more about how Alexa is helping people in different ways, you can watch Alexa Stories videos at <span><a href=\"https://www.amazon.com/alexa-stories/b?ie=UTF8&amp;node=23549517011\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/alexastories</a></span>.\n        </p>\n                </div>\n                <div>\n                  <div>\n          Related Tags\n        </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/devices\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Devices</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/alexa\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Alexa</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/alexa-stories\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Alexa Stories</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/amazon-echo\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Echo</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/customers\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Customers</a>\n                    </span>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/devices/ive-never-been-so-relieved-to-hear-alexas-voice\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>14 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>14 December 2021 14:09:22 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}