{"date": "2021-09-28 13:11:07.208000+00:00", "ticker": "III", "mrkt_info": {"open": 1275.0, "close": 1274.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENBRIDGE INC (\"ENB-TN\")\n- Hosts Inaugural ESG Forum Highlighting Industry Leading Performance\n\n     Enbridge Inc. (Enbridge or the Company) will host its ESG Forum\nwebcast highlighting the Company's industry leading approach to\nEnvironmental, Social, and Governance (ESG) practices.\n\n     \"Over the last two decades our leading environmental, social and\ngovernance practices have set the bar for energy delivery in North\nAmerica,\" commented Al Monaco, President and Chief Executive Officer at\nEnbridge. \"We're continuing to raise that bar by combining our conventional\nand renewable capabilities to create differentiated energy infrastructure\nsolutions that align with our goal of net-zero emissions by 2050.\"\n\n     \"Our recently announced acquisition of the Ingleside Energy Center\nexport terminal is a great example of how we're aligning our operations\nwith our emissions goals,\" added Mr. Monaco. \"We're committed to building\non-site solar self-power facilities, which will result in net-zero facility\nemissions and contribute to local scope three emissions reduction.\"\n\n     In 2020, the Company announced new goals to lower emissions, further\ndiversify its workforce and maintain the safety and reliability of its\nsystems. Enbridge's goals include:\n\n//st\n\n  * Net-zero GHG emissions by 2050, and an interim target to reduce GHG\nemissions intensity 35% by 2030;\n  * Increased representation of diverse groups within Enbridge's workforce\nand its Board of Directors by 2025, as well as new actions to enhance\nsupplier diversity; and,\n  * Transparent safety and reliability targets that drive towards the goal\nof zero incidents, injuries and occupational illnesses.\n\n//et\n\n     In 2021, the Company has continued to advance its ESG and energy\ntransition leadership position. Highlights of Enbridge's progress include:\n\n//st\n\n  * Linking of company-wide compensation to ESG goals and performance;\n  * Issued approximately $3 billion of financing linked directly to our ESG\ngoals;\n  * Indigenous workers on the Line 3 U.S. Replacement represented 7% of the\nworkforce;\n  * Completion of a third solar self-power facility, and four more are now\nunder construction;\n  * Sanctioned the 448MW Calvados offshore wind project in France,\nEnbridge's sixth offshore wind facility in Europe;\n  * Placed third renewable natural gas (RNG) project, the Dufferin RNG\nfacility, into service in Ontario.\n\n//et\n\n     Formation of New Energies Team\n\n     Over the last two decades, Enbridge has developed and built nearly $8\nBillion in renewable infrastructure in Canada, the United States and\nEurope. Today, the Company's full suite of development, construction and\noperating capabilities rival the largest renewable companies in North\nAmerica. The Company announced its Renewable Power division is expanding to\ninclude a dedicated and centralized New Energies team that will advance\nlow-carbon energy infrastructure opportunities across Enbridge's energy\ndelivery businesses. The team will leverage and build upon Enbridge's early\ninvestments in the areas of RNG, hydrogen, and carbon capture, utilization\nand sequestration (CCUS), as well as other low-carbon technologies.\n\n     Matthew Akman, Senior Vice President will expand his responsibilities\nof Corporate Strategy and Renewable Power to include New Energies.\n\n     \"The formation of our New Energies team further strengthens the\nexecution of our low-carbon strategies, advancing our differentiated energy\ndelivery capabilities and positioning us well for energy transition,\" said\nMr. Monaco.\n\n     New Partnerships to Develop North American Low Carbon Infrastructure\n\n     In combination with the creation of the New Energies team, we're\npleased to announce the following partnerships which will support\nEnbridge's strategies and ESG ambitions:\n\n     \"Today, Enbridge announced a memorandum of understanding (MoU) with\nShell to develop low-carbon energy solutions where synergies exist across\nboth company's North American businesses. Under the terms of the MoU,\nEnbridge and Shell will explore opportunities to leverage each other's\nassets and capabilities across the continent and develop a range of\ndecarbonization solutions that support the achievement of company-specific\nand customer emissions reduction goals. This will include both companies\ncollaborating on potential green and blue hydrogen production, renewable\npower generation where the parties bring unique strengths, and carbon\ncapture and sequestration opportunities, which at present excludes the\nAlberta market given various opportunities already under development. This\nagreement brings together two of the energy industry's ESG leaders and\nleverages complimentary assets and experience to drive innovative\nlow-carbon energy infrastructure and fuels.\"\n\n     Enbridge also announced a partnership with Vanguard Renewables, a\nleading U.S. developer of RNG infrastructure. Under the partnership,\nVanguard Renewables will initially build and operate up to 8 digesters in\nthe U.S. Northeast and Midwest capable of producing approximately 2\nBcf/year of RNG from food and farm waste, with Enbridge investing up to an\nestimated $100 million in RNG upgrading, transportation and marketing\nservices that leverage its extensive energy infrastructure assets and\ncapabilities. This partnership positions Enbridge as the partner of choice\nfor future Vanguard mixed-waste RNG development projects.\n\n     ESG Forum Details\n\n     Details of the webcast:\n\n//st\n\n                    When:      Tuesday, Sept. 28, 2021\n\n                               7:00 a.m. MT (9:00 a.m. ET)\n\n                    Webcast:   Link\n\n//et\n\n     The full presentation is posted on Enbridge's website in the 'Events\nand Presentations' section, with a webcast replay and event transcript\navailable shortly following the event.\n\n     FORWARD-LOOKING INFORMATION\n\n     Forward-looking information, or forward-looking statements, have been\nincluded in this news release to provide information about Enbridge Inc.\n(\"Enbridge\" or the \"Company\") and its subsidiaries and affiliates,\nincluding management's assessment of Enbridge and its subsidiaries' future\nplans and operations. This information may not be appropriate for other\npurposes. Forward-looking statements are typically identified by words such\nas \"anticipate\", \"expect\", \"project\", \"estimate\", \"forecast\", \"plan\",\n\"intend\", \"target\", \"believe\", \"likely\" and similar words suggesting future\noutcomes or statements regarding an outlook. Forward-looking information or\nstatements in this news release include statements with respect to energy\ntransition, including Enbridge's approach thereto; our environmental,\nsocial and governance (ESG) goals and targets, including those related to\ngreenhouse gas (GHG) emissions reductions, diversity and inclusion, and\nsafety and reliability; our plans to achieve our ESG goals and targets and\nto monitor and report our progress thereon; secured growth projects and\nfuture growth opportunities, including those relating to our new low carbon\ninfrastructure partnerships; project execution, including solar self-power\nfacilities; and the formation, purpose and plans of Enbridge's New Energies\nteam.\n\n     Although Enbridge believes these forward-looking statements are\nreasonable based on the information available on the date such statements\nare made and processes used to prepare the information, such statements are\nnot guarantees of future performance and readers are cautioned against\nplacing undue reliance on forward-looking statements. By their nature,\nthese statements involve a variety of assumptions, known and unknown risks\nand uncertainties and other factors, which may cause actual results, levels\nof activity and achievements to differ materially from those expressed or\nimplied by such statements. Material assumptions include assumptions about\nthe following: energy transition including the drivers and pace thereof;\nthe COVID-19 pandemic and the duration and impact thereof; the expected\nsupply of, demand for, and prices of crude oil, natural gas, natural gas\nliquids (NGL) and renewable energy; anticipated utilization of our existing\nassets; exchange rates; inflation; interest rates; operational reliability\nand performance; maintenance of support and regulatory approvals for\nprojects; anticipated in-service dates; changes in legislation, regulations\nor government policy applicable to our businesses; weather; litigation;\nimpact of capital project execution on the Company's future cash flows;\ncredit ratings; capital project funding; hedging program; financial\nstrength and flexibility; debt and equity market conditions, including the\nability to access capital markets on favorable terms or at all; cost of\ndebt and equity capital; economic and competitive conditions; changes in\ntax laws and tax rates; the development and performance of technology and\nnew energy efficient products, services and programs; and successful\ncollaboration with partners and others to advance ESG-related goals.\nAssumptions regarding the expected supply of and demand for crude oil,\nnatural gas, NGL and renewable energy, and the prices of these commodities,\nare material to and underlie all forward-looking statements, as they may\nimpact current and future levels of demand for the Company's services.\nSimilarly, energy transition, including the drivers and pace thereof, the\nCOVID-19 pandemic, exchange rates, inflation and interest rates impact the\neconomies and business environments in which the Company operates and may\nimpact levels of demand for the Company's services and cost of inputs, and\nare therefore inherent in all forward-looking statements. Due to the\ninterdependencies and correlation of these macroeconomic factors, the\nimpact of any one assumption on a forward-looking statement cannot be\ndetermined with certainty.\n\n     Enbridge's forward-looking statements are subject to risks and\nuncertainties, including, but not limited to those risks and uncertainties\ndiscussed in this news release and in the Company's other filings with\nCanadian and United States securities regulators. The impact of any one\nrisk, uncertainty or factor on a particular forward-looking statement is\nnot determinable with certainty as these are interdependent and Enbridge's\nfuture course of action depends on management's assessment of all\ninformation available at the relevant time. Except to the extent required\nby applicable law, Enbridge assumes no obligation to publicly update or\nrevise any forward-looking statements made in this news release or\notherwise, whether as a result of new information, future events or\notherwise. All subsequent forward-looking statements, whether written or\noral, attributable to Enbridge or persons acting on the Company's behalf,\nare expressly qualified in their entirety by these cautionary statements.\n\n     ABOUT ENBRIDGE INC.\n\n     Enbridge Inc. is a leading North American energy infrastructure\ncompany. We safely and reliably deliver the energy people need and want to\nfuel quality of life. Our core businesses include Liquids Pipelines, which\ntransports approximately 25 percent of the crude oil produced in North\nAmerica; Gas Transmission and Midstream, which transports approximately 20\npercent of the natural gas consumed in the U.S.; Gas Distribution and\nStorage, which serves approximately 3.8 million retail customers in Ontario\nand Quebec; and Renewable Power Generation, which generates approximately\n1,766 MW of net renewable power in North America and Europe. The Company's\ncommon shares trade on the Toronto and New York stock exchanges under the\nsymbol ENB. For more information, visit www.enbridge.com.\n\n//st\n\nFOR FURTHER INFORMATION PLEASE\nCONTACT:\n\nEnbridge Inc. - Media           Enbridge Inc. - Investment Community\n\nJesse Semko                     Jonathan Morgan\n\nToll Free: (888) 992-0997       Toll Free: (800) 481-2804\n\nEmail: media@enbridge.com       Email: investor.relations@enbridge.com\n\n//et\n\n     View original\ncontent:https://www.prnewswire.com/news-releases/enbridge-hosts-inaugural-e\nsg-forum-highlighting-industry-leading-performance-301386143.html\n\nTel   : 403-231-3900    ENBRIDGE INC\nFax   : 403-231-5929\nEmail : CorporateSecretary@enbridge.com\nWWW   : <a href=\"https://www.enbridge.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.enbridge.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2127000323.MNPRE2127001096-05280320210928</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}