{"date": "2022-02-17 14:05:54+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3130.21, "close": 3093.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n        A key pandemic pivot helped Keba and Rachel Konte revitalize their coffee business to reach new customers-and heights.\n      </div>\n                <div>\n                  <p>\n          Community is everything for the husband-and-wife team of Keba and Rachel Konte.\n        </p>\n                  <p>\n          Rachel, born and raised in Copenhagen, Denmark, moved to the United States in 1993. Four years later, she met her husband-to-be, Keba, a native of the San Francisco Bay Area. Since then, the two have built a life together, raising their two daughters and launching a business within the community.\n        </p>\n                  <p>\n          That business is <span><a href=\"https://www.amazon.com/stores/RedBayCoffee/Homepage/page/91D8DEA1-67EE-41F4-BBE0-57236AC68298\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Red Bay Coffee</a></span>. Coffee isn't just that morning pick-me-up for Keba and Rachel. Coffee represents opportunity-to take a moment to slow down and reflect, to participate in the coffee culture, and to gather energy for whatever comes next.\n        </p>\n                  <p>\n          \"Coffee is that moment in the morning when I get to reset,\" said Keba. \"I warm up that water, weigh out my coffee, grind it. [It's] my daily ritual.\"\n        </p>\n                  <p>\n          With that in mind, in 2014 the two founded Red Bay Coffee. The pair started the company in their home, and were able to build their business with the support of family and friends and an initial crowdfunding campaign. For Keba, as an African American, owning his own business and succeeding holds deep value.\n        </p>\n                  <p>\n          \"It gives you the opportunity to not only direct your life and your future and your destiny, but you're also able to have a positive impact on your community,\" Keba said.\n        </p>\n                  <p>\n          Driven by Keba and Rachel's unwavering leadership, Red Bay Coffee is now at the forefront of what they refer to as the \"fourth wave of coffee\"-a firm commitment to ensure our coffee is not only high-quality and sustainable, but a vehicle for diversity, inclusion, social and economic restoration, and entrepreneurship.\n        </p>\n                  <p>\n          \"We have made room for inclusion and diversity in the specialty coffee industry,\" Keba said. \"We ethically source, we roast it, and brew it. That's really our ethos: making specialty coffee more accessible to more people.\"\n        </p>\n                  <p>\n          Red Bay sources directly from countries with the unique combination of climate and elevation required for high-grade specialty coffees, and seeks to empower and support local growers' entry into specialty coffee.\n        </p>\n                  <p>\n          After quickly becoming a staple of the community with its tagline \"Beautiful Coffee to the People,\" Red Bay's brick-and-mortar presence grew beyond just being another neighborhood coffee joint. The brand's public roastery in Oakland became a community hub, hosting events such as food pop-ups, concert residencies, magazine releases, panel discussions, and self-care festivals. However, when COVID-19 struck in 2020, the community that Keba and Rachel cultivated was in jeopardy.\n        </p>\n                  <p>\n          \"A lot of businesses were devastated,\" Keba said. \"Ours was impacted heavily. We had to close down a lot of our shops. We had to reconnect with our customers in other ways. And the first and most direct pathway was through ecommerce.\"\n        </p>\n                  <p>\n          For many small businesses, ecommerce became a lifeline in the wake of the pandemic. Keba and Rachel saw the pandemic as an opportunity to reach their existing customers in new ways, while also leveraging their selling partnership with Amazon to enable a much broader audience to discover Red Bay Coffee.\n        </p>\n                  <p>\n          \"Amazon played an important role in that pivot when we had to reconnect with our customers,\" Keba said.\n        </p>\n                  <p>\n          Like many of Amazon's nearly 2 million selling partners, most of which are small and medium-sized businesses, Red Bay pivoted to online sales and thrived, growing nearly 100% year over year from 2020 to 2021. Red Bay recently joined Amazon's Black Business Accelerator, a $150 million commitment to help build sustainable diversity and growth for Black entrepreneurs by enabling their success as sellers in Amazon's store.\n        </p>\n                  <div>\n                    <div>\n                      <span>\n                        <a href=\"https://www.aboutamazon.com/news/small-business/becoming-her-own-boss-with-the-help-of-amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Becoming her own boss, with the help of Amazon</a>\n                      </span>\n                    </div>\n                    <div>\n            Angel Johnson's \"gym fashion\" faux pas turned into a fast-growing small business by selling in Amazon's store.\n          </div>\n                    <div>\n                      <span>\n                        <a href=\"https://www.aboutamazon.com/news/small-business/becoming-her-own-boss-with-the-help-of-amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read more</a>\n                      </span>\n                    </div>\n                  </div>\n                  <p>\n          Keba and Rachel aim to showcase their backgrounds and history through the brand's label and package design, while also drawing inspiration from the origin countries for each roast. Keba and Rachel are intentional about eliminating barriers and creating opportunities for people, including those who may need a second chance.\n        </p>\n                  <p>\n          \"I didn't know what to do with my life after incarceration. When I met Keba and Rachel, they put their trust in me, and welcomed me into their home, it felt like a new beginning,\" said Jessie Llarinas, coffee trainer and tech manager at Red Bay Coffee. \"My experience with Red Bay has helped me to grow and learn new things. Keba and Rachel believed in me and I am grateful to be where I am today.\"\n        </p>\n                  <p>\n          Currently, Red Bay employs almost 50 people, from baristas and roasters to quality control managers and marketing team members. Both Keba and Rachel take pride in having built a business that not only provides great coffee, but also opportunities for people from all walks of life, many of whom may have never considered a career in the coffee industry.\n        </p>\n                  <p>\n          \"As we grow our business in scale and geography, we look forward to folks paying a visit, taking pride, feeling welcome,\" Keba said. \"And if we do that, then we know we've done something right.\"\n        </p>\n                  <p>\n                    <span>\n                      <a href=\"http://www.amazon.com/buyblack\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Shop Red Bay Coffee</a>\n                    </span>and other Black-owned small businesses selling in Amazon's store.\n        </p>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/small-business/bringing-beautiful-coffee-to-the-people-by-selling-in-amazons-store\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>17 February 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>17 February 2022 14:05:54 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}