{"date": "2021-11-11 15:14:10.825000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3576.23, "close": 3472.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>CLEAN ENERGY FUELS CORP. (\"CLNE-Q\")\n- bp Broaden Joint Venture Focused on Renewable Natural Gas\n- Project Development Aimed at Delivering Lower Carbon\n- Intensity Fuels\n\n  Clean Energy Fuels Corp. and bp announced that its renewable natural gas\n(RNG) joint venture will build on previously announced plans to finance and\ndevelop new projects at dairy farms, starting in the Midwest.\n\n  Located in South Dakota and Iowa, the dairy farms, with more than 30,000\ncows, have the estimated potential to convert the methane produced from\nwaste into more than seven million gallons of RNG annually.\n\n  Agriculture accounts for nearly 10 percent of U.S. greenhouse gas (GHG)\nemissions, according to the U.S. Environmental Protection Agency. Capturing\nmethane from farm waste can lower these emissions. RNG is used as a\ntransportation fuel and has lower GHG emissions on lifecycle basis when\ncompared to conventional gasoline and diesel. The California Air Resources\nBoard has given similar projects a carbon intensity (CI) score of weighted\naverage of -320 compared to CI scores of 101 for conventional diesel fuel\nand 15 for electric batteries.\n\n  \"The demand for RNG is rapidly growing, highlighted by our recent\nannouncement to fuel a new fleet of Amazon heavy-duty trucks deploying\nacross the country,\" said Clay Corbus, senior vice president and co-head of\nrenewable fuels at Clean Energy. \"Our joint venture with bp to develop new\nsupplies is critical to keeping up with this demand. The RNG that is\nexpected to flow from these dairies to our fueling infrastructure will\nallow our customers to dramatically reduce their carbon emissions and turn\ntheir sustainability goals into reality.\"\n\n  Dynamic Holdings will oversee construction and develop and operate the\nfacilities following the execution of an agreement with the joint venture\nto execute multiple phases of dairy RNG projects.\n\n  With over 550 dispensing locations, Clean Energy has the largest network\nof RNG stations in the U.S. bp's world-class trading organization\ntransports RNG to California markets and monetizes the environmental\ncredits associated with dispensing the RNG.\n\n  \"These collaborations are critical steps toward our ambition of helping\nthe world reach net zero by 2050 or sooner,\" said Sean Reavis, bp biogas\norigination. \"Our biogas strategy is focused on growth and developing an\nintegrated business model that allows us to deliver the unique energy\nproducts the market is demanding.\"\n\n  The first RNG production facility is expected to be operational in 2022.\n\n  About bp\n\n  bp's ambition is to become a net zero company by 2050 or sooner, and to\nhelp the world get to net zero. bp is America's largest energy investor\nsince 2005, investing more than $130 billion in the economy and supporting\nabout 230,000 additional jobs through its business activities. For more\ninformation on bp in the US, visit www.bp.com/us.\n\n  About Clean Energy\n\n  Clean Energy Fuels Corp. is the country's largest provider of the\ncleanest fuel for the transportation market. Our mission is to decarbonize\ntransportation through the development and delivery of renewable natural\ngas (RNG), a sustainable fuel derived from organic waste. Clean Energy\nallows thousands of vehicles, from airport shuttles to city buses to waste\nand heavy-duty trucks, to reduce their amount of climate-harming greenhouse\ngas. We operate a vast network of fueling stations across the U.S. and\nCanada. Visit www.cleanenergyfuels.com and follow @CE_NatGas on Twitter.\n  About Dynamic\n\n  Dynamic was founded in 2011 and is a full-service company that provides\nleading edge waste recovery solutions for both the Agricultural and Food\nProcessing Industries. Three of its founding owners are involved with the\ndaily operations of the business. They are the driving force of the company\nby integrating Dynamic's technology and design into the following areas:\nlandfill diversion, anaerobic digestion, nutrient concentration, and water\ntreatment. Dynamic adds a unique value in the field by being experienced,\nand knowledgeable in the finance, design, development, operation, and\nmanagement of customized world-class infrastructure assets. These turnkey\nrenewable energy and clean water solutions dispose of organic waste to\nimpact the economy in environmentally friendly ways.\n\nClean Energy Contact:\nRaleigh Gerber\n949-437-1397\nraleigh@cleanenergyfuels.com\n\nTel   : 949-437-1000    CLEAN ENERGY FUELS CORP\nFax   : 949-724-1397\nEmail : investors@cleanenergyfuels.com\nWWW   : <a href=\"https://www.cleanenergyfuels.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.cleanenergyfuels.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2131400322.MNPRE2131401656-07125420211111</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}