{"date": "2021-11-29 22:11:24.280000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>INNERSCOPE HEARING TECHNOLOGIES INC (\"INND-0\")\n- Completes Acquisition of Hearing Assist\n\n     InnerScope Hearing Technologies Inc. (\"InnerScope\"), an emerging and\ndisruptive leader in the Direct-to-Consumer Hearing Technology space,\nannounced, effective as of Nov. 23, 2021, (the\" Date of Close\") it has\ncompleted the acquisition of Hearing Assist II, LLC. (\"HearingAssist\").\nHearingAssist is an established leader in the direct-to-consumer hearing\naid market with over 500,000 hearing aids sold and top-line revenues of\nmore than $72 Million since 2018 and is Walmart's largest hearing aid\nsupplier. HearingAssist has deployed product displays in 757 Walmart stores\nthroughout five states.\n\n     Transaction Details\n\n     The purchase price was a total of $10 million equivalent of\nInnerScope's restricted shares of common stock subject to a 24-month Leak\nOut Agreement. The restricted shares are split equally into two different\nfixed price per share amounts. The first $5 million shares are at a fixed\nprice of $0.0089 per share based on the terms of the Oct. 3, 2021, executed\nLOI. The second $5 million shares are at a fixed price of $0.17 per share,\nputting InnerScope's Market Cap exceeding $1 Billion. Additionally, the\nexecuted Leak Out Agreement restricts the shareholders to only covert and\nsell up to 25% of the total amount of the restricted shares at each 6-month\ninterval commencing on the Date of Close after the SEC Rule 144 6-month\nholding period.\n\n     As a result of the acquisition, HearingAssist will continue to operate\nunder Hearing Assist Direct, Inc., InnerScope's wholly owned subsidiary. In\naddition, InnerScope has retained the same management and operations team\nthat has made the brand so successful.\n\n     \"The HearingAssist team is very excited about this opportunity to join\nforces with InnerScope to become the number one global leader in the\ndirect-to-consumer hearing aid market,\" said Floyd Kuriloff, founder of\nHearing Assist II LLC. \"Combining the talents and experience of\nHearingAssist, with our deep marketing and distribution experience and\nInnerScope, with its decades of proven track record of retail hearing aid\nsales and hearing aid R&amp;D manufacturing, will create a powerful disruptive\ncompany in the global hearing device market.\"\n\n     The acquisition of HearingAssist will rapidly accelerate InnerScope's\nrevenue and growth strategy with immediate sales generated from the\nHearingAssist's hearing product kiosk displays located inside Walmart\nstores. InnerScope expects to report record sales revenues starting in the\nfourth quarter of 2021 and continuing quarterly after that. In addition,\nInnerScope and the HearingAssist management team have already begun an\naggressive marketing campaign for the holiday seasons building on\nHearingAssist's brand messaging as America's No. 1 Affordable Hearing Brand\nand using HearingAssist's acclaimed national television commercial, which\nincludes a \"Free Holiday Special Offer\" valued at $149.\n\n     Please click the link to view (HearingAssist National Holiday\nCommercial).\n\n     \"We are thrilled about the acquisition and the opportunity to work\nwith InnerScope's highly experienced management team,\" said Nick Naylor,\npartner of Hearing Assist II, LLC. \"This acquisition will allow both\ncompanies to provide world-class, differentiated hearing technologies to\nsignificantly enhance each customer's hearing experience.\"\n\n     Matthew Moore, president and CEO of InnerScope, stated: \"Today is a\ntremendous milestone for InnerScope. I'm delighted to welcome the\nHearingAssist team, who share our passion for providing convenient and\naffordable hearing products for the tens of millions of Americans who\nsuffer from hearing loss. The HearingAssist acquisition is another\nmeaningful step in advancing our strategy to grow as a leader and innovator\nin the direct-to-consumer hearing aid market. Moreover, adding\nHearingAssist and its management team with their proven track record should\ncontinue generating millions of dollars in sales revenues with Walmart\nin-store displays and Walmart.com and through its online website at\n<a href=\"https://hearingassist.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://hearingassist.com</a>/, I'm excited about InnerScope's next chapter, as\nwe continue to drive growth with increased revenues to create long-term\nvalue for shareholders.\"\n\n     About InnerScope Hearing Technologies, Inc. (OTC PINK: INND):\n\n     InnerScope Hearing Technologies Inc. is a leading Direct-to-Consumer\n(DTC) manufacturer and distributor of FDA-registered hearing aids, hearing\nassistive devices, hearing health-related products, and Personal Sound\nAmplifier Products (PSAPs) (\"Hearing Products\") dedicated to addressing the\nglobal demand for affordable hearing solutions. InnerScope's Hearing\nProducts and its business model break through the persistent barriers that\nprevent access to effective hearing solutions.\n\n     InnerScope's recent Acquisition of iHear Medical Inc., a DTC\ncloud-based hearing solution provider, gives the Company access to over 40\npatents and FDA-registered manufacturing and R&amp;D facility. In addition,\nInnerScope also acquired HearingAssist, an established leader in the\ndirect-to-consumer hearing aid market with a customer base of over 400,000.\nThese acquisitions, combined with a partnership with Atlazo Inc., a\nsemiconductor innovator for next-generation AI smart devices, will allow\nInnerScope to take the lead position in the direct-to-consumer hearing\nsolutions market by selling innovated proprietary advanced hearing products\nthrough Walmart and other major Big Box retailers.\n\n     InnerScope's full line of Hearing Health products is currently\navailable through these multiple retail/wholesale channels: Walmart.com,\nAmazon.com,  Giant Eagle, Hy-Vee, Hartig Drug, Food City, and Cardinal\nHealth dba RGH Enterprises Inc., which provides products to FSAStore.com,\nHSAStore.com, and WellDeservedHealth.com. Additional major retailers\nin-store and online launching soon.\n\n     For information related to InnerScope Hearing Technologies latest\nhearing aids and related hearing products, please visit:\n\n     <a href=\"http://myheariq.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://myheariq.com</a>\n\n     <a href=\"http://iheardirect.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://iheardirect.com</a>\n\n     <a href=\"http://hearingassist.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://hearingassist.com</a>\n\n     For the most up-to-date information about InnerScope Hearing\nTechnologies (OTC: INND), please visit and follow our official Twitter\naccount @inndstock page:\n\n     <a href=\"https://twitter.com/inndstock\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/inndstock</a>\n\n     For the most up-to-date information about InnerScope Hearing\nTechnologies (OTC: INND), please visit and follow our official Twitter\naccount @inndstock page:\n\n     <a href=\"https://twitter.com/inndstock\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/inndstock</a>\n\n     InnerScope Hyperlinks:\n\n     HearingAssist National Holiday Commercial\n\n     executed LOI\n\n     automated self-check hearing screening kiosk\n\n     <a href=\"http://gianteagle.myheariq.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://gianteagle.myheariq.com</a>\n\n     Atlazo Inc.\n\n     Acquisition of iHear Medical Inc.\n\n     Direct-to-Consumer Hearing Products.\n\n     InnerScope's Hearing Health Flexible Subscription Plans\n\n     Safe Harbor\n\n     This news release contains \"forward-looking statements\" within the\nmeaning of Section 27A of the Securities Act of 1933, as amended, and\nSection 21E of the Securities Exchange Act of 1934, as amended intended to\nbe covered by the \"safe harbor\" created by those sections. Any statements\nthat are not historical facts contained in this press release are also\n\"forward-looking statements,\" as that term is defined under the Private\nSecurities Litigation Reform Act of 1995 (PSLRA). Such statements may be\nidentified by words such as \"expects,\" \"plans,\" \"projects,\" \"will,\" \"may,\"\n\"anticipates,\" \"believes,\" \"should,\" \"intends,\" \"estimates,\" and other\nwords of similar meaning. Such forward-looking statements are based on\ncurrent expectations, involve known and unknown risks, a reliance on third\nparties for information, transactions or orders that may be canceled, and\nother factors that may cause our actual results, performance or\nachievements, or developments in our industry, to differ materially from\nthe anticipated results, performance or achievements expressed or implied\nby such forward-looking statements. Factors that could cause actual results\nto differ materially from anticipated results include risks and\nuncertainties related to the fluctuation of global economic conditions, the\nperformance of management and our employees, our ability to obtain\nfinancing or maintain contractual relationships with vendors and customers,\ncompetition, general economic conditions and other factors that are\ndetailed in our periodic reports filed with the Securities and Exchange\nCommission (\"S.E.C.\"). We intend that all forward-looking statements be\nsubject to the safe-harbor provisions of the PSLRA, Securities Act, and\nSecurities Exchange Act.\n\n Contact Information:\n\n     InnerScope Hearing Technologies, Inc.\n\n     Investor Relations\n\n     ir@innd.com\n\n     833-788-0506\n\n     www.innd.com\n\n     Investor Relations Agency Contact:\n\n     Skyline Corporate Communications Group, LLC\n     Lisa Gray, Senior Account Manager\n\n     One Rockefeller Plaza, 11th Floor\n     New York, NY 10020\n     Office: (646) 893-5835\n     Email: lisa@skylineccg.com\n\n     Corporate Communications:\n     InvestorBrandNetwork (IBN)\n     Los Angeles, California\n     www.InvestorBrandNetwork.com\n     310.299.1717 Office\n     Editor@InvestorBrandNetwork.com\n\nTel   : 1-916-218-4100    INNERSCOPE ADVERTISING AGY INC\nWWW   : <a href=\"https://www.innd.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.innd.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133200377.MNPRE2133201659-07445320211129</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}