{"date": "2022-02-09 12:48:34+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-story-p1\"><span class=\"tr-dateline\">LONDON, Feb 9 (Reuters)</span><span class=\"tr-dl-sep\"> - </span><span class=\"tr-strong\">Amazon's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> food retail business in Britain faces increased regulation after the competition watchdog said rules setting out how grocers should treat their suppliers will now apply to the U.S. giant.</span></p><p>The Competition and Markets Authority (CMA) said on Wednesday that due to Amazon's increasing activity in the UK grocery sector it must now comply with the Groceries Supply Code of Practice.</p><p>The code applies to retailers with an annual turnover of more than 1 billion pounds ($1.4 billion) in grocery sales.</p><p><span class=\"tr-strong\">Amazon does not break out figures for its UK grocery sales, so its designation under the code publicly confirms for the first time that its sales have crossed the 1 billion pound threshold.</span></p><p>The code ensures grocers treat suppliers fairly. It restricts firms from making changes to supply contracts at short notice and also requires retailers to give an appropriate period of notice if they no longer want to use a supplier and provide reasons for ending the contract.</p><p>All of Britain's major supermarket groups, including market leader Tesco <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TSCO.L\" data-type=\"ric\" data-ric=\"TSCO.L\" translate=\"no\" dir=\"ltr\">TSCO.L</a>, Sainsbury's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SBRY.L\" data-type=\"ric\" data-ric=\"SBRY.L\" translate=\"no\" dir=\"ltr\">SBRY.L</a>, Asda and Morrisons, are subject to the code.</p><p>“Households across the UK are increasingly using Amazon to buy food and other essential items,\" said Adam Land, senior director, remedies, business and financial analysis at the CMA.</p><p>\"Today’s decision to designate Amazon helps to ensure a level playing field for companies active in the groceries sector as people’s buying habits evolve.\"</p><p>Compliance with the code is managed by the independent Groceries Code Adjudicator.</p><p>A spokesperson for Amazon said it strived to build successful, long term relationships with its suppliers and looked forward to working with the Groceries Code Adjudicator. </p><p>\"We are proud to work with thousands of suppliers and offer a great shop window for their products in the UK and around the world.\"</p><p>Amazon's UK expansion in 2021 included its first 17 physical stores in the UK - 15 Amazon Fresh food stores and two Amazon 4-star retail stores.</p><p>($1 = 0.7367 pounds)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by James Davey; Editing by Kirsten Donovan)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:james.davey@thomsonreuters.com\" data-type=\"email\" translate=\"no\">james.davey@thomsonreuters.com</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: BRITAIN-AMAZON/REGULATION (PIX)</p></div>"}