{"date": "2022-01-05 17:08:39.090000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3350.44, "close": 3265.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission. </span> </p><p>Everybody's got different goals and plans for 2022, which means there are plenty of home essentials needed to thrive in the new year. Whether it's tools to get fit, threads to stay stylish or new pieces to a home hub, major retailers are ringing in the change in the calendar with savings. The likes of Amazon, Walmart, Best Buy and more are offering deep discounts right now. </p></div><div class=\"tr-npp-body\"><p><span><span>Start off the New Year with deals and shopping advice delivered straight to your phone.</span> Sign up for text message alerts from the experts at Reviewed.</span> </p><p>At Reviewed, we love great deals on amazing products, so we're rounding up all the best sales available right now. Keep scrolling to scoop the best deals of 2022.  </p><p>► <span>Want to eat healthier?:</span>  Here are 20 meal delivery services on sale for the new year</p><p class=\"tr-npp-section-title\">The top 10 New Year sales you can shop right now</p><ol><li><span>Amazon:</span> Every day, Amazon marks down tech products, kitchen essentials, personal care items, fashion and beauty pieces, games and more. Browse Amazon's ever-changing selection of epic Daily Deals and place your Prime-eligible order for fast and convenient shipping.  <br/>  </li><li><span>Best Buy:</span>  Shop Best Buy's Top Deals for discounts on everything from TVs, headphones and laptops to gaming devices, cell phones and home appliances. Better still, many products are available for curbside pickup—so you can shop online and pick up at a Best Buy store near you.  <br/>  </li><li><span>Coach:</span>  Shop the brand's large clearance section for markdowns of up to 50% on Coach purses, wallets and more. <br/>  </li><li><span>Green Chef: </span> Newcomers to this meal box service can enjoy a total of 10 free meals in their first four boxes. <br/>  </li><li><span>Macy's:</span>  Save as much as 70% on clearance items, including home goods, fashion pieces and more.  <br/>  </li><li><span>iRobot: </span> The makers of some of the best robot vacuums we've ever tried has a few price cuts on their ultra-popular smart appliances. <br/>  </li><li><span>Nordstrom:</span> Shop deals on fashion finds and home favorites at Nordstrom's constantly refreshed sale section.  <br/>  </li><li><span>Grandin Road: </span> Upgrade your home look by shopping here and save 20% off on indoor furniture, bedding and bathware. You can also save up to 70% on select sale items. <br/>  </li><li><span>Target:</span>  Target has major markdowns on TVs, smart tech, home goods, fashion and more. Scoop deep discounts on select fitness gear and activewear today when you shop Target's constantly updated sale section.  <br/>  </li><li><span>Solo Stove:</span> This outlet's Holiday Sale has been extended to  <span>Friday, January 7. </span> That means shoppers can save as much as 45% on fire pit bundles. </li> </ol><p class=\"tr-npp-section-title\">Mattresses and bedding</p><p><span>Avocado:</span> Snag a cozy, customer-favorite mattress from Avocado during the sleep retailer's holiday sale. Through <span>Monday, January 10</span> , you can save $125 on hybrid and latex mattresses with coupon code <span>HOLIDAY</span>  and get as much as $300 off luxury plush mattresses with code <span>JOYFUL</span> . </p><p><span>Awara: </span> The maker of one of our favorite hybrid mattresses is currently hosting its White sale through <span>Sunday, January 9</span> . That means you can get a quality mattress for up to $200 off with $499 worth of sleep accessories included free. </p><p><span>Leesa:</span>  Score a luxury mattress from Leesa at up to $400 off and snag 15% off sleep bundles and 30% off bedding and cushions though  <span>Friday, January 14</span> . </p><p><span>Nectar:</span> Shop the Nectar Rest and Refresh sale through  <span>Sunday, January 9 </span> and get $100 off top-tier mattresses and up to $399 worth of accessories (including a sheet set, mattress protector and pillows) for free with your purchase.</p><p><span>Nest Bedding:</span> Take 10% off luxury mattresses, sheet sets and more through <span>Monday, January 10</span> . </p><p><span>Puffy:</span> Refresh your sleep set up with savings of up to $300 on mattresses from Puffy and as much as $455 worth of free sleep accessories, including pillows and sheets.</p><p><span>Purple Mattress:</span>  Save up to 15% on pillows and bedding for a limited time only and snag up to $350 in free gifts with the purchase of a mattress.</p><p class=\"tr-npp-section-title\">Home and kitchen </p><p><span>Amazon:</span> Every day, Amazon marks down tech products, kitchen essentials, personal care items, fashion and beauty, games and more. Browse Amazon's ever-changing selection of daily deals and place your Prime-eligible order for fast and convenient shipping. </p><p><span>Bed Bath &amp; Beyond:</span> Shop Bed Bath &amp; Beyond's Big Bed and Bath event for 25% off top-notch bedding and bath essentials. Meanwhile, save up to 70% on clearance items now. </p><p><span>Butcher Box:</span>  Through <span>Sunday, January 23</span> , get a New Year Bundle—which includes a pork butt, chicken thighs and ground beef—for free in your first membership delivery.</p><p><span>Crowd Cow:</span>  Save $10 on the Best of Crowd Cow or Best of Beef box from the best meat delivery service we've ever tried. You can also get $10 off your first 10 orders!</p><p><span>Gobble:</span> Get your first six meals for just $36 during Gobble's ongoing holiday sale.</p><p><span>Green Chef: </span> Newcomers to this meal box service can enjoy a total of 10 free meals in their first four boxes.</p><p><span>HelloFresh: </span> Get 14 free meals and three surprise gifts for free with a five-week subscription (save $130).</p><p><span>Hexclad:</span> Shop the Hexclad Holiday sale and save as much as 30% on must-have cookware and kitchen essentials. </p><p><span>Keurig:</span>  Stock up on coffee for the New Year. Get $3 off boxes of K-Cup Pods with the code  <span>BACKTOWORK </span> through <span>Sunday, January 9.</span> </p><p><span>Kohl's:</span>  Save big on bedding, home goods, fashion pieces and so much more, with tons of items under $10, $20 and $50 right now. Meanwhile, if you're a Kohl's card holder, you can use coupon code <span>SAVE25</span> at checkout for an extra 25% off. </p><p><span>Macy's:</span>  Save as much as 70% on clearance items, including home goods, fashion pieces and more. </p><p><span>Our Place:</span> Pick up the Instagram-famous Always Pan and Perfect Pot for a $60 savings when you buy the Home Cook Duo bundle. </p><p><span>Pier 1 Imports: </span> Spruce up your home with epic discounts on holiday decor and home goods at Pier 1 Imports. Save up to 75% on select items with coupon code  <span>FR4G82</span> .</p><p><span>Sur La Table:</span>  Gear up for 2022 with discounts of up to 50% on top-tier cookware, kitchen tools, knives, bakeware and more during Sur La Table's Winter sale. </p><p><span>Thrive Market:</span> Snag up to 30% off grocery orders from Thrive Market. </p><p class=\"tr-npp-section-title\">TVs and electronics </p><p><span>Best Buy:</span>  Shop Best Buy's Top Deals for deep discounts on everything from TVs, headphones and laptops to gaming devices, cell phones and home appliances. Better still, many products are available for curbside pickup—so you can shop online and pick up at a Best Buy store near you. </p><p><span>HP: </span> Shop the Red Tag Sale for sitewide savings on laptops, monitors and more. </p><p><span>QVC: </span> Shop the website's sale section for hundreds of markdowns on electronics, fashion, beauty pieces, home items and more. Meanwhile, if you're a new QVC customer, you can use coupon code <span>OFFER</span> to score an extra $15 off your first order.</p><p><span>Samsung:</span> The tech giant is currently offering a variety of its top-tier tech for price cuts, including the Galaxy Z Fold3 5G smartphone for as much as $900 off.</p><p><span>Target:</span>  Target has you covered with major markdowns on TVs, smart tech, home goods, fashion and more. Scoop deep discounts on select fitness gear and activewear today when you shop Target's constantly updated sale section. </p><p class=\"tr-npp-section-title\">Fashion and beauty </p><p><span>Abercrombie &amp; Fitch: </span> Save up to 50% on select men's and women's styles.</p><p><span>Aéropostale: </span> Find must-have styles at up to 80% off right now at Aéropostale and shop tons of clearance items at the lowest prices of the season. </p><p><span>Athleta:</span>  Save as much as 60% on fitness apparel, loungewear and more at Athleta. </p><p><span>Banana Republic:</span> Customers can snag an extra 60% off sale styles through <span>today</span> . </p><p><span>Clarks:</span> Score an extra 30% off sale styles when you enter discount code <span>SAVE30</span> at checkout through <span>tomorrow</span><span>, January 6</span> . Better still, get free shipping when you spend $75 or more. </p><p><span>Coach:</span> Shop the brand's large clearance section for markdowns of up to 50% on Coach purses, wallets and more.</p><p><span>Columbia:</span> Hitting the slopes this year? Shop Columbia's Winter sale and save as much as 25% on select gear. </p><p><span>Dermstore:</span>  Shop markdowns on skincare including up to 65% off Best of Dermstore products. New customers can get 15% off with the promo code  <span>WELCOME15.</span> </p><p><span>Eddie Bauer:</span>  Save up to 60% on select purchases, plus take an extra 40% off clearance styles with coupon code <span>NEWYEAR40.</span> </p><p><span>J.Crew:</span> Enjoy as much as 60% off already discounted sale styles when you enter discount code <span>BIGSALE</span> at checkout. </p><p><span>JCPenney:</span> Shop markdowns up to 65% off at the outlet's End of Season sale across jewelry, toys, home and more. You can also take an extra 15% off select items with coupon code <span>REFRESH6</span> . Meanwhile, shop online to score up to 40% off activewear with discount code <span>WORKOUT8</span> . </p><p><span>Kate Spade Surprise:</span> Save up to 75% on must-have purses and more, including items from the latest Disney collection. </p><p><span>Kenneth Cole: </span> Snag up to 50% off trendy activewear and sneakers for a limited time. </p><p><span>Nike:</span> Save up to 40% on thousands of items in Nike's sale section. The sale includes epic markdowns on shoes, apparel and sports equipment, with select items eligible for free in-store pickup. </p><p><span>Nordstrom:</span> Shop deals on fashion finds and home favorites at Nordstrom's constantly refreshed sale section.</p><p><span>Nordstrom Rack:</span> Snag clearance deals at Nordstrom Rack, with savings across categories on fashion, home goods and more. Plus, enjoy an extra 20% off select home styles through <span>Monday, January 24</span> . </p><p><span>Tory Burch: </span> Shop the Semi-Annual sale for an extra 25% off sale items. Save big on designer bags, shoes and more through  <span>Sunday, January 9</span> .</p><p><span>Ulta Beauty:</span> Shop Ulta Beauty's Love Your Skin event for daily deals on must-have beauty products through <span>Saturday, January 22</span> . </p><p class=\"tr-npp-section-title\">Toys and kid's fashion </p><p><span>Hanna Andersson:</span> Parents obsess over the hand-me-down quality of Hanna Andersson's pajamas, and right now the brand is having one of its biggest sales of the year. Save up to 60% on the customer-favorite kids' apparel now, plus take an extra 20% off clearance items. </p><p><span>Melissa &amp; Doug:</span> Pick up customer-favorite toys and playsets from Melissa &amp; Doug for 20% off right now with coupon code <span>PLAYJAN22</span> .</p><p><span>OshKosh B'gosh:</span> Looking refresh your little one's closet? Shop the Winter Clearance sale and up to 70% on already marked down styles right now. </p><p class=\"tr-npp-section-title\">Appliances </p><p><span>Home Depot:</span> Save up to 40% on appliances, tools and more. Plus, score free two-day delivery on select purchases. </p><p><span>iRobot: </span> The makers of some of the best robot vacuums we've ever tried has a few price cuts on their ultra-popular smart appliances.</p><p><span>Lowe's:</span> Refresh your home for the coming year with major savings on appliances, tools and more. Shop Lowe's Deals of the Day for the best daily savings across all categories. </p><p class=\"tr-npp-section-title\">Lifestyle </p><p><span>Academy Sports:</span>  Take as much as 50% off clearance styles for a limited time. Save big on fitness gear, bikes, Nike shoes, Columbia outerwear and so much more. </p><p><span>AeroGarden:</span> Save hundreds on Reviewed-approved garden products during AeroGarden's sitewide sale. Score up to 50% off on select items right now. </p><p><span>Backcountry:</span> Save as much as 40% on select winter styles for a limited time. </p><p><span>BBQ Guys: </span> Get ready for grilling in 2022 with this End of the Year Blowout sale and save up to 60% on select grills and accessories.</p><p><span>Chewy:</span>  Pick up toys, treats and more for your furry friend at up to 50% off during the retailer's sitewide End of Season savings sale.</p><p><span>Cricut: </span> Reviewed staffers have had a lot of fun with Cricut crafting machines, and, right now they're on mega sale for the new year. Ring in 2022 with big savings on machines and up to 50% off materials and accessories.  </p><p><span>The Happy Planner:</span> Get your 2022 off to an organized start—you can take 40% off the Reviewed-approved planners  <span>today, January 5</span> , only. </p><p><span>The Mirror:</span> Shoppers can save $300 on the cult-favorite smart tech workout screen and get free shipping and installation (a $550 value) for a limited time only. </p><p>​​​​ <span>NordicTrack:</span>  Shop the New Year's sale for big savings on Reviewed-approved exercise equipment and fitness machines. </p><p><span>Solo Stove:</span> This outlet's Holiday Sale has been extended to  <span>Friday, January 7. </span> That means shoppers can save as much as 45% on fire pit bundles. </p><p class=\"tr-npp-section-title\">Furniture </p><p><span>Apt2B:</span> Shop the Fresh Start sale for 22% off orders of $2,999 or more and 15% off everything else sitewide through <span>Monday, January 10</span> . </p><p><span>Burrow:</span> Save 10% on purchases up to $1,799 and get even deeper discounts on orders of $1,800 or more when you enter discount code <span>DONE21</span> at checkout through <span>Sunday, January 9</span> .</p><p><span>Frontgate:</span> Shoppers who use the code  <span>149FLAT222 </span> will only pay a flat-rate shipping fee of $149 on purchases of outdoor and indoor furniture.</p><p><span>Grandin Road: </span> Upgrade your home look by shopping here and save 20% off on indoor furniture, bedding and bathware. You can also save up to 70% on select sale items.</p><p><span>Overstock:</span> Snag big savings on furniture and home goods during Overstock's New Year's Home sale. During the sale, you can shop thousands of items for up to 70% off and enjoy free standard shipping on all orders.</p><p><span><span>There's more where this deal came from.</span>  Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Shop the 66 best New Year sales at Amazon, Target, Best Buy and more right now</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}