{"date": "2021-12-01 13:39:02+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n                  <strong>REDWOOD CITY, Calif., Dec. 1, 2021 <span>-</span></strong>\n                  <a href=\"https://www.informatica.com/\">\n                    <u>Informatica</u>\n                  </a>\n                  <sup>®</sup> (NYSE: INFA), an enterprise cloud data management leader, announced today at AWS re:Invent a new solution to democratize access to cloud data lakes on Amazon Web Services (AWS), using <a href=\"https://aws.amazon.com/lake-formation/?whats-new-cards.sort-by=item.additionalFields.postDateTime&amp;whats-new-cards.sort-order=desc&amp;awsm.page-whats-new-cards=3\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Lake Formation</a>. Informatica's Axon Data Marketplace can now empower business users across any level within an organization with access to AWS Lake Formation data with the trust and security needed to make informed business decisions.\n      </p>\n                <p>\n        Informatica Axon Data Governance uses AI and machine learning to automate the tasks of finding data, measuring its quality, and locating the right people to help govern it. Leveraging AI-powered automation through Informatica's <a href=\"https://www.informatica.com/platform.html\">Intelligent Data Management Cloud<sup>™</sup></a> (IDMC), organizations can cost-effectively scale and democratize data, delivering business insights and value.\n      </p>\n                <p>\n        \"Data is critical to our business success,\" said Aravind Jagannathan, Chief Data Officer at Freddie Mac. \"With Informatica and AWS, we are on a data and cloud modernization journey where a secure, efficient and trusted data platform built with Informatica's innovations on AWS helps us to transform the vast amount of data into actionable insights.\"\n      </p>\n                <p>\n        Informatica Offers Self-Service Data Access for AWS Lake Formation\n      </p>\n                <p>\n        Joint Informatica-AWS customers can now empower business users with access to AWS Lake Formation governed data via Informatica's business-user friendly, data policy-enforcing Axon Data Marketplace. This solution provides customers with the ability to:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          Provide business users with self-service, high-quality data assets while ensuring compliance with all data management policies from access controls to complex policy enforcement for CCPA, for example.\n        </li>\n                  <li>\n          Automate and accelerate data access request submissions and approvals, connecting data owners directly with business users, removing dependence on IT, and technical resources to provision data for analytics.\n        </li>\n                  <li>\n          Empower business users to quickly access trusted data assets without having to consult data owners and IT based on critical data context including data quality assessments, data set certification, and business glossary associations\n        </li>\n                </ul>\n                <p>\n        Informatica is also now part of the AWS Workload Migration and the AWS Data-Led Migration Programs, helping customers accelerate critical data workloads to AWS with intelligent data management capabilities including Informatica's Enterprise Data Catalog to help customers take a data-led approach to migration and Informatica's cloud data warehouse modernization program.\n      </p>\n                <p>\n        \"We're increasingly seeing customers deploy Amazon S3 data lakes and AWS Lake Formation in a desire to bring their critical data assets to the business,\" said Rik Tamm-Daniels, Vice President Strategic Ecosystems and Technology at Informatica. \"However, the ability to ensure data permissions and data policies are enforced while not creating undue burden for the business is a critical capability that Informatica is excited to deliver together with AWS Lake Formation.\"\n      </p>\n                <p>\n        Customers can acquire Informatica Axon Data Governance as well as the rest of Informatica's Intelligent Data Management Cloud platform services including data integration, data quality, data cataloging, data governance and master data management in AWS Marketplace.\n      </p>\n                <p>\n        For more information on Informatica's solution for AWS Lake Formation, please visit: <a href=\"http://www.informatica.com/lakeformation\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.informatica.com/lakeformation</a></p>\n                <p>\n                  <strong>About Informatica</strong>\n                </p>\n                <p>\n        Informatica (NYSE:INFA), an Enterprise Cloud Data Management leader, empowers businesses to realize the transformative power of data. We have pioneered a new category of software, the Informatica Intelligent Data Management Cloud<sup>™</sup>(IDMC), powered by AI and a cloud-first, cloud-native, end-to-end data management platform that connects, manages, and unifies data across any multi-cloud, hybrid system, empowering enterprises to modernize and advance their data strategies. Customers in more than 100 countries and 84 of the Fortune 100 rely on Informatica to drive data-led digital transformation.\n      </p>\n                <p>\n        ###\n      </p>\n                <p>\n        The information provided herein is subject to change without notice. In addition, the development, release and timing of any product or functionality described today remain at the sole discretion of Informatica and should not be relied upon in making a purchasing decision, nor as a representation, warranty, or commitment to deliver specific products or functionality in the future.\n      </p>\n                <p>\n                  <strong>Contact:</strong>\n                </p>\n                <p>\n        Informatica Public Relations<br/><a href=\"mailto:prteam@informatica.com\" data-type=\"email\" translate=\"no\">prteam@informatica.com</a></p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.informatica.com/about-us/news/news-releases/2021/12/20211201-informatica-simplifies-data-democratization-with-new-ai-powered-solution-for-aws-lake-formation.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Informatica Corporation</strong> published this content on <strong>01 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>01 December 2021 13:39:02 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Informatica Corporation</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Informatica-Corporation</p></div>"}