{"date": "2021-11-02 02:43:34.184000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>ABB?s digital e-mobility venture, PANION, and Amazon Web Services (AWS) are launching the test phase of their first jointly developed, cloud-based solution, ?PANION EV Charge Planning?. Designed for the real-time management of electric vehicle (EV) fleets and charging infrastructure, the solution makes it easier for operators to monitor energy usage and schedule charging across their fleets.</p><p>With the number of electric cars, buses, vans, and heavy trucks on the road expected to hit 145 million globally by 2030, the pressure is on to improve global charging infrastructure1. In response, ABB is developing technical infrastructure to offer a platform as a service (PaaS). This provides a flexible base for both ?PANION EV Charge Planning? and other software solutions for fleet operators.</p></div><div class=\"tr-npp-body\"><p>?The transition to electric vehicle fleets still presents operators with a number of new challenges,? says Markus Kr?ger, founder and CEO at PANION. ?Our mission is to support this transformation with innovative solutions. By working with AWS and leveraging the expertise of our market-leading parent, ABB, we today unveil ?PANION EV Charge Planning.? This modular software solution helps fleet managers to make their e-fleet as reliable, cost-efficient, and time saving as possible.?</p><p>In March 2021, ABB and AWS announced their collaboration focused on electric fleets. The new ?PANION EV Charge Planning? solution combines ABB?s experience in energy management, charging technology and e-mobility solutions with Amazon Web Service?s cloud development experience. Software from other third-party providers often offers only limited functionality to fleet operators and lacks flexibility regarding different vehicle models and charging stations. This new alternative provides a scalable, secure, and easily customizable software solution, combined with easy-to-manage hardware, to make EV fleet management more efficient and maximize reliability.</p><p>?The reliability and efficiency of electric vehicle fleets are integral to achieving a sustainable future,? said Jon Allen, Director of Automotive Professional Services at Amazon Web Services. ?Together, ABB, PANION, and AWS are making the possibility of an EV future tangible. We will continue to innovate to help that vision unfold successfully and secure the transition to lower emissions.?</p><p>The new ?PANION EV Charge Planning? beta version integrates several unique features, which aim to create an all-in-one solution for fleet operators when it launches fully in 2022.</p><p>Key benefits include a ?Charge Planning Algorithm? feature, which helps to reduce operating and energy costs while ensuring business continuity. The ?Charge Station Management? feature allows the platform to connect to and communicate with charging stations to schedule, execute, and adapt charging sessions. This is completed by a ?Vehicle Asset Management? feature providing all the relevant real-time telemetry data to the system and an ?Error Handling and Task Management? module to trigger actionable tasks for tackling unplanned events and errors within the charging operations that need human interaction on the ground, on-time.</p><p>Frank M?hlon, President of ABB's E-mobility division, said: ?In the short time since we started our collaboration with AWS, we have made great progress. We are delighted to enter the test phase with our first product. Thanks to AWS? expertise in software development and its leadership in cloud technology, we can offer a hardware-independent, intelligent solution that makes it much easier for operators to have confidence and manage their e-fleets. It will provide fleet teams with a steady stream of innovative and secure services, which will continue to evolve as we work in partnership with our customers.?</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}