{"date": "2021-01-15 07:00:05+00:00", "ticker": "AVV", "mrkt_info": {"open": 3534.0, "close": 3805.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .h{margin:72.0pt 72.0pt 35.45pt 72.0pt;}.storyContent p.q{margin:0cm;margin-bottom:.0001pt;font-size:11.0pt;font-weight:bold;text-align:center;}.storyContent p.r{margin:0cm;margin-bottom:.0001pt;font-size:11.0pt;text-align:center;}.storyContent p.s{margin:0cm;margin-bottom:.0001pt;font-size:11.0pt;text-align:justify;}.storyContent p.t{margin:0cm;margin-bottom:.0001pt;font-size:11.0pt;font-weight:bold;text-align:justify;}.storyContent p.u{margin:0cm;margin-bottom:.0001pt;font-size:11.0pt;text-align:justify;}.storyContent p.v{margin:0cm;margin-bottom:.0001pt;font-size:11.0pt;font-weight:bold;}.storyContent p.d,.storyContent li.d,.storyContent div.d{margin:0cm;margin-bottom:.0001pt;font-size:11.0pt;}</style><div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><div style=\"text-align:left;font-size:10pt\"><div>RNS Number : 7762L</div>  <div>AVEVA Group PLC</div>  <div>15 January 2021</div>  <div> </div></div>\n<div class=\"h\">\n<p class=\"q\">AVEVA GROUP PLC</p>\n<p class=\"r\"> </p>\n<p class=\"q\">Trading Update</p>\n<p class=\"r\"> </p>\n<p class=\"s\">AVEVA Group plc ('AVEVA' or 'the Group'), a global leader in engineering and industrial software, announces the following trading update.</p>\n<p class=\"s\"> </p>\n<p class=\"t\">AVEVA's performance for the nine months ended 31 December 2020</p>\n<p class=\"t\"><span class=\"k\"> </span></p>\n<p class=\"s\">AVEVA had a strong quarter of contract renewals in the three months to December 2020, which helped to improve revenue growth to approximately 1.5% in the nine months to 31 December 2020 on an organic constant currency basis. On the same basis, recurring revenue grew by 10%, taking it to 68% of overall Group revenue in the period.</p>\n<p class=\"s\"> </p>\n<p class=\"s\">Organic constant currency revenue growth in the three months to 31 December 2020 was over 26%. This was driven by a significant number of scheduled subscription renewals, including a large three-year contract renewal in the Food sector. It also benefited <span class=\"j\">from the early renewal of a large three-year EPC contract that had been scheduled for AVEVA's Q4, and the conversion of two large contracts in the Marine sector from annual fees to multi-year subscription, giving the customers more flexibility in a challenging Marine market environment.</span></p>\n<p class=\"s\"> </p>\n<p class=\"u\">The order pipeline for the remainder of the financial year is solid, supported by efficient digital demand generation and several large contract renewals, albeit fewer than seen in the third quarter. AVEVA's World Digital customer event will take place on 26 to 28 January and will be the Group's largest digital event to date.</p>\n<p class=\"s\"> </p>\n<p class=\"s\">On 31 December, AVEVA had £2.7 billion of cash (mostly held in US dollars) and no debt, reflecting the proceeds of the Rights Issue ahead of the completion of the OSIsoft acquisition.</p>\n<p class=\"s\"> </p>\n<p class=\"s\">The Board remains confident in the full year outlook for AVEVA. Notwithstanding the disruption seen to the trading environment in 2020, the trend towards the digitalisation of the industrial world is strong and the Board remains excited about the significant growth opportunities ahead.</p>\n<p class=\"s\"> </p>\n<p class=\"t\">OSIsoft update</p>\n<p class=\"s\"> </p>\n<p class=\"s\">OSIsoft continued to perform well and achieved billings growth of 8.5% in the financial year to 31 December 2020, in line with management plans. This was driven by strong growth in the Power Generation &amp; Distribution, Chemicals &amp; Petrochemicals and Pharmaceuticals &amp; Life Sciences markets, partly offset by slightly weaker orders from the Oil &amp; Gas and Mining, Metals, Metallurgy &amp; Materials markets.</p>\n<p class=\"s\"> </p>\n<p class=\"s\">AVEVA has received the antitrust and regulatory clearances required ahead of completion of the acquisition of OSIsoft, with the exception of the approval of the Committee on Foreign Investments in the United States (CFIUS). CFIUS approval is expected by early February, with the transaction expected to close shortly thereafter.</p>\n<p class=\"v\"> </p>\n<p class=\"v\"> </p>\n<p class=\"v\">Enquiries:</p>\n<p class=\"d\"> </p>\n<p class=\"v\">AVEVA Group plc</p>\n<p class=\"d\">Matthew Springett, Head of Investor Relations: +44 (0) 1223 556 676</p>\n<p class=\"d\"> </p>\n<p class=\"v\">FTI Consulting LLP</p>\n<p class=\"d\">Edward Bridges / Dwight Burden: +44 (0) 203 727 1000</p>\n</div>\n<div style=\"text-align:left;font-size:10pt\"><div>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a>.<br/><br/>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a>.</div><div> </div>  END</div><div> </div><div> </div>TSTEAPFLFDLFEFA</div>"}