{"date": "2022-01-25 09:58:13.775000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The independent directors of Kishore Biyani-led Future Retail Limited (FRL) have accepted the transaction with billionaire Mukesh Ambani-led energy-to-telecom conglomerate Reliance and rejected the proposal of US e-commerce giant Amazon for investment in FRL.</p><p>The independent directors have written to Amazon saying that they have accepted the transaction with Reliance as it addressed the needs of funds to pay off public sector bank lenders and suppliers of goods.</p></div><div class=\"tr-npp-body\"><p>\u0093It (Reliance's offer) helps FRL to meet almost all FRL\u0092s liabilities and in the process helps protect the investment of small shareholders and jobs of over 25,000 employees,\u0094 said FRL\u0092s letter, dated January 25, 2022, which Business Standard has reviewed.</p><p>FRL said that it does not think it would serve any purpose to engage in any further discussions on the proposal made in the letter by Amazon. \u0093If you were serious about providing funding to the extent of Rs 3,500 crore within the timeline (in order to repay banks and avoid NPA classification), we would have been happy to engage with you,\u0094 said FRL. \u0093But it is now clear that your letters were just a game of smoke and mirrors, just to serve your purpose of gaining all the media attention and create media headlines that \u0091Amazon is prepared to help\u0092.\u0094 FRL said it would not be assessing any proposal from Amazon until an actual solution that meets FRL\u0092s capital requirements and addresses the concerns of its stakeholders in a legally compliant manner is tabled.</p><p>FRL has also sent the letter to the Directorate of Enforcement, Securities and Exchange Board of India (SEBI) chairman Ajay Tyagi, Competition Commission of India (CCI) chairman Ashok K Gupta. It has also sent the letter to top executives at lenders such as Union Bank of India, Bank of India, State Bank of India, Bank of Baroda, Central Bank of India, Punjab National Bank, UCO Bank and Indian Bank.</p><p>FRL has told Amazon that FRL had sought the e-commerce firm\u0092s help in seeking out funds in sufficient quantity to stave off bankruptcy but Amazon was not able to bring forth a concrete and viable offer that would address FRL\u0092s concerns.</p><p>\u0093We refer to your letter dated January 22, 2022 received on January 23, 2022 at 01:22 am time in our e-mail,\u0094 stated FRL\u0092s letter, dated January 25, 2022, which Business Standard has reviewed. \u0093This is not the first engagement that Future Retail Limited (FRL) and its management is having with Amazon. FRL had sought your help in seeking out funds in sufficient quantity to stave off bankruptcy but you were not able to bring forth a concrete and viable offer that would address FRL\u0092s concerns. Your statements which suggest that there were delays or unwillingness on part of FRL is not true.\u0094</p><p>Last week, Amazon\u0092s letter to FRL\u0092s independent directors, including Gagan Singh, Ravindra Dhariwal, and Jacob Mathew, had expressed its willingness and ability to help FRL address its financial concerns. This included the solution proposed in the term sheet between Amazon-backed private equity firm Samara Capital and FRL, in which the former contemplated an infusion of Rs 7,000 crore in the Kishore Biyani firm.</p><p>FRL has said it has always been clear that it would assess any proposal, which provides a comprehensive solution for banks, employees, shareholders, vendors, and other stakeholders of FRL. It said the proposal does not meet these basic criteria on speed and timing of funding, legal compliance and adherence with the regulatory rulings, which you have simply chosen to ignore. This makes it apparent that your offer is more by way of posturing for extraneous reasons and not to address the crisis in which FRL finds itself. The firm said it had also made it clear that assessment of any proposal would be subject to FRL\u0092s legal obligations.</p><p>At its core, FRL said the offer in Amazon\u0092s letter is to buy all of FRL\u0092s retail assets for a consideration of Rs 7,000 crore. It said this price is significantly below the amount needed to discharge FRL\u0092s total liabilities - FRL\u0092s Bank liabilities and part of the committed vendor payments till just March 2022 itself aggregate to Rs 12,027.31 crore.</p><p>\u0093When seen in the context of the financials of the Reliance transaction by way of the Scheme of Arrangement, your offer is plainly an attempt to buy the FRL assets on the cheap,\u0094 said the FRL letter.</p><p>FRL said in its letter dated January 22, 2022, FRL had asked Amazon to confirm whether they had the authority to negotiate and finalize a transaction on behalf of Samara Capital. In response Amazon clarified that it would \u0093facilitate\u0094 discussions, with Amazon\u0092s exact role and relationship with Samara Capital being unclear. FRL said Amazon should act with transparency in matters of funding of an Indian listed company.</p><p>\u0093Your earlier letter suggested that discussions would be led by an Amazon representative (i.e.Abhijeet Muzumdar, head of Amazon Smbhav Venture Fund and Corporate Development at Amazon), and now the name of a Samara representative is being proposed (i.e. Sumeet Narang, managing director at Samara), without even a confirmation from Samara Capital that they have authorized you to make statements on their behalf,\u0094 said FRL.</p><p>FRL said it needs to be clearly stated that foreign investment in multi-brand retail is impermissible without Government approval and any investment by Samara must be transparent, and not an indirect investment by Amazon contrary to the rules. For this purpose, it is necessary that the Amazon and Samara transparently disclose to FRL and the authorities, the ultimate beneficial owners and contributories to the Samara fund in India through various layers. \u0093Further, Amazon should confirm that it has not directly or indirectly funded any amount to Samara,\u0094 said FRL.</p><p>According to sources, as early as June 2020, private equity firm Samara Capital had signed a non-binding term sheet with FRL that entailed a Rs 7,000 crore investment. This was two months before Kishore Biyani-led Future Group announced its Rs 24,713 crore (or $3.4 billion) merger deal with Mukesh Ambani-led Reliance Industries (RIL) at the end of August 2020.</p><p>FRL had also asked Amazon to confirm whether they are willing to fund Rs 3,500 crores by Monday (January 24). It had informed that any such funds would be used to repay FRL\u0092s lenders, for if FRL\u0092s lenders are not repaid by January 29, 2022, its accounts may be classified as an NPA (non-performing asset). FRL said that Amazon has chosen to ignore this requirement.</p><p>\u0093It is now apparent that you neither were nor are serious about funding FRL, within the required timelines but merely want to block sale of small-store formats assets to repay lenders to avoid a NPA classification,\u0094 alleged FRL in the letter.</p><p>FRL said it has a clear urgency of funds, and Amazonis instead is suggesting an alternative and an extensive due diligence exercise and has not even bothered to provide any timeline for funding, despite FRL specifically asking it to provide clarity on this point.</p><p>It bears repetition that Amazon is aware that FRL needs funds aggregating to approx. Rs. 12,027.31 crores for Bank liabilities and part of the committed vendors payments which are due up to March 2022. Compared to the present proposed Scheme of Arrangement which will enable FRL to repay all its bank debts and suppliers; save the jobs of 25,000 employees; and protect the investment of lakhs of small shareholders, Amazon\u0092s proposal that \u0093FRL sells all its retail assets to Samara for a total consideration of Rs.7,000 crores is a sorry attempt to buy FRL\u0092s assets on the cheap,\u0094 said the letter. It said this is leaving FRL in a hopeless situation facing bankruptcy proceedings \u0096 all causing public injury and public harm. \u0093This attempt appears to be an exercise in public relations in order to attract media headlines,\u0094 stated the letter.</p><p>FRL said Amazon\u0092s attempts at drawing comparisons between the Scheme of Arrangement and the proposed transaction with Samara Capital are misplaced. The Scheme of Arrangement will be a court-approved transaction, and has already received the approvals of various regulators, including SEBI and CCI. \u0093It is fully-compliant with Indian laws,\u0094 said FRL.</p><p>More fundamentally, the Scheme of Arrangement provides a comprehensive solution to FRL to meet its various liabilities, which the proposed transaction with Samara Capital simply does not for the reasons mentioned above. \u0093Your (Amazon) statement that we should unwind certain transactions relating to outstanding advances and security deposits misses the issue at hand. The need of the hour is to focus on and find a solution to FRL\u0092s immediate liquidity needs,\u0094 said FRL.</p><p>Queries to Amazon and Future Group remained unanswered until the time of publication.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Business Standard Ltd.</p></div>"}