{"date": "2021-11-15 12:44:32+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>White Friday is back this year from November 22nd to November 29th on Amazon.sa, with deals across electronics, fashion, sports, beauty, kitchen, home, and more and top brands including Samsung, Black+Decker, Philips, Microsoft, Guess, adidas, and more</p>\n<p>Prime members on Amazon.sa will get 24-hour early access to White Friday deals this year, along with Free One-Day delivery across eligible items, and free international shipping from Amazon US on orders over SAR 100</p>\n<p>Saudi Arabia, November 15th 2021: Amazon.sa has confirmed that its biggest sale of the year, White Friday, will run for eight days straight this year, giving shoppers one full additional day in comparison to previous White Friday seven-day sales, to enjoy deep discounts of up to 70% across electronics, fashion, sports, beauty, kitchen, home, and more. Featuring epic savings, with new deals every day, this year’s White Friday will kick off on November 22nd at midnight and run until November 29th. Prime members on Amazon.sa will also enjoy a full 24-hour early access to the sale from midnight on November 21st. You can become a Prime member and sign up for the free 30-day trial on www.amazon.sa/prime to explore the membership’s range of shopping and entertainment benefits.</p>\n<p>Ronaldo Mouchawar, Vice President for Amazon in Middle East and North Africa (MENA) says “White Friday is not only our biggest sale of the year on Amazon.sa, but it has also become a shopping extravaganza on customers’ calendars. Every year, we get excited to help customers in Saudi save millions of Saudi Riyals, this year is no different. Due to popular demand, we’ve extended White Friday to run for eight days for the very first time, helping customers make even more savings with one full additional day to enjoy the sale and a full 24-hour early access window for Prime members. The team at Amazon.sa has been working hand in hand with the world’s top brands, as well as small and medium sized businesses across Saudi Arabia, to bring customers the best ever White Friday Sale, with some of our biggest deals on a wide selection. Stay tuned as we reveal the deals over the following days.”</p>\n<p>This White Friday, Amazon.sa customers are set to save big with thousands of deals on top brands such as Samsung, Black+Decker, Philips, Microsoft, Guess, adidas, and more. Customers will also be able to discover and support a growing list of Saudi-based small businesses by shopping White Friday deals on the Amazon.sa local storefront, a curated collection that connects independent sellers and shoppers.</p>\n<p>Prime members on Amazon.sa can enjoy 24-hour early access to the White Friday sale from midnight on November 21st and enjoy a range of membership benefits, including:</p>\n<p>¶ Free One-Day Delivery – Order today, get items tomorrow with our free one-day delivery promise on eligible products, with no minimum purchase.</p>\n<p>¶ Free Delivery from Amazon US via the Amazon.sa Global Store – Save on shipping with free delivery for international orders over SAR 100 on Prime-eligible products shipped via Global Store</p>\n<p>¶ Binge-worthy entertainment – Enjoy unlimited access to Prime Video, where members can stream or download thousands of award-winning movies and TV series, including Amazon Originals.</p>\n<p>Amazon in Saudi Arabia</p>\n<p>¶ Over the last year, Amazon has grown its operations network across Saudi Arabia with 11 new buildings that have enabled faster and more flexible delivery options for customers.</p>\n<p>¶ The new openings have bolstered Amazon’s fulfillment network’s storage capacity by over one million cubic feet and increased its delivery network area across KSA by 58%.</p>\n<p>¶ Health and safety of employees, customers and partners, remains a top priority. Throughout the year Amazon has implemented reskilling and upskilling training programmes for employees, including adapting more than 150 safety processes as the company prepares for White Friday.</p>\n<p>¶ As part of its continuing efforts to help businesses achieve their goals, Amazon continues to invest heavily in selling partners, providing them with logistics, programs, and personnel to enable them to scale operations online. Amazon provides sellers with free tools and services, including Fulfilment by Amazon (FBA) and the Seller Mobile App, to help sellers boost their sales online.</p>\n<p>Customers in Saudi Arabia can make their White Friday shopping experience even easier by downloading the Amazon shopping app to browse and shop the best savings or shop directly on the Amazon.sa website. All Amazon.sa deliveries can be paid through online payment options including credit and debit card or Amazon.sa Gift Cards, which also offer an easy, simple and convenient gifting experience to friends and family.</p>\n<p>-Ends-</p>\n<p>About Amazon:</p>\n<p>Amazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit amazon.com/about and follow @AmazonNews.</p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}