{"date": "2021-12-01 04:08:25+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        This year at re:Invent, aside from the excitement of attending the event in person once again, I was excited to attend the Global Partner Keynote, and with a great opening band kicking off the session, it felt like a return to a world pre-pandemic.\n      </p>\n                <p>\n        On Monday, November 29th, the Global Partner Keynote was presented by Doug Yeum, Head of the AWS Partner Organization, Sandy Carter, Vice President, Worldwide Public Sector Partners and Programs, and Stephen Orban, General Manager of AWS Marketplace and Control Services.\n      </p>\n                <p>\n        There were fifteen new strategic collaboration agreements executed with AWS this year, and another 15 AWS partners achieved Premiere status. Not to mention, Rackspace Technology just won the <a href=\"https://www.rackspace.com/newsroom/rackspace-technology-receives-2021-aws-migration-partner-year-award\" data-type=\"url\" class=\"tr-link\" translate=\"no\">2021 AWS Migration Partner of the Year Award</a> and earned the AWS Perimeter Protection MSSP Partner Certification.\n      </p>\n                <h4>\n                  <strong>AWS Partnership Enablement</strong>\n                </h4>\n                <p>\n        The keynote focused on the growth of AWS APN partner enablement using partner programs and four new <a href=\"https://aws.amazon.com/partners/paths/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Partner Paths</a>. Critical examples of defining recurring patterns for solutions are what Partner Paths are all about, which allow partners to develop joint offerings in industry-specific use cases. In addition, the Migration Acceleration Program was in the spotlight as a top partner program that partners use, and the <a href=\"https://aws.amazon.com/about-aws/whats-new/2021/11/aws-graviton-ready-program/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Graviton Ready Program</a> was announced, which validates software from ISV partners for workloads using Graviton2 EC2 instances.\n      </p>\n                <p>\n        Shelly Swanback, President, Product &amp; Platform at Western Union, was the first guest speaker who spoke of the importance of partner collaboration. Swanback included three essential elements of creating change by \"embracing the mess.\" Suggesting a hands-on discovery with partners and avoiding the use of traditional, inefficient RFP processes, staying close to partners to create learning loops, and making your technology strategy your business strategy.\n      </p>\n                <h4>\n                  <strong>AWS Marketplace</strong>\n                </h4>\n                <p>\n        Stephen Orban, General Manager of AWS Marketplace and Control Services, spoke of the importance of AWS Marketplace and how AWS Partners have sold billions of dollars of products and services through AWS Marketplace in 2021. Key AWS Marketplace announcements were:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://aws.amazon.com/redshift/features/aws-data-exchange-for-amazon-redshift/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Data Exchange for Amazon Redshift</a> - GA (customers can find and subscribe to and immediately query without ETL or data pipelines)\n        </li>\n                  <li>\n                    <a href=\"https://aws.amazon.com/blogs/aws/data-exchange-for-apis-find-subscribe-use-third-party-apis-consistent-authentication/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Data Exchange for APIs</a> - allows partners to bring existing APIs to AWS Data Exchange\n        </li>\n                  <li>\n                    <a href=\"https://aws.amazon.com/marketplace/features/containers/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Marketplace for Containers Anywhere</a> (Containerized 3rd party software)\n        </li>\n                  <li>\n          Management and Governance Lens\n        </li>\n                  <li>\n          AWS re/start via AWS Marketplace - a full-time skills development program that provides the underprivileged a tech pipeline for global communities to help close the skills gap.\n        </li>\n                </ul>\n                <h4>\n                  <strong>AWS Public Sector</strong>\n                </h4>\n                <p>\n        Sandy Carter, VP Worldwide Public Sector, spoke about the main areas of industry specialization that consumers have requested. She highlighted how customers use the Partner Solution Finder to satisfy the simple need to find the right partner with the right industry specialization.\n      </p>\n                <p>\n        Carter also announced the general availability for the AWS Energy Competency and the U.S. Department of Defense Security Requirements Guide for Impact Level 5. Another important announcement was \"AWS Think Big for Small Business Communities\" to educate, inform and enable collaboration among public sector-serving businesses in small and minority-owned businesses in the partner community. Other Public Sector announcements include:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          EHR Integrated Applications Migration Initiative - streamlining healthcare application migrations to AWS.\n        </li>\n                </ul>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://aws.amazon.com/health/solutions/epic/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Epic on AWS</a> - Healthcare &amp; Lifesciences Solutions\n        </li>\n                </ul>\n                <p>\n        The second guest speaker, Meg Knauth, VP, Application Development &amp; Operations at T-Mobile, spoke about the importance of engaging with partners to help adopt a culture of change. Suggesting that businesses adopt a more vulnerable and open approach, encouraging organizations to define success to themselves and their teams so that partners can reciprocate that openness.\n      </p>\n                <p>\n        Knauth also spoke about her team's approach to gaining new skill sets while acknowledging the underlying motives that her employees looked at when engaging in new projects, specifically in the benefits of how it will foster career growth. She also touched on the importance of creating an inclusive environment for internal and external partnerships by showing up as a team, investing in training for everyone around the clock, and following her simple motto of \"no surprises, no excuses, and absolutely no boundaries.\"\n      </p>\n                <h4>\n                  <strong>New AWS Partnership Initiatives</strong>\n                </h4>\n                <p>\n        A new mainframe modernization competency was introduced for mainframe migrations into AWS. In addition, the AWS acquisition of Blu Age was highlighted to help simplify mainframe modernization natively on AWS for mainframe migrations.\n      </p>\n                <p>\n        Four new partner resources were also unveiled:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          AWS Skill builder\n        </li>\n                  <li>\n          AWS courses on the Amazon.com website\n        </li>\n                  <li>\n          AWS re/Start expansion\n        </li>\n                  <li>\n          AWS Skills Center Seattle\n        </li>\n                </ul>\n                <p>\n        Other Partner Network announcements included:\n      </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          AWS Certified SAP on AWS (Beta)\n        </li>\n                  <li>\n          Migration Ambassador Foundations\n        </li>\n                  <li>\n          AWS GameDay New Benefit for Partners.\n        </li>\n                </ul>\n                <p>\n        The two-hour session wrapped up with a fireside chat between Doug Yeum and CEO Adam Selipsky. Adam Selipsky spoke of new initiatives and how the rise of more sophisticated services around data will continue to emerge through customer demand, along with better offers among compute and storage services.\n      </p>\n                <p>\n        One of the main takeaways that stuck with me was Selipsky's mention of how demand for AWS skills keeps growing and how AWS needs its partners to help drive an \"audacious goal\" of training 192 million people no matter where they are in their cloud journey. While it places a lot of dependency on AWS partners, it also demonstrates the power and importance of the AWS partner community.\n      </p>\n                <p>\n        Rackspace Technology is proud to be an \"all-in\" AWS Partner Network (APN) Premier Consulting Partner that has deep AWS expertise and scalability to take on the most complex AWS projects.\n      </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.rackspace.com/blog/highlights-aws-reinvent-2021-global-partner-keynote\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Rackspace Technology Inc.</strong> published this content on <strong>30 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>01 December 2021 04:08:25 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Rackspace Technology Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Rackspace-Technology-Inc.</p></div>"}