{"date": "2021-11-18 14:40:41.229000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MAGNET FORENSICS INC (\"MAGT-T;MAGTF-0\")\n- Leading Enterprises Turn to Magnet AXIOM Cyber to Investigate\n- Critical Cybersecurity Incidents\n\n    Magnet Forensics, a developer of digital investigation solutions used\nby more than 4,000 public and private sector organizations in over 90\ncountries, is delivering meaningful results for leading enterprises in the\ntechnology, healthcare, financial and professional services sectors in the\nfight against cybercrime.\n\n    Magnet AXIOM Cyber was purpose-built to empower enterprises to\ninvestigate and respond to cybersecurity incidents. Many of the world's\nlargest corporations are now using AXIOM Cyber to investigate fraud, IP\ntheft, employee misconduct and data breaches, including ransomware,\nbusiness email compromise and insider data exfiltration.\n\n    \"What makes Magnet AXIOM Cyber so valuable to conducting post-incident\nanalysis is its versatility,\" said Bill Odom, co-founder of eDiscovery firm\nOrbital Global and former senior manager of forensic investigation and\ndispute services with EY. Prior to joining the private sector, Odom served\nas a special agent with the FBI. \"Magnet AXIOM Cyber gives us the ability\nto track the magnitude of the damage of a cyber attack by covertly and\nremotely connecting to compromised systems on or off corporate networks in\nmultiple locations, acquire data from services like Microsoft 365 and\nGoogle Workspace to identify threat vectors and move the evidence we\nrecover into a legal environment for eDiscovery. Carrying out these\nfunctions helps us to keep businesses running and accelerate their recovery\nafter they suffer cyber incidents.\"\n\n    When cybercriminals breach their defenses, enterprises are increasingly\nturning to digital forensics for post-incident analysis to reveal the\norigin of the incident, the methods used to carry it out and the damage\ndone. Since launching Magnet AXIOM Cyber in early 2020, Magnet Forensics\nhas continued to innovate and give corporate investigators the tools they\nneed to protect enterprises. With Magnet AXIOM Cyber, enterprises are now:\n\n//st\n\n  * Performing covert, remote acquisitions from Windows and Mac systems,\neven\n    when they aren't connected to a corporate network\n  * Collecting data from cloud-based communication services like Microsoft\n    Teams and Slack and storage services such as Microsoft Azure and Amazon\n    Web Services\n  * Running digital forensic analyses in cloud-based environments\n  * Recovering and analyzing digital evidence from Linux systems\n  * Supporting eDiscovery review platforms such as Relativity and\nConcordance\n\n//et\n\n    \"Enterprises are permanently shifting to hybrid models that involve\nemployees working from home and it's making them more vulnerable to\ncybercrime than ever before,\" said Magnet Forensics chief executive officer\nAdam Belsher. \"Cyberattacks are no longer a possibility, they're an\ninevitability. Magnet AXIOM Cyber is helping corporations stop further\ndamage and understand how their systems were breached so that they're well\npositioned to secure their assets and can focus on being better prepared to\nface the next attack.\"\n\n    Magnet AXIOM Cyber has played a central role in helping investigators\nmake a difference during post-incident analysis. A department store chain\nwith 100,000 employees recently used Magnet AXIOM Cyber to identify where a\nphishing campaign, which resulted in a business email compromise, first\nbreached the company's systems. An energy and defense corporation with\n15,000 employees leveraged Magnet AXIOM Cyber to track a malware infection\nin its systems and identify what data was lost. A financial services\ncompany with 30,000 employees turned to Magnet AXIOM Cyber to remotely\nacquire explicit images that one employee sent to another to prove the\nlegitimacy of a harassment complaint.\n\n    ABOUT MAGNET FORENSICS\n     Magnet Forensics is a developer of digital investigation software that\nacquires, analyzes, reports on, and manages evidence from computers, mobile\ndevices, IoT devices and the cloud. The company's software is used by more\nthan 4,000 public and private sector organizations in over 90 countries and\nhas been helping investigators fight crime, protect assets and guard\nnational security since 2011.\n\nNeil Desai\n226-243-6337\nPR@magnetforensics.com\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132100214.MNPRE2132101751-06330020211118</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}