{"date": "2022-01-06 13:47:37.912000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3350.44, "close": 3265.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission. </span> </p><p>Welcome to 2022! Is it the same as it ever was? Not quite, as there are ways to get what you need to truly enjoy the new year without draining your wallet. The likes of Amazon, Walmart, Best Buy and more are offering deals and sale events to help you save on everything from home goods and kitchen tools to top-tier tech and style pieces.</p></div><div class=\"tr-npp-body\"><p><span><span>Start off the New Year with deals and shopping advice delivered straight to your phone.</span> Sign up for text message alerts from the experts at Reviewed.</span> </p><p>At Reviewed, we love great deals on amazing products, so we're rounding up all the best sales available right now. Keep scrolling for deep discounts and epic gift ideas for the New Year. </p><p>► <span>Style savings:</span> These Tory Burch deals are extra special with 25% off all sale styles—shop now for chic bags, sandals and more</p><p>► <span>Tech savings:</span> Shop Samsung deals on smartphones, TVs, accessories and more for a limited time</p><p class=\"tr-npp-section-title\">The top 10 New Year sales you can shop right now</p><ol><li><span>Amazon:</span> Every day, Amazon marks down tech products, kitchen essentials, personal care items, fashion and beauty pieces, games and more. Browse Amazon's ever-changing selection of Epic Daily Deals and place your Prime-eligible order for fast and convenient shipping.  <br/>  </li><li><span>Best Buy:</span>  Shop discounts on everything from TVs, headphones and laptops to gaming devices, cell phones and home appliances. Better still, many products are available for curbside pickup—so you can shop online and pick up at a Best Buy store near you.  <br/>  </li><li><span>Coach:</span> Save as much as 50% on a Coach purse, wallet and more. <br/>  </li><li><span>Macy's:</span>  Shop the After Christmas sale to take as much as 60% must-have pieces for your home and closet. <br/>  </li><li><span>Michael Kors:</span> Shop the Michael Kors Big Winter sale and get savings of up to 60% on sale styles. Meanwhile, save big on chic crossbodies, handbags, wallets and more and take an extra 15% off when you enter coupon code <span>BONUS15</span> . Both deals are set to run through  <span>Tuesday, January 4.</span><br/>  </li><li><span>Nordstrom:</span> Shop deals on fashion finds and home favorites at Nordstrom's constantly refreshed sale section. Meanwhile, shop the retailer's Half-Yearly sale for up to 50% off through <span>Sunday, January 2</span> . <br/>  </li><li><span>Tuft &amp; Needle:</span> Tuft &amp; Needle makes our favorite mattress in a box and, through  <span>Sunday, January 2</span>  you can save as much as 20% on the brand's top-rated mattresses and more. <br/>  </li><li><span>The Mirror:</span> Shoppers can save $300 on the cult-favorite smart tech workout screen and get free shipping and installation (a $550 value) for a limited time only.  <br/>  </li><li><span>Target:</span>  Target has your wishlist covered with major markdowns on TVs, smart tech, home goods, fashion and more. For big savings, shop men's and women's fashion pieces and save $10 for every $40 you spend. Shop online for same-day store pick up <span>and</span> same-day delivery through Shipt.  <br/>  </li><li><span>Walmart:</span>  Save big across all categories, including toys, tech and home. Take advantage of convenient shipping and in-store pickup options to get your goodies fast. </li> </ol><p class=\"tr-npp-section-title\">Mattresses and bedding</p><p><span>Avocado:</span> Snag a cozy, customer-favorite mattress from Avocado during the sleep retailer's holiday sale. Through <span>Monday, January 10</span> , you can save $125 on hybrid and latex mattresses with coupon code <span>HOLIDAY</span>  and get as much as $300 off luxury plush mattresses with code <span>JOYFUL</span> . </p><p><span>Awara: </span> The maker of one of our favorite hybrid mattresses is currently hosting its New Year sale through <span>Sunday, January 2</span> . That means you can get a quality mattress for up to $200 off with $499 worth of sleep accessories included free. </p><p><span>Brooklyn Bedding: </span> Keep cozy in the cold with this brand's Winter Clearance event offering 20% off mattresses and 50% off sheets using the promo code <span>WINTER20</span> . Shop fast though, as this sale ends  <span>Tuesday, January 4.</span> </p><p><span>Leesa:</span>  Score a luxury mattress from Leesa at up to $400 off and snag 15% off sleep bundles and 30% off bedding and cushions. Shop fast though, this holiday sale ends <span>Friday, January 14</span> . </p><p><span>Nectar:</span> Shop the Nectar Snoozy New Year sale through  <span>Sunday, January 2 </span> and get $100 off top-tier mattresses and up to $399 worth of accessories (including a sheet set, mattress protector and pillows) for free with your purchase.</p><p><span>Nest Bedding:</span> Take 10% off luxury mattresses, sheet sets and more through <span>Monday, January 10</span> . </p><p><span>Puffy:</span> Refresh your sleep set up with savings of up to $300 on mattresses from Puffy and as much as $455 worth of free sleep accessories, including pillows and sheets.</p><p><span>Purple Mattress:</span>  Save up to 15% on pillows and bedding for a limited time only.</p><p><span>Tuft &amp; Needle:</span> Tuft &amp; Needle makes our favorite mattress in a box and, through  <span>Sunday, January 2</span>  you can save as much as 20% on the brand's top-rated mattresses and more.</p><p class=\"tr-npp-section-title\">Home and kitchen </p><p><span>Amazon:</span> Every day, Amazon marks down tech products, kitchen essentials, personal care items, fashion and beauty pieces, games and more. Browse Amazon's ever-changing selection of Epic Daily Deals and place your Prime-eligible order for fast and convenient shipping. </p><p><span>Bed Bath &amp; Beyond:</span> Shop Bed Bath &amp; Beyond's year-end deals for epic markdowns on bedding, home goods, kitchen essentials and so much more. Save up to 70% on clearance items now. </p><p><span>Bloomingdale's: </span> Through <span>Sunday, January 2</span> , same up to 65% on select items labeled EXTRA 30% OFF. </p><p><span>Butcher Box:</span>   <span>Through Sunday, January 23,</span>  the New Year Bundle which includes a pork butt, chicken thighs and ground beef for free in your first membership delivery.</p><p><span>Crowd Cow:</span>  Save $10 on the Best of Crowd Cow or Best of Beef box from the best meat delivery service we've ever tried. You can also get $10 off your first 10 orders!</p><p><span>Gobble:</span> Get your first six meals for just $36 during Gobble's ongoing holiday sale.</p><p><span>HelloFresh: </span> Get 14 free meals and three surprise gifts for free with a five-week subscription (save $130).</p><p><span>Hexclad:</span> Shop the Hexclad Holiday sale and save as much as 30% on must-have cookware and kitchen essentials. </p><p><span>Keurig:</span>  Stock up on coffee for the New Year. Get $8 off on two boxes of K-Cup Pods with the code  <span>HAPPY2022 </span> through  <span>Sunday, January 2.</span> </p><p><span>Kohl's:</span>  Save as much as 60% on bedding, home goods, fashion pieces and so more. Shops tons of items under $10, $20 and $50 right now.</p><p><span>Macy's:</span>  Take as much as 60% off must-have pieces for your home and closet. </p><p><span>Our Place:</span> Pick up the Instagram-famous Always Pan and Perfect Pot for a $60 savings when you buy the Home Cook Duo bundle. </p><p><span>Pier 1 Imports: </span> Spruce up your home with epic discounts on holiday decor and home goods at Pier 1 Imports. Save up to 90% on select items during the Big Holiday Blowout sale with coupon code  <span>EOS521.</span> </p><p><span>Sur La Table:</span>  Gear up for the New Year with discounts of up to 55% on top-tier cookware, kitchen tools, knives, bakeware and more from Sur La Table. </p><p><span>Thrive Market:</span> Snag up to 30% off grocery orders from Thrive Market. </p><p class=\"tr-npp-section-title\">TVs and electronics </p><p><span>Best Buy:</span>  Shop end-of-year discounts on everything from TVs, headphones and laptops to gaming devices, cell phones and home appliances. Better still, many products are available for curbside pickup—so you can shop online and pick up at a Best Buy store near you. </p><p><span>HP: </span> Shop the Red Tag Sale for sitewide savings on laptops, monitors and more. </p><p><span>QVC: </span> Shop the website's sale section for hundreds of markdowns on electronics, fashion, beauty pieces, home items and more. Meanwhile, if you're a new QVC customer you can use coupon code <span>OFFER</span> to score an extra $15 off your first order.</p><p><span>Samsung:</span> The tech giant is currently offering a variety of its top-tier tech for price cuts, including the Galaxy Z Fold3 5G smartphone for as much as $1,050 off.</p><p><span>Target:</span>  Target has your wishlist covered with major markdowns on TVs, smart tech, home goods, fashion and more. Shop online for same-day store pick up <span>and</span> same-day delivery through Shipt. </p><p class=\"tr-npp-section-title\">Fashion and beauty </p><p><span>Abercrombie &amp; Fitch: </span> Save up to 50% on select men's and women's styles, plus and extra 20% off almost everything else.</p><p><span>Aéropostale: </span> Find must-have styles at up to 80% off right now at Aéropostale and shop tons of clearance items at the lowest prices of the season. </p><p><span>Athleta:</span>  Save as much as 60% on fitness apparel, loungewear and more at Athleta. </p><p><span>Clarks:</span> Score an extra 30% on sale styles when you enter discount code <span>SAVE30</span> at checkout through <span>Thursday, January 6</span> , plus get free shipping when you spend $75 or more. </p><p><span>Coach:</span> Save as much as 50% on a Coach purse, wallet and more.</p><p><span>Dermstore:</span>  Shop markdowns on skincare including 30% off sale items and an extra 10% off with coupon code <span>EXTRA10</span> through <span>Monday, January 3.</span>  </p><p><span>Eddie Bauer:</span>  Save up to 60% off purchases, plus take an extra 40% off clearance styles with coupon code <span>NEWYEAR40.</span> </p><p><span>GlassesUSA:</span> GlassesUSA is Reviewed-approved for affordable eyewear, and for a limited time you can shop its buy one, get one free sale and enjoy free shipping, too. </p><p><span>J.Crew: </span> Use the promo code  <span>BIGSALE </span> only through  <span>today </span> to get an extra 50% off select sale styles.</p><p><span>JCPenney:</span> Shop markdowns across jewelry, toys, home and more at JCPenney and take an extra 20% off select items with coupon code <span>NICEBUY6</span> . </p><p><span>Kate Spade:</span> Enjoy an extra 40% off sale styles with coupon code <span>EXTRA40</span>  through <span>Sunday, January 2</span> . </p><p><span>Kenneth Cole: </span> Shop the End of Season sale for 40% off select full-price styles with promo code <span>ENDOFSEASON</span> . </p><p><span>Madewell:</span> Shop trendy clothes from Madewell and enjoy an extra 30% off sale styles with discount code <span>BYE2021 </span> through  <span>Monday, January 3.</span> </p><p><span>Michael Kors:</span> Shop the Michael Kors Big Winter sale and get savings of up to 60% on sale styles. Meanwhile, save big on chic crossbodies, handbags, wallets and more with an extra 15% off with coupon code <span>BONUS15</span> . Both deals last through  <span>Tuesday, January 4.</span> </p><p><span>Nike:</span> Save up to 40% on thousands of items in Nike's sale section. The sale includes epic markdowns on shoes, apparel and sports equipment, with select items eligible for free in-store pickup. </p><p><span>Nordstrom:</span> Shop deals on fashion finds and home favorites at Nordstrom's constantly refreshed sale section. Meanwhile, shop the retailer's Half-Yearly sale for up to 50% off through <span>Sunday, January 2</span> . </p><p><span>Nordstrom Rack:</span> Snag the best end-of-year deals at Nordstrom Rack, with savings across categories on fashion, home goods and more. Plus, enjoy an extra 25% off clearance items through <span>Sunday, January 2</span> . </p><p><span>Sephora:</span> Scoop an extra 20% off all sale items and get free shipping when you enter coupon codes <span>YEARENDSALE</span>  and <span>FREESHIP</span>  at checkout through  <span>Saturday, January 1</span> . </p><p><span>ThirdLove:</span> Shop ThirdLove's Instagram-famous line of bras and snag up to 50% off plus an extra 25% off when you enter coupon code <span>EXTRA25</span> at checkout. </p><p><span>Tory Burch: </span> Shop the Semi-Annual sale for an extra 25% off sale items. Save big on designer bags, shoes and more through  <span>Sunday, January 9</span> .</p><p class=\"tr-npp-section-title\">Toys and kid's fashion </p><p><span>Hanna Andersson:</span> Parents obsess over the hand-me-down quality of Hanna Andersson's pajamas, and right now the brand is having one of its biggest sales of the year. Save up to 60% on the customer-favorite kids' apparel now. </p><p><span>Walmart:</span>  Save big across all categories, including toys, tech and home.</p><p class=\"tr-npp-section-title\">Appliances </p><p><span>Home Depot:</span> Save up to 40% on appliances, tools and more with free two-day delivery on select purchases. </p><p><span>Lowe's:</span> Refresh your home for the coming year with major savings on appliances, tools and more. Shop Lowe's Deals of the Day for the best daily savings across all categories. </p><p class=\"tr-npp-section-title\">Lifestyle </p><p><span>Academy Sports:</span>  Take as much as 50% off clearance styles for a limited time. Save big on hunting gear, bikes, Nike shoes, Columbia outerwear and so much more. </p><p><span>AeroGarden:</span> Save hundreds on Reviewed-approved garden products during AeroGarden's sitewide sale. Enter coupon code <span>HOLIDAY20</span> at checkout to scoop the savings.</p><p><span>BBQ Guys: </span> Get ready for grilling next year with this End of the Year Blowout sale and save up to 60% on select grills and accessories.</p><p><span>Chewy:</span>  Pick up toys, treats and more for your furry friend at up to 50% off during the retailer's sitewide End of Season savings sale.</p><p><span>Cricut: </span> Reviewed staffers have had a lot of fun with Cricut crafting machines. This week you can ring in the New Year with up to $170 on the Cricut Maker.</p><p><span>The Mirror:</span> Shoppers can save $300 on the cult-favorite smart tech workout screen and get free shipping and installation (a $550 value) for a limited time only. </p><p>​​​​ <span>NordicTrack:</span>  Shop the New Year's sale for big savings on Reviewed-approved exercise equipment and fitness machines. </p><p class=\"tr-npp-section-title\">Furniture </p><p><span>Overstock:</span> Snag big savings on furniture and home goods during Overstock's Christmas Clearance sale. During the sale, you can shop thousands of items for up to 70% off and enjoy free standard shipping on all orders.</p><p><span>Wayfair:</span> Save as much as 60% during Wayfair's End-of-Year Clearance sale. During the shopping event, you can save big on bedding, holiday décor, area rugs and so much more. </p><p><span><span>There's more where this deal came from.</span>  Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Shop the 62 best New Year sales at Amazon, Walmart, Best Buy and more right now</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}