{"date": "2022-02-18 07:17:51+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3162.01, "close": 3052.03}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds quotes and details from ruling</p><p class=\"tr-by\">By Byron Kaye</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">SYDNEY, Feb 18 (Reuters)</span><span class=\"tr-dl-sep\"> - </span><span class=\"tr-strong\">Australia's New South Wales </span>state ordered <span class=\"tr-strong\">employers of freelance delivery drivers such as Amazon</span>.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> to pay a minimum rate, a decision hailed by a union as making it the world's first jurisdiction to compel the retailer to follow <span class=\"tr-strong\">laws </span>on such payments.</p><p>The measure, to be phased in over three years from March 1, requires c<span class=\"tr-strong\">ompanies which hire drivers with their own small vehicles to pay</span> a minimum of A$37.80 ($27.20) per hour in Australia's most populous state.</p><p>That makes the state, the headquarters of Amazon's operations in Australia, the first place where <span class=\"tr-strong\">the retail giant </span>must pay wages to contractors that are set by law, the Transport Workers' Union (TWU) said.</p><p>\"Gig behemoths are on notice: this is what happens when workers call out these dangerous bottom feeders and fight together for a fair day's pay,\" said the union's national secretary, Michael Kaine.</p><p>\"For too long the likes of Amazon have been able to exploit independent contractor loopholes to sidestep rights and rip workers off fair rates of pay,\" he added in a statement.</p><p>An Amazon spokesperson said the company was \"pleased to continue offering Amazon Flex delivery partners competitive pay as well as the flexibility to work when it suits them\".</p><p>Flex drivers with a sedan in New South Wales already earned more, on average, than the enforceable rate that would take effect from March 1, the spokesperson added.</p><p><span class=\"tr-strong\">The minimum wage ruling applies to all companies which hire casual delivery drivers with cars weighing less than two tonnes, according to the New South Wales Industrial Relations Commission ruling, which was reviewed by Reuters. Amazon is the dominant employer of small car drivers with thousands of contractors in the state, the union says.</span></p><p>    Shares of the $1.6-trillion company have nearly doubled in value over the past two years, as the COVID-19 pandemic prompted a rush to online shopping.</p><p>But it has faced scrutiny over perceptions that it takes a hands-off approach to front-line worker safety and labour laws in the countries where it operates. </p><p>Last year, the U.S. Federal Trade Commission ordered Amazon to pay $61.7 million to reimburse Flex drivers for tips it was accused of stealing. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2K81I4\" data-type=\"storyId\" data-story-id=\"nL1N2K81I4\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Since Flex launched in Australia in 2020, drivers, who use their own vehicles to deliver by deadline packages picked up from Amazon distribution centres, have received varying amounts set by the company as they are not technically employees.</p><p>Friday's ruling by the New South Wales Industrial Relations Commission confirms that it is possible for all workers to have access to enforceable rights and protections, regardless of employment status, the TWU said.</p><p>\"<span class=\"tr-strong\">Having regard to the parties' submissions and evidence, I am satisfied that the variations proposed...would result in fair and reasonable conditions for the contract carriers to whom they apply,\" wrote commissioner Damian Sloan in the ruling.</span></p><p>    </p><p>($1=A$1.3897)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Byron Kaye; Editing by Clarence Fernandez, Robert Birsel)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:byron.kaye@thomsonreuters.com\" data-type=\"email\" translate=\"no\">byron.kaye@thomsonreuters.com</a> ; +612 9171 7541; @byronkaye;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-AUSTRALIA/WAGES (UPDATE 2)</p></div>"}