{"date": "2022-01-04 15:18:09+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>TAURIGA SCIENCES INC (\"TAUG-0\")\n- Generates Record Quarterly Net Revenue, from Both Amazon and\n- E-Commerce Business Segment\n\n     Tauriga Sciences, Inc. (\"Tauriga\" or the \"Company\"), a New York based\ndiversified Life Sciences Company, announced that it has generated record\nQuarterly results from both E-Commerce and Amazon.  The Company's\nE-Commerce business segment, powered by Shopify, grew by approximately 75%\non a Quarter-to-Quarter sequential basis (\"Q-to-Q\"). Additionally, the\nCompany's Amazon (Amazon Prime) business grew by approximately 60% Q-to-Q.\n\n     For the first time, Quarterly net E-Commerce sales exceeded\n$110,000.00 USD.  The Company's E-Commerce business segment is, by far, its\nhighest \"gross margin\" revenue source.\n\n     In other news, on January 1, 2022, the Company officially launched its\nnew and improved E-Commerce Website (www.taurigum.com).\n\n     ABOUT TAURIGA SCIENCES INC.\n\n     Tauriga Sciences, Inc. (TAUG) is a revenue generating, diversified\nlife sciences company, engaged in several major business activities and\ninitiatives.  The company manufactures and distributes several proprietary\nretail products and product lines, mainly focused on the Cannabidiol\n(\"CBD\") and Cannabigerol (\"CBG\") Edibles market segment.  The main product\nline, branded as Tauri-Gum(TM), consists of a proprietary supplement\nchewing gum that is Kosher certified, Halal certified, and Vegan Formulated\n(CBD Infused Tauri-Gum(TM) Flavors: Mint, Blood Orange, Pomegranate), (CBG\nInfused Tauri-Gum(TM) Flavors: Peach-Lemon, Black Currant), (DELTA 8 THC\nInfused Tauri-Gum(TM) Flavor: Evergreen Mint), (Vitamin C + Zinc Infused\nTauri-Gum(TM) Flavor: Pear Bellini), (Caffeine Infused Tauri-Gum(TM)\nFlavor: Cherry Lime Rickey), &amp; (Vitamin D3 Infused Tauri-Gum(TM) Flavor:\nGolden Raspberry).  The Company's commercialization strategy consists of a\nbroad array of retail customers, distributors, and a fast-growing\nE-Commerce business segment (E-Commerce website: www.taurigum.com). Please\nvisit our corporate website, for additional information, as well as\ninquiries, at <a href=\"http://www.tauriga.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.tauriga.com</a>\n\n     Complementary to the Company's retail business, is its ongoing\nPharmaceutical Development initiative.  This relates to the development of\na proposed Pharmaceutical grade version of Tauri-Gum(TM), for nausea\nregulation (specifically designed for the following indication: Patients\nSubjected to Ongoing Chemotherapy Treatment). On March 22, 2021, the\nCompany announced that it had Converted its U.S. Provisional Patent\nApplication (filed on March 17, 2020) into a U.S. Non-Provisional Patent\nApplication.  The Patent, filed with the U.S.P.T.O. is Titled \"MEDICATED\nCBD COMPOSITIONS, METHODS OF MANUFACTURING, AND METHODS OF TREATMENT\".  On\nDecember 18, 2020 the Company disclosed that it had entered into a Master\nServices Agreement with CSTI to lead the Company's clinical development\nefforts.\n\n     The Company is headquartered in Wappingers Falls, New York.  In\naddition, the Company operates two full time E-Commerce fulfillment\ncenters: one located in Montgomery, Texas and the other in Brooklyn, New\nYork.\n\n     DISCLAIMER -- Forward-Looking Statements\n\n     This press release contains certain \"forward-looking statements\" as\ndefined by the Private Securities Litigation Reform Act of 1995 which\nrepresent management's beliefs and assumptions concerning future events.\nThese forward-looking statements are often indicated by using words such as\n\"may,\" \"will,\" \"expects,\" \"anticipates,\" believes, \"hopes,\" \"believes,\" or\nplans, and may include statements regarding corporate objectives as well as\nthe attainment of certain corporate goals and milestones. Forward-looking\nstatements are based on present circumstances and on management's present\nbeliefs with respect to events that have not occurred, that may not occur,\nor that may occur with different consequences or timing than those now\nassumed or anticipated. Actual results may differ materially from those\nexpressed in forward looking statements due to known and unknown risks and\nuncertainties, such as are not guarantees of general economic and business\nconditions, the ability to successfully develop and market products,\nconsumer and business consumption habits, the ability to consummate\nsuccessful acquisition and licensing transactions, fluctuations in exchange\nrates, and other factors over which Tauriga has little or no control. Many\nof these risks and uncertainties are discussed in greater detail in the\n\"Risk Factors\" section of Tauriga's Form 10-K and other periodic filings\nmade from time to time with the Securities and Exchange Commission. Such\nforward-looking statements are made only as of the date of this release,\nand Tauriga assumes no obligation to update forward-looking statements to\nreflect subsequent events or circumstances. You should not place undue\nreliance on these forward-looking statements.\n\n\nContact:\n\n     Tauriga Sciences, Inc.\n\n     4 Nancy Court, Suite 4\n\n     Wappingers Falls, NY 12590\n\n     Chief Executive Officer\n\n     Mr. Seth M. Shaw\n\n     Email: sshaw@tauriga.com\n\n     cell # (917) 796 9926\n\n     Company Instagram: @taurigum\n\n     Personal Instagram: @sethsms47\n\n     Twitter: @SethMShaw\n\n     Corp. Website:   www.tauriga.com\n\n     E-Commerce Website:  www.taurigum.com\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200300617.MNPRE2200302115-07164720220104</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}