{"date": "2021-12-03 21:12:57.992000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3437.36, "close": 3427.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Dec 02, 2021</p></div><div class=\"tr-npp-lead\"><p><span>Amazon</span><a href=\"https://www.zacks.com/stock/quote/AMZN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AMZN</a> is continuously gaining customer momentum in the booming cloud market.Its cloud computing platform — Amazon Web Services (\"AWS\") — is picked by the largest social media platform,<span>Meta</span><a href=\"https://www.zacks.com/stock/quote/FB\" data-type=\"url\" class=\"tr-link\" translate=\"no\">FB</a> , as the strategic cloud provider.This highlights the efficiency and reliability of AWS's innovative cloud products and services. Further, the move has strengthened the relationship between the two.Notably, Meta will expand the use of compute, storage, databases, and security services of AWS for ensuring privacy.To be precise, in order to boost AI research and development activities for the Meta AI group, Meta will leverage AWS's compute services. Also, it will run third-party collaborations on AWS.Further, Meta and AWS will aid developers in building, training, deploying, and operating AI and machine learning (ML) models by running PyTorch on the latter's cloud platform. Also, enterprises will be able to leverage the integration of PyTorch with Amazon Elastic Compute Cloud (Amazon EC2) and Amazon SageMaker.</p><p>The latest selection by Meta added strength to AWS's expanding clientele, which has been persistently aiding growth of the latter's top line.AWS, which has become the key catalyst behind Amazon's growth, generated $16.1 billion in revenues in third-quarter 2021, up 39% year over year, accounting for 14.5% of revenues.Strengthening the customer base on the back of AWS's robust product and services portfolio will continue to benefit Amazon significantly in the days ahead. This, in turn, will continue to instill investor optimism in the stock.Notably, Amazon has returned 5.7% on a year-to-date basis against the industry's decline of 33.5%.</p></div><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">Expanding Clientele</p><p>Image Source: Zacks Investment Research</p><p>Apart from Meta, Aurora has recently chosen AWS as its preferred cloud provider for machine learning training and cloud-based simulation workloads.Further, Nasdaq has signed a multi-year agreement with AWS in a bid to accelerate the development of advanced cloud-enabled infrastructure for the world's capital markets. It is gearing up to transfer its North America markets to AWS.Richemont, which is shifting its enterprise IT infrastructure to AWS, recently selected the latter as its preferred cloud provider. Also, Gilead Sciences picked AWS as the preferred cloud provider to accelerate the development process and delivery of medicines.Further, adidas picked AWS as its preferred cloud provider for SAP workloads. adidas will shift its SAP workloads to the latter to digitize its core business processes.Furthermore, Discovery expanded its relationship with AWS to drive its transformation in the cloud. Also, the Federal National Mortgage Association - Fannie Mae is shifting IT workloads from on-premises data centers to AWS.Additionally, American International Group and United Airlines selected AWS as their preferred cloud provider.Apart from this, India-based Apollo Tyres went all-in on AWS and is migrating its IT infrastructure to the latter's cloud platform.</p><p class=\"tr-npp-section-title\">Competitive Scenario</p><p>Amazon's strong efforts toward expanding its cloud-computing offerings will continue to aid it in winning customers. This, in turn, will continue to boost its cloud dominance and competitive edge against its peers like<span>Microsoft</span><a href=\"https://www.zacks.com/stock/quote/MSFT\" data-type=\"url\" class=\"tr-link\" translate=\"no\">MSFT</a> and<span>Alphabet</span>'s <a href=\"https://www.zacks.com/stock/quote/GOOGL\" data-type=\"url\" class=\"tr-link\" translate=\"no\">GOOGL</a> Google.Per the latest Canalys report, AWS accounted for 32% of the global cloud spending in third-quarter 2021, sustaining its leading position in the booming cloud market.Microsoft's Azure, the second-largest cloud-service provider, accounted for 21% of the worldwide cloud spending. Alphabet's Google Cloud represented 8% of the cloud spending, marking itself the third-largest cloud provider.However, Amazon, which presently carries a Zacks Rank #5 (Strong Sell), is facing stiff competition from Microsoft and Alphabet as both are targeting a bigger slice of the market on the back of their advancing cloud portfolios, which are bumping up their cloud revenues. This poses a serious challenge to Amazon's dominant position in the cloud market.</p><p>You can see<span><a href=\"https://www.zacks.com/stocks/buy-list/?ADID=zp_1link_invideas&amp;ICID=zpi_1link_invideas\" data-type=\"url\" class=\"tr-link\" translate=\"no\">the complete list of today's Zacks #1 Rank (Strong Buy) stocks here</a> </span>.Alphabet generated $4.9 billion of revenues from Google Cloud in third-quarter 2021, up 44.9% year over year.Microsoft's cloud revenues were $20.7 billion in first-quarter fiscal 2022, up 36% year over year.</p><p><span>Infrastructure Stock Boom to Sweep America</span></p><p>A massive push to rebuild the crumbling U.S. infrastructure will soon be underway. It's bipartisan, urgent, and inevitable. Trillions will be spent. Fortunes will be made.</p><p>The only question is \"Will you get into the right stocks early when their growth potential is greatest?\"</p><p>Zacks has released a Special Report to help you do just that, and today it's free. Discover 7 special companies that look to gain the most from construction and repair to roads, bridges, and buildings, plus cargo hauling and energy transformation on an almost unimaginable scale.</p><p><a href=\"https://www.zacks.com/registration/ultimatetrader/welcome/eoffer/3b9f?add=1728&amp;adid=NEWSTEX_CONTENT_ZU_INFRASTRUCTUREREPORT_ANALYSTBLOG_253_12022021&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1834470\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Download FREE: How to Profit from Trillions on Spending for Infrastructure &gt;&gt;</a></p><p>Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.</p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=RPT_7BST_LP194&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1834470\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Click to get this free report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=AMZN&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1834470\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. (AMZN): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=MSFT&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1834470\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Microsoft Corporation (MSFT): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=FB&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1834470\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Meta Platforms, Inc. (FB): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=GOOGL&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1834470\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Alphabet Inc. (GOOGL): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/stock/news/1834470/amazon-s-amzn-aws-gets-picked-by-meta-grows-clientele?cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1834470\" data-type=\"url\" class=\"tr-link\" translate=\"no\">To read this article on Zacks.com click here.</a></p><p>The views expressed in any and all content distributed by Newstex and its re-distributors (collectively, the \"Newstex Authoritative Content\") are solely those of the respective author(s) and not necessarily the views of Newstex or its re-distributors. Stories from such authors are provided \"AS IS,\" with no warranties, and confer no rights. The material and information provided in Newstex Authoritative Content are for general information only and should not, in any respect, be relied on as professional advice. Newstex Authoritative Content is not \"read and approved\" before it is posted. Accordingly, neither Newstex nor its re-distributors make any claims, promises or guarantees about the accuracy, completeness, or adequacy of the information contained therein or linked to from such content, nor do they take responsibility for any aspect of such content. The Newstex Authoritative Content shall be construed as author-based content and commentary. Accordingly, no warranties or other guarantees are offered as to the quality of the opinions, commentary or anything else appearing in such Newstex Authoritative Content. Newstex and its re-distributors expressly reserve the right to delete stories at its and their sole discretion.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Zacks Investment Research</p></div>"}