{"date": "2021-12-23 15:48:12.156000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.34, "close": 3421.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><a href=\"https://www.independent.co.uk/topic/PremierLeague\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Premier League</a> matches will be streamed on <a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> from the 2019/20 season after the US tech giant purchased one of the broadcasting rights packages in a landmark move for the game.</p><p><a href=\"https://www.independent.co.uk/topic/SkySports\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Sky Sports</a> and <a href=\"https://www.independent.co.uk/topic/BT_Sport\" data-type=\"url\" class=\"tr-link\" translate=\"no\">BT Sport</a> will continue to broadcast games after purchasing rights to 160 matches for almost £4.5bn earlier this year, but they will do so alongside Amazon, who will show 20 matches per season for an initial three year period.</p></div><div class=\"tr-npp-body\"><p>They have moved to secure one of the two remaining packages with BT buying up the other for £90m bringing their total outlay to nearly £1bn. From August 2019 they will now show 52 games per season with Sky 128.</p><p>Amazon's offering will see every Premier League club featured across two full rounds of 20 matches per season, the first of which will be midweek games in December and then all 10 games on Boxing Day, a first for the UK.</p><p>It is also the first time that packages of livestreaming games have been offered and it is understood that the growing audience in the US in particular has persuaded Amazon to take the plunge.</p><p>Premier League executive chairman Richard Scudamore has welcomed the move.</p><p><span>Read More:</span><a href=\"https://www.independent.co.uk/compare/broadband-deals/providers/sky\"><span>Sky Broadband deals and offers</span> </a> </p><p>\"We are extremely pleased that Sky Sports, BT Sport and Amazon have invested in these rights and all view the Premier League and our clubs as vital parts of their live sports offerings,\" he said.</p><p>The company confirmed the move will come at no extra cost to existing Prime Video users but for those not already subscribed to the £7.99 per month streaming service it will see a further increase in the cost of watching football which has drawn an understandably mixed response from fans.</p><p>But vice president of Prime Video in Europe, Jay Marine, says supporters of every club will now have the chance to watch their team.</p><p>\"We are always looking to add more value to Prime, and we're delighted to now offer, for the first time, live Premier League matches to Prime members at no extra cost to their membership,\" he added.</p><p>\"The Premier League is the most watched sports league in the world. Over these two December fixture rounds Prime members will be able to watch every team, every game, so no matter which Premier League team you support, you're guaranteed to see them play live on Prime Video.\"</p><p>Facebook were understood to be interested in one of the remaining unsold packages but it is Amazon who has won through breaking the current stranglehold held by Sky and BT.</p><p>Fifteen of BT's extra games will come from two midweek fixture programmes and five from a new split weekend in January which will enable the Premier League to take a midwinter break for the first time.</p><p>This move continues Amazon's diversification into sport following the multi-million dollar decision in April to buy up the exclusive UK rights to show US Open tennis.</p><p>The announcement came at the Premier League's annual meeting on Thursday which also saw clubs agree for the first time to distribute some foreign television revenue based on where a team finishes from the 2019/20 season.</p><p><span>How the games will be split</span> </p><p><span>Sky Sports (128 live games)</span> </p><p><span>Packages:</span> Four <span>Broadcast slots:</span> Saturday (5:30pm/7:45pm); Sunday (2pm/4:30pm); Monday (8pm); Friday (7:30pm/8pm)</p><p><span>BT Sport (52 live games)</span> </p><p><span>Packages:</span> Two <span>Broadcast slots:</span> Saturday (12:30pm); Midweek (7:45pm/8pm *TBC)</p><p><span>Amazon (20 live games)</span> </p><p><span>Packages:</span> One <span>Broadcast slots:</span> Boxing Day (kick-off tbc); Midweek (7:45pm/8pm *TBC)</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/sport/football/andy-robertson-suspended-liverpool-chelsea-leeds-b1981434.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Andy Robertson to miss Chelsea game after Liverpool match postponed</a> </p><p><a href=\"https://www.independent.co.uk/sport/football/jack-cork-euros-cork-everton-watford-b1981391.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Jack Cork has goal celebration planned for son if he can end scoring drought</a> </p><p><a href=\"https://www.independent.co.uk/sport/football/liverpool-leeds-wolves-watford-postponed-fixtures-b1981386.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Liverpool vs Leeds and Wolves vs Watford postponed</a> </p><p><a href=\"https://www.independent.co.uk/sport/football/jurgen-klopp-liverpool-contract-b1981365.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Jurgen Klopp wishes he'd joined Liverpool 'much earlier'</a> </p><p><a href=\"https://www.independent.co.uk/sport/football/aston-villa-callum-hudsonodoi-thomas-tuchel-romelu-lukaku-covid-b1981325.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Chelsea hoping Romelu Lukaku and Callum Hudson-Odoi fit to face Aston Villa</a> </p><p><a href=\"https://www.independent.co.uk/sport/football/africa-cup-of-nations-date-players-b1981311.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">When is the AFCON and which Premier League players are going?</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Independent, The (UK) (Online). All rights reserved.</p></div>"}