{"date": "2021-01-28 07:02:41.523000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3899.0, "close": 3706.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 1266NGB Group PLC28 January 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>Embargoed until 7.00 a.m.</span>\n</p>\n</td>\n<td>\n<p>\n<span>28 January 2021</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<p>\n<span>GB GROUP PLC</span>\n</p>\n<p>\n<span>(\"GBG\", the \"Group\" or the \"Company\")</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Succession Plan for CFO</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>GBG is pleased to announce the appointment of David Mathew Ward to its Board as its new CFO, replacing Dave John Wilson, who is stepping down from the Board and retiring as CFO and COO after 12 years. It is anticipated that David Ward will join GBG on 17 <span>th</span> May 2021, with Dave Wilson leaving at the end of June thereby providing sufficient time to complete an orderly handover.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The Board would like to thank Dave Wilson for his significant contribution to the growth and success of GBG during his time as CFO. During Dave's tenure at GBG the Group has evolved from a small UK operation to a truly international business with over 65% of revenue generated outside the UK (as per 6 months ended 30 Sept 2020), customers in over 70 countries and team members in 16 countries. Over the same period, GBG has increased its market capitalisation more than 100x, from c. £14.2m in April 2009 to c. £1.7bn today.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>David Ward is a highly experienced, successful and well-regarded business leader who has spent the last 10 years with AVEVA Group plc ('AVEVA'), the FTSE 100 global software group. Prior to the merger with the software business of Schneider Electric, David was CFO, subsequently becoming Finance Director &amp; Company Secretary of the enlarged group. During his time with AVEVA, the company has scaled financially and geographically, with David leading a number of M&amp;A projects, as well as restructuring finance, business operations and processes. David is an economics graduate and a qualified chartered accountant, having spent his early career with Ernst &amp; Young. The combination of his experience, drive and culture makes him an ideal fit for GBG's next stages of growth.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>David Rasche, Chairman of GBG, said:</span>\n</p>\n<p>\n<span>\"I would like to thank Dave Wilson for his 12 years with GBG, during which time he has been a key member of the Board helping to transform the business and deliver outstanding shareholder returns. In terms of product portfolio, customer focus and success, international growth and delivering shareholder value, GB Group has come a long way from the business Dave joined. Dave is highly respected by our investor community and by all his colleagues in the business.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\"I know that Dave will remain a good friend of the business and we wish him well for his retirement.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\"After a thorough and rigorous search process initiated with Odgers Berndtson, the Board is delighted that David Ward has agreed to join GBG as its CFO. David has been key to impressive growth and financial governance improvements at AVEVA over his tenure and I am confident that his experience will be an asset to GBG as we continue our own growth story\".</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Chris Clark, Chief Executive of GBG, said;</span>\n</p>\n<p>\n<span>\"I'd like to thank Dave Wilson personally for his focus and support since I joined GBG four years ago. It has been a pleasure working with him. As we continue our ambitious growth journey I am delighted that David Ward has decided to join me and the GBG Board. During the search it became clear that David has really strong experience of leading a business along an international growth trajectory, similar to what we have ahead. We also believe that his style will be a great fit with the culture of GBG, something that we are very careful to nurture and evolve.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Dave Wilson, CFO &amp; COO of GBG, said;</span>\n</p>\n<p>\n<span>\"It has been a privilege to work with past and present team members, who are the essence of such a great business. My 12 years at GBG has been fun and rewarding, which has given me many proud moments. It is the right time for me to move to non-executive roles, and I thank the Board, our team, advisors and the investment community for their support over the years\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Commenting on his new role, David Ward added:</span>\n</p>\n<p>\n<span>\"The fundamental strengths of GBG's products and the opportunities which exist for the business within its markets, made this opportunity instantly compelling. Having met various members of the Board and Executive, it became clear that the culture and focus of the business are important strengths. It is rare to find a business with the market opportunity, strategy and ambition to deliver, combined with the culture to succeed. I will be joining GBG at a very exciting chapter in its growth journey and look forward to leveraging my experience of international expansion and finance operations to enable further success building on Dave's impressive legacy.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>As part of David Ward's remuneration, upon taking up his appointment ('Date of Grant') he will receive an option over 150,000 Ordinary Shares in the capital of the Company as compensation to match the earnings and incentives forfeited on leaving his previous employer (the 'Compensatory Options'). The Compensatory Options will be issued at an exercise price of 2.5 pence per Ordinary Share and will vest in equal tranches on the first, second and third anniversary from the Date of Grant provided he still holds the position of CFO of GBG on the respective dates. In addition, vesting of the second and third tranches will also be subject to achievement of EPS and TSR performance targets in line with the Group's objectives and beyond. The Compensatory Options are valid for a period of 12 months from the vesting date.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>In accordance with Rule 17 and paragraph (g) of Schedule 2 of the AIM Rules for Companies, David Mathew Ward (44) holds or has held in the past 5 years the following directorships and partnerships:</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Current:</span>\n</p>\n<p>\n<span>8over8 Limited (in liquidation)</span>\n</p>\n<p>\n<span>AVEVA de Mexico S. de R.L. de C.V.</span>\n</p>\n<p>\n<span>AVEVA Limited</span>\n</p>\n<p>\n<span>AVEVA AB</span>\n</p>\n<p>\n<span>AVEVA AB branch in Finland</span>\n</p>\n<p>\n<span>AVEVA Consulting Limited</span>\n</p>\n<p>\n<span>AVEVA Finance Limited</span>\n</p>\n<p>\n<span>AVEVA Financing Limited</span>\n</p>\n<p>\n<span>AVEVA GmbH</span>\n</p>\n<p>\n<span>AVEVA GmbH branch in Austria</span>\n</p>\n<p>\n<span>AVEVA KK</span>\n</p>\n<p>\n<span>AVEVA Korea Limited</span>\n</p>\n<p>\n<span>AVEVA PTE Limited</span>\n</p>\n<p>\n<span>AVEVA Solutions Limited</span>\n</p>\n<p>\n<span>AVEVA Software and Services SA de CV</span>\n</p>\n<p>\n<span>AVEVA Yazilim Ve Hizmetleri A.S.</span>\n</p>\n<p>\n<span>AVEVA Chile SPA</span>\n</p>\n<p>\n<span>AVEVA Denmark A/S</span>\n</p>\n<p>\n<span>AVEVA East Asia Limited</span>\n</p>\n<p>\n<span>AVEVA Engineering It Limited</span>\n</p>\n<p>\n<span>AVEVA Group Plc</span>\n</p>\n<p>\n<span>AVEVA Information Technology India Private Limited</span>\n</p>\n<p>\n<span>AVEVA Managed Services Limited</span>\n</p>\n<p>\n<span>AVEVA (The Netherlands) BV</span>\n</p>\n<p>\n<span>AVEVA SA</span>\n</p>\n<p>\n<span>AVEVA SA branch in Italy</span>\n</p>\n<p>\n<span>AVEVA SA branch in Spain</span>\n</p>\n<p>\n<span>AVEVA (Shanghai) Consultancy Co Limited</span>\n</p>\n<p>\n<span>AVEVA Solutions (Shanghai) Co., Ltd</span>\n</p>\n<p>\n<span>AVEVA UK 1 Limited</span>\n</p>\n<p>\n<span>AVEVA GmbH Sp. z o.o. Oddzial w Polsce</span>\n</p>\n<p>\n<span>Cadcentre Engineering It Limited</span>\n</p>\n<p>\n<span>Cadcentre Limited</span>\n</p>\n<p>\n<span>Cadcentre Property Limited</span>\n</p>\n<p>\n<span>Fabtrol Systems, Uk Limited (in liquidation)</span>\n</p>\n<p>\n<span>LFM Software Limited</span>\n</p>\n<p>\n<span>Schneider Electric Software GB Denmark branch, filial af Schneider Electric Software GB Ltd., England</span>\n</p>\n<p>\n<span>Schneider Electric Software Netherlands B.V.</span>\n</p>\n<p>\n<span>Schneider Electric Software Spain S.L.</span>\n</p>\n<p>\n<span>Schneider Electric Software France SAS</span>\n</p>\n<p>\n<span>Schneider Electric Software GB Limited</span>\n</p>\n<p>\n<span>Schneider Electric Software RU (in liquidation)</span>\n</p>\n<p>\n<span>Schneider Electric Software Holdings Netherlands B.V.</span>\n</p>\n<p>\n<span>Schneider Electric Software Italia S.p.A.</span>\n</p>\n<p>\n<span>Tribon Solutions (Uk) Limited</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Past:</span>\n</p>\n<p>\n<span>AVEVA Group PLC where he was CFO &amp; Main Board Director from July 2016 to February 2018. A Board re-structure took place as a result of the AVEVA merger with Schneider Electric SE.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Mr Ward holds no shares in the Company.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>There is no further information required to be disclosed in respect of the above appointment pursuant to Schedule 2 (g) of the AIM Rules for Companies.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>For further information, please contact:</span>\n</p>\n<p>\n<span>\n</span></p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>GBG</span>\n</p>\n<p>\n<span>Chris Clark, CEO &amp; Dave Wilson, CFO &amp; COO</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>+44 (0) 1244 657333</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Peel Hunt LLP (Nominated Adviser and Broker)</span>\n</p>\n<p>\n<span>Edward Knight, Paul Gillam &amp; Nick Prowting</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>+44 (0) 20 7418 8900</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Tulchan Communications LLP</span>\n</p>\n<p>\n<span>James Macey White, Matt Low &amp; Tom Blundell</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>+44 (0) 20 7353 4200</span>\n</p>\n<p>\n<span>\n<a href=\"mailto:GBG@tulchangroup.com\" data-type=\"email\" translate=\"no\">GBG@tulchangroup.com</a>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Website</span>\n</p>\n</td>\n<td>\n<p>\n<span>\n<a href=\"http://www.gbgplc.com/investors\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.gbgplc.com/investors</a>\n</span>\n<span>\n</span></p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<p>\n<span>About GBG</span>\n</p>\n<p>\n<span>GBG offers a range of solutions that help organisations quickly validate and verify the identity and location of their customers.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Our market-leading technology, data and expertise help our customers improve digital access, deliver a seamless experience and establish trust, so that they can transact quickly, safely and securely with their customers online.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Headquartered in the UK and with over 1,000 team members across 16 countries, we work with 20,000 customers in over 70 countries. Some of the world's best-known businesses rely on GBG to provide digital services and keep the economy moving, from US e-commerce giants to Asia's biggest banks and European household brands. </span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>To find out more about how we help our customers establish trust with their customers, visit</span>\n<span>\n<a href=\"http://www.gbgplc.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.gbgplc.com</a>\n</span>\n<span>and follow us on LinkedIn and Twitter @gbgplc.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> . <br/>\n<br/> RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>BOAVDLFLFFLEBBF</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}