{"date": "2021-12-23 01:00:00.051000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.34, "close": 3421.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>TOKYO, Dec.  23, 2021  (GLOBE NEWSWIRE) -- Amazon Web Services (AWS) and global consulting firm, Slalom, today announced Japan’s first AWS | Slalom Launch Center (launch center) to help maximize value, align priorities, and accelerate outcomes for Japanese organizations by accelerating their cloud migration and modernizing their IT services.<br/></p><p>In December 2019, AWS and Slalom <a href=\"https://www.globenewswire.com/Tracker?data=kv-pXZQZDuvl7jpf1HUligl6pzDis_BPua_qvUQeaB2Dzvy3ys3VP2SsZ8zyXhmKlw3HMxZZ8pfTp3n_ab6wbA==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">announced</a> a multi-year, global, Strategic Collaboration Agreement (SCA) to establish Launch Centers around the world. This Japanese Launch Center is the first in a non-English speaking country and joins locations in Atlanta, Chicago, Seattle and Australia. It strengthens Slalom’s existing relationship as an AWS Premier Consulting Partner globally.</p><p>The Launch Center uniquely combines AWS Professional Services, a global team of AWS experts who help customers reach their desired outcomes with the cloud, with Slalom’s business transformation, software engineering, and analytics capabilities to help customers achieve optimized, cloud-based operating models.</p><p>The Launch Center will provide a variety of offerings, including expediting customer migration to AWS, and a customized approach to help organizations drive productivity, improve customer experience, and leverage data and analytics. This model enables customers to reap the benefits of working directly with experts in a secure, immersive, and collaborative environment that drives a culture of innovation and learning as they derive the benefits from moving to the cloud.</p><p>A physical office location will be unveiled in Tokyo next year, with the Launch Center operating virtually to customers across the country for now due to COVID-19 workplace restrictions in Japan. Slalom launched in Japan earlier this year, a move that will bring 250 new jobs to the region over the next two years. The company aims to help local businesses with digital transformation and technology solutions, specializing in areas such as business transformation, cloud architecture, product engineering, data modernization, and analytics.</p><p>Slalom Japan Country Managing Director, Ko Asami said: “While Japan is adopting cloud platform, only a handful of organizations benefit from structural transformation of their core businesses.  The recently published DX Report 2.1 by the Ministry of Economy which describes the future of digital industry and the direction of organization transformation that highlights 'adopting digital capabilities to create value with connecting the eco system and customers'.  Combining AWS's advanced cloud platform with Slalom's digital native capability and experience provides Japanese companies with 'competitive' digital transformation.”</p><p>AWS Head of Partner Success Asia Pacific and Japan, Corrie Briscoe said: “Enterprises are looking to achieve their target business outcomes faster by transitioning to a modern, optimized, cloud-based model. This Launch Center will help local organizations to quickly transition their infrastructure, workforce, processes, and applications to the cloud, in a unique and immersive environment. Through this joint collaboration, our aim is to equip organizations with the tools to make the transition to the cloud, with the confidence of having Slalom’s proven consulting and technical skills and AWS’s leading cloud services and migration experience supporting them. We are pleased to expand our relationship with Slalom and collaborate to transform Japanese organizations as they modernize their systems, increase efficiency, and drive innovation leveraging AWS.”</p><p>About Slalom:</p><p>Slalom is a global consulting firm focused on strategy, technology, and business transformation. In 41 markets around the world, Slalom's teams have autonomy to move fast and do what's right. They are backed by regional innovation hubs, a global culture of collaboration, and partnerships with the world's top technology providers. Founded in 2001 and headquartered in Seattle, Slalom has organically grown to over 11,000 employees. Slalom has been named one of Fortune's 100 Best Companies to Work For six years running and is regularly recognized by employees as a best place to work. Learn more at <a href=\"https://www.globenewswire.com/Tracker?data=BLuJKAE6GQuAYyut203u_Ay4Zv3fYGsoX1UqKW3qBN7WCdNoQ2WM_TeH3byKXBTvN2gx6XzaFcJPWKq5BLovvQ==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">slalom.com</a>.</p><p>Slalom<br/>press@slalom.com</p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODQxNjc1MCM0NjI3NjAzIzIwOTc0OTA=\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RReE5qYzFNQ00wTmpJM05qQXpJekl3T1RjME9UQT0=&amp;key=1632f1674e34493a1018be33f211262d157db479b6aca04831234708cac9311223b4edd3791f4b8062a4f88ce947c7d28e98507c91b9a39a57ceb366e7e09029\"/></div></div><br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/OGVmNTcxMjMtNjA4NC00MTQ5LWJmZmQtZTJjNGVkOWI3NWU5LTExMDkwNjE=/tiny/Slalom.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9PR1ZtTlRjeE1qTXROakE0TkMwME1UUTVMV0ptWm1RdFpUSmpOR1ZrT1dJM05XVTVMVEV4TURrd05qRT0vdGlueS9TbGFsb20ucG5n&amp;key=b7cc456c43a228e9bee76ce3c38b83cdce68181d8310a828c6ec7344c866fd49adab61f656f075c959146f6cd9ed35471c3ed204c6002385f161096e186b0210\"/></div></div><p><a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/3843129a-519e-4d70-8279-94fe2cd8a10a\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Primary Logo\" border=\"0\" src=\"https://ml.globenewswire.com/media/3843129a-519e-4d70-8279-94fe2cd8a10a/small/slalom-logo-800px-blue-png.png\" style=\"max-height:39px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS8zODQzMTI5YS01MTllLTRkNzAtODI3OS05NGZlMmNkOGExMGEvc21hbGwvc2xhbG9tLWxvZ28tODAwcHgtYmx1ZS1wbmcucG5n&amp;key=8accfaf14bae4b83e7f1e2dee2a7933cde3e0306ea964dd1c2ecb13dc53711eb56ffea4ee219287a412d6e6bc4f98bc6ee757052671846c69273901da8d0c76d\"/></div></div></a></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">GlobeNewswire, Inc. 2021</p></div>"}