{"date": "2022-01-11 01:00:00.207000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>AWS Announces General Availability of Amazon EC2 Hpc6a Instances</b>\n</p><p class=\"bwalignc\">\n<span>New purpose-built Amazon EC2 instances for HPC workloads deliver up to 65% better price performance compared to similar compute-optimized Amazon EC2 instances</span>\n</p><p class=\"bwalignc\">\n<span>Maxar Technologies, DTN, and TotalCAE among customers and partners using Hpc6a instances</span>\n</p><p>\nToday, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), announced the general availability of Amazon Elastic Compute Cloud (Amazon EC2) Hpc6a instances, a new instance type that is purpose-built for tightly coupled high performance computing (HPC) workloads. Hpc6a instances, powered by 3rd Gen AMD EPYC processors, expand AWS’s portfolio of HPC compute options and deliver up to 65% better price performance compared to similar compute-optimized Amazon EC2 instances that customers use for HPC workloads today. Hpc6a instances make it even more cost-efficient for customers to scale HPC clusters on AWS to run their most compute-intensive workloads like genomics, computational fluid dynamics, weather forecasting, molecular dynamics, computational chemistry, financial risk modeling, computer-aided engineering, and seismic imaging. Hpc6a instances are available on demand via a low-cost, pay-as-you-go usage model with no upfront commitments. To get started with Hpc6a instances, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Faws.amazon.com%2Fec2%2Finstance-types%2Fhpc6&amp;esheet=52560508&amp;newsitemid=20220110005933&amp;lan=en-US&amp;anchor=aws.amazon.com%2Fec2%2Finstance-types%2Fhpc6&amp;index=1&amp;md5=d6c2ea0a370c7a16e7b75bc1df57a96a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com/ec2/instance-types/hpc6</a>.\n</p><p>\nOrganizations across numerous sectors rely on HPC to solve their most complex academic, scientific, and business problems. However, effectively using HPC is expensive because it requires the ability to process large amounts of data, which demands an abundance of compute power, fast memory and storage, and low-latency networking within HPC clusters. Some organizations build infrastructure on premises to run HPC workloads, but that involves expensive upfront capital investment, lengthy procurement cycles, ongoing management of overhead to monitor hardware and keep software up to date, and limited flexibility when the infrastructure inevitably becomes obsolete and must be upgraded. Customers across many industries run their HPC workloads in the cloud to take advantage of the superior security, scalability, and elasticity it offers. Engineers, researchers, and scientists rely on AWS to run their largest and most complex HPC workloads and choose Amazon EC2 instances with senhanced networking (e.g. C5n, R5n, M5n, and C6gn) to scale tightly coupled HPC workloads that require high levels of inter-instance communications with thousands of interdependent tasks. While the performance of these instances is sufficient for most HPC use cases, as workloads further scale to solve increasingly difficult problems, customers are looking to maximize price performance as they run HPC workloads that can grow to tens of thousands of servers on AWS.\n</p><p>\nNew Hpc6a instances are purpose-built to offer the best price performance for running HPC workloads at scale in the cloud. Hpc6a instances deliver up to 65% better price performance for HPC workloads to carry out complex calculations across a range of cluster sizes—up to tens of thousands of cores. Hpc6a instances are enabled with Elastic Fabric Adapter (EFA)—a network interface for Amazon EC2 instances—by default. With EFA networking, customers benefit from low latency, low jitter, and up to 100 Gbps of EFA networking bandwidth to increase operational efficiency and drive faster time-to-results for workloads that rely on inter-instance communications. Hpc6a instances are powered by 3rd Gen AMD EPYC processors that run at frequencies up to 3.6 GHz and provide 384 GB of memory. Using Hpc6a instances, customers can more cost-effectively tackle their biggest and most difficult academic, scientific, and business problems with HPC, and realize the benefits of AWS with superior price performance.\n</p><p>\n“By consistently innovating and creating new purpose-built Amazon EC2 instances for virtually every type of workload, AWS customers have realized huge price performance benefits for some of today’s most business-critical applications. While high performance computing has helped solve some of the most difficult problems in science, engineering, and business, effectively running HPC workloads can be cost-prohibitive for many organizations,” said David Brown, Vice President of Amazon EC2 at AWS. “Purpose-built for HPC workloads, Hpc6a instances now help customers realize up to 65% better price performance for their HPC clusters at virtually any scale, so they can focus on solving the biggest problems that matter to them most without the cost barriers that exist today.”\n</p><p>\n“We are excited to continue our momentum with AWS and provide their customers with this new, powerful instance for high performance computing workloads,” said Dan McNamara, Senior Vice President and General Manager, Server Business at AMD. “AMD EPYC processors are helping customers of all sizes solve some of their biggest and most complex problems. From small universities to enterprises to large research facilities, Hpc6a instances powered by<sup> </sup>3rd<sup> </sup>Gen AMD EPYC processors open up the world of powerful HPC performance with cloud scalability to more customers around the world.”\n</p><p>\nCustomers can use Hpc6a instances with AWS ParallelCluster (an open-source cluster management tool) to provision Hpc6a instances alongside other instance types, giving customers the flexibility to run different workload types optimized for different instances within the same HPC cluster. Hpc6a instances benefit from the AWS Nitro System, a collection of building blocks that offload many of the traditional virtualization functions to dedicated hardware and software to deliver high performance, high availability, and increased security while also reducing virtualization overhead. Hpc6a instances are available for purchase as On-Demand Instances or Reserved Instances, or with Savings Plans. Hpc6a instances are available in US East (Ohio) and AWS GovCloud (US-West), with availability in additional AWS Regions coming soon.\n</p><p>\nMaxar partners with innovative businesses and more than 50 governments to monitor global change, deliver broadband communications, and advance space operations with capabilities in Space Infrastructure and Earth Intelligence. “Amazon EC2 Hpc6a instances are yet another exciting announcement from AWS that enables Maxar to continue to meet and exceed our customer requirements for big compute workflows—whether to accelerate the research and operations of Numerical Weather Prediction workloads or to create the world’s best, most up-to-date, and accurate digital twin models with our Maxar Precision3D product suite,” said Dan Nord, SVP and Chief Product Officer at Maxar Technologies. “Hpc6a’s AMD EPYC processors combined with the EFA networking capability provide us a 60% performance improvement over alternatives, while also being more cost efficient. This enables Maxar to strategically choose among the suite of AWS HPC cluster configurations that we’ve developed to best suit our clients’ needs while maximizing flexibility and resiliency.”\n</p><p>\nDTN’s global weather station network delivers hyper-local, accurate, and real-time weather intelligence to empower organizations with actionable insights. “Our collaboration with AWS allows us to better serve our customers with high-resolution weather prediction systems that feed analytics engines,” said Lars Ewe, Chief Technology Officer at DTN. “We’re very excited to see the price performance of Hpc6a instances, and we expect this to be our go-to Amazon EC2 instance choice for HPC workloads going forward.”\n</p><p>\nTotalCAE has over 20 years of experience with HPC for computer-aided engineering (CAE). TotalCAE helps eliminate IT headaches by professionally managing customers’ HPC engineering environment and engineering applications so they can focus on engineering, and not IT. “TotalCAE Platform makes it easy for CAE departments to adopt the agility and flexibility of AWS in just a few clicks for hundreds of engineering applications like Ansys Fluent, Siemens Simcenter STAR-CCM+, and Dassault Systèmes Abaqus,” said Rod Mach, President at TotalCAE. “As an AWS HPC Competency Partner, we help customers run their CAE workloads in the cloud. With HPC6a instances, we have seen up to a 30% performance boost for computational fluid dynamics workloads at a lower cost, enabling TotalCAE to offer customers industry leading price performance and scalability in the cloud.”\n</p><p>\n<strong>About Amazon Web Services</strong>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 84 Availability Zones (AZs) within 26 geographic regions, with announced plans for 24 more Availability Zones and eight more AWS Regions in Australia, Canada India, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2F&amp;esheet=52560508&amp;newsitemid=20220110005933&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=2&amp;md5=0ff64dc7059ad98107ff960525a7bd8d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<strong>About Amazon</strong>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit amazon.com/about and follow @AmazonNews.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20220110005933r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjIwMTEwMDA1OTMzcjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=59dcb3717c71ae3885c16d62a0705bf23fe150364def31289308c86e0b96ff1288ea724a569506a2f322a7aeb2425d1592fb4b55fe0415138d04ec4fd1c15913\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20220110005933/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220110005933/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52560508&amp;newsitemid=20220110005933&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=3&amp;md5=a78fc2aaf4c54c63730cbe36b8460cf5\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2022</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON-WEB-SERVICES</p></div>"}