{"date": "2022-01-28 14:41:25.029000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2777.45, "close": 2879.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>BANK OF MONTREAL (\"BMO-TN;BMQZF-0\")\n- Promotes Education, Empowerment and Tech Talent:\n- Ground-breaking Cloud Computing Reskilling Program for Indigenous\n- Students Kicks Off\n\n     BMO Financial Group has teamed up with PLATO, Canada's only\nIndigenous-led and Indigenous-staffed IT services and training firm, to\noffer the Amazon Web Services (AWS) re/Start program virtually to\nIndigenous students across Canada. Twenty-two students, some from remote\ncommunities, have started a 12-week Cloud computing boot camp, followed by\na six-month BMO internship to learn and apply those skills on the job, and\nopportunities for full-time employment.\n\n     \"We're thrilled to be launching this program, which is built on the\nstrong partnership between BMO, PLATO and AWS,\" said Kona Goulet, Head,\nIndigenous Equity &amp; Inclusion at BMO. \"It's creating opportunities for\nIndigenous peoples in communities across Canada to build digital-first,\nfuture-focused skills. It's an example of BMO's Purpose - to Boldly Grow\nthe Good in business and life - in action, and our commitment to eliminate\nbarriers to inclusion by advancing education, employment and economic\nempowerment in Indigenous communities. And it's also one of the ways that\nwe're living our commitment as a founding partner of the World Economic\nForum SkillsLink Alliance.\"\n\n     \"Digital expansion is a strategic priority at BMO as we aim for speed,\nefficiency and scale in order to better serve our customers,\" said Victor\nTung, U.S. Chief Technology &amp; Operations Officer and Chief Information &amp;\nOperations Officer, BMO Capital Markets. \"Working with AWS and PLATO on the\nre/Start initiative will help us develop a critical pipeline of talent in\ntechnology that we need in order to reach our goals.\"\n\n     \"I am very honored to be accepted into a program that provides\ntraining for Cloud computing. Getting exposure to the Cloud through\non-the-job training would otherwise be impossible without an organization\nwilling to train their employees from the ground up,\" said Kyle Moore, a\nMetis Nation student from Manitoba. \"It can be a challenge for many of my\nclassmates who live remotely to have access to appropriate educational\nresources and technical training. PLATO's program and BMO's partnership\ngoes beyond traditional co-operative education programs; I'm thrilled for\nwhat comes next.\"\n     AWS re/Start is a skills development program that prepares individuals\nfor a career in technology with the mission of building a pipeline of\ntalent with core Cloud and Cloud-adjacent skills that are transferable to\nmultiple technology roles. The people participating in this program with\nPLATO and BMO have been selected from a pool of First Nations, Metis, and\nInuit applicants from across Canada who have demonstrated a strong interest\nin technology.\n\n     BMO signed on as a founding partner of the WEF SkillsLink Alliance in\nJune 2021, joining a community of influential leaders committed to the\n'Reskilling Revolution,\"' an ambitious goal to provide 1 billion people\nwith improved education, skills and job opportunities by 2030. To learn\nmore about the commitments made by BMO and its SkillsLink Alliance\npartners, click here.\n\n     For more information about how BMO works with Indigenous Communities,\nplease read Wicihitowin, BMO's first annual Indigenous Partnerships and\nProgress Report.\n\n     About AWS re/Start\n\n     The AWS re/Start program's mission is to help unemployed and\nunderemployed individuals who might not otherwise have access to technical\neducation develop the skills they need to pursue entry-level Cloud roles.\nEach cohort of learners, supported by professional mentors and accredited\ntrainers, completes a free, 12-week training featuring scenario-based\nlearning, hands-on labs, and coursework in order to be ready for\nentry-level Cloud roles, such as Cloud operations, site reliability,\ninfrastructure support, and technical adjacent business support functions.\n\n     About PLATO Testing\n\n     PLATO Testing was founded in 2015 by Keith McIntosh, CEO of testing\nfirm Professional Quality Assurance Ltd. PLATO is striving to build a\nnetwork of 1000 Indigenous software testers across Canada. PLATO currently\nemploys more than 50 full-time Indigenous software testers, making a\npositive impact for clients from coast to coast. PLATO Testing has offices\non or near Indigenous communities across Canada, in Fredericton, Miramichi,\nSault Ste Marie, Toronto, Calgary, Edmonton, and Vancouver.\n\n     About BMO Financial Group\n\n     Serving customers for 200 years and counting, BMO is a highly\ndiversified financial services provider - the 8th largest bank, by assets,\nin North America. With total assets of $988 billion as of October 31, 2021,\nand a team of diverse and highly engaged employees, BMO provides a broad\nrange of personal and commercial banking, wealth management and investment\nbanking products and services to more than 12 million customers and\nconducts business through three operating groups: Personal and Commercial\nBanking, BMO Wealth Management and BMO Capital Markets.\n\n Contact Information:\n\nFor News Media Enquiries: Kelly Hechler, Toronto, Kelly.hechler@bmo.com,\n(416) 867-3996\n\n<a href=\"https://www.bmo.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.bmo.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2202700126.MNPRE2202700672-06151120220128</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}