{"date": "2021-12-02 17:33:00.265000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3443.72, "close": 3389.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>AWS Announces AWS Amplify Studio</b>\n</p><p class=\"bwalignc\">\n<span>New visual development environment for creating rich user interfaces extends AWS Amplify to make it easier for developers to create fully customizable web applications with minimal coding</span>\n</p><p class=\"bwalignc\">\n<span>Rivian, QsrSoft, and Xerris among customers and partners using AWS Amplify Studio</span>\n</p><p>\nToday, at AWS re:Invent, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), announced AWS Amplify Studio, a new visual development environment that allows developers to create web application user interfaces (UIs) with minimal coding, while still empowering them to fully customize their applications’ design and behavior using familiar programming languages (e.g. JavaScript and TypeScript). Today, customers like Neiman Marcus, Orangetheory Fitness, and Credit Genie use AWS Amplify to more easily build and deploy the AWS services (e.g. database, compute, storage, etc.) that power their web and mobile applications. AWS Amplify Studio extends the benefits of AWS Amplify to provide a unified point-and-click interface for creating application UIs and provisioning the AWS services that power the application, so customers have an end-to-end tool for building web applications on AWS in days instead of weeks. With AWS Amplify Studio, developers can now create a UI using a library of prebuilt components (e.g. buttons, newsfeeds, user registration forms, etc.), collaborate with user experience (UX) designers, and connect their UI to AWS services through a visual interface without writing any code. After a developer finalizes their UI using AWS Amplify Studio, the UI is converted into JavaScript or TypeScript code, which saves developers from writing thousands of lines of code and allows them to fully customize parts of their web application design and behavior. There are no upfront fees or commitments to use AWS Amplify Studio, and customers only pay for the AWS services used to run the application’s backend. To learn more about AWS Amplify Studio, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Famplify%2Fstudio&amp;esheet=52544276&amp;newsitemid=20211202005810&amp;lan=en-US&amp;anchor=aws.amazon.com%2Famplify%2Fstudio&amp;index=1&amp;md5=4e4ae9837110f44bedf7667a25ee817c\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com/amplify/studio</a>.\n</p><p>\nMost web applications that run in the cloud are broadly comprised of three parts—the UI that is familiar to users, business logic that defines how the web application works, and the backend cloud services that power a range of essential functions (e.g. user authentication, databases, object storage, etc.). Today, developers typically choose one of two paths for building a modern web application. They can write the application code themselves, which gives them precise control over the web application’s design and behavior but can require months of time and effort to build, including provisioning the backend services, writing the business logic, and collaborating with UX designers on the UI. Alternatively, developers can use a low-code tool to quickly build an application, but these tools are less customizable and extensible, because developers cannot write their own custom application code or must use proprietary frameworks and programming languages that are more restrictive than common programming languages like JavaScript and TypeScript. What developers want instead is a solution that combines the precision of writing the code themselves with the speed of a low-code tool, so they can deliver innovative, new capabilities to their customers faster.\n</p><p>\nAWS Amplify Studio allows developers to quickly build a web application on AWS with minimal coding, while still empowering them to fully customize their application’s design and behavior using familiar programming languages. To get started, developers use AWS Amplify Studio’s simple point-and-click visual interface to create their backend, and AWS Amplify automatically provisions the AWS services (e.g. Amazon Cognito for authentication, Amazon DynamoDB for a database, Amazon S3 for storage, etc.). Once those services are provisioned, developers use AWS Amplify Studio to create their web application UI. With AWS Amplify Studio, developers can build their UI using a library of prebuilt UI components, incorporate data or capabilities from AWS services into their UI, and collaborate with UX designers through an integration with Figma (a popular tool used to design and prototype UIs)—all without writing any code. Once the UI is complete, AWS Amplify Studio automatically translates it into either JavaScript or TypeScript code, so developers have the flexibility to completely customize their application’s design or behavior to deliver the best end-user experience. By using AWS Amplify Studio to create a complete UI, developers avoid writing thousands of lines of code while still retaining the option to fully customize the application’s design and behavior using familiar programming languages.\n</p><p>\n“Developers love using AWS Amplify because it makes it easier to build a scalable web application backend powered by AWS, and they often tell us that they wish that we could extend that same fast, flexible development experience to the UI creation process,” said Kurt Kufeld, VP of AWS Platform at AWS. “AWS Amplify Studio is a game changer for developers because it allows them to rapidly iterate on their UI using prebuilt components and then fully customize the UI with familiar programming languages to meet their exact needs. From setting up a robust backend powered by AWS to creating a dynamic UI, AWS Amplify now provides an intuitive, end-to-end workflow to build web applications in days instead of weeks, so developers can deliver new innovations to end users faster.”\n</p><p>\nAWS Amplify Studio is available in preview today in US East (Ohio), US East (N. Virginia), US West (N. California), US West (Oregon), Asia Pacific (Mumbai), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Canada (Central), EU (Frankfurt), EU (Ireland), EU (London), EU (Paris), EU (Stockholm), Middle East (Bahrain), and South America (São Paulo), with availability in additional AWS Regions coming soon.\n</p><p>\nRivian is an electric vehicle maker and automotive technology company focused on sustainable transportation. “We chose to build our supply chain management application with AWS Amplify because it eliminates the complexities of DevOps in the cloud, allows us to reduce our deployment cycle from every two weeks to every two days, and more easily adopt new technologies like serverless,” said Arunkumar Chandran, Staff Software Engineer at Rivian. “We are excited about the launch of AWS Amplify Studio because it extends the benefits of AWS Amplify to our frontend development process. With AWS Amplify Studio, our developers will be able to save time and quickly iterate on their UI using a simple visual interface, while still having the option to dive into the code to fully customize the experience for end users.”\n</p><p>\nQsrSoft is a software-as-a-service company that develops solutions for clients in the restaurant, hospitality, and retail industries to help them achieve operational excellence. “We used AWS Amplify to develop QsrSoft TV, a new digital huddle board to help our customers improve employee engagement through gamification, real-time communication, and employee recognition programs, because it allowed us to create our application quickly, get to market faster, and take advantage of the performance and scalability of a fully serverless application stack,” said Adam Pehas, Director of Development at QsrSoft. “By using AWS Amplify Studio’s pre-built library of components and intuitive visual interface, we will be able to accelerate our development timelines, add additional value, and deliver new capabilities to our customers. AWS Amplify Studio will help us boost awareness, motivate our customers’ employees, and achieve operational excellence.”\n</p><p>\nXerris is an AWS Advanced Consulting Partner that specializes in providing technology-focused solutions for media and entertainment, energy, public sector, and retail companies. “Our development teams use AWS Amplify to create innovative applications for clients because it allows them to quickly build and ship web and mobile applications, rapidly iterate, and get them to market using scalable cloud services while providing extensibility so customers can take advantage of the breadth and depth of AWS as their needs evolve,” said Jonathan McCracken, CTO at Xerris. “We look forward to using AWS Amplify Studio because it makes it even easier for our development and UX design teams to seamlessly collaborate and rapidly iterate on applications to meet our clients’ needs. AWS Amplify Studio will save our developers time while providing the flexibility and control our developers want to fully optimize the end-user experience.”\n</p><p>\n<strong>About Amazon Web Services</strong>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones (AZs) within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2F&amp;esheet=52544276&amp;newsitemid=20211202005810&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=2&amp;md5=e311d0ce28a4d5a2589866399a5ac786\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<strong>About Amazon</strong>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Famazon.com%2Fabout&amp;esheet=52544276&amp;newsitemid=20211202005810&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=3&amp;md5=3085cb265c822e0e22e7b92739f4f58c\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211202005810r1&amp;sid=ucdp4&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMjAyMDA1ODEwcjEmc2lkPXVjZHA0JmRpc3Rybz1ueCZsYW5nPWVu&amp;key=67b739d73c4d607600ba5bf17c325ad3fee300934026f5b966e52c45a465ea97576db51dae235deaf61833a7c72303fb1d9a5a22144e21718dc69591bbb10e87\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211202005810/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211202005810/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52544276&amp;newsitemid=20211202005810&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=4&amp;md5=0529eb65cc0d662e48a5a6db29521540\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NV-AMAZON-WEB-SERVICES</p></div>"}