{"date": "2022-01-25 12:30:55.856000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Read Article Amazon Web Services (AWS), an Amazon.com company, announced that global higher education technology (EdTech) provider upGrad has gone all-in on AWS. upGrad has moved the vast majority of its information technology (IT) infrastructure to th...</p><p>Amazon Web Services (AWS), an Amazon.com company, announced that global higher education technology (EdTech) provider upGrad has gone all-in on AWS. upGrad has moved the vast majority of its information technology (IT) infrastructure to the world's leading cloud to help bring online learning to people in more than 100 countries. upGrad uses the breadth and depth of AWS capabilities, including analytics, security, and compute, to power career growth for individuals through upskilling, which ultimately helps to drive economic growth through a more qualified and productive workforce. With AWS, upGrad rapidly scaled its learning experience to meet demand for online education during the COVID-19 pandemic – the company doubled its learner base to more than two million learners in just eight months, and grew learners' time spent on the platform for upskilling by four times as compared to the preceding equal duration of time. <br/><br/> To meet the growing demand for online learning, upGrad needed to scale its services globally and provide a seamless, reliable customer experience, especially during peak periods like course registrations and assignment submissions. The company also needed a strong set of analytics capabilities to analyze learner data, including demographics and course uptakes, and provide personalized career services to drive learner success. By developing a customizable, and immersive learning system on AWS, upGrad can identify and serve new learner needs, help learners discover and enroll in their preferred courses, and then, after graduation, help learners develop their careers through innovative digital services. <br/><br/> To better understand learners and provide quality and customized learning content, upGrad uses Amazon Redshift, a cloud data warehouse service, to analyze learners' usage patterns, preferences, profile information, coursework, job applications, and career progression. With this data, upGrad can suggest relevant courses and employment opportunities, match learners' training journeys with upskilling offerings, and provide personalized learning experiences and tailored career paths. <br/><br/> In addition, with AWS, upGrad easily scales its workloads to meet spikes in demand using Amazon Elastic Compute Cloud (Amazon EC2), AWS's service that offers secure and resizable compute capacity for virtually any workload, and Amazon Simple Storage Service (Amazon S3), AWS's object storage service.  AWS Enterprise Support also helped upGrad optimize its cloud infrastructure cost by 28% through cost optimization techniques such as Amazon EC2 Reserved Instances, Amazon EC2 Spot Instances, and cloud architecture reviews. In addition, AWS Identity and Access Management (IAM), which provides fine-grained access control across AWS, helps upGrad improve its security posture to better comply with data encryption protocols required by its partner education institutions. <br/><br/> upGrad plans to procure software-as-a-service (SaaS) solutions for the company and its subsidiaries via AWS Marketplace, a curated digital catalog that makes it easy for organizations to test, purchase, deploy, and manage third-party software. By purchasing third-party software via AWS Marketplace and deploying these solutions on AWS in as little as one click, upGrad can pay for its software subscriptions through the company's AWS bill, removing the need to manage vendors and billing processes individually. <br/><br/> \"AWS is integral to our ability to onboard learners, experiment and iterate, and provide the best possible learning experience to help people accelerate their careers,\" said Rohit Dhar, President of Product at upGrad. \"With AWS, we can use data to personalize education for learners around the world as we strengthen our position as a leading global EdTech brand. As the demand for quality online learning content grows, we can easily scale our workloads on AWS to reliably and securely deliver rich and uninterrupted educational content, even during very busy periods.\" <br/><br/> \"upGrad builds on AWS to deliver innovative and flexible online learning solutions that help bridge the higher education needs of learners and drive development of the future workforce,\" said Sunil PP, Lead-Education, Space, and Nonprofits, Amazon Internet Services Private Limited, AWS India and South Asia. \"Going all-in on AWS allows upGrad to meet the rapid growth of their learner base as it scales to more than 100 countries, and provides a secure and personalized experience to learners online as they access upGrad for curriculum, mentoring, and career services.\"</p></div><div class=\"tr-npp-body\"><p>Copyright 2022 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}