{"date": "2021-11-12 14:38:03+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3482.05, "close": 3525.15}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds comments from Unilever</p><p class=\"tr-by\">By Brenda Goh and Sophie Yu</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">SHANGHAI, Nov 12 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>After more than a decade of explosive growth, China's Singles' Day, the world's biggest online shopping fest, is losing its gloss and bracing for more modest growth in coming years, hurt by a slower economy and tighter regulatory scrutiny.</p><p>E-commerce giant Alibaba Group Holding Ltd <a href=\"reuters://REALTIME/Verb=FullQuote/ric=9988.HK\" data-type=\"ric\" data-ric=\"9988.HK\" translate=\"no\" dir=\"ltr\">9988.HK</a> said on Friday its sales - or gross merchandise value - during the 11 day event grew just 8.5%, the slowest rate ever, underscoring the headwinds for China's tech firms. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2S205I\" data-type=\"storyId\" data-story-id=\"nL1N2S205I\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>GMV had grown by at least double digits every year since Alibaba founded the festival in 2009 and built it into a global online shopping fest, dwarfing Cyber Monday in the United States. Last year, it extended the one-day event to 11.</p><p>But the state-backed Securities Daily newspaper criticised the focus on high turnover from sales for being unsustainable, chaotic and incompatible with China's new development path. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2S309G\" data-type=\"storyId\" data-story-id=\"nL8N2S309G\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>\"The 'worship of turnover' is not only unsustainable in terms of digital growth but is also inextricably linked to chaos,\" the newspaper said.</p><p>Analysts said the weak performance this year also reflected how Chinese consumers have increasingly become weary and wary of the day's promotions and the quality of service.</p><p>Shoppers have also become more cautious about spending in general due to new coronavirus outbreaks and supply disruptions that have hurt sales and contributed to China's economy suffering its slowest growth in a year in the third quarter. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2RE01S\" data-type=\"storyId\" data-story-id=\"nL1N2RE01S\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>\"The magic of Double 11 is fading,\" said Sharry Wu, Greater China consulting business transformation leader at consulting firm EY, referring to Nov. 11, which was originally an unofficial day to celebrate being romantically unattached.</p><p>\"Brands have to understand after years of practice, Singles' Day is not their guaranteed sales booster.\"</p><p>The event has historically been headlined by eye-catching bargains and livestreaming promotions. It is also a big sales boost for companies such as Apple <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a> and L'Oreal <a href=\"reuters://REALTIME/Verb=FullQuote/ric=OREP.PA\" data-type=\"ric\" data-ric=\"OREP.PA\" translate=\"no\" dir=\"ltr\">OREP.PA</a>, which sold more than 100 million yuan ($15.7 million) worth of products each over the 11-day event this year.</p><p>         </p><p>STRONGER RIVALS</p><p>Alibaba's dominance of the e-commerce market is also being chipped away at by rivals such as JD.com and Pinduoduo, which have aggressively competed for new shoppers in China's lower-tier cities. </p><p>JD.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=9618.HK\" data-type=\"ric\" data-ric=\"9618.HK\" translate=\"no\" dir=\"ltr\">9618.HK</a>, which holds its own 11-day Singles Day shopping event, recorded 349.1 billion yuan worth of transactions, up 28.6% from the previous year. </p><p>Over the past year, regulators have accused Alibaba and its e-commerce rivals of treating their customers poorly by spamming them with promotions, unfairly restricting their choices and allowing merchants to fake discounts, punishing them with fines in some cases.</p><p>Under such a spectre of regulatory scrutiny, Alibaba toned down the marketing hype this year, doing away with a rolling tally tracking transactions that had taken centre stage in previous years and said it was focused on sustainability. </p><p>Still, Alibaba said a record 290,000 brands and 900 million consumers participated this year and 78 businesses saw their GMV grow more than 10 times compared with last year to more than 100 million yuan. A record number of luxury brands joined in, including Max Mara and Saint Laurent for the first time.</p><p>U<span class=\"tr-strong\">nilever <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ULVR.L\" data-type=\"ric\" data-ric=\"ULVR.L\" translate=\"no\" dir=\"ltr\">ULVR.L</a>, the world's second-largest consumer goods company, told Reuters it saw double-digit percentage growth during the event, with its Dove, Omo, Lux and Vaseline brands propped up by about 150 hours of livestreaming, including by online celebrities Viya and Li Jiaqi.</span></p><p><span class=\"tr-strong\">\"In skincare, what we generally see is that over 50% of Singles' Day sales can just come from one (livestreamer),\" Claire Hennah, global vice president of digital commerce at Unilever, said.</span></p><p>Citi analysts said that while the event's GMV missed their expectations, they were happy enough with more modest growth.</p><p>\"Following an unprecedented year of multiple headwinds, we are relieved to see Singles Day momentum settle with a new norm of moderated growth,\" they said. </p><p>($1 = 6.3903 Chinese yuan renminbi)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Brenda Goh in Shanghai and Sophie Yu in Beijing. Additional reporting by Richa Naidu in Chicago;  Editing by Miyoung Kim, Gerry Doyle and Nick Zieminski)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:brenda.goh@thomsonreuters.com\" data-type=\"email\" translate=\"no\">brenda.goh@thomsonreuters.com</a> ; +86 (0) 21 2083 0088; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://brenda.goh.thomsonreuters.com@reuters.net\">brenda.goh.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: ALIBABA-SINGLESDAY/ (UPDATE 2)</p></div>"}