{"date": "2021-10-21 06:18:06.511000+00:00", "ticker": "ABDN", "mrkt_info": {"open": 259.1, "close": 256.2}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 7299PAsia Dragon Trust PLC21 October 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>21 October 2021</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Asia Dragon Trust plc</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Proposed introduction of conditional tender offers</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The Board of Asia Dragon Trust plc (the \"Company\") is pleased to announce that, subject to the passing of the Company's continuation vote at the forthcoming annual general meeting (the \"AGM\") in December 2021, it intends to introduce five-yearly performance-related conditional tender offers (\"Conditional Tender Offers\") in addition to its regular continuation votes.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>To the extent that the Company's net asset value (\"NAV\") total return continues to outperform its benchmark total return there will be no tender offer. However, should the NAV total return underperform the Company's benchmark over a five-year assessment period (the \"Assessment Period\") then shareholders will be offered the opportunity to realise a proportion of their investment for cash at a level close to NAV. The five-yearly period has been chosen as this best corresponds with the Manager's typical investment time horizon.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>In order to align the Company's continuation votes with the Assessment Period for the Conditional Tender Offers the Board proposes to move from the Company's current cycle of triennial continuation votes to five-yearly continuation votes (together with the Conditional Tender Offers, the \"Proposals\").</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The holding and frequency of continuation votes is not prescribed in the Company's articles of association and is therefore a discretionary commitment of the Board, and there is also no formal requirement for Shareholders to vote on the proposed introduction of Conditional Tender Offers. Nonetheless, the Board believes it is appropriate to ask shareholders to approve a resolution at the Company's forthcoming AGM (the \"Resolution\") to approve the Proposals.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The Company's largest shareholder, City of London Investment Management, representing 27.86% of the Company's issued share capital has provided an irrevocable undertaking to vote in favour of both the continuation vote and the Resolution to approve the Proposals.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Details of the Conditional Tender Offers</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>If over the Assessment Period the Company's NAV per share total return fails to equal or exceed the total return on the MSCI All Country Asia (ex Japan) Index (sterling adjusted) (the \"Benchmark\"), the Board will put forward proposals to shareholders to undertake a tender offer. The size of any Conditional Tender Offer will be set by the Board up to a maximum of 25 per cent of the then issued share capital of the Company. Any such tender offer will be at a price equal to 98 per cent of the then prevailing NAV per share (after deduction of the costs of implementing the tender offer). Any tender offer would be subject to the passing of the relevant continuation vote, and itself would require the approval of shareholders, and it is expected that any tender offer will be made within three months after the passing of such continuation vote. There will be no tender offer where, over any Assessment Period, the Company's NAV per share total return equals or exceeds the total return on the Benchmark.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Subject to the Proposals obtaining shareholder approval, the Assessment Period for the first Conditional Tender Offer shall run from 1 September 2021 to 31 August 2026. Subsequent Conditional Tender Offers shall be assessed every 5 years thereafter.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Ad hoc share buybacks</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The introduction of Conditional Tender Offers will not affect the Board's current approach to discount management. The Board will continue to exercise its right to buy back shares when it believes this to be in shareholders' interests with the aim of reducing volatility in the discount.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The information contained within this announcement constitutes inside information. The person responsible for arranging for the release of this announcement on behalf of the Company is Paul Evitt of Aberdeen Asset Management Limited.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>LEI: 549300W4KB0D75D1N730</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Contact Details</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Aberdeen Asset Management Limited</span>\n</p>\n<p>\n<span>William Hemmings</span>\n</p>\n<p>\n<span>Telephone 020 7463 6223</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Winterflood Investment Trusts (Corporate Broker)</span>\n</p>\n<p>\n<span>Joe Winkley / Neil Morgan</span>\n</p>\n<p>\n<span>Telephone 020 3100 0000</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>TENKZMZGVGFGMZM</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}