{"date": "2022-01-06 23:25:09.738000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3287.14, "close": 3251.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SILO WELLNESS INC (\"SILO-Z;SILFF-0\")\n- Appoints CEO Douglas K. Gordon to Board of Directors and Provides\n- Corporation Updates\n\n     Silo Wellness Inc. (\"Silo Wellness\" or the \"Company\"), a leading\nglobal psychedelics company, is pleased to announce that the Company's\nChief Executive Officer, Douglas K. Gordon, has been appointed as a\ndirector of the company. Mr. Gordon has led the company since 2020, through\nits pre-listing fundraising and into the public markets in March 2021,\nfocusing on psychedelic retreats in Jamaica and the Marley One line of\nfunctional mushroom products.  Mr. Gordon is the founder of CanEx Jamaica,\nthe premier cannabis business conference and expo in the Caribbean. He has\nover 30 years of experience spanning finance, media, sales and marketing.\nMr. Gordon has forged a vast global network with particular attention to\ndeveloping business opportunities in the Caribbean and LATAM. Mr. Gordon\nhas developed government and distribution relations in Jamaica as an\nexperienced operator of a health and wellness distribution business and\npsychedelic retreats.\n\n     Mr. Gordon was the architect behind the launch of the Marley One line\nof mushroom products in collaboration with the Bob Marley estate. The\ninitial Marley One product offering was launched on the e-commerce store,\nfound at www.MarleyOne.com, and included a range of functional mushroom\ntinctures with unique blends highlighting the brand's connection to\nJamaica. The tinctures include species such as cordyceps, lion's mane,\nchaga, reishi and turkey tail that offer a range of unique health and\nwellness benefits, from immunity and gut health to cognitive function and\nsleep enhancement. Additionally, the Company was approved for listing on\nAmazon on August 9, 2021. The approval permits the Company to make its five\nskus available for sale on the Amazon e-commerce website.  Expected sales\nwill depend on the sales and marketing plan, which will include marketing\nexpenditure for targeted advertisements on Amazon to boost the profile of\nthe Company's products on the website. This is an addition to and not in\nlieu of the Company's other sales platforms and opportunities, including\nthe Company's flagship e-store.  The Company has also been working with\nother manufacturers and sampling new functional mushroom food products in\nvarious product categories.  The Company is also in negotiations with two\ndifferent beverage manufacturers in two different product categories, which\nmay or may not be successfully consummated.  One has advanced to the R&amp;D\nstage with functional mushroom compounds provided by the Company to the\npotential partner, and the Company received the first iteration of beverage\nsamples on or about December 3, 2021.\n\n     Silo Wellness also announces that Mo Yang has resigned from the board\nof directors of the Company to pursue other opportunities. Silo Wellness\nwould like to thank Mr. Yang for his service to the Company since 2020.\nHis financial expertise and operational support were critical to the\nCompany's early milestones.\n     Other Corporate Updates\n\n     On August 11, 2021, the Company entered into a loan agreement with an\narm's length party for principal amount of $250,000 bearing interest at an\nannual rate of 6%. On August 12, 2021, the Company repaid $144,000 of the\nloan principal by issuing 2,500,000 common shares of the Company valued at\nCAD$0.072 a share (CAD$180,000 or $144,000). On September 16, 2021, the\nCompany repaid $66,360 of the loan principal by issuing 1,500,000 common\nshares of the Company valued at CAD$0.056 a share (CAD$84,000 or $66,360).\nOn December 27, 2021, the Company agreed to issue 1,062,612 common shares\nof the Company valued at CAD$0.05 for settling the unpaid total principal\nand interest of $40,911. Completion of the Shares for Debt is subject to\ncompliance with applicable regulations, including policies of the CSE.\n\n     On December 27, 2021, the Company agreed to issue 600,000 common\nshares valued at CAD$30,000 to settle a debt owed to an arm's length\nservice provider, subject to CSE approval. On December 27, 2021, the\nCompany also granted 1,000,000 common shares purchase options to 4\ndirectors and the CEO of the Company, each option entitles the holder to\npurchase one common share of the Company at CAD$0.05 until five years from\nthe grant date. The options are subject to a four-month hold period, and\nvest in equal quarterly tranches over a year.\n\n     ABOUT SILO WELLNESS\n\n     Silo Wellness is a growth-oriented holding company focused on\nfunctional mushroom and psychedelic opportunities that benefit from a\nunified ecosystem and exceptional leadership. Founded in 2018 and\nheadquartered in Toronto, Silo Wellness has operations in Jamaica and\nOregon. Silo Wellness is a publicly-traded company on the Canadian (CSE:\nSILO) and Frankfurt (FSE: 3K70) exchanges and trading on the OTCQB Venture\nMarket (OTCQB: SILFF).\n\n     Silo Wellness offers a diverse and growing portfolio of functional\nmushroom products, psychedelic wellness retreats in Jamaica and Oregon,\ncultivation of psychedelic mushrooms and truffles in Jamaica, development\nof a brick-and-mortar smart shop in Jamaica, and intellectual property,\nfocused initially on the commercialization of its metered-dosing psilocybin\nnasal spray.\n\n     In March 2021, Silo Wellness announced a multi-year licensing\nagreement with the family of legendary musician Bob Marley for the\nexclusive worldwide rights to brand, market and sell a distinct product\nline of functional and psychedelic mushrooms. The Marley One line of\nfunctional mushrooms is available at www.MarleyOne.com.\n\n     For more information about Silo Wellness, please visit\nwww.silowellness.com.\n\n     For further information, please contact:\n\n     Silo Wellness Investor Relations and Media Relations:\n\n     Mike Arnold, President\n541-900-5871\nir@silowellness.com\n\n     CAUTIONARY NOTE REGARDING FORWARD-LOOKING INFORMATION: This news\nrelease contains \"forward-looking information\" and \"forward-looking\nstatements\" (collectively, \"forward-looking statements\") within the meaning\nof the applicable Canadian securities legislation. All statements, other\nthan statements of historical fact, are forward-looking statements and are\nbased on expectations, estimates, and projections as at the date of this\nnews release. Any statement that involves discussions with respect to\npredictions, expectations, beliefs,  plans, projections, objectives,\nassumptions, future events or performance (often but not always  using\nphrases such as \"expects\", or \"does not expect\", \"is expected\",\n\"anticipates\" or \"does not  anticipate\", \"plans\", \"budget\", \"scheduled\",\n\"forecasts\", \"estimates\", \"believes\" or \"intends\" or  variations of such\nwords and phrases or stating that certain actions, events or results \"may\"\nor  \"could\", \"would\", \"might\" or \"will\" be taken to occur or be achieved)\nare not statements of historical  fact and may be forward-looking\nstatements. In this news release, forward-looking statements relate, among\nother things, to: the Shares for Debt and the business plans of Silo\nWellness. Forward-looking statements are necessarily based upon a number of\nestimates and assumptions that, while considered reasonable, are subject to\nknown and unknown risks, uncertainties, and other factors which may cause\nthe actual results and future events to differ materially from those\nexpressed or implied by such forward-looking statements. Such factors\ninclude, but are not limited to: general business, economic, competitive,\nregulatory, political and social uncertainties and the potential impact of\nCOVID-19.  Such risks and uncertainties include, among others, the risk\nfactors included in Silo Wellness's continuous disclosure documents\navailable on www.sedar.com. There can be no assurance that such statements\nwill prove to be accurate, as actual results and future events could differ\nmaterially from those anticipated in such statements.\n\n     Readers should not place undue reliance on the forward-looking\nstatements and information contained in this news release. Silo Wellness\nassumes no obligation to update the forward-looking statements of beliefs,\nopinions, projections, or other factors, should they change, except as\nrequired by law.\n\n     NEITHER THE CANADIAN SECURITIES EXCHANGE NOR ITS REGULATION SERVICES\nPROVIDER ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS\nRELEASE.\n\n     NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION IN\nTHE UNITED STATES\n\nTel   : 541-797-0110    SILO WELLNESS INC\nEmail : mike@silowellness.com\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200500998.MNPRE2200503122-15240820220106</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}