{"date": "2021-11-04 18:59:03+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3384.0, "close": 3518.99}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\"><li class=\"tr-summaryitem\">Q3 underlying sales up 1% vs 4.1% decline in Q2</li><li class=\"tr-summaryitem\">French underlying sales down 4.3% vs down 8.4% in Q2</li><li class=\"tr-summaryitem\">Deal with Gorillas follows ones with Ocado, Amazon</li></ul><p class=\"tr-advisory\">Adds CFO comments from call, details on Gorillas deal</p><p class=\"tr-by\">By Dominique Vidalon</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">PARIS, Nov 4 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Retailer Casino <a href=\"reuters://REALTIME/Verb=FullQuote/ric=CASP.PA\" data-type=\"ric\" data-ric=\"CASP.PA\" translate=\"no\" dir=\"ltr\">CASP.PA</a> said on Thursday that sales momentum  gradually improved in the third quarter, as easing COVID-19 restrictions helped its performance in France and sales growth in Brazil, the group's second-largest market, remained robust.</p><p>Casino, which has been boosting its profitability through purchasing deals and cost cuts, reiterated a target of core profit (EBITDA) growth for its French retail business in 2021 and unveiled a new partnership with German quick commerce group Gorillas.</p><p>Casino has already been expanding online through a deal to use British online retailer Ocado’s fulfillment platform, while its Monoprix supermarket arm has a deal with Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>.</p><p>Commenting on the new partnership, which will also see Casino buying a \"symbolic\" stake in Gorillas, finance chief David Lubek said: \"We will benefit from their growth because we will sell them our products. We have partnerships with Ocado, Amazon. We have Gorillas for quick commerce. We are now well covered on e-commerce,\" </p><p>Under the deal, Casino will give Gorillas access to its national brands products, but also to Monoprix’s private label products, which will be available through Gorillas’ app and delivered within minutes to customers in Paris, Lille, Bordeaux, Lyon and Nice, the group said.</p><p>Gorillas will also undertake packing and fast delivery of orders purchased on Monoprix and Franprix online platforms from its French micro-fulfilment stores.</p><p>Casino, which has been selling assets to reduce its debt burden, confirmed it was pressing ahead with a disposal plan aimed at raising 4.5 billion euros ($5.2 billion), with 3.1 billion of deals signed or secured to date.</p><p>Sales at the group, which controls Brazil's Grupo Pao de Acucar <a href=\"reuters://REALTIME/Verb=FullQuote/ric=PCAR3.SA\" data-type=\"ric\" data-ric=\"PCAR3.SA\" translate=\"no\" dir=\"ltr\">PCAR3.SA</a>, totalled 7.7 billion euros in the third quarter.</p><p>On a same-store basis and excluding fuel and calendar effects, group sales rose 1%. That compares to a 4.1% decline in the second quarter when its city stores in France suffered from a lack of tourists and coronavirus curfew measures.</p><p>In France alone, sales were down 4.3% in the quarter after falling 8.4% in the second quarter, still affected by a drop in traffic during summer in the Paris region and the implementation of a health pass. French hypermarkets sales were down 9.5% in the quarter after falling 11.4% in the second quarter.</p><p>Food e-commerce, however, remained very strong, with a 26% rise in same store net sales.</p><p>     ($1 = 0.8663 euros)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Dominique Vidalon<br/>Editing by Benoit Van Overstraeten and Mark Potter)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:dominique.vidalon@thomsonreuters.com\" data-type=\"email\" translate=\"no\">dominique.vidalon@thomsonreuters.com</a> ; +33149495432; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://dominique.vidalon.reuters.com@reuters.net\">dominique.vidalon.reuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: CASINO-RESULTS/ (UPDATE 2, PIX)</p></div>"}