{"date": "2021-11-17 15:46:04+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        ​IVECO, a brand of CNH Industrial N.V. (NYSE: CNHI / MI: CNHI) and a pioneer in the commercialization and manufacturing of vehicles powered by alternative fuels, announced today an important development in its commercial relation with Amazon.\n      </p>\n                <p>\n        Amazon has already taken delivery of the first batch of 216 units IVECO S-WAY CNG (Compressed Natural Gas) to be operated by its partners in Europe and another 848 units have been ordered with deliveries to be started in the middle of 2022 (for a total order of 1,064 trucks).\n      </p>\n                <p>\n        These 1,064 trucks are powered by the state-of-the-art FPT Industrial Cursor 13 Natural Gas engines and equipped with 1052-liter CNG tanks, the largest available, with the expectation that they will yield an impressive range of 620 km (approx. 385 miles) between refueling. The 848 units on order for delivery in 2022 will also feature IVECO Driver Pal, the Brand's trailblazing on-board vocal driver companion with Amazon Alexa features.\n      </p>\n                <p>\n                  <strong>Gerrit Marx, designated Chief Executive Officer of Iveco Group</strong>, said: \"<span>We have been pioneering gas propulsion technology for 25 years, developing solutions that allow operators to make significant reductions in emissions right now. Collaboration with global leaders like Amazon is a testament to the robust capability of our innovative products and our unyielding commitment to the industry objective of decarbonizing transport by 2050. Iveco Group will continue leading the way in combustion engines running on renewable fuels, the only viable solution already available at scale on the market to reduce emissions. Let's not forget that a CNG truck powered by bio-methane can cut CO<sub>2</sub> emissions by up to 95% from a well-to-wheel CO<sub>2</sub> measuring approach, effectively contributing to the decarbonization process.</span>\"<br/></p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.iveco.com/en-us/press-room/release/Pages/IVECO-to-supply-1064-gas-powered-S-WAY-trucks-to-Amazon-to-support-European-operations.aspx\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Iveco S.p.A.</strong> published this content on <strong>17 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>17 November 2021 15:46:04 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Iveco S.p.A.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Iveco-S.p.A.</p></div>"}