{"date": "2022-02-03 13:20:03+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3023.87, "close": 2776.91}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>GAMEON ENTERTAINMNET TECHNOLOGIES INC (\"GET-Z;GMETF-0\")\n- Appoints Katrina Palanca to Board of Directors\n\n     GameOn Entertainment Technologies Inc. (\"GameOn\" or the \"Company\"), a\nleading game technology provider to media, sports and entertainment\ncompanies, is pleased to appoint Katrina Palanca to its Board of Directors,\neffective January 25, 2022.\n\n     Palanca comes to GameOn with a wealth of experience within corporate\npartnership and sponsorship across noteworthy brands. As the current VP of\nGlobal Partnerships at Spurs Sports &amp; Entertainment, she manages a team of\nmore than 20 employees across sponsorship sales and activation. Prior to\nher current tenure, she was Director of Sponsorship Operations &amp; Strategy\nat Twitch where she spearheaded the Verizon 5G partnership. Palanca also\nworked at BSE Global as Senior Manager of Global Marketing Solutions, where\nshe led a team to develop sellable sponsorship platforms across all BSE\nGlobal properties including Barclays Center, Brooklyn Nets, New York\nIslanders, NYCB LIVE, Long Island Nets and Paramount Theatre. Most notably,\nPalanca led the inaugural Brooklyn Nets jersey patch partnership with\nInfor. Additionally, Palanca was recently honored as one of Sports Business\nJournal's 2021 New Voices Under 30 and spearheaded strategy and operations\nfor the first esports partnership Honda signed with Team Liquid.\n\n     \"In a year when we expect to scale customers and revenue, a rising\nstar like Katrina will be a game-changer for our Board of Directors,\" said\nMatt Bailey, GameOn CEO. \"Her tenacity, hard work, skill set and experience\nwill help propel our company as we continue to offer best-in-class white\nlabel game technologies to the biggest companies in sports, media and\nentertainment.\"\n\n     Palanca added: \"With competition for attention at an all-time high,\nit's more important than ever for content-owners to turn consumers into\ncommunities of super fans. I couldn't be more excited to join GameOn's\nboard and continue to build communities in the ever-changing sports, media\nand technology industries.\"\n\n     Palanca replaces Liz Schimel who resigned from her Director role,\neffective January 25, 2022.\n\n     Corporate Contact:\n     Matt Bailey\n     Director &amp; Chief Executive Officer\n     GameOn Entertainment Technologies Inc.\n     917-834-4921\n\n     Investor Relations Contact:\n     Gateway Group, Inc.\n     Cody Slach or John Yi\n     GET@gatewayir.com\n     949-574-3860\n\n     ABOUT GAMEON ENTERTAINMENT TECHNOLOGIES INC.\n\n     GameOn (CSE: GET) (OTCQB: GMETF) powers the biggest sports, media and\nentertainment companies with the most innovative white label game\ntechnologies. GameOn provides broadcasters, TV networks, streaming\nplatforms, leagues, tournaments, sportsbooks and NFT projects with white\nlabel prediction games, fantasy games and NFT-based games. Since completing\nthe Comcast NBCUniversal LIFT Labs Accelerator powered by Techstars in\n2018, GameOn has secured revenue-generating partnerships with global\ncompanies including NBCUniversal, Bravo and MX Player.\n\n     GameOn has a dynamic and experienced management team led by CEO, Matt\nBailey (Brooklyn Nets, Barclays Center), Chief Product Officer, Santiago\nJaramillo (Dapper Labs, NBA Top Shot, EA Sports) and VP of Partnerships,\nRyan Nowack (Madison Square Garden, New York Knicks, New York Rangers), as\nwell as its Directors, J Moses (Take-Two Interactive), Shafin Tejani\n(Victory Square Technologies), Katrina Palanca (Twitch, Brooklyn Nets, San\nAntonio Spurs) and Carey Dillen (YYOGA, FIFA, IOC).\n\n     FORWARD-LOOKING INFORMATION\n\n     This news release contains \"forward-looking information\" and\n\"forward-looking statements\" (collectively, \"forward-looking information\")\nwithin the meaning of applicable securities laws. Forward-looking\ninformation is generally identifiable by use of the words \"believes,\"\n\"may,\" \"plans,\" \"will,\" \"anticipates,\" \"intends,\" \"could,\" \"estimates,\"\n\"expects,\" \"forecasts,\" \"projects\" and similar expressions, and the\nnegative of such expressions. Forward-looking information in this news\nrelease include statements about GameOn's listing and commencement of\ntrading on the CSE.\n\n     Forward-looking information is subject to known and unknown risks,\nuncertainties and other factors that may cause the Company's actual\nresults, level of activity, performance or achievements to be materially\ndifferent from those expressed or implied by such forward-looking\ninformation. Forward-looking information is based on the reasonable\nassumptions, estimates, analysis and opinions of management made in light\nof its experience and perception of trends, current conditions and expected\ndevelopments, and other factors that management believes are relevant and\nreasonable in the circumstances at the date such statements are made.\nAlthough the Company has attempted to identify important factors that could\ncause actual results to differ materially from those contained in\nforward-looking information, there may be other factors that cause results\nnot to be as anticipated. There can be no assurance that such information\nwill prove to be accurate, as actual results and future events could differ\nmaterially from those anticipated in such information. Accordingly, readers\nshould not place undue reliance on forward-looking information. All\nforward-looking information herein is qualified in its entirety by this\ncautionary statement, and GameOn disclaims any obligation to revise or\nupdate any such forward-looking information or to publicly announce the\nresult of any revisions to any of the forward-looking information contained\nherein to reflect future results, events or developments, except as\nrequired by law.\n\n     Neither the CSE nor its Regulation Services Provider (as that term is\ndefined in the policies of the CSE) accepts responsibility for the adequacy\nor accuracy of this release.\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203300116.MNPRE2203300831-05172020220203</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}