{"date": "2022-02-24 15:11:37.792000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>WONDERFI TECHNOLOGIES INC (\"WNDR-V\")\n- Launches WonderFi Interactive, Bringing Play to Earn\n- Gaming and NFTs to WonderFi\n\n     WonderFi to Acquire Go BIG! Game Franchise on iOS and Android with\nover 200,000 users, including launch title \"Go BIG! Feat. Godzilla vs Kong\"\na Licensed IP Property from Legendary Entertainment, through Acquisition of\nSun Machine Entertainment\n\n     WonderFi Technologies Inc. (the \"Company\" or \"WonderFi\") today\nannounced the launch of a new division, WonderFi Interactive Inc.\n(\"WonderFi Interactive\"), which expands WonderFi's product offering into\nplay to earn gaming and NFTs and will provide a new on-ramp for users into\nthe WonderFi ecosystem. In connection with the launch, WonderFi has entered\ninto a binding letter of intent to acquire all of the issued and\noutstanding shares of Sun Machine Entertainment Inc. (\"Sun Machine\"), an\nindustry leading game development studio and owner of the Go BIG!\nFranchise, which is currently available on iOS and Android.\n\n     WonderFi Interactive Launch\n\n     \"Gaming provides a universally accessible entry point for crypto and\nNFTs, and there are over 3 billion gamers worldwide,\" commented Cong Ly,\nChief Technology Officer of WonderFi. \"WonderFi is in a position to create\nunique NFT opportunities through the Go BIG! Franchise and offer players\nthe ability to earn IP-backed NFTs that are usable across the Go BIG!\nFranchise and the WonderFi ecosystem.\"\n\n     WonderFi Interactive's roadmap will include the integration of NFTs\ninto the Go BIG! Franchise including celebrity NFTs, and the development of\nnew games in 2022 to bring more gamers into the WonderFi ecosystem.\n\n     Sam Bankman-Fried, strategic investor in WonderFi has commented on\ngaming NFTs being \"the driving force behind bringing crypto to the\nmainstream\". \"I'm pretty bullish on a top-tier gaming publisher looking to\nintroduce crypto into their system\", and gaming NFTs could \"bring a\nnon-crypto native audience to crypto for something other than financial\ninvesting\" added Bankman-Fried.\n\n     For more information about the launch of WonderFi Interactive, please\nvisit www.wonder.fi/interactive.\n\n     Sun Machine, Godzilla vs. Kong and Legendary Entertainment\n\n     Sun Machine was founded by Wil Mozell, who previously sold his game\ndevelopment studio BigPark to Microsoft. Wil has been building studios and\ngame franchises for over 28 years and while at Microsoft oversaw flagship\nproducts Gears of War and Kinect Sports as well as leading interactive\nsports experiences with NFL, ESPN and UFC on Xbox.\n\n     Sun Machine, in partnership with global content leader Legendary\nEntertainment, released the action-packed mobile video game Go BIG! feat.\nGodzilla vs. Kong in Q4 2021.  During this period and in advance of\ncommercial launch in Q2 2022, the product has already seen over 200,000\ninstalls while in soft launch across the Apple App Store and Google Play\nStore in North America and select international markets.  \"With our soft\nlaunch user acquisition metrics, our world class IP partnership with\nLegendary Entertainment, and our 2022 roadmap, we are very excited about\nthe future of the Go Big! franchise\" commented Mr. Mozell.\n\n     Go BIG! feat. Godzilla vs. Kong is the first major installation of the\nGo BIG! Franchise.  Created to be \"the most fun two minutes of your day,\"\nthe casual-action \"smash, dash and grow\" gameplay of Go BIG! will soon\nextend to other game genres which the team at Sun Machine will be creating\nnext. With its broadly appealing gameplay, captivating characters, and\ndynamic world, Go BIG! was designed for seamless collaboration with\ncompelling IP such as Godzilla vs. Kong.\n\n     \"This is one of the deepest collaborations we have done in a casual\nmobile game for the film Godzilla vs. Kong, and we couldn't be happier with\nSun Machine's portrayal,\" commented Legendary Entertainment's Sam\nRappaport, Director of Interactive Media, at the time of soft launch.  \"Go\nBIG! feat. Godzilla vs. Kong is non-stop action and pure fun, bringing a\nplayful element to the iconic Kong and Godzilla Titans not yet seen before.\nWe believe fans of the Monsterverse franchise and even those who haven't\nyet seen the films will love this game.\"\n\n     Transaction Details\n\n     The Acquisition is valued at $17 million, subject to on-going due\ndiligence, and consideration will be paid in WonderFi common shares based\non a 15 day volume weighted average price of WonderFi common shares on the\ntrading day immediately preceding the execution of a definitive agreement,\nwith a minimum issuance price of $2.05 per WonderFi common share and a\nmaximum of $2.85 per share.\n\n     The Acquisition is subject to the parties negotiating and entering\ninto a definitive agreement to give effect to the Acquisition and is\nexpected to close in the second quarter of 2022, subject to Sun Machine\nshareholder approval, board approvals, the completion of due diligence by\nWonderFi and other acquisition-related closing conditions and regulatory\napprovals.\n\n     Cong Ly, Chief Technology Officer of WonderFi, previous served as\nChief Technology Officer of Sun Machine from March 2019 to October 2020.\nMr. Ly has no direct or indirect ownership of Sun Machine.\n\n     Crypto APIs Acquisition\n\n     WonderFi management has decided not to proceed with the previously\nannounced acquisition of Mena Software Ltd. (Crypto APIs).\n\n     Additional Information\nFor additional information, please contact:\n\n     WonderFi Technologies Inc.\nBen Samaroo, CEO\nben@wonder.fi\n(778) 843-9637\n\n     Investor Relations Contact: invest@wonder.fi\nMedia Contact: press@wonder.fi\n\n     ABOUT WONDERFI\n\n     WonderFi is a leading technology company with the mission of creating\nbetter access to digital assets through compliant centralized and\ndecentralized platforms. WonderFi has a multi-pronged business strategy\nwhich includes a high-growth consumer finance app which will serve as a\ntrusted gateway to the new financial system, and a digital asset portfolio\nwhich consists of leading crypto and DeFi assets. WonderFi's executive team\nand Board of Directors have an established track record in finance and\ncrypto, with previous experience at Amazon, Shopify, PayPal, Galaxy Digital\nand Hut 8. WonderFi's core team of engineers and technologists believe that\neveryone should have equal access to finance, and are aligned in the\nmission to empower people around the world to access DeFi in a simple,\nsmart and secure way. For more information, visit www.wonder.fi.\n\n     About Sun Machine Entertainment\n\n     Sun Machine Entertainment is a leading developer of original video\ngames, founded in Vancouver, Canada by a team of industry leaders\nresponsible for numerous best-selling and award-winning titles. Sun\nMachine's debut release, Go BIG! feat. Godzilla vs. Kong, is a casual\naction mobile game that builds on the hugely successful film Godzilla vs.\nKong, the latest chapter of Legendary Entertainment's Monsterverse\nfranchise. To learn more, visit www.sunmachinegames.com.\n\n     Forward-Looking Information and Statements\n\n     This press release contains certain \"forward-looking information\"\nwithin the meaning of applicable Canadian securities legislation and may\nalso contain statements that may constitute \"forward-looking statements\"\nwithin the meaning of the safe harbor provisions of the United States\nPrivate Securities Litigation Reform Act of 1995. Such forward-looking\ninformation and forward-looking statements are not representative of\nhistorical facts or information or current condition, but instead represent\nonly the Company's beliefs regarding future events, plans or objectives,\nmany of which, by their nature, are inherently uncertain and outside of the\nCompany's control. Generally, such forward-looking information or\nforward-looking statements can be identified by the use of forward-looking\nterminology such \"could\", \"intend\", \"expect\", \"believe\", \"will\",\n\"projected\", \"estimated\", or variations of such words, and includes the\nanticipated benefits of the transaction, the ability of the Company and Sun\nMachine to obtain all necessary shareholder and regulatory approvals, and\nthe ability of the Company and Sun Machine to close the transaction on the\nterms and timing described herein, or at all.\n\n     By identifying such information and statements in this manner, the\nCompany is alerting the reader that such information and statements are\nsubject to known and unknown risks, uncertainties and other factors that\nmay cause the actual results, level of activity, performance or\nachievements of the Company to be materially different from those expressed\nor implied by such information and statements. In addition, in connection\nwith the forward-looking information and forward-looking statements\ncontained in this press release, the Company has made certain assumptions.\nAmong the key factors that could cause actual results to differ materially\nfrom those projected in the forward-looking information and statements are\nthe following: the inability of the Company and Sun Machine to integrate\nsuccessfully such that the anticipated benefits of the transaction are\nrealized, the inability of the Company and Sun Machine to obtain the\nnecessary regulatory and shareholder approvals for the transaction, the\ninability of the Company and Sun Machine to close the transaction on the\nterms and timing described herein, or at all, and compliance with extensive\ngovernment regulation. Should one or more of these risks, uncertainties or\nother factors materialize, or should assumptions underlying the\nforward-looking information or statements prove incorrect, actual results\nmay vary materially from those described herein.\n\n     Although the Company believes that the assumptions and factors used in\npreparing, and the expectations contained in, the forward-looking\ninformation and statements are reasonable, undue reliance should not be\nplaced on such information and statements, and no assurance or guarantee\ncan be given that such forward-looking information and statements will\nprove to be accurate, as actual results and future events could differ\nmaterially from those anticipated in such information and statements. The\nforward-looking information and forward-looking statements contained in\nthis press release are made as of the date of this press release, and the\nCompany does not undertake to update any forward-looking information and/or\nforward-looking statements that are contained or referenced herein, except\nin accordance with applicable securities laws. All subsequent written and\noral forward- looking information and statements attributable to the\nCompany or persons acting on its behalf is expressly qualified in its\nentirety by this notice.\n\n     Neither NEO Exchange nor its Regulation Services Provider (as that\nterm is defined in policies of the NEO Exchange) accepts responsibility for\nthe adequacy or accuracy of this news release.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2205400428.MNPRE2205401913-06551120220224</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}