{"date": "2021-12-22 10:00:07.391000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"fr\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">50 foyers de Rosemont-La Petite-Patrie recherchés pour le 4e Défi Zéro déchet</p>\n<p>MONTRÉAL, le 19 janv. 2022</p>\n<p>\n<span>MONTRÉAL</span> , <span>le 19 janv. 2022</span> /CNW Telbec/ - L'arrondissement de <span>Rosemont-La Petite-Patrie</span> est à la recherche de 50 foyers du quartier pour relever le 4 <span>e</span> Défi Zéro déchet. De février à juin, les ménages sélectionnés seront accompagnés par les expertes du mode vie zéro déchet de la Coopérative Incita en vue de réduire leurs déchets, un petit geste à la fois. Ils bénéficieront aussi de conseils, d'ateliers pratiques et de conférences. L'appel à candidatures est ouvert jusqu'au 26 janvier prochain.</p>\n<p>« Réduire son empreinte écologique en adoptant de nouvelles habitudes de vie : voilà un défi inspirant à relever en 2022. Grâce au soutien personnalisé offert dans le cadre du Défi Zéro déchet, les Rosepatriennes et Rosepatriens pourront mettre leur poubelle au régime en toute simplicité », a souligné le maire de <span>Rosemont-La Petite-Patrie</span> , François <span>Limoges</span> .</p>\n<p>\n<span>Qui peut soumettre sa candidature?</span> Pour soumettre leur candidature, les personnes intéressées doivent habiter <span>Rosemont-La Petite-Patrie</span> jusqu'à la fin juin 2022, être motivées à modifier leurs habitudes afin de tendre vers le zéro déchet et s'engager à participer aux différentes activités virtuelles.</p>\n<p>À partir des candidatures reçues, l'Arrondissement sélectionnera 50 foyers représentatifs de la population du quartier, de tailles et de compositions variées, aussi bien les familles et les personnes vivant seules, que les personnes aînées, les nouveaux arrivants ou les jeunes colocataires.</p>\n<p>Tout au long du défi, des séances individuelles personnalisées, des rencontres de groupe, des ateliers pratiques et des conférences les outilleront pour atteindre leur objectif. Après avoir identifié un objectif adapté à leur réalité, les ménages participants seront invités à peser leurs déchets régulièrement, pendant cinq mois, afin de suivre l'évolution de leur démarche zéro déchet.</p>\n<p>Pour soumettre une candidature au Défi Zéro déchet et en savoir plus sur l'accompagnement offert, rendez-vous sur defizerodechet.ca.</p>\n<p>\n<span>Petits gestes, grandes réussites</span> De novembre 2020 à mars 2021, 50 foyers rosepatriens ont relevé avec succès le 3 <span>e</span> Défi Zéro déchet. Malgré les contraintes liées à la pandémie de COVID-19, ils ont mis en pratique et adopté de petits gestes visant la réduction à la source, qui ont fait toute la différence.</p>\n<p>En moyenne, les foyers participants de la 3 <span>e</span> édition ont réduit de :</p>\n<ul class=\"bulleted-list arrowlist\">\n<li>43 % leur quantité de déchets,</li>\n<li>29 % leur quantité de matières recyclables,</li>\n<li>30 % leur quantité de résidus alimentaires.</li>\n</ul>\n<p>SOURCE Ville de Montréal - Arrondissement de Rosemont - La Petite-Patrie</p>\n<p>Consulter le contenu original : <a href=\"http://www.newswire.ca/fr/releases/archive/January2022/19/c1457.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/fr/releases/archive/January2022/19/c1457.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}