{"date": "2022-01-26 03:24:47.560000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The Ministry of Agrarian Development and Irrigation (MIDAGRI), through the Sector Project Management Execution Unit (UEGPS), held important meetings with representatives of the most representative national native organizations of the Amazon, where the implementation of the work plan was explained. in which 162 native communities are considered holders this year, with the accompaniment of the same indigenous entities of the area.</p><p>All titling work in 2022 will be carried out through the revitalized PTRT3 Project, this time using resources from the Peruvian State, under a new intervention strategy GTS (Supervised Work Groups), within the framework of the II Agrarian Reform, which, among other main priorities, is to serve the communities and small rural producers in order to grant legal security over their lands and contribute to improving the quality of life of peasant and Amazonian families.</p></div><div class=\"tr-npp-body\"><p>In the meetings held, first with the representatives of the Confederation of Amazonian Nationalities of Peru (CONAP), and then with the Interethnic Association for the Development of the Peruvian Jungle (AIDESEP), the 2022 Work Plan for the formalization and titling of the lands of the Native Communities, reaching both institutions (MIDAGRI and Amazonian organizations), to assume a series of agreements. Among the commitments, they highlight that both CONAP and AIDESEP will provide the facilities requested by the PTRT3 Project, in order to implement the new intervention strategy (GTS) in the titling of native communities.</p><p>The unions must submit the information required by the PTRT3 Project for the sincerity of their goals. Propose people who will carry out support activities during the execution of the PTRT3 Project, based on the requirement made by the latter. Likewise, they must submit all the necessary documentation in order to enable the execution of said activities.</p><p>The MIDAGRI, through the UEGPS, committed to finance the fees for the services provided by the members of the indigenous organizations to promote the formalization and titling of the native communities that are within the scope of the PTRT3 Project, in accordance with the plans approved jointly with the respective regional governments. The UEGPS will also evaluate the contributions provided by CONAP and AIDESEP in order for them to be incorporated into the Plan for the Participation of Indigenous Organizations, which must contain an intervention schedule and physical goals in native communities (162).</p><p>The MIDAGRI team was led by the executive director of the Sectoral Project Management Execution Unit (UEGPS), Jos? Luis Pairazam?n Torres, and by the general coordinator of the PTRT3 Project, Alfredo Mart?nez Cruz. The CONAP leaders were represented by its president, Oseas Barbar?n S?nchez, and the leaders Holinda L?pez Torres, Nancy Kiara V?squez D?az, and ?lex Abramonte Letona.</p><p>AIDESEP was represented by its president, Jorge Perez Rubio, who was accompanied by directors Tabea Casique Coronado, Teresita Antazu Lopez, Oswaldo Juep Danducho, Waldir Eulogio Aza?a, Len?n Saquez Guimaraez, Cline Jorge Chauca L?pez, H?ctor Antonio Martin Manchi, Hestalin R?os Coronado, Milton C?sar Jim?nez Saldivar and Machari Vida Rodr?guez.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Euclid Infotech Pvt Ltd.</p></div>"}