{"date": "2021-02-15 09:41:58+00:00", "ticker": "AVV", "mrkt_info": {"open": 3893.0, "close": 3838.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><br/>\nBy Staff Writer<br/>\n<p><span class=\"round articleImage\" id=\"span\"></span></p>\n<div id=\"atext\">\n<div>Aveva, a global leader in engineering and industrial software, has signed partnership agreements with Egypt-based BASS and UAE-headquartered Peritus, to effectively deliver the company’s flagship engineering portfolio to customers.</div>\n</div>\n<div> </div>\n<div>BASS will specifically meet the increased demands for Aveva’s solutions in Egypt while Peritus will cater to customers in Saudi Arabia and Pakistan. Both companies will build awareness for Aveva’s solid portfolio and strengthen the company’s channel network and presence across the MEA region.</div>\n<div> </div>\n<div>“The MEA region is an important region for Aveva. We are investing heavily into our resources and channel network to be able to successfully expand our customer base and address the increasing demands for our pioneering solutions,” said Dr Tariq Aslam, Head of MEA, Aveva. “Some of the most important criteria that we look at while selecting partners, who can grow together with us, include market expertise, alignment of business values and customer-first approaches. Our newest partners, BASS and Peritus not only meet these requirements but also boast unique strengths that will play a key role in helping us to achieve digital business outcomes for our customers.”</div>\n<div> </div>\n<div>BASS is a global IT company providing quality software solutions across a broad spectrum of technologies and a well-recognised market player in the field of software development and custom development software projects.</div>\n<div> </div>\n<div>Mohamed Abdel Salam, Managing Director of BASS said: “Aveva bridges a genuine gap in the Egypt market and supports our business objective to be the digital partner of choice for our customers in their transformation goals. Our extensive channel partner network will also be able to leverage all the benefits that come with working with a global leader such as Aveva. We look forward to strengthening this relationship to create joint opportunities.”</div>\n<div> </div>\n<div>Peritus is dedicated to helping organisations in their journey towards digital transformation. The IT distributor helps companies to streamline processes, increase efficiency through innovation and modern technologies.</div>\n<div> </div>\n<div>Muhammad Saleem, Director of Peritus said: “We are excited to begin this collaboration with Aveva and assist our customers in Saudi Arabia and Pakistan to take advantage of Aveva’s best-in-class portfolio as they fortify their digital journeys. We look forward to building this relationship and scaling it to new heights, together with our partner ecosystem.”</div>\n<div> </div>\n<div>Aveva provides innovative industrial software to transform complex industries such as Oil &amp; Gas, Construction, Engineering, Marine, and Utilities. The company’s integrated portfolio capability harnesses the power of technologies such as Artificial Intelligence (AI), machine learning, mixed reality, advanced simulation and cloud computing. Aveva’s software solutions and platform enable the design and management of complex industrial assets like power plants, chemical plants, water treatment facilities and food and beverage manufacturers – deploying IIoT, big data and AI to digitally transform industries.</div>\n<div> </div>\n<div>The Aveva Partner Network today boasts over 5,000 members providing opportunities for Alliances, Systems Integrators, Distributors, Solution Providers and Technology Partners to participate in the Aveva community. -- <strong>Tradearabia News Service</strong></div>\n<p class=\"syndigate_disclaimer\">Copyright 2021 Al Hilal Publishing and Marketing Group Provided by SyndiGate Media Inc. (<a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a>).</p>\n<div class=\"footnote-disclaimer\">Disclaimer: The content of this article is syndicated or provided to this website from an external third party provider. We are not responsible for, and do not control, such external websites, entities, applications or media publishers. The body of the text is provided on an “as is” and “as available” basis and has not been edited in any way. Neither we nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this article. <a href=\"https://d3a0oa8cittb3t.cloudfront.net/researchreports/Disclaimers/TR%20Disclaimer.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read our full disclaimer policy here</a>.</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© TradeArabia</p></div>"}