{"date": "2021-02-11 06:15:00+00:00", "ticker": "AVV", "mrkt_info": {"open": 3750.0, "close": 3819.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Feb 11 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>French electrical equipment group Schneider Electric <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SCHN.PA\" data-type=\"ric\" data-ric=\"SCHN.PA\" translate=\"no\" dir=\"ltr\">SCHN.PA</a> said on Thursday it expects its revenues and core profit margin to grow this year, after a second-half rebound helped it beat market expectations for 2020.</p><p>The Paris-based conglomerate, which sells products ranging from electrical car chargers to industrial robotics, said it would now focus on integrating its recent acquisitions and creating synergies.</p><p>For 2021, Schneider forecast a continued recovery in Western Europe and strong growth in its other regions supported by robust demand for data centres.</p><p>While annual revenues fell overall, the company posted growth in its software and services business in the fourth quarter, boosted by several large contract renewals for its UK subsidiary Aveva <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AVV.L\" data-type=\"ric\" data-ric=\"AVV.L\" translate=\"no\" dir=\"ltr\">AVV.L</a>.</p><p>The firm forecast 2021 adjusted earnings before interest, tax and amortisation (EBITA) to be up between 9% and 15% organically, on the back of revenues gaining between 5% and 8%.</p><p>This would bring its core profit margin to between 16.1% and 16.5% in 2021, up from the better-than-hoped-for 15.6% from revenues of 25.16 billion euros ($30.50 billion) in 2020.</p><p>Analysts had forecast a full-year adjusted EBITA margin of 15.3% and full-year revenues of 24.98 billion euros.</p><p>Schneider proposed a dividend of 2.60 euros per share for 2020.</p><p><br/></p><p>($1 = 0.8249 euros)</p><p><br/></p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Juliette Portala and Sarah Morland in Gdansk; Editing by Amy Caren Daniel)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:sarah.morland@thomsonreuters.com\" data-type=\"email\" translate=\"no\">sarah.morland@thomsonreuters.com</a> ; <a href=\"mailto:juliette.portala@thomsonreuters.com\" data-type=\"email\" translate=\"no\">juliette.portala@thomsonreuters.com</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SCHNEIDER ELECTRIC-RESULTS/ (URGENT)</p></div>"}