{"date": "2022-02-25 23:54:18.464000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3027.16, "close": 3071.26}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The <a href=\"https://www.independent.co.uk/topic/kindle\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Kindle</a> might look like a regular tablet, but like all e-readers it uses a completely different type of display technology. Rather than showing text on a self-illuminating screen, the Kindle uses a special e-ink display illuminated by surrounding light, giving it the appearance of ordinary, physical paper.</p><p>This means the Kindle is as comfortable to read as any book or magazine, while still retaining all of the most useful features of reading on a tablet. They store tens of thousands of books, you can buy and download new ones almost instantly, they have battery life measured in weeks, and they let you do things like highlight passages, adjust the font size and look up word definitions as you read.</p></div><div class=\"tr-npp-body\"><p><a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> 's range includes four Kindles at four price points, each designed with different kinds of readers in mind. With the two cheapest Kindles you can pay £10 less and have product advertisements appear on the lock screen (or pay £10 more to remove them, if you want to think of it that way). There are also kids' versions of two of these Kindles, which are identical to the basic versions but come with an added children's book subscription and a kid-friendly cover.</p><p>Remember, with any Kindle it's still possible to download ebooks from places besides Amazon's own store, or even borrow them from your local library. And while Kindle might have the market cornered, it's not the only pony at the rodeo – check out our round-up of the <a href=\"https://www.independent.co.uk/extras/indybest/gadgets-tech/best-ereader-ebook-reader-amazon-kindle-kobo-a9377031.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">best ereaders</a> if you're a Bezos-averse bookworm.</p><p>So which Kindle is best? That depends how much you want to spend, how often you'll use it, how big your hands are, whether you usually read in bed, and if you're about to fall into a swimming pool. Read on for a full run-down of the differences between each Kindle, how they measure up, and which you should buy.</p><p><span>Read more:</span> </p><ul class=\"bulleted-list arrowlist\"><li><a href=\"https://www.independent.co.uk/extras/indybest/gadgets-tech/laptops-tablets/best-laptop-uk-laptops-b1883320.html\"><span>Best laptops 2022: Working from home or game on the go</span> </a> </li><li><a href=\"https://www.independent.co.uk/extras/indybest/gadgets-tech/best-vpn-free-paid-iphone-android-streaming-netflix-mac-windows-torrenting-b1811919.html\"><span>7 best VPNs for streaming on your Android, iPhone and PC</span> </a> </li><li><a href=\"https://www.independent.co.uk/extras/indybest/gadgets-tech/laptops-tablets/best-laptop-student-uk-b1806735.html\"><span>8 best laptops for students studying for success</span> </a> </li><li><a href=\"https://www.independent.co.uk/extras/indybest/gadgets-tech/laptops-tablets/laptop-buying-guide-how-to-b1838170.html\"><span>How to choose the best laptop for you</span> </a> </li><li><a href=\"https://www.independent.co.uk/extras/indybest/gadgets-tech/laptops-tablets/best-laptops-uk-2020-high-performance-b1776272.html\"><span>10 best high-end laptops for great performance</span> </a> </li> </ul><p>How we tested:\n                    We've been using all four Amazon Kindle devices since they launched, with most of our reading taking place on the new Kindle Paperwhite and the Kindle Oasis. We took these ereaders on planes, trains and automobiles, and we've used them in broad, direct sunlight as well as in the middle of the night. We also tested the built-in Audible functionality, which lets you switch between reading and listening to a book, on the devices which have this feature.The best Kindle in 2022 is:</p><ul class=\"bulleted-list arrowlist\"><li><span>Best budget Kindle</span> – Kindle: £69.99, <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2Fdp%2FB07FQ4DJ7X%3Fascsubtag%3DIN%7C2017468%7CB07FQ4DJ7X\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.co.uk</a> </li><li><span>Best all-rounder</span> – Kindle Paperwhite: £129.99, <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2Fkindle-paperwhite-8-gb-now-with-a-68-display-and-adjustable-warm-light-with-ads%2Fdp%2FB08N3TCP2F%3Fascsubtag%3DIN%7C2017468%7CB08N3TCP2F\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.co.uk</a> </li><li><span>Best for bedtime reading</span> – Kindle Paperwhite signature edition: £179.99, <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2Fdp%2FB08N2QK2TG%3Fascsubtag%3DIN%7C2017468%7CB08N2QK2TG\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.co.uk</a> </li><li><span>Best premium Kindle</span> – Kindle Oasis: £229.99, <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2Fgp%2Fproduct%2FB07L5GDTYY\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.co.uk</a> </li> </ul><p>Kindle <span>Best:</span> Budget KindleThe 10th generation of the entry-level Kindle launched in 2019 and closed the gap between itself and the more premium Kindle Paperwhite (£129.99, <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2Fkindle-paperwhite-8-gb-now-with-a-68-display-and-adjustable-warm-light-with-ads%2Fdp%2FB08N3TCP2F%3Fascsubtag%3DIN%7C2017468%7CB08N3TCP2F\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.co.uk</a> ). Whereas older generations of this model lacked a built-in light – meaning you had to use a traditional reading light like our caveman ancestors once did – the newest version has four LEDs surrounding the display for comfortable reading in the dark.That simple upgrade removed one of the biggest reasons you might want to spend a little more on the <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2Fkindle-paperwhite-8-gb-now-with-a-68-display-and-adjustable-warm-light-with-ads%2Fdp%2FB08N3TCP2F%3Fascsubtag%3DIN%7C2017468%7CB08N3TCP2F\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Kindle Paperwhite</a> , and makes the most affordable device in the range our recommendation for the average reader in search of a simple ereader to take with them on holiday. The features it still lacks aren't deal breakers. There's no adjustable warm light, meaning you're stuck with a cold blueish page even at two in the morning. The basic Kindle isn't waterproof either, so if a particularly frightening paragraph causes you to drop it in the tub, it might be a goner. <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2Fdp%2FB07FQ4DJ7X%3Fascsubtag%3DIN%7C2017468%7CB07FQ4DJ7X\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Buy now</a> £69.99, Amazon.co.ukKindle Paperwhite <span>Best:</span> All-rounder The Kindle Paperwhite is a more premium version of the basic Kindle (£69.99, <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2Fdp%2FB07FQ4DJ7X%3Fascsubtag%3DIN%7C2017468%7CB07FQ4DJ7X\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.co.uk</a> ), and as such it's got a few more useful features included. It's also the most recently updated member of the Kindle crew. Amazon regularly refreshes the range with design tweaks and upgrades, and the Kindle Paperwhite received a small makeover in 2021.Among other improvements it has a larger 6.8in screen and a higher-resolution display. In practical terms that means letters appear sharper and more detailed, so you can read more comfortably at your usual text size or with the Kindle held further away, or reduce the text size to fit more words on each page.The Kindle Paperwhite uses more LED lights surrounding the display so that illumination is brighter and smoother across the page. It can also adjust from a cold, blue daylight to a warmer amber colour – like the night-mode feature on a smartphone – for more comfortable reading in low-light. This model is also waterproof, so if you're a clumsy clown who likes to read by the swimming pool or at the beach, the Kindle Paperwhite is the way to go. <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2Fkindle-paperwhite-8-gb-now-with-a-68-display-and-adjustable-warm-light-with-ads%2Fdp%2FB08N3TCP2F%3Fascsubtag%3DIN%7C2017468%7CB08N3TCP2F\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Buy now</a> £129.99, Amazon.co.ukKindle Paperwhite Signature Edition <span>Best:</span> For bedtime readingThe decadent sounding <span>signature edition</span> of the Kindle Paperwhite (£129.99, <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2Fkindle-paperwhite-8-gb-now-with-a-68-display-and-adjustable-warm-light-with-ads%2Fdp%2FB08N3TCP2F%3Fascsubtag%3DIN%7C2017468%7CB08N3TCP2F\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.co.uk</a> ) is almost identical to the standard edition, but with a few luxury elements added.For your extra £40 you get an ad-free lock screen, wireless charging, 32GB of storage for holding extra books and a light that adjusts itself automatically to suit your surroundings. These are interesting upgrades, but the signature edition is a tough sell for most shoppers.The basic Kindle Paperwhite doesn't need charging very often, so plugging in isn't a hassle, and if you rarely stray from a wi-fi network and don't plan on using the Kindle as an audiobook player, the extra storage isn't needed. Unlike TV shows, music and movies, books just don't take up much space. The introduction of a light sensor for automatic brightness adjustment is the biggest improvement here, but if you're planning on dropping £180 on a Kindle, you might want to consider shelling out a little more for the best Kindle in the range. <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2Fdp%2FB08N2QK2TG%3Fascsubtag%3DIN%7C2017468%7CB08N2QK2TG\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Buy now</a> £179.99, Amazon.co.ukKindle Oasis <span>Best:</span> Premium KindleThe Lamborghini of ereaders, the Kindle Oasis is Amazon's leading star, and pulls out all of the stops in its mission to get words out of the page and into your brain. It's the most advanced and expensive Kindle in the range, sporting a metallic, asymmetrical design and a thicker ergonomic edge that sits comfortably in one hand. The magnetic fabric cover case (£39.99, <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2FKindle-Oasis-Water-Safe-Fabric-Generation%2Fdp%2FB07B8DTLWW%3Fascsubtag%3DIN%7C2017468%7CB07B8DTLWW\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.co.uk</a> ) doubles as bonus battery capacity, and the screen can automatically flip 180 degrees so that the Kindle can be held in either hand.Apart from the wireless charging of the signature edition Kindle Paperwhite (£129.99, <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2Fkindle-paperwhite-8-gb-now-with-a-68-display-and-adjustable-warm-light-with-ads%2Fdp%2FB08N3TCP2F%3Fascsubtag%3DIN%7C2017468%7CB08N3TCP2F\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.co.uk</a> ), every feature of lesser Kindles is included. Sensors automatically adjust the screen warmth and brightness depending on your surroundings. Audiobooks can pick up where you left off reading, and vice-versa. And waterproofing gives you the confidence to continue reading near puddles.So, is it worth the extra cash? We love the Kindle Oasis, but the cheaper Kindles have everything you need in an ereader. The best ereaders are the ones you forget your holding, that fade into the background so that there's nothing standing between you and your book. The entry-level Kindle does exactly that, but if you're a fan of bells and whistles, the Oasis is one of the best-designed pieces of technology you'll ever hold. <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2Fgp%2Fproduct%2FB07L5GDTYY\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Buy now</a> £229.99, Amazon.co.ukThe verdict: Which Kindle should I buy?The four devices in the Kindle range are designed to suit different types of readers, but if we had to pick just one Kindle to take into an underground bunker it would be the <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2Fkindle-paperwhite-8-gb-now-with-a-68-display-and-adjustable-warm-light-with-ads%2Fdp%2FB08N3TCP2F%3Fascsubtag%3DIN%7C2017468%7CB08N3TCP2F\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Kindle Paperwhite</a> . For almost every user the mid-range Kindle strikes the best balance between cost and functionality. The inclusion of a softer reading light that can be made warmer for more comfortable reading at night is worth the small step-up in price, while the ability to charge using the increasingly ubiquitous USB-C cable means you're less likely to be caught short by a dead battery. On top of that you get a slightly larger display, slimmer bezels and sharper text.The <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2Fgp%2Fproduct%2FB07L5GDTYY\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Kindle Oasis</a> is the most advanced ereader in the range, and while the price has come down since launch it's still an expensive piece of hardware, considering it basically performs just as well as a Kindle costing half as much. Still, if you know an avid reader and really want to spoil them, the luxury Kindle Oasis is a showstopper of a gift.Voucher codesFor the latest discounts on ereaders and other tech offers, try the below links:</p><ul class=\"bulleted-list arrowlist\"><li><a href=\"https://www.independent.co.uk/vouchercodes/currys\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Currys discount codes</a> </li><li><a href=\"https://www.independent.co.uk/vouchercodes/apple\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Apple discount codes</a> </li> </ul><p><span>Lose yourself in the music with our pick of the</span><a href=\"https://www.independent.co.uk/extras/indybest/gadgets-tech/headphones-earphones/best-wireless-headphones-beats-bose-sony-apple-noise-cancelling-a9350946.html\"><span>best wireless headphones</span> </a><span>from Sony, Bose and more</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 Independent, The (UK) (Online). All rights reserved.</p></div>"}