{"date": "2021-11-15 19:11:40.094000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>AMAZON.COM INC (\"AMZN-Q\")\n- More Deals Than Ever Before for Its 48-Hour Black Friday Event\n\n  Amazon announced that more Black Friday deals than ever before will be\navailable starting on Thursday, November 25. Customers will be able to shop\nincredible deals with deep discounts on top products and must-have items,\nincluding new gadgets and electronics from Samsung; kid-favorite toys and\nbaby essentials from Mattel and Cybex gb Pockit; must-have home and kitchen\nitems from Instant Pot; seasonal fashion finds, including rag &amp; bone from\nShopbop; and beauty favorites from Sunday Riley, OPI, Color Wow, and many\nmore. In addition, customers can find thousands of deals from Amazon's\nindependent selling partners, most of which are small and medium-sized\nbusinesses, throughout Amazon's 48-hour Black Friday event, including deals\nfrom women-owned, military family-owned, and Black-owned businesses.\n\n  Customers can also shop from Amazon's biggest selection of gift guides,\nincluding newly launched guides and longtime customer-favorites like\nStocking Stuffers, Customer's Most Loved, and Holiday Toy List, along with\nthe Electronics, Fashion, Beauty guides. Newly released gift guides\ninclude:\n\n//st\n\n* Oprah's Favorite Things: Back for the seventh year, Oprah's Favorite\n  Things list includes a coveted assortment of Oprah's must-have products,\n  many from people of color and women-owned businesses, including Kiya\n  Tomlin, Clara Sunwoo, and Saysh by Allyson Felix. Customers can visit\n  amazon.com/oprah to shop now and receive 20% off select items in Oprah's\n  list through December 31.\n* Experts' Gift Picks Gift Guide: For those looking for gifting\n  inspiration, Amazon dropped this star-studded list featuring top picks\n  from A-list celebrities like Jessica Alba, Jojo Siwa, gold medalist Suni\n  Lee and influencer duo Aint Afraid, and media outlets including BuzzFeed\n  and Refinery29, among others. To view these gift guides and more, visit\n  amazon.com/expertsgiftspicks.\n* Luxury Stores Gift Guide: Discover special gifts to give and get this\n  season with curated gift guides, featuring new arrivals in Luxury Stores,\n  from Cle de Peau Beaute and ReVive Skincare to La Perla and Missoni. Shop\n  limited edition beauty gift sets and festive looks for dressing up this\n  holiday season, or find the perfect gift for friends and family. To view\n  this gift guide and shop from luxury brands, visit\n  amazon.com/luxurystores.\n\n//et\n\n  Supporting Small and Medium-Sized Businesses\n\n  Amazon's U.S. independent selling partners, most of which are small and\nmedium-sized businesses, selling in Amazon's store sold more than 3.8\nbillion products in the 12 months ending August 31, 2021. This Black\nFriday, customers can continue to support small and save on gifts from\nsmall businesses, Amazon Handmade, and Amazon Launchpad, and by visiting\namazon.com/supportsmall. Handmade artisans, entrepreneurs, and emerging\nbrand owners can all be found on Amazon--including women-owned, military\nfamily-owned, and Black-owned businesses.\n\n  Where and When to Shop\n\n  The Black Friday 48-hour deal event, from November 25 through November\n26, while supplies last, is available to shop on amazon.com/blackfriday, on\nthe Amazon shopping app, at Amazon 4-star stores, Amazon Books stores, or\nby asking \"Alexa, what are my deals?\" Plus, Prime members get 30-minute\nearly access to select Lightning Deals on Amazon throughout the holiday\nseason, and every day.\n\n  Customers can also watch livestreams on Black Friday to discover\nincredible holiday deals the minute they go live, including exciting deals\nrevealed first via Amazon Live. Shop with celebrities, influencers, and\nexperts who will help customers discover the best deals with product\ndemonstrations, try-on hauls, and a live chat. Viewers will also be able to\neasily shop the featured products and brands through a carousel that\nupdates in real-time. To watch, visit amazon.com/live or the Amazon Live\nshopping app on Fire TV.\n\n  Black Friday Deals Preview\n\n  Below is a sneak peek of top deals available during Amazon's Black Friday\nevent, from November 25 through November 26.\n\n//st\n\n* Holiday Toy List: Save on dolls, toys, and accessories from L.O.L.\n  Surprise!, PAW Patrol, Bluey, Little Tikes, Fisher-Price, Barbie, Hot\n  Wheels, and more. Save up to 30% on party games from Cards Against\n  Humanity and gifts from Disney, Marvel, DC, and PJ Masks.\n* Seasonal Fashion: Save on a selection of footwear, apparel, accessories,\n  and best sellers, including up to 40% on Levi's for the family and up to\n  30% on adidas. Save up to 25% on select Fall Fashion styles from Shopbop,\n  including rag &amp; bone, Frame, and Mother Denim. Save up to 25% on a Made\n  For You custom T-shirt, and up to 30% on Staples by The Drop. Plus,\n  shoppers save $10 when they spend $50 on their first order from Prime Try\n  Before You Buy, and both new and existing customers save $10 when they\n  spend $50 with Personal Shopper by Prime Try Before You Buy (terms and\n  conditions apply).\n* Home Entertaining and Decor: Save up to 40% on Instant Brands kitchen\n  appliances. Save up to 43% on robot, cordless, and upright vacuums from\n  Shark. Save up to 30% on air purifiers from Levoit and Coway. Save up to\n  15% on select furniture.\n* Electronics: Save up to 30% on select TVs from Samsung, Sony, and LG.\n  Save on select headphones from Bose, Sony, and Beats. Save up to 29% on\n  select Garmin watches and navigation products. Save up to 30% on select\n  desktops, laptops, monitors, and tablets. Receive a $50 Amazon\n  promotional credit with the purchase of Oculus Quest 2. Save $40 with the\n  purchase of FlashForge Adventurer 3 Lite 3D Printer.\n* Beauty: Save $50 on Sunday Riley Mini Vault Skincare Collection, an\n  Amazon exclusive. Save up to 30% on lash serums and hair sprays from\n  Grande Cosmetics and Color Wow. Save up to 40% on grooming appliances\n  from Braun and Panasonic. Save up to 50% on Waterpik.\n* Amazon Brands: Save up to 30% on men's and women's fashion. Save up to\n  30% on tech accessories and home products. Save up to 35% on fitness and\n  wellness essentials. Save up to 40% on pet food from Wag. Save up to 20%\n  on baby products from Mama Bear.\n* Amazon Devices: Save up to 42% on select Alexa-enabled devices including\n  Echo Show 5 (2nd Gen) Kids, Echo Buds (2nd Gen) with wired case, and Echo\n  Frames (2nd Gen). Save up to 30% on Amazon Fire TV 50\" 4-Series. Save up\n  to 30% on the Kindle Oasis. Save up to 50% on the Fire TV Stick 4K. Save\n  up to 50% on select Fire HD tablets. Save up to 30% on Blink video\n  Doorbell. Save $20 on the Luna Controller.\n* Tools, Garden, and Automotive: Save up to 30% on select DEWALT tools.\n  Save up to 31% on select generators from DuroMax. Save up to 30% on\n  select AeroGarden indoor gardens. Save up to 30% on select auto parts and\n  accessories.\n* Sports &amp; Outdoors: Save up to 30% on select Coleman and Marmot equipment.\n  Save up to 30% on select Team Sports products.\n* Entertainment: Save up to 50% on select Prime Video movies to rent or\n  buy, from new releases to classics, plus hit TV shows, seasonal content,\n  and more. And save with Amazon Music Unlimited, free for three months for\n  new customers, or free for six months with the purchase of select Amazon\n  Echo devices. Readers can also save up to 80% on 100+ best sellers on\n  Kindle, 50% or more on select Kindle Exclusive titles, up to 50% on\n  Amazon exclusive print titles, and up to 30% on children's books.\n* Virtual Travel and Experiences: Save up to 50% on all Amazon Explore\n  experiences, hosted by local experts, U.S. customers have access to a\n  wide range of livestreamed, interactive experiences across the globe--all\n  from the comfort of their homes. Customers can shop unique items, learn\n  how holidays are celebrated around the world, and gift experiences to\n  their friends &amp; family.\n\n//et\n\n  Investing in Our Team\n\n  Amazon's extraordinary employees come together to deliver joyful\nexperiences for customers year-round, and the company recently announced\nit's hiring an additional 125,000 full- and part- time positions and\n150,000 seasonal jobs with an average starting pay of $18 per hour, sign-on\nbonuses of up to $3,000, and an additional $3 per hour depending on shifts\nin many locations. These employees are the heart and soul of Amazon, which\nis why the company has spent more than $15 billion across its fulfillment\nnetwork to help keep employees safe and deliver products to customers.\nAdditionally, the company has continued to invest in technology, aircraft,\nships, and buildings to ensure it has the products customers want and need\navailable throughout the season. Plus, it's putting more selection in\nfulfillment centers closer to customers, which is possible because of the\nsophisticated and innovative network Amazon has built over 20 years. These\nimprovements mean customers can continue to rely on fast and efficient\ndelivery throughout the holiday season and beyond.\n\n  Fast, Free, and Convenient Delivery Options\n\n//st\n\n* Free One-Day and Same-Day Delivery: Prime members in the U.S. can shop a\n  selection of over 10 million items eligible for Prime Free One-Day\n  Delivery with no minimum purchase, and millions of items are available\n  for Free Same-Day Delivery in 47 major metropolitan areas. Prime members\n  can also shop over 3 million items available for delivery in as fast as\n  five hours with faster Same-Day Delivery--now available in 15 cities.\n  These fast delivery options are not only convenient for customers, but\n  they're better for the planet. Same-Day deliveries ship from local\n  fulfillment centers, so the items travel shorter distances and generate\n  less carbon emissions. This is just another way Amazon is reducing the\n  impact of climate change on future generations by building a sustainable\n  business. Learn more at amazon.com/primedelivery or start a free 30-day\n  trial of Prime at amazon.com/prime.\n* Ultrafast Grocery Delivery and Pickup: Prime members in more than 5,000\n  cities and towns have access to two-hour grocery delivery on more than\n  170,000 products from Whole Foods Market and Amazon Fresh. With Amazon\n  Fresh, Prime members get free two-hour delivery, plus free grocery pickup\n  at select Amazon Fresh stores on orders over $35. Prime members can also\n  find toys, gifts, household products, everyday essentials, electronics,\n  Amazon devices, and more at Amazon Fresh. Prime members get free pickup\n  on orders over $35 from Whole Foods Market stores nationwide.\n* Delivery Where it's Needed Most: Whether customers are road-tripping to\n  see family, staying home and need a secure delivery location, or sending\n  a gift to a loved one or friend, Amazon provides thousands of package\n  pickup locations for customers. These locations are conveniently located\n  near or in offices, convenience stores, malls, apartment buildings, and\n  grocery stores, in more than 900 cities and towns across the U.S. Tens of\n  millions of products can be easily and conveniently delivered to an\n  Amazon pickup point at Whole Foods Market, 7-11, Chase Bank, Rite-Aid,\n  HealthMart, GNC, Stage Stores, and other locations. To find a location,\n  visit amazon.com/hub.\n* Extended Returns Window: Most of the items purchased between October 1,\n  2021, and December 31, 2021, can be returned until January 31, 2022.\n\n//et\n\n  Get the latest news by visiting About Amazon, where you can find shopping\ntips and ways to save this season and learn more about holiday delivery.\n\n  About Amazon\n\n  Amazon is guided by four principles: customer obsession rather than\ncompetitor focus, passion for invention, commitment to operational\nexcellence, and long-term thinking. Amazon strives to be Earth's Most\nCustomer-Centric Company, Earth's Best Employer, and Earth's Safest Place\nto Work. Customer reviews, 1-Click shopping, personalized recommendations,\nPrime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career\nChoice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out\ntechnology, Amazon Studios, and The Climate Pledge are some of the things\npioneered by Amazon. For more information, visit amazon.com/about and\nfollow @AmazonNews.\n\nAmazon.com, Inc.\nMedia Hotline\nAmazon-pr@amazon.com\nwww.amazon.com/pr\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2131800226.MNPRE2131801858-06482420211115</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}