{"date": "2021-12-13 16:11:58.966000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>HEALTHCARE TRIANGLE INC (\"HCTI-Q\")\n- Acquires DevCool, an Electronic Health Record (EHR) Focused\n- Healthcare IT and Managed Services Company\n\n   Healthcare Triangle, Inc., a leading provider of Healthcare and Life\nSciences cloud transformation, managed services and data analytics platform\ncompany, announced today that it has acquired DevCool, Inc. (\"DevCool\"),\nranked by Inc. 5000 as among the fastest growing private companies in USA\nin 2021.\n\n   DevCool provides EHR Implementation and Managed Services to 6 of the top\n10 hospitals in the USA and specializes in providing services to cancer\nresearch hospitals and university medical centres. The combined entity will\nfocus on accelerating healthcare providers to adopt cloud technologies in\nimproving clinical, operational, and financial performance. This will open\nup significant opportunities for HCTI, a premier partner of AWS, Google\nCloud, and Microsoft Azure, to upsell its SaaS Platforms like CloudEz,\nDataEz, and Readabl.AI to the existing client base of DevCool.\n\n   \"With the acquisition of DevCool, Healthcare Triangle will implement\ntechnological advancements designed to improve hospitals' provisioning of\npatient care, reduce information technology costs, and enable faster EHR\ndeployments for hospital clients as part of its strategy to consolidate its\nleadership position in the healthcare space. This will further allow\nclients to host their EHR on public clouds (Amazon Web Services, Google\nCloud, and Microsoft Azure) with the HCTI's CloudEz Platform and\nexpertise,\" said Suresh Venkatachari, Chairman and CEO of Healthcare\nTriangle, Inc.\n\n   He added that, \"With the acquisition of DevCool, we will add large\nhealth systems and Integrated Delivery Networks (IDN) to HCTI's client\nportfolio, and we expect it to be accretive to EBITDA.\"\n\n   \"We see the acquisition of DevCool improving patient outcomes by\nimplementing AI and Data driven platforms across medical centers and\nclinical facilities. Healthcare Triangle (HCTI) expects significant\nopportunities in cloud transformation services, further growth of data\nanalytics and AI platforms based recurring revenues in the healthcare\ndomain,\" said Shibu Kizhakevilayil, Head of M&amp;A and Board of Director of\nHealthcare Triangle Inc. \"We look forward to working with Sandeep Deokule\nand the DevCool team in our continued journey to become a top 10 healthcare\nIT company in US,\" said Mr. Kizhakevilayil.\n\n   \"We are excited to be part of HCTI, and our goal is to continue helping\nhospitals innovate and at the same time keep EHR Managed Services cost\nlower,\" said Sandeep Deokule, founder of DevCool. \"DevCool along with HCTI\nwill now be able to scale faster, deliver large scale EHR implementations,\nand host applications on the cloud.\"\n\n   About Healthcare Triangle, Inc. (HCTI)\n\n   Healthcare Triangle, Inc., based in Pleasanton, Calif., reinforces\nhealthcare progress through breakthrough technology and extensive industry\nknowledge and expertise. We support healthcare organizations--including\nhospitals and health systems and health plans--as well as pharma and life\nsciences organizations, in their efforts to improve health outcomes.\nHealthcare Triangle enables the rapid adoption of new technologies, data\nenlightenment, business agility, and response to immediate business needs\nand competitive threats. The highly regulated healthcare and life sciences\nindustries rely on Healthcare Triangle for expertise in digital\ntransformation encompassing the cloud, security and compliance, data\nlifecycle management, healthcare interoperability, and clinical and\nbusiness performance optimization. For more information, visit\nHealthcareTriangle.com.\n\n   Visit www.healthcaretriangle.com for more information.\n\n   About DevCool\n\n   DevCool, Inc., Fastest Growing Company in USA in 2021 (by Inc. 5000\nMagazine) is a trusted technology and business solutions provider for\nAmerica's top healthcare organizations by providing EHR IT Managed\nServices. DevCool helps to rethink Healthcare delivery models by combining\ncutting edge Healthcare IT solutions and EHR Managed Services. For more\ninformation, please visit <a href=\"http://www.devcool.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.devcool.com</a>.\n\nFor Media Enquiries:\nMichael Campana\nmichael.c@healthcaretriangle.com\n\nHealthcare Triangle, Inc. Contact:\nJohn McNamara\njohn@tradigitalir.com\n917-658-2602\n\nTel   : 925-270-4812    HEALTHCARE TRIANGLE INC\nWWW   : <a href=\"https://www.healthcaretriangle.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.healthcaretriangle.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134600330.MNPRE2134601752-08021120211213</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}