{"date": "2022-02-02 19:44:16.935000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3023.87, "close": 2776.91}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Nearly 400 drivers who have delivered parcels for Amazon have joined a legal battle seeking compensation from the internet retail giant over employment rights, <span>The Independent</span> can reveal.</p><p>Legal firm Leigh Day launched a claim on behalf of one driver just months ago – but the number who have signed up to take action has now swelled to 392.</p></div><div class=\"tr-npp-body\"><p>Drivers who distribute goods to addresses for Amazon via \"delivery service partner\" firms are classed as self-employed, denying them employee rights such as the minimum wage and holiday pay.</p><p>One driver involved in the legal action disclosed how he endured gruelling shifts delivering up to around 300 packages a day and faced more than a month off work without pay when he fell ill. He accused Amazon of treating drivers as \"slaves\", urging it instead to recognise them as employees.</p><p>Leigh Day believes at least 3,000 drivers could be entitled to an average of £10,500 in compensation for each year they have delivered parcels for the firm founded by billionaire Jeff Bezos – meaning Amazon might have to pay out millions of pounds.</p><p>The company – which posted a £5.8bn profit in the first three months of last year – has previously faced allegations that some drivers working for courier firms delivering its goods have taken home less than the minimum wage.</p><p>The legal action follows a landmark ruling against Uber last year in which the Supreme Court decided the app's drivers should be classified as workers and entitled to rights.</p><p>It comes as a survey of drivers who had delivered parcels for Amazon over the Christmas period found nearly nine in 10 revealed that targets or working conditions had put themselves or others at risk of harm. The poll of 131 drivers, including 75 who had signed up at the time to make claims, was conducted by Leigh Day between December 27 and January 8.</p><p>Meanwhile, eight in 10 said their job as a delivery driver had felt more pressured since the Covid-19 pandemic, while only half said the money they earned doing the role covered the cost of living. About a third said they worked more than 12 hours a day, and 94 per cent revealed they worked without taking a break. One in five said they had worked more than six days in a row without taking a day off.</p><p>Leigh Day submitted an employment tribunal claim on behalf of one driver in August, and had one other driver signed up as a client when it publicised the legal action in October. Since then, a further 390 drivers have signed up with Leigh Day to take legal action as of Friday morning.</p><p>Leigh Day has been advertising the legal action on radio and on billboards in a bid to raise awareness. The claims being made are against both Amazon and as many as 40 \"delivery service partners\".</p><p>So far, Leigh Day said 13 individuals' claims have been submitted to employment tribunals but the law firm said the remainder will be submitted over the coming months. Drivers must have delivered Amazon parcels within the previous 10 weeks when they sign up with Leigh Day to make a claim. It means not all involved are necessarily still delivering for Amazon.</p><p>Leigh Day lawyer Kate Robinson said: \"Leigh Day is acting on behalf of drivers who are making employee rights claims against Amazon. This means that drivers are asking the employment tribunal to recognise that the way drivers work in practice, and how they fit into Amazon's business, means they should be classed as employees rather than self-employed as they currently are.</p><p>\"Being classed as employees would give them rights they are not currently entitled to such as holiday pay, at least national minimum wage and an employment contract. If the employment tribunal agrees that drivers are employees, claimants will go back to the tribunal to decide how much compensation should be given.\"</p><p>One of the 13 claims already submitted to an employment tribunal is being made by a 29-year-old who delivered goods for Amazon as a self-employed driver via a service partner firm for about three years until last July. His claim, against both Amazon and the service provider, was submitted at an employment tribunal in December.</p><p>He told <span>The Independent</span> he delivered up to around 300 parcels a day via a route dictated by a phone app, in gruelling nine-hour shifts during which he often went without a break because he did not have time. He said he was paid less than £130 per route which he had to complete during a shift, but had to pay £200 out of his wages each week to rent his van. Drivers were given 18p per mile towards fuel but this did not always cover the true cost, he said. He was not entitled to sick or holiday pay, he added.</p><p>The driver, who moved to the UK from Romania in 2017 and lives in Luton, said: \"I wasn't happy to work for Amazon anymore because they don't care about drivers, actually. You delivered [for] nine hours and you have to be fast, without having breaks. You can't deliver properly.\"</p><p>The working conditions were not always safe, he said, explaining: \"It was dark, cold, [in] unsafe areas, and I felt tired without having eaten all day. They are saying you can still take your break but you end up not finishing the route.\" Wages could be deducted for not finishing routes, he said.</p><p>On one shift in late 2018, he explained he was \"very stressed\" because of the amount of parcels he had to deliver and accidentally reversed into a pole. He said he ended up having to fork out more than £1,000 to pay for repairs to the rental vehicle, which was deducted in instalments from his wages.</p><p>Around that time, the driver said he was hospitalised for 12 days to be treated for a health condition and ended up being unable to work for a month and a half. \"They don't support you at all, you don't have sick pay or anything. You have to work, work, work,\" he said, explaining money was tight then and he had to borrow from friends.</p><p>\"You're self-employed but, actually, the rules are for employed,\" he argued. \"It's not fair at all, this is the way they have to change to employ people.\" Referring to Amazon's profits, he said: \"They're getting richer and richer but, actually, how are they getting that?\"</p><p>Asked what his message to Amazon would be, he said: \"Just to treat drivers, everyone working for them, as employees and stop treating them as slaves.\"</p><p>An Amazon spokesman said: \"We're hugely proud of the drivers who work with our partners across the country, getting our customers what they want, when they want, wherever they are. We are committed to ensuring these drivers are fairly compensated by the delivery companies they work with and are treated with respect, and this is reflected by the positive feedback we hear from drivers every day.\"</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/news/new-york-paramount-pictures-sony-pictures-marvel-north-america-b2003816.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">On a quiet weekend in theaters, 'Spider-Man' is No. 1 again</a> </p><p><a href=\"https://www.independent.co.uk/news/art-spiegelman-sales-new-york-tennessee-amazon-com-b2003273.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Sales soar for 'Maus' after its banning in Tennessee</a> </p><p><a href=\"https://www.independent.co.uk/news/alexei-navalny-new-york-city-tiananmen-square-cha-cha-real-smooth-dakota-johnson-b2003264.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">'Nanny,' 'Exiles,' 'Navalny' among top Sundance winners</a> </p><p><a href=\"https://www.independent.co.uk/news/brazil-jair-bolsonaro-rio-de-janeiro-omicron-data-b2002160.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Omicron surge in Brazil hospitalizing the unvaccinated</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/amazon-staten-island-alabama-union-b2002109.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon workers face historic union elections in New York City and Alabama</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/amazon-warehouse-influence-programme-ends-b2001427.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon shutters widely ridiculed 'everything is fine' influencer scheme</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 Independent, The (UK) (Online). All rights reserved.</p></div>"}