{"date": "2022-01-05 11:00:37.454000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">NEW YORK, Jan. 5, 2022</p></div>\n\n<div class=\"xn-content\">\n\n<p><span>Veriff accelerates its AI-powered identity verification platform's journey to the cloud with AWS</span></p>\n  <p><span class=\"xn-location\">NEW YORK</span>, <span class=\"xn-chron\">Jan. 5, 2022</span> /PRNewswire/ -- <a href=\"http://www.veriff.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Veriff</a>, a global identity verification (IDV) provider, today announced that it has joined the Amazon Web Services (AWS) Partner Network (APN). By joining the APN as an AWS Advanced Technology Partner, Veriff becomes part of the global community of Partners leveraging the network to build cloud-based solutions and services for customers across a number of industries.</p>\n<p> </p>\n<div id=\"prni_dvprnejpgc04fleft\" style=\"WIDTH:100%;TEXT-ALIGN:left\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img align=\"middle\" alt=\"Veriff Logo\" border=\"0\" id=\"prnejpgc04fleft\" src=\"https://mma.prnewswire.com/media/1654545/Veriff_Logo.jpg\" title=\"Veriff Logo\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMTY1NDU0NS9WZXJpZmZfTG9nby5qcGc=&amp;key=b8803b035d7b54cdac6222e9906288b9ed2a7b5d62dddec3e2b42c1c7c5aa6dde1adac528e0c1c4b5bcc8b711a8995141d453af4c79808ed725b058604d45ee5\"/></div></div></div><p> </p>\n<p>Veriff analyzes more than 10,000 variations of government-issued IDs from over 190 countries in 40 different languages via machine learning and through its intelligent decision engine. This empowers Veriff customers to expand across borders as it makes its decision engine smarter and more effective over time, and this work with AWS will only expand Veriff's footprint. Veriff sets the benchmark for online IDV today, utilizing its AI-powered capabilities to deliver on the growing need for trust online.</p>\n<p>The APN is the global partner program for AWS. The main focus lies with helping Partners build successful AWS-based businesses or solutions. Becoming part of the APN paves the way for service providers to reach a broader audience and build meaningful connections. Veriff's AI-powered IDV solution will now be offered to millions of companies as the APN grows and expands globally every quarter.</p>\n<p>\"Continuing to grow our business by providing a leading, premium digital IDV solution is a key component of Veriff's operations. We are proud to extend our collaboration with AWS as an Advanced Technology Partner as we work to help our customers mitigate the risks of identity fraud on a global scale,\" said Janer Gorohhov, Co-Founder and Chief Product Officer of Veriff.</p>\n<p>For more information about Veriff, please visit <a href=\"http://www.veriff.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.veriff.com</a>. </p>\n<p><b>About Veriff</b></p>\n<p>Veriff is a global online identity verification company that enables organizations to build trust with their customers through intelligent, accurate, and automated online IDV. The largest document specimen database on the market, Veriff's intelligent decision engine can analyze thousands of technological and behavioral variables in seconds, matching people to more than 10,000 government-issued IDs from over 190 countries and in 40 languages. Founded in 2015, Veriff serves a global portfolio of organizations across fintech, crypto, and mobility sectors. Veriff's total secured funding to date is <span class=\"xn-money\">$92.8 million</span> and its investors include IVP, Accel, Mosaic Ventures, Y Combinator, Nordic Ninja and others. With teams in the U.S., UK, <span class=\"xn-location\">Spain</span> and <span class=\"xn-location\">Estonia</span>, Veriff employs more than 360 people from 46 different nationalities. For more, visit <a href=\"http://www.veriff.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.veriff.com</a>.</p>\n<p>Logo - <a href=\"https://mma.prnewswire.com/media/1654545/Veriff_Logo.jpg\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://mma.prnewswire.com/media/1654545/Veriff_Logo.jpg</a></p>\n<p> </p>\n</div>\n<div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 PR Newswire Association,LLC. All Rights Reserved.</p></div>"}