{"date": "2022-01-18 23:11:48.142000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>KOMO PLANT BASED FOODS INC (\"YUM-Z\")\n- Launches U.S. Wholesale through RangeMe\n\n     Komo Plant Based Foods Inc. (\"Komo\"), a premium plant-based food\ncompany, is pleased to announce that it is now available in the U.S. on\nRangeMe, the leading industry online platform that streamlines new product\ndiscovery between brands and retailers.\n\n     Komo is a verified brand on RangeMe and currently has its full line of\nfrozen meals uploaded on the platform, making its products visible to\nthousands of retail stores in the U.S. and Canada. Through this platform,\nU.S. buyers are able to discover new products and brands. U.S. retail\nchains on the RangeMe platform include Walmart, Whole Foods, Safeway,\n7-Eleven, Kroger, Lowe's Foods, Harris Teeter, Albertsons, AHold USA, Food\nLion, Publix, Meijer and Wakefern, as well as thousands of local and\nboutique retailers. Through RangeMe, Komo will be able to submit its\nproducts for retailer category reviews throughout the year.\n\n     \"After successfully establishing distribution across all key\nterritories in Canada, Komo is now focused on expanding our retail\ndistribution platform throughout the United States,\" says Komo CEO William\nWhite. \"Listing on RangeMe is the first of many initiatives we are planning\nto make our U.S. launch a success. In addition to reaching potential\nretailers through traditional channels, we are utilizing RangeMe to reach\nbuyers and submit our products for upcoming category reviews.\"\n\n     Komo has also completed its food packaging design for sale in retail\nstores in the United States and will be ready to be sold in U.S. retail\nstores next month, pending retail orders.\n\n     About RangeMe\n\n    RangeMe, an ECRM company, is the leading online platform that streamlines\nnew product discovery between suppliers and retailers. The platform\nempowers retail buyers to efficiently discover innovative and emerging\nproducts, while streamlining the inbound product submission process. For\nproduct suppliers, RangeMe enables them to grow their retail relationships\nwith a platform that gives them the tools to manage their products, market\ntheir brand, and build awareness. Now integrated into the ECRM product\noffering, RangeMe adds increased breadth and depth to the industry's most\ncomplete sourcing solution for top retailers and product suppliers in the\nU.S.\n\n     About Komo\n\n    Komo Plant Based Foods Inc. is a premium plant-based food company that\ndevelops, manufactures and sells a variety of plant-based frozen meals that\nare always hearty, satisfying, and made with wholesome ingredients. At\nKomo, our mission is to help make plant-based meals a staple on every\ndinner table by sharing our love for feel-good food that connects the\npeople to the planet. We believe plant-based eating is the future and -\nChange can start with a single biteTM. Our experienced plant-based\ninnovation and development team recreates vegan versions of traditionally\ncheesy and meaty classics, with 100% plants. Komo's products are sold\ndirect-to-consumer through our eCommerce website and a distribution network\nof online and brick and mortar grocery, convenience and natural retailer\nchannels. Our operating subsidiary Komo Comfort Foods launched in 2021 with\nour flagship products: plant-based Lasagna, Shepherd's Pie and Chickenless\nPot Pie and has recently launched a new line - Komo Plant-Based Meal\nHelpersTM - versatile meal starters to allow the creation of many dishes at\nhome. All of our products are 100% plant-based, made with wholesome\ningredients, free from preservatives, and frozen for freshness. Freezing\nproducts is a natural and effective way of keeping food products for longer\nwithout having to use any preservatives. Komo's meals have a 1-year frozen\nshelf life. Komo also sells hot ready-to-eat meals in Metro Vancouver\nthrough Uber Eats and Skip the Dishes.\n\n     Learn more at: www.komocomfortfoods.com and follow on Instagram:\n@komocomfortfoods\n\n     For further information, please contact:\nWilliam White, President &amp; CEO, Komo Plant Based Foods Inc.\nwill@komoeats.com\n1-866-969-0882\n\n     The Canadian Securities Exchange has not reviewed, approved or\ndisapproved the contents of this news release.\n\n     Cautionary Statement Regarding Forward-Looking Statements\nCertain statements contained in this press release constitute\nforward-looking information. These statements relate to future events or\nKomo's future performance. The use of any of the words \"could\", \"expect\",\n\"believe\", \"will\", \"projected\", \"estimated\" and similar expressions and\nstatements relating to matters that are not historical facts are intended\nto identify forward-looking information and are based on Komo's current\nbelief or assumptions as to the outcome and timing of such future events.\nActual future results may differ materially. In particular, Komo's product\ndevelopment plans, its ability to launch its products on food delivery\napps, its ability to retain key personnel, its revenues, and its\nexpectation as to the acceptance of its products by retailer stores and\nconsumers constitute forward-looking information. Actual results and\ndevelopments may differ materially from those contemplated by\nforward-looking information. Readers are cautioned not to place undue\nreliance on forward-looking information. The statements made in this press\nrelease are made as of the date hereof. Komo disclaims any intention or\nobligation to publicly update or revise any forward-looking information,\nwhether as a result of new information, future events or otherwise, except\nas may be expressly required by applicable securities laws.\n\nTel   : 778-229-4781    KOMO PLANT BASED FOODS INC\nWWW   : <a href=\"https://www.komocomfortfoods.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.komocomfortfoods.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201700054.MNPRE2201701121-05412020220118</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}