{"date": "2021-11-11 15:36:09.067000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3576.23, "close": 3472.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SUPER LEAGUE GAMING INC (\"SLGG-Q\")\n- Screenvision Media Expand Sales Partnership;\n- Launch Super League Spotlight on the Big Screen\n\n   Super League Gaming , a global leader in video game experiences and\nentertainment at the intersection of the creator economy, gameplay content,\nand the metaverse, and Screenvision Media, a national leader in cinema and\npremium video advertising, announced today the launch Super League\nSpotlight, an exciting multi-episode series showcasing the best in-game\naction, created specifically for in-theater audiences. The first\ninstallment of the series launches today in over 2000 movie theaters\nnationwide.\n\n   Super League and Screenvision's Super League Spotlight series presents\ntop highlights from the live stream broadcasts of popular gaming\ninfluencers within Super League's established Core Gamer and Young Gamer\nnetworks, featuring several of the most well-known game titles in the\nworld. With an average two-minute run time, each episode of Spotlight\namplifies the best and most exciting in-game moments of the past month.\nThis original Super League content series serves as part of the growing\npartnership between Screenvision and Super League, working together to give\nbrands cross-channel opportunities to reach young adult cord-cutters with\ngaming-related content both in-theater and at home. Audiences in movie\ntheaters across the country will have a front row seat to all of the\ncompetitive action on the big screen, viewing the best in engaging gameplay\nthat Super League has to offer. Hyundai will serve as the initial series\nsponsor as part of a year-long partnership with Super League.\n\n   \"Super League Spotlight represents an exciting extension of the\npartnership we have been building with Screenvision Media for the past\nyear,\" said Nina Kammer, Head of National Sales for Super League.\n\"Screenvision partners have been able to access key audiences of gamers\nwithin live streams via Super League through ad-blocker-proof digital video\ninventory, and together, we can now provide brands with another scalable\navenue to reach desirable audiences in a high-impact, immersive environment\nfull of teens and young adults. It was a natural opportunity to bring to\nHyundai, one of our most important, long-term strategic brand partners. We\nare grateful for their enthusiastic support!\"\n\n   \"Screenvision's partnership with Super League Gaming reflects the\npowerful connection between the moviegoer and live stream gamer, both of\nwhich skew younger and are typically a more elusive audience, the\ncord-cutters and cord-nevers,\" said Christine Martino, Screenvision EVP of\nNational Ad Sales. \"Super League Spotlight offers another engaging vehicle\nfor advertisers to organically become part of the immersive cinema\nexperience.\"\n\n   \"Our sponsorship of the Spotlight series is a great way to reach new\naudiences that might not be familiar with the Hyundai brand and our\nvehicles,\" said Angela Zepeda, CMO, Hyundai Motor America. \"The series is\nalso exposing the fast-growing gaming industry to more people and helping\nelevate the entire community.\"\n\n   The first edition of Super League Spotlight is in theaters now, just in\ntime for the holiday season, with additional episodes featuring new content\nand highlights scheduled to roll out in 2022.\n\n   About Super League Gaming\nSuper League Gaming (Nasdaq: SLGG) is a leading metaverse and creator\neconomy platform at the intersection of gaming and pop culture focused on\ntools and offerings that empower creators, energize players, and entertain\nfans. The company's solutions provide incomparable access to an audience\nconsisting of players in the largest global metaverse environments, fans of\nhundreds of thousands of gaming influencers, and viewers of gameplay\ncontent across major social media and digital video platforms. Fueled by\nproprietary and patented technology systems, the company's creator-centric\nofferings include content tools that power live stream multicasting, a\nleading metaverse advertising platform, a social media banner monetization\nplatform, and a virtual cloud-based video production division, Virtualis\nStudios. Combined with vibrant in-game Minecraft communities, a network of\nhighly viewed channels and original shows on Instagram, TikTok, Snap,\nYouTube, and Twitch, and an award-winning esports invitational tournament\nseries, Super League's properties deliver powerful opportunities for brands\nand advertisers to achieve impactful marketing outcomes with gamers of all\nages. For more, go to superleague.com.\n\n   About Screenvision\nHeadquartered in New York, N.Y., Screenvision Media is a national leader in\ncinema advertising, offering on-screen advertising, in-lobby promotions and\nintegrated marketing programs to national, regional and local advertisers,\nand providing comprehensive cinema advertising representation services to\ntop-tier theatrical exhibitors, sports venues and through a robust OOH\nnetwork. The Screenvision Media cinema advertising network comprises 14,000\nscreens in 2000+ theatre locations across all 50 states and 94% of DMAs\nnationwide; delivering through more than 150 theatrical circuits, including\n7 of the top 10 exhibitor companies.\n\n   About Hyundai Motor America\nHyundai Motor America focuses on 'Progress for Humanity' and smart mobility\nsolutions. Hyundai offers U.S. consumers a technology-rich lineup of cars,\nSUVs and electrified vehicles. Our 820 dealers sold more than 620,000\nvehicles in the U.S. in 2020, and nearly half were built at Hyundai Motor\nManufacturing Alabama. For more information, visit www.HyundaiNews.com.\n\n Contact Information:\n\nContact:Gillian Sheldon\nSuper League Gaming\ngillian.sheldon@superleague.com\n\n   Russin Royal\nScreenvision Media\nRRoyal@crwnpartners.com\n\n   Contact:\nSophie Pearson and Cody Slach\nGateway Investor Relations\nSLG@gatewayir.com\n\n   Forward-Looking Statements\nSafe Harbor Statement under the Private Securities Litigation Reform Act of\n1995. Statements in this press release that are not strictly historical are\n\"forward-looking\" statements within the meaning of Section 27A of the\nSecurities Act of 1933, as amended, and Section 21E of the Securities\nExchange Act of 1934, as amended. These statements involve substantial\nrisks, uncertainties and assumptions that could cause actual results to\ndiffer materially from those expressed or implied by such statements.\nForward-looking statements in this communication include, among other\nthings, statements about our possible or assumed business strategies,\npotential growth opportunities, new products and potential market\nopportunities. Risks and uncertainties include, among other things, our\nability to implement our plans, forecasts and other expectations with\nrespect our business; our ability to realize the anticipated benefits of\nevents that took place during and subsequent to the quarter ended September\n30, 2020, including the possibility that the expected benefits will not be\nrealized or will not be realized within the expected time period; unknown\nliabilities that may or may not be within our control; attracting new\ncustomers and maintaining and expanding our existing customer base; our\nability to scale and update our platform to respond to customers' needs and\nrapid technological change; increased competition on our market and our\nability to compete effectively, and expansion of our operations and\nincreased adoption of our platform internationally. Additional risks and\nuncertainties that could affect our financial results are included in the\nsection titled \"Risk Factors\" and \"Management's Discussion and Analysis of\nFinancial Condition and Results of Operations\" in our Annual Report on Form\n10-K for the year ended December 31, 2021 and other filings that we make\nfrom time to time with the Securities and Exchange Commission which, once\nfiled, are available on the SEC's website at www.sec.gov. In addition, any\nforward-looking statements contained in this communication are based on\nassumptions that we believe to be reasonable as of this date. Except as\nrequired by law, we assume no obligation to update these forward-looking\nstatements, or to update the reasons if actual results differ materially\nfrom those anticipated in the forward-looking statements.\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2131400397.MNPRE2131401778-07351220211111</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}