{"date": "2021-12-01 18:45:15.900000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>AMAZON.COM INC (\"AMZN-Q\")\n- AWS Announces Three New Database Capabilities\n\n    Today, at AWS re:Invent, Amazon Web Services, Inc. (AWS), an\nAmazon.com, Inc. company announced three new database capabilities that\nmake it easier and more cost efficient for customers to scale and run the\nright databases for their job. Today's announcements introduce a new\nmanaged database service for business applications that allows customers to\ncustomize the underlying database and operating system, a new table class\nfor Amazon DynamoDB designed to reduce storage costs for infrequently\naccessed data, and a service that uses machine learning to better diagnose\nand remediate database-related performance issues. Together, these\ninnovations make it easier and more cost effective for customers to manage\ndata at scale.\n\n    As a growing number of applications need to work with petabytes--or\neven exabytes--of data with low latency and high performance, a\none-size-fits-all database no longer meets the needs of customers who\nrequire highly available, reliable, and performant ways to leverage and\nmanage data at scale. To meet these demands, more and more customers are\nlooking to choose the right database for their unique needs. AWS offers the\nbroadest and deepest selection of specialized database engines, including\nDynamoDB for key-value databases, Amazon Neptune for graph databases,\nAmazon ElastiCache and Amazon MemoryDB for Redis for in-memory databases,\nAmazon DocumentDB for document databases, Amazon Keyspaces (for Apache\nCassandra) for wide-column databases, Amazon Timestream for time series\ndatabases, and Amazon Quantum Ledger Database (Amazon QLDB) for ledger\ndatabases. AWS is also the best place to run open-source databases, which\nis why more than 100,000 customers choose to run their MySQL and\nPostgreSQL-compatible databases on Amazon Aurora and enjoy the performance\nand availability of the highest-grade commercial databases at one-tenth the\ncost. Many customers also choose to run commercial databases on AWS to take\nadvantage of the superior scalability, security, and elasticity AWS\nprovides. Amazon Relational Database Service (Amazon RDS) offers a fully\nmanaged relational database service that makes it easy to set up, operate,\nand scale Oracle and Microsoft SQL Server databases in the cloud. When it\ncomes to databases, AWS offers the right tools for the job, with more than\n15 purpose-built database engines that provide customers with high\navailability, performance, reliability, and security for a wide range of\nuse cases. The three new database capabilities announced today deliver\nsignificant new features to give customers even more choice and higher\nperformance at lower costs.\n\n    \"Customers have told us they want databases that are optimized for\ntheir most important use cases to deliver flexible, scalable, and reliable\nuser experiences without worrying about the resource-intensive burden of\nmanaging infrastructure or incurring excess costs,\" said Raju Gulabani,\nVice President of Databases and Analytics at AWS. \"With today's\nannouncements, we're excited to provide customers with even more\nflexibility and choice to easily improve database performance, optimize\ncost, and power their most business-critical applications. No one else in\nthe industry can match the depth of capability and breadth of selection in\ndatabases offered by AWS, and we're nowhere close to being done innovating\nfor our customers.\"\n\n    Amazon RDS Custom gives customers a managed database service for\nbusiness applications that require customization of the underlying database\nand operating system\n\n    Customers who want to run commercial databases like Oracle and\nMicrosoft SQL Server in the cloud choose Amazon RDS because it is easy to\nset up, operate, and scale. With Amazon RDS, customers no longer need to\nworry about time-consuming administrative tasks like provisioning capacity,\nscaling, and backing up their data. However, some business applications\nrequire customization to their underlying Oracle and Microsoft SQL Server\ndatabase environment and operating system (e.g. Microsoft Dynamics AX,\nMicrosoft SharePoint, and Oracle PeopleSoft). Today, customers often run\nthese applications in a self-managed environment (e.g. on Amazon EC2 or\non-premises) so they can have full control over the underlying database\nenvironment and operating system. While self-managed deployments are highly\nconfigurable, customers must spend time on administrative tasks like\nhardware provisioning, database setup, patching, and backups. What\ncustomers running applications that require database and operating system\ncustomization want instead is to automate these undifferentiated\nadministrative tasks to make it easier to run these applications on AWS.\n\n    Amazon RDS Custom automates the setup, operation, and scaling of the\nOracle and Microsoft SQL Server databases that are tightly integrated with\ncommon business applications, while allowing customization to the database\nand underlying operating system these applications require. With Amazon RDS\nCustom, customers running these types of business applications no longer\nneed to worry about time-consuming administrative tasks like provisioning\nand scaling hardware, database setup, patching, and backups. Customers can\nuse Amazon RDS Custom to configure their database environment and\nunderlying operating system to modify settings, install custom patches, and\nintegrate third-party software to meet the requirements of their business\napplications (e.g. custom database minor versions, third-party security and\ndiagnostic software, or specific file system configurations). Amazon RDS\nCustom automatically monitors the database environment and operating system\nto detect user-initiated configurations that impact the ability of Amazon\nRDS Custom to manage the database. If an issue is detected, Amazon RDS\nCustom will attempt to automatically resolve the issue. For configuration\nerrors that cannot be automatically corrected, Amazon RDS Custom notifies\nthe customer that corrective action is required and provides recommended\nsteps for resolution. Customers can easily move their existing self-managed\nOracle and Microsoft SQL Server databases that require specialized\ncustomizations to Amazon RDS Custom and no longer worry about having to\nmanage databases themselves. To get started with Amazon RDS Custom, visit\naws.amazon.com/rds/custom.\n\n    Amazon DynamoDB Standard-Infrequent Access (Standard-IA) table class\nreduces DynamoDB costs by up to 60% for tables that store infrequently\naccessed data\n\n    Customers choose DynamoDB for high-volume NoSQL workloads because it\noffers high throughput with consistent millisecond response times at\nvirtually any scale without having to manage servers or clusters. As the\npatterns of DynamoDB workloads have become more diverse, there is a set of\ncustomers who have workloads where storage is the dominant cost for data\nthat needs to be accessed less frequently over time but still requires fast\nresponse times when needed. For example, older social media posts, less\nrecent ecommerce orders, and past video game achievements might represent a\nsignificant storage expense for customers due to their growing volume and\nthe relatively high cost of storing this data, but they still require high\nthroughput because when this data is requested it needs to be made\nimmediately available. Today, customers optimize costs in these cases by\nwriting code to move older, less frequently accessed data from DynamoDB to\nlower cost storage alternatives like Amazon S3.\n\n    With the new Amazon DynamoDB Standard-IA table class, customers can\nreduce DynamoDB costs by up to 60% for tables that store infrequently\naccessed data. The DynamoDB Standard-IA table class offers up to 60% lower\nstorage costs than Standard DynamoDB tables, making it the most\ncost-effective option for tables where storage is the dominant table cost.\nIn contrast, the DynamoDB Standard table class offers up to 20% lower\nthroughput costs than the Standard-IA table class and remains the most\ncost-effective option for tables where throughput is the dominant table\ncost. Customers can switch between DynamoDB Standard and DynamoDB\nStandard-IA table classes with no impact to table performance and no code\nchanges required to optimize their spend for the type of data they are\nstoring. To get started with the DynamoDB Standard-IA table class, visit\naws.amazon.com/dynamodb/standard-ia.\n\n    Amazon DevOps Guru for RDS uses machine learning to better detect and\ndiagnose hard-to-find database-related performance issues and provides\nrecommendations designed to resolve them in minutes not days\n\n    Amazon DevOps Guru is a machine learning powered service that makes it\neasier for developers to improve application availability by automatically\ndetecting operational issues and recommending specific actions for\nremediation. Today, Amazon DevOps Guru alerts customers to operational\nissues across Amazon RDS engines. However, it can be complicated and\ntime-consuming to determine the exact cause of a database-related issue\nbecause developers often need to enlist database administrators to manually\nrun diagnostic tools and queries to determine the factors contributing to\nthe issue. Once the cause of the issue is identified, database experts\noften need to do additional analysis to fully understand the problem (e.g.\nanalyze database-specific metrics, events, and wait conditions or extract\nand analyze relevant SQL statements) before providing guidance on how to\nfix it. As a result, it can take hours or days to uncover and remediate\nunderlying database issues that put application availability or user\nexperience at risk.\n\n    Amazon DevOps Guru for RDS is a new machine learning powered capability\nin Amazon DevOps Guru that is designed to automatically detect and diagnose\nperformance bottlenecks and operational issues in a database and provide\ndetailed remediation recommendations, enabling developers to resolve issues\nin minutes rather than days. Amazon DevOps Guru for RDS builds on the\ncapabilities of Amazon DevOps Guru for detecting database-related issues to\ninclude additional performance-related issues in Amazon RDS (e.g. resource\nover-utilization and misbehavior of certain SQL queries). Amazon DevOps\nGuru for RDS is designed to immediately notify developers when issues occur\nand provide diagnostic information on the root cause, details on the extent\nof the problem, and intelligent remediation recommendations to help\ncustomers quickly resolve database-related performance bottlenecks and\noperational issues. For example, if an application performance issue\nrelated to an unexpected high load on a database is detected, Amazon DevOps\nGuru for RDS conducts a root cause analysis to find the exact SQL statement\ncausing the issue, sends a notification with the cause and scope of the\nissue, and recommends corrective actions to resolve the issue quickly.\nAmazon DevOps Guru for RDS currently works with Amazon Aurora and is\nplanned to support additional Amazon RDS database engines in 2022. To get\nstarted with Amazon DevOps Guru for RDS, visit\naws.amazon.com/devops-guru/features/devops-guru-for-rds.\n\n    Mercado Libre is a leading technology company in e-commerce in Latin\nAmerica. \"Even though our users may not need to check their past orders\nfrequently, they expect to be able to view past orders, re-order items, and\nget product information at any time,\" said Oscar Mullin, Director of IT -\nCore Services and Cross SRE and DBA Head at Mercado Libre. \"Amazon DynamoDB\nStandard-IA will provide us with the ability to store our users'\ninfrequently accessed data at a significant cost savings, while continuing\nto deliver for our users by maintaining the same high performance,\naccessibility, and reliability we've come to expect from Amazon DynamoDB.\"\n\n    NetApp is a cloud-led, data-centric software company that gives\ncompanies the freedom to put their data to work in the applications that\nelevate their business. \"NetApp offers cloud services to enable\norganizations to easily run highly efficient, cost-effective relational\ndatabase migration and operation programs from on premises to the cloud.\nHowever, some organizations running applications that require customization\nto the database environment and operating system have been unable to move\nto a fully managed database service in the cloud due to the customizations\nthese applications require,\" said Ronen Schwartz, SVP and GM at NetApp\nCloud Volumes. \"With Amazon RDS Custom, these organizations now have a\nmanaged database service for applications that require operating system and\ndatabase customization. Organizations can run Amazon RDS Custom on NetApp\nONTAP to benefit from advanced data protection, autonomous efficiencies,\nand continuous optimizations.\"\n\n    Amazon Fulfillment Technologies designs, develops, and operates\nfulfillment technology solutions for Amazon fulfillment centers, including\nautomated Amazon Robotics worldwide. \"My team manages a large fleet\ndatabase. Amazon DevOps Guru for RDS helps us identify a wider range of\nperformance anomalies than our threshold-based monitoring without being\noverly noisy,\" said Brent Bigonger, Principal Database Engineer at Amazon\nFulfillment Technologies. \"Amazon DevOps Guru for RDS's machine learning\npowered insights act as an early warning system that allows us to detect,\ndiagnose, and remediate performance-related issues quickly.\"\n\n    Jobvite is a recruiting software platform built to attract, hire, and\nonboard top talent. \"Our usage patterns change time to time and as a\nresult, our application interacts with Amazon Aurora databases in ways we\ncan't always predict. When we see congestion on our AWS databases it can\ntake us hours to figure out the source and remediate,\" said Ron Teeter, VP\nof Engineering and Chief Architect at Jobvite. \"We are excited to use\nAmazon DevOps Guru for RDS to get alerts as soon as an event like this\nhappens. With Amazon DevOps Guru for RDS, we can quickly locate database\nqueries in our application that are causing the performance or operational\nissues along with an explanation of why it's happening.\"\n\n    Singular simplifies marketing data by unifying siloed data, applying\nattribution, and exposing insights to accelerate growth. \"At Singular, we\ncapture, analyze, and refine billions of data points to deliver the most\naccurate, timely, and actionable cross-platform analytics to our customers.\nHaving immediate access to our data, even if it is infrequently used, is\ncrucial for us to offer our customers the best insights to grow their\nbusiness fast,\" said Ofir Nir, Head of Data Infrastructure at Singular.\n\"The ability to simplify the management and access to our long-term data\nstorage while still benefiting from Amazon DynamoDB performance,\ndurability, and data availability with the Amazon DynamoDB Standard-IA\ntable class could help us further optimize costs and provide an even better\nuser experience to our customers.\"\n\n    NTT DOCOMO, Inc. is a leading mobile phone operator in Japan. \"We\nmanage 45 independent applications for our customers and internal teams at\nNTT DOCOMO. These teams provide underlying components for public services\nby NTT DOCOMO and business applications for our company staffers,\" said\nChikara Mitsui, Senior Manager, Service Design Department at NTT DOCOMO,\nInc. \"We are excited to use Amazon DevOps Guru for RDS and leverage its\nmachine learning powered insights to quickly detect, diagnose, and\nremediate a wide range of database-related performance issues. Amazon\nDevOps Guru provides a single view of insights for our application stack\nand empowers my team to focus on building more reliable services instead of\ntaking time to investigate operational issues.\"\n\n    Delphix provides an automated DevOps data platform, masking data for\nprivacy compliance, securing data from ransomware, and delivering\nefficient, virtualized data for CI/CD and digital transformation. \"With\nAmazon RDS Custom, Delphix customers can accelerate database migrations to\na managed service by eliminating data-related bottlenecks that slow down\napplication development velocity,\" says Jason Grauel, VP of Product\nManagement at Delphix. \"Now, customers can ensure test data keeps pace with\nan accelerated DevOps cadence while enjoying the operational benefits of\nAmazon RDS Custom automation.\"\n\n    Jungle Scout is an all-in-one platform for finding, launching, and\nselling Amazon products. \"Data is the most critical component of our\nbusiness offering at Jungle Scout. We collect and analyze hundreds of\npetabytes of data to deliver the most accurate marketplace analytics data\nin the world to our SMB and Enterprise customers,\" said Regan Wolfrom,\nDevSecOps and Builder Tools manager at Jungle Scout. \"The new Amazon\nDynamoDB Standard-Infrequent Access table class is a massive win for us,\nallowing us to quickly and efficiently implement cost-effective long-term\ndata storage while still enjoying the benefits of Amazon DynamoDB. The\nability to switch between Amazon DynamoDB table classes without any code\nchanges will allow us to easily optimize our costs as we scale and focus\nour engineering efforts on the features our customers require as they grow\ntheir business.\"\n\n    About Amazon Web Services\n\n    For over 15 years, Amazon Web Services has been the world's most\ncomprehensive and broadly adopted cloud offering. AWS has been continually\nexpanding its services to support virtually any cloud workload, and it now\nhas more than 200 fully featured services for compute, storage, databases,\nnetworking, analytics, machine learning and artificial intelligence (AI),\nInternet of Things (IoT), mobile, security, hybrid, virtual and augmented\nreality (VR and AR), media, and application development, deployment, and\nmanagement from 81 Availability Zones within 25 geographic regions, with\nannounced plans for 27 more Availability Zones and nine more AWS Regions in\nAustralia, Canada, India, Indonesia, Israel, New Zealand, Spain,\nSwitzerland, and the United Arab Emirates. Millions of customers--including\nthe fastest-growing startups, largest enterprises, and leading government\nagencies--trust AWS to power their infrastructure, become more agile, and\nlower costs. To learn more about AWS, visit aws.amazon.com.\n\n    About Amazon\n\n    Amazon is guided by four principles: customer obsession rather than\ncompetitor focus, passion for invention, commitment to operational\nexcellence, and long-term thinking. Amazon strives to be Earth's Most\nCustomer-Centric Company, Earth's Best Employer, and Earth's Safest Place\nto Work. Customer reviews, 1-Click shopping, personalized recommendations,\nPrime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career\nChoice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out\ntechnology, Amazon Studios, and The Climate Pledge are some of the things\npioneered by Amazon. For more information, visit amazon.com/about and\nfollow @AmazonNews.\n\n Contact Information:\n\nAmazon.com, Inc.\nMedia Hotline\nAmazon-pr@amazon.com\nwww.amazon.com/pr\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133400802.MNPRE2133403037-10440320211201</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}