{"date": "2021-05-23 06:10:00+00:00", "ticker": "AVV", "mrkt_info": {"open": 3253.0, "close": 3328.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Dubai, UAE:</strong> AVEVA, a global leader in industrial software, driving digital transformation and sustainability, today announced that it has been positioned by Gartner as a Leader in the 2021 Magic Quadrant for Manufacturing Execution Systems (MES) for its AVEVA Manufacturing Execution System. The evaluation was based on specific criteria that analyzed the company’s overall completeness of vision and ability to execute.</p>\n<p> “The last few years have been tumultuous for manufacturers, with demand swings, supply chain disruptions as a result of COVID and increasing costs. Emerging post pandemic business imperatives include agility to meet customer demand, supply chain resilience, increased productivity, and sustainability. The optimization and integration of both business planning and manufacturing execution into a single digital system represents the next step gain for manufacturers for growth and profitability. Manufacturing systems that enable a value chain, which is demand driven and dynamically optimized, are much needed and here to stay,” commented Kim Custeau, Senior Vice President – APM and MES, AVEVA.</p>\n<p>According to Gartner, “Global MES solutions are a foundational building block of smart manufacturing strategies and digital business for manufacturers. Disruptive technologies and new providers are shaking things up. Supply chain technology leaders should use this research to select appropriate vendors and solutions.”<br/>\n<br/>\nAVEVA's model driven Manufacturing Execution System approach is uniquely positioned to accelerate the digital transformation of manufacturing operations by standardizing processes, best practices, KPIs and reporting across businesses for optimal regulatory compliance and transparency in plant and multi-site manufacturing operations. Combined with AVEVA's Edge to Enterprise solution, it allows for building a digital twin of the plant and the processes that helps to improve plant productivity and throughput by up to 5-10% as well as eliminate up to 25% of waste.</p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}