{"date": "2021-12-03 05:17:22+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3443.72, "close": 3389.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        An old saying goes that if at first one doesn't succeed, one should try and try again, which is generally good advice. For labor unions that can't take \"no\" for an answer, though, it sometimes translates into getting the National Labor Relations Board (NLRB) to tilt the scales until the \"right\" outcome results, which doesn't exactly suggest good public policy. Nevertheless, that's precisely the strategy the union trying to organize an Amazon facility in Bessemer, Alabama appears to be employing.\n      </p>\n                <p>\n        It is not much of a secret that the Retail, Wholesale and Department Store Union (RWDSU) would really, really like to be the collective bargaining representative of Amazon's Bessemer employees, and it has devoted considerable resources to that end, including an <a href=\"https://bamazonunion.org/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">angry emoji</a> for good measure.\n      </p>\n                <p>\n        The problem for the RWDSU, however, is that despite all of its organizing efforts, when Amazon's employees had their say-after all, it's supposedly up to them-they <a href=\"https://www.uschamber.com/employment-law/unions/amazon-workers-vote-against-organizing\" data-type=\"url\" class=\"tr-link\" translate=\"no\">voted overwhelmingly</a> against the union last April. Indeed, the vote was not even close: the RWDSU lost by a vote of 738 votes for the union versus 1,798 votes against it. Notwithstanding 505 challenged ballots, the results were, ahem, decisive.\n      </p>\n                <p>\n        Nonetheless, an NLRB hearing officer issued a <a href=\"https://apps.nlrb.gov/link/document.aspx/09031d4583484780\" data-type=\"url\" class=\"tr-link\" translate=\"no\">report</a> recommending that the results of the April election be overturned, effectively invalidating the nearly 1,800 votes against union representation. Adding insult to injury, the primary justification for this was that the United States Postal Service (USPS) had installed a mailbox on the premises of Amazon's facility at the company's request, in order to-stop the presses-make it easier for workers to cast a ballot. Perhaps it's naïve to think that the facilitation of voting is an important part of an NLRB-supervised election.\n      </p>\n                <p>\n        On November 29, an NLRB Regional Director <a href=\"https://apps.nlrb.gov/link/document.aspx/09031d458350f488\" data-type=\"url\" class=\"tr-link\" translate=\"no\">issued a decision</a> supporting the conclusion of the hearing officer that the nefarious mailbox had tainted the election. No date for a rerun has been set (and there's no word yet if this decision will be appealed to the full NLRB). However, it's quite possible that all the histrionics will be in vain. The union has yet to make a case for itself any more compelling than that which was already decisively rejected in April. If a similar outcome results again, hopefully, the union-and the NLRB-will realize that \"no\" really does mean \"no.\"\n      </p>\n                <div>\n                  <p>\n          About the authors\n        </p>\n                  <div>\n                    <p>\n            Sean P. Redmond\n          </p>\n                    <p>\n            Vice President, Labor Policy\n          </p>\n                    <p>\n            Sean P. Redmond is Vice President, Labor Policy at the U.S. Chamber of Commerce.\n          </p>\n                    <p>\n                      <a href=\"https://www.uschamber.com/bio/sean-p-redmond\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read more</a>\n                    </p>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.uschamber.com/employment-law/unions/the-nlrbs-amazon-antics-ii\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>U.S. Chamber of Commerce</strong> published this content on <strong>03 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>03 December 2021 05:17:22 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - U.S. Chamber of Commerce</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: U.S.-Chamber-of-Commerce</p></div>"}