{"date": "2022-01-19 03:47:24.853000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Jan. 19 -- Amazon India's much awaited 'Great Republic Day Sale' is back offering big savings for everyone. Avail offers and discounts on mid-range smartphones under Rs.25K and enjoy up to 40% off on mobiles and accessories on brands like OnePlus, Xiaomi, Samsung, iQOO, Apple. Customers can enjoy up to 10% instant discount with SBI Credit cards and EMI transactions; No-cost EMI using Bajaj Finserv EMI card, Amazon Pay ICICI Credit card, Amazon Pay Later and select Debit &amp; Credit Cards.</p><p>Here are some of the popular mid-range smartphones available on Amazon during Great Republic Day Sale 2022:</p></div><div class=\"tr-npp-body\"><p>OnePlus Nord CE 5G</p><p>The smartphone comes with 64MP+8MP+2MP triple rear camera with 1080p video at 30/60 fps, 4k 30 fps and 16MP front camera with 1080p video at 30/60 fps. It features 6.43-inch, 90Hz fluid AMOLED display with 2400x1080 pixels resolution. The phone is available for Rs.21,999 inclusive of Rs.1,000 off with coupons and Rs.2,000 instant discount with SBI Credit Card bank offers.</p><p>Redmi Note 10s</p><p>The Redmi Note 10S originally available for starting Rs.16,999 will now be available for starting Rs.13,999 only during the Amazon Great Republic Day Sale. It is powered by MediaTek Helio G95, Super AMOLED display, 64MP quad camera and a 5,000mAH battery. Prime members get 6 months free screen replacement and 9 months No cost EMI (with HDFC Bank) under advantage just for Prime. Get additional 10% instant discount with SBI credit cards taking the price down to Rs.12,749.</p><p>iQOO Z3 5G</p><p>The iQOO Z3 5G features Qualcomm Snapdragon 768G 5G, 55W Flash Charge, packs upto 3GB of extended RAM on top of 6GB and 8GB RAM and has a 120Hz display with a 180Hz touch sampling rate. The iQOO Z3 originally priced at Rs.22,990 will be available at Rs.17,990 with flat savings of Rs.4,000. Customers can avail additional off with Amazon coupons worth Rs.2,000 and additional 10% instant discount with SBI Bank credit cards.</p><p>Samsung M32 5G</p><p>The upgraded version of Samsung Galaxy M32, the newly launched Samsung M32 5G, as the name suggests comes with added 5G support and is a winner of Amazon's Customers Choice Awards for Best Battery Smartphone. During the Amazon Great Republic Day Sale, you can get additional savings on the Galaxy M32 5G and get this latest smartphone for Rs.16,999. The Samsung Galaxy M32 5G comes with Dimensity 720 chip.</p><p>Xiaomi 11 Lite NE 5G</p><p>It comes with 10-bit AMOLED display. Get additional Rs.1,000 off with coupons and an additional Rs.4,500 off with instant bank discount on SBI cards and get it for Rs.21,499. Additionally get Rs.5,000 exchange bonus on exchange of old phone.</p><p>Mi 11X 5G</p><p>The Mi 11X 5G comes with Qualcomm Snapdragon 870 chipset, E4 AMOLED 120Hz display, 48MP triple camera setup and 33W fast charging. The phone is available for Rs.27,999; get extra Rs.4,000 off with exchange of your old smartphones and get the Mi 11X for Rs.22,749.</p><p>iQOO Z5</p><p>The iQOO Z5 comes with Qualcomm Snapdragon 778G 5G Mobile Platform, 5,000mAh battery, liquid cooling system. The phone will be available for Rs.23,990 and get additional Rs.2,000 off with coupons and up to Rs.1,250 off with SBI credit cards. The effective price of the iQOO Z5 5G will be Rs.20,740 including coupons and bank discounts. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}