{"date": "2022-02-25 15:41:46.167000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2896.54, "close": 3075.77}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>AMDOCS LTD (\"DOX-Q\")\n- Mobile World Congress 2022: Amdocs Expands Services Capabilities\n- Empowering Service Providers to Deliver Amazing Experiences to\n- their End Users\n\n     Amdocs, a leading provider of software and services to communications\nand media companies, today announced the expansion of its services\ncapabilities to accelerate the industry's journey to the cloud, improve\nbusiness operations, and drive innovative next-generation digital\nexperiences for the end user.\n\n     \"As a leading digital system integrator for the communications and\nmedia industry, Amdocs provides end-to-end, highly sophisticated, DevSecOps\nservices around Amdocs and non-Amdocs applications, as well as cloud\noperations and hybrid operations at many of the largest service providers\naround the globe,\" said Ronen Levkovich, group president, Amdocs Global\nServices. \"With our experts in specific niches such as user experience,\ndigital software engineering and cloud development experts, we support our\ncustomers on their cloud and digital journeys and as they roll out their 5G\nnetworks to provide their end users with the amazing experiences they\nexpect.\"\n\n     From consulting to delivery, quality engineering (testing),\noperations, systems integration, data services, network development and\noptimization services, experience design and content services, Amdocs\nDigital Services engagements range from advising customers on business and\ntechnical strategy, designing and implementing particular business\nsolutions, managing specific business operations processes, adopting\nDevSecOps, migrating applications to the cloud and orchestrating\nlarge-scale transformation projects.\n\n     The recent acquisition of DevOpsGroup, a boutique UK-based cloud\ncompany specializing in engineering, consultancy and training services for\nenterprises implementing cloud endeavors, geographically complements the\nhigh-end expertise gained when Amdocs acquired Sourced Group last year.\nThis move furthermore strengthens Amdocs' capabilities to support all\naspects of customer cloud journeys, including consulting, migration of\nAmdocs and non-Amdocs applications, cloud-native development, and cloud\noperations. It also expands Amdocs' consulting capabilities, which include\nthe experience-driven design methodologies of projekt202, another Amdocs\ncompany.\n\n     As Amdocs Digital Services helps service providers digitally transform\ntheir business and move them to the cloud, the company is leading\nlarge-scale, end-to end digital transformation projects at customers around\nthe globe. With its telco-specific experience and knowledge, Amdocs also\nempowers service providers to transform complex data into an intelligent\ndata foundation, and then through data intelligence use cases, harness this\ndata to drive business value with AI-driven insights.\n\n     With self-healing AI-driven automation and autonomous governance\nsolutions, Amdocs also supports the complete quality engineering spectrum\nof services, from project-based engagements to fully outsourced testing\ncenters of excellence and has won analyst recognition for having the\nleading market share for quality engineering services for telecom.\n\n     Amdocs at MWC\n     *  Shuky Sheffer, Amdocs President and CEO, will be participating in\nthe MWC keynote session Delivering a New World on Tuesday, March 1\n     *  Niall Norton, Amdocs General Manager, Networking Software Division,\nwill be taking part in the MWC conference session Public Cloud: The Key\nQuestions on Wednesday, March 2\n     *  The Amdocs booth is situated in Hall 3, stand 3G10\n     *  There will be an Amdocs booth at the AWS Village and an Amdocs demo\nin the demo area\n     *  There will be an Amdocs booth at the Microsoft partners' area\n     *  Shahar Dumai, Amdocs Head of Digital Brands Marketing, will be\ndelivering an AWS partner Lightening Talk on Accelerate business agility\nwith SaaS BSS at the AWS Village Theatre on Monday, February 28\n     *  Oren Betzaleli, Amdocs General Manager, Cloud, will present an AWS\nVillage Theatre Session on To the cloud and beyond: CSPs cloud adoption\nprogress &amp; challenges, at the AWS Village Theatre on Tuesday, March 1\n\n     Supporting Resources\n\n     *  Keep up with Amdocs news by visiting the company's website\n     *  Follow us on Twitter, Facebook, LinkedIn and YouTube\n\n     About Amdocs\n\n     Amdocs helps those who build the future to make it amazing. With our\nmarket-leading portfolio of software products and services, we unlock our\ncustomers' innovative potential, empowering them to provide next-generation\ncommunication and media experiences for both the individual end user and\nenterprise customers. Our 29,000 employees around the globe are here to\naccelerate service providers' migration to the cloud, enable them to\ndifferentiate in the 5G era, and digitalize and automate their operations.\nListed on the NASDAQ Global Select Market, Amdocs had revenue of $4.3\nbillion in fiscal 2021. For more information, visit Amdocs at\nwww.amdocs.com\n\n     Amdocs' Forward-Looking Statement\n\n     This press release includes information that constitutes\nforward-looking statements made pursuant to the safe harbor provision of\nthe Private Securities Litigation Reform Act of 1995, including statements\nabout Amdocs' growth and business results in future quarters. Although we\nbelieve the expectations reflected in such forward-looking statements are\nbased upon reasonable assumptions, we can give no assurance that our\nexpectations will be obtained or that any deviations will not be material.\nSuch statements involve risks and uncertainties that may cause future\nresults to differ from those anticipated. These risks include, but are not\nlimited to, the effects of general economic conditions, Amdocs' ability to\ngrow in the business markets that it serves, Amdocs' ability to\nsuccessfully integrate acquired businesses, adverse effects of market\ncompetition, rapid technological shifts that may render the Company's\nproducts and services obsolete, potential loss of a major customer, our\nability to develop long-term relationships with our customers, and risks\nassociated with operating businesses in the international market. Amdocs\nmay elect to update these forward-looking statements at some point in the\nfuture; however, the Company specifically disclaims any obligation to do\nso. These and other risks are discussed at greater length in Amdocs'\nfilings with the Securities and Exchange Commission, including in our\nAnnual Report on Form 20-F for the fiscal year ended September 30, 2021,\nfiled on December 10, 2021, and our Form 6-K furnished for the first\nquarter of fiscal 2022 on February 14, 2022.\n\nContact:\n     Jeff Barak\nAmdocs Public Relations\nE-mail: Jeff.Barak@amdocs.com\n\n     Emily Holt\nPAN Communications for Amdocs\nEmail: Amdocs@pancomm.com\n\n<a href=\"https://www.amdocs.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.amdocs.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2205500141.MNPRE2205500662-06032120220225</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}