{"date": "2021-09-10 21:20:06.637000+00:00", "ticker": "ABDN", "mrkt_info": {"open": 257.5, "close": 261.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ABERDEEN ASIA PACIFIC INCOME INVESTMENT CO LTD (\"FAP-T;ABAKF-0\")\n- Monthly Distribution and Estimated Earnings\n\n     Aberdeen Asia-Pacific Income Investment Company Limited (the\n\"Company\"), a closed-end investment company trading on the Toronto Stock\nExchange, announced today that it will pay a monthly distribution of CAD\n2.25 cents per ordinary share on September 30, 2021 to all ordinary\nshareholders of record as of September 20, 2021 (ex-dividend date September\n17, 2021).\n\n     The policy of the Company's Board of Directors is to maintain a stable\nmonthly distribution out of net investment income and realized capital\ngains supplemented with paid-in capital as required. This policy is subject\nto regular review at the Board's quarterly meetings.\n\n     The following table sets forth the estimated amounts and the sources\nof the distributions. The figures in the table below have been computed\nbased on international financial reporting standards. The table includes\nestimated amounts and percentages for the distribution to be paid on\nSeptember 30, 2021 as well as the estimated cumulative distributions\ndeclared fiscal year to date (11/01/2020 - 08/31/2021), from the following\nsources: net investment income; net realized gains; return of capital; and\nreturn of par. The final composition of the distributions is subject to\nchange and may be impacted by future income, expenses and realized gains\nand losses on securities and currencies. Although a portion of any\ndistribution may be recorded as a return of capital, the full amount of the\ndistribution (other than a return of par) will be foreign income for\nCanadian income tax purposes.\n\n//st\n\n                Estimated       Estimated      Estimated       Estimated\n                Amounts of      Amounts of     Amounts of      Amounts of\n                Current         Current        Fiscal Year     Fiscal Year\n                Monthly         Monthly        to Date         to Date\n                Distribution    Distribution   Cumulative      Cumulative\n                per share       per share      Distributions\nDistributions\n                (C$)            (%)            per share       per share\n(%)\n                                               (C$)\n\n  Net           $0.0171         76%            $0.1881         76%\n  Investment\n  Income\n\n  Net           -               -              -               -\n  Realized\n  Gains\n\n  Return of     -               -              -               -\n  Capital\n\n  Return of     $0.0054         24%            $0.0594         24%\n  Par\n\n  Total (per    $0.0225         100%           $0.2475         100%\n  common\n  share)\n\n//et\n\n     Shareholders should not draw any conclusions about the Company's\ninvestment performance from the amount of the Company's current\ndistribution.\n\n     The amounts and sources of distributions set out above are estimates\nonly and are not being provided for tax reporting purposes. The final\ndetermination of the source of all distributions made in 2021 will be made\nafter the year-ended 2021. The actual amounts and sources of the amounts of\ndistributions for tax reporting purposes will depend upon the Company's\nresults during the remainder of the calendar year and are subject to any\nchanges to applicable tax regulations. Information for tax reporting\npurposes will be provided to the Company's shareholders on a Form T5 in\nFebruary of 2022.\n\n     Information in this press release that is not current or historical\nfactual information may constitute forward-looking information within the\nmeaning of securities laws. Such forward-looking information reflects the\nInvestment Manager's beliefs, estimates and opinion regarding the Company's\nfuture financial performance, projects and opportunities and market\nconditions as at today's date. Implicit in this information, particularly\nin respect of future financial performance and condition of the Company,\nare factors and assumptions which, although considered reasonable by the\nCompany at the time of preparation, may prove to be incorrect. Shareholders\nare cautioned that actual results are subject to a number of risks and\nuncertainties, including general economic and market factors, including\ncredit, currency, political and interest-rate risks and could differ\nmaterially from what is currently expected. The Company has no specific\nintention of updating any forward-looking information whether as a result\nof new information, future events or otherwise, except as required by law.\n\n     Aberdeen Standard Investments (\"ASI\") is the marketing name in Canada\nfor Aberdeen Standard Investments (Canada) Limited (\"ASI Canada\"), Aberdeen\nStandard Investments Luxembourg SA, Standard Life Investments Private\nCapital Ltd, SL Capital Partners LLP, Standard Life Investments Limited,\nAberdeen Standard Alternative Funds Limited, and Aberdeen Capital\nManagement LLC. ASI Canada is the administrator of the Company and is\nregistered as an investment fund manager in Canada where required. ASI\nCanada is a wholly-owned subsidiary of Aberdeen Standard Investments Inc.,\nthe sub-administrator of the Company.\n\n     Closed-end funds are traded on the secondary market through one of the\nstock exchanges. The Company's investment return and principal value will\nfluctuate so that an investor's shares may be worth more or less than the\noriginal cost. Shares of closed-end funds may trade above (a premium) or\nbelow (a discount) the net asset value (NAV) of the Company. There is no\nassurance that the Company will achieve its investment objective. Past\nperformance does not guarantee future results.\n\n     If you wish to receive this information electronically, please contact\nInvestor.Relations@aberdeenstandard.com\n\nContact:\n\nInvestor Relations\n1-800-992-6341\nInvestor.Relations@aberdeenstandard.com\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2125200490.MNPRE2125201639-14112220210910</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}