{"date": "2021-12-23 23:12:38.092000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3420.74, "close": 3393.39}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>CORE ONE LABS INC (\"COOL-Z;CLABF-0\")\n- Acquires New Path Laboratories\n\n     Core One Labs Inc. (the \"Company\" or \"Core One\") is a research and\ndevelopment company focused on bringing psychedelic medicines to market\nthrough the development and production of API grade psychedelic compounds,\nthe advancement of psychedelic assisted treatments, and the integration of\nnovel delivery system technology. The Company is pleased to announce it has\ncompleted the acquisition (the \"Transaction\") of all of the outstanding\nshare capital of New Path Laboratories Inc. (\"New Path\").\n\n     Based in British Columbia, New Path is dedicated to the development\nand licencing of natural health products and dietary supplements\nincorporating functional mushrooms to help support every day biological\nfunctions in the maintenance of good health. New Path's vertical\nintegration model will allow it to grow, develop, and distribute its\nnatural health products and dietary supplements from spore to sale. New\nPath's equipment and infrastructure along with its proprietary mycelium\nprocess allow for the low-cost production of its products.\n\n     New Path currently has two retail components, Nue Mindset and Forest\nGarden Mushrooms, both of which specialize in functional, non-psychedelic,\nmushroom products. Nue Mindset, which is currently awaiting Health Canada's\nNatural Health Product Number approval, produces a Lion's Mane mushroom\npowder infused with Vitamin B3, to assist in improving cognitive function.\nThe Lion's Mane mix has received pre-orders from both local and online\nretail outlets. Concurrently, Forest Garden produces an immune boosting\ncapsule line made from Chaga, Cordyceps, Reishi, Maitake and Lion's Mane\nmushrooms. New Path also manufactures a simple to use and easy to\ndistribute Lion's Mane mushroom grow kit. Forest Garden plans to sell its\nproducts through Nue Mindset's already established retail channels.\n\n     Medicinal mushrooms are ranked as a Top 10 Food Trend by Whole Foods.\nThey have been used as a health aid, mainly in eastern medicine, for over\n2000 years. At present, functional mushrooms such as Chaga, Lion's Mane,\nReishi, Maitake, Cordyceps and Turkey Tail are quickly becoming the latest\nsuperfood trend. Mushrooms act as antibacterial immune system enhancers and\nhelp to improve brain health and increase cognitive abilities. Functional\nmushrooms contain important bioactive compounds and can even help to lower\ncholesterol. Importantly, animal studies have also suggested that compounds\nin the functional mushroom Chaga have shown to selectively kill cancer\ncells and help stimulate the immune system. These benefits along with\nproactive health care and plant-based lifestyle changes suggest that it can\nbe expected that North America will witness significant growth in the\nfunctional mushroom market.\n\n     Joel Shacker, CEO of the Company stated, \"This acquisition further\nextends the Company's presence in the functional mushrooms space and also\nwill allow the Company to generate sales revenue by virtue of adding retail\ndistribution channels to its business model and reach an exponentially\ngrowing consumer base.\"\n\n     Transaction Structure\n\n     The Transaction was completed pursuant to a share purchase agreement\namong the Company, New Path and the shareholders of New Path (the\n\"Definitive Agreement\") dated effective December 22, 2021. Pursuant to the\nDefinitive Agreement, and in consideration for the acquisition of New Path,\nthe Company has issued 5,700,000 common shares (the \"Consideration\nShares\"). The Consideration Shares are subject to a voluntary pooling\narrangement during which time the holders are restricted from trading the\nshares. The Consideration Shares will be released from the arrangement in\nfour equal tranches over a period of nine-months with the first tranche\nbeing released upon closing of the Transaction and each subsequent tranche\nevery three months thereafter.\n\n     The Company is at arms-length from New Path and its shareholders. The\nTransaction neither constitutes a fundamental change nor a change of\nbusiness for the Company, nor has it resulted in a change of control of the\nCompany within the meaning applicable securities laws and the policies of\nthe Canadian Securities Exchange. In connection with completion of the\nTransaction, the Company has issued 114,500 common shares to certain\nthird-parties who provided administrative services necessary to complete\nthe Transaction.\n\n     About Core One Labs Inc.\n\n     Core One is a biotechnology research and technology life science\nenterprise focused on bringing psychedelic medicines to market through\nnovel delivery systems and psychedelic assisted psychotherapy. Core One has\ndeveloped a patent-pending thin-film oral strip, which dissolves instantly\nwhen placed in the mouth and delivers organic molecules in precise\nquantities to the bloodstream, maintaining excellent bioavailability. The\ncompany intends to further develop and apply the technology to psychedelic\ncompounds, such as psilocybin. Core One also holds an interest in medical\nclinics which maintain a combined database of over 275,000 patients.\nThrough these clinics, the integration of its intellectual property,\nresearch and development related to psychedelic treatments, and novel drug\ntherapies, the company intends to obtain regulatory research approval for\nthe advancement of psychedelic-derived treatments for mental health\ndisorders.\n\nCore One Labs Inc.\n\nJoel Shacker\nChief Executive Officer\n\nCONTACT:\ninfo@core1labs.com\n1-866-347-5058\n\n     Cautionary Disclaimer Statement:\n\n     The Canadian Securities Exchange has not reviewed and does not accept\nresponsibility for the adequacy or accuracy of the content of this news\nrelease.\n\n     Information set forth in this news release contains forward-looking\nstatements that are based on assumptions as of the date of this news\nrelease. These statements reflect management's current estimates, beliefs,\nintentions, and expectations. They are not guarantees of future\nperformance. The Company cautions that all forward-looking statements are\ninherently uncertain, and that actual performance may be affected by a\nnumber of material factors, many of which are beyond the Company's control.\nSuch factors include, among other things: risks and uncertainties relating\nto the Company's limited operating history and the need to comply with\nstrict regulatory regulations. Accordingly, actual and future events,\nconditions and results may differ materially from the estimates, beliefs,\nintentions and expectations expressed or implied in the forward-looking\ninformation. Except as required under applicable securities legislation,\nthe Company undertakes no obligation to publicly update or revise\nforward-looking information.\n\n     In addition, psilocybin is currently a Schedule III drug under the\nControlled Drugs and Substances Act (Canada) and it is a criminal offence\nto possess substances under the Controlled Drugs and Substances Act\n(Canada) without a prescription or authorization. Health Canada has not\napproved psilocybin as a drug for any indication. Core One does not have\nany direct or indirect involvement with illegal selling, production, or\ndistribution of psychedelic substances in jurisdictions in which it\noperates. While Core One believes psychedelic substances can be used to\ntreat certain medical conditions, it does not advocate for the legalization\nof psychedelics substances for recreational use. Core One does not deal\nwith psychedelic substances, except within laboratory and clinical trial\nsettings conducted within approved regulatory frameworks.\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2135600522.MNPRE2135601471-14580120211223</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}