{"date": "2021-11-16 16:29:18.409000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 5837SLeverage Shares PLC16 November 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>\n</span></p>\n<p>\n<span>Leverage Shares plc</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>16 November 2021</span>\n</p>\n<p>\n<span>THIS NOTICE IS IMPORTANT AND REQUIRES THE IMMEDIATE ATTENTION OF THE HOLDERS OF THE ETP SECURITIES. IF ANY ETP SECURITYHOLDER IS IN ANY DOUBT AS TO THE ACTION THEY SHOULD TAKE, THEY SHOULD CONSULT THEIR OWN INDEPENDENT PROFESSIONAL ADVISERS IMMEDIATELY</span>\n</p>\n<p>\n<span>If you have recently sold or otherwise transferred your entire holding(s) of ETP Securities referred to below, you should immediately forward this notice to the purchaser or transferee or to the stockbroker, bank or other agent through whom the sale or transfer was effected for transmission to the purchaser or transferee.</span>\n</p>\n<p>\n<span>Notice to ETP Securityholders of the following series of ETP Securities issued by Leverage Shares plc (the \"Issuer\")</span>\n</p>\n<p>\n<span>Leverage Shares 2x Alphabet ETP Securities (ISIN: IE00BF01VY89) Leverage Shares 2x Amazon ETP Securities ( <span>ISIN: IE00BF03XH11)</span> Leverage Shares 2x Apple ETP Securities ( <span>ISIN: IE00BF03XJ35)</span> Leverage Shares 2x Citigroup ETP Securities ( <span>ISIN: IE00BF03XL56)</span> Leverage Shares 2x Facebook ETP Securities ( <span>ISIN: IE00BF03XP94)</span> Leverage Shares 2x Goldman Sachs ETP Securities ( <span>ISIN: IE00BF03XR19)</span> Leverage Shares 2x JPMorgan ETP Securities ( <span>ISIN: IE00BF03XW61)</span> Leverage Shares 2x Microsoft ETP Securities ( <span>ISIN: IE00BF03XY85)</span> Leverage Shares 2x Netflix ETP Securities ( <span>ISIN: IE00BD09ZW40)</span> Leverage Shares 2x NVIDIA ETP Securities ( <span>ISIN: IE00BD09ZX56)</span> Leverage Shares 2x Salesforce.com ETP Securities ( <span>ISIN: IE00BD09ZY63)</span> Leverage Shares 2x Visa ETP Securities ( <span>ISIN: IE00BD09ZV33)</span> (the \"Relevant Series\")</span>\n</p>\n<p>\n<span>Capitalised terms used, but not defined, in this notice shall have the meaning given thereto in the Notice to ETP Securityholders of the Relevant Series dated 27 September 2021.</span>\n</p>\n<p>\n<span>The Issuer hereby notifies the ETP Securityholders of the Relevant Series that the Change of Portfolio Administrator and Change of Margin Account Agreement will occur on 18 November 2021 and not 15 November 2021, as previously advised.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>If you have any queries arising from this notice, please contact us at</span>\n<span>\n<a href=\"mailto:info@leverageshares.com\" data-type=\"email\" translate=\"no\">info@leverageshares.com</a>\n</span>\n<span>.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Yours sincerely</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The Directors</span>\n</p>\n<p>\n<span>Leverage Shares plc</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>MSCGPGAGGUPGGQQ</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}