{"date": "2021-12-17 19:28:17.627000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3377.42, "close": 3341.58}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission. </span> </p><p>Stocking stuffers often make the best gifts on Christmas for kids, Mom and anyone else on your holiday shopping list. Amazon, known for having nearly everything under the sun, has thousands of stocking-stuffer-worthy products you can still snag before Christmas Day. Better hurry, though!</p></div><div class=\"tr-npp-body\"><p><span><span>Tackle your holiday shopping with deals and expert advice delivered straight to your phone.</span> Sign up for text message alerts from the deal-hunting team at Reviewed.</span> </p><p>Holiday shipping deadlines are quickly closing and you may need to pay for expedited delivery depending on when you order. There's no denying that gifts under the tree are always a joy to open up, but there's always room for excitement around what's hiding in your stocking hanging on the mantel. So don't wait any longer to shop the 30 best stocking stuffers under $30 available on Amazon with delivery by Christmas.</p><p class=\"tr-npp-section-title\">1. For the one who wears their staple jewelry: Diamond Dazzle Stik</p><p>If your giftee wears the same earrings, necklaces and rings every day, then their jewelry may be in need of a serious refresh from all that wear. Amazon reviewers swear by this jewelry cleaning stick designed to re-sparkle diamonds, saying it's very easy to use and that they saw significant improvement upon their jewels.</p><p><span><a href=\"https://www.amazon.com/Connoisseurs-1050-Diamond-Dazzle-Stick/dp/B00459VM6I/?ots=1&amp;slotNum=30&amp;imprToken=b0becd15-7cef-a0e6-d42&amp;tag=usatgiftguide-20\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the Diamond Dazzle Stik at Amazon for $6.99</a> </span> </p><p class=\"tr-npp-section-title\">2. For the home chef who loves fresh ingredients: Microplane Premium Grater </p><p>Perfect for testing lemons or shredding parmesan cheese onto their favorite recipe, this mini grater will come in handy for any cook. This celebrity chef-endorsed grater features made-in-the-USA, razor-sharp stainless steel and the premium version has a soft touch handle, making it comfortable to hold. This grater is a game-changer because of its versatility and has the power to grind up whole spices as well.</p><p><span>Get the Microplane Premium Grater at Amazon for $15.95</span> </p><p class=\"tr-npp-section-title\">3. For the one who loves sweets: Lodge Miniature Skillet</p><p>Those who spend too much time on Pinterest or watch a lot of cooking shows will love a few individually sized cast iron skillets. Lodge makes  <a href=\"https://www.reviewed.com/home-outdoors/best-right-now/best-cast-iron-pans\" data-type=\"url\" class=\"tr-link\" translate=\"no\">the best cast iron cookware out there because it lasts a lifetime, comes preseasoned and is always very affordable. These mini skillets are extra adorable and the perfect size for personal brownies or cookie skillets, which is just what your giftee needs at the end of a hard day.</a> </p><p><a href=\"https://www.amazon.com/Lodge-Skillet-Skillet-Stovetop-Cooking/dp/B00063RWT8/?ots=1&amp;slotNum=13&amp;imprToken=d0becd35-56c8-bffd-68c&amp;tag=usatgiftguide-20\"><span>Get the Lodge Miniature Skillet at Amazon for $12.37</span> </a> </p><p class=\"tr-npp-section-title\">4. For the tea drinker: Fred &amp; Friends Manatea Silicone Tea Infuser</p><p>If your giftee likes to end their day cozied up with a cup of tea, then they need a good tea infuser. The Manatea is not only adorable and punny, but it's  <a href=\"https://www.reviewed.com/cooking/best-right-now/the-best-tea-infusers\" data-type=\"url\" class=\"tr-link\" translate=\"no\">the best tea infuser we've ever tested. Even though it may look like a gag gift, it fits snugly on mugs and doesn't let any leaves slip out, which they'll enjoy while sipping their favorite loose leaf tea.</a> </p><p><span><a href=\"https://www.amazon.com/Fred-MANATEA-Silicone-Tea-Infuser/dp/B00B5EE0A6/?ots=1&amp;slotNum=20&amp;imprToken=b0becd15-7cef-a0e6-d42&amp;th=1&amp;tag=usatsyndication-20\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the Fred &amp; Friends Manatea Silicone Tea Infuser at Amazon for $9</a> </span> </p><p class=\"tr-npp-section-title\">5. For the person who loves music and podcasts: Anker SoundCore Portable Bluetooth Speaker</p><p>When it comes to testing and reviewing tech products, one of our most competitive categories is portable Bluetooth speakers. In our latest roundup of  <a href=\"https://www.reviewed.com/televisions/best-right-now/the-best-portable-bluetooth-speakers\" data-type=\"url\" class=\"tr-link\" translate=\"no\">the best portable Bluetooth speakers you can buy, the ultra-affordable Anker SoundCore earned our spot for the speaker with the best value.</a> </p><p>If your Secret Santa gift recipient loves listening to podcasts while doing dishes or freshening up in the bathroom, they'll love the SoundCore's IPX7 waterproof rating, which protects the speaker from splashes and partial submersions. Plus, we found the Anker SoundCore's audio output to be much more bass-friendly than other speakers in its price bracket.</p><p><a href=\"https://www.amazon.com/Bluetooth-Speakers-Anker-Soundcore-Playtime/dp/B016XTADG2/ref=as_li_ss_tl?ots=1&amp;slotNum=4&amp;imprToken=c6becd27-b26b-41a3-495&amp;psc=1&amp;SubscriptionId=AKIAJIYMMIJN7RU7KVJQ&amp;linkCode=ll1&amp;tag=usatgiftguide-20&amp;linkId=43ea54c02597de1e118ddbe29a633a65&amp;language=en_US\"><span>Get the Anker SoundCore Portable Bluetooth Speaker at Amazon for $27.99</span> </a> </p><p class=\"tr-npp-section-title\">6. For the one who loves to take baths: Da Bomb Bath Bomb</p><p>You don't have to pay for a trip to the spa to experience a luxury bath. With one of the best bath bombs, the Da Bomb Bath Fairy Bomb, you can give the gift of some bath time fun as this beauty treat will turn the water pretty pink and blues. There's even a surprise trinket inside to spread a little extra holiday cheer.</p><p><span>Get Da Bomb Fairy Bath Bomb on Amazon for $7.50</span> </p><p class=\"tr-npp-section-title\">7. For the one always on the go: Stojo Coffee Cup</p><p>Travel mugs are a great way to keep drinks warm and be a little more environmentally friendly. If your giftee needs an ultra-convenient travel mug solution, they might appreciate the Stojo, a collapsable coffee cup. It squashes up to easily fit in a bag (or a stocking!) while still maintaining some insulation for your drink when expanded. We  <a href=\"https://www.reviewed.com/lifestyle/features/stojo-cup-review\" data-type=\"url\" class=\"tr-link\" translate=\"no\">tested it and loved how easy it was to use and how many color options there were.</a> </p><p><span><a href=\"https://www.amazon.com/Coffee-Pocket-Collapsible-Silicone-Travel/dp/B07XY6WTZQ?tag=usatgiftguide-20\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the Stojo Collapsible Travel Cup at Amazon for $20</a> </span> </p><p class=\"tr-npp-section-title\">8. For the cocktail connoisseur: Quiseen Beverage Chilling Stones</p><p>No one wants a lukewarm drink, but no one wants a watered-down drink, either. That's why beverage chilling stones are must-haves for lovers of whiskey and other liquors. These ones are made from natural soapstone and keep drinks icy cool without watering them down, which any cocktail connoisseur will appreciate.</p><p><span><a href=\"https://www.amazon.com/Beverage-Chilling-Stones-Whiskey-Beverages/dp/B014Q2R6GS/?ots=1&amp;slotNum=31&amp;imprToken=b0becd15-7cef-a0e6-d42&amp;tag=usatgiftguide-20\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the Quiseen Beverage Chilling Stones at Amazon for $9.99</a> </span> </p><p class=\"tr-npp-section-title\">9. For the one who visually keeps track of things: 365 Page-A-Day Calendar</p><p>For those who love marking down events and counting down dates with a calendar, this makes a great gift. You can get these types of calendars in a variety of designs, but this cat-themed one that shows you a new cat every day is too adorable not to consider.</p><p><a href=\"https://www.amazon.com/Cats-Page-Day-Calendar-2019/dp/1523503335/ref=as_li_ss_tl?ots=1&amp;slotNum=18&amp;imprToken=d0becd35-56c8-bffd-68c&amp;ie=UTF8&amp;linkCode=ll1&amp;tag=usatgiftguide-20&amp;linkId=f0eabd41148fab635f2c367ca8e2a73b&amp;language=en_US\"><span>Get the 365 Cats Page-A-Day Calendar from Amazon for $12.95</span> </a> </p><p class=\"tr-npp-section-title\">10. For the one who's always using their AirPods: AhaStyle AirPods Case Cover</p><p>If your giftee is never seen without their AirPods, gift them a protective carrying case that'll keep them safe and secure. This particular case comes with a clip that you can attach to your backpack, purse or loophole, making it a must for those who always want their AirPods within reach.</p><p><span><a href=\"https://www.amazon.com/dp/B077187F2R/ref=as_li_ss_tl?ots=1&amp;slotNum=12&amp;imprToken=06bacd27-83eb-e67e-f9f&amp;th=1&amp;linkCode=ll1&amp;tag=usatgiftguide-20&amp;linkId=8f2c17241c97b0a3513f32d6e290fc8d&amp;language=en_US\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the AhaStyle AirPods Case Cover at Amazon for $4.39</a> </span> </p><p class=\"tr-npp-section-title\">11. For the one who loves selfies: QIAYA Selfie Light Ring</p><p>Whether they've been mastering TikTok dances or are always trying to find the best lighting for their photos, a ring light will ensure they always have the perfect lighting for selfies. With three light settings, this one from QIAYA can brighten up self-portraits taken at night or in a dark room. The light is rechargeable, simply clips to the top of a phone and is small enough to carry in a backpack, purse or pocket.</p><p><span><a href=\"https://www.amazon.com/QIAYA-Selfie-Photography-Lighting-Rechargeable/dp/B07QKRXTWJ/ref=as_li_ss_tl?ots=1&amp;slotNum=13&amp;imprToken=c6becd27-b26b-41a3-495&amp;ie=UTF8&amp;linkCode=ll1&amp;tag=usatgiftguide-20&amp;linkId=30beaabccd035ebaec2fba4b9d374fcb&amp;language=en_US\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the QIAYA Selfie Light Ring at Amazon for $11.99</a> </span> </p><p class=\"tr-npp-section-title\">12. For the one who can never find their keys: Tile Mate</p><p>If your recipient is always late because they can't find their keys, get them the Tile Mate so they can finally put an end to their forgetfulness. The Tile Mate is so popular because it can be used with commonly forgotten items like keys, wallets and purses. The next time they lose their keys, they can just use an app to ping the Tile and quickly find them to actually meet you on time.</p><p><span>Get the Tile Mate at Amazon for $19.99</span> </p><p class=\"tr-npp-section-title\">13. For your eco-conscious friend: Hummingbird Glass Straws</p><p>The rise of eco-friendly plastic straw alternatives is here, and this year, we took it upon ourselves to figure out which ones are the best. When the cups were cleared, this set of four glass straws from Hummingbird wound up claiming the top spot in our final roundup of  <a href=\"https://www.reviewed.com/home-outdoors/best-right-now/the-best-reusable-straws\" data-type=\"url\" class=\"tr-link\" translate=\"no\">the best reusable straws. These suckers come with a cleaning brush and their glass build makes them safe for dishwashers, too. And while they're technically not indestructible, we found them to be remarkably durable—and therefore quite portable.</a> </p><p><a href=\"https://www.amazon.com/Hummingbird-Glass-Straws-Clear-Pride/dp/B00KM61F88/ref=as_li_ss_tl?ots=1&amp;slotNum=3&amp;imprToken=c6becd27-b26b-41a3-495&amp;ie=UTF8&amp;linkCode=ll1&amp;tag=usatgiftguide-20&amp;linkId=bcf1ce8380de7cd715b5916d55a8928b&amp;language=en_US\"><span>Get Hummingbird Glass Straws (Set of 4) at Amazon for $19.99</span> </a> </p><p class=\"tr-npp-section-title\">14. For the one who's always using their phone: PopSockets PopGrip</p><p>PopSockets are one of the best phone accessories you can give—these small adhesive knobs can be popped in or out to create an easy carrying handle or stand on the go. This makes talking on the phone, FaceTiming, taking photos, watching YouTube or pretty much anything else you might need your phone for much easier. Each one is interchangeable, so you can get a bunch of different tops to mix and match.</p><p><span><a href=\"https://www.amazon.com/PopSockets-PopGrip-Swappable-Tablets-Pressed/dp/B07ZXG2LDN?ots=1&amp;slotNum=6&amp;imprToken=b0becd15-7cef-a0e6-d42&amp;tag=usatgiftguide-20\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the PopSockets PopGrip at Amazon for $14.99</a> </span> </p><p class=\"tr-npp-section-title\">15. For the person who loves to stay fresh and smell good: Manscaped The Crop Preserver</p><p>Made by the well-loved Manscaped brand, the Crop Preserver is a powerful moisturizing ball deodorant that'll keep its user feeling refreshed. This formula is made without any parabens or dyes, and fights against chafing to keep skin feeling smooth all day long.</p><p><span>Get the Manscaped Crop Preserver at Amazon for $12.99</span> </p><p class=\"tr-npp-section-title\">16. For the one who's always looking to drink more water: Brita Premium Filtering Water Bottle</p><p>Is your giftee big on recycling and reducing their carbon footprint? If so, you can't go wrong getting them  <a href=\"https://www.reviewed.com/home-outdoors/best-right-now/the-best-water-bottles\" data-type=\"url\" class=\"tr-link\" translate=\"no\">our favorite reusable water bottle, the Brita Premium. This water bottle offers a generous 20-ounce capacity and a wide-mouth opening for easy filling, and it has a built-in filter that will help remove impurities from the water as they drink. Plus, this reusable bottle comes in a variety of colors to suit your giftee's tastes. </a> </p><p><span><a href=\"https://www.amazon.com/dp/B07QNYWJ3H/ref=as_li_ss_tl?ots=1&amp;slotNum=1&amp;imprToken=5ebecd3b-7a02-0a36-8c5&amp;ie=UTF8&amp;linkCode=ll1&amp;tag=usatgiftguide-20&amp;linkId=9d3582654820f3c5f4131e272f880886&amp;language=en_US\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the Brita Premium Filtering Water Bottle from Amazon for $24.99</a> </span> </p><p class=\"tr-npp-section-title\">17. For kids who love to explore nature: Scotamalone Shock Proof Binoculars</p><p>Kids who are curious about birds, bees and the natural world will appreciate this pair of binoculars designed just for them. These lightweight, colorful binoculars are easy for kids to use, featuring a neck strap that'll keep them from losing or dropping them.</p><p><span><a href=\"https://www.amazon.com/Scotamalone-Kid-Binoculars-Shock-Proof/dp/B071WP41M2/ref=as_li_ss_tl?ots=1&amp;slotNum=18&amp;imprToken=96becd42-8f66-68f6-ccf&amp;crid=1URX7UG9UAF72&amp;dchild=1&amp;keywords=gifts+under+10+dollars+for+kids&amp;qid=1600968048&amp;sprefix=gifts+under+$10,aps,217&amp;sr=8-27&amp;linkCode=ll1&amp;tag=usatgiftguide-20&amp;linkId=c2ab73bd6d3ed20b3be1ba9c59addd7b&amp;language=en_US\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the Scotamalone Shock Proof Binoculars on Amazon from $8.99</a> </span> </p><p class=\"tr-npp-section-title\">18. For those who dream of stardom: Bonaok Wireless Bluetooth Microphone</p><p>Give the gift of karaoke dreams with this fun Bluetooth microphone—it's sure to make all future car rides and family gatherings a blast. The Bonaok pairs wirelessly with Bluetooth so they can perform their best karaoke songs right at home. It also comes in a variety of bright and metallic hues so they can have one in their favorite color. </p><p><span><a href=\"https://www.amazon.com/dp/B075CKXXKH/?th=1&amp;tag=usat-exclusive-20\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the Bonaok Wireless Bluetooth Microphone on Amazon for $29.99</a> </span> </p><p class=\"tr-npp-section-title\">19. For the one who always loses their hair ties: Seven Style Scrunchies Set</p><p>Hair ties always seem to evaporate and go missing right when you need them most. Help the long-haired person in your life replenish their supply with this top-rated  <a href=\"https://www.amazon.com/Scrunchies-Elastic-Scrunchy-Scrunchie-Accessories/dp/B07H7YCDR4/?ots=1&amp;slotNum=5&amp;imprToken=72becd4b-146d-9aac-20d&amp;tag=usatgiftguide-20\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Scrunchie pack. The set comes with a wide range of colors, in a soft velvety material to mix and match with any outfit. Plus, of course, they work well to keep hair tied back throughout the day.</a> </p><p><span><a href=\"https://www.amazon.com/Scrunchies-Elastic-Scrunchy-Scrunchie-Accessories/dp/B07H7YCDR4/?ots=1&amp;slotNum=6&amp;imprToken=72becd4b-146d-9aac-20d&amp;tag=usatgiftguide-20\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the Seven Style Scrunchie Set from Amazon for $9.99</a> </span> </p><p class=\"tr-npp-section-title\">20. For the beauty lover: Beauty Bakerie Setting Powder </p><p>This too-cute  <a href=\"https://www.amazon.com/Beauty-Bakerie-Setting-Powder-Yellow/dp/B07C89LJ99/ref=as_li_ss_tl?ots=1&amp;slotNum=15&amp;imprToken=46becd4b-dc95-54bd-3ff&amp;dchild=1&amp;keywords=Beauty+Bakerie&amp;qid=1603378722&amp;sr=8-2&amp;linkCode=ll1&amp;tag=usatgiftguide-20&amp;linkId=65eac776ad0f3cdfd8f383df8a5b3fe0&amp;language=en_US\" data-type=\"url\" class=\"tr-link\" translate=\"no\">setting powder from Beauty Bakerie is made to look like a bag of flour, and we couldn't be any more obsessed. Created by a Black-owned brand that creates and packages their products with dessert themes in mind, this gift is sure to excite the beauty-obsessed. You can purchase it in three different shades: translucent, brown or yellow. </a> </p><p><span><a href=\"https://www.amazon.com/Beauty-Bakerie-Setting-Powder-Yellow/dp/B07C89LJ99/ref=as_li_ss_tl?ots=1&amp;slotNum=16&amp;imprToken=46becd4b-dc95-54bd-3ff&amp;dchild=1&amp;keywords=Beauty+Bakerie&amp;qid=1603378722&amp;sr=8-2&amp;linkCode=ll1&amp;tag=usatgiftguide-20&amp;linkId=65eac776ad0f3cdfd8f383df8a5b3fe0&amp;language=en_US\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the Beauty Bakerie Setting Powder from Amazon from $24</a> </span> </p><p class=\"tr-npp-section-title\">21. For the exercise-lover: Original Stretch Out Strap</p><p>For the runner or cardio-fanatic in your life—or for the person that just wants to work on their flexibility or mobility—these stretching straps can help them work out kinks in their tightest muscles. Even if they're just a beginner when it comes to working out, the strap comes with a how-to guide on flexibility training.</p><p><span><a href=\"https://www.amazon.com/Original-Stretch-Strap-Exercise-OPTP/dp/B00065X222/ref=as_li_ss_tl?ots=1&amp;slotNum=6&amp;imprToken=8ebecd4f-e3d1-c4af-baf&amp;ie=UTF8&amp;linkCode=ll1&amp;tag=usatgiftguide-20&amp;linkId=b96703027e5c7905a529433eb191ba0d&amp;language=en_US&amp;tag=usatgiftguide-20\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the Original Stretch Out Strap from Amazon for $15.95 </a> </span> </p><p class=\"tr-npp-section-title\">22. For book lovers who read in the dark: Perfectday Rechargeable Reading Light</p><p>Any bookworm who shares a bed or room with someone but needs to plow through a book as their companion sleeps will appreciate an old-school reading light. This one from Perfectday is slim, reliable and rechargeable, and shines a small but intense beam on the page to ensure the reader sees the words but others close by aren't disturbed by a glare. The light also has three brightness settings, each with its own color temperature.</p><p><a href=\"https://www.amazon.com/PERFECTDAY-Rechargeable-Reading-Brightness-Protection/dp/B07VZXKYXW/ref=as_li_ss_tl?ots=1&amp;slotNum=7&amp;imprToken=8abecd50-4a04-960e-dde&amp;keywords=book+light&amp;qid=1570209244&amp;sr=8-5&amp;linkCode=ll1&amp;tag=usatgiftguide-20&amp;linkId=15c445e7768bcbde8f4e6ab65cab1838&amp;language=en_US\"><span>Get the Perfectday Rechargeable Reading Light from Amazon for $9.99</span> </a> </p><p class=\"tr-npp-section-title\">23. For the person with cold feet: Barefoot Dream CozyChic Socks</p><p>The Barefoot Dreams cardigan has a cult following, so it's not surprising their cozy socks are extremely popular. These socks are made with Barefoot Dreams signature CozyChic material that is knit for warmth and softness. </p><p><span>Get the Barefoot Dreams CozyChic Socks at Amazon for $17</span> </p><p class=\"tr-npp-section-title\">24. For the creative one: WikkiStix</p><p>WikkiStix are bendable, wax sticks that will never dry out and offer children (and adults!) hours of play—and they make great stocking stuffers. They can create faces, creatures, and more, and it's the perfect way to keep young ones entertained before holiday dinner.</p><p><span><a href=\"https://www.amazon.com/WikkiStix-603-Rainbow-Pak/dp/B00O2TGG6W/ref=as_li_ss_tl?ots=1&amp;slotNum=30&amp;imprToken=08bac555-8dc8-1639-439&amp;ie=UTF8&amp;linkCode=ll1&amp;tag=usatgiftguide-20&amp;linkId=d099d693b8194dfe926a9a1d9db64b6e&amp;language=en_US\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get WikkiStix Rainbow Pak at Amazon for $4.99</a> </span> </p><p class=\"tr-npp-section-title\">25. For the one who likes to keep busy: Pop It Fidget Toy Keychain</p><p>Pop It toys aren't just for the kids—adults love the satisfying release of pressing down (a.k.a \"popping\") the silicone toy, too. The sensory toy for all ages is a great way to pass the time when you're on the go. Amazon reviewers agree this Pop It keychain is \"firm\" and \"fun to play with.\" </p><p><span><a href=\"https://www.amazon.com/LKMU-Keychain-Popping-Sensory-Reliever/dp/B0956BT473/?ots=1&amp;slotNum=7&amp;imprToken=06bee4d0-7767-b3fb-7b8&amp;th=1&amp;tag=usatgiftguide-20\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the Pop It Keychain on Amazon for $4.97</a> </span> </p><p class=\"tr-npp-section-title\">26. For the one who likes things sweet and spicy: Mike's Hot Honey</p><p>Give your giftee's tastebuds a kick with this popular spicy honey. With more than 13,000 reviews and a 4.7-star rating on Amazon, Mike's Hot Honey has earned cult-status. It's pure honey infused with chili peppers for a sweet-heat combo that reviewers are obsessed with. Your giftee will love it so much they'll end up carrying it with them to drizzle on everything from pizza to wings. </p><p><a href=\"https://www.amazon.com/dp/B085B1YZ8Q/ref=as_li_ss_tl?ots=1&amp;slotNum=12&amp;imprToken=64bee4d2-ae18-5d2b-0fc&amp;ie=UTF8&amp;linkCode=ll1&amp;tag=usatgiftguide-20&amp;linkId=fa97426b3a672da8573cd77ff86b0f2e&amp;language=en_US\"><span>Get the Mike's Hot Honey from Amazon for $9.98</span> </a> </p><p class=\"tr-npp-section-title\">27.For the person who loves to relax: TheraFlow Foot Massage Roller</p><p>The TheraFlow Foot Massage Roller is a reflexology tool for foot pain. Its unique design helps target sore areas of the foot like the arch and heels. With over 9,930 reviews and a 4.5-star rating, you can't go wrong giving this relaxing gift.</p><p><span><a href=\"https://www.amazon.com/New-TheraFlow-Foot-Massager-Roller/dp/B01F1L6YDO/?ots=1&amp;slotNum=8&amp;imprToken=18bee4d9-6647-45da-1fd&amp;tag=usatgiftguide-20\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the TheraFlow Foot Massage Roller on Amazon for $9.95</a> </span> </p><p class=\"tr-npp-section-title\">28. For the one who loves candles: Capri Blue Volcano Candle</p><p>The Capri Blue candle is one of our all-time favorites—you'll find it on our  <a href=\"https://www.usatoday.com/story/tech/reviewedcom/2017/11/13/25-amazing-gifts-women-actually-want/107666244/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">gift guide for women, </a><a href=\"https://www.usatoday.com/story/tech/reviewedcom/2018/11/07/the-20-best-gifts-for-mom-that-shell-actually-want/38368663/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">gift guide for moms, and even </a><a href=\"https://www.usatoday.com/story/tech/reviewedcom/2019/10/15/best-housewarming-gifts-20-top-gifts-new-homeowners-gg-19/3975661002/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">gift guide for new homeowners. The full-sized candle will cost up to $30, but the smaller version (8.5 ounces) is available for $18. It's gorgeous as both a stocking stuffer—just don't expect your giftee to wait long before lighting it up. </a> </p><p><span><a href=\"https://www.amazon.com/Capri-Volcano-Printed-Travel-Candle/dp/B009FBVC98/?ots=1&amp;slotNum=16&amp;imprToken=64bee4d2-ae18-5d2b-0fc&amp;tag=usatgiftguide-20\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the Capri Blue Volcano Tin Candle (8.5-ounce) from Amazon for $18</a> </span> </p><p class=\"tr-npp-section-title\">29. For the person who loves to eat their veggies: Ontel Veggetti Spiralizer</p><p>Veggie noodles are all the rage these days, and  <a href=\"https://www.reviewed.com/ovens/best-right-now/the-best-spiralizers\" data-type=\"url\" class=\"tr-link\" translate=\"no\">our favorite spiralizer can help turn your favorite vegetables into pasta form. We were hesitant when we spied an \"As Seen on TV\" label on this product, but the truth is, it beats out the competition by a long shot.</a> </p><p>The 4-in-1 spiralizer is sturdy enough for frequent use and comes with a small brush that makes the cleaning process a cinch. This affordable kitchen gadget can be used on zucchini, spaghetti squash, carrots and other vegetables. Oh, and it's the perfect size for stockings.</p><p><span><a href=\"https://www.amazon.com/Veggetti-Spiral-Vegetable-Slicer-Veggie/dp/B00IIVRB3W/ref=as_li_ss_tl?ots=1&amp;slotNum=1&amp;imprToken=18bee4d9-6647-45da-1fd&amp;ie=UTF8&amp;linkCode=ll1&amp;tag=usatgiftguide-20&amp;linkId=89e04e7dadd6195bb6233ecbfe860097&amp;language=en_US\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the Ontel Veggetti Spiralizer at Amazon for $9.99</a> </span> </p><p class=\"tr-npp-section-title\">30. For the one who loves wine: Rabbit Wine and Beverage Bottle Stoppers</p><p>If your giftee loves to end the night with a glass of vino, then they'll appreciate these rubber wine stoppers. They have grooved rings hold the stopper in place to prevent any spillage, but more importantly, they ensure no extra oxygen enters the bottle, preserving the wine for a few more days.</p><p><span><a href=\"https://www.amazon.com/Rabbit-W6121-Beverage-Stoppers-Assorted/dp/B005N0WCE4/?ots=1&amp;slotNum=13&amp;imprToken=18bee4d9-6647-45da-1fd&amp;tag=usatgiftguide-20\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Get the Rabbit Wine and Beverage Bottle Stoppers at Amazon for $8</a> </span> </p><p><span><span>Don't get thwarted by shipping delays or sold-out favorites this holiday season.</span> Sign up for our free weekly newsletter and get shopping tips, deals, product reviews, gift guides and more.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: The best stocking stuffers under $30 you can still buy at Amazon</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}