{"date": "2021-12-09 15:40:58.618000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.29, "close": 3483.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>IMAGEWARE SYSTEMS INC (\"IWSY-0\")\n- King County Washington Taps Imageware for its Next\n- Generation Law Enforcement Platform\n\n   Imageware(R) (\"Imageware\" or \"the Company\"), a leader in biometric\nidentification and authentication solutions, today announced that King\nCounty Washington, one of the largest law enforcement entities West of the\nRockies, selected Imageware over several larger competitors to provide\nessential software for officers. The contract, worth $1.5 million, is the\nlargest Software-as-a-Service (SaaS) deal Imageware has ever closed,\nselling Imageware Investigate, a Law Enforcement 2.0 (LE2) Platform module.\n\n   Seven hundred (700) law enforcement officers across King County will be\nusing this solution for digital line-ups and biographic searches from\nanywhere and with any device, including mobile/handheld, tablet, mobile\ndata terminal (MDT), or desktop computer. Imageware will be migrating over\n13 million adult and juvenile arrest records from on-premises servers to\nthe Imageware Law Enforcement 2.0 servers in Amazon Web Services GovCloud.\nKing County will be using Imageware Authenticate (a FirstNet verified app)\nto authenticate into the Imageware solution and can use it for all other\nCounty-owned applications, as needed. King County selected Imageware based\non their cutting-edge solution that far surpasses that of its competitors,\nvisible through its rapid and accurate identification in the field,\nseamless user-friendly interface for creating digital line ups, and quick\nand efficient deployment while remaining cost effective.\n\n   Commenting on the sale, AJ Naddell, SVP of Product Management &amp; Sales,\nsaid, \"Imageware is helping to make citizens and officers safer in a time\nwhen violent crimes are rapidly increasing. We've spent the previous 18\nmonths modernizing our law enforcement platform by updating the UI and UX,\nbackend, our licensing structure, and even our 24/7 mission critical\ncustomer support. This deal with King County, one of our many long-standing\ncustomers, is a testament to how our original law enforcement platform was\nredesigned to be highly desired and utilized by officers. We see numerous\nopportunities to deploy this solution with other law enforcement agencies\nthroughout the U.S. as well as international markets. State, local and\nfederal law enforcement have come to rely on Imageware for more than three\ndecades. We have an exciting 2022 in store with more revenue coming from\nlaw enforcement agencies across both North American and other international\nmarkets, leveraging our modernized software and strategy.\"\n\n   About Imageware(R) Imageware identifies, verifies, and authenticates who\npeople are, not just what keys and codes they have. Our Cloud-based,\nmultimodal biometric solutions provide faster, accurate identification to\nbetter secure communities, data, and assets. Imageware solutions are\ntrusted globally by government agencies, law enforcement, and private\nenterprises. Imageware: Identity with Biometric Certainty. For more\ninformation, please visit www.imageware.io.\n\n   Forward-Looking StatementsAny statements contained in this document that\nare not historical facts are forward-looking statements as defined in the\nU.S. Private Securities Litigation Reform Act of 1995. Words such as\n\"anticipate,\" \"believe,\" \"estimate,\" \"expect,\" \"forecast,\" \"intend,\" \"may,\"\n\"plan,\" \"project,\" \"predict,\" \"if,\" \"should\" and \"will\" and similar\nexpressions as they relate to Imageware are intended to identify such\nforward-looking statements. Imageware may from time to time update publicly\nannounced projections, but it is not obligated to do so. Any projections of\nfuture results of operations should not be construed in any manner as a\nguarantee that such results will in fact occur. These projections are\nsubject to change and could differ materially from final reported results.\nFactors that may cause the projections to change or differ may include, but\nare not limited to, the ability to of the Company to continue to grow\nrevenue, the ability to decrease operating expenses and continue to grow\nprofit margins, and the Company's ability to continue to achieve positive\ncash flow given the Company's existing and anticipated operating and other\ncosts. For a discussion of additional risks and uncertainties, see \"Risk\nFactors\" in Imageware's Annual Report on Form 10-K for the fiscal year\nended December 31, 2020 and its other reports filed with the Securities and\nExchange Commission under the Securities Exchange Act of 1934, as amended.\nReaders are cautioned not to place undue reliance on these forward-looking\nstatements, which speak only as of the dates on which they are made.\n\nMedia Contact: Theresa HernandezImageware\n\nInvestor Relations:Brian M. Prenoveau,\nCFAMZ North America\n+1-561-489-5315\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134200340.MNPRE2134201829-07114820211209</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}