{"date": "2022-02-04 00:19:57+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3012.25, "close": 3152.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds CFO comments on CapEx, Bezos wealth details</p><p class=\"tr-by\">By Jeffrey Dastin and Nivedita Balu</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Feb 3 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> on Thursday said it was raising the price of its annual U.S. Prime subscriptions by 17%, as it looks to offset higher costs for shipping and wages that it expects to persist this year.</p><p>Shares rose as much as 17% in extended trade as Amazon also beat profit expectations for the holiday season. If shares increase on Friday by that much, it would be the stock's biggest percentage gain since October 2009 and grow founder Jeff Bezos' wealth by about $20 billion.</p><p>For the holiday quarter, Amazon earned $14.3 billion, double its net income from a year earlier. That included a pre-tax gain of $11.8 billion from its stake in electric car maker Rivian Automotive <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RIVN.O\" data-type=\"ric\" data-ric=\"RIVN.O\" translate=\"no\" dir=\"ltr\">RIVN.O</a>.</p><p>On the heels of a windfall from greater at-home shopping in the pandemic, Amazon has poured money into its operations to manage disruptions, most recently the Omicron variant of COVID-19. It has marketed signing bonuses to attract hundreds of thousands of workers in a tight labor market, and it has paid more for shipping because it could not get products into the right warehouses.</p><p>Now, as analysts <a href=\"https://And it has more than 200 million paid subscribers to its loyalty club Prime to whom to appeal\" data-type=\"url\" class=\"tr-link\" translate=\"no\">have expected</a>, Amazon is raising the price of Prime. U.S. monthly fees for the fast-shipping and media service are increasing to $14.99 from $12.99, and annual membership is going up to $139, from $119. The change is effective Feb. 18 for new members and reflects greater benefits such as savings on prescription drugs and faster delivery, Amazon said.</p><p>Chief Financial Officer Brian Olsavsky told reporters on a conference call that Amazon expected some members to quit, but retention loss \"hasn't been large in the past.\" The annual fees last went up by the same amount four years ago, and four years before that.</p><p>Revenue per Prime member \"did grow significantly during the pandemic,\" Olsavsky added.</p><p>With more than 200 million members globally, Prime is an incentive to consumers to direct more of their shopping to Amazon. That way, they make the most of their subscriptions. Revenue from such fees for the fourth quarter rose 15% to $8.1 billion.</p><p>The company announced no changes for Prime members outside the United States.    </p><p><div class=\"tr-resource-ref\" id=\"g8d9158ef-17c9-4933-adfa-2e885c102808\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://graphics.reuters.com/USA-AMAZON-EARNINGS/xegvbxrylvq/usa-results-amazon.jpg\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9ncmFwaGljcy5yZXV0ZXJzLmNvbS9VU0EtQU1BWk9OLUVBUk5JTkdTL3hlZ3ZieHJ5bHZxL3VzYS1yZXN1bHRzLWFtYXpvbi5qcGc=&amp;storyId=urn:newsml:reuters.com:20220203:nL4N2UE30Z:3&amp;key=529372044cc9fea78e205e9a91efa42ce4d2de00727876ea0588eac92720f58519982e9d9bb0dcf08e1a0724206f231fcc49680500aa38a829aa70195be3da61\"/></div></div></div></p><p>AD AND CLOUD BUSINESSES SOAR</p><p>Operational disruptions, lost productivity and inflationary pressures contributed to more than $4 billion in costs during the holidays, Olsavsky said. Labor-related challenges would continue, though to a lesser degree, this quarter, and the company's capital expenditures on infrastructure would rise in 2022, he told analysts.</p><p>Offsetting softer e-commerce trends, key cloud unit Amazon Web Services (AWS) performed better than expected. </p><p>\"The one clear bright spot for the core business was the continued acceleration in AWS to help bolster a bottom line that was otherwise squeezed, if not for the boost it got from the Rivian investment,\" Insider Intelligence analyst Andrew Lipsman said.</p><p>With demand rising for gaming and remote work during the pandemic, AWS posted a 40% increase in revenue to $17.8 billion. Analysts had expected more than $17.3 billion, according to IBES data from Refinitiv.</p><p>The unit even won a key customer, announcing Thursday an expanded partnership with retailer Best Buy Co Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=BBY.N\" data-type=\"ric\" data-ric=\"BBY.N\" translate=\"no\" dir=\"ltr\">BBY.N</a>. AWS has long sought rivals as its marquee clients, such as Netflix Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=NFLX.O\" data-type=\"ric\" data-ric=\"NFLX.O\" translate=\"no\" dir=\"ltr\">NFLX.O</a>, to show it is a trustworthy partner and not scooping up competitors' data.</p><p>Microsoft Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MSFT.O\" data-type=\"ric\" data-ric=\"MSFT.O\" translate=\"no\" dir=\"ltr\">MSFT.O</a> and Alphabet Inc's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a> Google recently forecast a positive outlook or results for their cloud businesses as well, though research firm Canalys said AWS stayed ahead. It won 33% of cloud infrastructure spend worldwide in the fourth quarter, versus 22% for Microsoft and 9% for Google. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2U548J\" data-type=\"storyId\" data-story-id=\"nL4N2U548J\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span><span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2UC2XY\" data-type=\"storyId\" data-story-id=\"nL4N2UC2XY\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Amazon also broke out ad revenue for the first time, reporting a 32% increase to $9.7 billion for the fourth quarter. That's bigger than the ad sales Alphabet's YouTube reported for the same period.</p><p>An Amazon official told reporters that the ability of brands to reach consumers across its ad properties was \"largely unchanged\" after Apple Inc's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a> privacy tweaks to its operating system.</p><p>The changes made it more difficult for brands to target and measure ads on Instagram and Facebook, for instance, causing parent Meta Platforms Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a> to anticipate <a href=\"https://www.reuters.com/technology/facebook-owner-meta-forecasts-q1-revenue-below-estimates-2022-02-02\" data-type=\"url\" class=\"tr-link\" translate=\"no\">around a $10 billion hit</a> this year and sending its shares down 26% Thursday.</p><p>Still, Amazon forecast first-quarter sales below Wall Street estimates, projecting between $112 billion and $117 billion, or to grow between 3% and 8%.</p><p>Analysts were expecting about $120 billion, according to IBES data from Refinitiv.</p><p><br/></p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Jeffrey Dastin in San Francisco and Nivedita Balu in Bengaluru; Additional reporting by Arathy Somasekhar; Editing by Anil D'Silva and Lisa Shumaker)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Nivedita.Balu@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Nivedita.Balu@thomsonreuters.com</a> ; Twitter: <a href=\"https://twitter.com/niveditabalu\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/niveditabalu</a>; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-RESULTS/ (UPDATE 7, PIX, TV, GRAPHIC)</p></div>"}