{"date": "2021-12-09 11:21:27.370000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.29, "close": 3483.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>MILAN (AP) — Italy's anti-trust authority on Thursday fined Amazon 1.13 billion euros ($1.3 billion), accusing the company of exploiting its dominant position against independent sellers on its website in violation of European Union competition rules.</p><p>The fine is one of the largest leveraged in Europe against the online retail giant, which expanded in particular in Italy during a coronavirus lockdown that prevented residents from going to stores to buy items considered nonessential.</p></div><div class=\"tr-npp-body\"><p>Europe has pioneered efforts to rein in big tech companies, most famously by slapping Google with multibillion-dollar fines in three antitrust cases. The push is gaining steam worldwide as regulators and lawmakers take on digital giants over accusations of everything from stifling competition to failing to prevent harmful content from appearing on their platforms.</p><p>Amazon said it \"strongly disagreed\" with Italian regulator's decision and would appeal, calling the fines and proposed remedies \"unjustified and disproportionate.\" It noted that more than half of annual sales in Italy are from small and medium businesses that have access to other channels to sell their goods.</p><p>Italy's AGCM authority said Amazon has required that third-party sellers use its own logistics service, called Fulfilment by Amazon, harming competitors and strengthening its own position.</p><p>The e-commerce giant also prevents third-party sellers from gaining access to Amazon's Prime loyalty program, \"which makes it easier to sell to the more than 7 million most-loyal and highest-spending consumers.\"</p><p>That means such sellers also are excluded from special events, including Black Friday, Cyber Monday and Prime Day offers, thereby also decreasing the chances that the sellers' items will appear as a \"featured offer.\"</p><p>\"The investigation showed that such benefits are crucial to gain visibility, to boost sales and, in turn, to the success of the sellers' offers on Amazon.it,'' the regulator said.</p><p>The authority has ordered Amazon to grant sales benefits and visibility on Amazon.it to all third-party sellers able to meet the standards of its Prime service, which it must publish.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.</p></div>"}