{"date": "2021-11-02 15:41:10.715000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SCOUTCAM INC (\"SCTC-0\")\n- Rounds Out Management Team with Appointments of Arik Priel\n- as Chief SW Architect and Roee Peled as VP Business Development\n\n   ScoutCam, a leading provider of turnkey I4.0 visualization solutions,\ncomposed of field proven highly resilient image acquisition unit, data\ncollection and storage with dedicated AI capabilities, today announced the\nadditions of Arik Priel as the Company's new Chief SW Architect and Roee\nPeled as the Company's new Vice President of Business Development.\n\n   Arik brings over 20 years of experience in leading multidisciplinary R&amp;D\nand engineering teams in defining and navigating product development from\nconcept to deployment, with a focus on cloud-based architectures and\nAI-based technologies.\n\n   Prior to joining ScoutCam, Arik held several senior technology\npositions, most recently as CTO of Octopol, where he combined state of the\nart AI models together with cutting edge software technology. Prior to\nOctopol, Arik served as Director of Technology at Green &amp; Gold Analytics,\nwhere he established partnerships with Microsoft and Amazon Web Services.\nArik also previously served as VP R&amp;D and established the Israeli\ninnovation center of Landesk (currently named Ivanti). Arik earned both his\nBSc in Computer Science and Economics and MBA from Bar-Ilan University.\n\n   Roee Peled is a proven business development and sales executive,\nspecializing in identifying and opening new sectors and geographic markets\nin the IoT, 3D/LiDAR, Cybersecurity and Machine/Deep Learning industries.\nHe has overseen transactions in multi-disciplined and complex B2B sales\nprocesses (SaaS/Capex-Opex) and has deep technical knowledge in hardware\nand software.\n\n   Prior to joining ScoutCam, Roee held senior business development and\nsales positions with PointGrab, imVision Mantis Vision and Orckit Systems,\nand comAbility Ltd. He earned his BSc in Electrical Engineering from\nTel-Aviv University and an MBA from Bar Ilan University.\n\n   \"ScoutCam develops novel, state-of-the-art products in the I4.0 domain -\nfocusing on Condition Based Monitoring (CBM) and Predictive Maintenance\n(PdM) for a variety of sectors (Aviation, Energy and Automotive), and as we\ncontinue to advance our visualization solutions, the universe of potential\napplications expands. To strengthen our leadership position in the market\nit's important that we assemble a team with the experience and expertise to\nnot only meet that demand but recognize new areas worth pursuing. The\naddition of Arik to our team in a leadership role will strengthen our\nability to innovate for Industry 4.0. Arik's role will be to help build and\ntransform ScoutCam's products to be more software based, while Roee's focus\nwill be introducing our solutions to new customers within our existing\nmarkets as well as identifying applications in new sectors, and in addition\nassisting in pivoting ScoutCam's business model to a recurring revenue\nmodel,\" said Yovav Sameah, Chief Executive Officer of ScoutCam.\n\n   About ScoutCam\n\n   ScoutCam is a leading provider of image-based platforms. Pioneering the\nuse of its proprietary visualization technology, ScoutCam offers\nstate-of-the-art solutions across a variety of Predictive Maintenance and\nCondition Based Monitoring markets, thus paving the way for the energy,\nautomotive and aviation industries. ScoutCam's solutions are based on small\nand highly resilient cameras, specialized AI analysis and supplementary\ntechnologies.\n\n   Cautionary Note Regarding Forward-Looking Statements\n\n   Information set forth in this news release contains forward-looking\nstatements that are based on the Company's expectations, beliefs,\nassumptions and intentions regarding, among other things, its\nproduct-development efforts, business, financial condition, results of\noperations, strategies or prospects, as of the date of this news release.\nThey are not guarantees of future performance. Forward-looking statements\ncan be identified by the use of forward-looking words such as \"believe,\"\n\"expect,\" \"intend,\" \"plan,\" \"may,\" \"should\" or \"anticipate\" or their\nnegatives or other variations of these words or other comparable words or\nby the fact that these statements do not relate strictly to historical or\ncurrent matters. The Company cautions that all forward-looking statements\nare inherently uncertain and that actual performance may be affected by a\nnumber of material factors, many of which are beyond the Company's control.\nSuch factors include, among other things, our ability to maximize the\neconomic potential and monetize the technology covered in the press\nrelease; the material and positive effect of the appointments of Mr. Arik\nPriel and Mr. Roee Peled will have on our business and operations,\nincluding our ability to innovate and better penetrate the Industry 4.0\nsector, and our ability to identify new markets and successfully implement\na recurring revenue business model; the Company's ability to effectively\nmaximize the skills and contributions of Mr. Arik Priel and Mr. Roee Peled;\nthe ability of each of Mr. Arik Priel and Mr. Roee Peled to help the\nCompany secure opportunities in the sectors described in this news release;\nrisks and uncertainties relating to our reliance on third-party suppliers;\nmarket acceptance of our products by prospect markets and industries; our\nability to raise sufficient funding in order to meet our business and\nfinancial goals; and certain other factors summarized in our filings with\nthe Securities and Exchange Commission. Accordingly, actual and future\nevents, conditions and results may differ materially from the estimates,\nbeliefs, intentions and expectations expressed or implied in the forward\nlooking information. Except as required under applicable securities\nlegislation, the Company undertakes no obligation to publicly update or\nrevise forward-looking information.\n\n   For more information, please visit <a href=\"https://www.scoutcam.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.scoutcam.com</a>.\n\nWWW   : <a href=\"https://www.scoutcam.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.scoutcam.com</a>    SCOUTCAM INC\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2130500750.MNPRE2130502824-08222020211102</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}