{"date": "2022-01-07 17:54:53+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3265.08, "close": 3229.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><span>\n              <p>By Stephen Lacey</p>\n              <p>NEW YORK, Jan 7 (IFR) - <b>Credo Technology</b>, a networking equipment maker with a Chinese subsidiary, filed a US$100m placeholder this week for a Nasdaq IPO that would allow insiders to cash out a portion of their holdings as well as raise new money to help grow the business.</p>\n              <p>\n                <span>Goldman Sachs </span>and <span>Bank of America</span> head a syndicate of eight banks mandated to lead the Credo IPO.</p>\n              <p>The filing comes as Chinese regulators clamp down on listings by domestic companies on foreign stock exchanges, a risk Credo acknowledges though it believes the US listing will not require approval by Chinese regulators.</p>\n              <p>Credo also has not received any “inquiry, notice, warning, sanctions or regulatory objection to this offering from CSRC (China Securities Regulatory Commission) or PRC governmental authorities”, the company outlines in the IPO filing.</p>\n              <p>There are, however, “no assurances” that Chinese authorities will agree with “our interpretation”, the filing states.</p>\n              <p>Credo is structured as a holding company based in the Cayman Islands rather than a special purpose vehicle that indirectly holds interests in a Chinese company. This represents a subtle legal twist and one whose merits may be debated as Credo gets closer to its US listing.</p>\n              <p>Credo also disclosed that it issued 4.1m warrants to a subsidiary of Amazon, described as a customer warrant, that would result in gross aggregate proceeds of US$201m if exercised. The Amazon agreement was signed on December 28.</p>\n              <p>Credo both makes and holds IP licences to networking gear. A growing amount of its business is coming from sales of owned products.</p>\n              <p>In the six months ended October 31, Credo generated revenue of US$37.2m, compared to US$25.5m in the comparable year-ago period. It posted a net loss of US$16.7m in the first six months of fiscal 2022.</p>\n              <p>Credo is careful to delineate ties to China. In the fiscal year ended April 30, it generated just 0.3% of revenue in mainland China. Mainland China is home to 14% of \"long lived assets\".</p>\n              <p>The holding company structure, with operating subsidiaries in the US, China and Hong Kong, is a novel approach to a festering problem.</p>\n              <p>(Stephen Lacey)</p>\n              <p>((stephen.lacey@refinitiv.com; 646-337-7349))</p>\n            </span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © Refinitiv 2022. Click For Restrictions - https://www.refinitiv.com/en/policies/copyright-notice</p></div>"}