{"date": "2021-11-23 12:31:43.593000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p></p><pre>    ROME (AP) ? Italy's antitrust watchdog has fined Apple \nand Amazon a total of more than 200 million euros ($225 million) \nfor cooperating to restrict competition in the sale of Apple \nand Beats branded products in violation of European Union rules. \n    An investigation found that provisions in a 2018 agreement between \nthe U.S. tech giants limited access to Italy's Amazon marketplace \nto selected resellers, the Italian Competition Authority said \nTuesday. \n    The watchdog slapped Apple with a 134.5 million euro ($151.32 \nmillion) fine and Amazon with a 68.7 million euro ($77.29 million) \npenalty. It also ordered them to end the restrictions and give \nresellers access in a \"non-discriminatory manner.\" \n    Both Apple and Amazon said they would appeal. \n    \"The proposed fine is disproportionate and unjustified,\" Amazon \nsaid. \"We reject the ICA's suggestion that Amazon benefits by \nexcluding sellers from our store, since our business model relies \non their success.\" \n    Apple said it respects the Italian Competition Authority \"but \nbelieve we have done nothing wrong.\" \n    Teaming up with selected resellers helps customer safety because \nit ensures products are genuine, Apple said. \n    \"Non-genuine products deliver an inferior experience and can \noften be dangerous,\" Apple said. \"To ensure our customers purchase \ngenuine products, we work closely with our reseller partners \nand have dedicated teams of experts around the world who work \nwith law enforcement, customs and merchants to ensure only genuine \nApple products are being sold.\" \n\n\n    Copyright ? 2021 Refinitiv and/or its affiliates. All \nrights reserved. The Refinitiv content received through this \nservice is the intellectual property of Refinitiv or its third \nparty suppliers. Republication or redistribution of content \nprovided by Refinitiv is expressly prohibited without the prior \nwritten consent of Refinitiv, except where permitted by the \nterms of the relevant Refinitiv service agreement. Neither \nRefinitiv nor its third party suppliers shall be liable for any \nerrors, omissions or delays in content, or for any actions taken \nin reliance thereon. Refinitiv and its logo are trademarks or \ntrademarks of the Refinitiv group of companies around the world. \n\n\n    </pre>\n\n<p></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) 2021 Refinitiv. All rights reserved.</p></div>"}