{"date": "2022-01-04 08:00:27.472000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">SEATTLE and COLOGNE, Germany, Jan. 4, 2022</p></div>\n\n<div class=\"xn-content\">\n\n<p>- 1NCE expands IoT platform on AWS infrastructure globally</p>\n<p>- Collaboration with AWS creates synergies reducing operating costs</p>\n<p>- Next Level IoT Software aims to embed connectivity into IoT applications</p>\n  <p><span class=\"xn-location\">SEATTLE</span> and <span class=\"xn-location\">COLOGNE, Germany</span>, <span class=\"xn-chron\">Jan. 4, 2022</span> /PRNewswire/ -- Global IoT Carrier 1NCE and Amazon Web Services (AWS) join forces pushing forward the expansion of 1NCEs IoT platform on a global scale, bringing its cloud native IoT offering closer to its customers worldwide. The collaboration further aims to strengthen ties between the two companies and to develop the Next Level IoT Software speeding up global deployment of IoT projects. </p>\n<p>1NCE has developed a unique software offering on AWS that enables IoT developers to quickly integrate cellular IoT connectivity into their own solutions with plug &amp; play functionalities. </p>\n<p>The collaboration allows for the expansion of the 1NCE IoT platform via AWS infrastructure globally, significantly increasing its overall platform performance. It will literally bring the 1NCE IoT platform closer to its customers, wherever they are. </p>\n<p>\"This intensified engagement with AWS also allows us to boost our network and IoT software portfolio at greatly improved conditions and with the appropriate know-how,\" added Younes Allaki, Chief Technology Officer (CTO) at 1NCE. \"We can leverage synergies between the AWS infrastructure and our IoT platform which helps us to develop our next Level IoT Software at low costs. This is a prerequisite to implement new features into our existing IoT Flat Rate offering, like protocol conversion, energy management and localization services.\"</p>\n<p>1NCE is a global IoT powerhouse funded by Softbank and the German Telecommunication giant Deutsche Telekom with direct access to its networks and roaming partners via 2G, 3G, 4G, LTE, NB-IoT and LTE-M in over 100 countries worldwide. 1NCE enables business customers to easily connect their IoT devices for <span class=\"xn-money\">10 US$</span> for 10 years. </p>\n<p>With its IoT Flat Rate offering 1NCE has proven to be a real disruptor within the IoT world, 1NCE is leveraging AWS to deliver reliable IoT services by combining secure connectivity with sophisticated software applications. </p>\n<p>Due to its close relationship with Deutsche Telekom and Amazon Web Services, 1NCE has obtained a leading position in costs and features counting more than 7,000 customers and 10 million managed connections to date. With \"1NCE For All\" customers can order up to 100 SIM cards for free exclusively at AWS Marketplace. 1NCE is showcasing its IoT services at this year's CES in <span class=\"xn-location\">LAS Vegas</span> from <span class=\"xn-chron\">January 5-7</span> at booth 10343.</p>\n<p><b>ABOUT 1NCE</b></p>\n<p>1NCE - the inventor of the \"IoT Flat Rate\" - is a global IoT platform carrier offering fast, secure, and reliable cellular connectivity and software services in more than 100 countries worldwide. 1NCE cooperates with Deutsche Telekom AG and its roaming partners to support all common mobile communication standards such as 2G, 3G, 4G, 5G, NB-IoT and LTE-M.</p>\n<p>The 1NCE IoT Flat Rate is designed to last over the entire lifetime of an IoT device with a one-off payment. This makes IoT applications for use cases like smart metering, asset tracking or vehicle telematics affordable and scalable. 1NCE also offers its technology to mobile platform operators as a Platform-as-a-Service solution. The company - headquartered in <span class=\"xn-location\">Cologne, Germany</span> - was founded in 2017 together with Deutsche Telekom AG and has 150 staff in <span class=\"xn-location\">Cologne</span>, <span class=\"xn-location\">Hamburg</span>, <span class=\"xn-location\">Amsterdam</span>, <span class=\"xn-location\">London</span>, <span class=\"xn-location\">Rome</span>, <span class=\"xn-location\">Paris</span>, <span class=\"xn-location\">Warsaw</span>, <span class=\"xn-location\">Hong Kong</span>, and <span class=\"xn-location\">Riga</span>. More at: <a href=\"http://www.1nce.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.1nce.com</a>.</p>\n<p><b>Media Contact:<br/></b><span class=\"xn-person\">Dennis Knake</span><br/>E-Mail: <a href=\"mailto:dennis.knake@1nce.com\" data-type=\"email\" translate=\"no\">dennis.knake@1nce.com</a><br/>Telephone: +49 151 627 776 43</p>\n</div>\n<div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 PR Newswire Association,LLC. All Rights Reserved.</p></div>"}