{"date": "2021-11-14 10:28:05+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3525.15, "close": 3540.7}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Aditya Kalra and Abhirup Roy</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW DELHI, Nov 14 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Independent directors at India's Future Retail have disclosed new documents in a letter to the country's antitrust watchdog aiming to bolster their case against Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> as they seek to revoke a 2019 deal between the two companies.</p><p>A 160-page stock exchange filing on Sunday showed the directors reviewed records related to the 2019 deal between a group unit, Future Coupons, and Amazon, and argued that disclosures by the U.S. company before the Competition Commission of India (CCI) when it sought approval of the deal contradicted Amazon's own internal communications at the time.</p><p>Amazon and the CCI did not respond to a request for comment on the disclosure on Sunday.</p><p>    The two companies' <a href=\"https://reut.rs/3BV0tJG\" data-type=\"url\" class=\"tr-link\" translate=\"no\">legal dispute</a>, centred around Amazon's deal to invest $200 million in Future Coupons, has become a high-stakes battle which could determine the dominant player in India's retail market in the years ahead.</p><p>Amazon has <a href=\"https://reut.rs/3H1WX48\" data-type=\"url\" class=\"tr-link\" translate=\"no\">successfully used the tie-up to block</a> Future's attempted sale of retail assets to rival Reliance <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RELI.NS\" data-type=\"ric\" data-ric=\"RELI.NS\" translate=\"no\" dir=\"ltr\">RELI.NS</a> for $3.4 billion, which the Indian company is banking on to help keep its business afloat.</p><p>According to the Sunday filing, Future's directors told the CCI in a Nov. 10 letter that Amazon's intentions were not to invest in Future Coupons because of its \"unique business model and strong growth potential\", as it stated while seeking approvals.</p><p>Rather, an internal email from an Amazon India executive to other senior Amazon executives, entitled \"Future Retail Limited Investment\", said the U.S. firm was using a \"'twin-entity investment' structure to invest in Future Retail\" due to Indian law restrictions. </p><p>\"The CCI has to revoke the approval granted for Amazon's investment,\" the letter from Future's independent directors stated.</p><p>Their filing is the latest salvo in an escalating legal battle.</p><p>In July, <a href=\"https://reut.rs/3HkZhmN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Reuters exclusively reported</a> that the CCI had reviewed a complaint from Future and then accused Amazon of concealing facts while seeking the 2019 deal approval, after the watchdog compared legal disclosures made by Amazon at several forums.</p><p>The company told Reuters at the time that it was confident of addressing the watchdog's concerns.</p><p>India's financial crime-fighting agency has also ordered Future - the country's second-largest retailer - to submit documents related to the 2019 Amazon deal as part of an investigation into possible breach of foreign investment laws, <a href=\"https://reut.rs/3kcTdD2\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Reuters reported last week</a>.</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Aditya Kalra in New Delhi and Abhirup Roy in Mumbai; Editing by Edmund Klamann)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:aditya.kalra@tr.com\" data-type=\"email\" translate=\"no\">aditya.kalra@tr.com</a> ; +91-11-49548021; Twitter <a href=\"https://twitter.com/adityakalra\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/adityakalra</a>; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON-INDIA/FUTURE (PIX)</p></div>"}