{"date": "2021-12-15 07:11:18.419000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 6467VmusicMagpie plc15 December 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>\n</span></p>\n<p>\n<span>15 December 2021</span>\n</p>\n<p>\n<span>musicMagpie plc</span>\n</p>\n<p>\n<span>(\"musicMagpie\", or \"the Group\")</span>\n</p>\n<p>\n<span>FULL YEAR PRE-CLOSE TRADING UPDATE</span>\n</p>\n<p>\n<span>Financial performance in line with management's expectations</span>\n</p>\n<p>\n<span>Strong progress delivered on strategic priorities of smartphone rental subscription service and SMARTDrop Kiosk roll-out</span>\n</p>\n<p>\n<span>musicMagpie, a leading re-commerce business in the UK and US specialising in refurbished consumer technology, is pleased to announce a pre-close trading update for the full year ended 30 November 2021.</span>\n</p>\n<p>\n<span>The Group's financial performance for the year is in line with management's expectations, with revenue of £145.2m and Adjusted EBITDA* of £12.2m.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Revenue in the Group's core consumer technology business in the UK was up 5.4% on the year. This culminated in a record Black Friday as consumers increasingly recognise musicMagpie as the smart, sustainable and trusted way to buy, rent and sell products such as smartphones, tablets, consoles and wearables. As set out in our interim results in July, revenues from the disc media (35% of total Group revenue) and books (6% of total Group revenue) divisions reverted to pre-pandemic levels in the second half of the year.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The smart phone rental subscription service, which provides customers with a more affordable and flexible option than an outright purchase or a pay-monthly contract with a mobile network, has made strong progress since its launch in October 2020. Its growing popularity with consumers means that, as at 30 November 2021, the service now has c.13,500 active paying subscribers, including our first cohort of subscription renewals. This has already made a positive contribution to Group margins in FY21 and, as noted in our half-year results, creates the potential to earn higher recurring revenues and EBITDA over the life of a device as opposed to a one-off sale.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The SMARTDrop kiosk offering, which launched in November 2020, is being successfully rolled out across the Asda network and will be in nearly 300 stores in 2022. So far, approximately 5,300 smartphones have been traded in through the kiosks, paying out over £1.5m to customers. The kiosks also form a key component of the wider sustainability partnership that the Group has recently launched with Asda, as announced in September 2021.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Steve Oliver, Chief Executive Officer of musicMagpie, said:</span>\n</p>\n<p>\n<span>\"We are pleased to have delivered a good performance in our first year as a listed company, in line with our expectations at the time of the IPO in April. The strong progress being made by our SMARTDrop Kiosks and our corporate recycling programme is enabling our strategic priority to \"buy more, sell more, rent more\", and we are also especially pleased by the consumer reaction to our phone rental subscription offer which is gaining good momentum. As a result, we are confident in our prospects for the new financial year.\"</span>\n</p>\n<p>\n<span>Notes</span>\n</p>\n<p>\n<span>*Adjusted EBITDA is a non-GAAP measure and has been calculated as earnings before interest, taxation, depreciation, amortisation and non-underlying items.</span>\n</p>\n<p>Enquiries</p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>musicMagpie plc</span>\n</p>\n<p>\n<span>Steve Oliver, CEO</span>\n</p>\n<p>\n<span>Ian Storey, COO</span>\n</p>\n</td>\n<td>\n<p>\n<span>Tel: +44 (0) 870 479 2705</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Peel Hunt (Nominated Adviser and Joint Broker)</span>\n</p>\n<p>\n<span>Edward Knight</span>\n</p>\n<p>\n<span>Paul Gillam</span>\n</p>\n<p>\n<span>Tom Ballard</span>\n</p>\n</td>\n<td>\n<p>\n<span>Tel: +44 (0) 20 7418 8900</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Shore Capital (Joint Broker)</span>\n</p>\n<p>\n<span>Malachy McEntyre</span>\n</p>\n<p>\n<span>Mark Percy</span>\n</p>\n<p>\n<span>Daniel Bush</span>\n</p>\n<p>\n<span>John More</span>\n</p>\n</td>\n<td>\n<p>\n<span>Tel: +44 (0) 20 7408 4090</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Powerscourt (Financial Public Relations)</span>\n</p>\n<p>\n<span>Rob Greening</span>\n</p>\n<p>\n<span>Genevieve Ryan</span>\n</p>\n<p>\n<span>Sam Austrums</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>Tel: +44 (0) 20 7250 1446</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Notes to Editors</span>\n</p>\n<p>\n<span>musicMagpie is a leader in the re-commerce of consumer technology (including smartphones, tablets, consoles and wearables), disk media (including CDs, DVDs and games) and books, with sustainability running to the very heart of its operations.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Founded in 2007, the Group has an established presence in the UK, with operations in Stockport, Greater Manchester, and in the US in Atlanta, Georgia. Operating through its two trusted brands - musicMagpie in the UK and Decluttr in the US, the Group's core business model is simple: to provide consumers with a smart, trusted and sustainable way to buy, rent and sell refurbished consumer technology and physical media products.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>It has a strong environmental and social focus, as demonstrated by its trademarked 'smart for you, smart for the planet' ethos. Over 400,000 consumer technology products were resold to consumers in the year ended 30 November 2021 by the Group. In addition, the Directors estimate that the Group re-sells approximately 2,500 tonnes of books and disc media each year that could have ended up as waste. As a result, the Company has received the London Stock Exchange's Green Economy Mark, which recognises companies that derive 50 per cent. or more of their total annual revenue from products and services that contribute to the global 'Green Economy'.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>When selling to musicMagpie, the customer is offered a fixed valuation via the website, provided with free logistics to ship the products and (subject to it being 'as described') receives payment for their product on the day of arrival at the Group's warehouse.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Customers purchasing from musicMagpie receive branded refurbished product for a fraction of the price of buying new. All consumer technology products sold by the Group are sold with a free 12-month warranty.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The Group has the highest number of seller reviews on both Amazon and eBay and has consistently achieved extremely positive feedback scores. The Group also has a 4.6* rating on UK Trustpilot with over 200,000 reviews.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>For further information please visit:</span>\n<a href=\"http://www.musicmagpieplc.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.musicmagpieplc.com/</a>\n</p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>MSCTIBFTMTIBBTB</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}