{"date": "2021-11-26 06:05:35.977000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3580.41, "close": 3561.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Police were called to remove union safety inspectors from an Amazon Flex delivery centre in Sydney's northwest after the company says they \"did not meet relevant entry requirements\".</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>The Transport Workers Union says its officials were let in to the facility to investigate \"suspected serious safety breaches\" on Friday morning, only to have management call police.</p>\n<p>They say police allowed inspections to continue because they had legal right of entry documentation.</p>\n<p>TWU national secretary Michael Kaine says it was a \"disgrace\" that police were even called.</p>\n<p>\"On Black Friday of all days – a day when transport workers are dealing with extraordinary pressure – Amazon's confirmed what we've always known: raking in deadly profit is more important to them than keeping workers safe,\" Mr Kaine says.</p>\n<p>The company's \"anti-worker pattern of behaviour\" makes the roads less safe for workers and the community.</p>\n<p>\"Transport workers deserve a federal body to urgently lift safety standards and haul these behemoths into line,\" Mr Kaine says.</p>\n<p>The TWU says its inspectors watched cars being overloaded with parcels, blocking mirror vision and creating blind spots for drivers.</p>\n<p>Amazon public relations manager Jessica Makin told AAP the company allowed \"one union official who followed right of entry requirements\" into the Bella Vista site this morning but says two others \"did not meet relevant entry requirements\" and then refused to leave.</p>\n<p>\"We take the safety of drivers very seriously and we don't want anyone driving on the road with their view obscured,\" Ms Makin says.</p>\n<p>\"There are no penalties where a delivery partner has raised concerns leading to packages being removed for that block.\"</p>\n<p>Drivers \"concerned that packages obscure their view\" can ask delivery station staff to help repack their vehicle or remove as many as required \"to ensure the driver has visibility and can drive safely\".</p>\n<p>Ms Makin says they can also \"decline to take the block they've been allocated\".</p>\n<p>Amazon commercial services public policy director for Australia and New Zealand Michael Cooley told a federal Senate inquiry on job security in June the drivers are \"not workers, they're independent contractors\".</p>\n<p>They drive their own cars and have to buy their own insurance but Amazon \"match the cover that they have\".</p>\n<p>He said the drivers are paid in four-hour blocks rather than hourly wages.</p>\n<p>Each block pays $108, but the independent contractors have until 10pm at night to finish their deliveries regardless of when they start, and Mr Cooley said \"90 per cent of drivers will complete the deliveries... before the four hours is complete\".</p>\n<p>Mr Cooley said he was \"not aware\" of police being called on union inspectors on two separate occasions when asked by the Senate committee's chair Tony Sheldon, and did not know whether distribution centre staff would be permitted to call police without first checking with the corporate office in Australia.</p>\n<p>\"Unions are welcome to enter our sites in accordance with their legal entitlements in Australia, which they exercise on a regular basis,\" Mr Cooley told the inquiry.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Australian Associated Press</p></div>"}