{"date": "2021-01-29 09:22:25+00:00", "ticker": "AAF", "mrkt_info": {"open": 80.0, "close": 79.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Jan. 29 -- Bharti Airtel Ltd's Africa unit on Friday reported a 13.1% year-on-year (y-o-y) increase in net profit to $116 million in the quarter ended December, driven by growth in key metrics such as average revenue per user. The telecom operator had posted a net profit of $88 million during July-September quarter.</p><p>The telco's revenue grew 17.2% y-o-y on a reported basis, and 22.8% in constant currency, to $1,034 million in October-December, buoyed by growth across voice, data and mobile money segments in key markets such as Nigeria, East Africa and Francophone Africa.</p></div><div class=\"tr-npp-body\"><p>The total customer base expanded 11% to 118.9 million and average revenue per user (Arpu) rose to $2.9 in the December quarter, registering a growth of 9.3% in constant currency, the company said in a statement.</p><p>Airtel Africa's mobile data customer base increased 23.5% y-o-y and that of mobile money services rose 29%. The company added 2.5 million customers in Q3 FY21.</p><p>The company's mobile money revenue jumped 34% y-o-y to 110 million on a reported basis. Data revenue rose 20.8% from a year ago to $294 million during the December quarter.</p><p>\"The opportunities for sustainable profitable growth from our under-penetrated markets for both mobile and mobile money services remain hugely attractive, and we are confident of continuing to deliver on our growth strategy,\" said Raghunath Mandava, chief executive, Airtel Africa.</p><p>Despite the introduction of additional customer registration norms in Nigeria mid-December, which curbed signing up new subscribers by all operators in the country, Airtel Africa's user base grew, said Mandava.</p><p>He said the telco is closely working with the Nigerian government to ensure that all its subscribers provide valid National Identification Numbers (Nins) and update their SIM card registration records to minimise disruption.</p><p>\"Regionally, the continued strong revenue growth in Nigeria and East Africa, growing 21.6% and 23.4% in constant currency, is increasingly being matched by improvements across Francophone Africa, posting 8% growth for April-December and 15% in Q3,\" Mandava said.</p><p>The company's expansion into rural markets, along with robust customer addition, helped voice revenue grow 11.8%, while data and mobile money clocked over a 30% rise, he added.</p><p>The covid-led disruptions had little impact on Airtel Africa's business in the December quarter, said Mandava, adding that, \"we remain vigilant about the recent news flow around new strains of the virus and further actions by governments to minimise contagion in our countries of operation\".</p><p>The company's earnings before interest tax depreciation and amortisation (Ebitda) grew 21.7% y-o-y to $485 million in October-December, with constant currency growth of 28.3% Ebitda margin at 46.9% improved by 200 basis points in constant currency during the quarter.</p><p>The company's capex rose 25.1% on-year to $188 million in the December quarter. It has a capex target of $625-650 million for this fiscal year given the covid-19 situation improves.</p><p>Airtel Africa is the holding firm for Bharti Airtel's operations in 14 countries, with Nigeria alone accounting for almost half of its Ebitda. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}