{"date": "2021-11-19 02:32:42.416000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3549.0, "close": 3676.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>As a small business owner herself, Sophia Bush knows the importance of giving back to lesser-known businesses during the holiday season. Which is why, this year, Sophia has teamed up with Amazon Launchpad to show her support for small businesses when shopping for holiday gifts. </p></div><div class=\"tr-npp-body\"><p>\"As a female entrepreneur, I know how much exposure does for a small business. I'm excited to be teaming up with Amazon Launchpad in support of these amazing small brands,\" says Sophia.</p><p><span><span>Tackle your holiday shopping with deals and expert advice delivered straight to your phone.</span> Sign up for text message alerts from the deal-hunting team at Reviewed.</span> </p><p>Amazon Launchpad features a number of small-business-owned products with cult followings—like a dipping sauce car holder with 14,000 reviews and a water bottle that reminds you to drink. Sophia's gift guide showcases her go-to innovative products created by entrepreneurs and small businesses, featuring some of her \"long-time favorite products\" and \"new finds too.\" </p><p>So whether you want to treat yourself to a portable pizza oven or find the perfect gift for your furry friend, here are the eight can't-miss holiday gifts from Sophia Bush's Amazon Launchpad store. </p><p class=\"tr-npp-section-title\">1. A vinyl turntable</p><p>One of the best holiday gifts you can give is this vintage turntable; with a protective cover and easy-to-control multiple control panels, it's perfect for listening to your favorite records. According to reviewers, it not only sounds great, but it looks great too. Nearly 6,000 reviewers give it 4.3 stars on Amazon.</p><p><span>Get the WOCKODER Store Turntable Vinyl Record Player from Amazon for $62.99</span> </p><p class=\"tr-npp-section-title\">2. An insulated whiskey glass</p><p>Keep your hands warm and glass cold with the help of this best-selling holiday gift—an insulated whiskey glass. This whiskey glass features an insulated second layer on its outside that makes a world of difference. Available in 11 different variations, you can opt for a single glass or paired offering, depending on your specific needs, but either way, over 1,500 reviewers are calling it their \"lifetime drinking glass.\" </p><p><span>Get the Asobu Insulated Whiskey Glass and Stainless Steel Sleeve from Amazon starting at $23.99</span> </p><p class=\"tr-npp-section-title\">3. A shower speaker </p><p>Designed with a stronger, more robust sound, this compact BlueTooth speaker gets the seal of approval from nearly 17,000 reviewers. Perfect for showers or pools, this speaker provides up to 10 hours of use and takes only three hours to re-charge. Deemed \"a must-buy\" by a handful of reviewers, this device seamlessly hooks up to any Wi-Fi-compatible smartphone or device. </p><p><span>Get the iFox iF012 Bluetooth Shower Speaker from Amazon for $34.90</span> </p><p class=\"tr-npp-section-title\">4. A Bluetooth meat thermometer </p><p>With over 15,000 reviews, it's not hard to understand why this meat thermometer is on Sophia Bush's holiday gift guide. This wireless thermometer can reach 165-feet and comes equipped with two sensors and one meat probe, and easily hooks up to any smartphone. One reviewer claims this thermometer \"literally changed [her] life,\" while another adds, the meat app (on her smartphone) is a gamechanger.</p><p><span>Get the MEATER Plus | Smart Meat Thermometer with Bluetooth from Amazon for $99.95</span> </p><p class=\"tr-npp-section-title\">5. A coffee grinder</p><p>Master mornings with the help of this manual coffee grinder that provides 18 settings that provide complete control and precision over the coarseness of your coffee. A staple in over 19,000 reviewers' kitchen armory, so many love how \"great [the machine] it is for travel\" and how noticeably different their coffee and espresso tastes. </p><p><span>Get the JavaPresse Manual Coffee Grinder with Adjustable Settings from Amazon for $39.99</span> </p><p class=\"tr-npp-section-title\">6. A savory sweet sauce</p><p>Liven up dishes with the help of this 100% all-natural Fly by Jing sauce. Sourced from the heart of Sichuan, this sauce features soybean oil, soy sauce, dried chili peppers and brown sugar and boxed in a single six-ounce jar or a double pack. Deemed a newfound \"staple\" in kitchens, over 2,700 reviewers raved over this sweet and savory sauce's jam-packed flavors, which \"elevate\" everything from dumplings to noodles. </p><p><span>Get the FLY BY JING Zhong Sauce from Amazon for $17.98</span> </p><p class=\"tr-npp-section-title\">7. An outdoor pizza oven</p><p>This season, reach for this portable outdoor pizza oven that will gather loved ones and friends regularly. Featuring a built-in thermometer, this portable oven claims to heat up to 932-degrees in just 60 seconds, creating the ideal balance among a thin base and perfect puffed-up pie. Factor in the 5-star rating and reviewers praising this \"the best pizza oven,\" we're confident this is the best holiday gift to invest in this season. </p><p><span>Get the ROCCBOX Gozney Portable Outdoor Pizza Oven from Amazon for $499</span> </p><p class=\"tr-npp-section-title\">8. A holiday gift for your pet</p><p>Naturally, we saved the best holiday gift from Sophia's list for last: a gift for your furry friend. This bone-shaped gaming device stimulates cats and dogs, hooks up to your smartphone, and is suitable for indoor and outdoor play. With 12 built-in emotionally driven systems (including teasing and chasing), it's no wonder reviewers say their \"puppy loves this thing.\" </p><p><span>Get the Wickedbone Smart Bone from Amazon for $69.99</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Sophia Bush unveils her top 8 holiday gifts from Amazon Launchpad</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}