{"date": "2021-12-23 01:30:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.34, "close": 3421.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Repeats DEC. 22 story. No change to text.</p><ul class=\"bulleted-list arrowlist\"><li class=\"tr-summaryitem\">Amazon facing scrutiny of 2019 deal with India's Future</li><li class=\"tr-summaryitem\">U.S. firm sues Indian agency investigating deal - filing</li><li class=\"tr-summaryitem\">Amazon says investigation is 'fishing and roving' inquiry</li></ul><p class=\"tr-by\">By Aditya Kalra and Abhirup Roy</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW DELHI, Dec 23 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> is taking India's financial crime fighting agency to court, seeking to quash an investigation into one of its 2019 deals, a court filing seen by Reuters shows. </p><p>India's Enforcement Directorate (ED) has for months <a href=\"https://reut.rs/3qkUZnM\" data-type=\"url\" class=\"tr-link\" translate=\"no\">been probing</a> Amazon's $200 million investment in India's Future Group for suspected violations of foreign investment laws. </p><p>The investment is at the centre of protracted legal battles, as Amazon has used the terms of that deal - and cited contract breaches by Future - <a href=\"https://reut.rs/2JcHaGd\" data-type=\"url\" class=\"tr-link\" translate=\"no\">to stall</a> the $3.4 billion sale of the Indian company's retail assets to a rival.</p><p>In an 816-page filing, seen by Reuters, Amazon calls the investigation a \"fishing and roving\" inquiry, saying the ED had sought privileged legal advice and opinions from Amazon and other information not connected to the Future Group deal.</p><p>Multiple Amazon executives, including its India head, had been summoned by the ED in recent weeks and the investigation had caused \"unnecessary harassment,\" the U.S. e-commerce giant said in its filing to the Delhi High Court on Dec. 21. </p><p>\"The directions by the ED asking for disclosure of legally privileged documents and litigation privilege information is derogatory of the principles\" laid out in Indian constitution, Amazon said in the filing, which is not public.</p><p>\"The investigation is a fishing and roving exercise.\"</p><p>Amazon and the ED, which does not make details of its investigations public, did not immediately respond to requests for comment. The case will likely be heard on Thursday. </p><p>The filing is the latest twist in the long-running dispute between Amazon and Future. Though India's antitrust body <a href=\"https://reut.rs/3GIXGX0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">suspended</a> their 2019 deal last week, saying Amazon had suppressed information when seeking approvals for it, the ED's probe is independent of that.</p><p>The dispute centres around three commercial agreements signed between Future and Amazon entities, which a Singapore arbitration panel - also hearing the dispute - has said must be read together when reviewing the transaction.</p><p>Future contends conflating the commercial agreements would effectively mean the deal violated Indian law.</p><p>Amazon's court filing contained a notice from the ED dated Feb. 19 which sought details of its investment in Future, including copies of agreements, bank account details and other related internal communication.</p><p>It also showed the ED is conducting a far wider probe, and had sought details of big vendors on Amazon's e-commerce website in India, including sales numbers for those that account for more than 5% of total sales on Amazon.in.</p><p>The notice came after a February <a href=\"http://reut.rs/2OCOT2W\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Reuters investigation which found</a> Amazon helped a small number of sellers prosper on its Indian platform, giving them discounted fees and using them to bypass foreign investment laws.</p><p>Amazon said at the time it was confident it complied with regulations and that it \"does not give preferential treatment to any seller on its marketplace.\"</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Aditya Kalra in New Delhi<br/>Editing by Mark Potter)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:aditya.kalra@tr.com\" data-type=\"email\" translate=\"no\">aditya.kalra@tr.com</a> ; +91-11-49548021; Twitter <a href=\"https://twitter.com/adityakalra\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/adityakalra</a>; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON-INDIA/FUTURE (REPEAT, PIX)</p></div>"}