{"date": "2022-01-21 14:41:57.278000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3125.98, "close": 2852.86}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NEXTECH AR SOLUTIONS CORP (\"NTAR-Z;NEXCF-0\")\n- CAD$10 Million Private Placement with Institutional Investor\n\n    Nextech AR Solutions Corp. (\"Nextech\" or the \"Company\"), a diversified\nleading provider of augmented reality (\"AR\") experience technologies and\nservices, is pleased to announce that it has entered into a securities\npurchase agreement for a private placement of its common shares (\"Common\nShares\") and warrants to purchase Common Shares (\"Warrants\") with a single\ninstitutional investor for gross proceeds of approximately CAD$10 million\n(the \"Private Placement\"). Pursuant to the Private Placement, the Company\nwill issue 8,130,082 Common Shares and Warrants to purchase up to an\naggregate of 8,130,082 Common Shares at a purchase price of CAD$1.23 per\nCommon Share and associated Warrant. Each Warrant will entitle the holder\nto purchase one Common Share at an exercise price of CAD$1.54 per Common\nShare for a period of three years following the issuance date.\n\n    H.C. Wainwright &amp; Co. is acting as the exclusive placement agent for\nthe Private Placement.\n\n    The net proceeds of the Private Placement will be used by the Company\nfor working capital and general corporate purposes. No securities were\noffered or sold to Canadian residents in connection with the Private\nPlacement. The Private Placement is expected to close on or about January\n25, 2022, subject to satisfaction of customary closing conditions.\n\n    This news release shall not constitute an offer to sell or the\nsolicitation of an offer to buy any securities, nor shall there be any sale\nof the securities in any jurisdiction in which such offer, solicitation or\nsale would be unlawful prior to registration or qualification under the\nsecurities laws of any such jurisdiction. The securities referred in this\nnews release have not been, nor will they be, registered under the United\nStates Securities Act of 1933, as amended, (the \"U.S. Securities Act\"), or\nany U.S. state securities laws, and such securities may not be offered or\nsold within the United States or to any U.S. person absent registration\nunder U.S. federal and state securities laws or an applicable exemption\nfrom such U.S. registration requirements. \"United States\" and \"U.S. person\"\nhave the respective meanings ascribed to them in Regulation S under the\nU.S. Securities Act.\n\n    NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION IN\nTHE UNITED STATES\n\n    To learn more, please follow us on Twitter, YouTube, Instagram,\nLinkedIn, and Facebook, or visit our website: <a href=\"https://www.Nextechar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.Nextechar.com</a>.\n\n    About Nextech AR\n\n    Nextech develops and operates augmented reality (\"AR\") platforms that\ntransports three-dimensional product visualizations, human holograms and\n360 portals to its audiences altering e-commerce, digital advertising,\nhybrid virtual events (events held in a digital format blended with\nin-person attendance) and learning and training experiences. Nextech\nfocuses on developing AR solutions however most of the Company's revenues\nare derived from three e-Commerce platforms: vacuumcleanermarket.com\n(\"VCM\"), infinitepetlife.com and Trulyfesupplements.com. VCM and product\nsales of residential vacuums, supplies and parts, and small home appliances\nwhich are sold on Amazon.\n\n    Forward-looking Statements\n\n    This press release contains \"forward-looking information\" and may also\ncontain statements that may constitute \"forward-looking statements\",\ncollectively \"forward-looking information\", within the meaning of\napplicable Canadian securities legislation. Such forward-looking\ninformation is not representative of historical facts or information or\ncurrent condition, but instead represent the beliefs and expectations\nregarding future events about the business and the industry and markets in\nwhich the Company operates, as well as plans or objectives of management,\nmany of which, by their nature, are inherently uncertain. Generally, such\nforward-looking information can be identified by the use of terminology\nsuch as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"budget\",\n\"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does\nnot anticipate\", or \"believes\", or variations of such words and phrases or\nmay contain statements that certain actions, events or results \"may\",\n\"could\", \"would\", \"might\" or \"will be taken\", \"will continue\", \"will occur\"\nor \"will be achieved\". Forward-looking information contained herein may\ninclude but is not limited to, references to the completion of the Private\nPlacement on the terms currently proposed or at all, any future\nacquisitions and the timing thereof and the use of proceeds of the Private\nPlacement. Factors that could cause actual results to differ materially\nfrom such forward-looking information include, but are not limited to,\ngeneral market conditions, availability of financing, regulatory approvals\nand the results of the Company's operations. Forward-looking information is\nnot a guarantee of future performance and involve risks, uncertainties and\nassumptions which are difficult to predict. Accordingly, readers should not\nplace undue reliance on forward-looking information, which are qualified in\ntheir entirety by this cautionary statement. The Company does not undertake\nany obligation to release publicly any revisions for updating any voluntary\nforward-looking information, except as required by applicable securities\nlaw.\n\n     Contact Information:\n\n     Lindsay Betts\n     investor.relations@nextechar.com\n     866-ARITIZE (274-8493) Ext 7201\n\n                            ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2202000153.MNPRE2202000643-06163720220121</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}