{"date": "2021-11-17 23:01:46+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\"><li class=\"tr-summaryitem\">Amazon says Visa charges too much</li><li class=\"tr-summaryitem\">Visa says it is still working to resolve dispute</li><li class=\"tr-summaryitem\">Amazon in talks with Mastercard, Amex about U.S. card</li><li class=\"tr-summaryitem\">Visa shares decline</li></ul><p class=\"tr-advisory\">Recasts with U.S. co-branded card in first sentence, adds Visa declining to comment on U.S. credit card</p><p class=\"tr-by\">By Matt Scuffham</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Nov 17 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> is considering dropping Visa <a href=\"reuters://REALTIME/Verb=FullQuote/ric=V.N\" data-type=\"ric\" data-ric=\"V.N\" translate=\"no\" dir=\"ltr\">V.N</a> as partner on its U.S. co-branded credit card after earlier confirming it would stop accepting Visa credit cards in the United Kingdom as a dispute over payments intensified.</p><p>The e-commerce giant is in talks with several payment networks including Mastercard Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MA.N\" data-type=\"ric\" data-ric=\"MA.N\" translate=\"no\" dir=\"ltr\">MA.N</a>, American Express Co <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AXP.N\" data-type=\"ric\" data-ric=\"AXP.N\" translate=\"no\" dir=\"ltr\">AXP.N</a> and Visa as part of what it called its standard process for reviewing its co-branded credit card agreement, a spokesperson said.</p><p>Visa declined to comment on the co-branded card. Mastercard and American Express did not respond to requests for comment.</p><p>Earlier, shares of Visa closed 4.7% lower after Amazon said it would stop taking payments from Visa credit cards in the UK from Jan. 19, 2022. In a statement, it said such charges should be \"going down over time with technological advancements, but instead they continue to stay high or even rise.\"</p><p>In recent months, Amazon has introduced surcharges on customers using Visa credit cards in Singapore and Australia, citing high fees, as the relationship between the two firms deteriorated.</p><p>Since Britain's exit from the European Union, an EU-enforced cap on fees charged by card issuers is no longer in place in the UK, meaning providers are free to hike charges. </p><p>Visa last month began charging 1.5% of the transaction value for credit card payments made online or over the phone between the UK and EU, and 1.15% for debit card transactions, up from 0.3% and 0.2%, respectively.</p><p>The average credit card processing fees across the industry range between 1.5% and 3.5% of each transaction, according to analysts.</p><p>Historically, retailers had accepted processing charges by major credit card firms as the cost of access to their huge network of card users, analysts said, but that could be changing.</p><p>The move marks an \"important turning point in the payments industry,\" said Laura Hoy, equity analyst at Hargreaves Lansdown, adding Amazon may hope to drive more customers to its own payments system.</p><p>\"Ultimately, we think Amazon has the edge in this game of chicken - whether customers adopt its own payment system or Visa gives in and lowers its fees, either is a win for the retail giant,\" Hoy said.</p><p>In the past, other big retailers have settled fee disputes with Visa after announcing they were going to quit taking Visa credit cards in narrow segments of their businesses.</p><p>Walmart Inc's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=WMT.N\" data-type=\"ric\" data-ric=\"WMT.N\" translate=\"no\" dir=\"ltr\">WMT.N</a> unit in Canada, for example, said in 2016 it would stop accepting Visa credit cards after being unable to reach an agreement on fees. Seven months later the companies said they had settled the matter after about 20 stores stopped taking Visa cards.</p><p>Amazon customers can still use Visa debit cards, Mastercard and Amex credit cards, and Eurocard, in the UK, Amazon said in a note to customers.</p><p>Visa said in a statement it was \"disappointed that Amazon is threatening to restrict consumer choice.\"</p><p>\"We continue to work toward a resolution, so our cardholders can use their preferred Visa credit cards at Amazon UK without Amazon-imposed restrictions come January 2022,\" Visa added. </p><p>Shares of rival Mastercard dropped 2.8% on Wednesday. Amazon shares rose 0.2%. American Express shares closed 0.7% lower.</p><p>The British Retail Consortium said other retailers in the United Kingdom faced higher charges for cross-border payments, following Britain's departure from the European Union.</p><p><br/></p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Matt Scuffham and David Henry in New York, Bhargav Acharya, Maria Ponnezhath and Yadarisa Shabong in Bengaluru<br/>Editing by David Gregorio and Matthew Lewis)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:matthew.scuffham@thomsonreuters.com\" data-type=\"email\" translate=\"no\">matthew.scuffham@thomsonreuters.com</a> ; +1-332-201-0609; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://matthew.scuffham.reuters.com@reuters.net\">matthew.scuffham.reuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: BRITAIN-AMAZON.COM/VISA (UPDATE 6, PIX, TV)</p></div>"}