{"date": "2022-01-27 14:40:35+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2799.72, "close": 2792.75}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n                  <a>Go back to previous list...</a>\n                  <h4>\n          Press release: AWS wave energy converter arrives in Orkney for EMEC demo\n        </h4>\n                  <div>\n                    <p>\n            Posted by <a href=\"https://www.emec.org.uk/author/emec/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">EMEC</a> on Thursday, January 27, 2022\n          </p>\n                  </div>\n                  <p>\n          A new wave energy converter, developed by Inverness-based AWS Ocean Energy, has arrived in Orkney ahead of its imminent deployment at the European Marine Energy Centre (EMEC).\n        </p>\n                  <p>\n          The 16 kW Archimedes Waveswing arrived at Hatston Pier, Kirkwall on Tuesday evening, 25 January 2022, before being transported to Copland's Dock in Stromness where it will be readied for deployment at EMEC's Scapa Flow test site in February.\n        </p>\n                  <p>\n          Weighing in at 50 tons, the seven-metre high, four-metre diameter device travelled to Orkney by ferry following a period of dry testing undertaken by the AWS engineering team at Muir of Ord.\n        </p>\n                  <p>\n          When deployed, the Archimedes Waveswing is moored to the seabed and sits below the surface of the sea, reacting to changes in pressure caused by passing waves. It is moored on a single tension tether. The subsea location and ability to winch low in the water column enables extreme storm loadings to be avoided so that the device can continue to operate in rough sea conditions. The Waveswing is designed to react to long ocean swell waves as well as short, wind-driven seas, for high energy capture.\n        </p>\n                  <p>\n          The £3.4 million prototype project has been funded by Wave Energy Scotland (WES) as part of the Novel Wave Energy Converter development programme. The demonstration at EMEC is also supported by the Interreg North-West Europe's Ocean DEMO project.\n        </p>\n                  <div>\n                    <br/>\n                    <br/>\n                  </div>\n                  <p>\n                    <strong>Simon Grey, CEO of AWS Ocean Energy said:</strong>\n                  </p>\n                  <p>\n          \"This is another major step forward in the development programme, underlining our confidence that the Waveswing really is the best prospect for practical, affordable wave power. The whole team at AWS is looking forward to getting our at-sea testing programme underway at EMEC.\n        </p>\n                  <p>\n          \"Our current Waveswing design focusses on remote power applications such as powering subsea oilfield assets and oceanographic monitoring, however the device is suitable for integration into submerged platforms and can be scaled to over 500 kW per unit. AWS expect to develop platforms hosting up to 20 units with a potential capacity of 10 MW per platform.\n        </p>\n                  <p>\n          \"The exciting thing about Waveswing is that it's genuinely scalable and practical to integrate into a multi-absorber platform. Achieving power outputs comparable with offshore wind units is critical to driving down the cost of energy and ensuring that operation and maintenance is practicable in the hostile marine environment.\"\n        </p>\n                  <p>\n                    <strong>Tim Hurst, Managing Director of WES said:</strong>\n                  </p>\n                  <p>\n          \"The sea trials of the AWS Waveswing device represent the culmination of Wave Energy Scotland's Novel Wave Energy Converter Programme. The design offers a number of attractive innovations for a commercial market, and we are excited that these will soon be demonstrated in a real sea environment.\"\n        </p>\n                  <p>\n                    <strong>Neil Kermode, Managing Director, EMEC said:</strong>\n                  </p>\n                  <p>\n          \"We're delighted to welcome AWS and the Archimedes Waveswing to Orkney and support its deployment and testing at our site in Scapa Flow.\n        </p>\n                  <p>\n          \"Real sea deployment is a vital step in proving performance, reliability and survivability of these devices. We know that prototype testing at sea is really valuable to technology developers to check how a technology and its components work and react in the environment prior to scaling up. We are looking forward to helping the team as they prove how to install, operate and maintain their exciting machine in Orkney's harsh conditions.\"\n        </p>\n                  <p>\n          The Waveswing development programme has been supported by a strong, predominantly Scottish team of subcontractors including 4c Engineering and Quoceant on design, Sequentec on supply of the control system, Malin Marine for the main build and assembly work, and JGC Engineering for fabrication of the anchor frame. International subcontractors include Trelleborg for supply of the rolling seal and SRP Subsea for supply of the Rocksteady mooring connector. Marine operations for deployment of the device will be carried out by Stromness-based Green Marine.\n        </p>\n                </div>\n                <div>\n                  <p>\n          -\n        </p>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.emec.org.uk/press-release-aws-wave-energy-converter-arrives-in-orkney-for-emec-demo/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>EMEC - European Marine Energy Centre Ltd.</strong> published this content on <strong>27 January 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>27 January 2022 14:40:35 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - EMEC - European Marine Energy Centre Ltd.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: EMEC---European-Marine-Energy-Centre-Ltd.</p></div>"}