{"date": "2021-11-30 22:00:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Elizabeth Culliford</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Nov 30 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon.com Inc's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> live-streaming site, Twitch, is launching a tool to detect users who try to access channels where they have been banned, it said on Tuesday.</p><p>The new tool, called Suspicious User Detection, will flag \"likely\" or \"possible\" channel ban evaders so that creators and moderators of those channels can decide whether to take action.</p><p>Twitch has been under pressure from users to combat abuses on its site, including targeted harassment and so-called hate raids where streamers' chats are flooded with harassing messages. </p><p>The platform, which is popular with video gamers, said it was launching the tool in response to user feedback on the need for ways to better combat ban evaders.</p><p>\"It is addressing that core problem of targeted harassment,\" Alison Huffman, Twitch's director of product for community health, said in an interview. \"We have heard through talking with creators and their moderators over time that this is a persistent problem for them.\"</p><p>Huffman said the machine learning tool, which Twitch has been working on for several months, detects certain types of user behavior and characteristics of accounts to flag potential ban evaders.</p><p>The tool will be turned on by default for all channels but can be adjusted or deactivated, Twitch said. It also said people can manually add to the tool users they want to monitor more closely.</p><p>   In September, Twitch added a way for creators and moderators to require phone and email verification before they can send chat messages, in a new anti-harassment measure. That month, it also filed a complaint in U.S. federal court against two alleged hate raiders. </p><p>Earlier this year, the company said it would ban users for severe misconduct that occurred away from its platform. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2LZ2KA\" data-type=\"storyId\" data-story-id=\"nL1N2LZ2KA\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2MF1MD\" data-type=\"storyId\" data-story-id=\"nL1N2MF1MD\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Machine learning, a part of artificial intelligence, is the study of computer algorithms that can improve automatically through experience and by the use of data. </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Elizabeth Culliford in New York<br/>Editing by Kenneth Li and Matthew Lewis)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:elizabeth.culliford@thomsonreuters.com\" data-type=\"email\" translate=\"no\">elizabeth.culliford@thomsonreuters.com</a> ; 2127679959; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-TWITCH/MODERATION (PIX)</p></div>"}