{"date": "2021-09-01 08:01:17+00:00", "ticker": "III", "mrkt_info": {"open": 1337.5, "close": 1338.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><h4>\n      3i invests in ten23 health to build a world-class global CDMO focused on biopharmaceuticals\n    </h4><p><strong>3i Group plc ('3i Group') announces that it has partnered with Prof. Dr. Hanns-Christian Mahler to create ten23 health, a pure-play, patient-centric and sustainable biologics drug product contract development and manufacturing organisation ('CDMO') focused on helping innovative biotech and pharma customers develop and commercialise injectable biopharmaceutical drugs.</strong></p><p>\n      Prof. Dr. Hanns-Christian Mahler, CEO of ten23 health, previously built a highly successful business within Lonza focused on drug product formulation development services and fill and finish manufacturing for biologics. Prof. Dr. Mahler led Lonza's Drug Product Services business from inception, scaling the business during his leadership tenure. Prior to Lonza, Prof. Dr. Mahler served as Head of Pharmaceutical Development &amp; Supplies at Roche, where he built its Biologics Product Development organisation.\n    </p><p>\n      Headquartered in Basel, Switzerland, ten23 health's core service offering includes formulation development, drug product development and manufacturing, as well as testing services for sterile pharmaceutical products. These high-value services are critical to helping pharma and biotech customers turn a scientific concept and therapeutic modality into a viable sterile medicine that is optimised for manufacturability, patient access and ease of administration, and logistical favourability. ten23 health will further differentiate itself by making a positive impact for People and Planet. The company aims for a net zero emissions target from inception, exhibiting its patient-centricity not only in the quality of service that it delivers, but also in its sustainability focus.\n    </p><p>\n      As drug development activities across biologics modalities continue to accelerate, small biotechs and large pharma companies will increase outsourcing of key services which require unique and market tested expertise as offered by ten23 health. Such molecules are increasingly complex and inherently unstable, increasing the need for expertise in drug product development services to optimise products holistically for patient safety, product stability, and manufacturability.\n    </p><p>\n      Richard Relyea, Partner, 3i, commented: 'We are delighted to be backing Hanns-Christian and the whole ten23 health team to build a leading biologics-focused CDMO. Hanns-Christian is one of the foremost leaders in a high-growth field who brings a proven track record in the biologics market. He has built a highly experienced team of experts and senior leaders with excellent credentials in the field of pharmaceutical product design and development and with an extensive global pharma network. We look forward to supporting ten23 health's outstanding leadership team in growing the company and expanding its capabilities globally.'\n    </p><p>\n      Prof. Dr. Hanns-Christian Mahler, CEO, ten23 health, added: 'There is significant unmet need in the biotech market as the number and complexity of molecules and therapeutic modalities increase which brings growing challenges with respect to stability, usability, and the successful commercialisation of medicines.\n    </p><p>\n      Our comprehensive offering will allow our clients to focus on the medicine and the patient, whilst leveraging our pharmaceutical expertise and knowledge to plan and de-risk product development. As a result, our strategic partners will profit from shorter product timelines and higher probability of technical success, ultimately leading to improved paths to commercialisation and maximised return on R&amp;D efforts.\n    </p><p>\n      I'm delighted to be partnering with Richard and the team at 3i to create a leading biologics CDMO that can meet the evolving needs of our customers with expert service, a true partnership model with our clients, and a patient-centric focus. 3i's demonstrated knowledge and deep understanding of the biotech landscape, including through investments in companies like SaniSure, made them a clear partner in building ten23 health into a leader in the development, manufacturing and testing of injectable medicines.'\n    </p><p><strong>Download this press release</strong></p><p><strong>- Ends -</strong></p><p><strong>For further information, contact:</strong></p><div><div class=\"story-table-container\"><table class=\"story-basic-table\"><tbody><tr><td><p><strong>3i Group plc</strong></p></td></tr><tr><td><p>\n                Silvia Santoro<br/>\n                 Investor enquiries\n              </p></td><td>\n              Tel: +44 20 7975 3258<br/>\n               Email: <a href=\"mailto:silvia.santoro@3i.com\" data-type=\"email\" translate=\"no\">silvia.santoro@3i.com</a></td></tr><tr><td><p>\n                Kathryn van der Kroft<br/><span>Media enquiries</span></p></td><td>\n              Tel: +44 7721 886 304<br/>\n               Email: <span><a href=\"mailto:kathryn.vanderkroft@3i.com\" data-type=\"email\" translate=\"no\">kathryn.vanderkroft@3i.com</a></span></td></tr></tbody></table></div></div><p><strong>About 3i Group</strong></p><p><span>3i is an investment company with two complementary businesses, Private Equity and Infrastructure, specialising in core investment markets in Northern Europe and North America.</span></p><p><span>3i's Private Equity team provides investment solutions for growing companies, backing entrepreneurs and management teams of mid-market companies with an EV typically between €100m - €500m. We back international growth plans, providing access to our network and expertise to accelerate the growth of companies across the consumer, industrial, healthcare and business and technology services industries. For further information, please visit:</span><span><a href=\"https://www.3i.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.3i.com</a></span></p><p><strong>About ten23 health</strong></p><p><span>ten23 health, headquartered in Basel, Switzerland, was founded in 2021 and is a development, manufacturing and testing company for biotech start-ups and the established pharmaceutical industry. The company supports life science customers globally in developing differentiated, stable, usable and safe injectable treatment options for patients. ten23 health is combining the latest scientific findings and proven and tested world-class industry and regulatory expertise. The company is forging new paths to support its clients in delivering safe and effective medicines to patients. ten23 health embeds fairstainability in all its practices and decisions and puts the focus on people - customers, employees, patients - and the planet.</span></p><p><strong>Regulatory information</strong></p><p><span>This transaction involved a recommendation of 3i Corporation, a US wholly owned subsidiary of 3i Group.</span></p><div id=\"public_attachments\"><p><strong>Attachments</strong></p><ul class=\"bulleted-list arrowlist\"><li><a href=\"https://www.3i.com/media-centre/corporate-and-portfolio-news/2021/3i-invests-in-ten23-health-to-build-a-world-class-global-cdmo-focused-on-biopharmaceuticals/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a></li></ul></div><div id=\"public_disclaimer\"><p><strong>Disclaimer</strong></p><p><strong>3i Group plc</strong> published this content on <strong>01 September 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>01 September 2021 08:01:17 UTC</strong></p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - 3i Group plc</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: 3i-Group-plc</p></div>"}