{"date": "2021-11-29 12:20:42+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>\n      TikTok.\n    </p>\n              <p>\n      Clubhouse.\n    </p>\n              <p>\n      Twitch.\n    </p>\n              <p>\n      These are just some of the many new social media apps we've seen grow in popularity over the past year - and that's <span>along</span> with all the 'oldies but goodies' like Instagram, Facebook, and Twitter.\n    </p>\n              <p>\n      The expanding list of popular social media platforms undoubtedly makes a social media marketer's job harder: <span>Which platforms will provide the highest ROI? Where's your audience hanging out? And which ones aren't worth the effort?</span></p>\n              <p>\n      As the social landscape changes, HubSpot's Blog team surveyed over 500 marketers to determine the biggest challenges social media marketers will face in 2022 - and how to prepare.\n    </p>\n              <p>\n      Let's dive in.\n    </p>\n              <h4>\n                <strong>5 Social Media Challenges Brands are Facing in 2022</strong>\n              </h4>\n              <h4>\n                <strong>1. Determining on which platform(s) you should market your brand.</strong>\n              </h4>\n              <p>\n      In 2022, <strong>26% of marketers</strong> say their biggest challenge will be determining which platform(s) they should invest time and resources.\n    </p>\n              <p>\n      This makes sense: The <a href=\"https://blog.hubspot.com/marketing/social-media-channel-time\" data-type=\"url\" class=\"tr-link\" translate=\"no\">most popular social platforms</a> aren't always the best fit for your brand or business goals, so it can be difficult to determine which apps you should include in your marketing strategy.\n    </p>\n              <p>\n      To choose the right platforms for your brand, HubSpot's Senior Manager of Social Media <a href=\"https://www.linkedin.com/in/kellyhendricksondesign/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Kelly Hendrickson</a> told me, \"It all comes down to your audience. Who is your audience, and where do they spend their time on social media?\"\n    </p>\n              <p>\n      She adds, \"[Most] platforms share broad audience demographics data, so even without a study, you may be able to figure out where your low hanging fruit is. If it's a bit harder to test out a few hashtags related to your business on various platforms to see where your audience is already participating.\"\n    </p>\n              <p>\n      Alternatively, it's helpful to consider which types of content your audience prefers. For instance, if you've conducted market research and found your buyer persona enjoys video content, then you've narrowed down your platform(s) to video hosting apps like YouTube, TikTok, and Instagram Stories - to name a few.\n    </p>\n              <p>\n      Finally, keep in mind your social media goals when choosing your platform. For instance, if your primary goal is to increase sales, then perhaps you want to test out targeted, personalized Facebook ads. If, alternatively, you're hoping to expand your brand awareness, you might test out some newer platforms like TikTok or Clubhouse.\n    </p>\n              <p>\n      Additionally, in regards to TikTok, Instagram Reels, or Snapchat, Hendrickson told me, \"The data shows that generally each of these channels skews towards a younger audience base. While that may seem less opportunistic if your audience is older, just remember, your audience of tomorrow may be on these platforms.\"\n    </p>\n              <h4>\n                <strong>2. Creating engaging content.</strong>\n              </h4>\n              <p>\n      As a content creator, I can tell you firsthand: Creating content is hard.\n    </p>\n              <p>\n      And, apparently, most marketers agree. In fact, <strong>24% of marketers say creating engaging content</strong> will be their biggest challenge in 2022.\n    </p>\n              <p>\n      Creating high-quality social media content is time-consuming, so consider how you might get the most bang for your buck by <a href=\"https://blog.hubspot.com/blog/tabid/6307/bid/27256/5-creative-ways-to-recycle-content.aspx\" data-type=\"url\" class=\"tr-link\" translate=\"no\">repurposing content across channels</a>. For instance, if you take the time to create a 10-minute YouTube video on a topic, cut short snippets from the video to repurpose on short-form channels like Instagram Stories, Snapchat, or TikTok.\n    </p>\n              <p>\n      You can also create a social media post with some of the information you researched for the video.\n    </p>\n              <p>\n      Additionally, <a href=\"https://www.linkedin.com/in/rachaelsamuels/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Rachael Samuels</a>, the Senior Manager of Social Media at <a href=\"https://sproutsocial.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Sprout Social</a>, believes dedicating time, resources, and headcount towards social media is vital for long-term success.\n    </p>\n              <p>\n      As she puts it, \"The social landscape is becoming increasingly saturated with new networks and seemingly endless potential audiences to engage. Social teams of one are no longer enough to keep up with the demand.\"\n    </p>\n              <p>\n      Samuels adds, \"As consumer preferences and expectations continue to grow in the year ahead, social marketers require greater investment in their teams and resources to be successful. To get ahead of this challenge, brands must ensure social is prioritized as a critical communication tool and provide their teams with the resources needed to produce creative, relevant, and authentic content.\"\n    </p>\n              <p>\n      Additionally, to truly see ROI from your social efforts, you'll want to take the time to integrate it into every stage of the customer journey. Perhaps you can use certain platforms for support for existing customers, whereas you use others to reach new audiences.\n    </p>\n              <p>\n      Samuels says, \"Having an <a href=\"https://blog.hubspot.com/marketing/integrated-marketing\" data-type=\"url\" class=\"tr-link\" translate=\"no\">integrated marketing plan</a> that addresses social media at each touchpoint of the customer journey is critical for overall business success. When brands fail to invest in social and their respective teams, they run the risk of losing customers and perpetuating burnout.\"\n    </p>\n              <h4>\n                <strong>3. Finding ideas for new content.</strong>\n              </h4>\n              <p>\n                <strong>23% of the marketers report that finding</strong>\n                <span>\n                  <strong>ideas</strong>\n                </span> for new content is their biggest challenge heading into 2022.\n    </p>\n              <p>\n      It can be tricky to consistently pitch new ideas for social platforms - particularly when social platforms feel overcrowded with content already.\n    </p>\n              <p>\n      While this isn't an exhaustive list, here are a few <a href=\"https://blog.hubspot.com/marketing/social-media-content-ideas\" data-type=\"url\" class=\"tr-link\" translate=\"no\">social media content suggestions</a> when brainstorming ideas for your 2022 calendar:\n    </p>\n              <ul class=\"bulleted-list arrowlist\">\n                <li>\n        Post your new blog on your Instagram Stories.\n      </li>\n                <li>\n        Conduct a poll on Instagram.\n      </li>\n                <li>\n        Share user-generated content on Twitter.\n      </li>\n                <li>\n        Create and share website content on Facebook.\n      </li>\n                <li>\n        On LinkedIn, post articles/stats about your industry.\n      </li>\n                <li>\n        Highlight milestones of your company on LinkedIn.\n      </li>\n                <li>\n        Create graphics for Instagram and Facebook.\n      </li>\n                <li>\n        Show the faces behind the company on Snapchat or Instagram.\n      </li>\n              </ul>\n              <p>\n      To combat this challenge, you also might consider using <a href=\"https://blog.hubspot.com/marketing/user-generated-content-stats\" data-type=\"url\" class=\"tr-link\" translate=\"no\">user-generated content</a> to spruce up your pages. Alternatively, take the time to research what types of content are trending on which platform(s).\n    </p>\n              <p>\n                <a href=\"https://www.linkedin.com/in/christinamgarnett/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Christina Garnett</a>, HubSpot's Senior Marketing Manager, Offline Community &amp; Advocacy, suggests researching what already exists when looking for new ideas. She told me, \"In his book, <span><a href=\"https://www.amazon.com/Creative-Curve-Develop-Right-Idea/dp/1524761710\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Creative Curve: How to Develop the Right Idea at the Right Time</a>,</span> Allen Gannett writes that 'to create something novel you must know what already exists.'\"\n    </p>\n              <p>\n      Garnett says, \"When trying to find the new you must consume and see what kind of content is already available and then look for gap opportunities. Are there questions not being answered? Different perspectives not being shared? Maybe the content exists but not in a format that is tailored for a specific learner or audience.\"\n    </p>\n              <p>\n      Garnett adds, \"Once you determine what you can create, you need to determine who needs it, and how it can best be packaged to improve their experience. Content has the same need to find product-market fit as products and solutions do. In the pursuit of the novel, you not only need to determine what doesn't exist, but <span>why</span> it doesn't. Creating for the sake of creation isn't enough when it needs an audience.\"\n    </p>\n              <p>\n      While this research can be time-consuming, it can enable you to position your brand as a thought leader in your industry and will undoubtedly lead to new content ideas.\n    </p>\n              <h4>\n                <strong>4. Measuring ROI.</strong>\n              </h4>\n              <p>\n      In some instances, measuring ROI can be relatively easy - particularly when it comes to monetary value, such as how many sales you received from a specific Facebook ad.\n    </p>\n              <p>\n      But when your social media goals involve more abstract concepts, such as \"increase brand awareness\", it can be difficult to quantify and measure your campaign's success.\n    </p>\n              <p>\n                <strong>22% of those surveyed agree</strong> that measuring ROI is their biggest challenge as they enter 2022.\n    </p>\n              <p>\n      Fortunately, measuring ROI across social platforms <span>can</span> be done, but it's not straightforward. Take a look at HubSpot's free lesson, <a href=\"https://academy.hubspot.com/lessons/measuring-your-social-return-on-investment\" data-type=\"url\" class=\"tr-link\" translate=\"no\">How to Measure Social Media ROI</a>, to learn more about how to track social media ROI when it comes to building brand loyalty, retaining customers, protecting your reputation, and more.\n    </p>\n              <h4>\n                <strong>5. Creating content that generates leads.</strong>\n              </h4>\n              <p>\n      Finally, <strong>22% of those surveyed report</strong> creating content that generates leads to be their biggest challenge as we enter the new year.\n    </p>\n              <p>\n      To create a strong <a href=\"https://blog.hubspot.com/marketing/social-media-lead-generation\" data-type=\"url\" class=\"tr-link\" translate=\"no\">social media lead generation</a> strategy, consider driving your audience from certain social platforms back to dedicated landing pages, or track clicks on specific CTAs for each campaign.\n    </p>\n              <p>\n      For instance, if you're running a campaign aimed at driving revenue towards a new product offering, you'll want to create a product landing page that you link to on each of your social profiles. Then you can track how many clicks come from each page, and alter your strategy accordingly. (If you see most clicks coming from Facebook, perhaps you put paid advertising behind your Facebook strategy.)\n    </p>\n              <p>\n      Alternatively, if you're hoping to drive sign-ups for an email newsletter, you'll want to create a CTA for social pages that drives your social audience to sign-up for your newsletter.\n    </p>\n              <p>\n      Social media advertising is another powerful way to <a href=\"https://blog.hubspot.com/marketing/beginner-inbound-lead-generation-guide-ht\" data-type=\"url\" class=\"tr-link\" translate=\"no\">generate leads through social media</a>.\n    </p>\n              <p>\n      However, it's important to keep in mind - to create truly unique social media ads, you'll want to ensure those ads seem spontaneous and casual.\n    </p>\n              <p>\n      As Talkwalker's CMO <a href=\"https://www.linkedin.com/in/elena-melnikova-953887a/?originalSubdomain=lu\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Elena Melnikova</a> puts it, \"The challenge will be brands, used to producing highly-polished commercials, creating ads that come across as spontaneous.\"\n    </p>\n              <p>\n      \"Too commercial, and this young audience will scroll past your brand, looking for the next dance routine. Read the room. Follow the trends. Be spontaneous.\"\n    </p>\n              <p>\n      Melnikova adds, \"Savvy brands will work with influencers to create content. And with the majority of TikTok influencers <a href=\"https://www.talkwalker.com/blog/gen-z-social-media-channels?utm_medium=referral&amp;utm_source=hubspot-blog&amp;utm_term=EN&amp;utm_content=blog&amp;utm_campaign=smt-2022\" data-type=\"url\" class=\"tr-link\" translate=\"no\">being Gen Z</a>, they'll understand how to ensure their content stands out, and increase a brand's engagement figures.\"\n    </p>\n              <p>\n      And there you have it! The biggest five challenges facing social media teams in 2022.\n    </p>\n              <p>\n      Now that you know which challenges you might be up against, take the time to brainstorm unique solutions that will help you level up your social media strategy into 2022 and beyond.\n    </p>\n              <p>\n      Originally published Nov 29, 2021 7:00:00 AM, updated November 29 2021\n    </p>\n              <div>\n                <p>\n        Topics:\n      </p>\n                <a href=\"https://blog.hubspot.com/marketing/social-media-marketing\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Social Media Marketing</a>\n              </div>\n              <div>\n                <h4>\n        Don't forget to share this post!\n      </h4>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://blog.hubspot.com/marketing/social-media-challenges\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>HubSpot Inc.</strong> published this content on <strong>29 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>29 November 2021 12:20:42 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - HubSpot Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: HubSpot-Inc.</p></div>"}