{"date": "2021-09-23 21:02:05.767000+00:00", "ticker": "ABDN", "mrkt_info": {"open": 252.5, "close": 252.4}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ABERDEEN GLOBAL INCOME FUND INC (\"FCO-A\")\n- Registration Statement\n\n   Aberdeen Global Income Fund, Inc. (the \"Fund\") (the \"Fund\"), a\nclosed-end equity fund, has announced that it filed a prospectus supplement\nto its \"shelf\" registration statement for $35 million in common shares with\nthe U.S. Securities and Exchange Commission (\"SEC\") on Thursday, September\n23, 2021.\n\n(figure class=\"image\")(/figure)     The prospectus supplement would enable\nthe Fund to sell from time to time, in one or more at-the-market offerings,\nthe Fund's common shares up to a total amount of $35 million. The filing\nwill allow the Fund to offer these registered securities when market\nconditions are considered favorable.\n\n   Common shares of the Fund would only be issued utilizing the shelf\nregistration when the premium to net asset value (\"NAV\") is greater than\nthe costs associated with the transaction. There can be no guarantee that\nthe Fund will engage in any sales or any particular level of sales of\ncommon shares, if shares were offered. Any proceeds raised would be used\nfor investment purposes.\n\n   An investor should read the Fund's prospectus and the applicable\nprospectus supplement carefully before investing in the Fund. The Fund's\nshares may be offered directly to one or more purchasers, through agents\ndesignated from time to time by the Fund, or to or through underwriters or\ndealers. The prospectus supplement relating to any offering will identify\nany agents, underwriters or dealers involved in the sale of Fund shares,\nand will set forth any applicable purchase price, fee, commission or\ndiscount arrangement between us and our agents or underwriters, or among\nour underwriters, or the basis upon which such amount may be calculated.\nThe Fund's shares may not be sold through agents, underwriters or dealers\nwithout delivery of a prospectus supplement, if and when available,\ndescribing the method and terms of the particular offering of Fund shares.\n\n   Investors may request these documents free of charge from the Fund's\nwebsite at www.aberdeenfco.com or obtain on the SEC's website at\nwww.sec.gov.\n\n   ###\n\n   This press release does not constitute an offer to sell or a\nsolicitation to buy the securities described herein, nor shall there be any\nsale of these securities in any state or jurisdiction in which such offer\nor solicitation or sale would be unlawful prior to registration or\nqualification under the laws of such state or jurisdiction.\n\n   This information does not represent an offer to sell securities of the\nFund and it is not soliciting an offer to buy securities of the Fund. There\ncan be no assurance that the Fund will achieve its investment objective.\nThe NAV of the Fund will fluctuate with the value of the underlying\nsecurities. It is important to note that closed-end funds trade on their\nmarket value, not NAV, and closed-end funds often trade at a discount to\ntheir NAV. Past performance is not indicative of future performance. An\ninvestment in the Fund is subject to certain risks and other\nconsiderations.\n\n   The Fund is a diversified, closed-end management investment company. The\nFund's principle investment objective is to provide high current income by\ninvesting primarily in fixed income securities. As a secondary investment\nobjective, the Fund seeks capital appreciation, but only when consistent\nwith its principal investment objective. Shares of closed-end funds\nfrequently trade at a discount to NAV. The price of the Fund's common\nshares is determined by a number of factors, many of which are beyond the\ncontrol of the Fund.\n\n   The Fund is managed and advised by Aberdeen Standard Investments (Asia)\nLimited. The Fund's shares trade on the NYSE under the symbol \"FCO.\"\n\n   In the United States, Aberdeen Standard Investments is the marketing\nname for the following affiliated, registered investment advisers: Aberdeen\nStandard Investments Inc., Aberdeen Asset Managers Ltd., Aberdeen Standard\nInvestments Australia Ltd., Aberdeen Standard Investments (Asia) Ltd.,\nAberdeen Capital Management, LLC, Aberdeen Standard Investments ETFs\nAdvisors LLC and Aberdeen Standard Alternative Funds Limited.\n\n   Investors should consider the Fund's investment objectives, risks,\ncharges and expenses carefully before investing. There is no assurance that\nthe Fund will achieve its investment objectives.\n\n   Closed-end funds are traded on the secondary market through one of the\nstock exchanges. The Fund's investment return and principal value will\nfluctuate so that an investor's shares may be worth more or less than the\noriginal cost. Shares of closed-end funds may trade above (a premium) or\nbelow (a discount) the NAV of the fund's portfolio. There is no assurance\nthat the Fund will achieve its investment objective. Past performance does\nnot guarantee future results.\n\n   If you wish to receive this information electronically, please contact\nInvestorRelations@aberdeenstandard.com\n\nAberdeen Standard Investments Inc.\nInvestor Relations\n800-522-5465\nInvestorRelations@aberdeenstandard.com\n\nTel   : 800-522-5465    ABERDEEN GLOBAL INCOME FUND INC\nFax   : 866-354-4005\nWWW   : <a href=\"https://www.aberdeenfco.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.aberdeenfco.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2126500829.MNPRE2126503058-13484720210923</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}