{"date": "2022-02-11 16:43:15+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3180.07, "close": 3103.34}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The author is a Reuters Breakingviews columnist.  The opinions expressed are his own.</p><p class=\"tr-by\">By Jonathan Guilford</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW YORK, Feb 11 (Reuters Breakingviews)</span><span class=\"tr-dl-sep\"> - </span>Tesla <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TSLA.O\" data-type=\"ric\" data-ric=\"TSLA.O\" translate=\"no\" dir=\"ltr\">TSLA.O</a> is a company characterized by rapid growth – of its share price, its revenue, and its output of coveted electric vehicles. There’s another kind of growth that investors in the $930 billion automaker risk overlooking: the 42% compound annual expansion of its workforce, which has swelled to almost 100,000, over the last decade. That requires careful handling, because few things can undermine a company’s worth like a culture gone awry.</p><p>Elon Musk’s firm has been a darling of investors conscious of environmental, social and governance concerns. Tesla has upended the environmentally disastrous automotive industry and rewarded shareholders handsomely along the way. But on the latter two planks of ESG, the company – which has <a href=\"https://ir.tesla.com/press-release/tesla-delivers-14820-vehicles-q1-2016-track-full-year-delivery\" data-type=\"url\" class=\"tr-link\" translate=\"no\">admitted to its own “hubris”</a> in the past – has faced charges of falling short. </p><p>Recent lawsuits hint at the danger. On Thursday, the California Department of Fair Employment and Housing filed a complaint <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2UL3QT\" data-type=\"storyId\" data-story-id=\"nL4N2UL3QT\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> alleging systemic racial discrimination at Tesla’s Fremont factory. A former contractor won $137 million <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2R12Z9\" data-type=\"storyId\" data-story-id=\"nL4N2R12Z9\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> over similar issues in 2021. Tesla is appealing that judgment while handling multiple other discrimination lawsuits. It has pushed back on the DFEH’s suit <a href=\"https://www.tesla.com/blog/dfehs-misguided-lawsuit\" data-type=\"url\" class=\"tr-link\" translate=\"no\">as “misguided.”</a></p><p>Growing workforces are a challenge for any company, but especially one with a monomaniacal focus on output. Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, for instance, has also prioritized breakneck expansion, adding 310,000 employees and likely many more contractors in 2021 alone. Like Tesla, it has drawn interventions from the National Labor Relations Board, which filed a complaint over the company’s practices in pushing against unionization drives. </p><p>Workplace dysfunction is hard to fix once it takes root. Wells Fargo <a href=\"reuters://REALTIME/Verb=FullQuote/ric=WFC.N\" data-type=\"ric\" data-ric=\"WFC.N\" translate=\"no\" dir=\"ltr\">WFC.N</a> found that out when its retail bankers started creating fake customer accounts to hit sales targets over a decade ago. Chief Executive Charlie Scharf is still trying to persuade regulators it can be rehabilitated. Over five years Wells Fargo is the worst performing large U.S. bank stock.</p><p>At Tesla, whose value depends mostly on potential rather than current earnings, culture is especially important. At its last shareholder meeting in October, investors approved a diversity-related proposal the company’s board <a href=\"https://ir.tesla.com/_flysystem/s3/sec/000156459021044307/tsla-pre14a_20210813-gen.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">opposed,</a> and almost adopted another over the practice of forcing employees to submit disputes to an arbitrator instead of the courts. Investors who see ESG as a three-letter word might have to continue prodding Musk further. </p><p>Follow <a href=\"https://twitter.com/JMAGuilford\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@JMAGuilford</a> on Twitter</p><p><br/></p><p>CONTEXT NEWS</p><p>- The California Department of Fair Employment and Housing on Feb. 10 said it had filed a lawsuit alleging a systematic pattern of racial discrimination and abuse at Tesla’s factory in Fremont. The company had said a day earlier that it expected the lawsuit.</p><p>- A jury awarded $137 million to a Tesla contract worker in October over allegations of racist abuse. Earlier in the year, a former employee won over $1 million from the company after an arbitrator found that he suffered racist harassment. </p><p>- At its 2021 shareholder meeting, Tesla shareholders adopted an investor proposal calling for more data on its diversity, equity and inclusion efforts. A proposal requesting a report on Tesla’s use of mandatory arbitration clauses in its employment contracts fell just short of majority support. </p><p><br/></p><p class=\"tr-signoff\"> (Editing by John Foley and Sharon Lam)</p><p class=\"tr-contactinfo\">((For previous columns by the author, Reuters customers can click on <a href=\"reuters://REALTIME/verb=Headlines/ric=GUILFORD/\" data-type=\"newsExpression\" data-expression=\"GUILFORD/\" translate=\"no\" dir=\"ltr\">GUILFORD/</a> <br/> SIGN UP FOR BREAKINGVIEWS EMAIL ALERTS <a href=\"https://bit.ly/BVsubscribe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://bit.ly/BVsubscribe</a> | <a href=\"mailto:Jonathan.Guilford@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Jonathan.Guilford@thomsonreuters.com</a> ; Reuters Messaging: Jonathan.Guilford. <a class=\"tr-link tr-link-rm\" href=\"rm://karen.kwok.thomsonreuters.com@reuters.net\">thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: TESLA-ESG/BREAKINGVIEWS</p></div>"}