{"date": "2021-12-07 20:30:38+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><br/>\nBy George Charles Darley<br/>\n<div>\n<div>\n<div>\n<div>\n<div>RIYADH: Amazon on Tuesday launched Alexa in Saudi Arabia offering customers an all-new, localized language experience in an Arabic Khaleeji dialect.</div>\n</div>\n</div>\n</div>\n<div data-io-article-url=\"https://www.arabnews.com/node/1982586/business-economy\">\n<p>Alexa, the brain that powers the Echo device family, has unique new features built with Saudi customers in mind, new smart home integrations with compatible devices, and nearly 200 Alexa skills.</p>\n<p>It seeks to deliver a localized experience, including a local dialect voice with a local personality that will surprise and delight customers—local pronunciations and intonation; local knowledge; and nearly 200 Alexa skills with favorites from Saudi developers and regional brands including Anghami, AlArabiya, MBC, Careem, Fatafeat, Al Baik, Sabq, and more.</p>\n<p>“We’re incredibly excited to bring Alexa and the Echo family of devices to Saudi Arabia,” said Tom Taylor, senior vice president, Amazon Alexa.</p>\n<p>“The team has worked hard to create an all-new experience designed from the ground up for our customers in Saudi Arabia, reflecting the Kingdom’s rich heritage, traditions, and culture while celebrating the uniqueness of the Arabic language.”</p>\n<p>Commenting on the launch of Alexa, Nawaf Alhoshan, deputy minister for technology development at the Saudi Ministry of Communications and IT, said Amazon Alexa will contribute to our goals and help drive the adoption of IoT and artificial intelligence in the Kingdom.</p>\n<p>Saudi Arabia is building an infrastructure with international standards that will pave the way to make it a leading digital nation and be among top 20 digital economies and a hub for technology investments in the region.</p>\n</div>\n</div>\n<p class=\"syndigate_disclaimer\">Copyright: Arab News © 2021 All rights reserved. Provided by SyndiGate Media Inc. (<a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a>).</p>\n<div class=\"footnote-disclaimer\">Disclaimer: The content of this article is syndicated or provided to this website from an external third party provider. We are not responsible for, and do not control, such external websites, entities, applications or media publishers. The body of the text is provided on an “as is” and “as available” basis and has not been edited in any way. Neither we nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this article. <a href=\"https://d3a0oa8cittb3t.cloudfront.net/researchreports/Disclaimers/TR%20Disclaimer.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read our full disclaimer policy here</a>.</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Arab News</p></div>"}