{"date": "2022-01-28 14:00:00.237000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2777.45, "close": 2879.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwlistdisc{list-style-type:disc;}</style><p class=\"bwalignc\">\nSailPoint Launches New AWS Region in Japan to Support Increased Demand for Identity Security\n</p><p>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.sailpoint.com%2F%3Felqct%3DPR%26elqchannel%3DPressRelease&amp;esheet=52569419&amp;newsitemid=20220128005006&amp;lan=en-US&amp;anchor=SailPoint+Technologies+Holdings%2C+Inc.&amp;index=1&amp;md5=69cb2231b4d589986c4b122ff465c713\" data-type=\"url\" class=\"tr-link\" translate=\"no\">SailPoint Technologies Holdings, Inc.</a> (NYSE: SAIL), a market leader in <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.sailpoint.com%2Fcore-identity-security%2F&amp;esheet=52569419&amp;newsitemid=20220128005006&amp;lan=en-US&amp;anchor=identity+security&amp;index=2&amp;md5=dec69f6bdbf2691f356993d5ef51b940\" data-type=\"url\" class=\"tr-link\" translate=\"no\">identity security</a> for the modern enterprise, today announced its new Amazon Web Services (AWS) region in Tokyo. This is the seventh region for the company, with other locations in Frankfurt, London, Montreal, Sydney, and two in the United States. The launch highlights the growing global demand for SailPoint's cloud identity security offerings and the company's focus on helping customers achieve their data residency requirements.\n</p><p>\n“Identity security is critical for modern enterprise security, helping to secure and enable new technologies while also protecting the workforce. In recent years, data residency has become more important to our customers’ identity security programs. Our cloud-native architecture gives us the ability to quickly deploy new regions to help our customers meet their requirements,” said Asanka Jayasuriya, Chief Technology Officer and Senior Vice President of Engineering at SailPoint. “In addition, years of investment in our cloud architecture ensures that each new region we launch meets the same high standard for reliability and security.”\n</p><p>\nKey components of SailPoint’s AWS regions:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\nHighly available multi-tenant SaaS environment, which is completely isolated from other regions—no data will be replicated, backed up, or stored in any other region;\n</li>\n<li>\nAny fault in the region is contained, not impacting other SailPoint AWS regions.\n</li>\n</ul><p>\n\"Since our expansion into Japan last year, our customer base in the country continues to rise. In order to deliver a positive customer experience, we must optimize our cloud infrastructure to enable customers' success. The new AWS region in Tokyo accomplishes this, allowing our customers to host their SailPoint identity security offerings within their country's borders,\" said Yutaka Fujimoto, Vice President and Country Manager in Japan, SailPoint. \"We will continue to meet our customers in Japan, and globally, where they are, as their business grows and evolves, providing them with a next-generation identity security solution that sits at the foundation of securing their business.\"\n</p><p>\n<b>About SailPoint</b>\n</p><p>\nSailPoint is the leader in identity security for the modern enterprise. Harnessing the power of AI and machine learning, SailPoint automates the management and control of access, delivering only the required access to the right identities and technology resources at the right time. Our sophisticated identity platform seamlessly integrates with existing systems and workflows, providing the singular view into all identities and their access. We meet customers where they are with an intelligent identity solution that matches the scale, velocity and environmental needs of the modern enterprise. SailPoint empowers the most complex enterprises worldwide to build a security foundation grounded in identity security.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20220128005006r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjIwMTI4MDA1MDA2cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=817a3a0e9d8f3ee8f148c6fc63e6a4a91e30eb429a638b99456d265b4c698c5de8dbef3724781efa59066213d3fd0f01fb76da938d975065a436abe93bf3ff3c\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20220128005006/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220128005006/en/</a></span></p><p>\n<b>Media Inquiries</b>:\n<br/>Natalie Reina, 956-878-9176\n<br/><a href=\"mailto:Natalie.reina@sailpoint.com\" data-type=\"email\" translate=\"no\">Natalie.reina@sailpoint.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2022</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: TX-SAILPOINT</p></div>"}