{"date": "2021-12-22 14:17:55.775000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>E-commerce giant Amazon is planning a major expansion in Austin.</p><p>Amazon says it will create more than 2,000 corporate and tech jobs in Austin over the next few years.</p></div><div class=\"tr-npp-body\"><p>The new roles will support teams in operations technology, retail, business and web services. Positions will include senior data engineers, senior technical program managers, user experience designers and financial analysts.  </p><p>To accommodate the growth, Amazon has leased 330,000 square feet of space at a new building being developed by Cousins Properties at the Domain in North Austin. The new office space is planned to open in early 2024.</p><p><span><span>►Christmas Eve 2021:</span> When Walmart, Whole Foods, Publix, Safeway and others are open</span> </p><p><span><span>►Investing in the metaverse?:</span> What the future holds as real estate, crypto, NFTs fuel growth</span> </p><p class=\"tr-npp-section-title\">Amazon's Austin Tech Hub has over 3,000 employees </p><p>Amazon currently has more than 3,000 tech and corporate employees at its Austin Tech Hub in three locations at the Domain. </p><p>\"Our continued investment in Austin is a testament to the amazing talent and amenities that this city has to offer,\" said Doug Gray, site lead for Amazon's Austin Tech Hub. \"With more than 3,000 jobs already created and more than 1,000 corporate and technology roles currently available, we're looking forward to continue offering exciting career opportunities to local residents.\" </p><p>To attract workers, the company has created a program called Amazon Returnship, which it says aims to help professionals get back to work after they lost or left their jobs — including people displaced by the coronavirus pandemic. The 16-week paid initiative is available to people who have been without a job or underemployed for at least a year.</p><p>During the program, employees work on a specific project, and after four months, they have the possibility of moving into full-time positions at Amazon. </p><p>Austin Mayor Steve Adler attributed Amazon's Austin expansion to the city's quality of life and a skilled workforce.</p><p>\"The Amazon investment will create a significant number of middle skill jobs for which our local workforce can train through Austin Community College and others, thus improving the lives of people who live here,\" Adler said. \"We invite Amazon, one of our leading corporate residents, to invest with us to make Austin even better and to better meet our challenges.\"</p><p><span><span>►Tech news right to your inbox:</span> Subscribe to the Talking Tech newsletter</span> </p><p>The Austin expansion is part of the company's national growth plan. Amazon says it plans to create 3,000 jobs across Austin, Chicago and Phoenix. In the past 18 months, it has announced 150 new jobs in Houston and 600 in Dallas.</p><p>Last year, Amazon announced it would open a sorting center in Kyle, Texas, with more than 200 jobs in the city south of Austin. The company said that since 2010 it has created more than 70,000 full- and part-time jobs in Texas. Amazon also owns Austin-based Whole Foods Market, which it bought in 2017 in a $13 billion deal.</p><p>Amazon's latest plans for Austin come as a number of tech companies are expanding in Central Texas. </p><p>In October, Tesla CEO Elon Musk announced that the electric automaker — one of the world's best-known and most valuable companies — would move its corporate headquarters from California to Austin. That came little more than a year after Tesla began building a $1.1 billion manufacturing facility in southeastern Travis County.</p><p>Last December, software giant Oracle announced that it was moving its corporate headquarters from California to Austin.</p><p>Meanwhile, Samsung recently announced plans for a $17 billion chip manufacturing facility in Taylor, Texas, and a number of other global technology players — including Apple, Facebook and Google — have expanded their operations in Central Texas in the past two years.</p><p>The Amazon hiring news comes as the unemployment rate in the Austin metro area fell to a pandemic-era low for the fifth consecutive month in November. The 3.2% unemployment rate in November came as local businesses continued their scramble to hire workers amid the region's strong economy.</p><p>The jobless rate remains above its 2.5% level in November 2019, before the pandemic. But it has improved significantly after shooting up to 11.8% in April 2020, when the shock of the coronavirus first slammed the economy statewide and nationally and triggered huge numbers of job cuts.</p><p>It's unclear whether rising concerns about the omicron variant of the coronavirus, first detected in Texas earlier this month, will disrupt the trend.</p><p>\"Right now, I would say the biggest problem for companies is hiring enough people —  not the prospect of omicron slowing their business,\" said Jason Schenker, president of Austin-based Prestige Economics. \"The job market in Austin is very, very tight right now.\"</p><p><span>American-Statesman staff writer Bob Sechler contributed to this report.</span> </p><p><span>This article originally appeared on Austin American-Statesman: Amazon plans major expansion in Austin, to hire 2,000 workers</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}