{"date": "2022-02-08 10:39:55.358000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Feb. 8 -- Apple iPhone 12 discount continues on Flipkart and Amazon. The 2020-made iPhone 12 features dual rear lens at the rear and single selfie camera at the front. The e-commerce portals are offering cashback, exchange that bring down the prices of all the variants down from its original market operating price. Apple iPhone starts with 64GB RAM unlike iPhone 13 that begins with 128GB. The iPhone 12 are offered at 8 per cent discount on Flipkart and 17 per cent on Amazon.</p><p>Be sure that discount and cashback depend on varieties of factor like PIN code and the condition of the phone going in exchange.</p></div><div class=\"tr-npp-body\"><p>On Flipkart, Apple iPhone 12 is marked at Rs.60,399 for the 64GB variant. It is available at 5 per cent discount for the Axis card users. The same phone could also be purchase at Rs.46,799 but with exchange value in place. You can visit the Flipkart's website, feed the IMEI number of your existing smartphone and you will get an idea about the original price of iPhone 12 to you.</p><p>Similarly, On Amazon, the iPhone 12 in the same format of 64GB is currently priced at Rs.54,999. Going further, the exchange value can further reduce the price the same phone by Rs.14,900 to the maximum. So the iPhone 12 can be yours at just Rs.40,099 only.</p><p>Not only that the offline electronics major, Vijay Sales, is also offering various iPhones at discounted prices. It includes iPhone 13, Pro, iPhone 12 and iPhone 11. Apart from that, Macbook Air and Pro are also selling at discounted rates there. It is selling AirPods, Apple Watches on rebate as well.</p><p>Apple iPhone 12 gets a 6.1 inch Retina display with 12MP+12MP dual rear cameras. It has a 12MP selfie lens as well. The phone uses A14 Bionic chipset. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}