{"date": "2021-12-02 14:14:29.723000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>HIGHWOOD ASSET MANAGEMENT LTD. ANNOUNCES INITIAL INFERRED RESOURCE LITHIUM-BRINE ESTIMATE OF 18.1 MILLION TONNES OF LITHIUM CARBONATE EQUIVALENT AT THE DRUMHELLER PROPERTY</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">HIGHWOOD ASSET MANAGEMENT LTD. ANNOUNCES INITIAL INFERRED RESOURCE LITHIUM-BRINE ESTIMATE OF 18.1 MILLION TONNES OF LITHIUM CARBONATE EQUIVALENT AT THE DRUMHELLER PROPERTY</p>\n<p>Canada NewsWire</p>\n<p>CALGARY, AB, Feb. 28, 2022</p>\n<p>\n<span>/NOT FOR DISSEMINATION IN THE U.S. OR THROUGH U.S. NEWSWIRES/</span>\n</p>\n<p>\n<span>CALGARY, AB</span> , <span>Feb. 28, 2022</span> /CNW/ - Highwood Asset Management Ltd. (TSXV: HAM) (\"Highwood\" or the \"Company\") is pleased to announce the filing of NI 43-101 Technical Report Lithium Resource Estimate for its Drumheller Property.</p>\n<p>\n<span>Highlights</span>\n</p>\n<ul class=\"bulleted-list arrowlist\">\n<li>The Drumheller Property land base of 363,522 hectares (895,811 acres) represents 23.5% of Highwood's total <span>Alberta</span> and <span>British Columbia</span> land position.</li>\n<li>The initial Inferred Lithium-Brine Resource at <span>Drumheller</span> has been calculated within 3 separate resource domains, the combined total of which is estimated to contain 18.14 million metric tonnes lithium carbonate equivalent.</li>\n</ul>\n<p>\n<span>NI 43-101 Technical Report</span>\n</p>\n<p>Highwood commissioned APEX Geoscience Ltd. to prepare a National Instrument 43-101 Report effectively dated <span>February 21, 2022</span> (the \"Technical Report\") to detail the inferred resource assessment for the Company's Drumheller Property. The Drumheller Property comprises approximately 23.5% of Highwood's total <span>Alberta</span> and <span>British Columbia</span> land position. The Technical Report for the Project is available on SEDAR ( <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3456069-1&amp;h=3292856812&amp;u=http%3A%2F%2Fwww.sedar.com%2F&amp;a=www.sedar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.sedar.com</a> ) and on the Company's website.</p>\n<p>The Drumheller Resource Project area (363,522 hectares) has over 3,675 historical oil and gas wells that were drilled by petro-companies into the Devonian aged carbonate reef strata from the youngest (Nisku Formation) to the oldest (Beaverhill Lake Group). Current hydrocarbon production occurs within two oil pools located near the townsite of <span>Drumheller</span> .</p>\n<p>Geological information culled from the oil and gas wells included formation picks, wireline logs, core plug measurements and drill stem tests. Based on the assessment of these data, a 3-D geological model was created with emphasis on 3 distinct resource domains:</p>\n<ol>\n<li>Leduc Aquifer Domain: The Leduc Formation aquifer, which underlies most of the Property – apart from the area northwest of the Killam Barrier Reef where the <span>Leduc</span> abruptly transitions to Duvernay Formation shale.</li>\n<li>Nisku Killam Barrier Reef Aquifer Domain: A wireframed zone of the Nisku Formation aquifer within the northeast-trending, linear Killam Barrier Reef and an area that extends 10 km east of the reef edge. This domain is uniquely modelled as a zone in which the <span>Nisku</span> and <span>Leduc</span> formation aquifers are in hydro-communication with one another.</li>\n<li>Nisku Platform/Basin Aquifer Domain: The area of remaining Nisku Formation aquifer volume that occurs outside of the Nisku Killam Barrier Reef Aquifer Domain. The domain includes Nisku Formation within the East Platform Shelf (east and southeast Property) and East Shale Basin (uppermost northwest corner of the Property). It is assumed that the <span>Nisku</span> in this domain is not in hydro-communication with the <span>Leduc</span> aquifer.</li>\n</ol>\n<p>\n\n</p>\n<p>Critical steps in the determination of Highwood's <span>Drumheller</span> lithium-brine resource estimation include:</p>\n<ul class=\"bulleted-list arrowlist\">\n<li>Leduc Aquifer Domain porosity: 9.9%.</li>\n<li>Nisku Killam Barrier Reef Domain Aquifer Domain porosity: 6.1%.</li>\n<li>Nisku Platform/Basin Aquifer Domain porosity: 6.8%.</li>\n</ul>\n<ul class=\"bulleted-list arrowlist\">\n<li>Definition of the geology and geometry of the subsurface <span>Leduc</span> and <span>Nisku</span> formations underlying the Drumheller Property based on 1,975 wells and 1,181 surface top horizon formation picks. Wireframes of the 3 resource domains were then clipped to the extents of the Drumheller Property to ensure the resource volumes and estimations were contained within the boundaries of the property. Numerous small private landholdings within the Drumheller Property outline were removed from the estimation process.</li>\n<li>Hydrogeological characterization and a historical compilation and assessment of average porosity within the 3 resource domains were based on 1,761 effective porosity and permeability measurements, 126,590 calculated total porosity records and 811 drill stem tests:</li>\n</ul>\n<ul class=\"bulleted-list arrowlist\">\n<li>Leduc Aquifer Domain porosity: 48.3 mg/L lithium.</li>\n<li>Nisku Killam Barrier Reef Domain Aquifer Domain porosity: 41.4 mg/L lithium.</li>\n<li>Nisku Platform/Basin Aquifer Domain porosity: 25.2 mg/L lithium.</li>\n</ul>\n<ul class=\"bulleted-list arrowlist\">\n<li>Determination of the lithium-in-brine concentration within the 3 resource domains were based on 27 brine analytical results:</li>\n</ul>\n<ul class=\"bulleted-list arrowlist\">\n<li>Leduc Aquifer Domain porosity: 98%.</li>\n<li>Nisku Killam Barrier Reef Domain Aquifer Domain porosity: 98%.</li>\n<li>Nisku Platform/Basin Aquifer Domain porosity: 98%.</li>\n</ul>\n<ul class=\"bulleted-list arrowlist\">\n<li>Definition of the pore space volume of brine within the 3 resource domains were based on 122 petro-fluid production records over the last 3-years of production:</li>\n</ul>\n<ul class=\"bulleted-list arrowlist\">\n<li>Estimate of the <span>in-situ</span> lithium resources of the 3-resource domain aquifers underlying the Drumheller Property using the relation: <span>Lithium Resource = Total Volume of the Brine-Bearing Aquifer X Average Effective Porosity X Percentage of Brine in Pore Space x Average Concentration of Lithium in the Brine.</span>\n</li>\n</ul>\n<p>The Drumheller Leduc Formation lithium-brine resource estimate is classified as an 'Inferred Mineral Resource' in accordance with guidelines established by the CIM \"Estimation of Mineral Resources and Mineral Reserves Best Practice Guidelines\" dated <span>November 29</span>\n<span>th</span> , 2019, and the CIM \"Definition Standards for Mineral Resources and Mineral Reserves\" amended and adopted <span>May 10</span>\n<span>th</span> , 2014.</p>\n<p>Mineral resources are not mineral reserves and do not have demonstrated economic viability. There is no guarantee that all or any part of the mineral resource will be converted into a mineral reserve.</p>\n<p>The lithium-brine resource was estimated using a cut-off grade of 20 mg/L lithium. The in-situ <span>Drumheller</span> lithium-brine inferred resources are globally (totally) estimated as follows:</p>\n<ol>\n<li>The Leduc Aquifer Domain is estimated to contain 3.14 million tonnes of elemental lithium. The global (total) lithium carbonate equivalent (LCE) for the main resource is 16.73 million tonnes LCE.</li>\n<li>Nisku Killam Barrier Reef Aquifer Domain is estimated to contain 59,000 tonnes of elemental lithium. The global (total) LCE for the main resource is 312,000 tonnes LCE.</li>\n<li>Nisku Platform/Basin Aquifer Domain is estimated to contain 207,000 tonnes of elemental lithium. The global (total) lithium LCE for the main resource 1.10 million tonnes LCE (Table 1.1).</li>\n</ol>\n<p>Table. Drumheller Leduc and Nisku Formation Li-brine inferred resource estimations presented as a global (total) resource.</p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>\n<span>Reporting Parameter</span>\n</span>\n</p>\n</td>\n<td>\n<p>\n<span>\n<span>Leduc AquiferDomain</span>\n</span>\n</p>\n</td>\n<td>\n<p>\n<span>\n<span>Nisku KillamBarrier ReefAquifer Domain</span>\n</span>\n</p>\n</td>\n<td>\n<p>\n<span>\n<span>NiskuPlatform/BasinAquifer Domain</span>\n</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Aquifer volume (km <span>3</span> )</span>\n</p>\n</td>\n<td>\n<p>\n<span>670.559</span>\n</p>\n</td>\n<td>\n<p>\n<span>23.669</span>\n</p>\n</td>\n<td>\n<p>\n<span>123.323</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Brine volume (km <span>3</span> )</span>\n</p>\n</td>\n<td>\n<p>\n<span>65.058</span>\n</p>\n</td>\n<td>\n<p>\n<span>1.415</span>\n</p>\n</td>\n<td>\n<p>\n<span>8.218</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Average lithium concentration (mg/L)</span>\n</p>\n</td>\n<td>\n<p>\n<span>48.3</span>\n</p>\n</td>\n<td>\n<p>\n<span>41.4</span>\n</p>\n</td>\n<td>\n<p>\n<span>25.5</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Average porosity (%)</span>\n</p>\n</td>\n<td>\n<p>\n<span>9.9</span>\n</p>\n</td>\n<td>\n<p>\n<span>6.1</span>\n</p>\n</td>\n<td>\n<p>\n<span>6.8</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Average brine in pore space (%)</span>\n</p>\n</td>\n<td>\n<p>\n<span>98.0</span>\n</p>\n</td>\n<td>\n<p>\n<span>98.0</span>\n</p>\n</td>\n<td>\n<p>\n<span>98.0</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Total elemental Li resources (tonnes)</span>\n</p>\n</td>\n<td>\n<p>\n<span>3,142,000</span>\n</p>\n</td>\n<td>\n<p>\n<span>59,000</span>\n</p>\n</td>\n<td>\n<p>\n<span>207,000</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Total LCE (tonnes)</span>\n</p>\n</td>\n<td>\n<p>\n<span>16,726,000</span>\n</p>\n</td>\n<td>\n<p>\n<span>312,000</span>\n</p>\n</td>\n<td>\n<p>\n<span>1,102,000</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>Note 1:</span>\n</p>\n</td>\n<td>\n<p>\n<span>Mineral resources are not mineral reserves and do not have demonstrated economic viability. There is no guarantee that all or any part of themineral resource will be converted into a mineral reserve. The estimate of mineral resources may be materially affected by geology, environment,permitting, legal, title, taxation, social-political, marketing, or other relevant issues.</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Note 2:</span>\n</p>\n</td>\n<td>\n<p>\n<span>The weights are reported in metric tonnes (1,000kg or 2,204.6lbs).</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Note 3:</span>\n</p>\n</td>\n<td>\n<p>\n<span>Tonnage numbers are rounded to nearest 1,000 unit.</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Note 4:</span>\n</p>\n</td>\n<td>\n<p>\n<span>In a 'confined' aquifer, effective porosity is a proxy for specific yield.</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Note 5:</span>\n</p>\n</td>\n<td>\n<p>\n<span>The resource estimation was completed and reported using a cutoff of 20mg/L lithium.</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Note 6:</span>\n</p>\n</td>\n<td>\n<p>\n<span>To describe the resource in terms of the industry standard, a conversion factor of 5.323 is used to convert elemental lithium to Li <span>2</span> CO <span>3</span> or LithiumCarbonate Equivalent (LCE).</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>Highwood engaged 2 independent third party labs for extraction technology test work: Preliminary lithium extraction process development testing indicate that an ion exchange process holds reasonable prospects for eventual economic extraction of battery-grade lithium product from Highwood's lithium-brine. The labs' results showed a good lithium loading capacity and a good selectivity for lithium and demonstrated optimized lithium extraction results of 98.3%. Further testing for process development and process is justified and will commence later.</p>\n<p>In the near term, Highwood intends to focus on:</p>\n<ul class=\"bulleted-list arrowlist\">\n<li>Target wells (including active and suspended wells) and/or drill a new well in other parts of the <span>Drumheller</span> property and/or wells that penetrate into the Beaverhill Lake Group (or older) for further bring sample collection for assay testing.</li>\n<li>Conduct additional bulk brine sample collection to advance mineral processing test work.</li>\n<li>Refinement of hydrogeological model and lithium recovery process flowsheet toward development of a demonstration pilot plant.</li>\n<li>Community consultation and environmental studies.</li>\n<li>Continue to work with lithium-brine extraction technology and process developers in relation to recovery technologies applicable to the Company's potential lithium-brine properties.</li>\n<li>Resource estimate updates (if necessary) and Preliminary Economic Assessment technical reporting.</li>\n</ul>\n<p>\"Highwood is encouraged with the continued global support for the ongoing energy transition, with Lithium Carbonate prices rising over 300% to more than <span>US$50,000</span> /tonne since mid 2021. We see the development of our <span>Leduc</span> / Nisku Aquifer as a project that will provide upside to Highwood shareholders over time. Our team is working now internally to assess multiple extraction methodologies, and once determined, will proceed to completing a PEA\" said <span>Greg Macdonald</span> , President and CEO of Highwood.</p>\n<p>As Highwood assesses additional information on its lithium Sub-properties, Highwood will continue to evaluate value maximization paths for its lithium assets including a potential public pure play, low carbon intensity lithium company spinout.</p>\n<p>\n<span>Qualified Person:</span>\n</p>\n<p>D. <span>Roy Eccles</span> , MSc, P. Geol., of APEX Geoscience Ltd. is an independent Qualified Person as defined by National Instrument 43-101 and has reviewed and approved the technical information that forms the basis for this news release.</p>\n<p>\n<span>\n<span>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</span>\n</span>\n</p>\n<p>\n<span>Cautionary Note Regarding Forward-Looking Information</span>\n</p>\n<p>\n<span>This news release contains \"forward-looking information\" or \"FLI\" within the meaning of the Canadian securities laws. Forward-looking information is generally identifiable by use of the words \"believes,\" \"may,\" \"plans,\" \"will,\" \"anticipates,\" \"intends,\" \"budgets\", \"could\", \"estimates\", \"expects\", \"forecasts\", \"projects\" and similar expressions, and the negative of such expressions. Forward-looking information in this news release include statements about the Company's next steps which include resource assessment, continued exploration and development work, including in respect of the potential extraction technology, continued sampling and developing a reservoir model, the completion and timing for the Cretaceous ironstone NI 43-101 Technical Report, and the evaluation and potential spinout of a pure play lithium company, as well as the specific assumptions used to develop such FLI and the specific risk factors.</span>\n</p>\n<p>\n<span>In connection with the forward-looking information contained in this news release, Highwood has made numerous assumptions, regarding, among other things: the geological, metallurgical, engineering, financial and economic advice that Highwood has received is reliable and is based upon practices and methodologies which are consistent with industry standards. While Highwood considers these assumptions to be reasonable, these assumptions are inherently subject to significant uncertainties and contingencies.</span>\n</p>\n<p>\n<span>Additionally, there are known and unknown risk factors which could cause Highwood's actual results, performance, or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking information contained herein. Known risk factors include, among others: the lithium-brine resource assessment may not be completed as planned or at all, the exploration and continued sampling may exceed the budget; continued sampling and the reservoir model may not achieve the results expected; investor support for a pure play lithium public spinout; the need to obtain additional financing; uncertainty as to the availability and terms of future financing; the possibility of delay in exploration or development programs and uncertainty of meeting anticipated program milestones; uncertainty as to timely availability of permits and other governmental approvals.</span>\n</p>\n<p>\n<span>A more complete discussion of the risks and uncertainties facing Highwood is disclosed in Highwood's continuous disclosure filings with Canadian securities regulatory authorities at</span>\n<span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3456069-1&amp;h=2366356220&amp;u=https%3A%2F%2Fus-east-2.protection.sophos.com%2F%3Fd%3Dnewsfilecorp.com%26u%3DaHR0cHM6Ly93d3cubmV3c2ZpbGVjb3JwLmNvbS9yZWRpcmVjdC9HT21ZYnNBZ3hn%26i%3DNjA4MGM5ZDUyYTJmYjE0ODI0YjQwZGM5%26t%3DY2NRVDJUbHd3RG1IamdkbUphaTRRMS84WHRXNlJNc3lONHJHaTR4Yk5RTT0%3D%26h%3D0b92cfbc57634428806c7094d54653fe&amp;a=www.sedar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.sedar.com</a>\n</span>\n<span>. All forward-looking information herein is qualified in its entirety by this cautionary statement, and Highwood disclaims any obligation to revise or update any such forward-looking information or to publicly announce the result of any revisions to any of the forward-looking information contained herein to reflect future results, events, or developments, except as required by law.</span>\n</p>\n<p>SOURCE Highwood Asset Management Ltd.</p>\n<p>View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/February2022/28/c7833.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/February2022/28/c7833.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}