{"date": "2021-10-12 16:41:47.167000+00:00", "ticker": "III", "mrkt_info": {"open": 1271.0, "close": 1287.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENBRIDGE INC (\"ENB-TN\")\n- Completes Acquisition of North America's Premier Crude Export\n- Facility\n\n     Enbridge Inc. (Enbridge or the Company) announced the closing of the\nacquisition of Moda Midstream Operating from Encap Flatrock Midstream for\nUS$3.0 billion. The acquisition significantly advances the Company's U.S.\nGulf Coast export strategy and connectivity to low-cost and long-lived\nreserves in the Permian and Eagle Ford basins.\n\n     The transaction provides Enbridge with a 100 percent operating\ninterest in the Ingleside Energy Center, and related pipeline and logistics\ninfrastructure, located near Corpus Christi, Texas, along with a 20 percent\ninterest in the 670-thousand-barrel-per-day Cactus II Pipeline.\n\n     About Enbridge Inc.\n\n     Enbridge Inc. is a leading North American energy infrastructure\ncompany. We safely and reliably deliver the energy people need and want to\nfuel quality of life. Our core businesses include Liquids Pipelines, which\ntransports approximately 25 percent of the crude oil produced in North\nAmerica; Gas Transmission and Midstream, which transports approximately 20\npercent of the natural gas consumed in the U.S.; Gas Distribution and\nStorage, which serves approximately 3.8 million retail customers in Ontario\nand Quebec; and Renewable Power Generation, which generates approximately\n1,766 MW of net renewable power in North America and Europe. The Company's\ncommon shares trade on the Toronto and New York stock exchanges under the\nsymbol ENB. For more information, visit www.enbridge.com.\n\n     FOR FURTHER INFORMATION PLEASE CONTACT:\n\n     MediaMichael BarnesToll Free: (888) 992-0997Email: media@enbridge.com\n\n     Investment CommunityJonathan MorganToll Free: (800) 481-2804Email:\ninvestor.relations@enbridge.com\n\nTel   : 403-231-3900    ENBRIDGE INC CUM REDEEMABLE PR SHARES SERIES L\nFax   : 403-231-5929\nEmail : CorporateSecretary@enbridge.com\nWWW   : <a href=\"https://www.enbridge.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.enbridge.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2128400769.MNPRE2128402914-09094820211012</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}