{"date": "2022-02-26 09:58:36.805000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3027.16, "close": 3071.26}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Feb. 26 -- Amazon has started the 'Summer Appliances Carnival 2022' which is offering exciting deals on summer appliances and more including Refrigerators, ACs, Washing Machines, Microwave Ovens, Dishwasher and Chimneys, among others. Customers can enjoy the 'Summer Appliances Carnival 2022' by saving on some of the best appliance brands such as Samsung, LG, Lloyd, Blue Star, Whirlpool, Symphony, Bajaj, Havells and more from February 25th to 28th, 2022. They can also save more with bank offers on a minimum transaction of Rs.5,000.</p><p>Here are some of the top offers on home appliances by participating sellers:</p></div><div class=\"tr-npp-body\"><p>Refrigerators:</p><p>Energy efficient refrigerators starting Rs.13,990</p><p>Convertible refrigerators for flexible storage space, starting INR 23,090</p><p>Upgrade to double door refrigerators at the price of a single door, starting INR 18,790</p><p>Up to Rs.12,000 off on Side-by-side refrigerators on exchange</p><p>Refrigerators from top brands with No Cost EMI up to 24 months</p><p>ACs:</p><p>Split ACs starting Rs.22,499; Inverter technology with higher power efficiency &amp; consistent cooling operation starting at Rs.27,990</p><p>Choose from a wide selection of ACs as per your space and energy requirements; right from 0.8-ton ACs to 2-ton ACs</p><p>Latest technology Convertible Air conditioners with added feature to adjust AC capacity and operate at lower/higher capacity based on outside temperature &amp; number of people in the room starting INR 33,490</p><p>60+ models from emerging technologies on adjustable/convertible ACs &amp; smart ACs from top brands including LG, Samsung, Whirlpool, Lloyd, Panasonic, Carrier &amp; Blue Star.</p><p>Air conditioners from top brands with no cost EMI up to 18 months</p><p>Coolers &amp; Fans:</p><p>Up to 40% off on top brands such as Symphony, Bajaj, Havells, Usha, Orient and more</p><p>Choose from a wide selection of coolers; right from personal coolers to desert coolers</p><p>Emerging Technologies in Fans - Energy efficient and smart fans from top brands - Atomberg, Crompton, Orient, Bajaj and more</p><p>Get up to 30% off on decorative ceiling fans from Crompton, Usha, Orient |NCEMI</p><p>New launches in emerging technologies across top brands Symphony, Orient, Bajaj, Havells and more</p><p>Air coolers and Fans from top brands with No cost EMI up to 12 months</p><p>Up to 30% off on Inverter &amp; batteries from Livguard, Luminous</p><p>Table, Ceiling &amp; portable fans from top brands like Bajaj, Symphony, Havells, Usha, Orient &amp; more starting at Rs.599 Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}