{"date": "2021-07-01 07:52:16+00:00", "ticker": "AVV", "mrkt_info": {"open": 3727.0, "close": 3809.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds details, background</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">July 1 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>British industrial software firm Aveva <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AVV.L\" data-type=\"ric\" data-ric=\"AVV.L\" translate=\"no\" dir=\"ltr\">AVV.L</a> reported a 10% jump in April-May revenue on Thursday and laid out new five-year targets, including revenue gains of at least $100 million from its $5 billion purchase of OSIsoft.</p><p>Aveva, which will present the targets to investors later in the day, said it made a \"good start\" to the new financial year that began in April, as business activity picks up after disruptions caused by the COVID-19 pandemic.</p><p>It plans to derive new revenue from OSIsoft -  which makes software that captures data from ships, chemical boilers, power plants and other facilities across industries - by cross-selling its products to OSIsoft customers and through an international expansion.</p><p>The FTSE 100 firm said it was targeting revenue growth at a compound annual rate of 10% by fiscal 2026, with recurring revenue contributing at least 80% to the total, up from roughly 68% currently. </p><p>The company is also targeting margins of at least 35% on adjusted earnings before interest and taxes, it said.</p><p>More businesses buying cloud- and subscription-based software would boost recurring revenue, Aveva said in a presentation, adding that trends around aritifical intelligence, cloud software and the internet-of-things would drive long-term growth.    </p><p>The company's revenue jump in April-May and its five-year targets are calculated on an organic, constant-currency basis, it said.</p><p>Shares in Aveva were up 3.7% at 3,845 pence on the London Stock Exchange by 0730 GMT.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Sachin Ravikumar in Bengaluru; Editing by Saumyadeb Chakrabarty, Aditya Soni)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:saisachin.r@tr.com\" data-type=\"email\" translate=\"no\">saisachin.r@tr.com</a> ; +91 80 6182 2754; Twitter: <a href=\"https://twitter.com/sachinr27\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/sachinr27</a>; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AVEVA GROUP-OUTLOOK/ (UPDATE 1)</p></div>"}