{"date": "2021-12-14 11:03:45+00:00", "ticker": "AVV", "mrkt_info": {"open": 3333.0, "close": 3271.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><br/>\nBy Staff Writer<br/>\n<p><span class=\"round articleImage\" id=\"span\"></span></p>\n<p>Aveva, a global leader in industrial software, has expanded its Middle East executive leadership team with the appointment of Nayef Bou Chaaya as the company’s Vice President Sales and Head of Middle East and Africa (MEA).</p>\n<div>The new appointment strengthens Aveva’s partner and customer relations at a time when the company is facilitating digital transformation for an increasing number of industrial businesses in the region and around the world.</div>\n<div> </div>\n<div>Bou Chaaya is a seasoned executive management professional with three decades of software sales experience, focused on the oil and gas, energy, infrastructure and food and beverage sectors. He joins from Schneider Electric, where he led Process Automation Business Development in the Middle East, preceded by various senior sales and operations leadership positions within Schneider Electric and Invensys.</div>\n<div> </div>\n<div>Raised in Lebanon, Bou Chaaya holds a bachelor’s degree in computer science from Lebanese American University and will be based in Dubai. Aveva will leverage his deep expertise to lead the MEA organisation and to help partners around the world to strengthen their operational and environmental sustainability.</div>\n<div> </div>\n<div>“We welcome and look forward to the strategic direction and dynamic leadership Nayef Bou Chaaya will bring to the one of Aveva’s key markets,” said Caspar Herzberg, Chief Revenue Officer, Aveva.</div>\n<div> </div>\n<div>Bou Chaaya said: “I’m looking forward to joining Aveva at an exciting time when the company is driving digital transformation and sustainability in the region.</div>\n<div>“Momentum across the Middle East and Africa has been building around accelerating the use of advanced technologies to achieve climate neutrality. Aveva has been at the forefront of the trend, having pioneered innovations that optimise performance, efficiency and sustainability over several decades. I am delighted to be tasked with strengthening and driving the delivery of our game-changing software and services across the region and beyond.”-- <strong>TradeArabia News Service</strong></div>\n<p> </p>\n<p class=\"syndigate_disclaimer\">Copyright 2021 Al Hilal Publishing and Marketing Group Provided by SyndiGate Media Inc. (<a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a>).</p>\n<div class=\"footnote-disclaimer\">Disclaimer: The content of this article is syndicated or provided to this website from an external third party provider. We are not responsible for, and do not control, such external websites, entities, applications or media publishers. The body of the text is provided on an “as is” and “as available” basis and has not been edited in any way. Neither we nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this article. <a href=\"https://d3a0oa8cittb3t.cloudfront.net/researchreports/Disclaimers/TR%20Disclaimer.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read our full disclaimer policy here</a>.</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© TradeArabia</p></div>"}