{"date": "2021-12-20 21:57:08.282000+00:00", "ticker": "ABDN", "mrkt_info": {"open": 226.6, "close": 237.1}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ABERDEEN JAPAN EQUITY FUND INC (\"JEQ-N\")\n- Distribution and Announces Implementation, Calculation and\n- Methodology of Managed Distribution Policy\n\n     Aberdeen Japan Equity Fund, Inc. (the \"Fund\"), a closed-end equity\nfund, announced today that it will pay a distribution of US$0.98049 per\nshare on January 11, 2022 to all stockholders of record as of December 30,\n2021 (ex-dividend date December 29, 2021). This distribution is comprised\nof $0.10751 per share of net investment income and $0.87298 net realized\nlong-term capital gains.\n\n     In January 2022, a Form 1099-DIV will be sent to stockholders, which\nwill state the amount and composition of distributions and provide\ninformation with respect to their appropriate tax treatment for the 2021\ncalendar year.\n\n     Managed Distribution Policy\n\n     In addition, the Fund announced today that it has implemented a\nManaged Distribution Policy (\"MDP\") commencing in 2022. The Board has\ndetermined that the Fund will pay quarterly distributions at an annual\nrate, set once a year, that is a percentage of the rolling average daily\nnet asset value (\"NAV\") for the previous three months as of the month-end\nprior to declaration. The Board has determined that the annualized rate for\nthe 2022 calendar year will be 6.5%. The Fund's distribution policy (the\n\"Distribution Policy\") is to provide investors with a stable quarterly\ndistribution out of current income, supplemented by realized capital gains\nand, to the extent necessary, paid-in capital. The Distribution Policy will\nbe subject to regular review by the Board. Previously, the Fund's policy\nwas to pay a single annual distribution.\n\n     In approving the managed distribution policy the Board considered,\namong other factors, the ability of the Fund to sustain the policy and that\nmaking periodic distributions could increase liquidity for common\nshareholders and may assist in narrowing the discount to NAV at which the\nFund's shares have tended to trade. There can be no guarantee that these\nbenefits will occur or that any improvement would continue.\n\n     The distributions will be made from net investment income, net\nrealized capital gains and, to any extent necessary, return of capital. As\nnet assets of the Fund may vary from quarter to quarter, the quarterly\ndistribution may represent more or less than one quarter of 6.5% of the\nFund's net assets at the time of distribution. Shareholders should not draw\nany conclusions about the Fund's investment performance from the amount of\nthe distributions or the terms of the Fund's policy.\n\n     The Fund is covered under exemptive relief received by the Fund's\ninvestment manager from the U.S. Securities and Exchange Commission that\nallows the Fund to distribute long-term capital gains as frequently as\nmonthly in any one taxable year.\n\n     The amounts and sources of distributions for tax reporting purposes\nwill depend on the Fund's investment experience during its fiscal year and\nmay be subject to change based on tax regulations. The Fund is subject to\nU.S. corporate, tax and securities laws. Under U.S. tax accounting rules,\nthe amount of distributable income for each fiscal year depends on the\ndividend and interest income received, the actual exchange rates during the\nentire year between the U.S. dollar and the currencies in which the Fund\nassets are denominated, and on the aggregate gains and losses realized by\nthe Fund during the entire year. Therefore, the exact amount of\ndistributable income for each fiscal year can only be determined as of the\nend of the Fund's fiscal year, December 31. However, under the U.S.\nInvestment Company Act of 1940, the Fund is required to estimate and\ndisclose the source of each distribution to shareholders. This estimated\ndistribution composition may vary from quarter to quarter because it may be\nmaterially impacted by future realized gains and losses on securities and\nfluctuations in the value of the currencies in which Fund assets are\ndenominated. The Fund will send you a Form 1099-DIV for the calendar year\nthat will tell you how to report distributions for federal income tax\npurposes.\n\n     The Fund is managed and advised by abrdn Asia Limited. The Fund's\nshares trade on the NYSE under the symbol \"JEQ\". You should not draw any\nconclusions about the Fund's investment performance from the amount of this\ndistribution.\n\n     In the United States, abrdn is the marketing name for the following\naffiliated, registered investment advisers: Aberdeen Standard Investments\nInc., Aberdeen Asset Managers Ltd., abrdn Australia Limited, abrdn Asia\nLtd., Aberdeen Capital Management, LLC, Aberdeen Standard Investments ETFs\nAdvisors LLC and Aberdeen Standard Alternative Funds Limited.\n\n     Closed-end funds are traded on the secondary market through one of the\nstock exchanges. A Fund's investment return and principal value will\nfluctuate so that an investor's shares may be worth more or less than the\noriginal cost. Shares of closed-end funds may trade above (a premium) or\nbelow (a discount) the net asset value (NAV) of the fund's portfolio. There\nis no assurance that a Fund will achieve its investment objective. Past\nperformance does not guarantee future results.\n\n     If you If you wish to receive this information electronically, please\ncontact Investor.Relations@abrdn.com\n\nAberdeen Standard Investments Inc.\nInvestor Relations\n1-800-522-5465\nInvestor.Relations@abrdn.com\n\nTel   : 800-522-5465    ABERDEEN JAPAN EQUITY FUND INC\nFax   : 866-354-4005\nWWW   : <a href=\"https://www.aberdeenjeq.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.aberdeenjeq.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2135300696.MNPRE2135302674-13545220211220</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}