{"date": "2022-01-26 13:59:44.736000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>Hit play on the player above to hear the podcast and follow along with the transcript below</span> . <span>This transcript was automatically generated, and then edited for clarity in its current form. There may be some differences between the audio and the text.</span> </p><p><span><span>More:</span> Daily news, true crime, and more USA TODAY podcasts</span> </p></div><div class=\"tr-npp-body\"><p>Hey there, listeners. It's Brett Molina. Welcome back to Talking Tech. Amazon Go is moving to the suburbs. You remember Amazon Go, right? This was the concept store that Amazon launched a while back that introduces cashierless technology. It allows you to walk in with your phone, open up your Amazon app, shop. You never have to confront a cashier, and you get charged on your app as you leave the store. The tech giant said it plans to open a new type of store aimed at serving customers in suburban area locations. The first of this kind will open in Mill Creek, Washington in the coming months. Amazon also plans to open a second ghost store in the Los Angeles area. Just like the other ghost stores that you've heard about and that you've likely seen in downtown areas like New York and in San Francisco, the location will leverage technology that allows customers to make purchases without ever interacting with a cashier.</p><p>So literally, the way it works is you walk in, you either pull up your phone, use the Amazon app, or you can use a credit card right at the entrance. You'll scan it to enter, then you'll go pick out your items. There's a variety of different items available, lots of grab and go stuff, beverages, snacks, ready to eat food items. And then once you're ready to go, you walk out. The stores uses a lot of different technology, like cameras and other sensors, to know what you've purchased. And then as you walk out of the store, you'll be charged for the items either through your card or through the Amazon app. The company has Amazon Go stores in four states. Almost all of them are in downtown metro areas. So I mentioned New York City and San Francisco. The new suburban Go stores will offer a lot of the same stuff, everyday essentials, beverages, those things.</p><p>This is obviously Amazon experimenting with the store concept. They've done a couple different concepts too recently. They just announced one with Starbucks, which combines an Amazon Go store basically with Starbucks Pickup. So if you wanted to go pick up a Starbucks coffee and get some stuff at Amazon Go, you could do all that without ever dealing with a cashier. That store, the concept with Starbucks also has a modern lounge. You could work there. It has power outlets, USB ports. So if you want to go get your food, park at one of these little workspaces, you can do that. It's a really interesting idea. And obviously, we've seen a lot more cashier-free technology take off. I mean, you go to the grocery store now, there is self-checkout. Even places like Costco, where at a time, they didn't have any of that. They finally got self-checkout, too. But you're seeing that more and more.</p><p>It's obviously very convenient. I think this Amazon Go concept, I haven't tried it, it sounds really fascinating. And I know that they have tried this too with grocery stores as well. And I'm sure Whole Foods has some of that stuff incorporated also, a lot of that Amazon tech. So it's going to be interesting as we see more and more of this start to pop into stores and as we see more of Amazon Go appearing in neighborhoods. What's that experience going to be like? What does it mean just for the local community? Working in a local grocery store, for example, how's that going to work with jobs? There's a zillion angles to take with this type of a store and this experience. The tech sounds really cool though. And I'm really interested in trying it out.</p><p>And if, again, you're in Mill Creek, Washington, you will be able to try this out very soon. You can read more about this in my story on tech.usatoday.com. Listeners, let's hear from you. Do you have any comments, questions, show ideas, any tech problems you want us to try to address? You can find me on Twitter, @BrettMolina23. Please don't forget to subscribe and rate us or leave a review on Apple Podcasts, Spotify, Stitcher, anywhere you get your podcasts. And don't forget, do you want tech news delivered straight to your inbox? Go to newsletters.usatoday.com, subscribe to the Talking Tech newsletter. It's available every Thursday. You've been listening to Talking Tech. We'll be back tomorrow with another quick hit from the world of tech.</p><p><span>This article originally appeared on USA TODAY: Amazon Go heads to the suburbs: Talking Tech podcast</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}