{"date": "2021-11-08 17:40:55.799000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>GURU ORGANIC ENERGY CORP (\"GURU-T;GUROF-0\")\n- Presents a New Natural Innovation: GURU Guayusa With Tropical Punch\n- Flavour\n\n     GURU Organic Energy Corp. (\"GURU\" or the \"Company\"), Canada's leading\norganic energy drink brand, is pleased to announce the addition of GURU\nGuayusa Tropical Punch (pronounced gwai-yoo-suh) to its growing,\nplant-based energy drink family. Inspired by the Jivaro people of Ecuador\nand concocted in Quebec, Canada, GURU Guayusa Tropical Punch is infused\nwith natural and organic energy-boosting ingredients.\n\n     \"Innovation is an integral part of our growth strategy. We are very\nexcited by this new product launch, which is yet another step in\nsolidifying our leadership position in the organic plant-based energy drink\nmarket,\" said Carl Goyette, President and CEO of GURU. \"Last year, we\nintroduced Yerba Mate, and Matcha the year before, which both became top\nproducts in our lineup, driven by strong demand for their healthy,\nplant-based ingredients and delicious flavour profiles. We are now bringing\nin Guayusa Tropical Punch, which will complement our growing line of\ndifferentiated organic energy drinks that deliver good energy, and which\nhas already garnered strong interest from our pre-launch activities.\"\n\n     \"As we go to battle against all the chemical energy drinks out there\nin the market, we are excited to bring this ancestral plant into our\nbotanical product line-up,\" said Luc Martin-Privat, Pharm.D - GURU\nBrewmaster and Vice President, R&amp;D and Innovation. \"As part of GURU's\nmission to clean up the energy drink industry, we are constantly on the\nlookout for new energizing ingredients from around the world. Made with\nGuayusa, a superleaf with natural energy-boosting and antioxidant\nproperties, and combined with the rich flavours of passion fruit, guava,\njack fruit and a refreshing hint of clementine, our new GURU Guayusa\nTropical Punch not only has a great taste, but also creates a smooth,\nbalanced and sustained alertness with no peak and no crash.\"\n\n     With Guayusa Tropical Punch, GURU has also introduced a new blend of\nall-natural sweeteners comprised of organic stevia and monk fruit to\nachieve a rounder taste, which combined with cane sugar, help reduce\ncalories to only 50 calories per can, which is three times fewer calories\nand sugar than the competition.\n\n     GURU Guayusa Tropical Punch: Inspired by the Jivaro\nThe Jivaro people have long been considered fierce warriors. Going back to\nthe expansion of the Inca Empire, the Jivaro fought to remain free of Inca\ncontrol, and later, against Spanish conquistadors, during their conquest of\nSouth America. The Guayusa superleaf, which comes from a small tree that\ngrows in the Ecuadorian rainforest, became the Jivaro's secret weapon. It\nwas used as a tea for the watchmen to stay awake at night, and also became\npart of their morning ritual as they prepared for battle. Today, Guayusa\nremains a part of everyday life, consumed as a substitute for tea or\ncoffee, and recognized for boosting physical energy, increasing mental\nclarity and alertness, as well as its antioxidant properties.\n\n     GURU Guayusa Tropical Punch is now available in most convenience and\ngrocery stores across Quebec, through GURU's exclusive Canadian\ndistribution partner, PepsiCo(R) Beverages Canada, and will be available in\nother Canadian provinces in the spring of 2022.\n\n     Watch our launch ad.\n\n     About GURU Products\nAll GURU energy drinks are plant-based, high in natural caffeine, free of\nartificial sweeteners, artificial colours and flavours, and have no\npreservatives. In addition, all drinks are organic, vegan and gluten free -\nand the best thing is their amazing taste.\n\n     About GURU\nGURU Organic Energy Corp. (TSX: GURU) is a dynamic, fast-growing beverage\ncompany launched in 1999, when it pioneered the world's first natural,\nplant-based energy drink. The Company markets organic energy drinks in\nCanada and the United States through a distribution network of more than\n21,000 points of sale, and through guruenergy.com and Amazon. GURU has\nbuilt an inspiring brand with a clean list of organic plant-based\ningredients. Its drinks offer consumers good energy that never comes at the\nexpense of their health. The Company is committed to achieving its mission\nof cleaning the energy drink industry in Canada and the United States. For\nmore information, go to www.guruenergy.com or follow us @guruenergydrink on\nInstagram and @guruenergy on Facebook.\n\n     Forward-Looking Statements\nThis press release may contain \"forward-looking statements\" within the\nmeaning of applicable Canadian securities legislation. Such forward-looking\nstatements include, but are not limited to, information with respect to our\nobjectives and the strategies for achieving those objectives, as well as\ninformation with respect to our beliefs, plans, expectations,\nanticipations, estimates and intentions. Forward-looking statements are\ntypically identified by the use of words such as \"may\", \"would\", \"should\",\n\"could\", \"expect\", \"intend\", \"estimate\", \"anticipate\", \"plan\", \"foresee\",\n\"believe\", or \"continue\", although not all forward-looking statements\ncontain these words. Forward-looking statements are provided for the\npurposes of assisting the reader in understanding the Company and its\nbusiness, operations, prospects and risks at a point in time in the context\nof historical and possible future developments, and the reader is therefore\ncautioned that such information may not be appropriate for other purposes.\nForward-looking statements are based on assumptions and are subject to a\nnumber of risks and uncertainties, many of which are beyond our control,\nwhich could cause actual results to differ materially from those that are\ndisclosed in or implied by such forward-looking statements. Those risks and\nuncertainties include the following management of growth; reliance on key\npersonnel; changes in consumer preferences; significant changes in\ngovernment regulation; criticism of energy drink products and/or the energy\ndrink market; economic downturn and continued uncertainty in the financial\nmarkets and other adverse changes in general economic or political\nconditions, as well as the COVID-19 pandemic or other major macroeconomic\nphenomena; global or regional catastrophic events; fluctuations in foreign\ncurrency exchange rates; revenues derived entirely from energy drinks;\nincreased competition; relationships with co-packers and/or their ability\nto manufacture GURU's products; relationships with existing customers;\nchanging retail landscape; increases in costs and/or shortages of raw\nmaterials and/or ingredients and/or fuel and/or costs of co-packing;\nfailure to accurately estimate demand for its products; intellectual\nproperty rights; maintenance of brand image or product quality; retention\nof the full-time services of senior management; climate change; litigation;\ninformation technology systems; fluctuation of quarterly operating results;\nno assurance of continued profitability or positive EBITDA; and conflicts\nof interest. Certain assumptions were made in preparing the forward-looking\nstatements concerning availability of capital resources, business\nperformance, market conditions and consumer demand. Consequently, all of\nthe forward-looking statements contained herein are qualified by the\nforegoing cautionary statements, and there can be no guarantee that the\nresults or developments that we anticipate will be realized or, even if\nsubstantially realized, that they will have the expected consequences or\neffects on our business, financial condition or results of operation.\nUnless otherwise noted or the context otherwise indicates, the\nforward-looking statements contained herein are provided as of the date\nhereof, and we do not undertake to update or amend such forward-looking\nstatements whether as a result of new information, future events or\notherwise, except as may be required by applicable law.\n\n\nContact:\n\n//st\n\nGURU Organic Energy\n\nInvestors Carl Goyette, President and     Media Lyla Radmanovich PELICAN\nCEO Ingy Sarraf, Chief Financial          PR 514-845-8763\nOfficer 514-845-4878                      media@rppelican.ca\ninvestors@guruenergy.com\n\n//et\n\n     Photos accompanying this announcement are available at:\n\n<a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/55fe244c-9203-486a-81c2\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.globenewswire.com/NewsRoom/AttachmentNg/55fe244c-9203-486a-81c2</a>\n-e8cf17a875b2\n\n<a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/a96b21f1-cd09-48c6-b07a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.globenewswire.com/NewsRoom/AttachmentNg/a96b21f1-cd09-48c6-b07a</a>\n-c6ccb3b3fce7\n\n<a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/22de12fd-9a18-4c40-a185\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.globenewswire.com/NewsRoom/AttachmentNg/22de12fd-9a18-4c40-a185</a>\n-2be0299fd95b\n\nTel   : 514-845-4878    GURU ORGANIC ENERGY CORP\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2131100454.MNPRE2131101824-09132420211108</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}