{"date": "2022-01-27 15:11:03.456000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2799.72, "close": 2792.75}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>RACKSPACE TECHNOLOGY INC (\"RXT-Q\")\n- Pipedrive enhances service with Rackspace Technology Private Cloud\n- management and UK data centre\n\n     Pipedrive, the global sales-first CRM and intelligent revenue\nmanagement platform for small businesses, announced the opening of a newly\nbuilt Rackspace OpenStack private cloud environment in the UK, provided by\nRackspace Technology(R) a leading end-to-end, multicloud technology\nsolutions company.\n\n     Now live, the private cloud environment brings Pipedrive closer to its\nEuropean customers outside of the EU, including in the UK. The presence\nensures Pipedrive is able to minimise response times and meet these\nterritories' security, compliance and data sovereignty requirements.\n\n     In addition, Pipedrive will be enhancing its managed Amazon Web\nServices (AWS) environment to launch additional application regions via\nAWS, further expanding its reach for customers.\n\n     Pipedrive, the New York headquartered, Estonian-born unicorn\ntechnology company, adds the UK data centre as a fourth cloud region to\nbetter scale the platform to the needs of regional customers. The addition\nalso lessens the risk to customers in the unlikely event of data centre or\nconnectivity issues across the world through a strategy of multiple\nregions. This reduces the risk of congestion or saturation on the platform\nand, therefore, the requirement for engineering remediation.\n\n     Following this launch, Pipedrive is also planning for its first\ncustomer migrations to the region.\n\n     Agur Jogi, CTO, Pipedrive, said: \"Pipedrive has grown dramatically\nfrom a 2010 start-up to a company with nearly 100,000 users in more than\n150 countries worldwide. We significantly benefit from the innovation\nRackspace Technology offers customers and as our managed cloud provider\nthey help us to scale to match our rapidly growing customer base.\"\n\n     Andy Brierley, UK General Manager at Rackspace Technology, said:\n\"Pipedrive relies on state-of-the-art technologies for maximum security and\navailability which our robust and innovative cloud capabilities afford. As\nPipedrive continues to grow, it will be supported by our flexible approach\nand team of experts to enable the best outcomes for its customers.\"\n\n     Pipedrive also maintains datacentre infrastructure in Frankfurt and\nChicago, both provided by Rackspace Technology.\n\n     About Pipedrive\nFounded in 2010, Pipedrive is the sales-first CRM and intelligent revenue\nmanagement platform for small businesses. Today, Pipedrive is used by\nrevenue teams at nearly 100,000 companies worldwide. Pipedrive is\nheadquartered in New York and has offices across Europe and in the US. The\ncompany is backed by a majority holder Vista Equity Partners, and Bessemer\nVenture Partners, Insight Partners, Atomico, DTCP, and Rembrandt Venture\nPartners. Learn more at www.pipedrive.com.\n\n     About Rackspace Technology\nRackspace Technology is a leading end-to-end multicloud technology services\ncompany. We can design, build and operate our customers' cloud environments\nacross all major technology platforms, irrespective of technology stack or\ndeployment model. We partner with our customers at every stage of their\ncloud journey, enabling them to modernize applications, build new products\nand adopt innovative technologies.\n\n Contact Information:\n\nContact:Devika Mistry\nEMEA Rackspace Technology Corporate Communications\nDevika.mistry@rackspace.co.uk\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2202600377.MNPRE2202601789-07024420220127</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}