{"date": "2021-12-17 18:29:18+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3377.42, "close": 3341.58}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-story-p1\"><span class=\"tr-dateline\">EDWARDSVILLE, Ill., Dec 17 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Families and friends of six workers who died after a tornado tore into an Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> warehouse expressed sadness and anger as they said final farewells to the victims in a series of vigils Friday.</p><p>On Dec. 10, a barrage of tornadoes ripped through six U.S. states, leaving a trail of death and destruction at homes and businesses stretching more than 200 miles (322 km). </p><p>The six workers in an Amazon delivery station were among those who died. The site received tornado warnings between 8:06 p.m. and 8:16 p.m. before the tornado struck the building at 8:27 p.m., according to Amazon. </p><p>Amazon managers had directed workers to shelter in bathrooms after receiving emergency alerts on mobile phones from authorities, several employees previously told Reuters. At least one worker died while sheltering in the bathroom, his co-worker said.</p><p>Paige Marquis, friend and former roommate of Clayton Lynn Cope, one of the workers who perished, said, “They all want to blame the building. But what about the response inside? They shouldn’t have had to keep working when they knew the storm was coming.\"</p><p>One Amazon employee who asked not to be identified said lots of workers are confused and angry. She told Reuters that all the dead were contractors and not Amazon employees.</p><p>Amazon previously said employees had been directed to shelter in place at a designated assembly area at the front of the building, which was near a restroom.</p><p>A dogwood tree was planted outside a municipal building in remembrance of the victims. \"We're a tight knit community,\" Edwardsville Mayor Art Risavy said Friday. \"It will take time to heal.”</p><p>The National Weather Service said the tornado hit the area between 8:28 and 8:32 p.m. central time, intensifying rapidly as it struck the Amazon warehouse. </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Karl Plume and Richa Naidu<br/>Editing by Alistair Bell)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:richa.naidu@tr.com\" data-type=\"email\" translate=\"no\">richa.naidu@tr.com</a> ; Follow me on Twitter <a href=\"https://twitter.com/Richa_Writes;\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/Richa_Writes;</a> +1 312 636 8874; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-WEATHER/TORNADOES-AMAZON.COM (PIX)</p></div>"}