{"date": "2021-11-20 07:28:25.470000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3696.06, "close": 3572.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Mumbai (Maharashtra) [India], November 19 (ANI/NewsVoir): Just as they launched Max Protein Cookies, three delicious favours Choco Chips, Oats &amp; Raisins, Nuts &amp; Seeds in the month of February 2021, as outrageous as that may seems, and with the little that they listed their products out there in the market, people started grabbing the single packs, pack of 6, pack of 12 from multiple sales channels like major retail outlets, pharmacies, Amazon, Flipkart, Big Basket, Max protein website &amp; so on.</p><p>Mumbai (Maharashtra) [India], November 19 (ANI/NewsVoir): Just as they launched Max Protein Cookies, three delicious favours Choco Chips, Oats &amp; Raisins, Nuts &amp; Seeds in the month of February 2021, as outrageous as that may seems, and with the little that they listed their products out there in the market, people started grabbing the single packs, pack of 6, pack of 12 from multiple sales channels like major retail outlets, pharmacies, Amazon, Flipkart, Big Basket, Max protein website &amp; so on.</p></div><div class=\"tr-npp-body\"><p>Just like their popular Max Protein Bars being sold over 1+ crore units every year, also being recognised as 'Best Snack of the Year' by CIMS. Max Protein Cookies seems to be in the same league for them. 10,00,000+ units of Max Protein Cookies being sold within 4 months of its initial launch.</p><p>Max Protein premium cookies was launched to have that mindful breakfast. At Last, a Cookie You Can Eat for Breakfast. And it's packed with superfoods, too. What could be better? Max Protein Cookies for your Max Mornings!</p><p>Clean Indulgence: Indulge in our Max Protein cookies while meeting your diet goals. Each bite only takes you towards your goal. These delicious protein cookies have the right amount of carbs, protein, and whole lot of flavor.</p><p>Committed to Nutrition: Committed to your health and taste buds, Max protein ensure nutrition in every bite. Max Protein cookies has 10 gm Protein that equals 2 cups of dal, 4 gm Fiber that equals 1 apple, 300 mg Calcium that equals 1 glass of milk. It can't get better than this.</p><p>Goodness of Grains: Max Protein cookies are made with the goodness of 7 grains like Oats, Ragi, Quinoa, Corn, Wheat, Bengal gram and amaranth. This keeps you full and helps you curb your cravings.</p><p>No Nasties: These cookies were created from a simple idea: food should taste as good for you with zero compromises. They don't add preservatives, GMO Free and don't use MAIDA.</p><p>Comfort Foods for Cravings: Be it breakfast or midnight cravings or post lunch sweet tooth cravings, Max Protein Cookie is a sweet treat that you can indulge in without feeling guilty.</p><p>Made in India: Max Protein is the first brand to launch nutrition &amp; protein bars in India. They have created and nurtured protein bars category in Indian Market.</p><p>After successfully carving a niche for itself in the protein cookie market with Max Protein Choco Chips, Oats &amp; Raisins, Nuts &amp; Seeds Cookie variants, 'Max Protein' is now launching even more better and innovative variants in its all new seven-grain breakfast soft Protein Cookies segment. With the three existing yummy flavours of Cookies. A little recap of our existing flavours...</p><p>Choco Chips: Wouldn't you like a bunch of rich choco chips meting into your mouth? Ahh! Then don't just drool in your imagination. Grab this giant Chocolate Chip Cookie and drool over it in reality! Have it for breakfast, snack or even for a dessert. Just make sure there's no one around because you wouldn't want to share it.</p><p>Oats &amp; Raisins: Got a minute? Come here, take an oat with this! Say it out loud - \"I'll never miss my breakfast again.\" And why would you, when you'll have a giant Oats and Raisin Cookie by your side to munch in the morning! It's nutritious, healthy and will fill your tummy.</p><p>Nuts &amp; Seeds: Just wanted to seed in some good snackin' vibes into your day. Give yourself a break from anything and everything that you are doing and regain your energy with Nuts &amp; Seeds cookie. It boosts your energy with its high protein level.</p><p>Founder &amp; CEO Vijay Uttarwar said, \"Health functionality is important for Indian consumers while choosing cookies or any snacking, the key driver of choice in the category still remains sensory satisfaction - 'Taste'. So, balancing the taste and health, we have launched Max Protein Cookies in multiple innovative flavours, delivering on taste, being big in size, having soft &amp; chewy mouthfeel, as well as ticking all the health parameter with the 7 grains, Protein, Calcium, No Maida, No preservatives.\"</p><p>Chili Chocolate: It may sound like a strange combination of flavours, but chocolate and chilli are a match made in heaven. Sweet and savoury flavours complement each other, and roasted almonds add flavour and textural contrast. Chilli Chocolate are a taste sensation which will excite your senses and satisfy your chocolate cravings.</p><p>Trail Mix: Trail mix is a snack mix with a mix of ingredients like Multigrain, pulses - Wheat, Corn, Oats, Ragi, Quinoa, Amaranth, Roasted Chickpea, Raisins, Butterscotch Balls, Cranberries, Dried Black Currants. Trail mix is a great source of protein and heart-healthy fats. Trail mix is a popular snack that's enjoyed for its flavor, versatility, and portability.</p><p>Choco Coconut: It's a scrumptious recipe, the cookies are a great combination of soft and chewy, like a mix between macaroons and chocolate cookies. The recipe calls for shredded coconut so that the coconut flavor shines through. Add these cookies to your everyday breakfast routine.</p><p>Coconut Delite: Soft &amp; Chewy Cookies that are loaded with desiccated coconut is made from fresh coconut that has been grated on these delicious cookies. The texture is thick, soft, and pleasantly chewy. The cookies are delicious and full of coconut flavor, without being overpowering. For your pretty intense sweet tooth, this cookie will be a big treat for you that has lot of nutritional value.</p><p>Why Max Protein Snacks?</p><p>Max Protein's healthy snack products are a blend of protein and fibre, which provides sustained energy. Meanwhile, it is having enough protein that helps in building block of muscles and improve alertness and activeness. It is pertinent to mention that all the products under Max Protein brand are having a long shelf life of six to nine months without any preservatives. Also, these snacks are low on sugar with no artificial sweeteners.</p><p>Max Protein is a homegrown brand, which believes in the ideology of Go Vocal for Local, and all the products are manufactured in India. With this, the company aims to make India Protein Rich and nutritionally efficient with a product range that is high on protein and energy, it addresses the needs of every member in the household. There is a need of strong ecosystem in India, to educate, make aware, engage people regarding health culture, Max Protein will take a lead for such initiatives.</p><p>More information: <a href=\"https://maxprotein.in/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.maxprotein.in</a> </p><p>Facebook: <a href=\"https://www.facebook.com/MaxProteinSnacks\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.facebook.com/MaxProteinSnacks</a> </p><p>Instagram: <a href=\"https://www.instagram.com/ritebite_maxprotein/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.instagram.com/ritebite_maxprotein</a> .</p><p>This story is provided by NewsVoir. ANI will not be responsible in any way for the content of this article. (ANI/NewsVoir)</p><p>Copyright © 2021 aninews.in All rights reserved. Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SyndiGate. All Rights Reserved.</p></div>"}