{"date": "2021-12-01 18:42:29.876000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NEPRA FOODS INC (\"NPRA-Z\")\n- Rolling Out Red Carpet For The National Debut Of PROPASTA At\n- Natural Foods Expo West\n\n     Nepra Foods Inc. (\"Nepra\"), creator of nutritious plant-based and\nallergen-free food, will debut its new consumer line of PROPASTA(TM) frozen\nmeals at Natural Products Expo West, which takes place March 8-12th, 2022\nin Anaheim, CA. To maximize the impact of this national debut, Nepra has\nsecured a double booth to showcase sales collateral and serve samples of\nvarious PROPASTA(TM) meals including Spaghetti and Meatballs,\nRicotta-stuffed Ravioli, and Chicken Chow Mein.\n\n     Natural Products Expo, part of the New Hope Network family of brands,\nis the premier trade show for the natural, organic, and healthy products\nindustry. Professionals from around the world attend to network, learn,\nsample, and buy new products. Established brands like KIND, Cascadian\nFarms, Applegate, Califia Farms, and hundreds more use the event as a\nlaunching pad for new releases. Natural Products Expo is also the\npre-eminent platform for new and emerging brands, attracting major\nretailers like Whole Foods, Kroger, Sprouts, Natural Grocers, Earth Fare,\nFresh Thyme Markets, and other buyers who are looking for the next big\nthing.\n\n     This year's Expo will feature industry leaders like Cedarlane Natural\nFoods, Chosen Foods, Conagra Brands, Dr. Praeger's Sensible Foods, General\nMills, Goya Foods, Red's All Natural, Stonewall Kitchen, Tofurky, and\nothers. As an emerging innovator, PROPASTA(TM) will stand out with\nnutritious meals that offer bioavailable plant-based protein, balanced\ncarbs, are naturally free of gluten and the top nine allergens - a\ncombination no other frozen food brand can claim.\n\n     \"I am so proud to be able to debut PROPASTA(TM) as our community comes\ntogether again at Expo West. It is powerful to synergize with key\nretailers, foodies, and influencers that align in our belief that a big\npart of sustainability is making nutritious plant-based meals easy for\npeople to eat,\" says Nepra's VP of CPG Sales, Kate Cash\n\n     The 8'x20' PROPASTA booth will be located on Level 200 in the North\nHall, Booth #N1743, as part of the \"Hot Products\" section.\n\n     About Nepra Foods\n\n     Nepra Foods is grounded in a passion for food. We believe eating\nhealthy shouldn't be difficult. Everybody deserves food options that are\ntruly nutritious and taste good. Food shouldn't contain allergens that\nmight prevent everybody in the family from enjoying it together. People\nshouldn't have to compromise quality and taste in what they eat even if\nthey are trying to cut down on carbs, don't tolerate gluten or dairy very\nwell, or don't want to eat food produced from animals. NepraFoods is on a\nmission to make healthy, enjoyable food for everybody.\n\n     Forward-Looking Statement\n\n     This news release contains statements and information that, to the\nextent that they are not historical fact, constitute \"forward-looking\ninformation\" within the meaning of applicable securities legislation.\nForward-looking information is based on the reasonable assumptions,\nestimates, analysis and opinions of management made in light of its\nexperience and its perception of trends, current conditions and expected\ndevelopments, as well as other factors that management believes to be\nrelevant and reasonable in the circumstances at the date that such\nstatements are made, but which may prove to be incorrect.\n\n     Forward-looking information involves known and unknown risks,\nuncertainties and other factors that may cause the actual results,\nperformance or achievements of the Company to differ materially from any\nfuture results, performance or achievements expressed or implied by the\nforward-looking information, including, but not limited to, the statements\nrelating to the Company's financial performance, business development and\nresults of operations. Accordingly, readers should not place undue reliance\non any such forward-looking information. Further, any forward-looking\nstatement speaks only as of the date on which such statement is made. New\nfactors emerge from time to time, and it is not possible for the Company's\nmanagement to predict all of such factors and to assess in advance the\nimpact of each such factor on the Company's business or the extent to which\nany factor, or combination of factors, may cause actual results to differ\nmaterially from those contained in any forward-looking statements. The\nCompany does not undertake any obligation to update any forward-looking\ninformation to reflect information, events, results, circumstances or\notherwise after the date hereof or to reflect the occurrence of\nunanticipated events, except as required by law including securities laws.\n\n     Media Contacts\n     Joel Primus\n     investors@neprafoods.com\n     Investor Relations Toll-free: (844)-566-1917\n\n     David Wood, CEO\n     david.wood@neprafoods.com\n     (720)-729-8500\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133400793.MNPRE2133402993-10223620211201</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}