{"date": "2021-11-30 15:41:12.108000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SUMO LOGIC INC (\"SUMO-Q\")\n- Unifies Intelligence Framework to Accelerate Discovery and\n- Response to Security Threats\n\n     Sumo Logic the pioneer in continuous intelligence, announced four new\nSumo Logic AWS Quick Start integrations for rapid access to security and\ncompliance insights and support for Amazon Inspector. Aligned with the AWS\nSecurity Reference Architecture, the Quick Start integrations automate the\ncollection and analysis of security events. With these new integrations and\ninsights, Sumo Logic customers can securely embark on a cloud migration and\nadoption journey by leveraging an automated, repeatable, intelligence\nframework to accelerate discovery and response to security threats.\n\n     \"Data is king, and Sumo Logic provides data when and how customers\nneed it to help them stay ahead of the next threat,\" said Greg Martin, VP\nand GM of the Security Business Unit for Sumo Logic. \"Today, we are\ndelighted to offer support for and be part of the unveiling of Amazon\nInspector, automate the integration with AWS Security Reference\nArchitecture, and reinforce that we are the partner of choice for companies\ntaking the cloud journey with AWS.\"\n\n     Read the blog: Announcing New Sumo Logic AWS Security Quick Start\nintegrations\n\nSumo Logic Cloud Security Monitoring &amp; Analytics Advances Value from AWS\nInvestments\n\n     Sumo Logic offers 12 Quick Start integrations for AWS delivering\nout-of-the-box queries, alerts, and dashboards to detect active threats\nquickly. This allows security engineers to set a common architecture to\ntackle critical detection and investigation use cases. This includes the\nnew AWS Inspector as well as integrations for AWS GuardDuty, AWS Web\nApplication Firewall (WAF), and AWS Security Hub.\n\n     As an integration partner for Amazon Inspector, Sumo Logic reveals\ntrends and identifies anomalies in Inspector scan results in real-time.\nThis helps customers surface critical security insights by understanding\nhow application and infrastructure changes impact scan results to help\nprovide critical insights customers need to be successful in AWS.\n\n     New dashboards also enable the visualization of logs and metrics in\none unified view, featuring an updated UI including honeycomb\nvisualization. With the latest release of Sumo Logic AWS Quick Start\nintegrations, Sumo Logic applies a broad view of security operations with\nmonitoring and analytics dashboards that identify the needle in a haystack\nto derive actionable security insights.\n\n     The Sumo Logic Continuous Intelligence Platform(TM) is the\nservices-oriented, intelligence platform for modern security operations. It\nserves as the backbone for the suite of Sumo Logic security intelligence\nsolutions, delivering a cloud-native, open and flexible infrastructure that\nallows enterprises to realize additional value from its AWS investments.\n\n     In two separate announcements, Sumo Logic also unveiled that it was\nnamed ISV Partner of the Year by Amazon Web Services and detailed its\nsupport for expanded tracing visibility into AWS Lambda.\n\n     About Sumo Logic\nSumo Logic Inc. (Nasdaq: SUMO) is the pioneer in continuous intelligence, a\nnew category of software, which enables organizations of all sizes to\naddress the data challenges and opportunities presented by digital\ntransformation, modern applications, and cloud computing. The Sumo Logic\nContinuous Intelligence Platform(TM) automates the collection, ingestion,\nand analysis of application, infrastructure, security, and IoT data to\nderive actionable insights within seconds. More than 2,100 customers around\nthe world rely on Sumo Logic to build, run, and secure their modern\napplications and cloud infrastructures. Only Sumo Logic delivers its\nplatform as a true, multi-tenant SaaS architecture, across multiple\nuse-cases, enabling businesses to thrive in the Intelligence Economy. For\nmore information, visit www.sumologic.com.\n\n     Sumo Logic is a trademark or registered trademark of Sumo Logic in the\nUnited States and in foreign countries. All other company and product names\nmay be trademarks or registered trademarks of their respective owners.\n\n     Any information regarding offerings, updates, functionality, or other\nmodifications, including release dates, is subject to change without\nnotice. The development, release, and timing of any offering, update,\nfunctionality, or modification described herein remains at the sole\ndiscretion of Sumo Logic, and should not be relied upon in making a\npurchase decision, nor as a representation, warranty, or commitment to\ndeliver specific offerings, updates, functionalities, or modifications in\nthe future.\n\n Contact Information:\n\nContact:Carmen Harris\nSumo Logic\ncharris@sumologic.com\n(650) 414-1584\n\nTel   : 650-810-8700    SUMO LOGIC INC\nWWW   : <a href=\"https://www.sumologic.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.sumologic.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133300344.MNPRE2133302238-07213120211130</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}