{"date": "2021-06-15 08:59:24+00:00", "ticker": "AVV", "mrkt_info": {"open": 3536.0, "close": 3598.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Dubai, UAE -</strong> AVEVA, a global leader in industrial software, driving digital transformation and sustainability, will host its fourth AVEVA World Digital (AWD) conference on the 17<sup>th</sup> June 2021. Aimed at leaders and decision makers interested in innovative industrial technology, to deliver digital transformation and strengthen resilience in a challenging environment, this is the first joint AVEVA and PI System event since the company acquired OSIsoft earlier this year. AWD, a half-day event, will explore how data-led insights infused with artificial intelligence can help organizations optimize their value chains for long-term business growth.</p>\n<p>AVEVA’s recently appointed CEO, Peter Herweck, will kick-off proceedings with a session that lays out how Performance Intelligence, the concept developed by AVEVA to explain the outcome of combining information, artificial intelligence and human insight. Also, in the presenter line-up will be Nicole Malachowski, the first female United States Air Force fighter pilot to be part of the elite Thunderbirds squadron, who will address resilience and innovation by speaking from her own debilitating experience with Lyme Disease. Having lost the ability to read, write, walk, and fly, the one-time advisor to former US First Lady Michelle Obama tapped into her aerodynamic training bounce back – a secret she will share with AWD attendees.</p>\n<p>“I am looking forward to virtually engaging our customers and partners at my first AVEVA World Digital as the company CEO and the first for former OSIsoft customers. Over the past year, digital transformation has demonstrated how trusted data and artificial intelligence can reshape the future of industries, as well as create new experiences and business opportunities,” commented Peter Herweck, CEO, AVEVA.  “We have witnessed how Cloud, and the Industrial Internet of Things (IIoT) continue to drive operational resilience in a digital-first environment. Today, AVEVA’s software is enabling organizations, throughout the globe, to harness greater efficiencies, increase agility and accelerate growth - all key factors in also advancing sustainability for industries.”</p>\n<p>Other keynote speakers will include a mix of AVEVA and former OSIsoft speakers - Lisa Johnston, Chief Marketing Officer and Chief Sustainability Officer, AVEVA, Norton Green, Director of  Executive Engagements, AVEVA; Rob McGreevy, Executive Vice President of Operations Business, AVEVA and Rónán de Hooge, Head of Information Management Business Unit, AVEVA.  A customer panel session comprising AVEVA and heritage OSIsoft customers, including Enbridge, Nutrien and General Mills, will end proceedings.</p>\n<p>Register for AVEVA World Digital today at: <a href=\"https://www.avevaworld.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.avevaworld.com</a> </p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}