{"date": "2021-11-03 12:00:00.677000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>HENDERSON, NV, Nov.  03, 2021  (GLOBE NEWSWIRE) -- via <a href=\"https://www.globenewswire.com/Tracker?data=fegSpCeyMaf5tMgoExh55w0b4Thi3Lz3sw_LudxNa9ks7GN9123yrtOHUZDi1tkEJhGsUbhWDj7BBVC69JpB6AmVdB5U86fDZyIki-gHWDw=\"><u>NewMediaWire</u></a> -- Grove, Inc. (NASDAQ:GRVI) (\"Grove\" or the \"Company\"): Grove Inc., a global innovator in hemp, health, and wellness, today announced the launch of its “Fund Your Brand” option on <a href=\"https://www.globenewswire.com/Tracker?data=J0JTzSQW-CBSTRAcSWpd6B1Ekxy3HrY5NfjuqPcL2y0cb-vjsqnBeIjvK54FLXrH2p5RxsGQqZBjRsjtO7omd_IuzFFQybChga9Fywfe51P9Ny3rTuL2vGR43_59CmSnA567YwD5qXirwNa22vBShCN4MQMmAcW9xGSk7CMlQcbOzV5jGGtfNMdUlzN30UoK\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Upexi</a>, its wholly owned division to acquire promising Amazon and Ecommerce businesses.<br/></p>      <p>In addition to buying and scaling Amazon and Ecommerce brands, Grove Inc.'s Upexi unit will provide capital to growing brands in need of funding.</p>      <p>Upexi has two operating segments: one that buys and scales Amazon and e-commerce brands, and one that provides funding to proven brands in need of capital to accelerate growth. Grove’s investment will include funding and assistance with growth in the Amazon ecosystem and direct-to-consumer markets for a perpetual royalty on the future sales of the brands’ products.   </p>      <p>Grove Inc. recently launched <a href=\"https://www.globenewswire.com/Tracker?data=J0JTzSQW-CBSTRAcSWpd6FqzfZVm3jyfKjIcNw382Eq_4pAX2Hrb9-bnS0-PCegs\"><u>Upexi</u></a> to use its market and e-commerce expertise in the Amazon aggregation market, which, according to <a href=\"https://www.globenewswire.com/Tracker?data=70kc5JsMFnyyj4iPdSoNSWvrqOE2hmr2xQqLjrnemu5YxJT4Ylm-er_L9UscTbumiHA57HNLJ8iKjMVZQD8XJ7DAIhAg8VlcGfA54fBfWeaOirjSycEmJYBGMmQonkKH\"><u>Marketplace Pulse</u></a>, has attracted more than $10 billion in funding since 2020.</p>      <p>Grove Inc. has made a name for itself in the Wellness space, growing <a href=\"https://www.globenewswire.com/Tracker?data=Cd1gObykaRHRrL4OfwGYOTPzIkgZPvxMKZkq0CQnbyN8SL4GmdPd0IN8KQ3x0mnAyATuL0Gu00wFwb0gZwoH98PC34GiuEpfpikUF8UF37hPdHwftSEVHyja9bkdR9fIEwb2tMfjDOidjPCQWp-lu7F6ToqGU-166VgtjqBvuXo=\"><u>2021 fiscal revenues</u></a> to $24.1 million, a 250% increase from the year prior. The company hopes to apply a similar growth model to other brands they acquire or fund through Upexi, although there are no guarantees of similar success given industry, market and economic forces.</p>      <p>“Between Amazon’s ecosystem and the meteoric rise of e-commerce over the last few years, direct-to-consumer brands are growing bigger and faster than ever,” says Chief Marketing Officer Nathan Stavseth. “Our goal is to identify winning D2C brands on the cusp of exponential growth, bring them into our ecosystem, and help them reach their full potential.”</p>      <p>The company recently acquired Vitamedica, an online nutraceutical company, which has seen a growing presence in ecommerce and Amazon since being acquired. Through its in-house team of digital marketers, Grove is now pursuing more companies in the health and wellness industry that they can take to the next level.</p>     <p><b>About Grove, Inc.</b></p>     <p>Grove, Inc. is in the business of developing, producing, marketing and selling quality products and end consumer products containing the industrial hemp plant extract Cannabidiol (“CBD”), as well as diversified products in other verticals. The Company sells to numerous consumer markets including the botanical, beauty care, pet care and functional food sectors. It seeks to take advantage of an emerging worldwide trend to re-energize the production of industrial hemp and to foster its many uses for consumers.</p>     <p align=\"justify\"><b>Company Contact</b></p>      <p align=\"justify\"><b>Andrew Norstrud</b><br/>Email: investorinfo@cbd.io<br/>Phone: (702) 332-5591</p>        <p align=\"justify\"><b>Investor Relations Contact</b></p>      <p align=\"justify\"><b>TraDigital IR</b><br/>John McNamara<br/>Email: john@tradigitalir.com<br/>Phone: (917) 658-2602</p>        <p><b>Forward-Looking Statements</b></p>     <p>This news release contains \"forward-looking statements\" as that term is defined in Section 27A of the United States Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Statements in this press release which are not purely historical are forward-looking statements and include any statements regarding beliefs, plans, expectations or intentions regarding the future. Actual results could differ from those projected in any forward-looking statements due to numerous factors. Such factors include, among others, the inherent uncertainties associated with business strategy, potential acquisitions, growth potential, revenue guidance, product development, integration and synergies of acquiring companies and personnel. These forward-looking statements are made as of the date of this news release, and we assume no obligation to update the forward-looking statements, or to update the reasons why actual results could differ from those projected in the forward-looking statements. Although we believe that the beliefs, plans, expectations and intentions contained in this press release are reasonable, there can be no assurance that such beliefs, plans, expectations or intentions will prove to be accurate. Investors should consult all of the information set forth herein and should also refer to the risk factors disclosure outlined in our annual report on Form 10-K and other periodic reports filed from time-to-time with the Securities and Exchange Commission.</p> <div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODM4NTQ0NyM0NTI5NjYzIzUwMDA4MTM4OQ==\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RNNE5UUTBOeU0wTlRJNU5qWXpJelV3TURBNE1UTTRPUT09&amp;key=210b1f8f38adbb1e4d89325fff3e9b64a045e0a75430c8ffb10fd35eb6237c444edf4090f412757e8a03d78250be6026a57bd91e37e62231d894518cf8436e22\"/></div></div> <br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/Njg2ZmZhZDgtODg3NC00ZDNhLTk1N2UtYzllZTkyZTgwNjBjLTUwMDA4MTM4OQ==/tiny/Grove-Inc-.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9OamcyWm1aaFpEZ3RPRGczTkMwMFpETmhMVGsxTjJVdFl6bGxaVGt5WlRnd05qQmpMVFV3TURBNE1UTTRPUT09L3RpbnkvR3JvdmUtSW5jLS5wbmc=&amp;key=e574aaeda39d8536f9e3b3687eea3fe123d5c15d0779ea92f10b4d7f3b800c7b4278da519690ab3efcb21756fc9f9c922fefb32aedf1afa5865076dd7ff31ecc\"/></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright GlobeNewswire, Inc. 2021</p></div>"}