{"date": "2021-11-22 20:03:19.332000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Payment giant Visa reportedly expects to sort out its dispute with e-commerce major <a href=\"http://Amazon.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com</a> over credit card fee.</p><p>The firm hopes to continue its co-branded credit card partnership with Amazon in the US, Visa CFO Vasant Prabhu told Reuters.Last week, Amazon said that it is planning to stop accepting payments made via Visa credit cards in the UK starting from next January.This decision is part of American e-commerce giant's move against high credit card fee charged by Visa.According to Amazon, the credit card fee should be \"going down over time with technological advancements, but instead they continue to stay high or even rise.\"The firm also said last week that it is considering pulling out of its credit card partnership with Visa in the US and is currently in talks with both Mastercard and Visa on the same.Prabhu told the news agency: \"It is our expectation that there will be a resolution so that UK consumers are not impacted.\"We hope to get to the point where our relationship with Amazon goes back to being what it was.\"Separately, Visa CEO Al Kelly criticised Visa's decision as 'odd and unfortunate' in an interview with Financial Times.Kelly told the publication: \"What's different here is that Amazon unfortunately decided to take the negotiation challenges that we're having public and oddly has chosen to threaten to punish consumers.\"Last year, Amazon removed Apple Card as a payment option for some users as result of a technical issue.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}