{"date": "2021-12-20 22:16:14.904000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SUPERNOVA PARTNERS ACQUISITION CO II LTD (\"SNII-N\")\n- Business Update and Nine-Month 2021 Financial Highlights\n\n   Rigetti Computing (\"Rigetti\" or the \"Company\"), a pioneer and leader in\nhybrid quantum-classical computing, today announced business highlights for\nthe year to date and financial highlights for the nine months ended October\n31, 2021. These highlights include approximately $6.9 million in revenue\nfor the nine months ended October 31, 2021, and the availability of the\nworld's first scalable multi-chip quantum processor.\n\n   Rigetti, currently a privately held company, announced in October 2021\nthat it had entered into an agreement and plan of merger with Supernova\nPartners Acquisition Company II (NYSE: SNII) (\"Supernova\"), a publicly\ntraded special purpose acquisition company. The proposed transaction is\nsubject to the approval of Supernova stockholders and other closing\nconditions. Following consummation of the proposed transaction, the\nsurviving combined company will be named Rigetti Computing, Inc.\n\n   GAAP Financial Highlights for Nine Months Ended October 31, 2021*\n\n   *  Revenue increased by 68% to $6.9 million for the nine-months ended\nOctober 31, 2021, from $4.1 million for the same period in 2020. The\nincrease in revenue was primarily driven by new customer relationships and\nthe expansion of existing development contracts.\n   *  Total operating expenses increased by 7%, to $32.0 million for the\nnine months ended October 31, 2021, from $29.8 million in same period in\n2020.\n   *  R&amp;D expenses increased by 14%, to $21.2 million for the nine months\nended October 31, 2021, from $18.6 million for the same period in 2020,\nrepresenting 66% of total operating expenses for the nine months ended\nOctober 31, 2021 and underscoring the Company's commitment to advancing its\ntechnology and product roadmap.\n   *  Net operating loss declined 3% to ($26.2) million for the nine months\nended October 31, 2021, from ($26.9) million in the same period in 2020.\n\n    \"We believe the time for quantum computing has arrived,\" said Chad\nRigetti, founder and Chief Executive Officer of Rigetti. \"Customer demand\nis increasing as Rigetti quantum computers begin to address high-impact\ncomputational problems.\n\n   \"Consistent with our mission to build the world's most powerful\ncomputers to help solve humanity's most important and pressing problems,\nRigetti achieved many critical milestones in 2021. We introduced the\n80-qubit Aspen-M system, the world's first multi-chip quantum processor,\nexpanded our customer and partner footprint, and delivered substantial\nyear-over-year revenue growth,\" continued Rigetti. \"We look forward to\ncontinued momentum as we expect customers to leverage the increasing speed\nand scale of Rigetti hardware and quantum solutions in their pursuits to\nsolve important problems that lie beyond the capabilities of today's\nclassical computers.\"\n\n   Rigetti is fully vertically integrated, from chip design and production\nto cloud delivery. Rigetti's primary business model is Quantum Computing as\na Service (\"QCaaS\"). In 2021, Rigetti introduced the world's first scalable\nmulti-chip quantum processor, which Rigetti believes is a key advancement\nin quantum processor scalability. Industry researchers estimate fully fault\ntolerant quantum computers could ultimately produce up to $850 billion in\nannual value creation for end-users and technology companies. Rigetti\nbelieves its scalable chip technology has the potential to help unlock this\ntransformative opportunity going forward.\n\n    Business Highlights in 2021 YTD\n\n   Technology Developments\n\n    World's First Scalable Multi-chip Quantum Processor\n\n   *  Rigetti launched the world's first multi-chip quantum processor in\nJune 2021. The processor incorporates a proprietary modular architecture\nthat accelerates the path to commercialization and solves key scaling\nchallenges toward fault-tolerant quantum computers.\n\n   40-Qubit System\n\n   *  Rigetti made its next generation 40-qubit system, featuring 2.5x\nspeedups in quantum processing time, available on Rigetti Quantum Cloud\nServices, Amazon Braket and Strangeworks Ecosystem in December 2021.\n\n   80-Qubit System\n\n   *  Rigetti made Aspen-M, its 80-qubit system powered by its proprietary\nmulti-chip technology, available to customers in private beta on its\nQuantum Cloud Services platform in December 2021.\n\n   Industry Collaboration Developments\n\n   Inclusion in Microsoft's Azure Quantum Service\n\n   *  Rigetti announced in December 2021 it is collaborating with Microsoft\nto provide Rigetti quantum computers over the cloud to users of Microsoft's\nAzure Quantum service. When the Rigetti system becomes available, it is\nexpected to be the largest quantum computer accessible on Azure Quantum.\nThe two companies expect the integration to be completed and available to\nusers of the service in the first quarter of 2022.\n\n    Collaboration with Deloitte and Strangeworks\n\n   *  Rigetti detailed its plans to collaborate with Deloitte and\nStrangeworks to explore quantum applications in material simulation,\noptimization, and machine learning in a December 2021 announcement.\n\n   Customer and Quantum-Application Developments\n\n   Predictive Weather Modeling with Quantum Machine Learning\n\n   *  Rigetti developed an effective solution to a weather modeling problem\nusing quantum computers and published the results in November 2021.\nBuilding on existing machine learning workflows, Rigetti applied a\ncombination of classical quantum machine learning techniques to produce\nhigh-quality synthetic weather radar data and improve classical models for\nstorm prediction. The work was performed on Rigetti's 32-qubit system,\ndemonstrating that practical applications are within reach for near-term\nquantum hardware.\n\n    Fusion Energy via Quantum Computing for Department of Energy\n\n   *  Rigetti announced in November 2021 it was selected to lead a quantum\nsimulation project for fusion energy awarded by the Department of Energy.\nRigetti is collaborating with Lawrence Livermore National Laboratory and\nthe University of Southern California on the three-year, $3.1 million\nproject that is designed to simulate plasma dynamics on Rigetti's\ncloud-based quantum computers.\n\n    Drug Discovery with Quantum Computing via Partnerships with Riverlane\nand Astex Pharmaceuticals\n\n   *  Rigetti UK Limited, a wholly owned subsidiary of Rigetti, announced\nin July 2021 that it is partnering with Riverlane and Astex Pharmaceuticals\nto develop an integrated application for simulating molecular systems using\nRigetti Quantum Cloud Services. This cooperation paves the way for new\ncommercial applications of Rigetti's quantum computing solutions, with the\npotential to transform drug discovery in pharmaceutical R&amp;D.\n\n    Talent Developments\n\n    Key Hires Bolster Rigetti's Talent\n\n   *  Rigetti appointed Brian Sereda to the position of Chief Financial\nOfficer of the Company in August 2021. Sereda has more than 25 years of\nsenior level financial experience, most recently serving as Chief Financial\nOfficer at Energous Corporation (NASDAQ: WATT) where he led the raise of\nsignificant working capital and oversaw finance, legal, investor relations,\nhuman resources and IT.\n\n    *  Rigetti appointed Jackie Kaweck to the position of Senior Vice\nPresident, Human Resources, in July 2021. Kaweck brings more than 20 years\nof experience in human resources and executive leadership to the role, most\nrecently as SVP, People at Vivid Seats.\n\n    *  Rigetti appointed David Pappas to the position of Senior Principal\nScientist in September 2021. Pappas joined the Company after 25 years at\nthe National Institute of Standards and Technology, where he most recently\nled the Quantum Processing Group. Rigetti also added Josh Mutus, former\nGoogle quantum research scientist, to its hardware development team as\nDirector, Quantum Materials in April 2021.\n    *The Company changed its fiscal year end from January 31 to December\n31, effective December 31, 2021, and will first reflect the change in\nfiscal years for interim and annual filings for fiscal years beginning\nJanuary 1, 2022.\n\n    About Rigetti Computing\n\n   Rigetti Computing is a pioneer in full-stack quantum computing. The\ncompany has operated quantum computers over the cloud since 2017 and serves\nglobal enterprise, government and research clients through its Rigetti\nQuantum Cloud Services platform. The proprietary quantum-classical\ninfrastructure provides ultra-low latency integration with public and\nprivate clouds for high-performance practical quantum computing. Rigetti\nhas developed the industry's first multi-chip quantum processor for\nscalable quantum computing systems. The Company designs and manufactures\nits chips in-house at Fab-1, the industry's first dedicated and integrated\nquantum device manufacturing facility. Rigetti was founded in 2013 by Chad\nRigetti and today employs more than 140 people with offices in the United\nStates, U.K. and Australia. Learn more at www.rigetti.com.\n\n   About Supernova Partners Acquisition Company II\n\n   Supernova II is led by Michael Clifton, who was most recently a\ntechnology investor at The Carlyle Group; Robert Reid, a long-time senior\npartner at Blackstone; Spencer Rascoff, a serial entrepreneur who\nco-founded Hotwire, Zillow, dot.LA and Pacaso and who led Zillow as CEO for\nnearly a decade; and Alexander Klabin, founder and CEO of Ancient and\nformer managing partner, co-CIO and co-founder of Senator Investment Group.\n\n   Additional Information and Where to Find It\n\n   Supernova Partners Acquisition Company II (\"Supernova\") has filed a\nregistration statement on Form S-4 with the Securities Exchange Commission\n(the \"SEC\"), which includes a proxy statement/prospectus, that will be both\nthe proxy statement to be distributed to holders of Supernova's common\nshares in connection with its solicitation of proxies for the vote by\nSupernova's shareholders with respect to the proposed business combination\nand other matters as may be described in the registration statement, as\nwell as the prospectus relating to the offer and sale of the securities to\nbe issued in the business combination. After the registration statement is\ndeclared effective, Supernova will mail a definitive proxy\nstatement/prospectus and other relevant documents to its shareholders. This\ncommunication does not contain all the information that should be\nconsidered concerning the proposed business combination and is not intended\nto form the basis of any investment decision or any other decision in\nrespect of the business combination. Supernova's shareholders and other\ninterested persons are advised to read, when available, the preliminary\nproxy statement/prospectus included in the registration statement and the\namendments thereto and the definitive proxy statement/prospectus and other\ndocuments filed in connection with the proposed business combination, as\nthese materials will contain important information about Rigetti Holdings,\nInc. (\"Rigetti\"), Supernova and the business combination. When available,\nthe definitive proxy statement/prospectus and other relevant materials for\nthe proposed business combination will be mailed to shareholders of\nSupernova as of a record date to be established for voting on the proposed\nbusiness combination. Shareholders will also be able to obtain copies of\nthe preliminary proxy statement, the definitive proxy statement and other\ndocuments filed with the SEC, without charge, once available, at the SEC's\nwebsite at www.sec.gov, or by directing a request to Supernova's secretary\nat 4301 50th Street NW, Suite 300 PMB 1044, Washington, D.C. 20016, (202)\n918-7050.\n\n   Participants in the Solicitation\n\n   Supernova and its directors and executive officers may be deemed\nparticipants in the solicitation of proxies from Supernova's shareholders\nwith respect to the proposed business combination. A list of the names of\nthose directors and executive officers and a description of their interests\nin Supernova is contained in Supernova's prospectus dated March 3, 2021\nrelating to its initial public offering, which was filed with the SEC and\nis available free of charge at the SEC's website at www.sec.gov. To the\nextent such holdings of Supernova's securities may have changed since that\ntime, such changes have been or will be reflected on Statements of Change\nin Ownership on Form 4 filed with the SEC. Additional information regarding\nthe interests of such participants will be contained in the proxy\nstatement/prospectus for the proposed business combination when available.\n\n   Rigetti and its directors and executive officers may also be deemed to\nbe participants in the solicitation of proxies from the shareholders of\nSupernova in connection with the proposed business combination. A list of\nthe names of such directors and executive officers and information\nregarding their interests in the proposed business combination will be\nincluded in the proxy statement/prospectus for the proposed business\ncombination when available.\n\n   No Offer or Solicitation\n\n   This communication does not constitute (i) a solicitation of a proxy,\nconsent or authorization with respect to any securities or in respect of\nthe proposed business combination or (ii) an offer to sell, a solicitation\nof an offer to buy, or a recommendation to purchase any security of\nSupernova, Rigetti, or any of their respective affiliates.\n\n   Forward-Looking Statements\n\n   Certain statements in this communication may be considered\nforward-looking statements. Forward-looking statements generally relate to\nfuture events and can be identified by terminology such as \"pro forma\",\n\"may\", \"should\", \"could\", \"might\", \"plan\", \"possible\", \"project\", \"strive\",\n\"budget\", \"forecast\", \"expect\", \"intend\", \"will\", \"estimate\", \"anticipate\",\n\"believe\", \"predict\", \"potential\" or \"continue\", or the negatives of these\nterms or variations of them or similar terminology. Such forward-looking\nstatements are subject to risks, uncertainties, and other factors which\ncould cause actual results to differ materially from those expressed or\nimplied by such forward looking statements. These forward-looking\nstatements are based upon estimates and assumptions that, while considered\nreasonable by Supernova and its management, and Rigetti and its management,\nas the case may be, are inherently uncertain. Factors that may cause actual\nresults to differ materially from current expectations include, but are not\nlimited to: the outcome of any legal proceedings that may be instituted\nagainst Supernova, Rigetti, the combined company or others following the\nannouncement of the business combination and any definitive agreements with\nrespect thereto; the inability to complete the proposed business\ncombination due to the failure to obtain approval of the shareholders of\nSupernova or to satisfy other conditions to closing; changes to the\nproposed structure of the business combination that may be required or\nappropriate as a result of applicable laws or regulations or as a condition\nto obtaining regulatory approval of the business combination; the ability\nto meet stock exchange listing standards\n\n   following the consummation of the business combination; the risk that\nthe proposed business combination disrupts current plans and operations of\nRigetti as a result of the announcement and consummation of the business\ncombination; the ability to recognize the anticipated benefits of the\nbusiness combination, which may be affected by, among other things,\ncompetition, the ability of the combined company to grow and manage growth\nprofitably, maintain relationships with customers and suppliers and retain\nits management and key employees; costs related to the business\ncombination; changes in applicable laws or regulations; the possibility\nthat Rigetti or the combined company may be adversely affected by other\neconomic, business, or competitive factors; Rigetti's estimates of expenses\nand profitability; the evolution of the markets in which Rigetti competes;\nthe ability of Rigetti to execute on its technology roadmap; the ability of\nRigetti to implement its strategic initiatives, expansion plans and\ncontinue to innovate its existing services; the impact of the COVID-19\npandemic on Rigetti's business; and other risks and uncertainties set forth\nin the section entitled \"Risk Factors\" and \"Cautionary Note Regarding\nForward-Looking Statements\" in the registration on Form S-4 and proxy\nstatement/prospectus discussed above and other documents filed with\nSupernova from time to time with the SEC.\n\n   Nothing in this communication should be regarded as a representation by\nany person that the forward-looking statements set forth herein will be\nachieved or that any of the contemplated results of such forward-looking\nstatements will be achieved. You should not place undue reliance on\nforward-looking statements, which speak only as of the date they are made.\nNeither Supernova nor Rigetti undertakes any duty to update these\nforward-looking statements.\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2135300756.MNPRE2135302765-14153220211220</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}