{"date": "2022-01-19 00:04:08.219000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_ik6sx370&amp;referenceId=tag:reuters.com,2022:newsml_OVFUROX3F_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_ik6sx370&amp;referenceId=tag:reuters.com,2022:newsml_OVFUROX3F_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: Wall Street's main indexes fell sharply on Tuesday as weak results from Goldman Sachs weighed on financial stocks and tech shares continued their sell-off as U.S. Treasury yields rose to milestones. Fred Katayama reports.<br/>Short Link: <a href=\"https://refini.tv/3GB2Vs5\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3GB2Vs5</a><br/><br/>Video Transcript:<br/><br/>Stocks and bonds got slammed on Wall Street Tuesday after disappointing earnings from Goldman Sachs dragged down the Dow and financial stocks, while a spike in benchmark Treasury yields to two-year highs dealt a blow to rate-sensitive tech titans like Apple and Amazon. Trader Jeff Tomasulo of Vespula Capital says the sell-off could steepen much further.<br/><br/>We are seeing now people trying to figure out, trying to jockey around with how they're gonna rebalance their portfolios, knowing that going forward that we're going to have higher interest rates and that we're going to have a taper. And that the sugar bowl, or whatever you want to call it, is getting pulled away.<br/><br/>The Dow dropped nearly 550 points or 1.5%. The S&amp;P 500 slid 1.8%. The NASDAQ cascaded over 2.5%. Goldman Sachs shares tumbled 7%. Weakness in its trading business helped yank quarterly profit down almost 13%, falling short of Wall Streetâ\u0080\u0099s targets. Microsoft finished down 2.4%, making it the biggest drag on the S&amp;P and NASDAQ. Itâ\u0080\u0099s paying nearly $69 billion to buy video game publisher Activision Blizzard. Shares of the maker of the 'Call of Duty' franchise shot up by more than a fourth, making it the biggest gainer on both indexes.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}