{"date": "2022-01-22 01:15:58.661000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3033.35, "close": 2890.88}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Capgemini today announced that it has won three AWS Partner awards, in France, Germany and the UK. Capgemini won the Consulting Partner of the Year (France), GSI Partner of the Year (DACH) and Public Sector Partner of the Year (UK). The awards recognize AWS Partners who have leveraged the best of AWS Services and continued to expand and grow with AWS throughout the year.</p><p>Announced during the annual AWS Partner Summit, the AWS Partner Awards highlight a wide range of Partners, whose business models have embraced specialization and collaboration over the past year. The AWS Partner Awards also celebrate AWS Partners whose business models continue to evolve and thrive on the AWS Cloud as they work with customers, enabling them to build on Big Data analytics and take advantage of the benefits of Machine Learning and Artificial Intelligence.</p></div><div class=\"tr-npp-body\"><p>Capgemini and AWS have together enabled industry leaders across regions to realize the full value of AWS Cloud and helped to drive growth. They have also leveraged the power of AWS machine learning and contributed to sustainable ocean research through Capgemini?s Global Data Science Challenge.</p><p>?We?re delighted to receive three awards this year, which further highlight our capabilities to transform businesses and optimize their cloud investments. Together with AWS, Capgemini has leveraged technology and its deep industry expertise from working with clients in over 40 countries to offer end-to-end solutions, that help realize the full value of cloud migration, foster innovation and contribute to sustainable growth,? said Nico Steenkamp, Global Amazon Partner Executive at Capgemini.</p><p>The AWS Partner Network (APN) is the global community of businesses using AWS to build solutions and services for customers. AWS helps partners build, market, and sell their offerings by providing valuable business, marketing, and technical support on top of our proven, global, and secure infrastructure. AWS partners are uniquely positioned to help customers take full advantage of all that AWS has to offer and accelerate their journey to the cloud. AWS has millions of active customers and a dynamic community of over 100,000 partners globally.</p><p>?AWS Partners add value to customers across a wide range of industries around the world and are critical to their success. We are pleased to recognize a variety of partners through the APN Partner Awards EMEA 2021. I look forward to working together to a great 2022,? said Antonio Alonzo Lopez, EMEA Director Partner Success at AWS.</p><p>Capgemini is also a user of AWS Marketplace. AWS Marketplace is a curated digital catalog that makes it easy for customers to find, buy, consume, and manage third-party software, services, and data that customers need to build solutions and run their businesses. AWS Marketplace includes thousands of software listings across 50 categories such as security, networking, storage, machine learning, business intelligence, database, and DevOps. AWS Marketplace simplifies software licensing and procurement with flexible pricing options and multiple deployment methods. There are more than 2 million current software subscriptions and more than 310,000 customers using AWS Marketplace.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Euclid Infotech Pvt Ltd.</p></div>"}