{"date": "2022-02-07 06:01:11.693000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p> <br/>   By Siddhi Nayak<br/>NewsRise<br/>   MUMBAI (Feb 7) -- India’s National Company Law Appellate Tribunal today adjourned to Feb. 14 its hearing of a case filed by Amazon challenging the antitrust watchdog’s revocation of the U.S. online retailer’s 2019 deal with Future Coupons.<br/><br/>The NCLAT bench was presided by Justices M. Venugopal, V.P. Singh, and Shreesha Merla. The tribunal did not hear any arguments today given the paucity of time and adjourned the case.<br/><br/>Amazon has been locked in a long-drawn dispute with debt-ridden Future Group over the latter’s plan to sell the retail, wholesale, warehousing, and logistics businesses to billionaire Mukesh Ambani’s Reliance Industries in a deal worth $3.4 billion. <br/><br/>In 2019, Amazon had bought a 49% stake in Future Coupons, the group’s gift voucher unit, which owned a 7.3% stake in Future Retail, effectively giving the U.S. company a foothold in the flagship retailer.<br/><br/>India’s antitrust regulator last month suspended the deal, saying Amazon concealed information while filing for regulatory approval. Amazon had “suppressed the actual scope” of the deal and made “false and incorrect statements,” the Competition Commission of India said in its order.<br/><br/>Meanwhile, Reliance Industries in 2020 agreed to buy the retail, wholesale, warehousing, and logistics businesses of Future Group. However, the deal has been delayed due to the dispute with Amazon. <br/>   - By Siddhi Nayak; siddhi.nayak@newsrise.org; 91-22-61353307<br/>- Edited by Vipin Nair<br/>- Send Feedback to feedback@NewsRise.org<br/>- Copyright (c) 2022 NewsRise Financial Research &amp; Information Services Pvt. Ltd.<br/>    </p></div>"}