{"date": "2021-11-22 22:12:06.509000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">Hyundai, Kia and Genesis Sweep 2022 IIHS TOP SAFETY PICK+ and TOP SAFETY PICK Awards</p>\n<p>SEOUL, South Korea, Feb. 24, 2022</p>\n<ul class=\"bulleted-list arrowlist\">\n<li>Insurance Institute for Highway Safety (IIHS) recognizes Hyundai Motor Group as the industry leader in safety, having bestowed the organization with the greatest combined number of 2022 awards</li>\n<li>Hyundai Motor, Kia and Genesis take 21 <span>TOP SAFETY PICK+</span> (TSP+) and <span>TOP SAFETY PICK</span> (TSP) awards between them when equipped with optional front crash prevention and specific headlights</li>\n</ul>\n<p>\n<span>SEOUL, South Korea</span> , <span>Feb. 24, 2022</span> /CNW/ -- Hyundai Motor Group (the Group) has once again earned the most combined <span>TOP SAFETY PICK+</span> (TSP+) and <span>TOP SAFETY PICK</span> (TSP) awards by the Insurance Institute for Highway Safety (IIHS), further highlighting the automaker as the industry leader in safety.</p>\n<p>\n\n</p>\n<p>The Group leads the industry with the most awards in each category, when equipped with optional front crash protection and specific headlights -- 11 <span>TOP SAFETY PICK+</span> and <span>10 TOP SAFETY PICK</span> awards for a total of 21. Hyundai Motor and Kia both claimed eight TSP+ and TSP awards each, while Genesis took five TSP+ awards, one for each model currently available in the U.S. market.</p>\n<p>The IIHS judging process recognizes TSP winners that earn 'Good' ratings in six crashworthiness tests: driver-side small overlap front, passenger-side small overlap front, moderate overlap front, original side, roof strength, and head restraint. In addition, TSP winners earn 'Advanced' or 'Superior' ratings for vehicle-to-vehicle and vehicle-to-pedestrian front crash prevention tests. The vehicle must also have at least one available headlight system that earns a 'Good' or 'Acceptable' rating. For the TSP+ designation, the 'Good' or 'Acceptable' headlight system must be standard equipment.</p>\n<p>Hyundai Tucson, Palisade, Santa Fe (models built after <span>July 2021</span> ), NEXO all took the top TSP+ award. Elantra (with specific headlights), Sonata (with specific headlights), Venue (with specific headlights) and <span>Santa Cruz</span> (with specific headlights) models all claimed TSP awards.</p>\n<p>Kia Telluride, Sorento, Seltos, Carnival built after <span>March 2021</span> (with specific headlights), Sportage and Soul (with optional front crash prevention and specific headlights) all received TSP awards. Kia K5 and Stinger qualified as TSP+ winners.</p>\n<p>The entire Genesis model lineup in the U.S. market now has a TSP+ award rating, with the G70 (built after <span>June 2021</span> ), G80, G90, GV70 and GV80 all winning IIHS recognition this year.</p>\n<p>More information about Hyundai Motor can be found at: <a href=\"http://globalpr.hyundai.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">globalpr.hyundai.com</a>\n</p>\n<p>Visit the Kia Global Media Center for more information: <a href=\"http://www.kianewscenter.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.kianewscenter.com</a>\n</p>\n<p>For more information on Genesis, please visit <a href=\"https://www.genesis.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.genesis.com</a>\n</p>\n<p>\n\n</p>\n<p>\n\n</p>\n<p>View original content to download multimedia: <a href=\"https://www.prnewswire.com/news-releases/hyundai-kia-and-genesis-sweep-2022-iihs-top-safety-pick-and-top-safety-pick-awards-301489306.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/hyundai-kia-and-genesis-sweep-2022-iihs-top-safety-pick-and-top-safety-pick-awards-301489306.html</a>\n</p>\n<p>SOURCE Hyundai Motor Group</p>\n<p>View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/February2022/24/c5022.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/February2022/24/c5022.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}