{"date": "2022-01-24 17:13:55+00:00", "ticker": "III", "mrkt_info": {"open": 1298.5, "close": 1321.0}, "html": "<div class=\"storyContent\" lang=\"pt\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">Por Anshuman Daga e Nishit Jogi</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">CINGAPURA, 24 Jan (Reuters)</span><span class=\"tr-dl-sep\"> - </span>A Temasek vai comprar a Element Materials <a href=\"reuters://REALTIME/Verb=FullQuote/ric=BPTB.L\" data-type=\"ric\" data-ric=\"BPTB.L\" translate=\"no\" dir=\"ltr\">BPTB.L</a> por cerca de 7 bilhões de dólares, vendo uma oportunidade de acelerar o crescimento da provedora de serviços de teste e inspeção, disseram duas fontes a par do assunto.</p><p>Fundo soberano de Cingapura, o Temasek comprou uma fatia o minoritária na Element em 2019 e está comprando a participação detida pela empresa de aquisições Bridgepoint <a href=\"reuters://REALTIME/Verb=FullQuote/ric=BPTB.L\" data-type=\"ric\" data-ric=\"BPTB.L\" translate=\"no\" dir=\"ltr\">BPTB.L</a>. Um anúncio pode ser feito ainda nesta segunda disse uma das fontes.</p><p>A compra será um dos maiores negócios de todos os tempos da Temasek e uma rara aquisição de controle pela empresa, que teve aumento de 25% no valor de seu portfólio, para um recorde de 381 bilhões de dólares de Cingapura (283 bilhões de dólares) em março de 2021.</p><p>A Temasek <a href=\"reuters://REALTIME/verb=Headlines/ric=TEM.UL\" data-type=\"newsExpression\" data-expression=\"TEM.UL\" translate=\"no\" dir=\"ltr\">TEM.UL</a> se recusou a comentar, embora não tenha havido resposta imediata da Bridgepoint e da Element Materials a uma consulta da Reuters enviada fora do horário comercial.</p><p>A Bridgepoint adquiriu a Element do grupo britânico 3i <a href=\"reuters://REALTIME/Verb=FullQuote/ric=III.L\" data-type=\"ric\" data-ric=\"III.L\" translate=\"no\" dir=\"ltr\">III.L</a> por uma quantia não revelada em dezembro de 2015.</p><p>A Element é um dos principais fornecedores globais de serviços de teste, inspeção e certificação para uma gama de produtos e tecnologias. Atende a clientes nos setores aeroespacial, industrial, energia, tecnologia e outros.</p><p>Os 7.000 cientistas, engenheiros e tecnólogos da Element trabalham em sua rede global de mais de 200 laboratórios.</p><p>Nesta manhã, a Bloomberg divulgou notícias do acordo.</p><p>((Tradução Redação São Paulo))</p><p>REUTERS AAP</p><p><br/></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: ELEMENT-M&amp;A/TEMASEK</p></div>"}