{"date": "2022-02-23 16:11:26.539000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>DOSEOLOGY SCIENCES INC (\"MOOD-Z\")\n- Launches Medicinal Mushroom Product Line in Canada to\n- Supply Increasing Demand\n\n     Doseology Sciences Inc. (\"Doseology\" or the \"Company\"), a British\nColumbia-based diversified life sciences company developing mushroom-based\nhealth and wellness solutions, announces the launch of its Health Canada\nNPN-approved medicinal mushroom product line in Canada, and preparation for\na national multichannel marketing campaign.\n\n     About the Doseology Product Line\n\n     The Canadian product line includes five medicinal mushroom products\nfor cognitive health benefits. Each product is formulated and positioned to\ncompete in both the medicinal mushroom and nootropics markets, and each\naddresses different market needs, including mood, energy, recovery, sleep\nand focus.\n\n     Lion's mane (Hericium erinaceus) is a popular nootropic\n(mind-enhancing) mushroom featured in three of the new products. A staple\nof eastern medicine and the subject of numerous recent studies, lion's mane\nis thought to enhance creativity, sharpen thought clarity, improve mental\nfocus, and support healthy brain functioning.\n\n     Lion's mane has immunomodulating properties which help maintain the\nimmune system. Studies suggest that lion's mane may induce nerve growth\nfactor (NGF) synthesis in nerve cells, and can be effective in improving\nmild cognitive impairment.\n\n     Test marketing was conducted during Q2 and Q3 of 2021 in the U.S.\nmarket using direct ecommerce and Amazon.com, concluding with positive\nconsumer feedback.\n\n     The five medicinal mushroom products in the Canadian line are:\n\n//st\n\n* Elevate: Blend of lion's mane mushroom fruiting bodies, ginger root, and\n  vitamin B3 to elevate mood and enhance cognitive clarity (tincture, 28\n  servings).\n* Wake: Blend of lion's mane mushroom fruiting bodies, yerba mate, and\n  vitamins B6 and B12 to promote wakefulness and to support cognitive\n  performance (tincture, 28 servings).\n* Boost: Blend of shiitake fruiting bodies and turmeric to provide the body\n  with potent antioxidants to strengthen and support immunity (tincture, 28\n  servings).\n* Sleep: Blend of reishi mushroom fruiting bodies, German chamomile, and\n  melatonin to promote relaxation and sleep onset (tincture, 28 servings).\n* Think: Blend of the fruiting bodies of lion's mane mushroom, reishi,\n  shiitake, and chaga, yerba mate, rhodiola, choline, organic cocoa powder,\n  and monk fruit extract. The super-shroom cognitive complex is formulated\n  to give the brain the building blocks it needs to optimize cognitive\n  function and to improve focus and alertness (cognitive complex powder, 30\n  servings).\n\n//et\n\n     Doseology is preparing a national marketing campaign to introduce the\nproduct line to Canadians and increase sales for distribution partners. The\ncampaign will include a \"back to nature\" themed video to raise awareness of\nthe healing role medicinal mushrooms have played for centuries, and to\nhighlight Doseology's commitment to providing quality, research-based\nproducts. Watch a preview of the 90-second Back to Nature campaign video.\n\n     About Product Quality\n\n     \"This launch is the culmination of extensive product development,\nmarket testing, and months of planning,\" said Doseology CEO Maryam\nMarissen.\n\n     \"We're proud to finally deliver the benefits of nootropic medicinal\nmushrooms to our home market. We believe our strong brand, proprietary\nformulations, GMP standardization, and easy-to-use products will make our\nmedicinal mushrooms the go-to brand in Canada.\"\n\n     All of the product formulations have received Health Canada Natural\nProduct Numbers (\"NPNs\"). NPNs are granted to products with proven safety\nand effectiveness, and which are manufactured in Health Canada licensed\nfacilities meeting good manufacturing practice (GMP) requirements.\n\n     The product line is proudly formulated using globally sourced natural\ningredients and produced in Canada with industry-leading partners.\nProduction quality and consistency are assured by processing in a modern\nfacility with an excellent 30-year production record.\n\n     Products are vegan-friendly, cruelty-free, gluten-free, and contain no\nadded sugar. Each formulation is third-party purity tested and verified\nwith Certificates of Analysis (CoA) to meet Doseology's high quality\nstandards.\n\n     About Adaptogenic Nutraceuticals\n\n     Adaptogens are used in herbal medicine to help people cope with\nphysiological stress and return to homeostasis (biological balance).\nSignificant research has shown positive effects of adaptogens with respect\nto stress reduction, resistance to mental fatigue, and improved attention\ncapacity.\n\n     The Doseology line combines adaptogens such as ginger, turmeric, yerba\nmate, and several mushroom species, with proven functional mushrooms such\nas lion's mane, reishi, shiitake, maitake, royal sun, turkey tail, and\nothers. These blended formulations deliver enhanced health and wellness\nbenefits over single-ingredient products, and have a higher market value\nbecause of increased user benefits and development challenges.\n\n     The Wake, Elevate, and Think products also include mushrooms with\nnootropic properties. Nootropics are supplements that improve cognitive\nfunction, such as attention, memory, creativity, or motivation.\n\n     About the Demand and Market Opportunity\n\n     The Doseology line is positioned as a high-quality supplement for the\ngrowing number of consumers who are concerned about maintaining mental and\nphysical health, or seeking to elevate their cognitive function through\nbiohacking.\n\n     Consumer interest in medicinal mushrooms for health benefits is\nrising, with the global market valued at US$3.56 billion in 2020 and\npredicted to grow with a CAGR of 7.23% to 2027 (HNY Research). Canadian\ninterest in mushroom products is growing steadily, with a 250 percent\nincrease in search interest for lion's mane mushroom over the past five\nyears (Google Trends).\n\n     The larger nootropics market continues to see strong growth, and is\nestimated to reach US$6.69 billion by the year 2028, at a CAGR of 12.7%\n(Marketysers Global Consulting).\n\n     About Purchasing and Partnering\n\n     Learn more about the benefits of Doseology's medicinal mushroom\nproducts at doseology.com. Distributor inquiries are welcomed at [email\nprotected].\n\n     On Behalf of the Board of Directors\n\n     Maryam MarissenChief Executive OfficerDoseology Sciences Inc.[email\nprotected]\n\n     About Doseology Sciences Inc.\n\n     Doseology Sciences Inc. (CSE: MOOD) is a British Columbia-based\ndiversified life sciences company, on a mission to reimagine mental health\ntherapies through innovation, technology and sustainability. With a focus\non psychedelic and non-psychedelic compounds, Doseology will offer cutting\nedge therapeutic products and services, with the aim of making a meaningful\nimpact on the mental health pandemic and improving overall health.\n\n     Forward Looking Statements\n\n     This corporate update contains statements which constitute\n\"forward-looking information\" within the meaning of applicable securities\nlaws. Forward-looking information is often identified by the words \"may,\"\n\"would,\" \"could,\" \"should,\" \"will,\" \"intend,\" \"plan,\" \"anticipate,\"\n\"believe,\" \"estimate,\" \"expect\" or similar expressions. Readers are\ncautioned that forward-looking information is not based on historical facts\nbut instead reflects the Company's management's expectations, estimates or\nprojections concerning the business of the Company's future results or\nevents based on the opinions, assumptions and estimates of management\nconsidered reasonable at the date the statements are made. Although the\nCompany believes that the expectations reflected in such forward-looking\ninformation are reasonable, such information involves risks and\nuncertainties, and undue reliance should not be placed on such information,\nas unknown or unpredictable factors could have material adverse effects on\nfuture results, performance or achievements. Among the key factors that\ncould cause actual results to differ materially from those projected in the\nforward-looking information are the following: changes in general economic,\nbusiness and political conditions, including changes in the financial\nmarkets; decreases in the prevailing prices for products in the markets\nthat the Company operates in; adverse changes in applicable laws or adverse\nchanges in the application or enforcement of current laws; regulations and\nenforcement priorities of governmental authorities; compliance with\ngovernment regulation and related costs; and other risks described in the\nProspectus. Should one or more of these risks or uncertainties materialize,\nor should assumptions underlying the forward-looking information prove\nincorrect, actual results may vary materially from those described herein\nas intended, planned, anticipated, believed, estimated, or expected.\nAlthough the Company has attempted to identify important risks,\nuncertainties and factors which could cause actual results to differ\nmaterially, there may be others that cause results not to be as\nanticipated, estimated or intended. The Company does not intend, and does\nnot assume any obligation, to update this forward-looking information\nexcept as otherwise required by applicable law.\n\n     No securities regulatory authority has either approved or disapproved\nof the contents of this news release. The Company's securities have not\nbeen, nor will they be, registered under the United States Securities Act\nof 1933, as amended, or any state securities laws, and may not be offered\nor sold in the United States, or to or for the account or benefit of any\nperson in the United States, absent registration or an applicable exemption\nfrom the registration requirements. This press release shall not constitute\nan offer to sell or the solicitation of an offer to buy any securities in\nthe United States, or in any other jurisdiction in which such offer,\nsolicitation or sale would be unlawful.\n\n     Industry Data\n\n     This press release includes market, industry and economic data which\nwas obtained from various publicly available sources and other sources\nbelieved by the Company to be true. Although the Company believes it to be\nreliable, the Company has not independently verified any of the data from\nthird party sources referred to in this press release, or analyzed or\nverified the underlying reports relied upon or referred to by such sources,\nor ascertained the underlying economic and other assumptions relied upon by\nsuch sources. The Company believes that its market, industry and economic\ndata is accurate and that its estimates and assumptions are reasonable, but\nthere can be no assurance as to the accuracy or completeness thereof. The\naccuracy and completeness of the market, industry and economic data used\nthroughout this press release are not guaranteed and the Company does not\nmake any representation as to the accuracy or completeness of such\ninformation.\n\n     The CSE does not accept responsibility for the adequacy or accuracy of\nthis release.\n\n     /NOT FOR DISTRIBUTION IN THE UNITED STATES OR DISSEMINATION IN THE\nUNITED STATES./\n\n     For further information: Investor Relations: [email protected]; Media\nInquiries: [email protected]; Telephone: 236-349-0064; Website:\nwww.doseology.com\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2205300451.MNPRE2205302117-07485020220223</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}