{"date": "2021-11-23 19:21:39.090000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Nov 23, 2021</p></div><div class=\"tr-npp-lead\"><p><span>Amazon</span>'s <a href=\"https://www.zacks.com/stock/quote/AMZN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AMZN</a> robust cloud services portfolio is helping it gain customers.</p><p>adidas selected Amazon Web Services (AWS) as its preferred cloud provider for SAP workloads. This highlights the efficiency and reliability of AWS' innovative cloud products and services.adidas will shift its SAP workloads to AWS to digitize its core business processes, which will enable it to support new business models and turn the same into data-centric businesses. adidas will also be able to connect its data across its global operations.Its capabilities in advanced analytics, data science and enterprise reporting will strengthen by integrating its SAP S/4HANA environment with AWS.AWS' extensive SAP experience will allow adidas to create a cloud-based consumer experience.</p></div><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">Amazon.com, Inc. Revenue (TTM)</p><p> </p><p><a href=\"https://www.zacks.com/stock/chart/AMZN/fundamental/revenue-ttm?icid=chart-AMZN-fundamental/revenue-ttm\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. revenue-ttm</a> | <a href=\"https://www.zacks.com/stock/quote/AMZN?icid=chart-AMZN-fundamental/revenue-ttm\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. Quote</a> </p><p class=\"tr-npp-section-title\">Expanding Clientele</p><p>The latest selection by adidas added strength to AWS' expanding clientele.Recently, AWS was selected by Qualtrics, the preferred cloud provider. Qualtrics is shifting its complete portfolio of experience management applications and customer-facing workloads to AWS.Additionally,<span>Under Armour</span><a href=\"https://www.zacks.com/stock/quote/UAA\" data-type=\"url\" class=\"tr-link\" translate=\"no\">UAA</a> picked AWS as the preferred cloud provider for SAP. It will integrate its SAP environments with AWS technologies to gain meaningful insights into its businesses.Under Armour, which completed the migration of its SAP environments to AWS earlier this year, is looking to leverage AWS' analytics, machine learning, compute and storage to accelerate innovation across resource-efficient production, direct-to-consumer sales and global wholesale distribution plus many other areas of its business.Compagnie Financière Richemont also selected AWS as its preferred cloud provider. It is heading toward closing its European data centers and shifting more data centers in Hong Kong and the United States to AWS. Also, it will migrate above 5,000 virtual machines and 120 SAP instances to AWS.NXP Semiconductors recently picked AWS as its preferred cloud provider and shifted its electronic design automation workloads to AWS to bolster its throughput across its design centers.We believe that the expanding customer base will continue to drive the top line AWS, which generated $16.1 billion revenues in third-quarter 2021, up 39% year over year, accounting for 14.5% of revenues.</p><p class=\"tr-npp-section-title\">Competitive Scenario</p><p>Amazon's strong efforts toward expanding its cloud-computing offerings will continue to aid it in winning customers. This, in turn, will continue to boost its cloud dominance and competitive edge against its peers like<span>Microsoft</span><a href=\"https://www.zacks.com/stock/quote/MSFT\" data-type=\"url\" class=\"tr-link\" translate=\"no\">MSFT</a> and<span>Alphabet</span>'s <a href=\"https://www.zacks.com/stock/quote/GOOGL\" data-type=\"url\" class=\"tr-link\" translate=\"no\">GOOGL</a> Google.According to the latest Canalys report, AWS accounted for 32% of the global cloud spending in third-quarter 2021, sustaining its leading position in the booming cloud market.Microsoft's Azure, the second-largest cloud-service provider, accounted for 21% of the worldwide cloud spending and Alphabet's Google Cloud represented 8% of the cloud spending, marking itself the third largest cloud provider.However, Amazon, which presently carries a Zacks Rank #5 (Strong Sell), is facing stiff competition from Microsoft and Alphabet as both are targeting a bigger slice of the market on the back of their advancing cloud portfolios, which are bumping up their cloud revenues. This poses a serious challenge to Amazon's dominant position in the cloud market.Alphabet generated $4.9 billion of revenues from Google Cloud in third-quarter 2021, up 44.9% year over year.Microsoft's cloud revenues were $20.7 billion in first-quarter fiscal 2022, up 36% year over year.You can see<span><a href=\"https://www.zacks.com/stocks/buy-list/?ADID=zp_1link_invideas&amp;ICID=zpi_1link_invideas\" data-type=\"url\" class=\"tr-link\" translate=\"no\">the complete list of today's Zacks #1 Rank (Strong Buy) stocks here</a> </span>.</p><p><span>Zacks' Top Picks to Cash in on Artificial Intelligence</span></p><p>In 2021, this world-changing technology is projected to generate $327.5 billion in revenue. Now Shark Tank star and billionaire investor Mark Cuban says AI will create \"the world's first trillionaires.\" Zacks' urgent special report reveals 3 AI picks investors need to know about today.</p><p><a href=\"https://www.zacks.com/registration/ultimatetrader/welcome/eoffer/4e87?add=1749&amp;adid=NEWSTEX_CONTENT_ZU_AIREPORT_A_ANALYSTBLOG_253_11232021&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1831061\" data-type=\"url\" class=\"tr-link\" translate=\"no\">See 3 Artificial Intelligence Stocks With Extreme Upside Potential&gt;&gt;</a></p><p>Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.</p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=RPT_7BST_LP194&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1831061\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Click to get this free report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=AMZN&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1831061\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. (AMZN): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=MSFT&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1831061\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Microsoft Corporation (MSFT): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=GOOGL&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1831061\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Alphabet Inc. (GOOGL): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=UAA&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1831061\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Under Armour, Inc. (UAA): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/stock/news/1831061/amazon-s-amzn-aws-clientele-expands-with-adidas-selection?cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1831061\" data-type=\"url\" class=\"tr-link\" translate=\"no\">To read this article on Zacks.com click here.</a></p><p><a href=\"http://www.zacks.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Zacks Investment Research</a></p><p>The views expressed in any and all content distributed by Newstex and its re-distributors (collectively, the \"Newstex Authoritative Content\") are solely those of the respective author(s) and not necessarily the views of Newstex or its re-distributors. Stories from such authors are provided \"AS IS,\" with no warranties, and confer no rights. The material and information provided in Newstex Authoritative Content are for general information only and should not, in any respect, be relied on as professional advice. Newstex Authoritative Content is not \"read and approved\" before it is posted. Accordingly, neither Newstex nor its re-distributors make any claims, promises or guarantees about the accuracy, completeness, or adequacy of the information contained therein or linked to from such content, nor do they take responsibility for any aspect of such content. The Newstex Authoritative Content shall be construed as author-based content and commentary. Accordingly, no warranties or other guarantees are offered as to the quality of the opinions, commentary or anything else appearing in such Newstex Authoritative Content. Newstex and its re-distributors expressly reserve the right to delete stories at its and their sole discretion.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Zacks Investment Research</p></div>"}