{"date": "2021-12-16 19:40:57.305000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3466.3, "close": 3400.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>LiveOne and Super League Partner on Multi Year, Multi Event Deal to Develop and Offer Exclusive Live Music, Festivals, Lifestyle, and Pay Per View Pop Culture Events in the Metaverse</p>\n</div>\n<div class=\"tr-npp-body\">\n<pre>SUPER LEAGUE GAMING INC (\"SLGG-Q\")\n- LiveOne and Super League Partner on Multi-Year, Multi-Event\n- Deal to Develop and Offer Exclusive Live Music, Festivals,\n- Lifestyle, and Pay-Per-View Pop Culture Events in the Metaverse\n\n   LiveXLive, a wholly-owned subsidiary of LiveOne (Nasdaq: LVO), a global\nplatform for livestream and on-demand audio, video and podcast/vodcast\ncontent in music, comedy and pop culture, and Super League Gaming, a global\nleader in video game experiences and entertainment at the intersection of\nthe creator economy, gameplay content, and the metaverse, announced today\nthat they have formed a strategic partnership to create experiences within\nthe metaverse tied to LiveOne's music, lifestyle and pay-per-views (\"PPV\")\nevents. Together, the companies plan to offer fans and gamers alike\nopportunities to enjoy immersive 3D environments featuring exclusive\ncontent, unique virtual goods, NFTs, and gamified activities that drive\nincreased affinity and socially-connected engagement.\n\n   Starting today, the two companies will work together to identify\nspecific music and gaming events that can be activated in virtual spaces\nwithin some of the world's largest metaverse platforms, including Roblox\nand Minecraft. Audiences of all ages will have the opportunity to\nexperience music performances from some of their favorite artists while\nalso exploring a dynamic, visually exciting world full of surprises\ninspired by the themes of each individual event. Within the LiveOne virtual\nmetaplex will be multiple stages, special kiosks for purchasing\nmerchandise, VIP rooms for avatar-based meet-and-greets, interactive\ncompetitions offering fun prizes, and more.\n\n   \"We have led the way in virtual streaming and digital PPV over the last\nfew years, and we see the Metaverse as the next logical frontier for great\nmusic and entertainment experiences,\" said Dermot McCormack, President of\nLiveOne. \"Super League's deep understanding of the complete metaverse user\nexperience made them an ideal partner to bring this strategy to life for\nfans and advertisers alike.\"\n\n   \"The social web is in the process of being replaced by the\nuser-generated web, full stop. LiveOne recognizes the importance of\nexpanding the reach of their premium content events into these important\ndigital environments,\" said Matt Edelman, Chief Commercial Officer of Super\nLeague Gaming. \"We are thrilled to be applying all that we've learned\nthrough live and online gaming events, live streaming broadcasts, and\non-demand content production and distribution to the creation of an\nenduring LiveOne metaverse destination.\"\n\n   The partnership between LiveOne and Super League will feature multiple\ntentpole events and franchises in 2022, including a multi-platform\nexperience for the 10th Anniversary of the Spring Awakening Music Festival,\nMusic Lives, Breakout Awards, LiveOne Presents, Ballerfest, LiveZone and\nmore.\n\n   Following active collaboration between the two companies, Super League\nwill be responsible for the creation and management of the LiveOne\nmetaverse environment(s), inclusive of user testing, ongoing user support,\nand regular updates that keep fans and players alert and engaged. Super\nLeague also will assist LiveOne with promotional planning and execution,\nnotably through Super League's owned and operated metaverse advertising\nnetwork, Bloxbiz. Acquired in October 2021, Super League's Bloxbiz is a\nleading advertising platform designed specifically for metaverse\nenvironments, with reach that already exceeds more than 65 million monthly\nactive users across more than 150 Roblox game titles. With recent estimates\nfrom RTrack that peg Roblox MAUs at 206 million as of June 2021, Super\nLeague's impressive reach represents approximately 30% of all Roblox\nplayers worldwide.\n\n   About Super League Gaming\nSuper League Gaming (Nasdaq: SLGG) is a leading metaverse and creator\neconomy platform at the intersection of gaming and pop culture focused on\ntools and offerings that empower creators, energize players, and entertain\nfans. The company's solutions provide incomparable access to an audience\nconsisting of players in the largest global metaverse environments, fans of\nhundreds of thousands of gaming influencers, and viewers of gameplay\ncontent across major social media and digital video platforms. Fueled by\nproprietary and patented technology systems, the company's creator-centric\nofferings include content tools that power live stream multicasting, a\nleading metaverse advertising platform, a social media banner monetization\nplatform, and a virtual cloud-based video production division, Virtualis\nStudios. Combined with vibrant in-game Minecraft communities, a network of\nhighly viewed channels and original shows on Instagram, TikTok, Snap,\nYouTube, and Twitch, and an award-winning esports invitational tournament\nseries, Super League's properties deliver powerful opportunities for brands\nand advertisers to achieve impactful marketing outcomes with gamers of all\nages. For more, go to superleague.com.\n\n   About LiveOne, Inc.\nHeadquartered in Los Angeles, California, LiveOne, Inc. (NASDAQ: LVO) (the\n\"Company\") is a global talent-first, interactive music, sports, and\nentertainment subscription platform delivering premium content and\nlivestreams from the world's top artists. The Company has streamed over\n1,800 artists since January 2020, has a library featuring close to 30\nmillion songs, 500 expertly curated radio stations, 235 podcasts/vodcasts,\nhundreds of pay-per-views, personalized merchandise, released music-related\nNFTs, and has created a valuable connection between brands, fans, and\nbands. The Company's other major wholly-owned subsidiaries are LiveXLive,\nSlacker Radio, React Presents, Gramophone Media, Custom Personalization\nSolutions, Palm Beach Records and PodcastOne which generates more than 2.48\nbillion downloads per year and 300+ episodes distributed per week across a\nstable of hundreds of top podcasts. The combination of acquisitions and the\nexpansion of products and franchises have secured LiveOne as a top-rated\nmusic, entertainment, and media services company. LiveXLive is available on\niOS, Android, Roku, Apple TV, and Amazon Fire, and through OTT, STIRR,\nSling, and XUMO, in addition to its app, online website, and social\nchannels. For more information, visit www.livexlive.com and follow us on\nFacebook, Instagram, TikTok, and Twitter at @livexlive.\n\nGillian Sheldon\nSuper League Gaming\ngillian.sheldon@superleague.com\n\nAileen Budow\nLiveOne\naileen@livexlive.com\n\nSuper League Contact:\nSophie Pearson and Cody Slach\nGateway Investor Relations\nSLG@gatewayir.com\n\nLiveOne Investor Relations\nIR@liveone.com\n310.601.2505\n\nForward-Looking Statements (LiveOne)\nAll statements other than statements of historical facts contained in this\npress release are \"forward-looking statements,\" which may often, but not\nalways, be identified by the use of such words as \"may,\" \"might,\" \"will,\"\n\"will likely result,\" \"would,\" \"should,\" \"estimate,\" \"plan,\" \"project,\"\n\"forecast,\" \"intend,\" \"expect,\" \"anticipate,\" \"believe,\" \"seek,\"\n\"continue,\" \"target\" or the negative of such terms or other similar\nexpressions. These statements involve known and unknown risks,\nuncertainties and other factors, which may cause actual results,\nperformance or achievements to differ materially from those expressed or\nimplied by such statements, including: the Company's reliance on one key\ncustomer for a substantial percentage of its revenue; the Company's ability\nto consummate any proposed financing, acquisition, spin-out, distribution\nor transaction, the timing of the closing of such proposed event, including\nthe risks that a condition to closing would not be satisfied within the\nexpected timeframe or at all, or that the closing of any proposed\nfinancing, acquisition, spin-out, distribution or transaction will not\noccur or whether any such event will enhance shareholder value; the\nCompany's ability to continue as a going concern; the Company's ability to\nattract, maintain and increase the number of its users and paid\nsubscribers; the Company identifying, acquiring, securing and developing\ncontent; the Company's intent to repurchase shares of its common stock from\ntime to time under its announced stock repurchase program and the timing,\nprice, and quantity of repurchases, if any, under the program; the\nCompany's ability to maintain compliance with certain financial and other\ncovenants; the Company successfully implementing its growth strategy,\nincluding relating to its technology platforms and applications;\nmanagement's relationships with industry stakeholders; the effects of the\nglobal Covid-19 pandemic; changes in economic conditions; competition;\nrisks and uncertainties applicable to the businesses of the Company's\nsubsidiaries; and other risks, uncertainties and factors including, but not\nlimited to, those described in the Company's Annual Report on Form 10-K for\nthe fiscal year ended March 31, 2021, filed with the U.S. Securities and\nExchange Commission (the \"SEC\") on July 14, 2021, Quarterly Report on Form\n10-Q for the quarter ended June 30, 2021, filed with the SEC on August 16,\n2021, Quarterly Report on Form 10-Q for the fiscal quarter ended September\n30, 2021, filed with the SEC on October 29, 2021, and in the Company's\nother filings and submissions with the SEC. These forward-looking\nstatements speak only as of the date hereof, and the Company disclaims any\nobligations to update these statements, except as may be required by law.\nThe Company intends that all forward-looking statements be subject to the\nsafe-harbor provisions of the Private Securities Litigation Reform Act of\n1995.\n\n   Forward-Looking Statements (Super League Gaming)\nSafe Harbor Statement under the Private Securities Litigation Reform Act of\n1995. Statements in this press release that are not strictly historical are\n\"forward-looking\" statements within the meaning of Section 27A of the\nSecurities Act of 1933, as amended, and Section 21E of the Securities\nExchange Act of 1934, as amended. These statements involve substantial\nrisks, uncertainties and assumptions that could cause actual results to\ndiffer materially from those expressed or implied by such statements.\nForward-looking statements in this communication include, among other\nthings, statements about our possible or assumed business strategies,\npotential growth opportunities, new products and potential market\nopportunities. Risks and uncertainties include, among other things, our\nability to implement our plans, forecasts and other expectations with\nrespect our business; our ability to realize the anticipated benefits of\nevents that took place during and subsequent to the quarter ended September\n30, 2021, including the possibility that the expected benefits will not be\nrealized or will not be realized within the expected time period; unknown\nliabilities that may or may not be within our control; attracting new\ncustomers and maintaining and expanding our existing customer base; our\nability to scale and update our platform to respond to customers' needs and\nrapid technological change; increased competition on our market and our\nability to compete effectively, and expansion of our operations and\nincreased adoption of our platform internationally. Additional risks and\nuncertainties that could affect our financial results are included in the\nsection titled \"Risk Factors\" and \"Management's Discussion and Analysis of\nFinancial Condition and Results of Operations\" in our Annual Report on Form\n10-K for the year ended December 31, 2020 and other filings that we make\nfrom time to time with the Securities and Exchange Commission which, once\nfiled, are available on the SEC's website at www.sec.gov. In addition, any\nforward-looking statements contained in this communication are based on\nassumptions that we believe to be reasonable as of this date. Except as\nrequired by law, we assume no obligation to update these forward-looking\nstatements, or to update the reasons if actual results differ materially\nfrom those anticipated in the forward-looking statements.\n\nEmail : SLG@gatewayir.com    SUPER LEAGUE GAMING INC\nWWW   : <a href=\"https://www.superleague.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.superleague.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134900627.MNPRE2134902867-11275120211216</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}