{"date": "2021-11-05 18:31:02+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3477.0, "close": 3488.98}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The Day Ahead is an email and PDF publication that includes the day's major stories and events, analyses and other features. To receive The Day Ahead, Eikon users can register at <a href=\"reuters://REALTIME/verb=Headlines/ric=DAY/US\" data-type=\"newsExpression\" data-expression=\"DAY/US\" translate=\"no\" dir=\"ltr\">DAY/US</a>. Thomson One users can register at RT/DAY/US. All times in ET/GMT</p><p class=\"tr-story-p1\"></p><p>ON MONDAY</p><p><br/></p><p>Facebook Inc whistleblower Frances Haugen is expected to brief EU lawmakers, who are now reviewing proposed tough EU tech rules, on the negative impact of big tech companies' products on users.</p><p><br/></p><p>Federal Reserve Chair Jerome Powell is due to give opening remarks before a virtual conference on Gender and the Economy hosted by the Federal Reserve Board. (1030/1530) Federal Reserve Bank of Boston Interim President Kenneth Montgomery is expected to give welcome remarks before a virtual conference titled \"The Implications of High Leverage for Financial Instability Risk, Real Economic Activity, and Appropriate Policy Responses\" hosted by the Federal Reserve Bank of Boston. (1000/1500) Federal Reserve Bank of Philadelphia President Patrick Harker is scheduled to speak on the economic outlook before a virtual event of the Economic Club of New York. (1200/1700) Federal Reserve Board Governor Michelle Bowman is expected to speak on the U.S. Housing Market before a 'Women in Housing and Finance Public Policy' Luncheon. (1200/1700) Federal Reserve Bank of Chicago President Charles Evans is due to speak virtually on current economic conditions and monetary policy before the \"OESA 2021 Automotive Supplier Conference: Beyond Disruption\". (1350/1850) Federal Reserve Vice Chair Richard Clarida is expected to participate in a virtual panel on \"Taking stock of new Fed and ECB monetary policy frameworks\" hosted by the Brookings Institution. (0900/1300)</p><p><br/></p><p>Zynga Inc is expected to show a rise in third-quarter revenue, driven by demand for its titles \"Harry Potter: Puzzles &amp; Spells\" and \"Words With Friends\". Investors will also focus on the impact of Apple's privacy changes on its ad revenue.</p><p><br/></p><p>Brazil's inflation data for October, as measured by the IGP-DI price index, is scheduled for release. The index fell 0.55% in the previous month. Chile's inflation data for October is also due after rising 1.2% in the September.</p><p><br/></p><p>LIVECHAT-REUTERS GLOBAL MARKETS FORUM</p><p>Mike Dolan, Reuters Editor at Large, Finance &amp; Markets, takes a look at the major themes and key events to watch in the week ahead. (0700/1100) To join the conversation, <a href=\"https://www.refinitiv.com/en/products/refinitiv-messenger/editorial-communities-financial-forums\" data-type=\"url\" class=\"tr-link\" translate=\"no\">click here</a>.</p><p><br/></p><p><br/></p><p>REST OF THE WEEK</p><p><br/></p><p>Walt Disney Co is expected to post a rise in fourth-quarter revenue on Wednesday, helped by a resumption in theme parks attendance and steady subscriber growth on its streaming platforms.</p><p><br/></p><p>On the U.S. economic front, the Labor Department on Tuesday is scheduled to release producer prices data for October. The PPI is likely to have risen 0.6% in October. The consumer price index (CPI) data is scheduled for Wednesday and is likely to have edged up 0.6% in October from 0.4% in the previous month. On an annual basis, the CPI likely rose 5.8% in October. Excluding the volatile food and energy components, the CPI likely gained 4.3% in the 12 months through October. On Wednesday, the Labor Department is expected to report initial jobless claims fell to a seasonally adjusted 265,000 in the week ended Nov. 1 from 269,000 in the previous week. Wholesale inventories data for September is also due on Wednesday. The University of Michigan's preliminary consumer sentiment index is due on Friday. It is expected to have risen to 72.5 in November from 71.7 in October. The Labor Department is expected to release its September Job Openings and Labor Turnover Survey, or JOLTS report, on Friday. Job openings had increased to 10.439 million in August.</p><p><br/></p><p>Federal Reserve Chair Jerome Powell, on Tuesday, is expected to give opening remarks before a virtual Conference on Diversity and Including in Economics, Finance and Central Banking co-hosted by the Federal Reserve Board, Bank of Canada, Bank of England, and European Central Bank. Federal Reserve Bank of St. Louis President James Bullard, on Tuesday, is due to give remarks and participate virtually before the UBS European Conference Central Banking Panel on \"Monetary Policy: Limits? What Limits?\" Federal Reserve Bank of Minneapolis President Neel Kashkari is scheduled to participate in a virtual moderated question-and-answer session on Tuesday before the Eau Clare Chamber of Commerce Economic Outlook Luncheon Town Hall. Federal Reserve Bank of New York President John Williams is expected to speak on Friday before a virtual conference titled \"Heterogeneity in Macroeconomics: Implications for Policy\" hosted by the Federal Reserve Bank of New York. Federal Reserve Bank of San Francisco President Mary Daly is scheduled to speak virtually before the National Association for Business Economics on Tuesday.</p><p><br/></p><p>Rivian Automotive Inc, which is backed by Amazon.com Inc and Ford Motor Co, will make its Nasdaq debut on Wednesday, aiming for an over $50 billion valuation.</p><p><br/></p><p>Bumble Inc is expected to report third-quarter results on Wednesday. The Match Group rival is benefiting from a rise in paying subscribers even after the easing of pandemic-related curbs.</p><p><br/></p><p>Beyond Meat Inc's forecast will be the main focus on investors when it reports third-quarter results on Wednesday after the plant-based meat maker warned that a host of factors including a drop in demand from grocery stores and a labor shortage was hurting its sales. Wall Street is keen to find out how long the company expects those pressures to last.</p><p><br/></p><p>Coach parent Tapestry Inc is set to post a rise in first-quarter revenue on Thursday, buoyed by a rebound in demand for luxury handbags and apparel. However, investors will be on the lookout for any hit to the company's profit from supply chain disruptions that include Vietnamese factory closures and surging costs.</p><p><br/></p><p>DoorDash Inc is expected to post a sequential decline in third-quarter revenue on Tuesday. Investors will look out for the food-delivery firm's fourth-quarter outlook and comments on labor inflation and shortage.</p><p><br/></p><p>Inovio Pharmaceuticals Inc is set to report its third-quarter 2021 results on Tuesday, when investors will watch for the company's comments on its COVID-19 vaccine candidate.</p><p><br/></p><p>Poshmark Inc is expected to report a rise in third-quarter revenue on Tuesday, as a new generation of eco-conscious shoppers increasingly buy secondhand apparel. The company is also expected to forecast a jump in end-of-year sales as consumers, feeling the pinch of a shortage of new clothing at stores, turn to thrifting to fill their holiday gift bags.</p><p><br/></p><p>On Wednesday, a hearing is scheduled on a judge's order for LTL Management, the Johnson &amp; Johnson entity holding its talc liabilities in bankruptcy, to show why the judge shouldn't move the Chapter 11 case out of North Carolina and to another court. The judge hinted in the order that the case should be sent to New Jersey, where the company and its employees are based.</p><p><br/></p><p>The UK Supreme Court will decide whether to allow a bellwether, potential multi billion pound lawsuit against Alphabet Inc's Google on Wednesday, over alleged unlawful tracking of iPhone users, to proceed as a class action in Britain.</p><p><br/></p><p>Mexico's central bank is scheduled to hold a meeting to decide on interest rates on Thursday. Mexico had hiked the interest rate to 4.75% in the previous meeting. Mexico is expected to release the country's inflation data on Tuesday. The country's national statistics agency is expected to report Mexican inflation likely rose 6.14% in the year through October, after gaining 6% in the month before. Mexico's industrial output data is due for release on Thursday. Brazil's inflation data for October, as measured by the IPCA inflation index, is scheduled for release on Wednesday. The index rose 1.16% in September. Brazil's economic activity data for September, as measured by the IBC-BR economic activity index, is scheduled for release on Friday. Argentina's industrial output numbers are also expected on Tuesday. Argentinian consumer prices data and Brazilian retail sales numbers are also expected on Thursday.</p><p><br/></p><p class=\"tr-signoff\"> (Compiled by Haneyl Jacob; Editing by Devika Syamnath)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Haneyl.Jacob@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Haneyl.Jacob@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMERS-WHATTOWATCH/</p></div>"}