{"date": "2021-12-13 18:23:28.286000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span><span>Spoilers alert! Contains plot details of Amazon Prime's \"With Love,\" out Friday, Dec. 17.</span> </span> </p><p>We could all use a big, warm hug this holiday season. And you're about to get the biggest, warmest one.</p></div><div class=\"tr-npp-body\"><p>Step into the arms of Amazon Prime's latest series, \"With Love,\" out Friday, for five episodes of heart, humor and humility, fueled by the power of unconditional familial love and acceptance.</p><p>The series, created by Gloria Calderón Kellett (\"One Day at a Time\"), focuses on an extended Mexican family from Portland, Oregon, and how four centric relationships bud, ebb and flow over five key holidays: Nochebuena (Christmas Eve); New Year's Eve; Valentine's Day; Independence Day; and Día de los Muertos.</p><p>The relationships in question are Lily (Emeraude Toubia) and Santiago (Rome Flynn), the classic will-they-or-won't-they heterosexual romantic comedy couple; Jorge Jr. (Mark Indelicato) and Henry (Vincent Rodriguez III), two men in a loving relationship; Sol (Isis King) and Miles (Todd Grinnell), a queer couple navigating integrating Miles' child into their life together; and Jorge Sr. (Benito Martinez) and Beatriz (Constance Marie), a heterosexual couple with a long marriage suddenly in jeopardy after one character flirts with infidelity.</p><p><span><span>More than decorated skulls:</span> What is the Day of the Dead and how is the holiday celebrated?</span> </p><p>The series boasts a beautiful kaleidoscope of identities: Mexican, Filipino, Afro-Latino, nonbinary and transgender, gay and bisexual. It's a show that actually reflects the world around us – and a welcome one at that.</p><p>Calderón Kellett thought of the idea amid the haze that was last year's pandemic holiday season. \"We were home and I was feeling the deep need for connection and love,\" she says. \"And at the same time, I was watching my favorite holiday movies and realized there was a real lack of representation in terms of Black, brown, queer experiences.\"</p><p>Expect to learn (or nod vigorously at, if you recognize them) cultural holiday traditions – hint: you'll never think of New Year's Eve the same way again – and to dream bigger for a kinder, more empathetic world. The show also follows a much-needed new pattern in Hollywood: LGBTQ stories that go beyond the coming-out experience.</p><p><span><span>Yes please:</span> How Lil Nas X, Lena Waithe and 'Sex Education' are championing Black, queer love stories</span> </p><p>Jorge Jr. and Sol's respective relationship arcs don't have to do with needing their family's acceptance. Their family shrouds them with love at every turn. Jorge and Henry juggle careers and their relationship; Sol and Miles, too, juggle all that on top of Miles' aforementioned child (who happens to be genderqueer – though, again, not the cause of conflict).</p><p>Indelicato appreciated the monogamous relationship between Jorge and Henry. Not that there's anything wrong with non-monogamy per se, but \"what is so lovely about this relationship is that they're good with each other,\" he says. \"That was something that was extremely important to me in thinking about their relationship, was that they really, really only wanted to be with one another. And there was no promiscuity even considered. I thought that that was really sweet.\" How often do you see that with queer couples on TV? Not too often.</p><p>He was also thrilled to avoid another coming-out story after doing one as Justin on \"Ugly Betty\" more than a decade ago.</p><p><span><span>Great question:</span> Could coming out as LGBTQ be over someday?</span> </p><p>As for King's character: You won't necessarily realize that Sol is transgender in the first episode of the series – just that they use they/them pronouns – a unique choice that shouldn't seem all that unique. \"It comes up as it would come up,\" Calderón Kellett says. \"And I found that really refreshing. And I'm hoping that the audience finds that refreshing as well.\" Queer writers – including a transgender and nonbinary writer – on staff evidently helped guide the story, speaking to the importance of behind-the-camera representation.</p><p>Also, Sol is an oncology resident, an unfortunately atypical job title for a trans character. \"Considering trans characters are usually oversexualized, or is such a big part of the foundation of the character, I was just like, 'Wow, I can't believe we're here,\" says portrayer Isis King. \"And I can't believe we're here right now.'\"</p><p><span><span>'The cheese ball of television':</span> More networks gift treacly comfort food of holiday movies</span> </p><p>Being transgender is one part of someone's life, not the whole part. \"We're still people, and this shows Sol in a really human way which is necessary,\" King says.</p><p>\"With Love\" does what many shows try and fail to do: include representation without coming off as preachy.</p><p>\"It's not off-limits to everyone,\" Indelicato says. \"Actually, everyone can acquire this and live this utopian lifestyle\" in which your family and loved ones accept you for who you are without judgment.</p><p>Here's to more series like this – and absolutely more seasons of \"With Love,\" please.</p><p><span><span>'Like a gay dream come true':</span> Netflix's first gay holiday rom-com 'Single All the Way' relishes in joy</span> </p><p><span>This article originally appeared on USA TODAY: 'With Love' on Amazon is the warm, welcome hug you've been waiting for this holiday season</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}