{"date": "2021-11-08 21:31:25+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>\n      Amazon customers in the U.S. will be able to pay with Venmo for purchases on Amazon.com and the Amazon mobile shopping app next year\n    </p>\n              <div>\n                <p>\n        PayPal today announced that we will team-up with Amazon to allow Venmo's more than 80 million users in the U.S. to pay with Venmo at checkout using funding methods that include their linked bank account and Venmo balance. Starting next year, customers will be able to make purchases on Amazon.com and the Amazon mobile shopping app in the U.S. using their Venmo accounts.\n      </p>\n                <p>\n        A recent <a href=\"https://downloads.ctfassets.net/7rifqg28wcbd/4DC89wMGRB4C9HNF5rAbgi/640e409ce7e1dea74700ac4418913613/FINAL_VENMO_STUDY_Jan.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Venmo Behavior study</a> revealed that 65 percent of Venmo users said they increased their online purchasing behaviors amidst the pandemic and 47 percent are interested in paying with Venmo when checking out with merchants. Venmo has been enhancing offerings to expand the ways that Venmo can be used by both consumers and merchants and today's news widely increases availability of Venmo at checkout.\n      </p>\n                <p>\n        \"Over the last year, we have focused on giving our Venmo community more ways to use Venmo in their daily lives, including the ability to pay with QR Codes and providing more shopping features like purchase protections,\" said Darrell Esch, Senior Vice President and GM, Venmo. \"We're thrilled to make it possible for our users and Amazon customers to pay with Venmo starting next year.\"\n      </p>\n                <p>\n        \"We understand our customers want options and flexibility in how they make purchases on Amazon,\" said Ben Volk, Director of Global Payment Acceptance, Amazon. \"We're excited to team-up with Venmo and give our customers the ability to pay by using their Venmo accounts, providing new ways to pay on Amazon.\"\n      </p>\n                <p>\n        The ability to pay with Venmo on Amazon.com will be available in 2022. To create a Venmo account, download the Venmo app from the <a href=\"https://play.google.com/store/apps/details?id=com.venmo&amp;hl=en_US&amp;gl=US\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Google Play</a> or <a href=\"https://apps.apple.com/us/app/venmo/id351727428\" data-type=\"url\" class=\"tr-link\" translate=\"no\">iOS</a> app stores.\n      </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://newsroom.paypal-corp.com/2021-11-08-PayPal-and-Amazon-to-Enable-Customers-to-Pay-with-Venmo-at-Checkout\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>PayPal Holdings Inc.</strong> published this content on <strong>08 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>08 November 2021 21:31:25 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - PayPal Holdings Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: PayPal-Holdings-Inc.</p></div>"}