{"date": "2021-12-06 13:41:29.685000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Subsidiary Mikra Cellular Sciences to Launch First Product \"CELLF\" to Combat Brain Fog and Unlock Healthy Aging, Announces U.S. Patent Application and Pre Clinical Study</p>\n</div>\n<div class=\"tr-npp-body\">\n<pre>LIFEIST WELLNESS INC (\"LFST-V\")\n- Subsidiary Mikra Cellular Sciences to Launch First Product\n- \"CELLF\" to Combat Brain Fog and Unlock Healthy Aging, Announces\n- U.S. Patent Application and Pre-Clinical Study\n\n     Lifeist Wellness Inc. (\"Lifeist\" or the \"Company\") a health-tech\ncompany that leverages advancements in science and technology to enable you\nto find your path to wellness, announced that its newly launched\nbiosciences and consumer wellness subsidiary, Mikra Cellular Sciences Inc.\n(\"Mikra\"), is poised to launch its first product \"CELLF\", a novel cellular\ntherapeutic compound targeting systemic fatigue. As part of pre-launch\nactivities of CELLF, Mikra has filed a patent application with the United\nStates Patent and Trademark Office and partnered with InVivo Biosystems,\nInc. (\"InVivo Biosystems\") for pre-clinical trials to strengthen its patent\nclaim.\n\n     \"The real health crisis isn't reduced longevity -- we're living longer\nthan we have in the past. It's extended morbidity that's the problem. While\nwe're all familiar with mortality, morbidity is attributable to age-related\ndiseases that lower your quality of life which is why so many of us when we\nhit our 30's, 40's and 50's experience multiple physiological and mental\nwalls -- notably brain fog, fatigue, and inflammation. This all happens at\na cellular level, and it can cascade into poor sleep, mood drops, and an\ninability to enjoy life like you want to,\" said Faraaz Jamal, COO of\nLifeist and CEO of Mikra. \"With that in mind, I'm extremely excited to\npresent Mikra's first product, CELLF (pronounced \"self\"). We engineered\nthis product for everyone who has started to feel like their biological age\nis affecting their everyday performance and ability to feel like the best\nversion of themselves.\"\n\n     Continued Jamal, \"CELLF works at a cellular level to help combat\nsystemic fatigue, inflammation, and brain fog by promoting the creation of\nmitochondria and subsequently increasing their efficiency. This is in\naddition to the upregulation and downregulation of certain cellular\ndetoxification pathways that can remove the buildup of senescent\n(old/dysfunctional) cells that may cause excessive chronic inflammation and\nuncontrolled cell division.\"\n\n     CELLF - A science-backed cellular therapeutic, treating systemic\nfatigue and low-grade cellular inflammation\n\n     CELLF is manufactured in a proprietary oxygen-deprived environment to\nmaintain biopotency and bioavailability with clinically tested United\nStates Food &amp; Drug Administration (FDA) certified GRAS (generally\nrecognized as safe) bioactive ingredients. The CELLF compound delivery\nsystem is a two-stage, patented mechanism -- it is first bound to a\ntransferrin glycoprotein and then encapsulated within a liposome. This\nallows safe passage of CELLF through the gastric environment and delivery\ndirectly into the blood plasma. The result is optimal delivery of our\ncompound with minimal degradation to the best site of absorption. CELLF\nwill be shipped in a package containing 30 X 10ml single-serve sachets to\nprevent oxidation and maximize bioavailability.\n\n     \"You've got to satisfy two conditions for a product like this to work.\nThe first is that the molecules within the compound need to be backed by\nrigorous science. The second is that you need to deliver it effectively\ninto your body, and more specifically, your cells so that it is maximally\nabsorbed. Very few products satisfy the first, let alone the second,\" said\nJamal. \"As one of my lifelong heroes, Carl Sagan once said, 'extraordinary\nclaims require extraordinary evidence', which is why we've partnered with\nInvivo Biosystems to prove and strengthen our patent claim that CELLF does\nboth.\"\n\n     Mikra Partners with InVivo Biosystems\n\n     Mikra has partnered with InVivo Biosystems, experts in genetic model\ncreation and in vivo testing, to strengthen its patent application by\nconducting a pre-clinical study identifying genetic signatures and pathways\nassociated with average human healthspans and to test the effects of CELLF\non healthy aging.\n\n     \"We are proud to partner with Mikra in developing a family of healthy\nliving products that reduce biological aging. At InVivo Biosystems, we take\na systematic, multi-omics approach to make gene-by-gene discoveries and\nuncover the different genetic pathways that are up or down regulated during\naging. The InVivo Longevity Platform measures the complex interplay of\ncellular proliferation, autophagy, mitochondrial oxidative stress, genetic\npredisposition, and transcriptional changes that occur during aging,\" said\nChris Hopkins, PhD, Chief Science Officer at InVivo Biosystems. \"In our\ncollaboration with Mikra, we are exploring how its flagship formulation,\nCELLF, increases the efficiency of mitochondrial ATP production and\ncellular respiration. Using the InVivo Longevity Platform, we measure at\nthe molecular level how Mikra's CELLF formulation can counter periodic\nbouts of fatigue by providing improved cellular respiration. In our\npartnership, we will be generating the science-based evidence that Mikra\ncan use as further backbone for their intellectual property claims. Here at\nInVivo Biosystems we are also excited to continue partnering with Mikra in\nthe future to uncover further how CELLF, and their future product lines,\ncan create a new baseline for healthy living after 30.\"\n\n     CELLF Product &amp; Community Launch\n\n     \"I'm very excited about adding incremental value to Lifeist\nshareholders and unlocking the earnings potential of Mikra and subsequently\nLifeist. We're taking the first steps here with bringing something novel to\nthe market, validating and protecting it. But let's be clear, it's only the\nfirst step,\" said Meni Morim, CEO of Lifeist. \"The initial traction Mikra\nhas had around the pre-launch has been very promising -- to grow to a\ncommunity of nearly 20,000 with a huge level of engagement, in such a short\namount of time and with no sign of stopping is a testament to the team's\nexpertise and validates the consumer's desire for this type of product.\"\n\n     Mikra's CELLF will be available for pre-sale in mid-Q1 2022 with a\nwaitlist sign up available at www.wearemikra.com. CELLF will be available\non www.wearemikra.com and Amazon following the pre-sale for full public\nlaunch.\n\n     Follow Mikra's journey on your favorite social media platform with\n@wearemikra.\n\n     About Mikra, Cellular Sciences Inc.\nMikra is a biological sciences and consumer wellness company on a mission\nto increase your healthspan by focusing on the tiniest aspect of your\nhealth: the cell. People are made up of over 37 trillion cells with a\nvariety of different sizes, shapes, functions and lifespan. These cells are\nresponsible for energy, happiness, recovery potential and so much more.\nMikra is exploring the link between changes at a cellular level and the\ncascading effects it can have on health.\n\n     About InVivo Biosystems, Inc.\nInVivo Biosystems, an expert in genetics, delivers scientific proof and\nevidence for ingredients at the molecular and cellular level via a\nproprietary analytical approach. Its analytical platform helps branded\ningredient developers and manufacturers substantiate their product claims,\nfile IP patents, or refine their formulations using the best science backed\nmeasure of outcome. Managed by experienced PhD scientists, InVivo\nBiosystems' gene expression platform can help find new applications for\nnovel ingredients, discover new molecules, and conduct proof-of-concept\nstudies for therapeutic purposes. Visit www.invivobiosystems.com/longevity\nfor more information.\n\n     About Lifeist Wellness Inc.\nSitting at the forefront of the post-pandemic wellness revolution, Lifeist\nis a portfolio of wellness companies leveraging advancements in science and\ntechnology to enable individuals to find their personalized path to\nwellness. Portfolio business units include: CannMart, which operates a B2B\nwholesale distribution business facilitating recreational sales to Canadian\nprovincial government control boards and the CannMart.com marketplace which\nprovides Canadian medical customers with a diverse selection of cannabis\nproducts from a multitude of federally licensed cultivators and its U.S.\ncustomers with access to hemp-derived CBD and smoking accessories;\nAustralian Vapes, the country's largest online retailer of vaporizers and\naccessories; Findify, a leading AI-powered search and discovery platform;\nand Mikra, a biosciences and consumer wellness company seeking to develop\ninnovative therapies for cellular health and recovery.\n\n     Information on Lifeist and its businesses can be accessed through the\nlinks below:\nwww.lifeist.com\nwww.cannmart.com\nwww.everyonedoesit.co.uk\nwww.australianvaporizers.com.au\nwww.wearemikra.com\n\n     Contacts\n\n     Lifeist Wellness Inc.\nMeni Morim, CEO\nMatt Chesler, CFA, Investor Relations\nPh: 647-362-0390\nEmail: ir@lifeist.com\n\n     Forward Looking Information\n\n     This news release contains \"forward-looking information\" within the\nmeaning of applicable securities laws. All statements contained herein that\nare not historical in nature contain forward-looking information.\nForward-looking information can be identified by words or phrases such as\n\"may\", \"expect\", \"likely\", \"should\", \"would\", \"plan\", \"anticipate\",\n\"intend\", \"potential\", \"proposed\", \"estimate\", \"believe\" or the negative of\nthese terms, or other similar words, expressions and grammatical variations\nthereof, or statements that certain events or conditions \"may\" or \"will\"\nhappen.\n\n     The forward-looking information contained herein, including, without\nlimitation, statements related to the launch of Mikra's first product\n\"CELLF\" and its anticipated therapeutic benefits, are made as of the date\nof this press release and is based on assumptions management believed to be\nreasonable at the time such statements were made, including, without\nlimitation, expectations that pre-clinical trials will prove successful and\nthat the Company's application for a patent will be granted, expectations\nthat CELLF will gain market acceptance along with the expansion of the\nmarket for nutraceutical products and management's perceptions of Lifeist's\nstanding in the online marketplace for wellness and related products,\nLifeist's beliefs regarding the expected demand for wellness and related\nproducts and the expected growth of that market, the timing of product\navailability, as well as other considerations that are believed to be\nappropriate in the circumstances. While we consider these assumptions to be\nreasonable based on information currently available to management, there is\nno assurance that such expectations will prove to be correct. By its\nnature, forward-looking information is subject to inherent risks and\nuncertainties that may be general or specific and which give rise to the\npossibility that expectations, forecasts, predictions, projections or\nconclusions will not prove to be accurate, that assumptions may not be\ncorrect and that objectives, strategic goals and priorities will not be\nachieved. A variety of factors, including known and unknown risks, many of\nwhich are beyond our control, could cause actual results to differ\nmaterially from the forward-looking information in this press release. Such\nfactors include, without limitation: unforeseen developments that would\ndelay the Company's ability to launch CELLF as anticipated and in a timely\nmanner, the risk that pre-clinical trials are not as successful as\nanticipated and do not demonstrate anticipated therapeutic benefits and/or\nfail to strengthen the Company's patent claim, the risk that the expected\ndemand for nutraceutical products in general and those of the Company does\nnot develop as anticipated, regulatory risk, risks relating to the\nCompany's ability to execute its business strategy and the benefits\nrealizable therefrom and risks specifically related to the Company's\noperations. Additional risk factors can also be found in the Company's\ncurrent MD&amp;A and annual information form, both of which have been filed\nunder the Company's SEDAR profile at www.sedar.com. Readers are cautioned\nnot to put undue reliance on forward-looking information. The Company\nundertakes no obligation to update or revise any forward-looking\ninformation, whether as a result of new information, future events or\notherwise, except as required by applicable law. Forward-looking statements\ncontained in this news release are expressly qualified by this cautionary\nstatement.\n\n     Neither the TSX Venture Exchange nor its Regulation Services Provider\n(as that term is defined in the policies of the TSX Venture Exchange)\naccepts responsibility for the adequacy or accuracy of this release or has\nin any way approved or disapproved of the contents of this press release.\n\n     Source: Lifeist Wellness Inc.\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133900051.MNPRE2133900446-04270120211206</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}