{"date": "2021-06-15 23:59:27.650000+00:00", "ticker": "III", "mrkt_info": {"open": 1241.5, "close": 1258.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><span>\n              <p>Jun 12 - AMP Capital and 3i Infrastructure are considering a possible sale of their <strong>Esvagt</strong> offshore energy infrastructure service vessel business and are said to be looking at hiring advisers. 3i Infrastructure has its 50% stake valued at £189m in March up from £141m the year before, mainly due to increased investment.</p>\n              <p>3i Infrastructure said in its annual results that \"higher than expected utilisation in the offshore wind market was offset by emergency response and rescue vessel [ERRV] demand being lower in the first half of the year than had been forecast. We lowered the discount rate to reflect improved visibility in the ERRV segment and the increased share of long-term, contracted schedule of values [SOV] cashflows in the business.\"</p>\n              <p>In early 2018, the two put in place a €376m refinancing on the asset via RBC and NatWest split between bank debt and an institutional tranche. The DKr2bn of bank debt (€268m), runs for five years and is priced at 275bp to year three, 300bp in year four and 350bp in year five. Banks in the deal are AIB, Caterpillar Financial Services and Sydbank. In addition, institutional investors including MetLife and Sequoia came in for the longer 10-year tranche. </p>\n              <p>3i Infrastucture is currently selling its Oystercatcher oil terminals company, which holds 45% of Oiltanking. Macquarie Capital is advising. FSI, BlackRock and Wren House are said to be bidding. It has recently bought a 60% stake in fibre-optic company DNS:Net Internet Service from German private equity firm Deutsche Beteiligungs (DBAG) for 182m.</p>\n              <p>(Rod Morrison)</p>\n              <p>((rod.morrison@refinitiv.com))</p>\n            </span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © Refinitiv 2021. Click For Restrictions - https://www.refinitiv.com/en/policies/copyright-notice</p></div>"}