{"date": "2021-11-16 15:34:06+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><br/>\nBy Staff Writer<br/>\n<div>\n<div>\n<div>\n<div>\n<div>RIYADH: Saudi medical appliance distributor Kayan Medical saw a nine-fold increase in sales after signing up as an Amazon.sa seller.</div>\n</div>\n</div>\n</div>\n<div data-io-article-url=\"https://www.arabnews.com/node/1969156/business-economy\">\n<p>Through Amazon.sa, local businesses are empowered to grow their business through analytical tools and delivery options to maintain competitiveness.</p>\n<p>“After registering as a seller and kicking off sales, we were surprised by the huge demand for our products, and we realized that selling through Amazon should not be temporary,” Kayan chairman, Sakher Al-Amir, said.</p>\n<p>“As of 2021, our collaboration with Amazon has driven our sales to nine times what they were during 2019, in addition to streamlining our sales and delivery processes,” he said.</p>\n<p>Amazon provides support to local small and medium sized businesses and entrepreneurs in Saudi Arabia. It currently operates five fulfilment centers, 24 delivery stations, and two sorting centers across the Kingdom.</p>\n<p> </p>\n</div>\n</div>\n<p class=\"syndigate_disclaimer\">Copyright: Arab News © 2021 All rights reserved. Provided by SyndiGate Media Inc. (<a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a>).</p>\n<div class=\"footnote-disclaimer\">Disclaimer: The content of this article is syndicated or provided to this website from an external third party provider. We are not responsible for, and do not control, such external websites, entities, applications or media publishers. The body of the text is provided on an “as is” and “as available” basis and has not been edited in any way. Neither we nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this article. <a href=\"https://d3a0oa8cittb3t.cloudfront.net/researchreports/Disclaimers/TR%20Disclaimer.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read our full disclaimer policy here</a>.</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Arab News</p></div>"}