{"date": "2021-11-23 19:12:18.645000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>BLACKBERRY LTD (\"BB-TN\")\n- BlackBerry, L-SPARK Launch Third Cohort of Accelerator Program to\n- Advance Canadian Connected Vehicle Technology Innovation\n\n     BlackBerry Limited and L-SPARK, Canada's largest software-as-a-service\naccelerator, announced a third phase of their joint accelerator program,\nwhich aims to grow Canadian technology companies focused on connected\nvehicle solutions.\n\n     Following the success of the first and second cohorts, the partnership\nwill once again help small and medium-sized technology enterprises (SMEs)\ngrow their businesses and bring new products to market using BlackBerry(R)\nQNX(R) technology. New this year, the accelerator will provide selected\ncompanies with access to BlackBerry's Intelligent Vehicle Data Platform -\nBlackBerry IVY(TM), enabling them to develop high-impact solutions\nleveraging in-vehicle data to improve driver and passenger experiences.\n\n     Announced in December 2020 as part of a multi-year, global agreement\nwith Amazon Web Services, Inc. (AWS), BlackBerry IVY is a vehicle first,\ncloud connected software platform that presents vehicle data in a\nnormalized format. BlackBerry IVY insights can easily be consumed by\napplications on or off the vehicle and are managed via a cloud console. The\nBlackBerry IVY development environment enables insights to be easily\ncreated from vehicle data, safely and securely.\n\n     \"After two successful cohorts with L-SPARK we look forward to going to\nback to the deep talent pool that exists within the Canadian start-up scene\nto help identify those companies that share our vision: a transportation\nindustry - and in-vehicle experience - transformed by data,\" said Peter\nVirk, Vice President of IVY Product and Ecosystem, BlackBerry. \"As we\ncontinue to build out a robust ecosystem of services and automotive\napplications to leverage the rich data insights that BlackBerry IVY\nprovides, we can't wait to see the ideas and use cases that will emerge to\nhelp automakers unlock the vast potential of next generation intelligent\nconnected vehicles.\"\n\n     \"Imagine the possibilities when we combine the Canadian SME\ncommunity's imagination with the technological depth and market reach of\nBlackBerry\", said Leo Lax, Executive Managing Director of L-SPARK. \"The\nbreadth of applications, the depth of innovation, and market traction when\ncombined through this accelerator program will be ground-breaking. I look\nforward to seeing the transformative services demonstrated for use in the\ntransportation industry and the in-vehicle experience of the drivers using\nthese applications driven by BlackBerry IVY.\"\n\n     L-SPARK will again turn to the expertise of the National Research\nCouncil of Canada-Industrial Research Assistance Program (NRC-IRAP), to\nreach out to companies with business models and technologies that could\nbenefit from working with the BlackBerry QNX product group.\n\n     Applications will stay open until March 7th, 2022. BlackBerry and\nL-SPARK will then host a selection day where they will choose up to six\ncompanies to join the third cohort of the program.\n\n     For more information, or to apply, please visit\n<a href=\"https://www.l-spark.com/accelerator/blackberry\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.l-spark.com/accelerator/blackberry</a>.\n\n     About BlackBerryBlackBerry (NYSE: BB;TSX: BB) provides intelligent\nsecurity software and services to enterprises and governments around the\nworld. The company secures more than 500M endpoints including 195M\nvehicles.  Based in Waterloo, Ontario, the company leverages AI and machine\nlearning to deliver innovative solutions in the areas of cybersecurity,\nsafety and data privacy solutions, and is a leader in the areas of endpoint\nsecurity, endpoint management, encryption, and embedded systems.\nBlackBerry's vision is clear - to secure a connected future you can trust.\n\n     BlackBerry. Intelligent Security. Everywhere.\n\n     For more information, visit BlackBerry.com and follow @BlackBerry.\n\n     Trademarks, including but not limited to BLACKBERRY, EMBLEM Design and\nQNX are the trademarks or registered trademarks of BlackBerry Limited, its\nsubsidiaries and/or affiliates, used under license, and the exclusive\nrights to such trademarks are expressly reserved. All other trademarks are\nthe property of their respective owners. BlackBerry is not responsible for\nany third-party products or services.\n\n     About L-SPARKL-SPARK is Canada's leading accelerator for the Connected\nCars (AV) industry as well as Software as a Service (SaaS) companies. The\naccelerator offers programs focused on future innovative B2B and B2B/B2C\ncompanies, as well as targeted programs which partner with leading\ncorporations in Connected Medtech, IoT and CyberSecurity.\n\n     Since the launch of their first cohort in January 2015, L-SPARK has\naccelerated 95 companies across Canada who collectively have raised over\n$115M in follow-on funding. With over 10,000 investors, corporate partners\nand startups now in their network, L-SPARK has curated a dynamic Canadian\ntech community for participating companies to join.\n\n     Media Contact:BlackBerry Media Relations+1 (519) 597-7273[email\nprotected]\n\n     L-SPARKStef Reid613 620 0724[email protected]\n\nTel   : 519-888-7465    BLACKBERRY LTD\nFax   : 519-888-6990\nEmail : investor_relations@blackberry.com\nWWW   : <a href=\"https://www.blackberry.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.blackberry.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132600074.MNPRE2132600887-05345120211123</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}