{"date": "2021-12-17 09:28:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3466.3, "close": 3400.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Nupur Anand and Sankalp Phartiyal</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">MUMBAI, Dec 17 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>The Reserve Bank of India's plans to move towards card tokenisation is likely to hit a wide range of companies from major e-commerce firms and food delivery firms to lenders, while increasing the use of cash, said industry sources and bankers. </p><p>RBI issued guidelines in March 2020 saying that merchants will not be allowed to save card information on their websites to boost data security. It issued fresh guidelines in September 2021 giving companies until the end of the year to comply with the regulations and offering them the option to tokenise.</p><p>    Tokenisation is a process by which card details are replaced by a unique code or token, generated by an algorithm, allowing online purchases to go through without exposing card details, in a bid to improve data security.</p><p>    The RBI has ordered all companies in India to purge saved credit and debit card data from their systems from Jan. 1, 2022. </p><p>    Merchants and bankers argue they have not been given enough time to comply with the changes, while opting out of tokenisation would mean a customer would need to manually key in their card details each time they completed an online purchase, which could put some customers off.</p><p>    \"Introducing an additional step in payments adds friction and several studies show that customers may end up dropping out in case of a discretionary purchase,\" said Sijo Kuruvilla George, who heads the New Delhi-based think-tank Alliance of Digital India Foundation, which represents Indian startups.</p><p>\"We estimate revenue losses of about 20-40% for merchants, with the smaller firms being more adversely impacted,\" he added.</p><p>Meanwhile, <span class=\"tr-strong\">senior executives at state-owned banks and private lenders said </span>they worry the move will lead to a marked decline in card transactions and an increase in cash payments over the short-term, undoing years of work by lenders and the government to boost digitisation.</p><p>     \"Not all banks are going to be ready by January and even if they are, it is likely that to avoid inconvenience, customers may opt for a one-step cash on delivery, instead of keying in details,\" said a banker with a leading Indian lender, who asked not to be named because he is not authorised to speak to the media.</p><p>\"So not only will card transactions decline but cash in circulation will also go up, which is another concern.\"</p><p><span class=\"tr-strong\">Credit card transactions in India crossed the 1 trillion  rupees ($13.13 billion) mark in October while other modes of digital payments have also seen a sharp uptick over the years.</span></p><p>The industry is still waiting for clarity on how cash back schemes and monthly-installment type card purchases will work and has asked the central bank for more clarity and time, said an executive at an internet firm, who asked not to be named as the information is not public.</p><p>\"The RBI is expecting the entire industry to come on to tokenisation, complete testing, move forward in less than four months, that is a very extreme ask from the industry,\" the executive added.</p><p>The RBI did not immediately respond to an email seeking comment on the matter. <span class=\"tr-strong\">Companies such as Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, Walmart's Flipkart <a href=\"reuters://REALTIME/Verb=FullQuote/ric=WMT.N\" data-type=\"ric\" data-ric=\"WMT.N\" translate=\"no\" dir=\"ltr\">WMT.N</a>, and Indian food delivery firm Zomato <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ZOMT.NS\" data-type=\"ric\" data-ric=\"ZOMT.NS\" translate=\"no\" dir=\"ltr\">ZOMT.NS</a>, who are likely to be affected, also did not immediately respond to a request for comment.</span></p><p>Industry executives say that even if certain card networks, banks and merchants are ready, ensuring that the processes are fully integrated system-wide and are seamless can take months.</p><p>\"It may take about six- to nine months more for the entire ecosystem to be fully ready,\" said Manas Mishra, Chief Product Officer at payments firm PayU.</p><p>($1 = 76.2150 Indian rupees)</p><p><br/></p><p><br/></p><p>($1 = 76.1350 Indian rupees)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Nupur Anand in Mumbai and Sankalp Phartiyal in New Delhi; Editing by Ana Nicolaci da Costa)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Nupur.Anand@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Nupur.Anand@thomsonreuters.com</a> ; +9122 68414388; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: FINTECH-INDIA/TOKENISATION</p></div>"}