{"date": "2021-11-10 18:14:30+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3576.23, "close": 3472.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Ben Klayman and Hyunjoo Jin</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Nov 10 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Rivian Automotive Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RIVN.O\" data-type=\"ric\" data-ric=\"RIVN.O\" translate=\"no\" dir=\"ltr\">RIVN.O</a> <span class=\"tr-strong\">made </span>its Nasdaq debut on Wednesday after raising nearly $12 billion in an upsized offer that made it one of the largest ever initial public offerings. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2S13XS\" data-type=\"storyId\" data-story-id=\"nL4N2S13XS\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Like other electric vehicle startups, Rivian aims to ride the growing demand for zero-emission vehicles to a position that rivals market leader Tesla Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TSLA.O\" data-type=\"ric\" data-ric=\"TSLA.O\" translate=\"no\" dir=\"ltr\">TSLA.O</a>.</p><p>While further back on the growth curve than Tesla and its Chief Executive Officer Elon Musk, here are five areas where the Irvine, California-based Rivian and CEO R.J. Scaringe compare with the EV market leader.</p><p><br/></p><p><span class=\"tr-strong\">MARKET CAP</span></p><p>Tesla, founded in 2003, is the most valuable carmaker in the world, but its stock declined recently after Musk polled Twitter users about selling 10% of his stake in the company. Despite briefly falling out of the $1 trillion market-value club on Wednesday, Tesla rallied and its market cap now stands at <span class=\"tr-strong\">$1.05 trillion. </span><span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2S12QN\" data-type=\"storyId\" data-story-id=\"nL4N2S12QN\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Rivian, founded in 2009, made its Nasdaq market debut on Wednesday after its blockbuster IPO and initially was trading with a market capitalization of <span class=\"tr-strong\">nearly $100 billion. </span>That makes it the second most valuable U.S. automaker, ahead of General Motors Co <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GM.N\" data-type=\"ric\" data-ric=\"GM.N\" translate=\"no\" dir=\"ltr\">GM.N</a> at <span class=\"tr-strong\">about $87 billion</span>, Ford Motor Co<a href=\"reuters://REALTIME/Verb=FullQuote/ric=F.N\" data-type=\"ric\" data-ric=\"F.N\" translate=\"no\" dir=\"ltr\">F.N</a> at about <span class=\"tr-strong\">$79 billion, </span>and Lucid Group <a href=\"reuters://REALTIME/Verb=FullQuote/ric=LCID.O\" data-type=\"ric\" data-ric=\"LCID.O\" translate=\"no\" dir=\"ltr\">LCID.O</a> at <span class=\"tr-strong\">about $70 billion.</span></p><p>    </p><p><span class=\"tr-strong\">GLOBAL SALES</span></p><p><span class=\"tr-strong\">Tesla delivered more than 600,000 vehicles from January to September this year. </span>Once two additional factories under construction open later this year, sales will rise further. Tesla's revenue in the third quarter rose 57% to $13.76 billion from a year earlier. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2RG3YR\" data-type=\"storyId\" data-story-id=\"nL4N2RG3YR\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> </p><p>Rivian just started selling its first vehicle, the R1T pickup truck.</p><p><br/></p><p><span class=\"tr-strong\">ASSEMBLY PLANTS/EMPLOYEES</span></p><p>    Tesla has assembly plants in Fremont, California and near Shanghai and is building factories in Austin, Texas, and Berlin. At the end of last year, Tesla employed almost 71,000 people globally.</p><p>The two existing plants will have annual production capacity of 1 million vehicles by the end of 2022, and that will double once two additional plants open, according to estimates by Wedbush.</p><p>Rivian has an assembly plant in Normal, Illinois that can build 150,000 vehicles a year and will expand to 200,000 by 2023. It has said it will build a second U.S. plant and eventually plans to add factories in China and Europe. Rivian currently employs 9,500 people.</p><p>Rivian's Scaringe told Reuters the company is aiming to build at least one million vehicles a year by the end of the decade. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2S01DW\" data-type=\"storyId\" data-story-id=\"nL1N2S01DW\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p><br/></p><p><span class=\"tr-strong\">TYPES OF VEHICLES</span></p><p>Tesla's Model 3 sedan is the best-selling electric car in the world. It also offers the Model S sedan, Model X SUV and Model Y crossover. It plans to eventually offer the Cybertruck electric pickup, a second-generation roadster and a Class 8 semi-trailer truck.</p><p>Rivian currently builds the R1T pickup in Illinois and will soon add the R1S SUV as well as a delivery van for its largest shareholder Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>. It has said other vehicles off the R1 platform will be added by 2023, including lower-priced models according to Scaringe. It also plans to add other commercial vehicles on top of the Amazon van, he said.</p><p><br/></p><p><span class=\"tr-strong\">PARTNERS</span></p><p>Tesla has taken more of a go-it-alone route, vertically integrating production of battery cells and design of self-driving chips.</p><p>Rivian has a deal to provide Amazon, which has a 20% stake in the startup, with 100,000 vans by 2025. In addition, Ford, another large stakeholder, has repeatedly said its investment in Rivian is strategic, even though it previously canceled the Lincoln SUV that would have been built on a Rivian platform. Rivian also intends to vertically integrate production of battery cells.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Ben Klayman in Detroit and Hyunjoo Jin in San Francisco; Editing by Bernard Orr)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:benjamin.klayman@thomsonreuters.com\" data-type=\"email\" translate=\"no\">benjamin.klayman@thomsonreuters.com</a> ; 313-600-2277; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://benjamin.klayman.thomsonreuters.com@reuters.net\">benjamin.klayman.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: RIVIAN-IPO/ (FACTBOX, PIX)</p></div>"}