{"date": "2021-12-16 15:38:24.657000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3381.83, "close": 3377.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Nine more days until Christmas, readers. It's Brett Molina back with your Thursday stories in tech.</p><p>Let's start with holiday shopping, and the hottest gifts to set under the tree this year: video game consoles.</p></div><div class=\"tr-npp-body\"><p>It's a tale as old as time. I remember being a kid on Christmas morning, ripping apart wrapping paper to discover a Nintendo Entertainment System. </p><p>This season, it's all about the PlayStation 5 and Xbox Series X, which have been nearly impossible to find. So who better to learn from on how to secure this rare tech treasure than the consumers who successfully purchased the PS5 and Xbox Series X. </p><p>While shoppers hope for a holiday miracle in their quest to find that great gift, here's what you missed in tech this week.</p><p class=\"tr-npp-section-title\">What else happened in tech?</p><p><span>► Work meetings in the metaverse?</span> Yep, Bill Gates thinks it will happen in the next two to three years. If this means dressing my avatar in a suit while I chill in sweatpants, sign me up.</p><p><span>► Elon Musk is Time's Person of the Year.</span> One more title for the CEO of Tesla and SpaceX, as well as the world's richest human.</p><p><span>► Great, more carriage disputes.</span> Having just struck a deal with Roku, YouTube TV is now warning its users it may drop Disney channels like ABC, ESPN, National Geographic and others as it tries to negotiate a new contract. Disney says it's \"optimistic\" a deal can be reached.</p><p><span>► This security flaw has the internet panicked.</span> It's related to a utility called log4j and it's bad news, according to experts.</p><p class=\"tr-npp-section-title\">Thursday's tech tip</p><p>Who doesn't want to save money while shopping on Amazon? Try these tips to get the most out of your Amazon experience.</p><p class=\"tr-npp-section-title\">This week on Talking Tech</p><p>On the Talking Tech podcast, we talk more PS5, Elon Musk and how to protect your phone number.</p><p>Thanks for reading. Don't forget to ship those gifts fast!</p><p><span>Follow Brett Molina on Twitter: @brettmolina23.</span> </p><p><span>This article originally appeared on USA TODAY: Talking Tech: How to snag a PS5 or Xbox Series X, plus how to save money on Amazon</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}