{"date": "2022-02-15 00:16:17.885000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>THE ALKALINE WATER COMPANY INC (\"WTER-ZQ\")\n- Record Third Quarter Revenue of $15.1 Million and\n- 57% Year-over-year Growth\n\nThe Company Reiterates Full Fiscal 2022 Revenue Guidance of $62 Million\n\n(All amounts are unaudited and in U.S. dollars)\n\n     The Alkaline Water Company Inc. (the \"Company\"), the country's largest\nindependent alkaline water company and the Clean Beverage(TM) company,\ntoday announced revenue of $15.1 million for the fiscal third quarter\nending December 31, 2021. This is the second-best quarter for revenue in\ncompany history and represents year-over-year quarterly growth of 57%. The\nCompany filed the corresponding form 10-Q with the SEC on February 14,\n2022.\n     \"With reported sales of $15.1 million, the year-over-year growth for\nthis quarter was an exceptional 57%,\" stated Ricky Wright, President and\nCEO of The Alkaline Water Company Inc. \"This represents our second\nconsecutive quarter with greater than 50% year-over-year growth. What makes\nthe results of this quarter even more impressive is that historically, our\nthird quarter sales are the lowest during our fiscal year. Our growth\ncontinues to accelerate into our fourth quarter as we now begin to see\nbottled water 'resets' and new SKU additions at retailers across the\ncountry. We believe that year-over-year quarterly growth will continue\nthrough fiscal 2023 and we reiterate our guidance of $62 Million for fiscal\n2022.\"\n     Fiscal 2022 Third Quarter Key Overview:\n     - $15.1 million in revenue, a year-over-year increase of 57%.\nSecond sequential quarter with year-over-year growth of 50%+.\n     - The Company reiterates guidance of $62 Million.\n     - Alkaline88 was the fastest-growing top-ten value-added water brand\nin the country. (Nielsen xAOC data for the 13 weeks ending 1/1/2022)\n     - Alkaline88's dollar volume grew 46.6% over the same period the prior\nyear. (Nielsen xAOC data for the 13 weeks ending 1/1/2022)\n    - Alkaline88 has grown 54% based on a two-year stack which leads all\nother brands in the top-ten. (Nielsen data 52-week reports for 2019-2021)\n     - Alkaline88 is the second-largest brand in dollar volume in the\nEnhanced Water category in the Natural Grocery channel. (Among grocers who\nreport to SPINS Database Platform for the 12-weeks ending 12/26/21)\n     - The 1-Gallon bottle is the #1 best-selling value-added water SKU in\nthe Natural Grocery channel. (Among grocers who report to SPINS Database\nPlatform for the 12-weeks ending 12/26/21)\n\n     \"Nielsen data for the 13 weeks ending January 1st, 2022 for all\noutlets combined excluding convenience stores, or 'xAOC,' reveals that we\nwere the fastest growing top-ten value-added water in the country,\"\ncontinued Mr. Wright. \"Our year-over-year dollar volume grew 46.4% over the\ncomparable period last year. Of the more than 70 brands included in the\ndata, Alkaline88 had the third highest year-over-year gains in market\nshare. Our dollar volume has grown 54% based on a two-year stack, which is\nthe best amongst top-ten brands and almost twice the category average.\"\n\n     Fiscal Q3 Business and Operational Highlights\n     - Marketing Efforts\n       - Shaquille O'Neal: The Company has launched its first ever\ntraditional marketing campaign with assets featuring our Brand Ambassador\nShaquille O'Neal, including TV commercials in strategic growth markets and\nonline video platforms, programmatic digital video &amp; display, and social\nmedia. Alkaline88 and Shaq are also featured on 8,500 sq ft. of digital\nbillboards in Times Square. The Company also proudly sponsored two awards\nat the Sports Illustrated Awards. All these efforts are estimated to\nalready have generated millions of impressions.\n     - Convenience Store Channel Growth\n       - DSD Success: Alkaline88 added thousands of new retail locations in\nthe convenience store channel thanks to the strategic expansion with\nDirect-Store-Delivery partners, Hensley, Nevada Beverage, and Mahaska in\nthe Southwest and Midwest.\n     - E-Commerce\n       - Quick Commerce with Ohi: Alkaline88 partnered with Ohi, the\nnext-generation instant commerce platform. Ohi's model allows for two-hour\ndelivery of Alkaline88 in New York and Los Angeles, with plans to expand to\nother major markets soon.\n       - Digital Optimization: The Company has optimized its presence\nacross the web and/on major retail e-comm platforms like Walmart.com,\nSamsClub.com, and Amazon.com where it now has multiple products available\nthrough Amazon Prime. The company has also optimized its own e-comm\nplatform, Alkaline88.com.\n     - Club/Specialty Retailers/Grocery/Drugstore\n       - Sam's Club: Alkaline88(TM) entered the Club channel for the first\ntime in Q3 of fiscal 2022 with the 1-liter 12-pack available in 587 Sam's\nClubs nationwide.\n       - GNC: Two Alkaline88 single-serve sizes are now available in 350\npremium GNC Retail Locations around the country.\n       - CVS: Multiple new Alkaline88 SKUs have been added to CVS shelves\naround the country.\n     - Hospitality Channel:\n       - Alkaline88 in Airports: Alkaline88 landed in over 100 market\nkiosks in 9 of the busiest airports in the United States including JFK,\nLGA, EWR, ORD, MCO, IAH, PHL, MSP, and DCA.\n       - iDeal Partnership: The Alkaline Water Company partnered with iDeal\nHospitality Partners Group to multiply its efforts in marketing, business\ndevelopment, and sales within the multi-billion-dollar hospitality channel.\n       - 750 ML Aluminum: Alkaline88 is producing its first run of its new\n750ml white aluminum bottle this month. This product has been designed to\ntarget on-premise consumption in the Hospitality and Foodservice channels.\n     - Functional Beverages\n       - A88CBD(TM) FreshCap(TM): The Alkaline Water Company launched a new\nline of functional beverages, the A88CBD FreshCap powered by Vessl(TM).\nFirst shipments of the new products went to several distributors across\nmultiple states. The Company is continuing to work with buyers in\nCalifornia, Texas, New York and other states where local regulations allow.\n     - Minimized Supply Chain Disruption\n       - Co-Packers and Suppliers: With the addition of new\ngeographically-distributed copackers and raw material suppliers throughout\nthe country this year, The Alkaline Water Company was able to significantly\nincrease production capacity, decrease shipping distances, and ensure raw\nmaterial supply.\n     - Single Serve:\n       - Almost 20% of Cases Sold: Thanks to successful expansion into\nclub, specialty, and convenience channels, Alkaline88 single serve sizes\naccounted for almost 20% of Q3's cases sold.\n     \"Our ambition has always been to make Alkaline88(TM) a household\nbrand,\" stated Mr. Wright. \"The many successes we had this past quarter are\nmoving us toward that goal. Thanks to the efforts of our sales team and the\nmarketing department's excellent integration with our brand ambassador\nShaquille O'Neal and Authentic Brands Group, our brand awareness and our\nmarket penetration has never been higher. Thanks to the hard work of our\noperational team and our co-packers, we've avoided most of the supply chain\nissues of our competitors and have continued to deliver when others\ncouldn't.\"\n     Fiscal 2022 Third Quarter Financial Results (unaudited)\n     (All amounts are in U.S. dollars)\n     - For the fiscal third quarter ended December 31, 2021, the Company\nrecorded revenue of approximately $15.1 million, an increase of 57% over\nthe prior year's quarter and the second-best quarter in the Company's\nhistory.\n     - Gross profit in the fiscal third quarter was $5 million, an increase\nof 48% compared to $3.4 million from the prior year's quarter.\n     - Total operating expenses for the fiscal third quarter were $15.9\nmillion, compared to $7.6 million from the prior year's quarter.\n     - Net loss for the fiscal third quarter was 10.7 million or ($.10) per\nshare versus a net loss of $4.4 million or ($0.06) per share in the third\nquarter of fiscal 2021. Both the net loss and net loss per share were\nimpacted by non-cash expenses of approximately ($0.03) per share in the\nquarter ended December 31, 2021.\n     - Cash used by operations during the nine months ended December 31,\n2021 totaled approximately $25.9 million as compared to $9.6 million of\ncash used by operations in the nine months ended December 31, 2020.\n    - Cash position of $3.3 million at end of third quarter fiscal 2022.\n\n    \"Sales have been excellent but like almost everyone, we have seen\nsignificant margin contraction as a result of inflationary pressures over\nthe last 12 months,\" continued Mr. Wright. \"We've taken a number of steps\nthat will allow us to increase our margins beginning first quarter of\nfiscal 2023. These steps include (1) an approximate 9% across the board\nprice increase (effective across all banners for the entire fiscal 2023);\n(2) a potential leveling off or small reduction in freight costs due to the\ngeographic distribution of our new co-packers and suppliers; and (3) our\nbuying power allowing us to lock in price breaks on raw materials over the\nnext 12 months.\n     \"With these in place, management expects our margins to increase\nbetween 3% and 5% in fiscal 2023, as we continue to explore other ways to\nreduce our operating deficits without hampering our growth.\"\n     Fiscal 2022 Outlook:\n     \"We reiterate our guidance of $62 million,\" continued Mr. Wright. \"As\nthis fiscal year draws to a close, the drivers for next fiscal year are\nfirmly in place to see sales growth throughout fiscal 2023. Our team has\nworked hard to build a strong brand with the ability to meet the demands of\ncontinued expansion. Our momentum has continued into our fourth fiscal\nquarter. The most recent Nielsen data for the 4-weeks ending 1.29.2022\nshows that we grew 60% year-over-year for that period. For the first time\nin the company's history, we are ranked as the seventh largest enhanced\nwater company in the country after leapfrogging several competitors. We\nlook forward to adding tremendous value for our customers, employees and\nshareholders now and for years to come.\"\n     Third Quarter Fiscal 2022 Conference Call\n     The Company will hold a conference call today, Monday, February 14,\n2022, at 4:30 PM Eastern Time.\n     Conference Call Details:\n     Date: February 14, 2022\n     Time: 4:30 PM Eastern Time (ET)\n     Dial-in Number for U.S. and Canadian Callers: 877-407-3088\n     Dial-in Number for International Callers (Outside of the U.S. and\nCanada): 201-389-0927\n     Conference ID Number: 13727098\n     Participating on the call will be the Company's President and CEO,\nRichard A. Wright, and Chief Financial Officer, David Guarino, who will\ndiscuss operational and financial highlights for the third quarter and the\noutlook for the final quarter of fiscal year 2022.\n     To join the live conference call, please dial into the\nabove-referenced telephone numbers five to ten minutes prior to the\nscheduled call time.\n     A replay will be available for one week starting on February 14, 2022,\nat approximately 8:30 PM (ET). To access the replay, please dial\n877-660-6853 in the U.S. or Canada and 201-612-7415 for international\ncallers and use Access ID: 13727098.\n     About The Alkaline Water Company:\n     The Alkaline Water Company is the Clean Beverage(TM) company making a\ndifference in the water you drink and the world we share.\n     Founded in 2012, The Alkaline Water Company (NASDAQ and CSE: WTER) is\nheadquartered in Scottsdale, Arizona. Its flagship product, Alkaline88(TM),\nis a leading premier alkaline water brand available in bulk and\nsingle-serve sizes along with eco-friendly aluminum packaging options. With\nits innovative, state-of-the-art proprietary electrolysis process,\nAlkaline88(TM) delivers perfect 8.8 pH balanced alkaline drinking water\nwith trace minerals and electrolytes and boasts our trademarked \"Clean\nBeverage\" label. In 2021, The Alkaline Water Company was pleased to welcome\nShaquille O'Neal to its board of advisors and to serve as the celebrity\nbrand ambassador for the Alkaline88(TM) and A88 Infused(TM) brands.\n     To purchase The Alkaline Water Company's products online, visit us at\nwww.alkaline88.com.\n     To learn more about The Alkaline Water Company, please visit\nwww.thealkalinewaterco.com or connect with us on Facebook, Twitter,\nInstagram, or LinkedIn.\n     Notice Regarding Forward-Looking Statements\n     This news release contains \"forward-looking statements.\" Statements in\nthis news release that are not purely historical are forward-looking\nstatements and include any statements regarding beliefs, plans,\nexpectations or intentions regarding the future. Such forward-looking\nstatements include, among other things, the following: the statements\nrelating to the Company fiscal 2022 revenue guidance of $62 million; the\nCompany's belief that year-over-year quarterly growth will continue; the\nCompany's goal to make Alkaline88(TM) a household brand; the statements\nregarding the steps that the Company has taken that will allow the Company\nto increase its margins beginning first quarter of fiscal 2023, including\nan approximate 9% across the board price increase (effective across all\nbanners for the entire fiscal 2023) and a potential leveling off or small\nreduction in freight costs due to the geographic distribution of the\nCompany's new co-packers and suppliers and the Company's buying power\nallowing the Company to lock in price breaks on raw materials over the next\n12 months; management's expectation that the Company's margin to increase\nbetween 3 and 5% in fiscal 2023; that the drivers for next fiscal year are\nfirmly in place to see sales growth throughout fiscal 2023; and that the\nCompany has the ability to meet the demands of continued expansion; that\nthe Company looks forward to adding tremendous value for its customers,\nemployees and shareholders now and for years to come.\n     The material assumptions supporting these forward-looking statements\ninclude, among others, that the Company will have consistent organic growth\nof between 10-30% within many of its largest long-term retail clients; that\nretail resets will return to a normal cadence, and the Company will earn\nnew shelf space with current and new clients; that the Company will see a\n15-20% increase in store count over the next 12 months; that the Company's\nexpectation that single-serves to account for 20-25% of the Company's sales\nin fiscal 2023; that the Company expects to start seeing significant growth\nin E-Commerce and hospitality sales in Q4 of fiscal 2022; that the new\nDirect-Store-Delivery model that the Company rolled out in Arizona, Nevada,\nand the Midwest will continue to be very successful; that the Company's\nexpansion into functional beverages above and beyond superior hydration\nwill be successful; the demand for the Company's products will continue to\nsignificantly grow in all of its sales channels; that the past production\ncapacity of the Company's co-packing facilities can be maintained or\nincreased; that there will be increased production capacity through\nimplementation of new production facilities, new co-packers and new\ntechnology; that there will be an increase in number of products available\nfor sale to retailers and consumers; that there will be an expansion in\ngeographical areas by national retailers carrying the Company's products;\nthat there will be an expansion into new national and regional grocery\nretailers; that there will be an expansion into new e-commerce, home\ndelivery, convenience, and healthy food channels; that there will not be\ninterruptions on production of the Company's products; that there will not\nbe a recall of products due to unintended contamination or other adverse\nevents relating to the Company's products; and that the Company will be\nable to obtain additional capital to meet the Company's growing demand and\nsatisfy the capital expenditure requirements needed to increase production\nand support sales activity. Actual results could differ from those\nprojected in any forward-looking statements due to numerous factors. Such\nfactors include, among others, governmental regulations being implemented\nregarding the production and sale of alkaline water or any other products,\nincluding products containing hemp/CBD; the fact that consumers may not\nembrace and purchase any of the Company's CBD-infused products; the fact\nthat the Company may not be permitted by the FDA or other regulatory\nauthority to market or sell any of its CBD-infused products; additional\ncompetitors selling alkaline water and enhanced water products in bulk\ncontainers reducing the Company's sales; the fact that the Company does not\nown or operate any of its production facilities and that co-packers may not\nrenew current agreements and/or not satisfy increased production quotas;\nthe fact that the Company has a limited number of suppliers of its unique\nbulk bottles; the potential for supply-chain interruption due to factors\nbeyond the Company's control; the fact that there may be a recall of\nproducts due to unintended contamination; the inherent uncertainties\nassociated with operating as an early stage company; changes in customer\ndemand and the fact that consumers may not embrace enhanced water products\nas expected or at all; the extent to which the Company is successful in\ngaining new long-term relationships with new customers/retailers and\nretaining existing relationships with customers/retailers; the Company's\nability to raise the additional funding that it will need to continue to\npursue its business, planned capital expansion and sales activity; and\ncompetition in the industry in which the Company operates and market\nconditions. These forward-looking statements are made as of the date of\nthis news release, and the Company assumes no obligation to update the\nforward-looking statements, or to update the reasons why actual results\ncould differ from those projected in the forward-looking statements, except\nas required by applicable law, including the securities laws of the United\nStates and Canada. Although the Company believes that any beliefs, plans,\nexpectations and intentions contained in this news release are reasonable,\nthere can be no assurance that any such beliefs, plans, expectations or\nintentions will prove to be accurate. Readers should consult all of the\ninformation set forth herein and should also refer to the risk factors\ndisclosure outlined in the reports and other documents the Company files\nwith the SEC, available at www.sec.gov, and on the SEDAR, available at\nwww.sedar.com.\n\nContacts:\n\nThe Alkaline Water Company Inc.\nJeff Wright\nDirector of Investor Relations\n866-242-0240\ninvestors@thealkalinewaterco.com\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204400863.MNPRE2204402840-16145420220214</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}