{"date": "2021-11-04 02:38:40.300000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Diwali 2021 sale offers: Both Amazon and Flipkart are offering Apple, Samsung, Mobvoi and Fitbit smartwatches at discounted rates.</p><p>Festival sales are still live and the e-commerce giants are offering big discounts on several wearables. Both Amazon and Flipkart are offering Apple, Samsung, Mobvoi, and Fitbit smartwatches at discounted rates. If you have been waiting for festival sales to get your favourite wearable at the lowest price, then you should check out the below list.</p></div><div class=\"tr-npp-body\"><p>Check out 5 best smartwatches that you can buy this Diwali</p><p>Samsung Galaxy Watch 4 at Rs 24,997</p><p>This Diwali, you can buy the Samsung Galaxy Watch 4, which is currently available at an effective price of Rs 24,997. This price is for the 44mm Bluetooth variant. It was originally launched for Rs 26,999. There is a Rs 2,000 discount on Amazon, which brings down the price to Rs 24,997.</p><p>It comes with heart rate monitoring, SpO2 tracking, and sleep analysis. There is also support for electrocardiogram (ECG), fall detection, and menstrual cycles analysis. The smartwatch also works with Samsung Pay and Google Pay services.</p><p>Apple Watch SE at Rs 25,900</p><p>You will rarely see discounts on expensive Apple products. One can also buy the 44mm variant (GPS) of the Apple Watch SE as it has received a big discount on Amazon. The wearable, which was launched for Rs 36,900, can be bought for Rs 27,900 via this e-commerce site. The Space Grey variant with a 40mm size is listed on the site for 25,900, down from Rs 33,900. If you have been waiting for festival sales, then this is the right to buy this watch.</p><p>Oppo Watch at Rs 14,990</p><p>There is no discount on the Oppo Watch, but you can consider buying it if you are looking for a good WearOS smartwatch. It has a design similar to Apple's Watch and has a lot of fitness modes as well. With this wearable, you can respond to messages from different social media platforms. It has an AMOLED display, a Qualcomm Snapdragon Wear 3100 SoC, a 5ATM water-resistance build, and more. The 41mm variant will cost Rs 14,990. There is a 10 percent discount offer on ICICI bank credit card.</p><p>Fitbit Versa 3 at Rs 17,849</p><p>For fitness freaks, one of the best options is the Fitbit Versa 3. It is available for as low as Rs 17,849 on Amazon. It comes with support for GPS, a digital assistant, a built-in speaker, Fitbit Pay, a 1.58-inch AMOLED display, and offers several fitness statistics. It has health features like sleep monitoring, heart rate tracker, SpO2 monitoring, skin temperature monitoring, menstrual health tracking, and more.</p><p>TicWatch E3 at Rs 15,999</p><p>You can also check out the TicWatch E3, which has received a discount of Rs 4,000 on Amazon. It is a feature-rich smartwatch, which offers the latest Qualcomm Snapdragon 4100 chip. It will also get the upcoming major Wear OS 3 update, which a lot of other wearables won't offer. The TicWatch E3, which was previously available for Rs 19,999, is selling for Rs 15,999.</p><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}