{"date": "2022-02-25 10:15:29+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2896.54, "close": 3075.77}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\"><li class=\"tr-summaryitem\">2021 group trading profit down 12%, shares down 14%</li><li class=\"tr-summaryitem\">Focus on improving sales, cash flow, debt reduction in 2022</li><li class=\"tr-summaryitem\">Casino confident can complete disposal plan by end-2023</li></ul><p class=\"tr-advisory\">adds shares, analysts, details</p><p class=\"tr-by\">By Dominique Vidalon</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">PARIS, Feb 25 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Casino <a href=\"reuters://REALTIME/Verb=FullQuote/ric=CASP.PA\" data-type=\"ric\" data-ric=\"CASP.PA\" translate=\"no\" dir=\"ltr\">CASP.PA</a> shares slumped on Friday after the supermarket group reported a 12% drop in operating profit on lower sales last year and reignited investor concerns over high debts and low cash flows.</p><p>The French retailer, which has been selling assets to cut debt, said the pandemic had slowed the pace of its disposal plan and it now aimed to complete the final 1.3 billion euro part of the 4.5 billion euro plan by the end of 2023.</p><p>It was confident sales momentum in France would recover this year and vowed to improve cash flow generation while maintaining a \"high level of profitability.\"</p><p>But the forecasts did little to reassure investors. At 0924 GMT, Casino shares were down 14% at 15.66 euros, at the bottom of France's SBF 120 index &lt;.SBF 20&gt;.</p><p>\"The underlying cash burn of the French business is and should remain the real concern ... we can't be sure that 2022 will be really easier and that cash-burn will stop in France,\" said Bryan Garnier analyst Clement Genelot.</p><p>Jefferies analysts said the desire to improve cash flows would be \"challenged by a tough domestic context of accelerating input pressures.\" </p><p>Casino, which ended 2021 with 562 million euros in cash and cash equivalents, said it would not pay a dividend for 2021 in order to prioritise debt reduction.</p><p>At end-2021, consolidated net debt stood at 5.9 billion euros, against 4.6 billion a year earlier.</p><p>Group operating profit fell 12% to 1.19 billion euros in 2021. That reflected a 14% decline in core profit in France, where same-store sales fell 5.4%, notably due to the impact of the pandemic on the Paris region and on tourist flows. Sales remained robust in Brazil, Casino's No.2 market. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nS8N2MH01U\" data-type=\"storyId\" data-story-id=\"nS8N2MH01U\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Casino, which controls Brazil's Grupo Pao de Acucar <a href=\"reuters://REALTIME/Verb=FullQuote/ric=PCAR4.SA\" data-type=\"ric\" data-ric=\"PCAR4.SA\" translate=\"no\" dir=\"ltr\">PCAR4.SA</a>, said total group sales were 30.55 billion euros, down 0.8% on a same-store basis. </p><p>To boost sales growth, Chief Executive Jean-Charles Naouri is banking on an accelerated expansion in convenience stores such as Monoprix, Franprix and Naturalia, targeting the opening of over 800 such stores in 2022, mainly under franchise.</p><p>To boost profitability, the group is looking to monetise client data, make savings from purchasing deals - notably with France's Intermarche - and to focus more on e-commerce, organic food, convenience stores and energy services.</p><p>Casino has a partnership with online British grocer Ocado <a href=\"reuters://REALTIME/Verb=FullQuote/ric=OCDO.L\" data-type=\"ric\" data-ric=\"OCDO.L\" translate=\"no\" dir=\"ltr\">OCDO.L</a>, which they extended this month to develop e-commerce logistics centres for retailers in France. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2US0G5\" data-type=\"storyId\" data-story-id=\"nL1N2US0G5\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Casino's Monoprix supermarket arm has a deal with Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and Casino also recently sealed a partnership with German quick commerce group Gorillas. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2US0G5\" data-type=\"storyId\" data-story-id=\"nL1N2US0G5\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>($1 = 0.8915 euros)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Dominique Vidalon<br/>Additional reporting Anait Miridzhanian<br/>Editing by Sherry Jacob-Phillips and Mark Potter)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:dominique.vidalon@thomsonreuters.com\" data-type=\"email\" translate=\"no\">dominique.vidalon@thomsonreuters.com</a> ; +33149495432; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://dominique.vidalon.reuters.com@reuters.net\">dominique.vidalon.reuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: CASINO-RESULTS/ (UPDATE 2, PIX)</p></div>"}