{"date": "2021-11-03 09:00:00.394000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Paysafe Using AWS to Deliver Fast and Innovative Services for Digital Wallet Customers </b>\n</p><p class=\"bwalignc\">\n<span><b>Leading specialized payments platform announces migration of its Digital Wallet services to </b></span><span><b>the AWS Cloud</b></span>\n</p><p>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.paysafe.com%2Fen%2F&amp;esheet=52520608&amp;newsitemid=20211103005332&amp;lan=en-US&amp;anchor=Paysafe&amp;index=1&amp;md5=614c8c31eb1bd8ca28859172f28c66a1\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Paysafe</a> (NYSE: PSFE), a leading specialized payments platform, today announces the latest milestone in its strategy to become a fully cloud-based payments provider with the migration of its digital wallets, Skrill and NETELLER, and all associated business services to Amazon Web Services (AWS). The completion of the Digital Wallets cloud migration is part of a global multi-year agreement with AWS that supports Paysafe’s cloud strategy.\n</p><p>\nThe move to AWS has enabled Paysafe to scale its Digital Wallet operations to drive increased efficiency and innovation behind its consumer solutions and reduce the deployment time of its merchant integrations by approximately 80%, accelerating time to market for its business customers.\n</p><p>\nThe migration of Paysafe’s Digital Wallets services represents the completion of the transition of the company’s broad portfolio of mission critical workloads to the cloud with AWS. It follows the transition of Paysafe’s eCash solutions earlier this year.\n</p><p>\nBy moving its mission critical workloads to the cloud, Paysafe now has the ability to open up new revenue streams by combining numerous business lines to create innovative and frictionless services based on real-time insights. At the same time, the company is poised to make considerable savings in hardware investment costs by operating in the cloud.\n</p><p>\nPaysafe’s Digital Wallets portfolio offers a popular alternative payment method for consumers, with the ability to send and spend money online from a Skrill or NETELLER account. It allows customers to upload funds from credit and debit cards, bank accounts and a variety of alternative payment methods and use those funds to send money to friends and family or spend online. Customers can also use a prepaid card. For merchants, it provides a platform that supports multiple payment methods including credit cards, prepaid cards and real-time banking solutions. Merchants using Skrill and NETELLER are able to promote their services to millions of users around the world.\n</p><p>\nPaysafe believes it will increase efficiencies and reduce its liabilities in merchant underwriting by using AWS’s global infrastructure and data modelling solutions, including its risk analytics services. Paysafe has also transitioned its disaster recovery completely to AWS as part of its move to develop and deploy next-generation capabilities using AWS’s comprehensive portfolio of cloud services.\n</p><p>\nPaysafe’s cloud platform now positions the company to power its growth strategy in 2022 by offering additional products and bolt-on services with its partner ecosystem.\n</p><p>\nRoy Aston, Chief Information Officer at Paysafe, said: “We began our relationship with AWS at the onset of the pandemic, and we have developed a deep collaboration between our two companies over the last 18 months. By moving the majority of our critical workloads to the cloud, we have been able to rapidly respond to new market conditions and changing consumer needs. We are excited to continue our strategic collaboration with AWS and further solidify our commitment to developing new cloud-native consumer wallet products for our business and consumer customers.”\n</p><p>\n“Paysafe’s dedication to modernizing its infrastructure using AWS is a testimony to the company’s commitment to deliver innovative payment solutions for its consumer and business clients,” said Scott Mullins, Managing Director, Worldwide Financial Services Business Development at Amazon Web Services. “We look forward to our continued collaboration with Paysafe, and we are excited to support the company’s mission to become a fully cloud-based payments provider.”\n</p><p>\n<strong>About Paysafe Limited\n<br/></strong>Paysafe Limited (“Paysafe”) (NYSE: PSFE) (PSFE.WS) is a leading specialized payments platform. Its core purpose is to enable businesses and consumers to connect and transact seamlessly through industry-leading capabilities in payment processing, digital wallet, and online cash solutions. With over 20 years of online payment experience, an annualized transactional volume of US $100 billion in 2020, and approximately 3,400 employees located in 12+ global locations, Paysafe connects businesses and consumers across 70 payment types in over 40 currencies around the world. Delivered through an integrated platform, Paysafe solutions are geared toward mobile-initiated transactions, real-time analytics and the convergence between brick-and-mortar and online payments.\n</p><p>\nFurther information is available at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.paysafe.com%2F&amp;esheet=52520608&amp;newsitemid=20211103005332&amp;lan=en-US&amp;anchor=www.paysafe.com&amp;index=2&amp;md5=46ad534f616aa6dc88bf8b9dc8a3300a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.paysafe.com</a>.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211103005332r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTAzMDA1MzMycjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=543873a9de5de718c2039653b83d406fd3c1f15e21b7c902124ab2e3f7c0ef0a5f0595f3be1b45e1ca1ae3d6dda8068a62dd68f29c0ea977590eb55409b351f0\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211103005332/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211103005332/en/</a></span></p><p>\nAnna Howard, Director of Communications, Europe and Asia, Paysafe\n<br/><a href=\"mailto:Anna.howard@paysafe.com\" data-type=\"email\" translate=\"no\">Anna.howard@paysafe.com</a><br/>Phone: +442038908975\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: PAYSAFE</p></div>"}