{"date": "2022-02-17 13:40:53.005000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3130.21, "close": 3093.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>WONDERFI TECHNOLOGIES INC (\"WNDR-V;WONDF-0\")\n- Buyback of up to 7,935,883 Shares\n\n     WonderFi Technologies Inc. (the \"Company\" or \"WonderFi\"), a leading\ntechnology company with the mission of creating better access to digital\nassets through compliant centralized and decentralized platforms, is\npleased to announce it has filed a Notice of Normal Course Issuer Bid (the\n\"Share Buyback Program\") with the NEO Exchange which has been accepted for\nthe purchase of up to 10% of the public float of its common shares (the\n\"Shares\").\n\n     Management and the board of directors of the Company believe that the\ncurrent market price of the Shares does not adequately reflect their value\nbased on market comparables, and that the purchase of Shares under the\nShare Buyback Program is in the best interests of the Company. The Company\nbelieves the Share Buyback Program is a desirable use of its available cash\nand will enhance shareholder value in general.\n\n     Pursuant to the Share Buyback Program, WonderFi may purchase up to a\nmaximum of 7,935,883 Shares, representing approximately 10% of its public\nfloat of Shares as at the date hereof, subject to the normal terms and\nlimitations of such bids. In accordance with NEO Exchange rules, daily\npurchases (other than pursuant to a block purchase exemption) on the NEO\nExchange under the Share Buyback Program cannot exceed the greater of 25%\nof the average daily trading volume on the NEO Exchange or 1,000 Shares.\n\n     The actual number of Shares that will be purchased under the Share\nBuyback Program, if any, and the timing of such purchases will be\ndetermined by the Company, from time to time. The timing and extent of\nrepurchases will depend upon several factors, including market and business\nconditions, valuation of the Shares, regulatory requirements and other\ncorporate considerations. Purchases under the Share Buyback Program may be\nmade through open market transactions on the NEO Exchange and/or any\nCanadian alternative trading systems on which the Shares are traded, based\non the prevailing market price. Any Shares purchased under the Share\nBuyback Program will be cancelled.\n\n     The Company intends to appoint Canaccord Genuity Corp. (\"Canaccord\")\nas the broker through which the Company will conduct purchases under the\nShare Buyback Program, which purchases will be completed pursuant to the\npolicies of the NEO Exchange. The Company and Canaccord intend on entering\ninto a dealer agreement outlining the terms upon which the Share Buyback\nProgram will be conducted. The price that the Company will pay for the\nShares purchased under the Share Buyback Program, if any, will be the\nprevailing market price of such Shares at the time of the applicable\npurchases.\n\n     Pursuant to the NEO Exchange rules, the period during which the\nCompany will be authorized to make purchases under the Share Buyback\nProgram will commence two trading days after the date hereof, on February\n22, 2022, and end the earlier of (i) February 22, 2023 or (ii) such earlier\ndate on which the maximum number of Shares are purchased under the Share\nBuyback Program. The Company has not purchased any Shares during the\nprevious year pursuant to any issuer bid. To the knowledge of the Company,\nno director, senior officer or other insider of the Company currently\nintends to sell any Shares under the Share Buyback Program\n\n     Additional Information\nFor additional information, please contact:\n\n     WonderFi Technologies Inc.\nBen Samaroo, CEO\nben@wonder.fi\n(778) 843-9637\n\n     Investor Relations Contact: invest@wonder.fi\nMedia Contact: press@wonder.fi\n\n     Neither the NEO Exchange nor its Regulation Services Provider (as that\nterm is defined in the policies of the NEO Exchange) accepts responsibility\nfor the adequacy or accuracy of this release.\n\n     ABOUT WONDERFI\n\n     WonderFi is a leading technology company with the mission of creating\nbetter access to DeFi through the core principles of simplicity and\neducation. WonderFi has a multi-pronged business strategy which includes a\nhigh-growth consumer finance app which will serve as a trusted gateway to\nthe new financial system, and a digital asset portfolio which consists of\nleading crypto and DeFi assets. WonderFi's executive team and Board of\nDirectors have an established track record in finance and crypto, with\nprevious experience at Amazon, Shopify, PayPal, Galaxy Digital and Hut 8.\nWonderFi's core team of engineers and technologists believe that everyone\nshould have equal access to finance and are aligned in the mission to\nempower people around the world to access DeFi in a simple, smart and\nsecure way.\n\n     For more information, visit www.wonder.fi.\n\n     Forward-Looking Information and Statements\n\n     This press release contains certain \"forward-looking information\"\nwithin the meaning of applicable Canadian securities legislation and may\nalso contain statements that may constitute \"forward-looking statements\"\nwithin the meaning of the safe harbor provisions of the United States\nPrivate Securities Litigation Reform Act of 1995. Such forward-looking\ninformation and forward-looking statements are not representative of\nhistorical facts or information or current condition, but instead represent\nonly the Company's beliefs regarding future events, plans or objectives,\nmany of which, by their nature, are inherently uncertain and outside of the\nCompany's control. In this news release, forward looking-statements relate\nto, among other things, statements relating to: the number of Shares to be\npurchased, timing of any purchases, the consideration paid for any Shares\npurchased and the period in which the Company is authorized to make\npurchases under the Share Buyback Program; future enhancements of\nshareholder value due to the Share Buyback Program; the appointment of\nCanaccord as the broker through which the Company will conduct purchases\nunder the Share Buyback Program. Generally, such forward-looking\ninformation or forward-looking statements can be identified by the use of\nforward-looking terminology such as \"could\", \"intend\", \"expect\", \"believe\",\n\"will\", \"projected\", \"estimated\", or variations of such words. By\nidentifying such information and statements in this manner, the Company is\nalerting the reader that such information and statements are subject to\nknown and unknown risks, uncertainties and other factors that may cause the\nactual results, level of activity, performance or achievements of the\nCompany to be materially different from those expressed or implied by such\ninformation and statements. In addition, in connection with the\nforward-looking information and forward-looking statements contained in\nthis press release, the Company has made certain assumptions. Among the key\nfactors that could cause actual results to differ materially from those\nprojected in the forward-looking information and statements are the\nfollowing: the ability of the Company to work effectively with strategic\ninvestors; and changes in general economic, business and political\nconditions, including changes in the financial markets, changes in\napplicable laws, and compliance with extensive government regulation.\nShould one or more of these risks, uncertainties or other factors\nmaterialize, or should assumptions underlying the forward-looking\ninformation or statements prove incorrect, actual results may vary\nmaterially from those described herein. Although the Company believes that\nthe assumptions and factors used in preparing, and the expectations\ncontained in, the forward-looking information and statements are\nreasonable, undue reliance should not be placed on such information and\nstatements, and no assurance or guarantee can be given that such\nforward-looking information and statements will prove to be accurate, as\nactual results and future events could differ materially from those\nanticipated in such information and statements. The forward-looking\ninformation and forward-looking statements contained in this press release\nare made as of the date of this press release, and the Company does not\nundertake to update any forward-looking information and/or forward-looking\nstatements that are contained or referenced herein, except in accordance\nwith applicable securities laws. All subsequent written and oral\nforward-looking information and statements attributable to the Company or\npersons acting on its behalf is expressly qualified in its entirety by this\nnotice.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204700147.MNPRE2204700858-05193820220217</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}