{"date": "2021-11-08 16:11:06.132000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>APOLLO GLOBAL MANAGEMENT INC (\"APO-N\")\n- Names Carletta Ooton Head of ESG for Private Equity\n\n     Apollo today announced that Carletta Ooton has joined the Firm as Head\nof ESG for Private Equity and an Operating Partner within Apollo's\nPortfolio Performance Solutions (\"APPS\") platform. In this new role, Ms.\nOoton will look to build on the Firm's long-standing commitment to ESG by\nadvancing ESG integration and performance across its private equity\nportfolio.\n\n     Matt Nord and David Sambur, Co-Heads of Private Equity, said, \"ESG\ncontinues to be a critical component of our investment process and a\nsignificant value driver for our managed funds' portfolio companies. We are\nexcited to welcome a dedicated operator of Carletta's caliber to accelerate\nthe great work our teams are already doing as we look to help management\nteams build better, more sustainable companies and generate exceptional\nreturns for our investors.\"\n\n     Aaron Miller, Head of APPS, said, \"Carletta's incredible track record\nof building industry-leading ESG programs across large and complex\norganizations will help to unlock tangible, differentiated, and operational\nperformance across our portfolio. As importantly, her experience will help\nto drive positive social and environmental impact, as we improve\noperational inefficiencies, such as energy usage, carbon emissions, water\nconsumption and others. We look forward to working with Carletta as we\ncontinue to position our Firm as an industry-leader in ESG and further\nscale our APPS platform.\"\n\n     Ms. Ooton joins Apollo from Amazon, where she served as Vice President\nof Product Assurance, Risk and Security since 2014, overseeing several\ninternational teams focused on safety, compliance, product quality and\nglobal operations. While at Amazon, Ms. Ooton was instrumental in Amazon's\nfoundational sustainability efforts, including calculating its carbon\nfootprint for the first time and enabling the launch of the Amazon Climate\nPledge. As part of her role, Ms. Ooton established Amazon's sustainability\ncapabilities, including Energy &amp; Environment, Transportation\nSustainability, and Sustainability Science in addition to advancing the\nSocial Responsibility, Customer Packaging Experience, and Environment,\nHealth &amp; Safety functions.\n\n     Prior to Amazon, Ms. Ooton held a number of operations and\nsustainability-focused leadership roles at The Coca-Cola Company from 2006\nto 2014. During her tenure, she led the development and execution of all\nquality, safety and environmental policies and practices across the company\nand the Coca-Cola system. Earlier in her career, Ms. Ooton held quality and\noperational roles at Cott Beverages, Bath &amp; Body Works, Unilever and Tate &amp;\nLyle.\n\n     Ms. Ooton's appointment builds on the Firm's long track record of\nleadership in ESG reporting and measurement and underscores Apollo's\nfirmwide commitment to ESG and sustainability integration. Earlier this\nmonth, Dave Stangis joined as the Firm's Chief Sustainability Officer, a\nnewly created role to spearhead sustainability and ESG efforts across the\nenterprise, and most recently, Michael Kashani joined as Head of ESG for\nthe Firm's Credit business. Mr. Stangis and Mr. Kashani join a\ndistinguished group of individuals working on ESG initiatives across the\nFirm. For more information about Apollo's industry leading ESG platform,\nplease visit <a href=\"https://www.apollo.com/responsibility\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.apollo.com/responsibility</a>.\n\n     About Apollo\n\n     Apollo is a high-growth, global alternative asset manager. We seek to\nprovide our clients excess return at every point along the risk-reward\nspectrum from investment grade to private equity with a focus on three\nbusiness strategies: yield, hybrid and equity. Through our investment\nactivity across our fully integrated platform, we serve the retirement\nincome and financial return needs of our clients, and we offer innovative\ncapital solutions to businesses. Our patient, creative, knowledgeable\napproach to investing aligns our clients, businesses we invest in, our\nemployees and the communities we impact, to expand opportunity and achieve\npositive outcomes. As of September 30, 2021, Apollo had approximately $481\nbillion of assets under management. To learn more, please visit\nwww.apollo.com.\n\n     Contacts\n\n     For Investors:\nNoah Gunn\nGlobal Head of Investor Relations\nApollo Global Management, Inc.\n(212) 822-0540\nIR@apollo.com\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2131100425.MNPRE2131101795-08052920211108</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}