{"date": "2021-11-03 11:14:36.004000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Oct 28, 2021</p></div><div class=\"tr-npp-lead\"><p>Brand new all-time closing highs greeted the closing bell for both the S&amp;P 500 and the Nasdaq this afternoon, while the Dow remains a couple dozen points or so below its record high set Tuesday this week. The Dow was up +239 points, +0.67%, while the S&amp;P was +0.98% to narrowly below 4600. The Nasdaq grew 212 points, +1.39%, to 15,448. The small-cap Russell 2000 outpaced the field, +2.02% on the day.While U.S. Congress draws closer to an infrastructure deal — now reportedly shrunken to $1.75 billion from $3.5 billion initially bandied about — and no discerning future taxation to hamper higher-income Americans (at least at this stage), in addition to Q3 earnings reports that are generally handling supply chain constraints with aplomb, market indexes don't seem to have much choice but to go up. Vaccinations continue to help the U.S. move toward herd immunity, and booster shots coming online are giving consumers confidence to head out to shops, restaurants and entertainment venues. In short, Q3 — and now early Q4 — are demonstrating real economic strength.We're also at post-Covid lows on weekly jobless claims, both initial and continuing, as we saw in this mornings report. Even with Q3 GDP coming in at a disappointing +2.0% in its first print, and Pending Home Sales from last month swinging to a negative, -2.3%, the markets do not seem to mind. After all, most of these economic metrics and earnings reports are a peek in the rearview mirror; the real news is ahead of us.Speaking of Q3 earnings,<span>Amazon <a href=\"https://www.zacks.com/stock/quote/AMZN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AMZN</a> </span>posted big misses on both top and bottom lines for the quarter, with earnings of $6.12 per share badly short of the $8.712 in the Zacks consensus and roughly half the year-ago EPS of $12.37, and $110.81 billion in sales about a million dollars off analyst estimates. Further, Q4 revenue guidance has been lowered to $130-140 billion, from the $141.91 billion analysts were expecting.With an already established slowing economy, as well as higher spending on goods and workforce, Amazon is fighting through a tough part of the year, ahead of holiday shopping season. Online stores missed estimates to come in at $9.94 billion, although Amazon Web Services (AWS) surprised nicely to $16.11 billion, +39% year over year.Supply-chain issues is the story for<span>Apple's <a href=\"https://www.zacks.com/stock/quote/AAPL\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AAPL</a> </span>fiscal Q4 results, as the company met earnings estimates of $1.24 per share exactly, on $83.36 in sales, which came in below the $85.5 billion expected. These supply shortages of microchips from foundries overseas — which had their own Covid outbreaks in the quarter — were the culprit in Apple's relatively weak period, costing the company a reported $6 billion in the quarter.Shares had been falling 5% in late trading, as supply issues look to continue into fiscal 2022 for Apple. iPhone sales came in at 38.9 million, down from the 41.5 million expected. Share selling is moderating, however, leveling off closer to -3.5% in the after-market. Apple shares are +17% year to date, shy of the greater S&amp;P 500 over the same time period, but +32% year over year.Meanwhile,<span>Starbucks <a href=\"https://www.zacks.com/stock/quote/SBUX\" data-type=\"url\" class=\"tr-link\" translate=\"no\">SBUX</a> </span>met earnings estimates of $1.00 per share in its fiscal Q4 report, on $8.15 billion in sales which were light of estimates for $8.26 billion. Global comps missed expectations to +17% in the quarter, with U.S. coming in at +22% and International +3%. It's the toughest quarter for Starbucks in quite some time; the last time the world's leading coffee shop missed on the bottom line was way back in fiscal Q4 2015.<span>Gilead Pharma <a href=\"https://www.zacks.com/stock/quote/GILD\" data-type=\"url\" class=\"tr-link\" translate=\"no\">GILD</a> </span>, however, trounced estimates after the bell on its Q3 earnings report on significant gains in its Covid treatment remdesivir. Expectations had been for roughly $630 million for remdesivir sales; that actual number came in at $1.9 billion. An increase in Covid hospitalizations, especially in under-vaccinated regions during Q3, gave a boost to the company, whose earnings of $2.65 per share and sales of $7.42 billion were well beyond the $1.72 per share and $6.23 billion in revenues, respectively. <a href=\"https://www.zacks.com/bio/mark-vickery\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Questions or comments about this article and/or its author? Click here&gt;&gt;</a> </p><p><span>Bitcoin, Like the Internet Itself, Could Change Everything</span></p></div><div class=\"tr-npp-body\"><p>Blockchain and cryptocurrency has sparked one of the most exciting discussion topics of a generation. Some call it the \"Internet of Money\" and predict it could change the way money works forever. If true, it could do to banks what Netflix did to Blockbuster and Amazon did to Sears. Experts agree we're still in the early stages of this technology, and as it grows, it will create several investing opportunities.</p><p>Zacks' has just revealed 3 companies that can help investors capitalize on the explosive profit potential of Bitcoin and the other cryptocurrencies with significantly less volatility than buying them directly. </p><p><a href=\"https://www.zacks.com/registration/ultimatetrader/welcome/eoffer/3b9f?add=1424&amp;adid=NEWSTEX_CONTENT_ZU_CRYPTOCURRENCYREPORT_AHEADOFWALLSTREET_10282021&amp;cid=CS-NEWSTEX-FT-ahead_of_wall_street-1819493\" data-type=\"url\" class=\"tr-link\" translate=\"no\">See 3 crypto-related stocks now &gt;&gt;</a></p><p>Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.</p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=RPT_7BST_LP194&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_AHEADOFWALLSTREET&amp;cid=CS-NEWSTEX-FT-ahead_of_wall_street-1819493\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Click to get this free report</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=AMZN&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_AHEADOFWALLSTREET&amp;cid=CS-NEWSTEX-FT-ahead_of_wall_street-1819493\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. (AMZN): Free Stock Analysis Report</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=AAPL&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_AHEADOFWALLSTREET&amp;cid=CS-NEWSTEX-FT-ahead_of_wall_street-1819493\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Apple Inc. (AAPL): Free Stock Analysis Report</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=SBUX&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_AHEADOFWALLSTREET&amp;cid=CS-NEWSTEX-FT-ahead_of_wall_street-1819493\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Starbucks Corporation (SBUX): Free Stock Analysis Report</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=GILD&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_AHEADOFWALLSTREET&amp;cid=CS-NEWSTEX-FT-ahead_of_wall_street-1819493\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Gilead Sciences, Inc. (GILD): Free Stock Analysis Report</a></p><p> </p><p><a href=\"http://www.zacks.com/stock/news/1819493/markets-close-at-or-near-record-highs-sales-misses-for-aapl-amzn-sbux?cid=CS-NEWSTEX-FT-ahead_of_wall_street-1819493\" data-type=\"url\" class=\"tr-link\" translate=\"no\">To read this article on Zacks.com click here.</a></p><p> </p><p><a href=\"http://www.zacks.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Zacks Investment Research</a></p><p> </p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=RPT_7BST_LP194&amp;ADID=ZACKS_PFP_7BEST_ETF\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report</a></p><p>The views expressed in any and all content distributed by Newstex and its re-distributors (collectively, the \"Newstex Authoritative Content\") are solely those of the respective author(s) and not necessarily the views of Newstex or its re-distributors. Stories from such authors are provided \"AS IS,\" with no warranties, and confer no rights. The material and information provided in Newstex Authoritative Content are for general information only and should not, in any respect, be relied on as professional advice. Newstex Authoritative Content is not \"read and approved\" before it is posted. Accordingly, neither Newstex nor its re-distributors make any claims, promises or guarantees about the accuracy, completeness, or adequacy of the information contained therein or linked to from such content, nor do they take responsibility for any aspect of such content. The Newstex Authoritative Content shall be construed as author-based content and commentary. Accordingly, no warranties or other guarantees are offered as to the quality of the opinions, commentary or anything else appearing in such Newstex Authoritative Content. Newstex and its re-distributors expressly reserve the right to delete stories at its and their sole discretion.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Zacks Investment Research</p></div>"}