{"date": "2022-01-18 12:54:09.051000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>India</p></div><div class=\"tr-npp-lead\"><p>India, Jan. 18 -- Are you planning to buy a wireless dongle stick or router for yourself? Well, then you must know that now is the one of the best times to buy it, as Amazon is offering massive discounts across all categories, including wireless routers.</p><p>Wireless dongle stick and routers help you to connect multiple Wi-Fi devices at the same time. You can make the best use of fast speed of these routers and enjoy streaming HD videos, playing music, transferring files and downloading documents. What is more is that these device come packed with powerful batteries with last for long duration. The best part is that these device are lightweight and portable. You can carry them with you when you are travelling to enjoy the high-speed internet at all times.So, make the best use of Amazon's Republic Day sale and invest in a dongle stick or Wi-Fi router today. To help you with the selection, we have rounded up a few options, on which there is discount available. Take a look and thank us later.1. Tukzer 4G LTE Wireless Dongle</p></div><div class=\"tr-npp-body\"><p>This wireless dongle stick is sleek and compact in design and lightweight too. It allows you to make HD video and voice calls, stream HD videos and download documents at a fast pace. It also has a powerful battery of 2100mAh which can last up to six hours.</p><p>Other features:</p><p>1) 150mbps download speed and up to 50mbps upload speed depending on the network strength</p><p>2) Can support up to 10 WLAN devices simultaneously</p><p>3) Integrated with Qualcomm MSM8916 chipset and supports all SIM</p><p>2. Coconut WR01 4G Wireless Router</p><p>You can connect up to eight devices with this wireless router and enjoy streaming HD videos and other things at a fast rate. It comes packed with a 2100mAh battery which promises up to five to six hours of battery life and a standby time of three hours. This 4G data card all SIM support helps you unlock 4G speed on 2G/3G devices too. It also features three LED indicators which show battery status, Wi-Fi and 4G signal.</p><p>Other features:</p><p>1) Download speed up to 150mpbs and upload speed up to 50mbps</p><p>2) Operating System is RouterOS</p><p>3) Frequency Band Class is single-band</p><p>3. Tenda 4G180 3G/4G LTE Advanced 150Mbps Pocket Mobile Wi-Fi Hotspot Device</p><p>This Wi-Fi hotspot device looks sturdy and is lightweight. It can carried to anyplace and anytime. It supports different types of Wi-Fi devices such as computer, laptop, tablet, notebook and smartphone. It is a plug-and-play device and supports micro SD memory card with up to 32GB of optional storage. It can connect up to 10 Wi-Fi gadgets simultaneously.</p><p>Other features:</p><p>1) 2100mAh rechargeable battery for up to 10 hours working time and a week in standby</p><p>2) 150 mbps download speed</p><p>3) Frequency Band Class is single-band</p><p>4. Huawei E5576-606 MOBIFI</p><p>It is available in a stunning white colour and has a sleek design. It has a lithium battery of 1500mAh with a battery life of up to six hours. It is lightweight and portable, as it weighs only 77g.Other features:1) Packet data service up to 150mbps2) Built In LTE/WCDMA and Wi-Fi antenna3) Compatible with Windows 7, 8, 8.1, 10, 10.11, 10.12 with latest upgrades4) Wifi/Lan 2.4 GHz5) RAM 128MB DDR, ROM 128MB NAND FlashAt Hindustan Times, we help you stay up-to-date with latest trends and products. Hindustan Times has affiliate partnership, so we may get a part of the revenue when you make a purchase. Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}