{"date": "2021-02-03 02:43:08.932000+00:00", "ticker": "AAF", "mrkt_info": {"open": 82.3, "close": 83.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Bharti Airtel is set to announce its December quarter results of FY21 (Q3FY21) on Wednesday amid expectations of strong earnings in which the telecom operator may return to profit while revenues may grow in mid-teens on a year-on-year (YoY) basis, mainly on account of strong subscriber addition momentum. During the quarter under review, Airtel recorded 6.3 per cent YoY growth in subscribers to 30.1 crore, with data subscribers rising 24.6 per cent YoY to 17.3 crore.</p><p>Airtel had reported net sales of Rs 21,947.1 crore and a loss of Rs 1,112.3 crore in the year-ago quarter. In Q2FY21, it had reported a loss of Rs 713.9 crore.</p></div><div class=\"tr-npp-body\"><p>\"There are four key things to watch out for in Bharti Airtel's results: management commentary on the timing of tariff hikes, outlook on spectrum investments including renewals, network rollouts and capex outlay to cater to higher traffic on network, and comments on review petition filed against AGR ruling,\" global brokerage Jefferies said in a result preview note.</p><p>Last week, Airtel Africa reported a 13 per cent YoY growth in net profit at $116 million for the quarter ended December 31, 2020 (driven mainly by growth in ARPU) while revenue was up 17 per cent YoY to $1,034 million.</p><p>At the bourses, Bharti Airtel zoomed 17.89 per cent in the quarter under review. In comparison, the Nifty50 index rallied 24 per cent in the same period, ACE Equity data show.</p><p>Here's what leading brokerages expect from Airtel's Q3FY21 numbers:</p><p>Jefferies</p><p>According to analysts at Jefferies, Bharti Airtel's India mobile revenues for Q3FY21 may grow 5 per cent sequentially to Rs 14,500 crore, on the back of better 4G adds, with slight margin expansion (up 90 bps QoQ to 43.5 per cent) due to operating leverage. Further, they expect Airtel's average revenue per user (ARPU) to be up 1.5 per cent QoQ to Rs 165 on the back of continued data subscriber additions.</p><p>In a result preview note, Jefferies said that Airtel's non-mobile segments should see stable growth; however, de-consolidation of Indus Towers for part quarter will lead to a 1 per cent sequential decline in revenues from Indian operations.</p><p>Overall, it expects Airtel's consolidated revenues to decline marginally (down 0.4 per cent sequentially) to Rs 25,700 crore. On a YoY basis, however, the same would grow 17 per cent. Consolidated Ebitda margins are expected to be flat sequentially at 45.5 per cent while Ebitda may rise 26 per cent YoY to Rs 11,700 crore.</p><p>Emkay</p><p>The brokerage pegs Bharti Airtel's consolidated net sales for the quarter under review at Rs 25,244 crore, up 15 per cent YoY while the telecom operator is seen reporting a profit of Rs 81.3 crore. \"Bharti Airtel is set to continue its outperformance with a healthy 7 per cent sequential wireless revenue growth to Rs 14,767 crore on strong subscriber addition momentum and sustained improvement in subscriber mix with 10 million data subscriber adds. ARPU shall rise 3 per cent QoQ and 23.7 per cent YoY to Rs 167,\" it said.</p><p>Bharti\u0092s reported consolidated Ebitda should decline 2.3 per cent QoQ to Rs 11,379.2 crore, mainly due to the deconsolidation of Infratel, with it being reported as an associate from this quarter. Operating leverage shall restrict any meaningful contraction in the margins, which is seen at 45.1 per cent for Q3FY21, the brokerage said.</p><p>Bharti\u0092s home broadband segment ARPU is expected to be under pressure and slip 7 per cent sequentially, with the full impact of lower-priced plans (launched in September) being witnessed in the quarter. For the enterprise segment, seasonality could lead to muted revenues. Data volume shall continue on its positive trajectory with 6 per cent QoQ increase, the brokerage said.</p><p>Kotak Institutional Equities</p><p>The brokerage believes that Airtel may report a profit of Rs 281.4 crore for Q3FY21 while revenue may grow 16.6 per cent YoY to Rs 25,597.7 crore. Ebitda is seen growing 22.6 per cent YoY to Rs 11,362.4 crore and Ebitda margin at 44.4 per cent, up 216 bps YoY and down 77 bps sequentially.</p><p>It expects 6.3 per cent QoQ increase ( up 31.6 per cent YoY) in India wireless revenues and Ebitda growth of 10.5 per cent QoQ (up 62.4 per cent YoY).</p><p>\"Bharti is likely to have benefitted from sustained gain in subscriber market share and higher 4G adoption underpinned by recovery in smartphone sales. We build in a 1.7 per cent QoQ and 24.2 per cent YoY increase in implied ARPU to Rs164 per month,\" the brokerage said.</p><p>Among the other business segments, we assume 0.5 per cent QoQ growth in revenues for both the home broadband and enterprise segments and 1.5 per cent QoQ growth in the DTH business, it said.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}