{"date": "2022-02-06 23:17:04.523000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p> <br/>    By Kuala Lumpur Newsroom<br/>NewsRise<br/>   KUALA LUMPUR (Feb 7) -- Significant international events and markets news:<br/><br/>KEY EVENTS:<br/>G7 Data for Monday, Feb. 7:<br/>*07:00 GMT: UK January Halifax House Prices<br/>*07:00 GMT: Germany December Industrial Output<br/><br/>US MARKETS:<br/>The major indexes ended mixed Friday as Amazon surged after its earnings boosting the Nasdaq Composite and the S&amp;P 500. The Nasdaq ended 1.6% higher at 14,098.01 points. The index held on to its gains even though Treasury yields rose above the 1.9% mark after a surprisingly robust jobs report. The S&amp;P 500 gained 0.5% to 4,500.53 points while the Dow Jones Industrial Average fell 0.1% to 35,089.74. For the week, the Nasdaq rose 2.4%, the S&amp;P 500 gained 1.6% and the Dow added 1.1%. Dow futures were last up 0.07%, or 26.00 points, while S&amp;P 500 futures were up 0.05%, or 2.25 points. Amazon’s 13.5% climb made the consumer discretionary sector the best performer of the session - the subindex rose 3.7%. Among other high-growth stocks, Snap rocketed 58.8% and Pinterest rose 11.2% after reporting results the previous day. Beleaguered fitness company Peloton surged more than 25% in extended trading on reports that Amazon and Nike were interested in a takeover. Elsewhere, financials benefitted from higher bond yields. Goldman Sachs rose 2.4% and JPMorgan added 2.6%. Expectations that the Federal Reserve will move aggressively to raise rates strengthened after the Labor Department's nonfarm payrolls report showed an increase of 467,000 jobs last month, much higher than expected. Economic data of note this week includes the consumer price index, due Thursday. Earnings remain in full swing with Coca-Cola, Pepsi, Disney and Pfizer due to report. The dollar index rose to 95.48 from 95.38. The yield on the 10-year Treasury note rose eight basis points to 1.91%.<br/><br/>ASIA MARKETS:<br/>The major markets are cautious ahead of Monday’s open after a volatile week on Wall Street. Nikkei 225 futures were last down 0.4% while Hang Seng futures were up 0.2%. The Nikkei average rose 0.7% to 27,439.99 points Friday. Video games maker Konami Holdings surged 11.7% after its earnings. Kawasaki Kisen Kaisha climbed 9.7%. Nippon Sheet Glass declined 8%. Kao Corp fell 6.4%. The Hang Seng index rose 3.2% to 24,573.29 as the market reopened after a three-day Lunar New Year holiday. Haidilao International and Techtronic Industries gained more than 8% each. WH Group fell 1% while ENN Energy lost 0.3%. The Chinese markets remained shut for the Lunar New Year break.<br/><br/>CRUDE OIL:<br/>Oil prices hit multi-year highs on Friday as winter storms across large parts of the U.S. heightened concerns about supply. West Texas Intermediate crude rose 2.3% to settle at $92.31 per barrel. Brent crude gained 2.4% to $93.27. Spot gold was last at $1,808.28 an ounce.<br/><br/>TOP NEWS:<br/>*Russian attack on Ukraine possible 'any day' but diplomacy still an option, White House says - Reuters<br/>*U.S. Readies New Asia-Pacific Economic Strategy to Counter China - Wall Street Journal<br/>*China May Need to Rebuild Its Oil Stockpiles, Says Vitol - Bloomberg<br/>*Japan rail group Seibu to sell hotels, assets to Singapore's GIC - Nikkei Asia<br/>*Apple Aims to Debut a New Low-Cost 5G iPhone and iPad in Early March - Bloomberg<br/><br/>  <br/>  - By Kuala Lumpur Newsroom; kleditorial@newsrise.org<br/>- Edited by Sumathi Vaidyanathan<br/>- Send Feedback to feedback@NewsRise.org<br/>- Copyright (c) 2022 NewsRise Financial Research &amp; Information Services Pvt. Ltd.<br/>    </p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright NWRISE Malaysia NEWS 2022</p></div>"}