{"date": "2022-01-18 07:33:44.359000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>India</p></div><div class=\"tr-npp-lead\"><p>India, Jan. 18 -- In a few days' time, India will celebrate its 73rd Republic Day. It is the time to remember the early days of an independent nation and what went into the making of a new republic.</p><p>Having said so, it is also the time for sales and discounts in Indian markets. From electronics, home appliances, clothing, personal care items to toys and games, an entire gamut of products come under the discounts umbrella. It is indeed a nice time to invest in something new.</p></div><div class=\"tr-npp-body\"><p>While few may scoff over the quality of products that are sold under heavy discounts, the truth is if one is judicious, then one can get great products at really cheap prices. Online platforms are a great place to begin one's search and then pick them up.</p><p>If we have convinced you to try them out, then Amazon is a good platform to explore. We have curated a list of products that you may find interesting. Take a look at winterwear products that are on sale.</p><p>1) Qube By Fort Collins Men's Jacket</p><p>This foam jacket is available on Amazon in five different colour combinations including maroon, grey, mustard, rust and olive. It is available in sizes from medium to double XL. The discounted price range varies from Rs.749.00 - Rs.839.00. For this discussion, we have taken the former in maroon. This stylish and trendy jacket can be a casual ski wear as well as an party wear. It is a lightweight jacket and is a regular fit one and can be hand washed.</p><p>2) Qube By Fort Collins Women's Cape Jacket</p><p>This cape jacket is an all-purpose winterwear for women. It is available in three colour solid colours namely black, navy and mustard and the sizes range from medium to double XL. The price range is Rs.659.00 - Rs.1,099.00, but for this discussion, we have the former in black. This long-sleeved hooded jacket is made from 100% nylon and can be hand washed.</p><p>3) Allen Solly Men's Jacket</p><p>This jacket for men is available in two colours - navy and maroon. Its sizes start from brand size 32 and go up to 48. This long sleeve regular fit jacket has been made from 100% polyester fabric. The price ranges from Rs.1,399.00 - Rs.2,799.00. For this discussion, we have considered maroon jacket in the former price.</p><p>4) Qube By Fort Collins Women's Jacket</p><p>This regular fit jacket is available in two colours - cream and deep navy. It is made from breathable fabric and can be machine washed. It is available from size medium and goes up to double XL. Its price ranges from Rs.629.00 - Rs.1,154.00. For this discussion, we have considered the cream jacket in the former price.</p><p>At Hindustan Times, we help you stay up-to-date with latest trends and products. Hindustan Times has affiliate partnership, so we may get a part of the revenue when you make a purchase. Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}