{"date": "2021-11-03 01:08:13.340000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>What?s New: AWS today announced the general availability of Amazon EC2 DL1 instances, a new instance type designed for training deep learning models. Now AWS? machine learning customers can leverage these new instances, which are powered by Habana?s Gaudi AI accelerators, to achieve up to 40% better price performance1 for AI workloads, supporting natural language processing and computer vision applications, including object detection and image classification. For more information on the numbers behind the up to 40% price performance advantage of Gaudi-based instances, see the Habana Blog published today: AWS Launches EC2 DL1 Instances.</p><p>?Habana?s Gaudi AI accelerators, which were designed from the ground-up for AI compute efficiency, achieve higher utilization of resources and deliver greater cost-effective integration than GPUs. This can result in big savings with lower hourly pricing for training machine learning models with these new Amazon EC2 DL1 instances.?</p></div><div class=\"tr-npp-body\"><p>?Eitan Medina, chief business officer at Habana Labs</p><p>Why It Matters: Machine learning has become mainstream as organizations are training more models and deploying them across their business to analyze large amounts of data to search and recognize patterns. To maintain and refine prediction accuracy and high quality of these models, data scientists want to tune and retrain their models frequently, which requires high-performance compute resources that can be prohibitive to organizations.</p><p>What is Unique: The Amazon EC2 DL1 instances powered by Habana?s Gaudi AI accelerators deliver higher compute efficiency at a lower cost than GPU-based instances. These new instances feature up to eight Gaudi accelerators with 256GB of high bandwidth memory, 768GB of system memory, second-generation Amazon custom Intel? Xeon? Scalable (\"Cascade Lake\") processors, 400 Gbps of networking throughput, and up to 4TB of local NVMe storage. Together, these features translate to up to 40% better price performance1 than the latest GPU-powered Amazon EC2 instances for training common machine learning models.</p><p>?Customers want to leverage the benefits that deep learning can deliver -- through improved business insights, better user experiences and optimized profitability,\" said Chetan Kapoor, senior manager, Product Management EC2 at Amazon Web Services (AWS). \"The technology has taken off and with it so has our customer need for greater compute efficiency. Habana?s Gaudi AI accelerators powering our new EC2 DL1 instances ensure the best price/performance for AI training in the cloud today.?</p><p>Where It is Available: The Amazon EC2 DL1 instances are initially available in two regions: U.S. East (Northern Virginia) and U.S. West (Oregon). EC2 DL1 instances support on-demand, reserved instance and spot purchasing options, or can be used as part of a savings plan.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}