{"date": "2021-11-18 23:41:44.547000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3549.0, "close": 3676.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SONOCO PRODUCTS CO (\"SON-N\")\n- Expands Focus on Sustainable Packaging, Adding Recyclable Molded]\n- Fiber Packaging for Frozen and Refrigerated Meals\n\n     Sonoco, one of the largest global diversified packaging companies, in\npartnership with Tellus Products, LLC, a company that produces USA grown\nand made, plant-based compostable packaging for foodservice products, today\nannounced the receipt of a prequalified label, Check Locally for\nrecyclability from How2Recycle for the Natrellis line of food packaging.\n\n     Natrellis, a dual-ovenable package made with upcycled sugarcane fiber\nand other U.S. grown plant fibers features a highly engineered surface that\ndelivers outstanding performance through the product's full lifecycle,\nproviding consumers a great product experience. This performance helps\nmaintain the package strength during all phases of use, preventing loss of\nfood moisture and eliminating wicking through the package to outside\nsurfaces. Sonoco also provides custom rigid lidding and flexible lidding\nfor these market solutions. The flexible lidding is customized for strong\nheat-seals around the perimeter of the fiber tray lip, preventing leakage\nprior to freezing and freezer burn while maintaining adhesion during\ncooking and easy to peel consumer use. The rigid lid is developed to\ninclude a click audible sound, ensuring the product is sealed tight for\ntransportation but easy for consumer use.\n\n     \"Sonoco has long been thought of as a leader in packaging for the\nFrozen and Chilled Prepared Meal markets. Our business venture with Tellus\ncombines decades of experience with packaging design, materials science and\nresponsible sugarcane farming and milling practices with both companies'\ndesire to provide sustainable packaging to consumers in a purposeful way,\"\nsaid Ernest Haynes, Vice President Rigid Paper Containers, North America.\n\"High-quality refrigerated and chilled foods continue to grow as a category\nwith consumer desires for more sustainable packaging. Using this novel\nNatrellis technology is a win-win for everyone.\"\n\n     Natrellis debuted in 2020 as the primary package used by PRIMAL\nKITCHEN(R) for its new line of frozen bowls and skillet meals, which are\ncurrently available at select retailers such as HyVee, Publix, Natural\nGrocers, Whole Foods Market and more. The new PRIMAL KITCHEN frozen line,\nwhich features meals made with grass-fed beef or cage-free chicken and a\nvariety of vegetables, is its first launch into the prepared meals space.\nThe PRIMAL KITCHEN brand focuses on delivering delicious condiments,\ndressings, marinades, avocado oils and pantry staples that incorporate\nfats, simple ingredients and uncompromising flavor.\n\n     \"PRIMAL KITCHEN products are unlike any others you'll find in the\ngrocery store,\" said Founder Mark Sisson. \"Developing and offering frozen\nmeals is a natural extension of our brand promise and a great solution for\nbusy families and health-minded individuals alike. We're proud to use the\nNatrellis bowl because it aligns perfectly with our mission and values.\"\n\n     About Sonoco\n\n     Founded in 1899, Sonoco (NYSE: SON) is a global provider of a variety\nof consumer packaging, industrial products, protective packaging, and\ndisplays and packaging supply chain services. With annualized net sales of\napproximately $5.2 billion, the Company has 19,000 employees working in\napproximately 300 operations in 34 countries, serving some of the world's\nbest-known brands in some 85 nations. Sonoco is committed to creating\nsustainable products, services and programs for our customers, employees\nand communities that support our corporate purpose of Better Packaging.\nBetter Life. The Company was listed as one of Fortune's World's Most\nAdmired Companies for 2021 as well as being included in Barron's 100 Most\nSustainable Companies for the third consecutive year. For more information,\nvisit www.sonoco.com.\n\n     About Tellus Products, LLC\n Tellus Products is an innovative packaging company that makes sustainable\ntableware and foodservice products from upcycled sugarcane fiber and other\nU.S.-grown plant fibers, including hardwood. The full line of Tellus'\nproducts are 100 percent grown and made in the USA, have no PFAS added. The\ncompany is located in Belle Glade, Florida, in the heart of one of\nAmerica's most abundant agricultural areas. Tellus Products is jointly\nowned by American Sugar Refining, Inc. (a part of ASR Group), Florida\nCrystals Corporation and Sugar Cane Growers Cooperative of Florida, a\ncooperative of 45 mostly family-owned farms that have been proud to\ncarefully cultivate sugarcane and vegetables in South Florida for\ngenerations.\n\n     About Mark Sisson &amp; PRIMAL KITCHEN(R)\n Mark Sisson, New York Times bestselling author, media personality,\nex-endurance athlete (5th place USA Marathon Championship, 4th place Hawaii\nIronman finish) founded the PRIMAL KITCHEN(R) brand in 2015. He has been\neducating the world on nutrition and the benefits of fat and protein for\nthe last decade via his blog, MarksDailyApple.com.\n\n     With the launch of the PRIMAL KITCHEN(R) brand, Mark Sisson delivers\non his mission to create uncompromisingly delicious condiments, sauces,\ncooking oils, collagen protein and pantry staples that are full of fats we\nlove and simple ingredients, and contain no dairy, gluten, grain, refined\nsugar or soy. PRIMAL KITCHEN is the maker of the #1 condiment in natural\ngrocery, the #1 salad dressing brand in natural grocery, and #1 product in\nsix key condiment categories in natural grocery: mayo, salad dressing, BBQ\nsauce, steak sauce, ketchup and avocado oil.* As Mark would say, Eat Like\nYour Life Depends on It, because it does. Learn more at primalkitchen.com.\n\n     About How2Recycle\n The How2Recycle(R) label is a U.S. and Canada-based standardized labeling\nsystem that clearly communicates recycling instructions to the public. Over\n400 brand owners and retailers are members of How2Recycle, and tens of\nthousands of products carry the How2Recycle label in the marketplace.\nHow2Recycle is a project of the Sustainable Packaging Coalition(R), a\nmembership-based group that brings together businesses, educational\ninstitutions, and government agencies to collectively broaden the\nunderstanding of packaging sustainability and develop meaningful\nimprovements for packaging solutions. For more information, follow us on\nTwitter @How2Recycle or go to our website at www.How2Recycle.info.\nCompanies interested in joining How2Recycle can visit\n<a href=\"http://www.how2recycle.info/join\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.how2recycle.info/join</a> for more information or contact\nhow2recycle@greenblue.org.\n\nTel   : 843-383-7000    SONOCO PRODUCTS CO\nFax   : 843-383-7008\nEmail : roger.schrum@sonoco.com\nWWW   : <a href=\"http://www.sonoco.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.sonoco.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132100802.MNPRE2132103830-15151320211118</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}