{"date": "2022-01-20 15:11:43+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\"><li class=\"tr-summaryitem\">India's Future is embroiled in legal dispute with Amazon</li><li class=\"tr-summaryitem\">Future Group missed payments in December to Indian lenders</li><li class=\"tr-summaryitem\">Future racing against time as grace period ends in Jan</li><li class=\"tr-summaryitem\">Indian firm considering court appeal for relief-sources</li></ul><p class=\"tr-by\">By Aditya Kalra and Nupur Anand</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW DELHI, Jan 20 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>India's Future Group plans to challenge its own lenders in the Supreme Court to avoid being named a defaulter for missing payments, citing its ongoing dispute with partner Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, three sources told Reuters on Thursday.</p><p>Future, the country's second-largest retailer, has since 2020 <a href=\"https://reut.rs/3nHvlsU\" data-type=\"url\" class=\"tr-link\" translate=\"no\">failed to complete</a> its $3.4 billion retail asset sale to a rival due to successful legal challenges by Amazon, which argues the Indian group violated certain non-compete contractual terms the two sides had. Future denies any wrongdoing.</p><p>Future told Indian exchanges this month it was unable to pay 35 billion rupees ($470 million) it owed to its lenders on Dec. 31 as it could not sell certain small stores due to the dispute with Amazon. It had hoped to use a 30-day grace period to resolve the situation.</p><p>Beyond that, banks are bound by Indian law to classify Future's accounts as a \"non-performing asset\", or an NPA, and declare it as a defaulter, further complicating the financial position of the debt-laden company.</p><p>The sources said Future was readying an approach to the Supreme Court within days to urge judges to stop its lenders from taking any drastic steps and extend timelines to allow it to sell its small stores and clear its dues.</p><p>Future's 1,700 outlets include roughly 900 small-sized stores, with the rest being large-format hypermarkets and fashion outlets.</p><p>Further, Future is also likely to ask judges to direct the country's central bank to extend the 30-day regulatory grace period and ask the lenders to not declare the Indian retailer as an NPA for the time being, one of the sources said.</p><p>The sources declined to be identified as the plans are not public. The lead bankers to Future, State Bank of India, Bank of Baroda and Bank of India, and India's central bank did not immediately respond to a request for comment.</p><p>Future also did not respond.         </p><p>Future's plans signal growing distress at the Indian retail group, which has said it fears liquidation and more than 27,000 job losses at its main retail arm, Future Retail, if its asset sale plan to rival Reliance Industries <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RELI.NS\" data-type=\"ric\" data-ric=\"RELI.NS\" translate=\"no\" dir=\"ltr\">RELI.NS</a> fails.</p><p>One banker who has exposure to Future said lenders will be forced to make financial provisions in their books in line with regulations if Future does not pay up by the end of January, unless there \"is a legal angle and a court gives an order to put a hold on it.\" </p><p>Amazon has long argued that Future violated the terms of a 2019 deal they had signed when the U.S. firm invested $200 million in a Future unit. The U.S. company's position has so far been backed by a Singapore arbitrator and Indian courts.</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Aditya Kalra in New Delhi, Editing by William Maclean)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:aditya.kalra@tr.com\" data-type=\"email\" translate=\"no\">aditya.kalra@tr.com</a> ; +91-11-49548021; Twitter <a href=\"https://twitter.com/adityakalra\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/adityakalra</a>; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-INDIA/FUTURE-RELIANCE (PIX)</p></div>"}