{"date": "2022-02-10 03:29:11.660000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3228.27, "close": 3180.07}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><pre>\n<span>IronNet’s largest international Amazon Web Services deployment will enable real-time collaboration between public and private properties\n\n\n</span><strong>MCLEAN, Va., Feb 10 (Bernama) -- </strong>IronNet, Inc. (NYSE: IRNT) (“IronNet”), an innovative leader Transforming Cybersecurity Through Collective Defense<strong>℠</strong>, today announced the execution of a multi-year contract with a Gulf Cooperation Council (GCC) country —which is remaining anonymous to help protect its operational security—to enable it to better defend its most important governmental, financial, and infrastructure enterprises, country-wide, against cyber attacks.\n\nThe GCC country will use IronNet’s leading AI-based <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.ironnet.com%2Fwhat-is-network-detection-and-response&amp;esheet=52576372&amp;newsitemid=20220209005395&amp;lan=en-US&amp;anchor=Network+Detection+and+Response+%28NDR%29&amp;index=1&amp;md5=80ac63e603dcabd33d92db0b2b2c3d17\"><strong>Network Detection and Response (NDR)</strong></a> solution, as well as the <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.ironnet.com%2Fwhat-is-collective-defense%3FhsLang%3Den&amp;esheet=52576372&amp;newsitemid=20220209005395&amp;lan=en-US&amp;anchor=IronNet+Collective+Defense&amp;index=2&amp;md5=031a14b0fcf93ee99cc6d194ff493da1\"><strong>IronNet Collective Defense</strong></a><strong>℠ </strong>platform, to facilitate real-time, collaborative cyber defense spanning key ministries and enterprises, as well as between public and private organizations in an effort to more quickly detect vulnerabilities across critical industry and government sectors.\n\nThe Amazon Web Services (AWS) backbone of the IronNet Collective Defense platform will enable the country to deploy the solution quickly across hundreds of enterprises and maintain a dynamic cyber radar view of threats on enterprise networks comprehensively and at network speed. Today’s agreement represents IronNet’s largest AWS cybersecurity deployment in this region to date.\n\n“We are proud to be recognized by this visionary GCC country for our Collective Defense platform, which enables anonymized, real-time collaboration and a more proactive approach to combating cyber adversaries,” said General (Ret.) Keith Alexander, Co-CEO and Founder of IronNet. “Enabling public-private partnerships is a critical part of helping this country strengthen their cybersecurity posture in the face of escalating cyber threats.”\n\nThe IronNet Collective Defense platform is the first automated cyber solution that delivers threat knowledge and intelligence across industries at machine speed. By leveraging advanced AI-driven NDR capabilities, it can detect and prioritize anomalous activity inside individual enterprise network environments. The platform analyzes threat detections across the community to identify broad attack patterns and provides anonymized intelligence back to all community members in real time, giving all members early insight into potential incoming attacks. This increased visibility of known and unknown cyber threats, combined with the ability to collaborate in real time, can help improve effectiveness of cyber defenders by allowing for faster triage and stronger response capabilities.\n\nGovernment entities and private organizations across the United States and around the world have already adopted IronNet’s Collective Defense platform to build dedicated communities to protect national, state, and local critical infrastructure. These communities enable cyber defenders to break down traditional silos, prioritize threat alerts, share intelligence, triage threats, and pool resources against attacks that frequently target sectors of critical infrastructure simultaneously.\n\n<strong>About IronNet, Inc.\n</strong>Founded in 2014 by GEN (Ret.) Keith Alexander, IronNet, Inc. (NYSE: IRNT) is a global cybersecurity leader that is transforming how organizations secure their networks by delivering the first-ever Collective Defense platform operating at scale. Employing a number of former NSA cybersecurity operators with offensive and defensive cyber experience, IronNet integrates deep tradecraft knowledge into its industry-leading products to solve the most challenging cyber problems facing the world today.\n\n<strong>Forward-Looking Statements\n</strong>This press release includes “forward-looking statements” within the meaning of the “safe harbor” provisions of the United States Private Securities Litigation Reform Act of 1995, including, without limitation, statements regarding IronNet’s ability to strengthen the security profiles of its customers and partners. When used in this press release, the words “estimates,” “projected,” “expects,” “anticipates,” “forecasts,” “plans,” “intends,” “believes,” “seeks,” “may,” “will,” “should,” “future,” “propose” and variations of these words or similar expressions (or the negative versions of such words or expressions) are intended to identify forward-looking statements. These forward-looking statements are not guarantees of future performance, conditions or results, and involve a number of known and unknown risks, uncertainties, assumptions and other important factors, many of which are outside IronNet’s management’s control, that could cause actual results or outcomes to differ materially from those discussed in the forward-looking statements. Important factors, among others, that may affect actual results or outcomes include: IronNet’s inability to recognize the anticipated benefits of collaborations with IronNet’s partners and customers; IronNet’s ability to execute on its plans to develop and market new products and the timing of these development programs; the rate and degree of market acceptance of IronNet’s products; the success of other competing technologies that may become available; IronNet’s ability to identify and integrate acquisitions; the performance of IronNet’s products; potential litigation involving IronNet; and general economic and market conditions impacting demand for IronNet’s products. The foregoing list of factors is not exhaustive. You should carefully consider the foregoing factors and the other risks and uncertainties described under the heading “Risk Factors” in IronNet’s registration statement declared effective by the Securities and Exchange Commission (the “SEC”) on September 30, 2021 and other documents that IronNet has filed or will file with the SEC. These filings identify and address other important risks and uncertainties that could cause actual events and results to differ materially from those contained in the forward-looking statements. Forward-looking statements speak only as of the date they are made. Readers are cautioned not to put undue reliance on forward-looking statements, and IronNet does not undertake any obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\n\n\n<strong>Contact\n\n</strong><strong>IronNet:\n</strong>IronNet Investors: Nancy Fazioli: <a href=\"mailto:IR@ironnet.com\" data-type=\"email\" translate=\"no\">IR@ironnet.com</a>Media: Cassie Scher, Rational 360: <a href=\"mailto:Media@ironnetcybersecurity.com\" data-type=\"email\" translate=\"no\">Media@ironnetcybersecurity.com</a><strong>Source : IronNet, Inc.\n\n--BERNAMA</strong></pre><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: IRONNET-CONTRACT</p></div>"}