{"date": "2021-11-17 23:26:55.675000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Known for being durable, adorable and affordable, Melissa &amp; Doug toys have been a favorite among kids and parents alike for years. Run by married couple Melissa and Doug Bernstein, the company is a certified toy juggernaut, having produced over 5,000 different toys during its existence. With products mainly focused on creative and imaginative play, as well as mental and physical development, the company has created a line of toys that parents can feel good about giving to their kids. </p></div><div class=\"tr-npp-body\"><p>With the holiday season looming and the ominous feeling of \"what do I get my kid\" lurking, we've put together a list of the 10 most popular Melissa &amp; Doug toys of 2021. These are the toys that have thousands upon thousands of rave reviews and that your child will be glad to see under the tree come Christmas.</p><p><span><span>Tackle your holiday shopping</span> with deals and expert advice delivered straight to your phone. Sign up for text message alerts from the deal-hunting team at Reviewed.</span> </p><p class=\"tr-npp-section-title\">1. Slice and Bake Wooden Cookie Play Food Set</p><p>Melissa &amp; Doug really thrives in the play food and pretend cooking space. Take this slice and bake wooden cookie set, which has an average 4.9 stars from almost 12,000 reviews. It includes 12 sliceable cookies, 12 toppings, a wooden knife, spatula and cookie sheet, as well as an oven mitt. The cookies all pack away in a durable tube similar to store-bought cookie dough, and kids ages 3 and up can use the set to pretend to bake, decorate and serve cookies, all while learning counting and motor skills.</p><p><span>Get the Melissa &amp; Doug Slice And Bake Wooden Cookie set from Amazon for $14.70</span> </p><p class=\"tr-npp-section-title\">2. Scratch Art Rainbow Mini Notes</p><p>For kids who love to create, check out Melissa &amp; Doug's line of Scratch Art gear, including this set of rainbow mini notes. Each box contains 125 mini notes, as well as a wooden stylus for scratching messages into the matte coating. Kids can create art, pass notes or just doodle when they're stressed. Amazon buyers absolutely rave about these, with over 25,000 buyers giving them an average 4.7 stars. Many buyers are even calling them \"a great stocking stuffer.\"</p><p><span>Get the Scratch Art Rainbow Mini Notes from Amazon for $9.79</span> </p><p class=\"tr-npp-section-title\">3. Freestanding Wooden Fresh Mart Grocery Store</p><p>Kids love to play grocery store. They love the carts, the conveyor belts and the whole production of it. Melissa &amp; Doug's wooden grocery store play set takes that to a whole new level. Your child or children can play shopper or cashier in this kid-sized grocery store, with a hand cranked conveyor belt, a bagging area, a card swipe machine, a beeping scanner and even a cash drawer. You can buy the grocery store by itself, or opt to purchase sets that include both the store and some food or a mini grocery cart. You can even pick up a set of accessories, including reusable bags, coupons and a magazine rack, all of which are beyond adorable. </p><p><span>Get the Melissa &amp; Doug Freestanding Wooden Fresh Mart Grocery Store from Amazon starting at $248.49</span> </p><p class=\"tr-npp-section-title\">4. Let's Play House Dust! Sweep! Mop! Pretend Play Set</p><p>Another perennial Melissa &amp; Doug favorite, the dust, sweep and mop cleaning set is staple of toddler-raising households across the country. The compact organizing stand holds a broom, mop, duster, brush and dustpan, all of which are great for inspiring pretend play. You might not even have to fight with your kids to clean up anymore! The toys give kids a bit of independence and responsibility, as well as a pretend task to try and accomplish. The toys also help kids develop coordination and are designed to, as the company puts it, \"embolden your child's sense of purpose.\" Amazon buyers agree, giving the set an average 4.8 stars with over 28,000 ratings.</p><p><span>Get the Melissa &amp; Doug Let's Play House Dust! Sweep! Mop! Pretend Play Set from Amazon for $20.39</span> </p><p class=\"tr-npp-section-title\">5. Shape Sorting Cube</p><p>A shape sorting cube is a longtime childhood classic, and Melissa &amp; Doug's version doesn't deviate too far from the existing mold. The wooden cube is covered in different shaped holes, and the kit comes with 12 different bright-colored shapes that are easy for little hands to grip shapes. If your kid masters the cube and you're thinking about taking it to the next level, the company notes that its 100-piece wooden block set makes a nice companion piece to the toy as well. </p><p><span>Get the Melissa &amp; Doug Shape Sorting Cube from Amazon for $11.99</span> </p><p class=\"tr-npp-section-title\">6. 4-in-1 Wooden Jigsaw Puzzles</p><p>Melissa &amp; Doug has made its name in part because of its excellent wooden puzzles. They're sturdy and easy to manipulate, and kids just love them. This set four different puzzles, each made up of 12 pieces. Each puzzle is contained in its own compartment in a sturdy wooden box, and each set has a kid-friendly theme, including construction, princesses, dinosaurs, pets and vehicles. Puzzles can also help kids build confidence and problem solving skills.</p><p><span>Get the Melissa &amp; Doug 4-in-1 Wooden Jigsaw Puzzles from Amazon for $13.99</span> </p><p class=\"tr-npp-section-title\">7. Suspend Family Game</p><p>A blend of Jenga, barrel of monkeys and pick up sticks, Suspend is one of Melissa &amp; Doug's best-received entries into the game world. The game—which comes packed into a nice compact tube—asks players to balance wacky shaped rods on top of each other, all while making sure the teetering tower doesn't fall down. It's designed for up to four players, but a solo child could certainly play around with it by themselves as well. Perfect for screen-free time, this game is aimed at helping kids develop hand eye coordination, interpersonal skills and cognitive skills. It's received more than 13,000 reviews.</p><p><span>Get the Melissa &amp; Doug Suspend Family Game from Amazon for $15.29</span> </p><p class=\"tr-npp-section-title\">8. Wooden Abacus</p><p>This abacus is loved by Amazon buyers, over 12,000 of which have helped it earn its 4.8-star rating. With 100 brightly colored beads, the abacus is aimed at helping kids learn to count and do simple math, even coming with \"extension activities\" for parents and kids to try together. Amazon buyers say they love to watch their kids grow with the abacus, going from toddlers who just love to slide the beads back and forth to becoming elementary school students who pull it out to help solve difficult math problems.</p><p><span>Get the Melissa &amp; Doug Wooden Abacus from Amazon for $11.62</span> </p><p class=\"tr-npp-section-title\">9. Deluxe Pounding Bench</p><p>Every little bruiser's dream, this pounding bench is a great way for little ones to work out hand eye coordination, fine motor skills and cause and effect. It's also super cute, as each of the non-removable pegs is fitted with a charming little face that seems to be playing peekaboo during playtime. Amazon buyers call it a \"well-made\" great toy that their kids love.</p><p><span>Get the Melissa &amp; Doug Deluxe Pounding Bench from Amazon for $16.39</span> </p><p class=\"tr-npp-section-title\">10. Scissor Skills Activity Book</p><p>Another great stocking stuffer, Melissa &amp; Doug's Scissor Skills activity book is a great way to make learning fun. The 20 pre-printed activity pages ask kids to weave their scissors through mazes, puzzles and animal art, all while learning the fine art of actually using those scissors safely. Another great screen-free toy, the scissor skills book is aimed at kids 4 and up. Amazon buyers note that the included scissors don't actually have a blade, making them perfectly safe for any novice user. </p><p><span>Get the Melissa &amp; Doug Scissor Skills Activity Book from Amazon for $6.49</span> </p><p><span><span>Don't get thwarted by shipping delays or sold-out favorites this holiday season.</span>  Sign up for our free weekly newsletter and get the product reviews, deals and holiday gift guides you need to start shopping now.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: 10 of the best Melissa &amp; Doug toys for kids this year</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}