{"date": "2022-01-04 18:00:06.330000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-abstract\"><p>The Delhi High Court on Tuesday dismissed Future Group\u0092s petitions seeking a direction to the Singapore International Arbitration Centre (SIAC) \u0097 adjudicating Amazon's objections against Future's deal with Reliance \u0097 to decide on its application for terminating the arbitration proceedings.</p></div><div class=\"tr-npp-lead\"><p>\u0093The arbitral tribunal is not bound by the procedure of the Code of Civil Procedure, 1908, or the Indian Evidence Act, 1872. This flexibility would also vest the discretion in the arbitral tribunal to decide the manner in which the proceedings are to be conducted, including the order in which the applications filed by the parties are to be considered,\u0094 the high court stated in its order. \u0093For this court to interfere in the aforesaid issues would be violative of the autonomy vested in the arbitral tribunal,\u0094 it added.</p><p>According to legal sources, in dismissing Future\u0092s petitions so promptly, the high court has given paramount importance to the arbitration process and faster remedy. It also indicates that Amazon's case for seeking remedy for the default of contractual obligations is genuine, they said.</p></div><div class=\"tr-npp-body\"><p>Future Group is likely to approach a higher forum to seek remedy, sources said. An email sent to Amazon did not elicit any response.</p><p>Ashish Kumar Singh, managing partner at Capstone Legal, told Business Standard that the high court had clearly stated that procedural matters related to the working of an arbitral tribunal were not amenable to the jurisdiction of the court in India.</p><p>\u0093The window to interfere with an arbitration proceeding is very limited and the court cannot dictate the proceedings to an independently constituted tribunal,\u0094 Singh said. In December 2021, the Competition Commission of India suspended Amazon\u0092s 2019 deal with Future Cou­pons for its alleged deliberate design to suppress information about the scope and purpose of the deal.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Business Standard Ltd.</p></div>"}