{"date": "2021-09-07 23:11:49.832000+00:00", "ticker": "III", "mrkt_info": {"open": 1339.0, "close": 1306.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENBRIDGE INC (\"ENB-TN\")\n- Advances U.S. Gulf Coast Strategy with Acquisition of North\n- America's Premier Crude Export Facility\n\n     Enbridge Inc. (Enbridge or the Company) announced that it has entered\ninto a definitive purchase agreement with EnCap Flatrock Midstream to\nacquire Moda Midstream Operating, LLC (Moda) for U.S. $3.0 billion in cash,\nsubject to closing adjustments. The acquisition will significantly advance\nthe Company's U.S. Gulf Coast export strategy and connectivity to low-cost\nand long-lived reserves in the Permian and Eagle Ford basins. The Company\nvalues the transaction at approximately 8x projected forward EBITDA, and\nupon closing is expected to be immediately accretive to Enbridge's\nfinancial outlook.\n\n     \"We're very excited about acquiring North America's premium, very\nlarge crude carrier (VLCC) capable, crude export terminal,\" commented Al\nMonaco, President and Chief Executive Officer of Enbridge. \"Over the last\nseveral years we've been building a strong position in the U.S. Gulf Coast\nthrough both natural gas and crude infrastructure. Our strategy is driven\nby the important role that low cost, sustainable North America energy\nsupply will play in meeting growing global demand. With close proximity to\nworld-class Permian reserves, and with cost effective and efficient export\ninfrastructure, our new Enbridge Ingleside terminal will be critical to\ncapitalizing on North America's energy advantage.\n\n     \"This blue-chip platform aligns very well with our long-standing\nshareholder value proposition; strong commercial underpinnings that\ngenerate highly transparent and low risk cash flows, establishing a new\nplatform for low capital intensity growth, and an attractive financial\nreturn, all while retaining a strong balance sheet and financing\nflexibility.\n\n     \"This investment is also a prime example of how we're focused on being\na differentiated service provider to our customers by lowering emissions\nacross our systems. In line with that objective, we expect to develop solar\npower capacity at the terminal site, which will ensure it's the most\nsustainable export facility in North America and support our company-wide\ngoal of net zero by 2050,\" said Monaco.\n\n     Central to the transaction, Enbridge will acquire a 100 percent\noperating interest in the Ingleside Energy Center (to be renamed the\nEnbridge Ingleside Energy Center (EIEC)), located near Corpus Christi,\nTexas - North America's largest crude export terminal, which loaded 25\npercent of all U.S. Gulf Coast crude exports in 2020. This state-of-the-art\nterminal, built in 2018, comprises 15.6 million barrels of storage and 1.5\nmillion barrels per day of export capacity.\n\n     EIEC's highly advantaged outer harbor location, with direct connection\nto low-cost, long-lived supply, combined with VLCC capability and rapid\nloading rates, position it as one of the most competitive export facilities\nglobally. EIEC is underpinned by 925 thousand barrels per day of long term\ntake-or-pay vessel loading contracts and 15.3 million barrels of long-term\nstorage contracts providing visibility to future cash flows. Its direct\nconnection to globally competitive Permian and Eagle Ford basins will\nassure the sustainability of cash flows for many years to come.\n\n     Enbridge will also acquire a 20 percent interest in the\n670-thousand-barrel per day Cactus II Pipeline, a 100 percent operating\ninterest in the 300-thousand-barrel per day Viola pipeline, and a 100\npercent operating interest in the 350-thousand-barrel Taft Terminal.\nTogether with EIEC, these pipeline and storage assets provide a fully\nintegrated light crude export platform.\n\n     The acquired assets are expected to be immediately and strongly\naccretive to distributable cash flow per share and earnings per share. In\naddition, ongoing EBITDA generation supports the Company's dividend growth\noutlook and growing base of free cash flow, further strengthening its\nsector leading financial flexibility and preserving its $5-6 billion of\nannual self-funded investable financing capacity beginning in 2022. The\ntransaction will be initially funded with existing liquidity and the\nCompany anticipates that 2022 Debt to EBITDA will be at the lower end of\nits target range.\n\n     This investment also provides Enbridge with further organic growth\npotential supporting the Company's post-2023 growth outlook. EIEC permitted\nexpansions of existing storage capacity to 21 million barrels and export\ncapacity to 1.9 million barrels per day, provide opportunity to capitalize\non increasing volumes and visibility to near-term low capital intensity\ngrowth. In addition, Enbridge will hold a 50 percent interest in a\nbrownfield St. James deep-water crude and refined products terminal\ndevelopment opportunity, which provides longer term growth potential.\n\n     EIEC has been recently constructed to industry-leading environmental\nstandards designed to minimize its carbon emissions footprint. Enbridge\nexpects to further lower facility emissions through the application of up\nto 60 MW of solar power capabilities, leveraging over 500 acres of\navailable land included within the terminal. This renewable investment is\nexpected to well exceed EIEC's power requirements, allowing excess\ngeneration capacity to be contracted to local industrial and refining\nfacilities while driving a robust return. Longer term, there is the\npotential to develop additional low carbon energy infrastructure within the\nfacility, including renewable fuels and carbon capture terminaling.\n\n     The transaction is expected to close in the fourth quarter of 2021,\nsubject to customary regulatory approvals and closing conditions. Moda's\nIngleside Management and key Moda marine terminal personnel will remain in\nplace following closing of the transaction, ensuring continuity of\noperations and ongoing development activities.\n\n     A complete description of the transaction, along with additional\ndetails on the acquired assets is available on the Investor Relations\nsection of the Enbridge Inc. website.\n\n     Barclays acted as financial advisor to Enbridge and Sidley acted as\nits legal counsel.\n\n     Forward-Looking Information\n\n     Forward-looking information, or forward-looking statements, have been\nincluded in this news release to provide information about us and our\nsubsidiaries and affiliates, including management's assessment of our and\nour subsidiaries' future plans and operations. This information may not be\nappropriate for other purposes. Forward-looking statements are typically\nidentified by words such as \"anticipate\", \"believe\", \"estimate\", \"expect\",\n\"forecast\", \"intend\", \"likely\", \"plan\", \"project\", \"target\" and similar\nwords suggesting future outcomes or statements regarding an outlook.\nForward-looking information or statements included or incorporated by\nreference in this document include, but are not limited to, statements with\nrespect to the following: the acquisition of Moda Midstream Operating, LLC\n(the \"Transaction\"), including the expected closing and the timing thereof;\nexpected benefits of the Transaction; expected accretion of the Transaction\nto our financial outlook, including distributable cash flow per share and\nearnings per share; expected cash flows; our corporate vision and strategy;\nemissions reductions and targets; expected supply of, demand for and prices\nof crude oil, natural gas, natural gas liquids (NGL), liquified natural gas\n(LNG) and renewable energy; financial strength and flexibility;\nexpectations on sources of funding for the Transaction and sufficiency of\nfinancial resources; expected investment capacity; expected debt to EBITDA\nratios; expected organic growth potential; expected solar power capacity\nand low carbon energy infrastructure potential; and expected continuity of\nmanagement and operations.\n\n     Although we believe these forward-looking statements are reasonable\nbased on the information available on the date such statements are made and\nprocesses used to prepare the information, such statements are not\nguarantees of future performance and readers are cautioned against placing\nundue reliance on forward-looking statements. By their nature, these\nstatements involve a variety of assumptions, known and unknown risks and\nuncertainties and other factors, which may cause actual results, levels of\nactivity and achievements to differ materially from those expressed or\nimplied by such statements. Material assumptions include assumptions about\nthe following: the COVID-19 pandemic and the duration and impact thereof;\nthe expected supply of and demand for crude oil, natural gas, NGL and\nrenewable energy; prices of crude oil, natural gas, NGL and renewable\nenergy; anticipated utilization of assets; exchange rates; inflation;\ninterest rates; availability and price of labor and construction materials;\noperational reliability; customer and regulatory approvals; maintenance of\nsupport and regulatory approvals; the timing and closing of the\nTransaction; the realization of anticipated benefits of the Transaction and\nother transactions; governmental legislation; litigation; estimated future\ndividends and impact of our dividend policy on our future cash flows; our\ncredit ratings; capital project funding; hedging program; expected EBITDA;\nexpected earnings/(loss); expected future cash flows; and expected\ndistributable cash flow. Assumptions regarding the expected supply of and\ndemand for crude oil, natural gas, NGL and renewable energy, and the prices\nof these commodities, are material to and underlie all forward-looking\nstatements, as they may impact current and future levels of demand for our\nservices. Similarly, exchange rates, inflation and interest rates and the\nCOVID-19 pandemic impact the economies and business environments in which\nwe operate and may impact levels of demand for our services and cost of\ninputs, and are therefore inherent in all forward-looking statements. Due\nto the interdependencies and correlation of these macroeconomic factors,\nthe impact of any one assumption on a forward-looking statement cannot be\ndetermined with certainty, particularly with respect to expected EBITDA,\nexpected earnings/(loss), expected future cash flows, expected\ndistributable cash flow or estimated future dividends.\n\n     Our forward-looking statements are subject to risks and uncertainties\npertaining to the successful execution of our strategic priorities;\noperating performance; legislative and regulatory parameters; litigation;\nacquisitions, dispositions and other transactions, including the\nTransaction, and the realization of anticipated benefits therefrom; our\ndividend policy; project approval and support; renewals of rights-of-way;\nweather; economic and competitive conditions; public opinion; changes in\ntax laws and tax rates; exchange rates; interest rates; commodity prices;\npolitical decisions; the supply of and demand for commodities; and the\nCOVID-19 pandemic, including but not limited to those risks and\nuncertainties discussed in this news release and in the Company's other\nfilings with Canadian and United States securities regulators. The impact\nof any one risk, uncertainty or factor on a particular forward-looking\nstatement is not determinable with certainty as these are interdependent\nand our future course of action depends on management's assessment of all\ninformation available at the relevant time. Except to the extent required\nby applicable law, Enbridge assumes no obligation to publicly update or\nrevise any forward-looking statement made in this news release or\notherwise, whether as a result of new information, future events or\notherwise. All forward-looking statements, whether written or oral,\nattributable to us or persons acting on our behalf, are expressly qualified\nin their entirety by these cautionary statements.\n\n     About Enbridge Inc.\n\n     Enbridge Inc. is a leading North American energy infrastructure\ncompany. We safely and reliably deliver the energy people need and want to\nfuel quality of life. Our core businesses include Liquids Pipelines, which\ntransports approximately 25 percent of the crude oil produced in North\nAmerica; Gas Transmission and Midstream, which transports approximately 20\npercent of the natural gas consumed in the U.S.; Gas Distribution and\nStorage, which serves approximately 3.8 million retail customers in Ontario\nand Quebec; and Renewable Power Generation, which generates approximately\n1,766 MW of net renewable power in North America and Europe. The Company's\ncommon shares trade on the Toronto and New York stock exchanges under the\nsymbol ENB. For more information, visit www.enbridge.com.\n\n     None of the information contained in, or connected to, Enbridge's\nwebsite is incorporated in or otherwise forms part of this news release.\n\n     FOR FURTHER INFORMATION PLEASE CONTACT:\n\n     Media Michael Barnes Toll Free: (888) 992-0997 Email:\nmedia@enbridge.com\n\n     Investment Community Jonathan Morgan Toll Free: (800) 481-2804 Email:\ninvestor.relations@enbridge.com\n\n     View original\ncontent:https://www.prnewswire.com/news-releases/enbridge-advances-us-gulf-\ncoast-strategy-with-acquisition-of-north-americas-premier-crude-export-faci\nlity-301369900.html\n\nTel   : 403-231-3900    ENBRIDGE INC CUM REDEEMABLE PR SHARES SERIES L\nFax   : 403-231-5929\nEmail : CorporateSecretary@enbridge.com\nWWW   : <a href=\"https://www.enbridge.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.enbridge.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2124900284.MNPRE2124900773-04185620210907</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}