{"date": "2021-11-22 18:48:28.991000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>AAP Rolling News Bulletin for Nov 23 at 0600</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>US Bezos (NEW YORK CITY)</p>\n<p>Former President Barack Obama's foundation has received a $US100 million ($A138 million) donation from Amazon founder Jeff Bezos, which it says is the largest individual contribution it has ever received.</p>\n<p>Separately on Monday, NYU Langone Health, a medical centre affiliated with New York University, said it has received a $US166 million ($A230 million) gift from Bezos and his family.</p>\n<p>For its part, the Obama foundation said in a statement that the gift from Bezos is intended \"to help expand the scope of programming that reaches emerging leaders\" in the United States and around the world.</p>\n<p>The donation, it said, was also given in honour of John Lewis, the congressman and civil rights icon who died last year.</p>\n<p>As part of the gift, the foundation said Bezos has asked for the plaza at the Obama Presidential Center, under construction in Chicago's South Side, to be named after Lewis.</p>\n<p>US Cuomo (ALBANY)</p>\n<p>A legislative investigation has found \"overwhelming evidence\" that former New York governor Andrew Cuomo engaged in sexual harassment and ordered state workers to help produce his book during work hours.</p>\n<p>The report on Monday also found that Cuomo's executive chamber \"substantially revised\" a state report to exclude deaths of nursing home residents at hospitals to boost Cuomo's reputation.</p>\n<p>In March, the Assembly Judiciary Committee hired a Manhattan law firm, Davis Polk &amp; Wardwell, to investigate whether there were grounds to impeach Cuomo.</p>\n<p>Cuomo, a Democrat, resigned in August to avoid a likely impeachment trial in the wake of another investigation that found he sexually harassed at least 11 women. That investigation was led by two independent lawyers selected by state Attorney General Letitia James, also a Democrat.</p>\n<p>Seismometer (BRISBANE)</p>\n<p>It's not quite Journey to the Centre of the Earth or 20,000 Leagues Under the Sea.</p>\n<p>But scientists have embarked on a voyage that sounds like the inspiration for a Jules Verne novel as they look to unlock the secrets of the Earth's inner layers.</p>\n<p>An Australian National University-led team will scale underwater mountains steeper than the Himalayas to collect data from the Earth's most violent earthquakes in research that may help predict whether tsunamis will hit Australia and New Zealand.</p>\n<p>The team left New Zealand and arrived off Macquarie Island in the Southern Ocean on Saturday to retrieve 27 instruments - seismometers - from the ocean floor that have collected data from underwater earthquakes for the past month.</p>\n<p>But collecting them will be easier said than done, the team's chief scientist Professor Hrvoje Tkalcic says.</p>\n<p>Chapman (ADELAIDE)</p>\n<p>Former parliamentary speaker Josh Teague will be sworn in as South Australia's new attorney-general, taking the role from the embattled Vickie Chapman who is facing an ombudsman's inquiry.</p>\n<p>Mr Teague is scheduled to become the state's chief law officer in a ceremony at Government House on Tuesday after being selected for the role by Premier Steven Marshall.</p>\n<p>It comes after Ms Chapman stood aside from her cabinet positions and from her role as deputy premier on Monday amid ongoing conflict of interest claims and a no-confidence motion in parliament last week.</p>\n<p>The motion came after a parliamentary committee found she had, on at least three occasions, misled the house over a rejected Kangaroo Island development.</p>\n<p>Despite repeatedly maintaining she had done nothing wrong, Ms Chapman said she would stand aside to allow SA Ombudsman Wayne Lines to conduct an \"independent\" investigation into her rejection in August of the application to build a $40 million port on the island's north coast.</p>\n<p>Virus SA (ADELAIDE)</p>\n<p>South Australia has thrown its borders open to all states and territories for the first time in months, with thousands of travellers expected to arrive in the days and weeks ahead.</p>\n<p>From Tuesday, people from Victoria, NSW and the ACT are allowed to enter SA along with those from WA, Queensland, Tasmania and the Northern Territory, although some restrictions and requirements will remain in place.</p>\n<p>Everyone must be double vaccinated and use a new online border entry process known as EntryCheck SA, which assesses an individual's vaccination status, departure location and COVID-19 risk.</p>\n<p>Based on the information provided, travellers may also be prompted to use a new HealthCheck SA app which will help them monitor daily symptoms and guide them through any testing and quarantine requirements.</p>\n<p>AGED CARE (MELBOURNE)</p>\n<p>Older Australians are missing out on care as a result of aged care worker shortages made worse by COVID-19.</p>\n<p>The Australian Aged Care Collaboration, a group of six aged care peak bodies, says the workforce is reaching a crisis point and has called on the federal government to take action.</p>\n<p>Leading Age Services Australia CEO Sean Rooney said the current crisis has been worsened as a result of the COVID-19 pandemic, but the staffing shortages are nothing new.</p>\n<p>\"I think its acknowledging there is an urgent need for support of the workforce in aged care,\" Mr Rooney told AAP.</p>\n<p>\"Because at the moment, we need more staff, we want them better skilled and qualified and they need to be paid appropriately.</p>\n<p>Prostate (GOLD COAST)</p>\n<p>Ex-Formula One star Mark Webber believes lives will be saved in Queanbeyan due to the pilot program of an AI-driven prostate cancer diagnosis tool in his hometown.</p>\n<p>Webber has thrown his backing behind the diagnostic platform Maxwell Plus, which uses a combination of online risk analysis using factors such as medical history as well as pathology and clinical diagnosis to detect early signs of prostate cancer.</p>\n<p>Queanbeyan will be the first mass screening site in Australia for the program, with Webber hoping up to 13,000 eligible men will undertake the free-of-charge testing.</p>\n<p>\"Three thousand guys die a year in Australia, which is not a stat that we should be proud of, and every 25 minutes a guy's diagnosed with prostate in Australia,\" Webber told AAP.</p>\n<p>Die NSW (SYDNEY)</p>\n<p>Laws that would legalise voluntary assisted dying are just nine supporters short of passing in the NSW parliament, as debate on the issue resumes.</p>\n<p>NSW Treasurer Matt Kean and former deputy premier John Barilaro are among 38 MPs who have argued for a voluntary assisted dying bill during the debate.</p>\n<p>The bill requires 47 votes to clear the lower house.</p>\n<p>Mr Barilaro used his final speech in parliament to support the reform, saying it is a politician's job to improve the lives of their communities - particularly vulnerable people.</p>\n<p>\"The conditions of good death, and enabling every person to experience them anywhere in the state, and under any set of circumstances, is the foundation of a deeply compassionate and dignified modern society,\" he said.</p>\n<p>Speaker (CANBERRA)</p>\n<p>Queensland LNP MP Andrew Wallace is tipped to take up the role of Speaker of the House of Representatives after a vote on Tuesday.</p>\n<p>If successful, Mr Wallace will be the 31st Speaker since federation, replacing Tony Smith who is going to the government backbench after more than six years in the role.</p>\n<p>Mr Smith, considered one of the best Speakers of modern times, will retire from parliament at the election due by May.</p>\n<p>Former minister Kevin Andrews and Sydney-based MP Trent Zimmerman are also considered to be angling for the job.</p>\n<p>Mr Wallace, a former construction lawyer based on the Sunshine Coast, was first elected to parliament in 2016 in the seat of Fisher and was re-elected in 2019.</p>\n<p>Economy (CANBERRA)</p>\n<p>The high level of petrol prices continues to gnaw away at household budgets and has raised concerns among Australians about the inflation outlook.</p>\n<p>Billions of dollars are predicted to be spent during next weekend's so-called Black Friday-Cyber Monday sales where Australians can snap up bargains and shop early for Christmas.</p>\n<p>However, new confidence data will give an indication of how wide people are prepared to open their wallets.</p>\n<p>The weekly ANZ-Roy Morgan consumer confidence index is released on Tuesday, a pointer to future household spending.</p>\n<p>Confidence fell 2.8 per cent last week at a time when people are worried about the inflation outlook and what that might mean for interest rates.</p>\n<p>The consumer inflation expectations index also returned to the seven-year high seen in October of five per cent.</p>\n<p>In sport ...</p>\n<p>Soc EPL Man Utd (LONDON)</p>\n<p>In modern soccer, whatever the crisis, there is invariably another match coming up, to lighten - or deepen - the mood.</p>\n<p>So it is with Manchester United, who landed in Spain on Monday ahead of Tuesday's Champions League tie with Villarreal.</p>\n<p>Victory over the club who beat them in last season's Europa League final would put United into the knock-out stages, lifting the gloom at least temporarily. Lose and the skies darken further.</p>\n<p>Michael Carrick is in caretaker charge following Sunday's sacking of Ole Gunnar Solskjaer, but he admitted he doesn't know if it is for \"one game, two games, or a little stretch longer than that\".</p>\n<p>One contender to replace Solskjaer, Mauricio Pochettino, is said to be open to becoming United manager, and even prepared to quit his current club, Paris St Germain, mid-season to do so.</p>\n<p>BBL Thunder Hales (LONDON)</p>\n<p>Alex Hales has kept his Big Bash contract with Sydney Thunder after holding talks with the franchise over the emergence of photographs showing him posing in black body paint.</p>\n<p>Hales has apologised for \"reckless and foolish behaviour\" relating to pictures of him in 'Blackface' at a 2009 fancy dress party, insisting it was a misguided attempt to pay tribute to rap artist Tupac Shakur.</p>\n<p>Hales has denied an allegation by former Yorkshire player Azeem Rafiq that he named his pet dog dog \"Kevin\" as part of a racially derogatory joke involving other team-mates.</p>\n<p>The 32-year-old Hales was invited to discuss inclusivity at greater length by Cricket New South Wales chief executive Lee Germon ahead of his overseas stint with Thunder next month.</p>\n<p>Ends Bulletin</p>\n<p>Rolling News Desk inquiries : 02 9322 8611</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Australian Associated Press</p></div>"}