{"date": "2022-02-08 04:38:47.522000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">Titled Parallel Metaverses: How the US, China and the Rest of the World Are Shaping Different Virtual Worlds, the new book is the first in analyzing metaverse development globally with China and America at the core</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">HONG KONG, Feb. 8, 2022</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">HONG KONG</span>, <span class=\"xn-chron\">Feb. 8, 2022</span> /PRNewswire/ -- The new book, <span>Parallel Metaverses: How the US, <span class=\"xn-location\">China</span> and the Rest of the World Are Shaping Different Virtual Worlds, </span>written by renowned author and award-winning journalist <span class=\"xn-person\">Nina Xiang</span>, who is also the founder of Asian tech intelligence and data company China Money Network, has gone on pre-sale on Amazon.com. </p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1051\"><p><a href=\"https://mma.prnewswire.com/media/1742081/parallel_metaverses_nina_xiang_new_book.html\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"(PRNewsfoto/China Money Network)\" src=\"https://mma.prnewswire.com/media/1742081/parallel_metaverses_nina_xiang_new_book.jpg\" title=\"(PRNewsfoto/China Money Network)\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMTc0MjA4MS9wYXJhbGxlbF9tZXRhdmVyc2VzX25pbmFfeGlhbmdfbmV3X2Jvb2suanBn&amp;key=fff3dec8fcce8ec78deadd9989de847615190952f0f8afdc924dc1d75708283c6f8840fad9dc8cdfd3cf4cb1840482e0b2906e6210c4b99455c8ab654048e126\"/></div></div></a></p>\n</div><p>The book is the first such publication to examine how the U.S., <span class=\"xn-location\">China</span> and other global technology hotspots are building respective metaverses that will be largely independent and distinctive from each other.</p>\n<p>\"The metaverse is the next gigantic opportunity for investors, entrepreneurs, creators, and businesses to tap into the biggest revolution of digital technology that we have ever seen,\" says <span class=\"xn-person\">Nina Xiang</span>. \"This book fills the knowledge void for readers who wish to have a comprehensive understanding of how the metaverse will likely be shaped across different regions globally.\"  </p>\n<p>The materialization of the metaverse will take place amid persistent US-China geopolitical and technological rivalry. This means there may be greater divergence among the two countries' metaverse ecosystems related to major players, content creation, infrastructure outlays, applications, product formats, laws and regulations, and investment opportunities.</p>\n<p>Despite the differences, there will be some familiar trends. American companies are once more the front-runners exploring the cutting edge of the metaverse's possibilities. Chinese companies, meanwhile, are attentively looking westward for affirmative evidence that can be adopted for the massive Chinese market.</p>\n<p>It seems certain that in the metaverse revolution, the US and <span class=\"xn-location\">China</span> will again play to their respective strengths. But the geopolitical tensions will complicate the evolution of \"the next chapter of the Internet\", presenting companies with more complicated business decisions that go far beyond commercial considerations. </p>\n<p>\"It feels quite like déjà vu when you see how ByteDance, <span class=\"xn-money\">Tencent</span>, and Baidu launch their products or make investments taking cues from Meta (Facebook) and Microsoft,\" says <span class=\"xn-person\">Nina Xiang</span>. \"At the same time, <span class=\"xn-location\">China's</span> reliance on foreign core technology is again likely to define and constrain the country's metaverse build-up. Conversely, American companies are consciously reevaluating their supply chains by incorporating the '<span class=\"xn-location\">China</span> risk' factor.\"   <br/></p>\n<p>The book examines the entire metavese ecosystem to highlight the differences and shared characteristics of the development in the U.S. and <span class=\"xn-location\">China</span>. From major companies and their metaverse development strategies; metaverse infrastructure (chips, data centers, cloud services); man-machine interfaces (XR, AI); applications; and product matrixes, a comparative analysis of the two tech superpowers' next computing transformation will give readers unparalleled understanding of humanity's technology future.</p>\n<p>Other countries and regions including <span class=\"xn-location\">South Korea</span>, <span class=\"xn-location\">Japan</span>, <span class=\"xn-location\">Southeast Asia</span>, and <span class=\"xn-location\">Europe</span> will also be covered to contrast the two tech superpowers' blueprints. </p>\n<p>This book will provide readers a comprehensive and deep dive into how the metaverse will be generated and built around the world. Readers will therefore be better equipped to find the best development strategy or growth opportunities for their own businesses or organizations in the age of the metaverse.</p>\n<p>The book is currently on pre-sale in e-book format here: <a href=\"https://www.amazon.com/dp/B09RN764WF\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.amazon.com/dp/B09RN764WF</a></p>\n<p>The e-book will be released on <span class=\"xn-chron\">May 3, 2022</span> while a paperback format will be available at the same time.  </p>\n<p>About <span class=\"xn-person\">Nina Xiang</span></p>\n<p><span class=\"xn-person\">Nina Xiang</span> is a renowned author and award-winning journalist, and an expert on the Chinese venture capital and technology sector with nearly twenty years of financial and business media experience. She has held editorial positions at Bloomberg BusinessWeek, Euromoney Institutional Investor, China Radio International, and China Business Network in <span class=\"xn-location\">Beijing</span>, <span class=\"xn-location\">New York</span>, <span class=\"xn-location\">Shanghai</span>, and <span class=\"xn-location\">Hong Kong</span>.</p>\n<p>In 2011, she founded China Money Network, a platform tracking <span class=\"xn-location\">China's</span> smart investments and technology innovation. </p>\n<p><span class=\"xn-person\">Nina Xiang</span> is part of the team winning an <a href=\"https://www.sopasia.com/awards/2007-winners-a.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Excellence in Human Rights Reporting honor in SOPA Awards</a> in 2007. She was awarded a Foreign Press Association Annual Scholarship in 2007. </p>\n<p>She is an agenda contributor for the World Economic Forum and was named Female Entrepreneur of the Year at the ChinaBang Awards 2019. She appears frequently in a range of international media, including the BBC, CNN, Financial Times, Nikkei, and CGTN. </p>\n<p>Her previous books \"<span>Red AI: Victories and Warnings From China's Rise In Artificial Intelligence</span>\" and \"<span>US-China Tech War: What Chinese Tech History Reveals About Future Tech Rivalry</span>\" were both the number one new release in its category.</p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder0\">\n</div>\n<p>SOURCE  China Money Network</p>\n</div>\n<div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: China-Money-Network</p></div>"}