{"date": "2022-02-25 17:19:01.944000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3027.16, "close": 3071.26}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_a53ywyco&amp;referenceId=1_a53ywyco&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_a53ywyco&amp;referenceId=1_a53ywyco&amp;pageId=RefinitivNewscasts</a></pre>Source: Stocktube<br/><br/>Description: Think Research CEO Sachin Aggarwal joined Steve Darling from Proactive to share news the company is seeing great success partnership with the Ontario eServices Program and CognisantMD.&amp;#xD;&amp;#xD;Aggarwal telling Proactive the company processed more than 300,000 digital referrals through digital health software solutions. Most of those referrals in the past would have been done on a fax machine. The new process, according to the company, reducing wait times, reducing errors and improving patient care by allowing healthcare providers to send and receive referrals electronically in a more efficient time frame.<br/>Short Link: <a href=\"https://refini.tv/3BT5fsI\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3BT5fsI</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; Welcome back inside our Proactive newsroom and joining me now is Sachin Aggarwal. He's the CEO of Think Research. And Sachin welcome back good to see you again. &gt;&gt; Thank you. Good to see you too. &gt;&gt; So really you see news release out where you talk about having 300,000 referrals through your digital software solution. And we'll get to that in just a second. But I think it's important to take a look back at the way things would have been done without that solution. So how's it been done in the past? &gt;&gt; It's not just how it's done in the past actually, this is how it's being done in most places in the world still. It's by facts. So think about it. You go to your doctor, you need to be referred to a specialist, and what happens? Your doctor fills out a piece of paper, with a bit of information, they give it to their assistant and their assistant faxes it to the one doctor that they have a relationship with. To that one specialist. So what happens to you? Well, you end up with no information about what happened to that fax, you're stuck waiting for some response from the specialist, which may take days, but it may take weeks. And sometimes when the fax is lost, you never hear back. Also never had the opportunity to actually pick which doctor or pick maybe the wait time of that doctor. Maybe you're willing to travel on extra 15 minutes to go see a doctor that has no wait time at all. But you were never given that choice. And your medical information didn't move from your doctor to that specialist. It was just that piece of paper that was filled out. So it's extremely inefficient and it results in all kinds of medical errors and people falling through the cracks. And frankly it's expensive and it's not good for patients. &gt;&gt; So your digital solution corrects a lot of that. Is that right? &gt;&gt; It corrects everything I've just described. It's moving the patient's digitally. And what we're doing is we're building the highway for the movement of all patients across the health system. When you move from any doctor to any other doctor or any specialists to another specialist or into a hospital, that in the future will be digital. And today we have a contract with the province of Ontario. The biggest health region in the country. Fourteen million people. To make that whole process digital across the entire province. And that is a 10-year contract. So this is building infrastructure. This is literally like building highways or power lines across the province, specifically for healthcare and healthcare data and the movement of patients. &gt;&gt; So tell me about the 300,000 referrals that it's a good start, but the can you obviously increase on that as well? Is that the plan? &gt;&gt; Massively. Think about a province like Ontario. You've got millions of referrals that occur. And hitting 300,000 is a really big milestone because it's fast growth for us. But ultimately we want to get to 500,000, a million, two million, three million, and the government we expect will make this the mandatory method of moving patients from place to place. The government of Ontario has said, one of their top priorities is to arks the fax in healthcare and across the government. And frankly, you're out west, this is the priority of every government. To make the health system more efficient and more user-friendly, we've really got to get rid of the fax machine in healthcare. &gt;&gt; Is that going to be Sachin the biggest area of growth for Think Research is through governments and through the changing of what are these old systems into the new digital age? &gt;&gt; Not just governments but large enterprises. That's who our customers are. Whether it's governments like the government of Ontario, government of Newfoundland or British Columbia, or other places around the world like Iceland, in the US, it's large chains of private entities. Folks like Amazon PillPack or boots in the UK, that are digitizing their processes across their large enterprises. So we thrive and we do well on these really large long-term enterprise contracts. &gt;&gt; We'll leave it there. Congratulations on this. Look forward to hearing more about this as the members continue to roll in and roll out so to speak. Sachin thank you so much. Great to see you. &gt;&gt; Pleasure. Always good to be here. &gt;&gt; All right, there's Sachin Aggarwal, he's the CEO of Think Research.<br/></span></div></div></div></div>"}