{"date": "2021-12-01 16:00:40+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Diane Bartz and David Shepardson</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">WASHINGTON, Dec 1 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>The U.S. Senate Commerce Committee voted on Wednesday to advance law professor and privacy advocate Alvaro Bedoya's nomination to the U.S. Federal Trade Commission.</p><p>The committee deadlocked 14-14 on the nomination but under rules it can proceed to the full Senate for a vote.</p><p>The committee separately voted to approve a new term for Federal Communications Commission (FCC) chair Jessica Rosenworcel.</p><p>On Wednesday, the committee also will consider the nomination of Gigi Sohn, a former senior aide to then FCC chairman Tom Wheeler, to an open seat on the FCC, which is currently divided 2-2 between Republicans and Democrats.</p><p>    Bedoya, founding director of Georgetown Law's Center on Privacy &amp; Technology, is also a former chief counsel of the U.S. Senate Judiciary subcommittee on privacy, technology and the law. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2QF1HO\" data-type=\"storyId\" data-story-id=\"nL1N2QF1HO\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> His nomination now goes to the full Senate.</p><p>Bedoya, who has called privacy \"a civil right,\" has been skeptical of widespread, untargeted use of facial recognition technology and has argued that the software often makes mistakes, particularly when searching for the faces of African Americans, women and young people.</p><p>The agency enforces antitrust law and pursues allegations of deceptive advertising, including scams. It reviews deals having to do with pharmaceuticals, a key issue at a time when drug prices have been a political concern.</p><p>The FTC is currently made up of Chairwoman Lina Khan, a progressive Democrat, a second Democrat and two Republicans. The FTC cannot take any actions on a tie vote.</p><p>Bedoya was born in Peru but is a naturalized U.S. citizen.</p><p>The FTC under Trump sued Facebook, alleging it broke antitrust law, and under Biden the agency has pursued that lawsuit against the unit of Meta, as the company now calls itself. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2S8305\" data-type=\"storyId\" data-story-id=\"nL1N2S8305\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> It is also investigating Amazon.com, as well as assessing Amazon's $8.5 billion deal for Metro-Goldwyn-Mayer studios to determine if it is legal under antitrust law. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL3N2ND36G\" data-type=\"storyId\" data-story-id=\"nL3N2ND36G\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Diane Bartz and David Shepardson; Editing by David Gregorio)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Diane.Bartz@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Diane.Bartz@thomsonreuters.com</a> ; 1 202 898 8313; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-BIDEN/FTC</p></div>"}