{"date": "2021-11-23 19:48:17.211000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>E-commerce retailer Amazon is reportedly planning to reduce the use of plastic packaging in Germany by the end of the year.</p><p>As part of the initiative, the Seattle-based company will switch from single-use plastic packaging to paper bags, as well as ship larger items from its logistic centre in corrugated cardboard boxes.The company will, however, continue to use bubble wrap for delicate items such as glassware.Third-party products in single-use plastic bags, which may be relabelled for delivery, and items to be delivered in wet outdoor locations will stay packaged as received, announced the company.The commitment comes as Amazon has been facing criticism over its contribution to the increasing amount of plastic waste in Germany.Various environmental groups have accused the company, which is a leading player in the German online retail space, of contributing to the country's pollution with its heavy use of plastic packaging.Last December, a report published by Africa's fishing company Oceana group, revealed that in 2019 Amazon generated 465 million pounds of plastic packaging waste, including air pillows, bubble wrap and other plastic packaging items. However, Amazon rejected this report, referring to it as a 'miscalculation'.Last week, Amazon France announced a commitment to replace plastic pouches used for small items with paper bags or envelopes by the end of the year.Recently, Amazon also introduced a kerbside-recyclable insulation packaging solution made from recycled paper to make its grocery deliveries more sustainable.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}