{"date": "2021-11-17 19:48:29.041000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>AAP Rolling News Bulletin for Nov 18 at 0700</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>UK Amazon (LONDON)</p>\n<p>Amazon.com Inc will stop accepting Visa Inc credit cards issued in the United Kingdom from next year because of the high transaction fees charged by the payment processor, the e-commerce giant says.</p>\n<p>\"As a result of Visa's continued high cost of payments, we regret that Amazon.co.uk will no longer accept UK-issued Visa credit cards as of 19 January, 2022,\" an Amazon spokesperson said in an emailed statement.</p>\n<p>Amazon customers can still use Visa debit cards, Mastercard and Amex credit cards and Eurocard, the company said in a note to its customers.</p>\n<p>\"We are very disappointed that Amazon is threatening to restrict consumer choice in the future,\" a Visa spokesperson said in a statement.</p>\n<p>\"We continue to work toward a resolution so our cardholders can use their preferred Visa credit cards at Amazon UK without Amazon-imposed restrictions come January 2022.\"</p>\n<p>Virus Dutch (AMSTERDAM)</p>\n<p>Dutch health authorities say they are running short of COVID-19 tests as the Netherlands registered more than 20,000 new coronavirus cases for the second day in a row, the highest since the pandemic began.</p>\n<p>\"We are coming up against the maximum of our capacity,\" said Jaap Eikelboom, head of COVID-19 operations at the National Public Health Service.</p>\n<p>The service said it was working to expand test capacity amid a new surge that has caught health authorities and Prime Minister Mark Rutte's government off guard.</p>\n<p>About 85 per cent of the adult Dutch population is fully vaccinated.</p>\n<p>The National Institute for Health (RIVM) on Tuesday reported a record of more than 110,000 new cases in the week ended November 16, an increase of 44 per cent from the week before, with the strongest rise among children aged 4-12.</p>\n<p>Royals Meghan (LOS ANGELES)</p>\n<p>Meghan, the wife of Prince Harry, is appearing on The Ellen DeGeneres Show in her first visit to a television talk show since becoming a member of the British royal family.</p>\n<p>Meghan, formally known as the Duchess of Sussex, sat down with DeGeneres for an episode that will air in the United States on Thursday, producers of the daytime show said on Wednesday.</p>\n<p>It was the first big TV appearance for Meghan since she and Harry gave a bombshell interview to Oprah Winfrey in March and spelled out their unhappiness at life within the royal family.</p>\n<p>The former Suits actress, who gave up her acting career when she married Harry in 2018, related an anecdote about her many auditions when she was starting out as an actress in Los Angeles, according to a clip of her surprise appearance.</p>\n<p>US Bannon (WASHINGTON, D. C.)</p>\n<p>Former US president Donald Trump's longtime adviser Steve Bannon has pleaded not guilty to criminal charges that he defied a congressional subpoena from a US House panel investigating the deadly January 6 Capitol riot, according to court documents.</p>\n<p>Bannon, who made his initial court appearance in court on Monday, was indicted last week by a federal grand jury on two counts of contempt of Congress.</p>\n<p>Bannon has vowed to fight the congressional subpoena, telling reporters outside the courthouse on Monday that he believes the prosecution is a politically motivated attack against him by President Joe Biden, Attorney General Merrick Garland and House of Representatives Speaker Nancy Pelosi.</p>\n<p>He was due to be arraigned in court on Thursday but agreed to waive his right to a formal reading of the indictment, according to court documents filed on Wednesday.</p>\n<p>Canada Floods (ABBOTSFORD)</p>\n<p>Canada has deployed the air force to help British Columbia deal with massive floods that killed one person, with more rain expected in coming days.</p>\n<p>Mudslides destroyed roads and bridges and severed access to the country's largest port in Vancouver, disrupting global supply chains already struggling to deal with problems caused by COVID-19.</p>\n<p>After a phenomenon known as an atmospheric river dumped a month's worth of rain in two days, officials are concerned that another downpour could overwhelm a pumping station near Abbotsford, a city of 160,000 to the east of Vancouver, which has already been partly evacuated.</p>\n<p>Mayor Henry Braun said the station was running at full capacity.</p>\n<p>Volunteers built a dam around the station overnight, he said.</p>\n<p>\"That will buy us some more time but if we had another weather event like we just went through, we are in deep doo-doo (trouble),\" he told reporters on Wednesday.</p>\n<p>US Hackers (WASHINGTON, D. C.)</p>\n<p>Hackers linked to the Iranian government have been targeting a \"broad range of victims\" inside the United States, including by deploying ransomware, according to an advisory issued by US, UK and Australian officials.</p>\n<p>The advisory said that in recent months, Iran's government has exploited computer vulnerabilities exposed by hackers before they can be fixed and targeted entities in the transportation, health care and public health sectors.</p>\n<p>The attackers leveraged the initial hack for additional operations, such as data exfiltration, ransomware and extortion, according to the advisory.</p>\n<p>The group has used the same Microsoft Exchange vulnerability in Australia, officials say.</p>\n<p>The warning is notable because even though ransomware attacks remain prevalent in the US, most of the significant ones in the past year have been attributed to Russia-based criminal hacker gangs rather than Iranian hackers.</p>\n<p>Belarus EU (BERLIN/MOSCOW)</p>\n<p>Belarusian President Alexander Lukashenko has agreed with German Chancellor Angela Merkel to hold talks with the European Union over a migration crisis on its borders, his office says.</p>\n<p>The announcement came following a second call this week between the outgoing German leader and the Belarusian strongman, who is accused by officials in Brussels of provoking a migrant crisis on the border with Poland.</p>\n<p>There was no initial confirmation from the German side of the apparent agreement.</p>\n<p>Lukashenko - often referred to as \"Europe's last dictator\" - is not recognised by any EU countries as the legitimate leader of Belarus following a disputed election and a crackdown on dissent last year.</p>\n<p>Merkel and Lukashenko's first telephone conversation on Monday, which lasted about 50 minutes, had already provoked criticism from inside and outside Germany.</p>\n<p>Iran Pets (TEHRAN)</p>\n<p>Keeping pets and walking dogs will soon be forbidden and punishable in Iran.</p>\n<p>According to media reports, hardliners in the Iranian parliament prepared a new draft law on Wednesday.</p>\n<p>According to the legislation, walking dogs will be punishable by a heavy fine and vehicles transporting dogs will be confiscated for three months.</p>\n<p>In addition, homeowners will soon not be allowed to rent their flats to dog and cat owners.</p>\n<p>In Islam, keeping a dog in the house is considered \"unclean\" but the clergy in Iran takes a hard line on all pets.</p>\n<p>They also believe that walking dogs causes panic among the population.</p>\n<p>The police tried several times to ban dogs altogether but in the end it never worked.</p>\n<p>Now the ban is to become law.</p>\n<p>US Capitol (WASHINGTON, D. C.)</p>\n<p>A federal judge has sentenced the US Capitol rioter nicknamed the \"QAnon Shaman\" for his horned headdress to 41 months in prison for his role in the deadly January 6 attack by followers of then-president Donald Trump..</p>\n<p>Prosecutors had asked US District Judge Royce Lamberth to impose a longer 51-month sentence on Jacob Chansley, who pleaded guilty in September to obstructing an official proceeding when he and thousands of others stormed the building in an attempt to stop Congress from certifying President Joe Biden's election.</p>\n<p>The sentence matches one imposed by a judge on a former mixed martial artist filmed punching a police officer during violence, who was sentenced last week to 41 months in prison.</p>\n<p>Lamberth said he believed Chansley, who made a lengthy speech before he was sentenced, had done a lot to convince the court he is \"on the right track\".</p>\n<p>Tyrrell (SYDNEY)</p>\n<p>Police have vowed to leave no stone unturned in the search for the remains of three-year-old William Tyrrell.</p>\n<p>Thursday marks the fourth day of a renewed search of the NSW mid-north coast town where the young boy disappeared in 2014.</p>\n<p>As diggers searched the garden of the home in Kendall where William's foster grandmother lived and where he was staying when he vanished, NSW Police revealed they'd seized a car that once belonged to her.</p>\n<p>The grey Mazda was seized from a home in Gymea in Sydney's south under a coronial order last week, police said on Wednesday.</p>\n<p>It's undergoing extensive forensic examination, which could take weeks.</p>\n<p>\"The NSW Police will not stop until such time as we've investigated every possible lead,\" NSW Police Deputy Commissioner Malcolm Lanyon told reporters on Wednesday.</p>\n<p>In sport ...</p>\n<p>RU Erasmus (CAPE TOWN)</p>\n<p>South Africa director of rugby Rassie Erasmus has been found guilty of misconduct by an independent committee for his hour-long video critique of match officials, particularly Australian referee Nic Berry, during the British &amp; Irish Lions series - but he says he will appeal against the verdict.</p>\n<p>Erasmus, who coached the Springboks to the 2019 Rugby World Cup title, has been banned from all rugby activity for two months after six charges of misconduct against him were upheld, World Rugby announced on Wednesday.</p>\n<p>He's also suspended from all match-day activities, including coaching and media engagement, until September 30, 2022 while South Africa Rugby has been fined Stg 20,000 ($A37,000), World Rugby said.</p>\n<p>Erasmus, who was also told he must apologise to the officials he criticised, has indicated he will appeal the verdict, as will SA Rugby.</p>\n<p>Gol EPGA (LONDON)</p>\n<p>Min Woo Lee is ready to set out on his quest to be crowned top golfer on the 2021 European Tour, backed by a huge vote of confidence in his \"super talent\" from his illustrious Australian colleague Adam Scott.</p>\n<p>Lee, still only 23, has an outside shot at winning the Race to Dubai, the season-long Order of Merit on the European Tour, but must continue his recent superb form and win the season's final event, the World Tour Championship, to have any chance.</p>\n<p>Asked by AAP about his young compatriot's chances, former Masters champ Scott, speaking from the US where he's preparing for the RSM Classic, said: \"Min Woo might win the whole thing and we see a new star of golf.\"</p>\n<p>Ends Bulletin</p>\n<p>Rolling News Desk inquiries : 02 9322 8611</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Australian Associated Press</p></div>"}