{"date": "2022-02-14 08:45:14.449000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Washington [US], February 14 (ANI): The first teaser for Amazon's 'The Lord of the Rings: The Rings of Power' has finally arrived during the Super Bowl, giving a first good look at the upcoming prequel series, which brings the world of J.R.R. Tolkien's Middle Earth to life.</p><p>Washington [US], February 14 (ANI): The first teaser for Amazon's 'The Lord of the Rings: The Rings of Power' has finally arrived during the Super Bowl, giving a first good look at the upcoming prequel series, which brings the world of J.R.R. Tolkien's Middle Earth to life.</p></div><div class=\"tr-npp-body\"><p>The minute-long teaser for the show, which has been set thousands of years prior to Peter Jackson's six feature films adapted from Tolkien's novels, opens with footage that shows a closer look at Middle Earth, as a voice asks, \"Haven't you ever wondered what else is out there?\"</p><p>The words appear to be spoken by a harfoot, an ancient ancestor of hobbits, played by Markella Kavenagh. Further, icy mountains, ravaging storms and dangerous monsters are all teased in the captivating new footage.</p><p>Amid these shots of scenic spectacle, there are glimpses of young versions of two familiar elven characters from Jackson's movies, Galadriel and Elrond, as well as new characters for the series such as a dwarven princess named Disa and an elf.</p><p>According to E! News, 'Rings of Power', which reportedly had a budget of over USD 450 million for its first season, is sure to expand the Lord of the Rings world we've come to know and love.</p><p>As the title already gives it away, this show will shed light on the forging of the rings. Showrunner Patrick McKay told a magazine, \"Rings for the elves, rings for dwarves, rings for men, and then the one ring Sauron used to deceive them all. It's the story of the creation of all those powers, where they came from, and what they did to each of those races.\"</p><p>As per The Hollywood Reporter, the ensemble cast includes Cynthia Addai-Robinson, Robert Aramayo, Owain Arthur, Maxim Baldry, Nazanin Boniadi, Morfydd Clark, Ismael Cruz Cordova, Charles Edwards, Trystan Gravelle, Sir Lenny Henry, Ema Horvath, Markella Kavenagh, Joseph Mawle, Tyroe Muhafidin, Sophia Nomvete, Lloyd Owen, Megan Richards, Dylan Smith, Charlie Vickers, Leon Wadham, Benjamin Walker, Daniel Weyman and Sara Zwangobani.</p><p>The debut season of the show will premiere on September 2 and will air in 240 territories around the world. New episodes will be rolled out on a weekly basis. (ANI)</p><p>Copyright © 2022 aninews.in All rights reserved. Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 SyndiGate. All Rights Reserved.</p></div>"}