{"date": "2022-01-18 16:11:50.719000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>HEALTHY EXTRACTS INC (\"HYEX-0\")\n- Preliminary Q4 2021 Gross Revenue up 72% Sequentially to a Record\n- $770,000; Full Year 2022 on Track to more than Double to over $3.3\n- Million\n\n     Healthy Extracts Inc., a leading innovator of clinically proven\nplant-based products for heart and brain health, reported preliminary\nunaudited results for the fourth quarter and full year ended December 31,\n2021.\n\n     Gross revenue for the fourth quarter is expected to total\napproximately $770,000, up 72% sequentially and up more than 519% over the\nsame year-ago quarter, with gross margin expected to exceed 65%. Revenue\nfor the full year is expected to total approximately $1.7 million,\nincreasing 31%.\n\n     \"Our strengthening performance throughout 2021 demonstrates how our\nsales have been ramping up through both our distribution and\ndirect-to-consumer channels, including our subscription-based product\nofferings,\" stated Duke Pitts, president of Healthy Extracts. \"These\nresults also reflect a rapidly growing customer base with increasing\ncustomer lifetime value that has now exceeded $500. We're finding that once\ncustomers discover our products, they keep coming back for more.\"\n\n     \"We ended the year exceptionally strong with a record quarter,\"\ncontinued Pitts, \"which was highlighted by new purchase orders from key\ndistributors and manufacturers indicating a resurgence in our wholesale\nbusiness.\"\n\n     The company's 2021 performance also reflects how it has strategically\nexpanded its portfolio of naturally formulated, clinically proven\nsupplements for supporting heart and brain health. This includes the\nroll-out of two new high-potency natural formulations containing the\ncompany's exclusive Citrus Bergamot SuperFruit(TM).\n\n     According to Healthy Extracts' recently appointed EVP of sales and\nmarketing, J. Scott Landers: \"While these new formulations support heart\nhealth on their own, they can also be taken with other statin medications\nlike Rosuvastatin, one of the most prescribed drugs for reducing\ncardiometabolic risk.\"\n\n     Clinical studies have demonstrated that the polyphenols and flavonoids\ncontained in Healthy Extracts' proprietary Citrus Bergamot formulations can\nsignificantly enhance the beneficial effects of Rosuvastatin.\n\n     Supporting the company's outlook for continued strong growth in 2022,\nHealthy Extracts recently introduced a new line of brain, physical\nperformance and women's hormone health products in partnership with Whitney\nJohns, the company's first major influencer under its recently launched\nbrand influencer program.\n\n     \"To add further fuel to our growth in 2022, we already have in the\nworks a number of new clinically-backed formulations for additional\nindications like hormone support and gut health,\" added Pitts. \"Combined\nwith our expanding sales channels, including Amazon where we have become a\nvery active seller, we believe we are well on course for at least 100%\norganic revenue growth in 2022.\n\n     \"We also expect to realize certain advantages from our supply chain\nmanagement and significant post-acquisition overhead reductions, with this\nsupporting a transition to cash flow positive by second half this year.\"\n\n     The company plans to report its full year 2021 results before the end\nof March.\n\n     About Healthy Extracts \"Live Life Young Again\"\nHealthy Extracts Inc. is a platform for developing or acquiring\nscience-forward, clinically proven, plant-based proprietary products in\nselect high-growth categories within the multibillion-dollar nutraceuticals\nmarket.\n\n     The company's subsidiaries, BergametNA(TM) and Ultimate Brain\nNutrients(TM) (UBN), offer nutraceutical natural heart and brain health\nsupplements. This includes the only heart health supplement containing\nCitrus Bergamot SuperFruit(TM). This superfruit is known to have the\nhighest quality and concentration of polyphenols and flavonoids, and with\nhealthy heart benefits backed by more than 17 clinical studies.\n\n     UBN KETONOMICS(R) proprietary formulations have been clinically shown\nto improve brain health, including memory, cognition, focus and\nneuro-energy. UBN is pursuing intellectual property license opportunities\nfor monetizing its IP portfolio of multiple issued and pending patents.\n\n     For more information visit: healthyextractsinc.com, bergametna.com or\ntryubn.com.\n\n     Forward-Looking Statements and Safe Harbor Notice\n\n     All statements other than statements of historical facts included in\nthis press release are \"forward-looking statements\" (as defined in the\nPrivate Securities Litigation Reform Act of 1995). Such forward-looking\nstatements include our expectations and those statements that use\nforward-looking words such as \"projected,\" \"expect,\" \"possibility\" and\n\"anticipate.\" The achievement or success of the matters covered by such\nforward-looking statements involve significant risks, uncertainties and\nassumptions. Actual results could differ materially from current\nprojections or implied results. Investors should read the risk factors set\nforth in the Company's Annual Report on Form 10-K filed with the SEC on\nFebruary 19, 2021, and future periodic reports filed with the SEC. All of\nthe Company's forward-looking statements are expressly qualified by all\nsuch risk factors and other cautionary statements.\n\n     The Company cautions that statements and assumptions made in this news\nrelease constitute forward-looking statements and make no guarantee of\nfuture performance. Forward-looking statements are based on estimates and\nopinions of management at the time statements are made. The information set\nforth herein speaks only as of the date hereof. The Company and its\nmanagement undertake no obligation to revise these statements following the\ndate of this news release.\n\n     Food and Drug Administration Disclosure\n\n     The product and formulation featured in this release is not for use by\nor sale to persons under the age of 12. This product should be used only as\ndirected on the label. Consult with a physician before use if you have a\nserious medical condition or use prescription medications. A doctor's\nadvice should be sought before using this and any supplemental dietary\nproduct. These statements have not been evaluated by the FDA. This product\nis not intended to diagnose, treat, cure or prevent any disease.\n\n     BergametNA(TM), Ultimate Brain Nutrients(TM), UBN(TM), Citrus Bergamot\nSuperFruit(TM) and F4T(R) are registered trademarks of Healthy Extracts\nInc.(TM)\n\n     Healthy Extracts Company Contact\n     Duke Pitts, President\n     Healthy Extracts Inc.\n     Tel (720) 463-1004\n     Email contact\n\n     Investor &amp;\n\n     Contact:Ronald Both or Justin Lumley\n     CMA Investor &amp; Media Relations\n     Tel (949) 432-7566\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201700444.MNPRE2201702382-08051420220118</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}