{"date": "2021-11-08 19:36:20.152000+00:00", "ticker": "ABDN", "mrkt_info": {"open": 263.9, "close": 262.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Abrdn is reportedly finalising a deal to purchase UK-based fund supermarket Interactive Investor in a bid to strengthen its direct-to-consumer business.</p><p>The British investment manager, formerly called Standard Life Aberdeen, is expected to pay £1.5bn for Interactive Investor, Financial Times reported citing people privy to the development.Interactive Investor, which manages around £55bn in assets, is said to cater to more than 400,000 customers.Abrdn confirmed to the publication that it is in discussions with private equity group C Flowers and Co, which holds the controlling stake in the fund supermarket since 2016.The potential deal could help the firm further accelerate its expansion plans in the UK adviser and consumer markets in addition to significantly expanding its direct-to-consumer business.As of now, the firm's direct-to-consumer offering is said to be its smallest business line.According to the sources, the companies could officially announce the deal in the next few weeks.Interactive Investor has confirmed the ongoing deal talks with Abrdn. However, the firm added that it had been approached by other parties.Additionally, the firm divulged that it is still considering initial public offering (IPO) an attractive option.\"Discussions around the (IPO) process are also underway,\" Interactive Investor told FT.Interactive Investor, revealed plans to go public earlier this year on the back of strong growth in the retail investing segment during the pandemic.The firm, which competes with rivals including Hargreaves Lansdown and AJ Bell, is said to makeup for about a fifth of the retail investment platform market in the UK.In March, it acquired a direct-to-consumer investment platform from rival Equiniti in a £48.5m deal.Last week, Abrdn snapped up London-headquartered investing insights platform Finimize to further propel its ongoing digitalisation efforts led by CEO Stephen Bird.It followed the firm's purchase of AI-driven wealth management platform Exo Investing this August.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}