{"date": "2022-01-26 07:38:21.566000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>SpectrumOne</div>\n<p style=\"margin-top:12px\">\n</p><p><span><span style=\"font-size:12pt\"><span>Ur &amp; Penn chooses Ampilio, subsidiary of SpectrumOne as partner to execute EU expansion via Amazon that will allow Ampilio to run all operations though Seller Central Amazon Sweden, by using the Pan European option. This will create new opportunities for Ur &amp; Penn to expand their footprint throughout Europe and for Ampilio to grow together with its clients.</span></span></span></p>\n<p><span><span style=\"font-size:12pt\"><span>The deal that has been agreed upon by Ur &amp; Penn and Ampilio is to follow a monthly retainer for 15 months valued at 375 000 SEK, and a commission structure based on sales via all Amazon marketplaces. The contract will continue after the 15 months unless both parties agree otherwise. The agreement brings together Ur &amp; Penn, Sweden's leading retail chain for watches and fashion accessories and Ampilio, the leading growth agency Scandinavia.</span></span></span></p>\n<p><span><span style=\"font-size:12pt\"><span>Ur &amp; Penn was founded in 1943 by Erling Persson and later came to function as a subsidiary of H&amp;M. It was then acquired by the entrepreneur Ayad Al Saffar in 2002, when the chain ran about 40 stores. Today, the store chain is in both Sweden and Finland with over 100 stores and a large e-commerce platform presence.</span></span></span></p>\n<p><span><span style=\"font-size:12pt\"><span>Ampilio has extensive experience in marketing, advertising, digitization and marketplaces. The company has proven its worth by working closely with Google, Facebook and Amazon Sweden. Ampilio is continuously reaping success in their field and innovative and data driven approach to the market, the company breaks new ground basically continuously.</span></span></span></p>\n<p><span><span style=\"font-size:12pt\"><span>During the past 2 years in the midst of the pandemic there has been a dramatic shift in the buying habits of customers to online peruses so a lot of focus for most consumer goods companies has moved to the e-commerce sector. The perfect example of this shift has been a dramatic increase in size of Amazon throughout the world and the EU in the past few years and especially during the crisis so the correct strategic move for Ur &amp; Penn is to test various bands throughout different marketplaces, increase sales and gain brand awareness throughout Europe and expand the business via Amazon and Ampilio.</span></span></span></p>\n<p><span><span style=\"font-size:12pt\"><span>Some of the initiatives, such as enhance brand content creation, social media marketing &amp; promotions, product traffic increasing plans by deep data analysis, that will be executed to make this venture a huge success taken by Ur &amp; Penn and Ampilio during the first year.</span></span></span></p>\n<p><span><span style=\"font-size:12pt\"><span>Abed Al Saffar, CEO of Ur &amp; Penn.” “Trying to do too much yourself is a trap we've been caught in too many times. There are lots of opportunities out there but we also need to be realistic about our capacity and our strengths, so if we can find greater talent elsewhere then it makes sense to us to leverage that talent. That’s why we chose to trust the team at SpectrumOne Group and Ampilio to execute our strategy on Amazon. We are really excited to see what 2022 brings for us!”</span></span></span></p>\n<p><span><span style=\"font-size:12pt\"><span>Customers of Ur &amp; Penn will now be able to enjoy the watches and fashion accessories from all over the world, giving them the opportunity to choose from a wider range of products that offers the classic Scandinavian style.</span></span></span></p>\n<p><span><span style=\"font-size:12pt\"><span>Wayne Smith, Manager of Ampilios Amazon department, “At Ampilio we are extremely excited to be a part of this venture with Ur &amp; Penn. I know that with Ampilios data driven approach and skilled team with a proven track record, we have doubled and in some cases even tripled our clients yearly revenue, will deliver the best possible service for Ur &amp; Penn and will be able to meet their expectations and beyond. 2021 was a massive year for us and we expect the same for 2022, so having Ur &amp; Penn a part of our clientele is a big step in the right direction” </span></span></span></p>\n<p><span><span style=\"font-size:12pt\"><span>For further information contact:</span></span></span></p>\n<p><span><span style=\"font-size:12pt\"><span>Hosni Teque-Omeirat, </span></span></span><span><span style=\"font-size:12pt\"><span>CEO</span></span></span><br/>\n<span><span style=\"font-size:12pt\"><span>+46 70 225 18 77</span></span></span><br/>\n<span><span style=\"font-size:12pt\"><span>hosni@spectrumone.com</span></span></span></p>\n<p><span><span style=\"font-size:12pt\"><span>Certified Adviser:</span></span></span></p>\n<p><span><span style=\"font-size:12pt\"><span>Aktieinvest FK AB (556072-2596)</span></span></span><br/>\n<span><span style=\"font-size:12pt\"><span>Box 7415 103 91 Stockholm</span></span></span><br/>\n<span><span style=\"font-size:12pt\"><span>Telefon: +46 8 506 517 03</span></span></span><br/>\n<span><span style=\"font-size:12pt\"><span>ca@aktieinvest.se</span></span></span><br/>\n<span><span style=\"font-size:12pt\"><span>www.aktieinvest.se</span></span></span></p>\n<p><span><span style=\"font-size:12pt\"><span><strong>About SpectrumOne AB</strong></span></span></span></p>\n<p><span><span style=\"font-size:12pt\"><span>SpectrumOne is a leading technology company delivering an advanced Data Management, Analytics &amp; Communications platform suite. Offered in a SaaS online service shipping with rich market data from various professional providers, SpectrumOne provides a unique solution to many leading actors across industry segments in various countries. Enabling clients with fast and easy access to data insight and visualization coupled with powerful search, segmentation, and mapping features. SpectrumOne allows data to be quickly enabled and operationalized, driving activities from customer communication to data science supporting business analysis, strategy, and growth. All of which can be enabled the same day with immediate results. SpectrumOne´s headquarter is based in Stockholm, Sweden, responsible for Nordic sales and strategy, with additional sales and business development located in Norway, Finland, Belgium and Spain.  SpectrumOne is listed on Nasdaq First North Growth Market in Stockholm.</span></span></span></p>\n<p><span><span style=\"font-size:12pt\"><span>www.spectrumone.com</span></span></span></p>\n<p><a href=\"https://news.cision.com/spectrumone/r/ur---penn-chooses-ampilio--subsidiary-of-spectrumone--as-partner-to-execute-eu-expansion-via-amazon%2Cc3492645\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://news.cision.com/spectrumone/r/ur---penn-chooses-ampilio--subsidiary-of-spectrumone--as-partner-to-execute-eu-expansion-via-amazon%2Cc3492645</a></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Waymaker BIT News - Cision 2022</p></div>"}