{"date": "2022-01-29 03:59:56.942000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2792.75, "close": 2991.47}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\"><p>US labor regulators accuse Amazon of threatening workers to thwart efforts to form a union at a warehouse in Staten Island, New York. SAN FRANCISCO: US labour authorities have filed a complaint accusing e-commerce giant Amazon of using threats and surveillance against its workers trying to organize a union at a New York City warehouse.</p><p>mazon allegedly grilled workers about union activities at the Staten Island site, promising to address grievances in exchange for voting against representation, the National Labor Relations Board (NLRB) argued in its complaint filed on Thursday. At stake is whether the workers might be the first to unionize an Amazon warehouse in the United States.</p><p>NLRB's complaint alleges the company \"repeatedly broke the law by threatening, surveilling, and interrogating their Staten Island warehouse workers who are engaged in a union organizing campaign.\" The board asked a judge, with a hearing set for April 5, to order Amazon to educate workers as well as managers about employee rights when it comes to unionizing.</p><p>Amazon rejected the allegations, saying they \"are false and we look forward to showing that through this process.\" Union literature was allegedly removed from a breakroom and \"confiscated\" from some employees, according to the filing.</p><p>NLRB has found that enough employees at the Staten Island warehouse have supported the union effort to justify a vote, with next steps to be discussed at a Feb 16 hearing. A campaign to form what could also be the first union at an Amazon warehouse in the United States will continue next month with a rematch ballot in Bessemer, Alabama.</p><p>A closely-watched vote last year in Bessemer ended in a defeat for organizers, who accused Amazon of breaking the rules and were granted a re-do on appeal. The NLRB will mail out ballots on Feb4, with counting of the votes set for March 28. The vote in the small town of Bessemer drew heavy media attention as it pitted supporters of the employees -- artists, Democratic and Republican lawmakers and even President Joe Biden -- against Amazon.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Bangkok Post</p></div>"}