{"date": "2021-06-22 12:45:13.856000+00:00", "ticker": "III", "mrkt_info": {"open": 1207.5, "close": 1189.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>IRENA / report / renewable energy</p><p>ABU DHABI, 22nd June, 2021 (WAM) -- The share of renewable energy that achieved lower costs than the most competitive fossil fuel option doubled in 2020, a new report by the International Renewable Energy Agency (IRENA) shows.</p></div><div class=\"tr-npp-body\"><p>162 gigawatts (GW) or 62 percent of total renewable power generation added last year had lower costs than the cheapest new fossil fuel option.</p><p>Renewable Power Generation Costs in 2020 shows that costs for renewable technologies continued to fall significantly year-on-year. Concentrating solar power (CSP) fell by 16 percent, onshore wind by 13 percent, offshore wind by 9 percent and solar PV by 7 percent.</p><p>With costs at low levels, renewables increasingly undercut existing coal's operational costs too. Low-cost renewables give developed and developing countries a strong business case to power past coal in pursuit of a net-zero economy. Just 2020's new renewable project additions will save emerging economies up to US$ 156 billion over their lifespan.</p><p>\"Today, renewables are the cheapest source of power,\" said IRENA's Director-General Francesco La Camera. \"Renewables present countries tied to coal with an economically attractive phase-out agenda that ensures they meet growing energy demand, while saving costs, adding jobs, boosting growth and meeting climate ambition. I am encouraged that more and more countries opt to power their economies with renewables and follow IRENA's pathway to reach net-zero emissions by 2050.\" \"We are far beyond the tipping point of coal,\" La Camera continued. \"Following the latest commitment by G7 to net-zero and stop global coal funding abroad, it is now for G20 and emerging economies to match these measures. We cannot allow having a dual-track for energy transition where some countries rapidly turn green and others remain trapped in the fossil-based system of the past. Global solidarity will be crucial, from technology diffusion to financial strategies and investment support. We must make sure everybody benefits from the energy transition.\" The renewable projects added last year will reduce costs in the electricity sector by at least US$ 6 billion per year in emerging countries, relative to adding the same amount of fossil fuel-fired generation. Two-thirds of these savings will come from onshore wind, followed by hydropower and solar PV.</p><p>2010-2020 saw a dramatic improvement in the competitiveness of solar and wind technologies with CSP, offshore wind and solar PV all joining onshore wind in the range of costs for new fossil fuels capacity, and increasingly outcompeting them. Within ten years, the cost of electricity from utility-scale solar PV fell by 85 percent, that of CSP by 68 percent, onshore wind by 56 percent and 48 percent for offshore wind.</p><p>IRENA's report also shows that new renewables beat existing coal plants on operating costs too, stranding coal power as increasingly uneconomic. Globally, over 800 GW of existing coal power costs more than new solar PV or onshore wind projects commissioned in 2021.</p><p>The outlook till 2022 sees global renewable power costs falling further, with onshore wind becoming 20-27 percent lower than the cheapest new coal-fired generation option. 74 percent of all new solar PV projects commissioned over the next two years that have been competitively procured through auctions and tenders will have an award price lower than new coal power. The trend confirms that low-cost renewables are not only the backbone of the electricity system, but that they will also enable electrification in end-uses like transport, buildings and industry and unlock competitive indirect electrification with renewable hydrogen.</p><p>© Copyright 2021 Emirates News Agency (WAM) Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SyndiGate. All Rights Reserved.</p></div>"}