{"date": "2021-12-25 05:18:31.652000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3421.37, "close": 3413.22}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Dec. 25 -- Amazon has announced smartphone and TV upgrade days year end edition bringing together a host of deals and offers on a range of the latest smartphones, accessories and TVs. Customers can enjoy up to 40% off on their favourite smartphones, televisions, and smartphone accessories from brands Xiaomi, Samsung, iQOO, OPPO, Tecno and Vivo amongst others. The latest Redmi 9A, Redmi Note 10S, Xiaomi 11 Lite NE 5G, Samsung Galaxy M Series, Samsung Galaxy S20 FE 5G, Realme Narzo 50A, OnePlus Nord CE, OnePlus Nord 2, iQOO Z Series, iQOO 7, Tecno Spark 8T are amongst other smartphones that will see great offers during the Smartphone Upgrade Days.</p><p>Smartphone and TV upgrade days year end edition is live today until December 31.</p></div><div class=\"tr-npp-body\"><p>Customers can get instant discount up to Rs.1,500 using Amazon Pay ICICI Bank Credit Cards. They can also avail exchange offers and no-cost EMI for up to 12 months on their favourite smartphones and TVs.</p><p>Prime Members can avail savings of up to Rs.20,000 with Advantage Just for Prime, which includes benefits like 6-month free screen replacement and additional 3 month no cost EMI on HDFC Bank Debit and Credit Cards which offers higher EMI tenures and lower payments per month starting Rs.1,333 per month.</p><p>Here are some of the latest smartphones, TV's on Amazon with offers:</p><p>OnePlus</p><p>The upgrade days will see discounts and EMI options on OnePlus Nord 2 and Nord CE. Get up to Rs.1,500 off with Amazon Pay ICICI Credit cards, ICICI and Kotak cards. Get additional exchange offers on select smartphones and up to 3 months No Cost EMI on select bank cards. Get up to Rs.8,000 off on OnePlus 9 Series with ICICI and Kotak bank cards and get additional Rs.5,000 off on exchange of select smartphones. OnePlus TVs ranging from 32 inch to 55 inch will be available starting Rs.15,455 including discount on ICICI credit cards. OnePlus smartphones and televisions will become affordable with bank offers and will also see up to 9 months no-cost EMI.</p><p>Xiaomi</p><p>Get savings of Rs.700 on Xiaomi smartphones including Redmi 9A and Redmi Note 10S. The smartphones will be available with additional bank offers for Amazon Pay ICICI credit card users. The newly launched Xiaomi 11 Lite NE 5G will also be available with an instant bank discount of Rs.2,500 with ICICI Bank Credit and Debit cards, customers can get it for Rs.24,500. Also get up to Rs.2,500 off on flagship Mi phones like the Mi 11X Pro, Mi 11X. Xiaomi has multiple televisions from 32 inch to 55 inch starting from Rs.14,999. Xiaomi smartphones and televisions will also see up to 12 months no-cost EMI.</p><p>Samsung</p><p>Samsung Galaxy S20 FE 5G will be available for Rs.39,990 while its actual price is Rs.74,990. Get additional Rs.1,500 off with Amazon Pay ICICI Credit cards and get it for Rs.38,490.</p><p>iQOO</p><p>iQOO Z3 will be available for Rs.15,490 including Rs.3,000 off with coupons and bank discount. The iQOO Z5 will be available for Rs.19,490 including Rs.3,000 off with coupons and bank discount.</p><p>Tecno</p><p>The newly launched Tecno Spark 8T will be available for Rs.8,999 while its actual price is Rs.13,990. Get additional Rs.900 off with Amazon Pay ICICI bank credit card and get it for Rs.8,099. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}