{"date": "2022-01-10 14:41:38.715000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>BEYOND MEDICAL TECHNOLOGIES INC (\"DOCT-Z;DOCKF-0\")\n- Micron Technologies Sympathizes with the Worldwide Wave of the\n- Omicron Covid Variant and Offers Medical Grade Face Masks\n\n     Beyond Medical Technologies Inc. (\"Beyond Medical\" or the \"Company\"),\nthrough its medical face mask manufacturing subsidiary, Micron Technologies\nInc. (\"Micron Technologies\"), sympathizes with the worldwide wave of the\nOmicron Covid variant and urges its clients to utilize medical grade face\nmasks in any social settings.\n\n     Corporate Video:\n\n<a href=\"https://cdn.shopify.com/s/files/1/0492/9627/7672/files/Micron-Commercial.mp\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://cdn.shopify.com/s/files/1/0492/9627/7672/files/Micron-Commercial.mp</a>\n4?v=1641791344\n\n     Products\n\n     Micron Technologies has been operating at its facility in Delta,\nBritish Columbia, since August 2020, where it manufactures medical grade\nface masks under its Medical Device Establishment License issued by Health\nCanada. Micron Technologies is also registered with the US Food and Drug\nAdministration. The Company's product line focuses on three key product\nlines:\n\n//st\n  * three ply medical grade face masks, which conform to ASTM F2100 Medical\n    Grade Level 3 standards;\n\n//et\n\n//st\n\n  * N95 Model 8800 face masks, which have been approved by Health Canada\nand\n    the US Food and Drug Administration; and\n\n//et\n\n//st\n\n  * face mask filters.\n\n//et\n\n     Available on Amazon, Shopify, and at Walmart\n\n     Micron Technologies' three-ply medical grade face masks and N95 Model\n8800 face masks are available for purchase on Amazon, Shopify, and at\nWalmart. Face masks can also be purchased directly from Micron Technologies\nat  <a href=\"https://micronti.com/pages/micron-video\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://micronti.com/pages/micron-video</a>\n\n     About Beyond Medical\n\n     Beyond Medical is an industrial/technology company with a\nmanufacturing facility located in Delta, British Columbia. The Company,\nthrough its subsidiary Micron Technologies, manufactures medical grade face\nmasks. The Company also has an investment in  digital telehealth platform\nin Kayan Health. Kayan Health is an artificial-intelligence powered health\ncommunications platform that allows doctors to communicate with their\npatients and monitor them remotely. <a href=\"https://kayanhealth.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://kayanhealth.com</a>\n\n     Kal Malhi, CEO\n604-805-4602\nkal@bullruncapital.ca\n\n     The Company is not making any express or implied claims that its\nproducts have the ability to eliminate, cure or contain COVID-19 (or SARS-2\nCoronavirus) at this time.\n\n     Neither the Canadian Securities Exchange nor its Regulation Services\nProvider (as that term is defined in the policies of the Canadian\nSecurities Exchange) accepts responsibility for the adequacy or accuracy of\nthis news release. The Canadian Securities Exchange has neither approved\nnor disapproved the contents of this news release.\n\n     FORWARD LOOKING STATEMENTS:\n\n     This news release includes certain statements that may be deemed\n\"forward-looking statements\". All statements in this news release, other\nthan statements of historical facts, that address events or developments\nthat the Company expects to occur, are forward-looking statements.\nForward-looking statements are statements that are not historical facts and\nare generally, but not always, identified by the words \"expects\", \"plans\",\n\"anticipates\", \"believes\", \"intends\", \"estimates\", \"projects\", \"potential\"\nand similar expressions, or that events or conditions \"will\", \"would\",\n\"may\", \"could\" or \"should\" occur. Although the Company believes the\nexpectations expressed in such forward-looking statements are based on\nreasonable assumptions, such statements are not guarantees of future\nperformance and actual results may differ materially from those in the\nforward-looking statements. Factors that could cause the actual results to\ndiffer materially from those in forward-looking statements include market\nprices, continued availability of capital and financing, and general\neconomic, market or business conditions. Investors are cautioned that any\nsuch statements are not guarantees of future performance and actual results\nor developments may differ materially from those projected in the\nforward-looking statements. Forward-looking statements are based on the\nbeliefs, estimates and opinions of the Company's management on the date the\nstatements are made. Except as required by applicable securities laws, the\nCompany undertakes no obligation to update these forward-looking statements\nin the event that management's beliefs, estimates or opinions, or other\nfactors, should change.\n\nTel   : 604-805-4602    BEYOND MEDICAL TECHNOLOGIES INC\nFax   : 604-805-4602\nWWW   : <a href=\"https://www.beyondmd.ca\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.beyondmd.ca</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200900561.MNPRE2200901784-06295620220110</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}