{"date": "2022-01-27 10:03:09+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2799.72, "close": 2792.75}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\">\n<li><span>In strategic partnership with Dubai Internet City, the milestone anniversary will spotlight more than 400 global tech start-ups</span></li>\n<li><span>Packed schedule of insight sessions exploring hot topic industry trends, including Metaverse, NFTs and health-tech</span></li>\n<li><span>Scheduled talks by leaders from Amazon, Anghami, Polaroid and more</span></li>\n<li><span>in5 is a Main Partner for The Start Track of the conference</span><span> </span></li>\n</ul>\n<p>Dubai, UAE : The leading tech festival for emerging markets, Step Conference celebrates a decade of inspiring entrepreneurship, enabling innovation and producing economic value in the region. Organised in strategic partnership with Dubai Internet City, the region’s leading tech hub, the milestone anniversary will spotlight more than 400 global tech start-ups from February 23-24, while tackling hot ticket topics like Web3, NFTs, blockchain, fintech and more.</p>\n<p>The milestone anniversary’s arrival alongside Expo 2020 Dubai underlines a significant opportunity for the conference and its showcasing start-ups, as it elevates the region's potential for entrepreneurship and innovation to a global audience. Step will build upon the revolutionary technological advancements and conversations taking place at the global exhibition, such as artificial intelligence (AI) and digital healthcare, while setting the stage for international opportunities and visibility.</p>\n<p>The 10<sup>th</sup> edition will see an action-packed two days of high-profile speakers, exciting pitching opportunities, and a lively agenda covering the most trending discussions in tech. Visitors will have the chance to attend insightful keynotes and panel discussions by tech heavyweights the likes of Paul Misener, the Vice President of Global Innovation Policy and Communication at Amazon, Elie Habib, the founder of the Middle East’s leading music streaming service Anghami, and Michelle Arrazcaeta, head of Brand Strategy &amp; Collaborations at Polaroid. Also joining the roster is Humans of New York breakout star Sidra Qasim, co-founder of Brooklyn-based shoe brand, Atoms.</p>\n<p>This year’s conference focuses on four key tracks, including fintech with an emphasis on payments, crypto and e-commerce; future innovations with a focus on AI, mobility, energy and cloud; digital with media, marketing and content; and wellness deep-diving into health-tech and lifestyle. Visitors can dive into the future of tech as start-ups exhibit innovative products and services, while looking back at the past decade of nurturing the region’s start-up ecosystem. </p>\n<p>The partnership between Dubai Internet City and Step brings cutting-edge conversations and industry insights to a comprehensive community of startups, investors, accelerators, corporations and government representatives. The resulting platform nurtures unrivalled opportunities for knowledge sharing and collaboration in vital and emerging tech sectors, enabling businesses in the region to harness the power and expertise of game-changing entrepreneurs from around the world.</p>\n<p> Ammar Al Malik, Managing Director of Dubai Internet City, said, “Our leadership’s vision to transform the UAE into a global technology hub and establish a world-class digital infrastructure relies on ambitious start-ups pushing the envelope to deliver unique solutions and nurture competition. Our business district has been a cornerstone of the country’s economic diversification strategy for over 20 years and empowering start-ups and SMEs is essential in cementing our global competitiveness and commitment to innovation.</p>\n<p>We are delighted to continue our partnership with Step Conference, as it embodies our district’s reputation of ‘Where Minds Click’. We will see the complete start-up community convene in the heart of Dubai Internet City, showcasing the brightest minds and ideas defining the digital future. Step’s arrival alongside the Expo 2020 unveils an immense opportunity for us to showcase our inspiring community to the global technology and innovation ecosystem. We hope to welcome international delegations to the conference, expanding the potential for partnerships and investment on a larger scale than ever before.”</p>\n<p>Ray Dargham, CEO of Step said, “We are very excited for our next edition, happening at the same time as Expo 2020 this year and celebrating the past decade as we witness the ecosystem evolve. Our partnership with Dubai Internet City has been impactful in engaging and supporting entrepreneurs in the region. We look forward to host top experts and discuss a future with a new digital landscape.”</p>\n<p>Having started as a series of workshops and small gatherings in 2011, Step has evolved into a comprehensive conference ecosystem exploring the future of tech. It brings together the complete start-up community under one roof with enriching opportunities to engage and exchange expertise.</p>\n<p>Its continued collaboration with Dubai Internet City, a leading business district home to more than 1,600 tech start-ups, SMEs and international corporations, underscores the emirate’s enabling environment suited to start-ups, future unicorns and entrepreneurs. In 2019, the UAE ranked among the top 20 of 190 global economies in the World Bank’s ease of doing business report, with aims to enhance business-friendly policies further in coming years. Dubai’s state-of-the-art infrastructure, government-backed initiatives – including the Ministry of Economy’s bid to nurture 20 unicorns by 2031 – and incubators like in5, enhance the country’s attractiveness to entrepreneurs and investors alike, establishing a strong platform for growth and success.</p>\n<p><strong>in5, the enabling platform for entrepreneurs and startups</strong></p>\n<p>in5, a leading business incubator that started in Dubai Internet City in 2013 is a Main Partner for The Start Track of the conference. The Start Track tackles the entirety of the start-up landscape over insightful keynotes, panels, and debates. Global influencers in the tech and digital space will cover success stories, setting up and growth, the entrepreneurship ecosystem, fundraising and investment, acquisitions and IPOs, as well as spotlighting the most exciting start-ups gaining traction.  </p>\n<p>The enabling platform for entrepreneurs and startups recently reached a new milestone as its start-ups crossed the AED 1.4 billion investment mark. The direct investments came through venture capital and angel investors. The grand total of start-ups supported by the incubator since 2013 reached 500, of these, a quarter are led and managed by female entrepreneurs.</p>\n<p>Step Conference 2021 will cover a range of key topics, including:</p>\n<p><strong>The meteoric rise of NFTs</strong></p>\n<p>A major spotlight will shine on non-fungible tokens, or NFTs. Stored and traded on blockchain networks like Ethereum, NFTs are changing the digital asset market by employing tech to sell digital art. According to the latest estimates, the exponentially growing market has surpassed US$40 billion in valuation with Christie’s – which brought NFT mania into the mainstream with the sale of US$69.3 million digital artwork by Beeple – the NBA, Gucci and other major brands embracing the trend.  </p>\n<p><strong>The digital payment revolution</strong></p>\n<p>A robust digital infrastructure is critical to a thriving start-up environment, as it enables businesses to participate in the digital transformation, increase profitability while remaining cost-effective. Businesses in the UAE have been contributing heavily to its adoption in MENA and an IBS Intelligence report found that the UAE is home to almost half of the region’s fintech companies. An innovation centre run by Visa in Dubai Internet City is developing and exporting contactless payment tech, while homegrown in5 start-up, tabby, is enhancing the buy-now-pay-later sector for e-commerce brands.</p>\n<p><strong>Building the metaverse</strong></p>\n<p>Another viral topic is the metaverse, or Web3, a virtual reality world where people can attend live concerts, shop goods and services, social, play games and much more. It is poised to be the next been tech platform and, according to Bloomberg, could approach US$800 billion in 2024. All eyes are on the metaverse as it comes with a great many promises of revolutionizing how we interact, spend, live, and market products.</p>\n<p> <strong>Looking back at a decade of growth</strong></p>\n<p>On the occasion of its 10<sup>th</sup> anniversary, Step will review the outstanding milestones achieved in tech and entrepreneurship over the past decade. In 2017, tech conglomerate Amazon acquired the Arab world’s largest e-commerce platform, Souq.com. The region welcomed its first tech unicorn in 2019, when DIC-based start-up Careem was acquired by Uber for US$3.1 billion. Kitopi, the world's leading cloud kitchen platform, most recently earned unicorn status in 2021 with a major funding round led by SoftBank. Such stories, paired with the emerging crop of entrepreneurs in MENA, are proving the UAE’s emerging status as a hub for technology and innovation.</p>\n<p>Tickets for Step Conference 2022 in Dubai are on sale now and can be purchased from the Step website. For media registrations, please email <a href=\"mailto:pr@stepgroup.co\" data-type=\"email\" translate=\"no\">pr@stepgroup.co</a>.</p>\n<p>-Ends-</p>\n<p><strong>About Step</strong></p>\n<p><span>Step is a new media company with a suite of virtual and in-person events, podcasts, and newsletters for the tech savvy cross-generational audience in MENA and emerging markets. Step is most known for hosting the largest tech and startup conference in Dubai and MENA.</span></p>\n<p><span>Step has a decade of expertise and network building in MENA's tech and digital ecosystem.</span></p>\n<ul class=\"bulleted-list arrowlist\">\n<li><span>Hosted more than 200 events and programs in the areas of tech, startups, and digital.</span></li>\n<li><span>Step's landmark conference in Dubai attracts over 7,000 global attendees.</span></li>\n<li><span>More than 2,000 startups from MENA and beyond have participated in a Step event or program in the last 10 years.</span></li>\n<li><span>Many startups have launched at Step, made connections which led to follow-on meetings to pitch for investment, and graduated from the startup programs to become thought leaders in their space.</span></li>\n<li><span>Over 10,000 facilitated connections through Step’s investor meeting and mentorship programs</span></li>\n</ul>\n<p><strong>About Dubai Internet City</strong></p>\n<p><span>About Dubai Internet CityDubai Internet City (DIC), a member of TECOM Group, is a unique ICT hub and is the only specialised technology business community in the region, it is a place where innovators and entrepreneurs from all over the world work, connect and share their vision for a bold new tomorrow.</span></p>\n<p>For media enquiries, please contact:<br/>\nOguzhan Kirdok<br/>\nHill+Knowlton Strategies<br/>\nEmail: <a href=\"mailto:oguzhan.kirdok@hkstrategies.com\" data-type=\"email\" translate=\"no\">oguzhan.kirdok@hkstrategies.com</a><br/>\nSultan Sarieddine<br/>\nHill+Knowlton Strategies<br/>\nEmail: <a href=\"mailto:Sultan.sarieddine@hkstrategies.com\" data-type=\"email\" translate=\"no\">Sultan.sarieddine@hkstrategies.com</a> </p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}