{"date": "2021-11-14 20:28:50.994000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Future Retail\u0092s (FRL\u0092s) independent directors have written a second letter to the Competition Commission of India (CCI), stating American e-commerce major Amazon never intended to invest in Future Coupons (FCPL) and the representations made by the US e-commerce player were completely opposite and contradictory to their own internal correspondences as submitted before courts.</p><p>The directors also wrote to CCI that Amazon has obtained approval by making deliberate misrepresentations. By actively misleading the CCI and the regulator, it has to revoke the approval granted for Amazon\u0092s investment in FCPL.</p></div><div class=\"tr-npp-body\"><p>This move by the independent directors of FRL comes after Amazon wrote a letter to the Securities and Exchange Board of India (Sebi) and the Ministry of Corporate Affairs, which asked to withdraw any permission and consent granted to FRL related to the $3.4-billion merger deal between Future Group and Reliance Industries. This letter from the independent directors to CCI has also been submitted to the exchanges.</p><p>The letter states that Amazon intended to invest directly in FRL through the foreign portfolio investment (FPI) route. However, due to Amazon\u0092s concerns arising out of Press Note 2 (PN2), the investment structure was changed and hence, Amazon decided it would invest in FCPL, and FCPL would acquire 9.82 per cent of FRL.</p><p>In 2018 through PN2, India amended its foreign direct investment (FDI) regulations for e-commerce marketplaces, restricting companies from selling products on marketplaces having equity from the same e-commerce platform.</p><p>FRL independent directors stated that Amazon\u0092s representation that it does not have any direct or indirect shareholding in FRL is contradicted by their own internal records and said Amazon paid a premium of 25 per cent over the regulatory price of securities of FRL in lieu of strategic rights. It also stated that the price paid for FCPL shares has been determined by Amazon on the basis of FRL\u0092s valuation as is clearly set out in the email and there was no valuation ascribed to FCPL\u0092s business.</p><p>The directors also point out that an email sent to Amazon\u0092s Jeff Bezos analyses FRL\u0092s business and operations and there is only one sentence on FCPL\u0092s business.</p><p>The directors wrote to CCI that \u0093in spite of the fact that in their mind the rights acquired by Amazon over FRL were strategic, Amazon has chosen to represent these rights as \u0091investment protection rights\u0092 to CCI\u0094.</p><p>The letter also states that Amazon\u0092s lawyers AZB &amp; Partners raised an issue vide their email dated April 4, 2019, \u0093to ensure these rights are enforceable against FRL, albeit through the company (FCPL). It is preferred that these rights are captured by way of a specific agreement between the company (FCPL), the promoters, and FRL\u0094.</p><p>The email also stated that, \u0093the manner in which the company exercises these rights will be a veto matter under FCPL shareholder\u0092s agreement\u0094.</p><p>In its earlier letter dated November 7, the independent directors of FRL wrote to CCI stating that Amazon has violated the FDI norms, when it picked up 49 per cent stake in the company\u0092s promoter entity \u0097 FCPL \u0097 and applied for CCI\u0092s approval by concealing facts.</p><p>Asking the CCI to revoke the approval granted to Amazon to buy a stake in FCPL, the independent directors said CCI should act to stop Amazon from perpetuating \u0093its evil non-desirable designs\u0094 against the Indian company.</p><p>The fight between Amazon and FRL started last year after FRL\u0092s merger with Reliance Retail and alleged that the transaction breached its agreement with the US-based e-commerce firm. Amazon had cited its non-compete agreement with the Kishore Biyani-led chain, after which Amazon took the matter to the Singapore International Arbitration Centre (SIAC) and got a favourable ruling in October last year.</p><p>In August this year, the Supreme Court (SC) had ruled in favour of Amazon, holding the SIAC award against Future-Reliance deal enforceable in India. In September this year, in a major relief to Future Group, the SC stayed proceedings before Delhi High Court, ordering a no-coercive action. The court also directed the National Company Law Tribunal, CCI, and Sebi not to pass any final order in relation to the dispute for four weeks.</p><p>In August 2019, Amazon had acquired a 49 per cent stake in FCPL \u0097 the promoter entity of FRL \u0097 for around Rs 1,500 crore.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}