{"date": "2021-11-29 19:47:13.872000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>E-commerce giant Amazon has revealed plans to open a 'technologically advanced' fulfilment centre (FC) in Abu Dhabi, United Arab Emirates.</p><p>Scheduled to open by 2024, the facility will use machine learning and artificial intelligence (AI) technologies to improve its operational efficiency and customer experience, as well as expedite deliveries.Amazon has partnered with the Abu Dhabi Investment Office (ADIO) for the FC, which is part of ADIO's programme to attract investment and drive innovation.In addition to creating jobs in the logistics sector, the development is intended to help entrepreneurs, start-ups and small to medium-sized businesses (SMBs) amid the nation's transition to digital platforms.The FC will be developed in line with Amazon's carbon reduction strategies and ADIO's Environmental, Social and Governance (ESG) Policy.Amazon international consumer senior vice-president Russell Grandinetti said: \"Driven by customer-obsession, innovation and long-term thinking, we are very proud to be working alongside the UAE leadership as we contribute to the nation's accelerating digital economy and ambitious growth agenda.\"We look forward to partnering with the Abu Dhabi Investment Office to bring Amazon's advanced logistics, technology innovations, sustainability initiatives and decades of expertise to the area.\"The FC is intended to help Amazon make its operations more sustainable and will support the UAE's goal to reach net-zero carbon emissions by 2050.ADIO previously partnered with Amazon Web Services (AWS) to launch Cloud data centres in the UAE.Abu Dhabi Department of Economic Development chairman Mohammed Ali Al Shorafa said: \"The addition of Amazon's new fulfilment centre further boosts the emirate's ecosystem by introducing new capabilities and an enhanced infrastructure that deliver benefits to other businesses.\"Last month, Amazon opened its first 4-star retail outlet at the Bluewater shopping mall near Dartford, UK.The 4-star store concept only sells products that have been rated four stars or more, are top sellers or are new and trending on the retailer's website.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}