{"date": "2022-02-01 15:47:03.452000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>CORUS ENTERTAINMENT INC (\"CJR.B-T;CJREF-0\")\n- Makes Milestone Investment In Aircraft Pictures\n\n     Corus Entertainment Inc. has purchased a majority stake in Academy\nAward(r) and Emmy Award(r) nominated production company Aircraft Pictures\nLimited, founded in 2005 by Canadian producing team Anthony Leo and Andrew\nRosen. The deal marks an important investment in supporting Aircraft\nPictures' and Corus' growth ambitions in producing quality kids and\nfamily-focused entertainment for the global marketplace.\n\n     \"Bringing Aircraft Pictures' demonstrated creative capabilities and\nentrepreneurial talents into the Corus orbit will help to accelerate our\nstrategy of expanding our global content business,\" said Colin Bohm, EVP of\nContent &amp; Corporate Strategy, Corus Entertainment. \"We are thrilled to be\nin business with two of the most respected producers in the industry.\"\n\n     Aircraft Pictures produced the Oscar(r) nominated animated feature\nfilm The Breadwinner in 2017; the Emmy Award(r) nominated live-action\nseries Holly Hobbie; the hit trilogy of family-friendly television movies\nbased on the Gordon Korman Bruno &amp; Boots novels, which first aired on YTV\nin 2017; and the recently announced animated series Summer Memories.\nAircraft Pictures has a robust slate of family-friendly scripted projects\nthat are poised to capitalize on market demand for that genre, and Corus'\ninvestment will assist Aircraft Pictures in expanding its capacity for\ndeveloping, financing and producing premium content, with a focus on\ninternational co-productions.\n\n     \"Andrew and I are truly fortunate to work with outstanding creative\ntalent, exceptional co-producing partners and distributors and world-class\nbroadcast and streaming platforms,\" said Anthony Leo, Co-President of\nAircraft Pictures. \"As we plan to grow the company in new and exciting\nways, the additional resources that this landmark step provides will\nincrease the value Aircraft Pictures can extend to our partners\nexponentially.\"\n\n     Andrew Rosen, Co-President of Aircraft Pictures adds: \"Having worked\nwith Corus for many years achieving tremendous success with the Bruno &amp;\nBoots films, we're looking forward to turning this exciting partnership\ninto a legacy of family-friendly content that resonates with audiences\naround the world.\"\n\n     This investment builds on Corus' growing content business, with\nAircraft Pictures joining venerable studio Nelvana, respected publisher\nKids Can Press, and Corus Studios, each of which brings best-in-class\ncontent to leading platforms such as Nickelodeon, Discovery, the CW,\nNetflix, hulu, and Amazon.\n\n     About Corus Entertainment Corus Entertainment Inc. (TSX: CJR.B) is a\nleading media and content company that develops and delivers high quality\nbrands and content across platforms for audiences around the world.\nEngaging audiences since 1999, the company's portfolio of multimedia\nofferings encompass 33 specialty television services, 39 radio stations, 15\nconventional television stations, a suite of digital and streaming assets,\nanimation software, technology and media services. Corus is an\ninternationally-renowned content creator and distributor through Nelvana, a\nworld class animation studio expert in all formats and Corus Studios, a\nglobally recognized producer of hit scripted and unscripted content. The\ncompany also owns innovative full-service social digital agency so.da,\nlifestyle entertainment company Kin Canada, leading 2D animation software\nsupplier Toon Boom and children's book publishing house, Kids Can Press.\nCorus' roster of premium brands includes Global Television, W Network, HGTV\nCanada, Food Network Canada, HISTORY(r), Showcase, Adult Swim, National\nGeographic, Disney Channel Canada, YTV, Global News, Globalnews.ca, Q107,\nCountry 105, and CFOX, along with broadly distributed Canadian streaming\nplatforms STACKTV, Nick+, the Global TV App and Curiouscast. For more\ninformation visit www.corusent.com.\n\n     About Aircraft Pictures Based in Toronto with an office in Los\nAngeles, Aircraft Pictures was founded by Anthony Leo and Andrew Rosen to\ncreate high quality, scripted content for kids, families and young adults.\nRecent projects include the Hulu Original series Holly Hobbie; the\nmulti-award winning animated feature film The Breadwinner; three television\nmovies based on the Bruno &amp; Boots book series by Canadian young adult\nfiction icon Gordon Korman; the supernatural comedy series Todd &amp; The Book\nof Pure Evil and the Kidscreen Award-winning single-camera comedy Raising\nExpectations created by Tom Saunders (Arrested Development) and starring\nJason Priestley and Molly Ringwald. Aircraft also collaborated on C.S.I.\ncreator Anthony E. Zuiker's internet motion picture Cybergeddon and the NBC\nUniversal web series Heroes Reborn: Dark Matters. For more information,\nvisit www.aircraftpictures.com\n\nAshley Applebaum, Director, Publicity, Corus Entertainment Inc.,\nashley.applebaum@corusent.com;\n\nMelissa Eckersley, Director, Corporate Communications, Corus Entertainment\nInc., melissa.eckersley@corusent.com;\n\nAndrew Stewart, 42West, andrew.stewart@42West.net; Amanda Jaeger, 42West,\namanda.jaeger@42West.net\n\nTel   : 416-479-6100    CORUS ENTERTAINMENT INC\nFax   : 416-479-7013\nEmail : john.gossling@corusent.com\nWWW   : <a href=\"http://www.corusent.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.corusent.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203100344.MNPRE2203102245-07340620220201</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}