{"date": "2021-10-28 15:58:50+00:00", "ticker": "ABDN", "mrkt_info": {"open": 261.1, "close": 257.7}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-story-p1\"><span class=\"tr-dateline\">LONDON, Oct 28 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Abdrn investment manager Iain Pyle said on Thursday he would 'probably' be against a call by hedge fund Third Point to break up Royal Dutch Shell <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RDSa.L\" data-type=\"ric\" data-ric=\"RDSa.L\" translate=\"no\" dir=\"ltr\">RDSa.L</a>.</p><p>Pyle, whose company is a top-10 investor in Shell according to Refinitiv data, said while he could understand Third Point's logic in seeking to unlock value in the company, doing it in practice would be difficult.</p><p>\"I probably would be against it,\" Pyle said. \"If it was easy to do, or even possible, then I'd be more interested. Don't get me wrong, I definitely see the logic and the appeal of what Third Point are suggesting because we need to see that hidden value crystalised somehow.\"</p><p>Breaking up the company would also likely hit the ability of Shell to provide the full range of services to companies in other sectors as they transition to a low-carbon economy, he added.</p><p>\"There are few companies out there where I would imagine the divisions are as kind of inter-locked and interwoven as they are at Shell, because they sit along a value chain and it's vertically integrated, and taking them out is difficult,\" he said.    </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Simon Jessop; editing by Rachel Armstrong)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:simon.jessop@thomsonreuters.com\" data-type=\"email\" translate=\"no\">simon.jessop@thomsonreuters.com</a> ; +44 (0) 207 542 5052; Reuters Messaging: Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://simon.jessop.thomsonreuters.com@reuters.net\">simon.jessop.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SHELL-RESULTS/ABRDN (URGENT)</p></div>"}