{"date": "2021-11-08 13:09:03.338000+00:00", "ticker": "ABDN", "mrkt_info": {"open": 263.9, "close": 262.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 6821RAberdeen Standard Equity Income Tst08 November 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>ABERDEEN STANDARD EQUITY INCOME TRUST PLC (the \"Company\")</span>\n</p>\n<p>\n<span>Legal Entity Identifier (LEI): 21380015XPT7BZISSQ74</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>8 November 2021</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The Company announces that it is satisfied, by virtue of the points listed below, that all inside information which the Directors and the Company may have in the closed period which ends on the date of the announcement of the Annual Financial Report for the 12 months ended 30 September 2021 has been notified to a Regulated Information Service (\"RIS\"). The Company is therefore not prohibited from dealing in its own securities during this period.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>In so stating the Company has regard to:</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>1) <span>the announcement on 6 October 2021 of the net asset value per share as of the close of business on 30 September 2021;</span>\n</span>\n</p>\n<p>\n<span>2) <span>the Company's belief, following reasonable enquiries, that there will be no material difference between the information published on 6 October 2021 and that to be included in the forthcoming announcement of the Annual Financial Report;</span>\n</span>\n</p>\n<p>\n<span>3) <span>the Company's practice of calculating net asset values per share each business day and the announcement of these net asset values to an RIS;</span>\n</span>\n</p>\n<p>\n<span>4) <span>there being no other unpublished information which constitutes price-sensitive information in respect of the Company's securities; and</span>\n</span>\n</p>\n<p>\n<span>5) <span>there being no unquoted investments within the Company's portfolio.</span>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Aberdeen Asset Management PLC</span>\n</p>\n<p>\n<span>Company Secretary</span>\n</p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>CMCEAAFPESLFFFA</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}