{"date": "2021-11-24 16:32:48.417000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3580.04, "close": 3504.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>We're only a couple of days away from Black Friday 2021 and this deal on the Apple AirPods Pro from Amazon is too good to miss. Some of the best savings online can be found at Amazon, which features the biggest price cut on one of the best and most popular pairs of headphones: the Apple AirPods Pro.</p></div><div class=\"tr-npp-body\"><p><span><span>Tackle your holiday shopping with deals and expert advice delivered straight to your phone.</span> Sign up for text message alerts from the deal-hunting team at Reviewed.</span> </p><p>The online shopping giant is selling the latest model of the AirPods Pro—which have generally retailed between $200 and $230 for previous models—with wireless charging case for $159. This is the lowest price we've ever seen (beating out the deal we published yesterday by $10) for this new version of the buds adds MagSafe. This means you can hold the earbuds near a MagSafe charger and they will snap firmly into place and start charging. </p><p>In our testing, the previous model of the AirPods Pro earned a place on our list of the best wireless headphones, as well as our ranking of the best headphones overall, for their great battery life, incredible noise cancellation and comfortable fit for most ears. The Pros connected to devices easily and the silicon ear tips that come with purchases come in multiple sizes to match your preferred fit. The AirPod Pros also have Active Noise Cancelation, which registers environmental noise around you and automatically dampens it, making them an excellent companion for both traveling and working from home. (If you plan on taking your earbuds on the go, you may want to consider Apple's $29 AppleCare+ for headphones—while it doesn't cover loss, AppleCare+ does provide repair or replacement for a fee of $29 for up to two accidental damage incidents during the covered period.)</p><p>If you're looking for a holiday gift that'll truly wow your loved ones, the Apple AirPods Pro are hard to beat. Be warned: this is a blockbuster deal and may sell out fast.</p><p class=\"tr-npp-section-title\">Get the Apple AirPods Pro at Amazon for $159 (save $90).</p><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Back in stock! Apple AirPods Pro are selling for a massive $90 discount during Black Friday</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}