{"date": "2021-12-15 17:03:16.542000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3381.83, "close": 3377.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Believe it or not, some of your favorite celebrities shop on Amazon—or at least are big fans of products you can buy from the mega retailer. And some of those star-worthy picks make for great gifts this holiday season, whether you're shopping for Mom or looking for a present for your boyfriend.</p></div><div class=\"tr-npp-body\"><p>Below are 12 of the best celebrity-loved gifts you can get on Amazon right now, including Kate Middleton's trendy New Balance sneakers, Chrissy Teigen's beloved Barefoot Dreams blanket and the KitchenAid stand mixer Jennifer Garner can't stop using.</p><p><span><span>Tackle your holiday shopping</span> with deals and expert advice delivered straight to your phone. Sign up for text message alerts from the deal-hunting team at Reviewed.</span> </p><p class=\"tr-npp-section-title\">1. Chrissy Teigen's Barefoot Dreams throw blanket</p><p>Chrissy Teigen loves the Barefoot Dreams CozyChic throw blanket so much that she says she uses it every single day. We've tried it out here at Reviewed and can attest to just how soft and snuggly it is. It's exactly what you or your giftee will want to curl up with all winter—but it sells out fast, so don't hesitate to add to your cart while you still can.</p><p><span>Get the Barefoot Dreams CozyChic Barefoot in The Wild Throw from Amazon for $180</span> </p><p class=\"tr-npp-section-title\">2. Jennifer Garner's KitchenAid stand mixer</p><p>If you've ever watched one of Jennifer Garner's popular cooking videos on Instagram, you know that the actress is obsessed with her KitchenAid stand mixer. Our experts tested out the iconic appliance and found it to be the best stand mixer. Not only does it look sleek sitting on your countertop, it's also very durable and versatile—you can use it for everything from folding dough to making pasta. Many KitchenAids are already sold out on Amazon so you'll want to snag one fast.</p><p><span>Get the KitchenAid Artisan Mini Plus 3.5-Qt. Tilt-Head Stand Mixer from Amazon for $299.99</span> </p><p class=\"tr-npp-section-title\">3. Gwyneth Paltrow's Bioderma makeup remover</p><p>The skincare aficionado on your list will love this celebrity-favorite makeup remover. Its customer list includes Gwyneth Paltrow, Drew Barrymore, Victoria Beckham and Natalie Portman, to name a few. According to Page Six, Gwyneth says, \"It's unscented, doesn't dry your skin or sting, and gets rid of all your makeup with a few swipes. You're left with soft, clean skin.\"</p><p><span>Get the Bioderma Sensibio H2O Micellar Water Makeup Remover from Amazon for $14.99</span> </p><p class=\"tr-npp-section-title\">4. Matt Damon's Yeti cooler</p><p>Yeti is easily the most recognizable name in the cooler world—and for good reason. Even Matt Damon owns one: the Yeti Hopper, which our experts dubbed the best soft cooler you can buy. In testing, we found it to be incredibly durable and well-insulated. It kept ice cold for 3.5 days and was the only cooler with a leakproof zipper, which makes it perfect for toting around on the go.</p><p><span>Get the Yeti Hopper M30 Portable Soft Cooler from Amazon for $299.98</span> </p><p class=\"tr-npp-section-title\">5. Kate Middleton's New Balance sneakers</p><p>The 2,500+ people who have bought these popular New Balance Fresh Foam sneakers aren't the only ones who love them—Kate Middleton, Jennifer Garner and Reese Witherspoon are also big fans. Perfect for both athletic and everyday activities, the cushioned sneakers are always selling out and are praised for their flexible knit upper. Available in 24 pretty colors, from blush pink to muted teal, the shoes come in women's sizes 5 to 12.</p><p><span>Get the New Balance Women's Fresh Foam Cruz V2 Sneaker from Amazon for $67.41</span> </p><p class=\"tr-npp-section-title\">6. Jennifer Aniston's Hanky Panky underwear</p><p>Upgrade your underwear drawer with a pair (or two or three) of Jennifer Aniston's favorite thong. The Hanky Panky Original Rise Thong, which is made of a super soft and stretchy lace, has even been dubbed \"The World's Most Comfortable Thong.\" People who own the one-size-fits-all underwear—which comes in 60 stunning colors and prints—say it's a game-changer.</p><p><span>Get the Hanky Panky Signature Lace Original Rise Thong from Amazon for $22</span> </p><p class=\"tr-npp-section-title\">7. Justin Bieber's Crocs</p><p>With the revival of the ugly shoe trend, Crocs have been all the rage in 2021. Celebs like Justin Bieber, Ariana Grande and Nicki Minaj have all been spotted in the rubber clogs, which have more than 264,000 reviews on Amazon. Available in a rainbow of colors and in both men's and women's sizes, the waterproof clogs are as versatile as they are comfortable. I own multiple pairs and wear them all the time, from running errands to boating.</p><p><span>Get the Crocs Classic Clog from Amazon for $26.99</span> </p><p class=\"tr-npp-section-title\">8. Drew Barrymore's Lele Sadoughi headband</p><p>A headband that not only looks cute but also is comfortable enough to wear all day without a painful headache? We'll take one in every color, please. That's why Lele Sadoughi headbands have such a passionate fanbase, including celebs like Drew Barrymore, Hilary Duff, Kate Middleton and Naomi Campbell. While only a few are available on Amazon, you can find the hairpieces in a number of gorgeous styles at Lele Sadoughi, from the classic pearl-studded to bold leopard print.</p><p><span>Get the Lele Sadoughi Women's Classic Black Headband from Amazon for $49</span> </p><p class=\"tr-npp-section-title\">9. Jessica Alba's silk pillowcase</p><p>Few things are as luxurious as slipping into silk sheets. Rather than spend a ton on a whole new sheet set, however, you can get a similar effect by swapping out your cotton pillowcases for silk ones. Jessica Alba loves the Slip silk pillowcase, which comes in 10 pretty shades and claims to be better for your hair and your skin (no more creasing, wrinkles or bedhead!).</p><p><span>Get the Slip Silk Queen Pillowcase from Amazon for $89</span> </p><p class=\"tr-npp-section-title\">10. Khloe Kardashian's water bottle</p><p>If you or your giftee has a goal of drinking more water in 2022, Khloe Kardashian's favorite water bottle can help you accomplish that. The reality TV star has posted plenty of Instagram stories toting around this gallon bottle, which comes in 10 beautiful gradient colors and boasts motivational quotes along with time markers to encourage you to drink up throughout the day.</p><p><span>Get the Giotto 1-Gallon Motivational Water Bottle from Amazon for $20.99</span> </p><p class=\"tr-npp-section-title\">11. Mindy Kaling's grill cleaner</p><p>One of the things that actress and comedian Mindy Kaling purchased during Amazon's Prime Day sale? The Better Grillin' Scrubbin' Stone. With more than 4,200 rave reviews, the unique grill cleaner is made of recycled glass and can remove the most baked-on grease and grime from your grill with very little effort on your part. Many reviewers say it's more effective than a regular old grill brush.</p><p><span>Get the Better Grillin' Scrubbin' Stone Grill Cleaner from Amazon for $8.76</span> </p><p class=\"tr-npp-section-title\">12. Rihanna's Bioré pore strips</p><p>Rihanna's makeup artist says she swears by these Bioré pore strips, which have nearly 30,000 reviews on Amazon. They're a convenient way to clear up your skin in a pinch—all you have to do is put the strip over your nose, wait 10 minutes and it will remove blackheads, clogged pores and oil.</p><p><span>Get the Bioré Original Deep Cleansing Pore Strips from Amazon for $7.14</span> </p><p><span><span>Don't get thwarted by shipping delays or sold-out favorites this holiday season.</span>  Sign up for our free weekly newsletter and get the product reviews, deals and holiday gift guides you need to start shopping now.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: 12 celebrity-approved gifts you can get on Amazon right now</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}