{"date": "2022-02-23 11:55:36.218000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Mumbai</p></div><div class=\"tr-npp-lead\"><p>Mumbai, Feb. 23 -- The Supreme Court on Wednesday directed Amazon and Future Group to approach the National Company Law Appellate Law Tribunal (NCLAT) to expeditiously decide on global e-commerce giant's appeal against the Competition Commission of India's (CCI) 17 December order that suspended its deal with Future Coupons Pvt Ltd for \"misrepresentation of facts\".</p><p>The Chief Justice of India Justice NV Ramana observed that \"the current special leave petition in one way connects to the outcome of the CCI order challenged before the NCLAT.\"</p></div><div class=\"tr-npp-body\"><p>\"We therefore direct both the parties to request the NCLAT to dispose off the matter at the earliest\", he added.</p><p>On 9 January, Amazon approached the NCLAT, challenging the CCI's 17 December order suspending the approval of Rs.1,431-crore deal between Amazon and Future Coupons Pvt. Ltd.</p><p>The anti-trust watchdog had also imposed a Rs.202 crore fine on Amazon and said that the deal has been kept in 'abeyance'.</p><p>The anti-trust watchdog's order alleged that Amazon tried to 'suppress and misrepresent' the facts of the deal. However, CCI granted time to Amazon to seek fresh approval for the deal.</p><p>On Wednesday, CJI N V Ramana was hearing a matter pertaining to Delhi High Court's January order that stayed the arbitration proceedings before the arbitral tribunal over Future Group's merger with Reliance Industries.</p><p>The matter is pending before the Supreme Court and will now be taken up on March 3. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}