{"date": "2022-01-12 08:40:49+00:00", "ticker": "ABDN", "mrkt_info": {"open": 241.4, "close": 244.2}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Selena  Li</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">HONG KONG, Jan 12 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>British fund manager abrdn <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ABDN.L\" data-type=\"ric\" data-ric=\"ABDN.L\" translate=\"no\" dir=\"ltr\">ABDN.L</a> is seeking a partner in China for its foray into the wealth management business, its chairman said, potentially joining a growing list of global financial firms eyeing a bigger share of that market.</p><p>A string of foreign names including BlackRock <a href=\"reuters://REALTIME/Verb=FullQuote/ric=BLK.N\" data-type=\"ric\" data-ric=\"BLK.N\" translate=\"no\" dir=\"ltr\">BLK.N</a>, Amundi <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMUN.PA\" data-type=\"ric\" data-ric=\"AMUN.PA\" translate=\"no\" dir=\"ltr\">AMUN.PA</a>, Schroders <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SDR.L\" data-type=\"ric\" data-ric=\"SDR.L\" translate=\"no\" dir=\"ltr\">SDR.L</a>, BNP Paribas <a href=\"reuters://REALTIME/Verb=FullQuote/ric=BNPP.PA\" data-type=\"ric\" data-ric=\"BNPP.PA\" translate=\"no\" dir=\"ltr\">BNPP.PA</a>, and UBS <a href=\"reuters://REALTIME/Verb=FullQuote/ric=UBSG.S\" data-type=\"ric\" data-ric=\"UBSG.S\" translate=\"no\" dir=\"ltr\">UBSG.S</a> have moved towards forming majority-owned wealth management ventures since Beijing first permitted it in 2019.</p><p>\"In the wealth asset management space (in China), we would like to find the appropriate partner,\" Douglas Flint, chairman of the Edinburgh-based fund manager, created via a merger of asset managers Standard Life and Aberdeen in 2017, said.</p><p>\"Foreign majority ownership partnerships with Chinese institutions is the way that many firms are going in. That's certainly something that we will look very carefully at,\" he told Reuters.</p><p>China's wealth management market reached 27.9 trillion yuan ($4.4 trillion) as of September last year, up 7.8% from end-2020. Chinese banks dominate the distribution of proprietary and third-party wealth products in the country.</p><p>\"The change in regulation allowing greater access to the end consumer has made China a much more interesting market for people that want to deploy resources,\" Flint said.</p><p>Abrdn was among the first batch of foreign fund managers to establish a fully-owned investment management unit in China in 2016 which can only serve professional investors. It also owns a 50% stake in a local insurance unit established in 2003.</p><p>Globally, abrdn's mutual funds and exchange traded funds - most of which are actively managed portfolios - still struggle to retain assets, with a total estimated outflow of $10.7 billion recorded in the first three quarters of 2021, according to Morningstar data.</p><p>About 18 months after former Citi banker Stephen Bird assumed the role as abrdn CEO, the firm is seeking new revenue streams to diversify from heavy reliance on traditional asset management only catering to certain institutions, Flint said.</p><p>Traditional asset managers in developed markets have been rushing to extend influence in the client-facing wealth segment, faced with fee squeeze and rise in passive investment.</p><p>\"Passive continues to grow in a world where it's been difficult for active asset managers to demonstrate the value of active management,\" he said.</p><p>In December last year, abrdn agreed to <a href=\"https://www.reuters.com/markets/europe/british-asset-manager-abrdn-buy-interactive-investor-2-bln-2021-12-02\" data-type=\"url\" class=\"tr-link\" translate=\"no\">buy</a> an investment platform interactive investor for 1.49 billion pounds ($1.98 billion) in cash, as traditional asset managers seek to build up customers using online providers.</p><p>Flint believes the unit will be the flagship element of abdrn's presence in the direct-to-consumer market, where service providers have to \"get closer\" to the younger generation of investors who demand greater autonomy.</p><p>($1=6.3740 Chinese yuan)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Selena Li, additional reporting by Carolyn Cohn; Editing by Sumeet Chatterjee and Jacqueline Wong)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Selena.Li@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Selena.Li@thomsonreuters.com</a> ; +852 39525868; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WEALTH-CHINA/</p></div>"}