{"date": "2021-12-17 03:01:48.555000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3466.3, "close": 3400.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon and Arlington County will offer $310 million in loans to a developer to preserve affordable housing at a massive apartment complex near Columbia Pike, aiming to keep more than 1,300 units within reach for middle- and low-income residents in the shadow of the tech company's second headquarters.</p><p>Tenants at the 60-acre Barcroft Apartments had expressed concerns that they could be displaced from the property — in a slice of Northern Virginia where low rents are rapidly disappearing — after it went up for sale earlier this fall.</p></div><div class=\"tr-npp-body\"><p>County officials described the Barcroft site as the largest \"naturally occurring\" affordable housing complex in Arlington. Although the property is not part of the county's affordable housing portfolio, Barcroft is still considered affordable for renters making significantly less than the median income in the region.</p><p>\"There's no protections on affordability or the tenancy of households that are living there now,\" said Anne Venezia, Arlington's housing director. By using county and Amazon loans to keep rents low, \"it provides more certainty for those families.\"</p><p>The deal, which came together in weeks, offers several forms of financing to Jair Lynch Real Estate Partners, which is set to purchase the property from the family that built it. A spokeswoman for the developer declined to comment on how much it is going to pay for the property.</p><p>The deal will require Jair Lynch to keep rents affordable for 99 years for families making 60 percent of the area's median income, which translates to $54,180 for an individual living alone, or $77,400 for a family of four. The developer is allowed to explore building additional units on the property.</p><p>The Barcroft deal marks the latest step in Amazon's $2 billion effort to create and preserve affordable homes in D.C., Nashville and Seattle — three expensive metro areas where the company maintains its largest footprints. (Amazon founder Jeff Bezos owns The Washington Post.)</p><p>The tech giant is building its second headquarters about three miles from Barcroft. That has spurred concerns about how it may affect the few working-class communities left in Arlington, which is already one of the wealthiest and densest counties nationwide. Since 2000, Arlington has lost more than 13,000 privately owned market-rate affordable units, Venezia said.</p><p>Amazon expects to fill its new offices with 25,000 employees over the next decade, including 3,500 who have already been hired. The company stands to receive up to $773 million in subsidies from local and state governments if it meets hiring goals.</p><p>Nupur Chowdhury, a Bangladeshi immigrant who lives at Barcroft, had a mixed reaction to the deal. An organizer with the ACE Collaborative, an organization for Arlington's working-class Asians and Asian Americans, he said any effort to preserve affordability at the complex was a \"good deal.\"</p><p>But with Jair Lynch still able to raise rents by up to 3 percent annually starting in one year, he feared that it could also price out many of his neighbors who were hit hard by the coronavirus pandemic. A mix of immigrants from Asia, Africa and Latin America, many people remain underemployed, he said, working as Lyft and Uber drivers or part time in hotels.</p><p>County officials and Amazon \"are thinking about multicultural diversity, and that's a good thing,\" he said. \"But after two years or three years, how will it be effective for whoever is living in Barcroft?\"</p><p>Before the pandemic, Chowdhury and his wife made close to $80,000 a year while working at a hotel chain and a convenience store, but their income has dropped to about $65,000.</p><p>The family of four pays $1,550 for a two-bedroom apartment and utilities at Barcroft, he said. Under the deal, their rent would be capped at $1,934 a month.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 The Washington Post</p></div>"}