{"date": "2022-02-07 16:56:51.666000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_jh325m8j&amp;referenceId=tag:reuters.com,2022:newsml_OVFXEKCY3_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_jh325m8j&amp;referenceId=tag:reuters.com,2022:newsml_OVFXEKCY3_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: Peloton Interactive Inc has drawn interest from potential buyers including e-commerce giant Amazon.com Inc, according to a person familiar with the matter, as the exercise bike maker struggles to maintain pandemic-fueled growth. Gloria Tso reports.<br/>Short Link: <a href=\"https://refini.tv/35GyCm8\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/35GyCm8</a><br/><br/>Video Transcript:<br/><br/>Shares of exercise bike maker Peloton have surged more than 30% on reports of a potential deal with e-commerce giant Amazon. A source familiar with the matter told Reuters Amazon is exploring an offer for the embattled company, which saw a surge in sales during lockdowns that has since petered out. Meanwhile, the Financial Times reported late on Friday that sportswear titan Nike is also evaluating a bid for Peloton, citing people briefed on the matter, who said the considerations were preliminary and that Nike hasn't held talks with Peloton. Peloton has not yet decided whether it will consider a sale and did not immediately respond to Reuters' request for comment. Neither did Nike, while Amazon declined to comment. First reported by the Wall Street Journal, the potential Amazon deal comes days after investor Blackwells Capital urged Peloton's board to sack its CEO and put itself up for sale. Peloton has tried to cushion the blow to its growth by reviewing the size of its workforce, \"resetting\" production levels, cutting the price of its popular bike and ramping up its ad spending, but growth remains stagnant. The reports also come on the heels of a blockbuster week for Amazon, which logged the largest ever leap in value for a US company Friday, surging a record $190 billion by end of trading.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}