{"date": "2021-11-04 13:58:12.638000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>BCE INC (\"BCE-TN\")\n- Third Quarter 2021 Results\n\n     BCE Inc. reported results for the third quarter (Q3) of 2021.\n\n     \"With a clear strategic roadmap to build back from the impacts of\nCOVID-19 and invest in the growth opportunities ahead, our team delivered\npositive performances across all Bell operating segments in Q3. Bell's\nleading fibre and 5G broadband networks, and the wireline, wireless and\nmedia innovations they enable, are clearly delivering the connections\nCanadian consumers and business customers need as we all work to recover\nfrom the impacts of the COVID crisis,\" said Mirko Bibic, President and CEO\nof BCE Inc. and Bell Canada.\n\n     \"As pace of our recovery from the crisis quickens, the strong demand\nfor the speed and connectivity advantages of Bell's leading networks and\nservices is clearly reflected in our Q3 results. Our fast-growing fibre\nnetwork powered Bell's best quarterly retail Internet net subscriber\nactivations in 15 years and a 9% increase in residential Internet revenue\nas we also grew IPTV net subscriber activations by 68%. At the same time,\nthe unparalleled performance advantages of Bell's wireless networks drove a\n46% increase in postpaid mobile phone net additions and exceptional growth\nin service revenue and adjusted EBITDA.\"\n\n     \"The Bell team has achieved our objective to steadily improve results\neach quarter since Q2 2020, when our business experienced its heaviest\nimpacts from the COVID crisis. We have grown total revenue and adjusted\nEBITDA back to the levels of pre-pandemic Q3 2019 while at the same time\nsignificantly accelerating our next-generation network infrastructure\ninvestments to help our customers and company come back better from the\nCOVID crisis. As reflected in the Bell for Better initiative, including the\nhistoric two-year $1.7 billion acceleration in our 5G, fibre and rural\nnetwork rollouts, the Bell team is committed to championing customer\nexperience, investing in our communities and driving our country's ongoing\nrecovery and resurgence.\"\n\n     KEY BUSINESS Developments\n\n     Building the best network: Canada's fastest 5G Executing our\naccelerated network investment plan with a 12.4% increase in capital\nexpenditures in Q3, Bell network rollouts included pure fibre Internet for\n52 smaller communities in Manitoba, Ontario, Quebec and the Atlantic\nprovinces and Bell 5G in communities large and small across multiple\nprovinces. Bell is on track to meet or exceed our 2021 targets for new\nfibre and Wireless Home Internet locations passed, and to offer 5G coverage\nto more than 70% of the national population by the end of the year.\n\n     PCMag again determined that Bell's mobile networks are the fastest in\nthe country in its latest national network performance tests, while Global\nWireless Solutions (GWS) ranked Bell 5G as Canada's best. With the most\nawarded 5G network in Canada, Bell is driving the next generation of mobile\ninnovation including the expansion of TSN 5G View / Vision 5G RDS access to\nToronto Raptors home games in addition to regional coverage of the Montreal\nCanadiens and Toronto Maple Leafs; a 5G collaboration with Tiny Mile for\nits fleet of food delivery robots in downtown Toronto; and a partnership\nwith TikTok Canada to power its unique Paint Portal multi-user Augmented\nReality effect.\n\n     Leading the digital transformation of Canadian business Building on\nBell's strategic agreement with Amazon Web Services (AWS) to accelerate 5G\ninnovation and cloud adoption, we're working with VMware Cloud and AWS to\nsupport enterprise business and government organizations in managing their\nhybrid cloud strategies. Bell is also offering enterprise customers a\nportfolio of Software-as-a-Service (SaaS) solutions to support their\ndigital transformations, including Smart Supply Chain by Bell IoT Smart\nConnect for fleet and supply chain operators. We're also working with Esri,\nCanada's leading geographic information system (GIS) provider, on the Bell\nIntegrated Smart City Ecosystem and with international AI-powered contact\ncentre software provider NICE, to expand access to NICE CXone for Contact\nCentre as a Service in Canada.\n\n     Expanding consumer choice with service innovation, compelling content\nDelivering new options for mobility and media customers, Virgin Plus\nreduced pricing on mobile data plans, achieving the federal government's\n25% price reduction target well ahead of the January 2022 deadline, and\nBell Media announced Crave Mobile, offering access to the streaming\nservice's unparalleled content library on a single mobile device, and Crave\nTotal for multiple user access across a full range of screens.\n\n     Canada's top-ranked sports networks TSN and RDS are delivering more\nmajor league sports action this fall-winter season including the Toronto\nRaptors, the CFL, and the NFL on CTV as well as TSN and RDS. CTV Comedy\nChannel remained Canada's most watched entertainment specialty channel for\nthe third year in a row, while Noovo continues to lead viewership growth in\nconventional French-language TV. The Noovo Info news service aired its\nfirst French-language federal leaders debate and election night coverage\nalongside CTV's coverage in English. Reflecting a focus on accelerating\ndigital revenue growth, Bell Media launched the Bell DSP ad-tech platform\nwith advanced advertising company Xandr.\n\n     Bell for Better: Mental health in the community To mark Mental Illness\nAwareness Week, Bell Let's Talk announced the 113 recipients of the 2021\nBell Let's Talk Community Fund in every region of Canada, including South\nand Central Health Foundation in Grand Falls-Windsor, Newfoundland and\nLabrador; Legacy of Hope Foundation in Gloucester, Ontario; and Le Centre\nde Prevention du Suicide (CPS) Cote-Nord in Baie-Comeau, Quebec. Bell Let's\nTalk also introduced a mental health podcast series featuring mental health\nexperts and guests from Black, Indigenous and People of Colour (BIPOC)\ncommunities, and a mobile app in partnership with Strongest Families\nInstitute (SFI) to enhance access to SFI's proven mental health programs\nfor remote communities.\n\n     Bell continues to abide by its COVID-19 operating principles and all\ngovernment protocols, with a focus on protecting the health and safety of\nour customers, colleagues and communities. In preparation for a gradual and\nvoluntary return to Bell office locations for more team members this fall,\nwe introduced the Bell Workways program to provide many of our employees\nwith flexible remote and mobile work options and are implementing a\nmandatory vaccination policy for Bell team members nationally.\n\n     BCE Q3 RESULTS\n\n     Financial Highlights\n\n//st\n\n($ millions except per share amounts)         Q3 2021   Q3 2020   % change\n(unaudited)\n\nBCE\n\nOperating revenues                            5,836     5,787     0.8%\n\nNet earnings                                  813       740       9.9%\n\nNet earnings attributable to common           757       692       9.4%\nshareholders\n\nAdjusted net earnings                         748       712       5.1%\n\nAdjusted EBITDA                               2,558     2,454     4.2%\n\nNet earnings per common share (EPS)           0.83      0.77      7.8%\n\nAdjusted EPS                                  0.82      0.79      3.8%\n\nCash flows from operating activities          1,774     2,110     (15.9%)\n\nCapital expenditures                          (1,159)   (1,031)   (12.4%)\n\nFree cash flow(3)                             571       1,034     (44.8%)\n\n//et\n\n   \"Our consolidated Q3 financial results demonstrated another step forward\nin our COVID recovery and continued strong operational execution, including\nstrong residential wireline performance, industry-leading wireless service\nrevenue and adjusted EBITDA growth, and higher advertising revenue across\nall TV platforms. Total revenue and adjusted EBITDA are essentially back to\nQ3 2019 levels with BCE service revenue up 3.6% and adjusted EBITDA 4.2%\nhigher, contributing to a year-over-year increase in net earnings of 9.9%\ndespite ongoing COVID headwinds,\" said Glen LeBlanc, Chief Financial\nOfficer for BCE and Bell Canada.\n\n   \"With strong marketplace performance and free cash flow, bolstered by\nexceptional liquidity, a well-structured balance sheet and a net debt\nleverage ratio that is the lowest among our Canadian peers, Bell remains on\ntrack to meet our 2021 financial guidance targets, lead investment in\nnext-generation broadband networks and services, and deliver on our capital\nmarkets objectives for BCE shareholders.\"\n\n//st\n\n* BCE operating revenue was up 0.8% over Q3 2020 to $5,836 million, driven\n  by a 3.6% increase in service revenue to $5,099 million reflecting\n  year-over-year increases at all Bell operating segments. Product revenue\n  decreased 14.6% to $737 million, the result of fewer mobile device\n  transactions and lower business wireline data equipment sales.\n* Net earnings increased 9.9% to $813 million and net earnings attributable\n  to common shareholders totalled $757 million, or $0.83 per share, up 9.4%\n  and 7.8% respectively. The increases were driven by adjusted EBITDA\n  growth and higher other income due mainly to net mark-to-market gains on\n  derivatives used to economically hedge equity settled share-based\n  compensation. This was partly offset by increased depreciation and\n  amortization expense, higher severance, acquisition and other costs as\n  well as higher income taxes.\n* Adjusted net earnings were $748 million, or $0.82 per common share, up\n  5.1% and 3.8% respectively, from $712 million, or $0.79 per common share,\n  in Q3 2020.\n* Adjusted EBITDA grew 4.2% in Q3 to $2,558 million, driven by\n  year-over-year increases at all Bell operating segments. BCE's\n  consolidated adjusted EBITDA margin(2) increased 1.4 percentage points to\n  43.8% from 42.4% in Q3 2020, due to the flow-through of higher service\n  revenue and a 1.7% reduction in total operating costs that reflected a\n  year-over-year decrease in low-margin product sales and the\n  non-recurrence of a number of COVID-19 related expenses incurred last\n  year.\n* BCE capital expenditures increased 12.4% to $1,159 million, a capital\n  intensity(4) ratio of 19.9%, compared to 17.8% in Q3 2020. The\n  year-over-year increase in capital spending is consistent with our 2-year\n  program to accelerate the rollout of Bell's 5G, fibre and rural Wireless\n  Home Internet networks.\n* BCE cash flows from operating activities totalled $1,774 million, down\n  15.9% from Q3 2020, due to a reduction in cash from the timing of working\n  capital changes and higher income taxes paid, partly offset by higher\n  adjusted EBITDA.\n* Free cash flow decreased 44.8% to $571 million, compared to $1,034\n  million in Q3 2020, due to lower cash flows from operating activities,\n  excluding cash from discontinued operations and acquisition and other\n  costs paid, and higher capital expenditures.\n\n//et\n\n   Q3 OPERATING RESULTS BY SEGMENT\n\n   Bell Wireless\n\n//st\n\n* Total wireless operating revenue decreased 0.9% to $2,296 million, due to\n  lower year-over-year product revenue, partly offset by strong service\n  revenue growth.\n* Service revenue increased 5.0% to $1,654 million, the result of robust\n  mobile phone postpaid subscriber base growth over the past year, driven\n  by our disciplined focus on higher-value smartphone loadings and\n  continued strong demand for Bell's IoT solutions. Roaming revenue\n  increased modestly over Q3 2020, reflecting increased travel due to\n  easing of COVID-19 restrictions.\n* Product revenue was down 13.6% to $642 million, due to a reduction in\n  sales transaction volumes attributable to fewer customer device upgrades\n  and a greater mix of bring-your-own-device customer activations.\n* Wireless adjusted EBITDA increased 5.6% to $1,010 million, reflecting the\n  flow-through of higher service revenue and a 5.6% reduction in operating\n  costs, consistent with lower product sales, which delivered a 2.8\n  percentage point margin increase to 44.0%.\n* Bell added 136,464 total net new postpaid and prepaid mobile phone\n  subscriber activations, up 14.3% from 119,345 in Q3 2020.\n* Postpaid mobile phone net subscriber activations were up 45.9% to 114,821\n  from 78,706 in Q3 2020. The notable increase was driven by a 9.0%\n  increase in gross subscriber activations, reflecting pent-up customer\n  demand and greater consumer traffic from the reopening of all retail\n  stores compared to last year's COVID-19 restrictions, and higher direct\n  and digital channel sales volumes. Postpaid mobile phone customer\n  churn(4) improved 5 basis points to 0.93%, representing our best-ever Q3\n  result.\n* Prepaid mobile phone net subscriber activations were 21,643, down from\n  40,639 in Q3 2020. This result can be attributed to a 9.9% decrease in\n  gross activations from lower market activity due to the ongoing slowdown\n  in immigration and international travel during COVID-19. Mobile phone\n  prepaid customer churn increased 17 basis points to 4.15%, reflecting\n  greater competitive intensity in the discount mobile market.\n* Bell's mobile phone customer base totalled 9,349,459 at the end of Q3\n  2021, a 2.7% increase over last year, comprising 8,520,518 postpaid\n  subscribers, up 3.2%, and 828,941 prepaid customers, down 2.2% compared\n  to Q3 2020.\n* Blended mobile phone average billing per user (ABPU)(4) was up 1.1% to\n  $74.07, driven by greater customer adoption of higher-value rate plans,\n  including unlimited data plans, and a modest year-over-year increase in\n  roaming.\n* Mobile connected device net activations were down 19.9% to 33,035,\n  despite strong growth in Bell's business IoT net connections, due to\n  higher data device net losses as we continue de-emphasizing unprofitable,\n  low-ABPU tablet transactions. Mobile connected device subscribers\n  totalled 2,210,796 at the end of Q3 2021, an increase of 13.0% over last\n  year.\n\n//et\n\n   Bell Wireline\n\n//st\n\n* Total wireline operating revenue decreased 0.6% to $3,015 million.\n* Wireline service revenue was up 0.3% to $2,920 million, the result of a\n  9.1% increase in residential Internet revenue that was partly offset by\n  lower business markets revenue due to exceptionally high demand in Q3\n  2020 for conferencing services, remote collaboration tools and voice\n  connectivity as a result of work-at-home protocols enacted by Canadian\n  enterprises because of COVID-19 restrictions.\n* Product revenue decreased 21.5% to $95 million, due to higher sales of\n  data equipment in Q3 2020 as large enterprise and government sector\n  customers spent on capacity and network facilities to connect more\n  employees working remotely, as well as the timing of data equipment sales\n  in 2021.\n* Wireline adjusted EBITDA grew 1.0% to $1,333 million, reflecting a 1.8%\n  reduction in operating costs that contributed to a 0.7 percentage-point\n  improvement in margin to 44.2%.\n* Bell added 65,779 net retail Internet subscribers, 4.6% more than Q3\n  2020. This represents our best quarterly result in 15 years, driven by\n  the accelerated buildout of Bell's all-fibre and Wireless Home Internet\n  service footprints, and a more active back-to-school period compared to\n  last year. Retail Internet subscribers totalled 3,814,035 at the end of\n  Q3, a 4.2% increase over Q3 last year.\n* Bell TV added 31,641 net new retail IPTV subscribers, up 68.0% from\n  18,837 in Q3 2020. This represents our best quarterly result in two\n  years, reflecting the success of our multi-brand strategy, including\n  standalone Fibe TV subscriptions and Fibe TV app streaming services, as\n  well as more typical back-to-school student market activity and more live\n  sporting programming this year. At the end of Q3, Bell served 1,853,250\n  retail IPTV subscribers, up 3.8% from last year.\n* Retail satellite TV net subscriber losses increased 10.4% to 21,120, due\n  to lower gross activations compared to last year. Bell's retail satellite\n  TV customer base totalled 875,711 at the end of Q3, down 8.1% compared to\n  last year.\n* Retail residential NAS net losses improved 14.1% to 42,755, reflecting\n  fewer customer deactivations during COVID-19. Bell's retail residential\n  NAS customer base totalled 2,338,816 at the end of Q3, a 7.8% decline\n  since Q3 2020.\n\n//et\n\n   Bell Media\n\n//st\n\n* Media operating revenue increased 14.5% in Q3 to $719 million, driven by\n  increased advertiser spending across TV, radio, out of home and digital\n  media platforms as the COVID-19 economic recovery takes hold more fully,\n  as well as higher subscriber revenue.\n* Adjusted EBITDA was up 20.8% to $215 million, resulting in a 1.6\n  percentage point increase in margin to 29.9%. This was driven by the\n  flow-through of higher year-over-year revenue, despite a 12% increase in\n  operating costs reflecting more live sports events and TV programming\n  compared to last year when COVID-19 related TV production shutdowns and\n  delays occurred, and the non-recurrence of Canada Emergency Wage Subsidy\n  (CEWS) funding received in Q3 2020.\n* Advertising revenue increased 18.6% this quarter, driven by stronger\n  conventional and specialty TV performance, due to a timelier start to the\n  new fall TV programming season, more live sporting events compared to\n  2020, and revenue generated from the recent federal election.\n* Subscriber revenue was up 12.3% in Q3, driven by a 5% year-over-year\n  increase in Crave subscribers. Digital revenue grew 32% due to rapid\n  expansion of CTV's AVOD product, continued scaling of the SAM TV media\n  sales tool and continued Crave growth.\n* TSN and RDS were Canada's top-ranked English and French-language sports\n  networks for Q3 and the full 2020/2021 broadcast year.\n* Bell Media's English-language entertainment specialty channels achieved\n  record rankings, with CTV Comedy, Discovery and CTV Drama claiming the\n  top 3 spots.\n* Noovo continued to gain viewership over its French-language competitors\n  with primetime audiences up 18% in the current fall TV season.\n\n//et\n\n   COMMON SHARE DIVIDEND BCE's Board of Directors has declared a quarterly\ndividend of $0.875 per common share, payable on January 15, 2022 to\nshareholders of record at the close of business on December 15, 2021.\n\n   OUTLOOK FOR 2021 BCE confirmed its financial guidance targets for 2021,\nas provided on February 4, 2021, as follows:\n\n//st\n\n                                 February 4 Guidance   November 4 Guidance\n\nRevenue growth                   2% - 5%               On track\n\nAdjusted EBITDA growth           2% - 5%               On track\n\nCapital intensity                18% - 20%             On track\n\nAdjusted EPS growth              1% - 6%               On track\n\nFree cash flow ($M)              $2,850 - $3,200       On track\n\nAnnualized common dividend       $3.50                 $3.50\nper share\n\n//et\n\n     During the third quarter of 2021, our financial and operating\nperformance continued to recover from the effects of COVID-19, due to our\noperational execution and the easing of government restrictions put in\nplace to combat the pandemic, which allowed many businesses to resume some\nlevel of, or increase, commercial activities in the latter part of Q2 2021.\nAs a result, the adverse impacts of COVID-19 on our sequential and\nyear-over-year performance were reduced. Additionally, it has been well\nover a year since the pandemic began affecting our performance and we have\nsince adapted many aspects of our business to better operate in this\nenvironment. The effects of COVID-19, although moderating, continued to\nunfavourably impact Bell Wireless product and roaming revenues, Bell\nWireline business markets equipment revenues, as well as Bell Media\nadvertising revenues during the quarter.\n\n     Due to uncertainties relating to the severity and duration of the\nCOVID-19 pandemic and possible resurgences in the number of COVID-19 cases,\nand various potential outcomes, it is difficult at this time to estimate\nthe impacts of COVID-19 on our business or future financial results and\nrelated assumptions. Our business and financial results could continue to\nbe unfavourably impacted, and could again become more significantly and\nnegatively impacted, in future periods. Notably, our wireless product\nrevenues and mobile phone and mobile connected devices gross additions may\nbe unfavourably impacted due to a global chip shortage attributable to the\nimpacts of the COVID-19 pandemic that is resulting in short-term supply\nchain disruptions and inventory constraints for consumer electronics and\nmobile devices, including smartphones and tablets. The extent to which\nCOVID-19 will continue to adversely impact us will depend on future\ndevelopments that are difficult to predict, including the prevalence of\nCOVID-19 variants that are more contagious and may lead to increased health\nrisks, the timely distribution of effective vaccines and treatments, the\npotential development and distribution of new vaccines and treatments, the\ntime required to achieve broad immunity, as well as new information which\nmay emerge concerning the severity and duration of the COVID-19 pandemic,\nincluding the number and intensity of resurgences in COVID-19 cases, and\nthe actions required to contain the coronavirus or remedy its impacts,\namong others. Please see the section entitled \"Caution Regarding\nForward-Looking Statements\" later in this news release for a description of\nthe principal assumptions on which BCE's 2021 financial guidance targets\nare based, as well as the principal related risk factors.\n\n     CALL WITH FINANCIAL ANALYSTS BCE will hold a conference call for\nfinancial analysts to discuss Q3 2021 results on Thursday, November 4 at\n8:00 am eastern. Media are welcome to participate on a listen-only basis.\nTo participate, please dial toll-free 1-800-806-5484 or 416-340-2217 and\nenter passcode 7661656#. A replay will be available until midnight on\nDecember 5, 2021 by dialing 1-800-408-3053 or 905-694-9451 and entering\npasscode 6228194#.\n\n     A live audio webcast of the conference call will be available on BCE's\nwebsite at BCE Q3-2021 conference call.\n\n     NOTES The information contained in this news release is unaudited.\n\n     (1) The terms adjusted net earnings and adjusted EPS do not have any\nstandardized meaning under IFRS. Therefore, they are unlikely to be\ncomparable to similar measures presented by other issuers. We define\nadjusted net earnings as net earnings attributable to common shareholders\nbefore severance, acquisition and other costs, net mark-to-market losses\n(gains) on derivatives used to economically hedge equity settled\nshare-based compensation plans, net losses (gains) on investments, early\ndebt redemption costs, impairment of assets and discontinued operations,\nnet of tax and non-controlling interest (NCI). We define adjusted EPS as\nadjusted net earnings per BCE common share. We use adjusted net earnings\nand adjusted EPS, and we believe certain investors and analysts use these\nmeasures, among other ones, to assess the performance of our businesses\nwithout the effects of severance, acquisition and other costs, net\nmark-to-market losses (gains) on derivatives used to economically hedge\nequity settled share-based compensation plans, net losses (gains) on\ninvestments, early debt redemption costs, impairment of assets and\ndiscontinued operations, net of tax and NCI. We exclude these items because\nthey affect the comparability of our financial results and could\npotentially distort the analysis of trends in business performance.\nExcluding these items does not imply they are non-recurring. The most\ncomparable IFRS financial measures are net earnings attributable to common\nshareholders and EPS. The following table is a reconciliation of net\nearnings attributable to common shareholders and EPS to adjusted net\nearnings on a consolidated basis and per BCE common share (adjusted EPS)\nrespectively.\n\n     ($ millions except per share amounts)\n\n//st\n\n                                 Q3 2021               Q3 2020\n\n                         TOTAL             PER SHARE   TOTAL     PER SHARE\n\nNet earnings attributable to     757       0.83        692       0.77\ncommon shareholders\n\nSeverance, acquisition and       36        0.04        19        0.02\nother costs\n\nNet mark-to-market (gains)       (45)      (0.05)      10        0.01\nlosses on derivatives used to\neconomically hedge equity\nsettled share-based\ncompensation plans\n\nNet losses (gains) on            -         -           (22)      (0.02)\ninvestments\n\nEarly debt redemption costs      -         -           16        0.02\n\nImpairment of assets             -         -           3         -\n\nNet earnings from                -         -           (6)       (0.01)\ndiscontinued operations\n\nAdjusted net earnings            748       0.82        712       0.79\n//et\n\n     (2) The terms adjusted EBITDA and adjusted EBITDA margin do not have\nany standardized meaning under IFRS. Therefore, they are unlikely to be\ncomparable to similar measures presented by other issuers. We define\nadjusted EBITDA as operating revenues less operating costs, as shown in\nBCE's consolidated income statements. Adjusted EBITDA for BCE's segments is\nthe same as segment profit as reported in Note 3, Segmented information, in\nBCE's Q3 2021 consolidated Financial Statements. We define adjusted EBITDA\nmargin as adjusted EBITDA divided by operating revenues. We use adjusted\nEBITDA and adjusted EBITDA margin to evaluate the performance of our\nbusinesses as they reflect their ongoing profitability. We believe certain\ninvestors and analysts use adjusted EBITDA to measure a company's ability\nto service debt and to meet other payment obligations or as a common\nmeasurement to value companies in the telecommunications industry. We\nbelieve that certain investors and analysts also use adjusted EBITDA and\nadjusted EBITDA margin to evaluate the performance of our businesses.\nAdjusted EBITDA is also one component in the determination of short-term\nincentive compensation for all management employees. Adjusted EBITDA and\nadjusted EBITDA margin have no directly comparable IFRS financial measure.\nAlternatively, the following table provides a reconciliation of net\nearnings to adjusted EBITDA.\n\n     ($ millions)\n\n//st\n\n                                 Q3 2021               Q3 2020\n\nNet earnings Severance,          813 50 902 245 272    740 26 876 232 279\nacquisition and other costs      5 - (35) 306 -        12 4 29 262 (6)\nDepreciation Amortization\nFinance costs Interest\nexpense Interest on\npost-employment benefit\nobligations Impairment of\nassets Other (income) expense\nIncome taxes Net earnings\nfrom discontinued operations\n\nAdjusted EBITDA                  2,558                 2,454\n\nBCE operating revenues           5,836                 5,787\n\nAdjusted EBITDA margin           43.8%                 42.4%\n\n//et\n\n        (3) The term free cash flow does not have any standardized meaning\nunder IFRS. Therefore, it is unlikely to be comparable to similar measures\npresented by other issuers. We define free cash flow as cash flows from\noperating activities, excluding cash from discontinued operations,\nacquisition and other costs paid (which include significant litigation\ncosts) and voluntary pension funding, less capital expenditures, preferred\nshare dividends and dividends paid by subsidiaries to NCI. We exclude cash\nfrom discontinued operations, acquisition and other costs paid and\nvoluntary pension funding because they affect the comparability of our\nfinancial results and could potentially distort the analysis of trends in\nbusiness performance. Excluding these items does not imply they are\nnon-recurring. We consider free cash flow to be an important indicator of\nthe financial strength and performance of our businesses because it shows\nhow much cash is available to pay dividends on common shares, repay debt\nand reinvest in our company. We believe certain investors and analysts use\nfree cash flow to value a business and its underlying assets and to\nevaluate the financial strength and performance of our businesses. The most\ncomparable IFRS financial measure is cash flows from operating activities.\nThe following table is a reconciliation of cash flows from operating\nactivities to free cash flow on a consolidated basis.\n\n   ($ millions)\n\n//st\n\n                                                         Q3 2021   Q3 2020\n\nCash flows from operating activities                     1,774     2,110\n\nCapital expenditures                                     (1,159)   (1,031)\n\nCash dividends paid on preferred shares                  (31)      (32)\n\nCash dividends paid by subsidiaries to NCI               (13)      (11)\n\nAcquisition and other costs paid                         -         13\n\nCash from discontinued operations (included in cash      -         (15)\nflows from operating activities)\n\nFree cash flow                                           571       1,034\n\n//et\n\n     (4) We use ABPU, churn, capital intensity and subscriber units to\nmeasure the success of our strategic imperatives. These key performance\nindicators are not accounting measures and may not be comparable to similar\nmeasures presented by other issuers.\n\n     (5) Available liquidity at September 30, 2021 was comprised of $2,167\nmillion in cash and cash equivalents, $400 million available under our\nsecuritized trade receivables programs and $3.5 billion available under our\ncommitted bank credit facilities.\n\n     CAUTION REGARDING FORWARD-LOOKING STATEMENTS Certain statements made\nin this news release are forward-looking statements. These statements\ninclude, without limitation, statements relating to BCE's financial\nguidance (including revenues, adjusted EBITDA, capital intensity, adjusted\nEPS and free cash flow), BCE's 2021 annualized common share dividend, our\nnetwork deployment and capital investment plans, including our two-year\nincreased capital investment program to accelerate the rollout of 5G, fibre\nand rural Wireless Home Internet networks, the potential impacts on our\nbusiness, financial condition, liquidity and financial results of the\nCOVID-19 pandemic, BCE's business outlook, objectives, plans and strategic\npriorities, and other statements that are not historical facts.\nForward-looking statements are typically identified by the words\nassumption, goal, guidance, objective, outlook, project, strategy, target\nand other similar expressions or future or conditional verbs such as aim,\nanticipate, believe, could, expect, intend, may, plan, seek, should, strive\nand will. All such forward-looking statements are made pursuant to the\n'safe harbour' provisions of applicable Canadian securities laws and of the\nUnited States Private Securities Litigation Reform Act of 1995.\n\n     Forward-looking statements, by their very nature, are subject to\ninherent risks and uncertainties and are based on several assumptions, both\ngeneral and specific, which give rise to the possibility that actual\nresults or events could differ materially from our expectations expressed\nin or implied by such forward-looking statements and that our business\noutlook, objectives, plans and strategic priorities may not be achieved.\nThese statements are not guarantees of future performance or events, and we\ncaution you against relying on any of these forward-looking statements. The\nforward-looking statements contained in this news release describe our\nexpectations as of November 4, 2021 and, accordingly, are subject to change\nafter such date. Except as may be required by applicable securities laws,\nwe do not undertake any obligation to update or revise any forward-looking\nstatements contained in this news release, whether as a result of new\ninformation, future events or otherwise. From time to time, we consider\npotential acquisitions, dispositions, mergers, business combinations,\ninvestments, monetizations, joint ventures and other transactions, some of\nwhich may be significant. Except as otherwise indicated by us,\nforward-looking statements do not reflect the potential impact of any such\ntransactions or of special items that may be announced or that may occur\nafter November 4, 2021. The financial impact of these transactions and\nspecial items can be complex and depends on the facts particular to each of\nthem. We therefore cannot describe the expected impact in a meaningful way\nor in the same way we present known risks affecting our business.\nForward-looking statements are presented in this news release for the\npurpose of assisting investors and others in understanding certain key\nelements of our expected financial results, as well as our objectives,\nstrategic priorities and business outlook, and in obtaining a better\nunderstanding of our anticipated operating environment. Readers are\ncautioned that such information may not be appropriate for other purposes.\n\n     Material Assumptions A number of economic, market, operational and\nfinancial assumptions were made by BCE in preparing its forward-looking\nstatements contained in this news release, including, but not limited to\nthe following:\n\n     Canadian Economic Assumptions Our forward-looking statements are based\non certain assumptions concerning the Canadian economy, which in turn\ndepend on important assumptions about how the COVID-19 pandemic will\nevolve, including the progress of the vaccination rollout. Notably, it is\nassumed that most public health restrictions in Canada are eased by the end\nof 2021 and pandemic-related effects on consumer demand for goods and\nservices diminish gradually over time. In particular, we have assumed:\n\n//st\n\n* Strong rebound in economic growth as the economy recovers from the\n  effects of the pandemic and related restrictions, given the Bank of\n  Canada's most recent estimated growth in Canadian gross domestic product\n  of around 5% on average in 2021\n* Household consumption growth as the pandemic recedes and consumer\n  confidence rises\n* Strengthening business investment outside the oil and gas sector as\n  demand increases and business confidence improves\n* Employment gains expected in 2021, despite ongoing challenges in some\n  sectors\n* Accelerating trend toward e-commerce\n* Low immigration levels until the majority of international travel and/or\n  health-related restrictions are lifted\n* Prevailing low interest rates expected to remain at or near current\n  levels for the foreseeable future\n* Canadian dollar expected to remain at or near current levels. Further\n  movements may be impacted by the degree of strength of the U.S. dollar,\n  interest rates and changes in commodity prices\n\n//et\n\n   Canadian Market Assumptions Our forward-looking statements also reflect\nvarious Canadian market assumptions. In particular, we have made the\nfollowing market assumptions:\n\n//st\n\n* A consistently high level of wireline and wireless competition in\n  consumer, business and wholesale markets\n* Higher, but slowing, wireless industry penetration\n* A shrinking data and voice connectivity market as business customers\n  migrate to lower-priced telecommunications solutions or alternative\n  over-the-top (OTT) competitors\n* While the advertising market continues to be adversely impacted by\n  cancelled or delayed advertising campaigns from many sectors due to the\n  economic downturn during the COVID-19 pandemic, we do expect gradual\n  recovery in 2021\n* Declines in broadcasting distribution undertakings (BDU) subscribers\n  driven by increasing competition from the continued rollout of\n  subscription video on demand streaming services together with further\n  scaling of OTT aggregators\n\n//et\n\n   Assumptions Concerning our Bell Wireless Segment Our forward-looking\nstatements are also based on the following internal operational assumptions\nwith respect to our Bell Wireless segment:\n\n//st\n\n* Maintain our market share of national operators' wireless postpaid net\n  additions\n* Modest growth of our prepaid subscriber base\n* Continued focus on mobile phone subscriber growth, as well as the\n  introduction of more 5G, 4G Long-term evolution (LTE) and LTE Advanced\n  devices and new data services\n* Continued deployment of 5G wireless network offering coverage that is\n  competitive with other national operators in centres across Canada\n* Increased subscriber acquisition and retention spending\n* Unfavourable impact on mobile phone blended ABPU, driven by reduced\n  outbound roaming revenue due to travel restrictions as a result of the\n  COVID-19 pandemic and reduced data overage revenue due to continued\n  adoption of unlimited plans\n* Increased adoption of unlimited data plans and device financing plans\n* No material financial, operational or competitive consequences of changes\n  in regulations affecting our wireless business\n\n//et\n\n   Assumptions Concerning our Bell Wireline Segment Our forward-looking\nstatements are also based on the following internal operational assumptions\nwith respect to our Bell Wireline segment:\n\n//st\n\n* Continued growth in retail Internet and IPTV subscribers\n* Increasing wireless and Internet-based technological substitution\n* Continued aggressive residential service bundle offers from cable TV\n  competitors in our local wireline areas\n* Continued large business customer migration to IP-based systems\n* Ongoing competitive repricing pressures in our business and wholesale\n  markets\n* Continued competitive intensity in our small and medium-sized business\n  markets as cable operators and other telecommunications competitors\n  continue to intensify their focus on business customers\n* Traditional high-margin product categories challenged by large global\n  cloud and OTT providers of business voice and data solutions expanding\n  into Canada with on-demand services\n* Accelerating customer adoption of OTT services resulting in downsizing of\n  TV packages\n* Further deployment of direct fibre to more homes and businesses within\n  our wireline footprint and fixed wireless-to-the-premise technology in\n  rural communities\n* Growing consumption of OTT TV services and on-demand streaming video, as\n  well as the proliferation of devices, such as tablets, that consume large\n  quantities of bandwidth, will require ongoing capital investment\n* Realization of cost savings related to management workforce reductions\n  including attrition and retirements, lower contracted rates from our\n  suppliers, operating efficiencies enabled by a growing direct fibre\n  footprint, changes in consumer behaviour and product innovation, new call\n  centre technology that is enabling self-serve capabilities, and other\n  improvements to the customer service experience\n* No material financial, operational or competitive consequences of changes\n  in regulations affecting our wireline business\n\n//et\n\n   Assumptions Concerning our Bell Media Segment Our forward-looking\nstatements are also based on the following internal operational assumptions\nwith respect to our Bell Media segment:\n\n//st\n\n* Overall revenue is expected to reflect a gradual economic recovery in\n  2021 combined with subscriber revenue growth and strategic pricing on\n  advertising sales. However, revenue performance is expected to continue\n  to be negatively impacted by the effects of the COVID-19 pandemic on many\n  sectors of the economy.\n* Continued escalation of media content costs to secure quality\n  programming, as well as the return of sports and entertainment\n  programming\n* Continued scaling of Crave through broader content offering and user\n  experience improvements\n* Investment in Noovo News and more French-language original content to\n  better serve our French-language customers with a wider array of content,\n  in the language of their choice, on their preferred platforms\n* Enhanced market-leading attribution through our Strategic Audience\n  Management (SAM) tool\n* Ability to successfully acquire and produce highly rated programming and\n  differentiated content\n* Building and maintaining strategic supply arrangements for content across\n  all screens and platforms\n* Continued monetization of content rights and Bell Media properties across\n  all platforms\n* No material financial, operational or competitive consequences of changes\n  in regulations affecting our media business\n\n//et\n\n   Financial Assumptions Concerning BCE Our forward-looking statements are\nalso based on the following internal financial assumptions with respect to\nBCE for 2021:\n\n//st\n\n* Total post-employment benefit plans cost to be approximately $300\n  million, based on an estimated accounting discount rate of 2.6%,\n  comprised of an estimated above adjusted EBITDA post-employment benefit\n  plans service cost of approximately $275 million and an estimated below\n  adjusted EBITDA net post-employment benefit plans financing cost of\n  approximately $25 million\n* Increase in depreciation and amortization expense of approximately $200\n  million to $250 million compared to 2020\n* Interest expense and payments of approximately $1,050 million to $1,100\n  million\n* An effective tax rate of approximately 27%\n* NCI of approximately $60 million\n* Total cash pension and other post-employment benefit plan funding of\n  approximately $350 million to $375 million\n* Cash income taxes of approximately $800 million to $900 million\n* Average number of BCE common shares outstanding of approximately 905\n  million\n* An annual common share dividend of $3.50 per share\n\n//et\n\n     The foregoing assumptions, although considered reasonable by BCE on\nNovember 4, 2021, may prove to be inaccurate. Accordingly, our actual\nresults could differ materially from our expectations as set forth in this\nnews release.\n\n     Material Risks Important risk factors that could cause our assumptions\nand estimates to be inaccurate and actual results or events to differ\nmaterially from those expressed in, or implied by, our forward-looking\nstatements, including our 2021 financial guidance, are listed below. The\nrealization of our forward-looking statements, including our ability to\nmeet our 2021 financial guidance targets, essentially depends on our\nbusiness performance, which, in turn, is subject to many risks.\nAccordingly, readers are cautioned that any of the following risks could\nhave a material adverse effect on our forward-looking statements. These\nrisks include, but are not limited to: the COVID-19 pandemic and the\nadverse effects from the emergency measures implemented or to be\nimplemented as a result thereof, including supply chain disruptions, as\nwell as other pandemics, epidemics and other health risks; adverse economic\nand financial market conditions, a declining level of retail and commercial\nactivity, and the resulting negative impact on the demand for, and prices\nof, our products and services; our dependence on third-party suppliers,\noutsourcers and consultants to provide an uninterrupted supply of the\nproducts and services we need to operate our business, including mobile\ndevices; the intensity of competitive activity including from new and\nemerging competitors; the level of technological substitution and the\npresence of alternative service providers contributing to the acceleration\nof disruptions and disintermediation in each of our business segments;\nchanging viewer habits and the expansion of OTT TV and other alternative\nservice providers, as well as the fragmentation of, and changes in, the\nadvertising market; rising content costs and challenges in our ability to\nacquire or develop key content; the proliferation of content piracy; higher\nCanadian smartphone penetration and reduced or slower immigration flow;\nregulatory initiatives, proceedings and decisions, government consultations\nand government positions that affect us and influence our business; the\ninability to protect our physical and non-physical assets from events such\nas information security attacks, unauthorized access or entry, fire and\nnatural disasters; the failure to transform our operations, enabling a\ntruly customer-centric service experience, while lowering our cost\nstructure; the failure to continue investment in next-generation\ncapabilities in a disciplined and strategic manner; the inability to drive\na positive customer experience; the complexity in our operations; the\nfailure to maintain operational networks in the context of significant\nincreases in capacity demands; the risk that we may need to incur\nsignificant capital expenditures to provide additional capacity and reduce\nnetwork congestion; the failure to implement or maintain highly effective\ninformation technology (IT) systems; the failure to generate anticipated\nbenefits from our corporate restructurings, system replacements and\nupgrades, process redesigns, staff reductions and the integration of\nbusiness acquisitions; events affecting the functionality of, and our\nability to protect, test, maintain, replace and upgrade, our networks, IT\nsystems, equipment and other facilities; in-orbit and other operational\nrisks to which the satellites used to provide our satellite TV services are\nsubject; the failure to attract and retain employees with the appropriate\nskill sets and to drive their performance in a safe environment; labour\ndisruptions and shortages; the failure of our vendor selection, governance\nand oversight processes; security and data leakage exposure if security\ncontrol protocols affecting our suppliers are bypassed; the quality of our\nproducts and services and the extent to which they may be subject to\nmanufacturing defects or fail to comply with applicable government\nregulations and standards; the inability to access adequate sources of\ncapital and generate sufficient cash flows from operating activities to\nmeet our cash requirements, fund capital expenditures and provide for\nplanned growth; uncertainty as to whether dividends will be declared by\nBCE's board of directors or whether the dividend on common shares will be\nincreased; the inability to manage various credit, liquidity and market\nrisks; pension obligation volatility and increased contributions to\npost-employment benefit plans; new or higher taxes due to new tax laws or\nchanges thereto or in the interpretation thereof, and the inability to\npredict the outcome of government audits; the failure to reduce costs, as\nwell as unexpected increases in costs; the failure to evolve practices to\neffectively monitor and control fraudulent activities; unfavourable\nresolution of legal proceedings and, in particular, class actions; new or\nunfavourable changes in applicable laws and the failure to proactively\naddress our legal and regulatory obligations; the failure to recognize and\nadequately respond to climate change concerns or stakeholder and\ngovernmental changing expectations on environmental matters; and health\nconcerns about radio frequency emissions from wireless communication\ndevices and equipment.\n\n     We caution that the foregoing list of risk factors is not exhaustive\nand other factors could also adversely affect our results. We encourage\ninvestors to also read BCE's 2020 Annual MD&amp;A dated March 4, 2021 (included\nin BCE's 2020 Annual Report) and BCE's 2021 First, Second and Third Quarter\nMD&amp;As dated April 28, 2021, August 4, 2021 and November 3, 2021,\nrespectively, for additional information with respect to certain of these\nand other assumptions and risks, filed by BCE with the Canadian provincial\nsecurities regulatory authorities (available at Sedar.com) and with the\nU.S. Securities and Exchange Commission (available at SEC.gov). These\ndocuments are also available at BCE.ca.\n\n     About BCE BCE is Canada's largest communications company, providing\nadvanced Bell broadband wireless, Internet, TV, media and business\ncommunications services. To learn more, please visit Bell.ca or BCE.ca.\n\n     Through Bell for Better, we are investing to create a better today and\na better tomorrow by supporting the social and economic prosperity of our\ncommunities. This includes the Bell Let's Talk initiative, which promotes\nCanadian mental health with national awareness and anti-stigma campaigns\nlike Bell Let's Talk Day and significant Bell funding of community care and\naccess, research and workplace initiatives throughout the country. To learn\nmore, please visit Bell.ca/LetsTalk.\n\n     Media inquiries:\n\n     Marie-Eve Francoeur 514-391-5263 marie-eve.francoeur@bell.ca\n\n     Investor inquiries:\n\n     Thane Fotopoulos 514-870-4619 thane.fotopoulos@bell.ca\n\nTel   : 514-786-8424    BCE INC\nFax   : 514-786-3970\nEmail : corporate.secretariat@bell.ca\nWWW   : <a href=\"http://www.bce.ca\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.bce.ca</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2130700431.MNPRE2130702138-06560320211104</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}