{"date": "2022-01-24 15:11:31.012000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MOTORSPORT GAMES INC (\"MSGM-Q\")\n- Le Mans Virtual Series followed by more than 81 million fans on\n- live TV, digital streaming and social media throughout the\n- 2021-2022 season\n\n     The five-round 2021-22 Le Mans Virtual Series, which was brought to a\nglittering conclusion last weekend with the star-studded 24 Hours of Le\nMans Virtual, registered impressive, cumulated TV and digital audience\nfigures of more than 81 million throughout its 5-month season.\n\n     The grand finale to the Le Mans Virtual Series held on January 15 and\n16, 2022 brought together 50 cars with 200 drivers hailing from 39\ndifferent countries. Racers competed on 116 simulators worldwide located in\n28 countries on an extremely accurate virtual rendition of the iconic\nCircuit des 24 Heures in Le Mans, France. Heading a grid of famous racing\nnames and leading the charge in early stages was Formula One World Champion\nMax Verstappen, competing alongside INDYCAR Champion Alex Palou and\nmotorsport legend Juan Pablo Montoya, among others.\n\n     After incredible battles up and down the field between the world's\nbest professional and sim racing drivers representing elite esports teams,\nthe event was won by Realteam Hydrogen Redline, with BMW Team Redline\ntaking victory in the GTE category.\n\n     Gerard Neveu, Executive Producer of the 24 Hours of Le Mans Virtual\nand Motorsport Advisor to Motorsport Games: \"On behalf of all of us at Le\nMans Virtual Series, we want to sincerely thank all our competitors and\nteams who made this possible, our partners for their unwavering support,\nand the millions of fans who followed our events and who brought the social\nmedia sites alive with their comments of support, passion and\nrace-enthusiasm. ?\"These impressive figures and the quality of the events\nare clear confirmation that the Le Mans Virtual Series and the 24 Hours of\nLe Mans Virtual are now firmly established at the very top level of esports\nand sim racing. Let's now get ready for next season and make it even\nbetter!\"\n\n     An impressive multi-million TV/OTT and digital audience of over 81\nmillion enjoyed a slick and authoritative 25-hour TV special seen in\ncountries across four continents, on channels such as Eurosport, Motor\nTrend, L'Equipe Live and Motorsport.TV.\n\n     Some key facts and figures:\n\n     *  360,000 hours were consumed by the #LeMansVirtual audience\n\n     *  2.8 million TV/OTT audience (source: YouGov Sport)\n\n     *  78.4 million digital impressions for 24H Le Mans Virtual (Source :\nYouGov Sport)\n\n     *  30.2 million social media impressions (FIA WEC, ACO, LMVS) through\nthe season\n\n     *  7 million video views (across FIA WEC, ACO and Traxion GG - Source:\nHookit)\n\n     *  200 drivers hailing from 39 different nations\n\n     *  50 cars split in two classes (29 LMP and 21 GTE)\n\n     *  116 simulators located across 28 different countries\n\n     *  2 servers (1 main/1 backup) operated rFactor2 and 0 server issues\n\n     *  33,000 connections on the official Alkamel timing system (Source:\nAlkamel)\n\n     *  407 laps completed by the winner, #70 Realteam Hydrogen Redline\n\n     *  Organisation team of 120 people including production, sporting,\nmarketing, media and digital, TV, logistics\n\n     About Motorsport Games\n Motorsport Games, a Motorsport Network company, combines innovative and\nengaging video games with exciting esports competitions and content for\nracing fans and gamers around the globe. The Company is the officially\nlicensed video game developer and publisher for iconic motorsport racing\nseries, including NASCAR, INDYCAR, 24 Hours of Le Mans and the British\nTouring Car Championship (\"BTCC\"), across PC, PlayStation, Xbox, Nintendo\nSwitch and mobile. Motorsport Games is an award-winning esports partner of\nchoice for 24 Hours of Le Mans, Formula E, BTCC, the FIA World Rallycross\nChampionship and the eNASCAR Heat Pro League, among others. For more\ninformation about Motorsport Games, visit www.motorsportgames.com.\n\n     Forward-Looking Statements:\nCertain statements in this press release which are not historical facts are\nforward-looking statements within the meaning of Section 27A of the\nSecurities Act of 1933, as amended, and Section 21E of the Securities\nExchange Act of 1934, as amended, and are provided pursuant to the safe\nharbor provisions of the Private Securities Litigation Reform Act of 1995.\nAny statements in this press release that are not statements of historical\nfact may be deemed forward-looking statements. Words such as \"continue,\"\n\"will,\" \"may,\" \"could,\" \"should,\" \"expect,\" \"expected,\" \"plans,\" \"intend,\"\n\"anticipate,\" \"believe,\" \"estimate,\" \"predict,\" \"potential,\" and similar\nexpressions are intended to identify such forward-looking statements. All\nforward-looking statements involve significant risks and uncertainties that\ncould cause actual results to differ materially from those expressed or\nimplied in the forward-looking statements, many of which are generally\noutside the control of Motorsport Games and are difficult to predict.\nExamples of such risks and uncertainties include, but are not limited to\ndifficulties, delays in or unanticipated events that may impact the timing\nand scope of new product launches, such as due to delays and higher than\nanticipated expenses related to the ongoing and prolonged COVID-19\npandemic. Factors other than those referred to above could also cause\nMotorsport Games' results to differ materially from expected results.\nAdditional factors that could cause actual results to differ materially\nfrom those expressed or implied in the forward-looking statements can be\nfound in Motorsport Games' filings with the SEC, which may be found at\nwww.sec.gov and at ir.motorsportgames.com, including its Annual Report on\nForm 10-K for the fiscal year ended December 31, 2020, its Quarterly\nReports on Form 10-Q filed with the SEC during 2021, as well as in its\nsubsequent filings with the SEC. Motorsport Games anticipates that\nsubsequent events and developments may cause its plans, intentions and\nexpectations to change. Motorsport Games assumes no obligation, and it\nspecifically disclaims any intention or obligation, to update any\nforward-looking statements, whether as a result of new information, future\nevents or otherwise, except as expressly required by law. Forward-looking\nstatements speak only as of the date they are made and should not be relied\nupon as representing Motorsport Games' plans and expectations as of any\nsubsequent date. Additionally, the business and financial materials and any\nother statement or disclosure on, or made available through, Motorsport\nGames' website or other websites referenced or linked to this press release\nshall not be incorporated by reference into this press release.\n\n     Website and Social Media Disclosure:\nInvestors and others should note that we announce material financial\ninformation to our investors using our investor relations website\n(ir.motorsportgames.com), SEC filings, press releases, public conference\ncalls and webcasts. We use these channels, as well as social media and\nblogs, to communicate with our investors and the public about our company\nand our products. It is possible that the information we post on our\nwebsites, social media and blogs could be deemed to be material\ninformation. Therefore, we encourage investors, the media and others\ninterested in our company to review the information we post on these\nwebsites, social media channels and blogs, including the following (which\nlist we will update from time to time on our investor relations website):\n\n//st\n         Websites              Social Media\n         motorsportgames.com   Twitter: @msportgames &amp; @traxiongg\n         traxion.gg            Instagram: msportgames &amp; traxiongg\n         motorsport.com        Facebook: Motorsport Games &amp; traxiongg\n                               LinkedIn: Motorsport Games\n                               Twitch: traxiongg\n                               Reddit: traxiongg\n//et\n\n     The contents of these websites and social media channels are not part\nof, nor will they be incorporated by reference into, this press release.\n\n     Investors:\nAshley DeSimone\nAshley.Desimone@icrinc.com\n\n     US Press:\nASTRSK PR\nmotorsportgames@astrskpr.com\n\n     EU / UK Press:\nSwipe Right PR\nmotorsport@swipterightpr.com\n\nTel   : 305-507-8799    MOTORSPORT GAMES INC\nEmail : investors@motorsportgames.com\nWWW   : <a href=\"https://www.motorsportgames.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.motorsportgames.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2202300631.MNPRE2202301756-07025920220124</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}