{"date": "2021-12-20 10:18:03.824000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>NEW DELHI</p></div><div class=\"tr-npp-lead\"><p>NEW DELHI, Dec. 20 -- Amazon Prime Video India, which had announced its partnership with New Zealand Cricket board in November 2020, will start streaming all cricket matches (men's and women's cricket) played in that country for audiences in India starting 1 January.</p><p>Prime Video, which has the exclusive streaming rights for India, will cover all formats of the game -- ODIs, T20s and tests.</p></div><div class=\"tr-npp-body\"><p>The test series between New Zealand and Bangladesh will be the first to be streamed on Prime Video beginning January. In February, Indian cricket fans can watch the series between India and New Zealand's women's cricket teams. The Indian and New Zealand men's cricket teams are currently scheduled to play in November 2022.</p><p>Cricket enthusiasts will be able to access other cricket programming and highlights, in the run-up to the matches, and can also revisit the highlights of matches on the service shortly after the match ending.</p><p>At a virtual press conference, Gaurav Gandhi, country head, Amazon Prime Video, India, said \"Cricket is undoubtedly the most loved sport in India and our collaboration with New Zealand Cricket underlines our commitment to give our customers what they want. The upcoming series will be Prime Video's first foray into live cricket in India,\" adding, the company was excited to start its live cricket journey in 2022 - an action-packed year that will see both Indian women's and men's teams tour New Zealand.</p><p>\"We have a special place in our hearts and our screens for the brilliant and much-admired New Zealand men and women's cricket teams, both of whom are highly ranked by the ICC across format between two will be an exciting action-packed year for fans across India,\" he said.</p><p>Gandhi added that they have received an overwhelming response from India and have seen a broad adoption of Prime Video which is viewed in all 99% of India's pin-codes. \"As we step into the New Year, the pitch looks great for a game we want to play. We are thrilled to bring India's most loved sport, cricket to screens now. We can all agree that cricket is more than a sport in India,\" he said.</p><p>David White, CEO, New Zealand Cricket, said, \"We believe the future of sports viewing is live streaming. They are innovative and progressive in this area and in particular in the Indian market, which is one of our key targets since people love cricket there.\"</p><p>Amazon Prime Video India is also said to be one of the serious contenders for the bidding of media rights of big sporting properties like the Indian Premier League (IPL). Gandhi, however, did not respond to queries on the company's plan to bid for IPL. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}