{"date": "2021-12-01 19:12:45.352000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SQID TECHNOLOGIES LTD (\"SQID-Z\")\n- The Chiefs and Optus Renew Gaming Partnership\n\n     SQID Technologies Limited is pleased to release the following\nannouncement in relation to The Chiefs Esports Pty Ltd (\"The Chiefs\") which\nforms part of SQID's wholly owned ICON Esports Group.\n\n     The Chiefs, a leading Australia &amp; New Zealand's esports organisation\nand Optus have announced a partnership extension which will see the brands\ncontinue to collaborate around gaming content in Australia for a further 12\nmonths.\n\n     The news follows a successful 12-month partnership, including members\nof The Chiefs featuring in Optus' Gamer Plan launch, supporting the\ndevelopment of Optus' Streaming Booth' in their flagship store in Queen\nStreet, Brisbane and consulting on multiple future product developments.\n\n     Part of the Chiefs and Optus partnership is to understand the demands\nof gamers and create services tailored to their needs.\n\n     Playing competitive games with a stable ping, watching videos in high\ndefinition on streaming services and being able to work on complicated\nprojects from home has never been more important to consumers. They need an\ninternet provider they can trust with services catered towards the tech\nsavvy and higher usage requirements of today.\n\n     Optus' Head of Marketing, Mel Hopkins, said: \"We're proud to be\ncontinuing our partnership with The Chiefs and supporting this growing\ncommunity. Optus provides a variety of gaming specific products so working\nwith the Chiefs helps us connect with the gaming community in an authentic\nway.\"\n\n     As part of the renewed partnership Optus will feature prominently\nacross The Chiefs' 19x national championship brands, including their\nprofessional teams competing in League of Legends, Rainbow 6 Siege and\nValorant.\n\n     Nick Bobir, Chief Executive Officer of The Chiefs said: \"Optus has\nbeen an integral partner for not only The Chiefs as a brand but also our\nplayers and content creators over the past 12 months. We are excited to\ncontinue building on the momentum and delivering further value to the\ngaming market here in Australia.\"\n\n     The Optus Streaming Booth in Queen Street, Brisbane is a first of its\nkind for Australian retail in Australia and The Chiefs are a proud partner\nof the initiative. To build on the success of the Streaming Booth, new\nresident streamer Ryan 'Panda' Dingle, who features on the top 10 list of\nmost subscribers on Twitch in ANZ, will regularly stream from Queen Street\nto his community of gamers.\n\n     \"Despite his disadvantaged childhood, Panda has overcome adversity to\nbecome a role model to help kids in similar situations. He dedicates his\ntime to working with youth organisations, antibullying and autism groups.\nHe is a true embodiment of powering optimism in action,\" Ms Hopkins added.\n\n     This follows The Chiefs' recent announcement of a two-year strategic\npartnership with Manchester United superstar Jesse Lingard and JLINGZ\nEsports, which will support the development of an international Esports\nAcademy pathway for aspiring esports talent. The strategic partnership\naligns closely with the Optus business, in particular its sport streaming\nplatform, Optus Sport, which recently announced it had renewed the\nAustralian broadcasting rights for the Premier League through to the end of\nthe 2028 season.\n\n     On behalf of the SQID Technologies Limited board of directors.\n\n//st\n     Contact details:\n     Athan Lekkas                Anoosh Manzoori\n     CEO                         SQID Advisor\n     SQID Technologies Limited   Shape Capital Pty Ltd\n     athan@sqidpayments.com.au   anoosh@shape.capital\n     + 61 3 8620 6400            + 61 3 8620 6400\n//et\n\n     About SQID Technologies\n\n     SQID Technologies Limited [CSE: SQID] is an Australian based Company\nengaged in payment processing and investing and growing esports gaming. It\nprovides merchant services and transaction processing to business merchants\nand ecommerce customers across both Business to Business (B2B) and Business\nto Consumer (B2C) segments through its leading partner platform (Merchant\nWarrior). The Company also wholly owns the ICON Esports (ICON) a leading\nAustralia &amp; New Zealand esports and gaming organisation, focussed on the\ncommercial landscape of the Oceanic market through brand driven marketing\ncampaigns and partnerships, nutrition supplements and merchandise to their\nesports and gaming audience.\n\n     ABOUT THE CHIEFS:\n\n     The Chiefs Esports Pty Ltd (\"The Chiefs\") forms part of SQID\nTechnologies wholly owned ICON Esports Group.\n\n     The Chiefs are one of the premier esports and gaming entertainment\nclubs in the ANZ region, featuring top teams in various competitive video\ngames. Founded in 2014, The Chiefs have a consistent record of being highly\nsuccessful within ANZ Esports competitions and are committed to the growth\nof the industry both on a domestic and international level.\n\n     THE CANADIAN SECURITIES EXCHANGE HAS NOT REVIEWED AND DOES NOT ACCEPT\nRESPONSIBILITY FOR THE ACCURACY OR ADEQUACY OF THIS RELEASE.\n\n     FORWARD LOOKING INFORMATION\n\n     Any forward-looking statements in this news release are not guarantees\nof future performance and involve known and unknown risks, uncertainties,\nassumptions and other important factors, many of which are beyond the\ncontrol of the Company, its directors and management.\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133400398.MNPRE2133401714-06125320211201</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}