{"date": "2022-01-17 10:57:43.527000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>I recently moved into a new home – the first one I've ever owned, and therefore been allowed to do more than hang a picture with a Command strip in.</p><p>As a typical millennial with big Pinterest dreams and a modest mortgage-adjacent budget, the first order of business was to hit refresh and paint everything white, starting with the kitchen. But while a lick (okay, five coats, the struggle is real) of Dulux brilliant white did the trick on the walls, the floor remained stubbornly tired and a bit dreary.</p></div><div class=\"tr-npp-body\"><p>With no cash in the pot to redo the existing surface completely, a friend suggested I try a grout pen – essentially Tippex for the gaps between tiles to give them a new lease of life. It had worked wonders on their bathroom, they said, but at £3.80, I was dubious that such a small investment could make a difference transformative enough to satisfy my vision for the space. Still, I placed an order for the one with the best reviews on Amazon, thinking that at least it was no huge loss if it didn't look great, as the floor didn't look great to begin with.</p><p>The next day – thanks, <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2Famazonprime\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Prime membership</a> – my pen arrived in the post, and as soon as I painted on the first stripe, I ate my words and then some. If you too want to give your tiled space a makeover for less than £5, here's what you need to know.</p><p><span>Read more:</span> </p><ul class=\"bulleted-list arrowlist\"><li><a href=\"https://www.independent.co.uk/extras/indybest/house-garden/household-appliances/best-washing-machine-cheap-10kg-8kg-quiet-reviews-new-small-uk-a9675756.html\"><span>9 best washing machines that are affordable and efficient</span> </a> </li><li><a href=\"https://www.independent.co.uk/extras/indybest/house-garden/kitchen-appliances/best-microwaves-oven-uk-brand-with-grill-egg-poacher-a9041061.html\"><span>10 best microwaves for quick and easy cooking</span> </a> </li><li><a href=\"https://www.independent.co.uk/extras/indybest/house-garden/kitchen-accessories/best-oven-gloves-a9340816.html\"><span>7 best oven gloves that take the heat out of the kitchen</span> </a> </li><li><a href=\"https://www.independent.co.uk/extras/indybest/house-garden/kitchen-accessories/pan-lid-holder-joseph-joseph-review-uk-b1816435.html\"><span>These £12 pan-lid holders make my tiny kitchen tolerable</span> </a> </li> </ul><p>Rainbow Chalk Markers grout pen 5mm nib in white: £3.80, <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2FGrout-Pen-White-Revives-Restores%2Fdp%2FB006LMFJS4%2F%3Fascsubtag%3DIN%7C1993308%7CB006LMFJS4\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.co.uk</a> If you remember the days of white-outing mistakes in your school books, you'll have no problems getting to grips with this grout pen – it's truly just an upsized version of the Tippex pens I would tote in my pencil cases in the Nineties, albeit with a formula that boasts better staying power. To get it going, you need to give it a good shake, gently pump the nib a few times, then apply to your grout as you would a felt tip pen to paper. The key is not to use too much pressure, or you risk fraying the tip, making pulling neat, clean lines much more challenging – I found once the liquid was flowing, a lighter hand gave much better results, especially when you draw in one direction (now is not the time to scribble).  I chose the 5mm nib to fit between our fairly standard 12in x 12in tiles, and white because I thought it would look the freshest, but there are various options available on Amazon, including cream and light and dark grey offerings for a similar price. Despite my best efforts, the odd splodge did still end up on the floor itself – the first time it happened, I panicked, fearful that it would somehow suddenly be welded to the surface permanently, white spirit be damned. However, if you work quickly enough, I noticed that you can run a folded piece of tissue or kitchen roll along the edges and tidy it up without any repercussions. Once I realised this, it actually became my preferred technique – better to be a bit slapdash and make sure everything's fully covered than risk patchiness from being too cautious, and ultimately the lines I cleaned up manually ended up looking the sharpest. Although the pen goes on fairly opaque – you can see an obvious difference from the first pass – I needed two coats to get a crisp, solid colour that I was happy with. In the spirit of full disclosure, this meant I needed two 25g pens to fully cover approximately 260in x 140in worth of flooring. Still, with change from a £10 note I can't help but feel that it was still truly excellent value. There's also a three-pack available for £9.99 ( <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2Fdp%2FB08S7NNYT4%2F%3Fascsubtag%3DIN%7C1993308%7CB08S7NNYT4\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.co.uk</a> ), which represents a decent saving if you know you're working with a bigger space.  You need to leave your work to dry for at least an hour if you want to do a second coat, which meant I spent a grand total of two evenings on this project. Since then, I've walked over the tiles hundreds of times, spilled things on them several times more, and generally made no changes to my pretty messy everyday routine, and they still look as bright and white they did at first swipe. The verdict: Rainbow Chalk Markers grout penIf you've got a kitchen or bathroom that's feeling a bit lacklustre, but that you can't afford to rip up and start from scratch, I highly recommend giving the <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2FGrout-Pen-White-Revives-Restores%2Fdp%2FB006LMFJS4%2F%3Fascsubtag%3DIN%7C1993308%7CB006LMFJS4\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Rainbow Chalk Markers grout pen</a> a try. My next stop is investigating the world of vinyl stickers from the likes of <a href=\"https://theloftandus.com/collections/vinyl\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Loft &amp; Us</a> and <a href=\"https://kraftile.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Kraftile</a> – if you have any recommendations, let me know on our Instagram page, <a href=\"https://www.instagram.com/theindybest/?hl=en\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@theindybest</a> .Rainbow Chalk Markers grout pen 5mm nib in white <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2FGrout-Pen-White-Revives-Restores%2Fdp%2FB006LMFJS4%2F%3Fascsubtag%3DIN%7C1993308%7CB006LMFJS4\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Buy now</a> £3.80, Amazon.co.ukVoucher codesFor more savings on home improvements and decor, try the links below:</p><ul class=\"bulleted-list arrowlist\"><li><a href=\"https://www.independent.co.uk/vouchercodes/made\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Made discount codes</a> </li><li><a href=\"https://www.independent.co.uk/vouchercodes/oliver-bonas\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Oliver Bonas discount codes</a> </li><li><a href=\"https://www.independent.co.uk/vouchercodes/very\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Very discount codes</a> </li> </ul><p><span>Need to upgrade your kitchen appliances? Here's our guide to the</span><a href=\"https://www.independent.co.uk/extras/indybest/house-garden/kitchen-appliances/fridge-freezers-best-brand-quality-size-fit-a9417626.html\"><span>best fridge freezers</span> </a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 Independent, The (UK) (Online). All rights reserved.</p></div>"}