{"date": "2021-12-13 21:15:55+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\"><li class=\"tr-summaryitem\">Main U.S. close sharply lower, Nasdaq down most</li><li class=\"tr-summaryitem\">Energy biggest loser among S&amp;P sectors; real estate gains most</li><li class=\"tr-summaryitem\">Dollar, gold edge up; crude off, bitcoin drops &gt;7%</li><li class=\"tr-summaryitem\">U.S. 10-Year Treasury yield falls to ~1.42%</li></ul><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Dec 13</span><span class=\"tr-dl-sep\"> - </span>Welcome to the home for real-time coverage of markets brought to you by Reuters reporters. You can share your thoughts with us at <a href=\"mailto:markets.research@thomsonreuters.com\" data-type=\"email\" translate=\"no\">markets.research@thomsonreuters.com</a></p><p><br/></p><p><br/></p><p>WALL STREET TURNS RED AHEAD OF FED (1605 EST/2105 GMT)  </p><p>Wall Street slid on Monday, with the S&amp;P 500 backing down from Friday's record closing high to end a session in which there was little to distract investors from Omicron jitters and the increasing likelihood of the Federal Reserve shortening its policy timeline. <a href=\"reuters://REALTIME/verb=Headlines/ric=.N\" data-type=\"newsExpression\" data-expression=\".N\" translate=\"no\" dir=\"ltr\">.N</a></p><p>All three major stock indexes closed lower with megacap tech-plus weighing heaviest.</p><p>Of the 11 major sectors in the S&amp;P 500 the biggest winner - real estate <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.SPLRCR\" data-type=\"ric\" data-ric=\".SPLRCR\" translate=\"no\" dir=\"ltr\">.SPLRCR</a> - and the biggest loser - energy <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.SPNY\" data-type=\"ric\" data-ric=\".SPNY\" translate=\"no\" dir=\"ltr\">.SPNY</a> - also appear on track to be the best-performing sectors of the year, with energy shares last up more than 46% year-to-date and real estate most recently showing a 36% advance over the same time period. </p><p>Shares of Apple Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a> dropped 2.1% just as the iPhone maker's market cap approached the $3 trillion mark. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2SY3H1\" data-type=\"storyId\" data-story-id=\"nL4N2SY3H1\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>New infections of the Omicron COVID variant rained on the travel industry's parade. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2SY1B2\" data-type=\"storyId\" data-story-id=\"nL8N2SY1B2\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Cruise operators sank: Carnival Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=CCL.N\" data-type=\"ric\" data-ric=\"CCL.N\" translate=\"no\" dir=\"ltr\">CCL.N</a>, Norwegian Cruise Line Holdings <a href=\"reuters://REALTIME/Verb=FullQuote/ric=NCLH.N\" data-type=\"ric\" data-ric=\"NCLH.N\" translate=\"no\" dir=\"ltr\">NCLH.N</a> and Royal Caribbean Cruises <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RCL.N\" data-type=\"ric\" data-ric=\"RCL.N\" translate=\"no\" dir=\"ltr\">RCL.N</a> all dropped more than 4%.</p><p>Airlines lost altitude: the S&amp;P 1500 airlines index <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.SPCOMAIR\" data-type=\"ric\" data-ric=\".SPCOMAIR\" translate=\"no\" dir=\"ltr\">.SPCOMAIR</a> dipped 3.9%.</p><p>So-called \"meme stocks,\" or stocks that enjoyed nosebleed-inducing rallies driven by retail investors this year due to social media buzz, lost ground. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2SY3MB\" data-type=\"storyId\" data-story-id=\"nL4N2SY3MB\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>GameStop Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GME.N\" data-type=\"ric\" data-ric=\"GME.N\" translate=\"no\" dir=\"ltr\">GME.N</a>, and AMC Entertainment <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMC.N\" data-type=\"ric\" data-ric=\"AMC.N\" translate=\"no\" dir=\"ltr\">AMC.N</a> lost 13.9% and 15.3% respectively, while retail trading app Robinhood Markets Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=HOOD.O\" data-type=\"ric\" data-ric=\"HOOD.O\" translate=\"no\" dir=\"ltr\">HOOD.O</a> ended the session down 2.1% after touching its lowest level since its debut as a publicly traded company.</p><p>Members of the FOMC are expected launch their two-day monetary policy pow-wow on Tuesday, and in view of persistently hot inflation readings and the ongoing stabilization of the labor market, the question appears to have moved beyond \"will they\" to \"how quickly will they\" taper asset purchases and hike key interest rates.</p><p>While Powell &amp; Company are the week's headliners, some data is likely to also grab some attention. This includes inflation (PPI, import prices), retail sales and industrial indicators (industrial output, Empire State, Philly Fed, Markit PMI) which are expected to provide a clearer picture of the economic recovery as a volatile year lumbers toward the finish line.</p><p>Here's your closing snapshot:</p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"g80555b9d-fc99-465d-89a5-35a913285247\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://graphics.reuters.com/USA-STOCKS/zjpqkydjmpx/closer.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9ncmFwaGljcy5yZXV0ZXJzLmNvbS9VU0EtU1RPQ0tTL3pqcHFreWRqbXB4L2Nsb3Nlci5wbmc=&amp;storyId=urn:newsml:reuters.com:20211213:nL1N2SY22K:4&amp;key=dcdb387db913170d33816f6ec3d8732ba3920c163aadb1013b3d77de3bacfe80878ed7cfe86df6857f548ec41fb769307941928eb58563693f2fc80f50646d4d\"/></div></div></div></p><p><br/></p><p>(Stephen Culp)</p><p>*****</p><p><br/></p><p>DIVIDEND STOCKS: STABILITY IN AN UNSTABLE MARKET (1349 EST/1849 GMT)  </p><p>The Nuveen Equities Investment Council, led by Saira Malik, is out with a note discussing dividend stocks.</p><p>Dividend stocks have performed well this year, as strong corporate earnings growth drove broader equity market participation.</p><p>In fact, Malik says that within the S&amp;P 500, dividend-paying companies have not only outperformed non-dividend payers, but they’ve also provided excess returns during spikes in volatility.</p><p>With elevated uncertainty over inflation and interest rates, Nuveen expects volatility to continue to dog the market.</p><p>\"In our view, investors should favor dividends supported by healthy fundamentals, balance sheet strength, free cash flow and attractive relative valuations. Companies with these characteristics appear positioned to benefit from the reacceleration of economic growth, allowing them to return capital to shareholders.\"</p><p>Malik believes that the trend of reinstatement of capital return programs should continue, adding that share repurchases and dividends have returned to near pre-pandemic levels, bolstered by earnings growth, margin expansion and greater confidence in the sustainability of the economic recovery.</p><p>According to Malik, more than 300 S&amp;P 500 constituents have declared a dividend increase so far this year, with the index expected to generate 6% dividend growth in 2021.</p><p>While dividend increases are occurring broadly, Malik says that cyclical areas like industrials and financials have declared the most. However, given a strong earnings growth environment, she also believes sectors with lower dividend payout ratios such as tech, health care and consumer discretionary, should also deliver dividend growth.</p><p><br/></p><p>(Terence Gabriel)</p><p>***** </p><p>   </p><p>GEOPOLITICS 2022: \"MANAGED DISAGREEMENTS\" (1223 EST/1723 GMT)  </p><p>Joe Biden moving into the White House might have made geopolitics somewhat calmer and more predictable, with much of the focus shifting from international politics to fundamental economic issues including inflation, monetary policy dilemmas, supply-chain disruptions, and the pandemic.</p><p>But that doesn't mean geopolitical tensions have gone away, says Philippe Dauba-Pantanacce, global geopolitical strategist at Standard Chartered Bank.</p><p>Top of the list for 2022 remains the relationship between China and the U.S. and other Western powers and allies, which has \"evolved from a commercial confrontation into a broader adversarial relationship where disagreements are managed rather than resolved\", said Dauba-Pantanacce. </p><p>And then there are some persistent idiosyncratic risks, which in some cases, are rising with Turkey, Russia and Latin America all on the radar.</p><p>\"Russia's regular confrontations with the U.S. and Europe are likely to continue to act as a destabilizing force,\" Dauba-Pantanacce predicts.</p><p>Europe’s energy crisis this autumn gave Russia's President Vladimir Putin an opportunity to demonstrate Russia's importance on the global stage and provided a wake up call of the need for the region to diversify energy sources.</p><p>\"This, combined with the migrant crisis on the EU-Belarus border and the Russian military build-up on the Ukraine border, has increased the likelihood of further confrontation,\" Dauba-Pantanacce said. </p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"f2be52fc-988d-4077-8877-516f14eb6559\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://fingfx.thomsonreuters.com/gfx/mkt/jnpweakeepw/Standard%20Chartered%20Geopolitical%20Risk.PNG\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9maW5nZngudGhvbXNvbnJldXRlcnMuY29tL2dmeC9ta3Qvam5wd2Vha2VlcHcvU3RhbmRhcmQlMjBDaGFydGVyZWQlMjBHZW9wb2xpdGljYWwlMjBSaXNrLlBORw==&amp;storyId=urn:newsml:reuters.com:20211213:nL1N2SY22K:4&amp;key=50a416d433ac4cd6480d845410b3f01ea4d34ef06e49564bf4b9367273c46fd17639773ce0183710276cde13d42c794b7c237ce05cafcc64035be9cb5e64387f\"/></div></div></div></p><p>(Karin Strohecker) </p><p>*****</p><p><br/></p><p>THE CHAMPAGNE'S GONE FLAT: WORLD BUSINESS SENTIMENT TURNS GLOOMY (1145 EST/1645 GMT)</p><p>As companies worldwide prepare to shut the books on a year that was supposed to tell a story of economic rebound from the global health crisis brought about by COVID, the mood is dimmer than markets might have assumed when they were tossing confetti and singing 'Auld Lang Syne' nearly twelve months ago.    </p><p>Since then, we've added the unwelcome words 'Delta' and 'Omicron' to our daily vocabularies, digested the notion that the coronavirus could be here to stay, and struggled to get our arms around a tangled, systemic, worldwide supply chain fiasco.</p><p>Oxford Economics' (OE) most recent Global Risk Survey which included 120 responses from November 29 through December 9, showed business sentiment turning pessimistic for the first time since the height of the pandemic.</p><p>\"Our December flash survey finds that 61% of businesses have become more negative about global economic growth prospects over the past month,\" writes Jamie Thompson, OE's head of macro scenarios. \"Concerns over the risks posed by supply-chain disruption and the new Omicron virus variant are evident throughout the latest survey.\"</p><p>As to when the current not-so-transitory wave of consumer price inflation will peak, the majority of the survey participants see it happening in the first quarter (36%) or second quarter (26%) of 2022.</p><p>For a breakdown of inflation expectations, please see the graphic below, courtesy of OE:</p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"df255821-c38d-41ef-89ad-b5bec79d1afa\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://graphics.reuters.com/USA-STOCKS/zgvomnzqkvd/oeinflation.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9ncmFwaGljcy5yZXV0ZXJzLmNvbS9VU0EtU1RPQ0tTL3pndm9tbnpxa3ZkL29laW5mbGF0aW9uLnBuZw==&amp;storyId=urn:newsml:reuters.com:20211213:nL1N2SY22K:4&amp;key=245e9e1c37fe79650d1e3aa435fd15f6046d9f24f15a55e3be839165b3f22c5279650f450f80f9a7b7d10c4da260316584dcc96e77f8d428854ab4a84d38f219\" style=\"max-height:364px\"/></div></div></div></p><p><br/></p><p>Inflation has been sent into orbit by supply scarcity, a sticky problem which a sizeable chunk of the respondents see persisting throughout the coming year and into 2023.</p><p>\"Half of the respondents report that their business is currently being affected by the supply-chain crisis, such as material and component shortages and transportation bottlenecks,\" Thomson adds. \"Around 30% of those affected report being severely affected. Few expect an early end to disruption, and almost 1-in-5 businesses (19%) now expect disruption to their business to persist beyond 2022.\"</p><p>     </p><p>(Stephen Culp)</p><p>*****</p><p><br/></p><p><span class=\"tr-strong\">TOO EARLY TO ESTIMATE TORNADO INSURANCE CLAIMS </span>(1105 EST/1605 GMT)</p><p>As U.S. mid-west residents and businesses dealt with the aftermath of a series of deadly tornados that killed at least a 100 people on Friday night, Piper Sandler analyst Paul Newsome looked at the market share of insurance companies in the area affected. </p><p>While Newsome noted that it was too early to estimate the amount of claims insurers would receive he noted that the catastrophe was unusual as tornados rarely hit in December and when they do they tend to affect a smaller geographic area for a shorter period of time. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2SX0JJ\" data-type=\"storyId\" data-story-id=\"nL1N2SX0JJ\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>He noted that the tornado outbreak, which moved across multiple states including Arkansas, Illinois, Missouri, Tennessee and Kentucky. In Kentucky, Governor Andy Beshear estimated the death toll at 80 and talked about one twister that tore across 227 miles (365 km) of terrain, almost all of which was in Kentucky.</p><p>So Newsome noted that while tornadoes can typically result in hundreds of millions of dollars worth of claims, \"this could be a lot more.\"</p><p>While the event was usual, Newsome suggested that it may be another data point indicating that increasingly unpredictable and unusual weather event may now be a permanent issue that insurance investors must consider. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2SY12R\" data-type=\"storyId\" data-story-id=\"nL1N2SY12R\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>     U.S. President Joe Biden said on Saturday it was likely to be one of the largest Tornado outbreaks in U.S. history and that he would ask the Environmental Protection Agency and others to take a look at whether climate change was a factor. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2SW0H7\" data-type=\"storyId\" data-story-id=\"nL1N2SW0H7\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span>  </p><p>Looking at 2020 data for auto, commercial, home owner and auto passenger insurance, the analyst estimated that State Farm has the biggest exposure to the affected states with 22% share of the market followed by Allstate Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ALL.N\" data-type=\"ric\" data-ric=\"ALL.N\" translate=\"no\" dir=\"ltr\">ALL.N</a> at 8%, Liberty Mutual at 5.2%, Progressive <a href=\"reuters://REALTIME/Verb=FullQuote/ric=PGR.N\" data-type=\"ric\" data-ric=\"PGR.N\" translate=\"no\" dir=\"ltr\">PGR.N</a> at 4.7% and Farmers insurance at 4.6%. </p><p>While Newsome estimated the Cincinnati Insurance Co <a href=\"reuters://REALTIME/Verb=FullQuote/ric=CINF.O\" data-type=\"ric\" data-ric=\"CINF.O\" translate=\"no\" dir=\"ltr\">CINF.O</a> share of the market at just 1.4% that stock was one of lead decliners in the S&amp;P 500 financial index <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.SPSY\" data-type=\"ric\" data-ric=\".SPSY\" translate=\"no\" dir=\"ltr\">.SPSY</a>. its shares were down more than 2%. Shares in Allstate were last down more than 1% while Progressive was up 0.5%.</p><p>Travelers <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TRV.N\" data-type=\"ric\" data-ric=\"TRV.N\" translate=\"no\" dir=\"ltr\">TRV.N</a>, which has an estimated 3.7% share of the market was down 0.9%. Chubb <a href=\"reuters://REALTIME/Verb=FullQuote/ric=CB.N\" data-type=\"ric\" data-ric=\"CB.N\" translate=\"no\" dir=\"ltr\">CB.N</a> was down about 1.4% along with Hartford Financial <a href=\"reuters://REALTIME/Verb=FullQuote/ric=HIG.N\" data-type=\"ric\" data-ric=\"HIG.N\" translate=\"no\" dir=\"ltr\">HIG.N</a>, which has a 1.5% share. Newsome put Sate Auto's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=STFC.O\" data-type=\"ric\" data-ric=\"STFC.O\" translate=\"no\" dir=\"ltr\">STFC.O</a> share of that market at 0.8% and the stock was virtually unchanged on Monday. </p><p>(Sinéad Carew)</p><p>     ***** </p><p><br/></p><p><br/></p><p>WALL STREET HITS THE SLOPES AFTER HINT OF A LIFT (0958 EST/1458 GMT)</p><p>After stock futures hinted at a pale green start to the week, Wall Street defied those expectations on Monday by heading lower after the opening bell.</p><p>The three major U.S. stock indexes appeared to be cooling their heels after S&amp;P 500 hit a record closing high on Friday and notched its best biggest weekly percentage gain since February    </p><p>Tesla Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TSLA.O\" data-type=\"ric\" data-ric=\"TSLA.O\" translate=\"no\" dir=\"ltr\">TSLA.O</a>, Microsoft Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MSFT.O\" data-type=\"ric\" data-ric=\"MSFT.O\" translate=\"no\" dir=\"ltr\">MSFT.O</a> and Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> weighed heaviest, with Apple Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a> bucking megacap tech-plus trend following a target price hike from JPMorgan. </p><p>The gadget maker hit an new intraday high and is on the brink of becoming the only company in the world to have crossed the $3 trillion market value mark. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2SY20U\" data-type=\"storyId\" data-story-id=\"nL4N2SY20U\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2SV21I\" data-type=\"storyId\" data-story-id=\"nL1N2SV21I\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>The Federal Reserve is expected to convene tomorrow for its two-day meeting, and its concluding statement and Q&amp;A will be scrutinized for clues as to the extent to which the central bank will shorten the timeline of expected tightening of its accommodative monetary policy. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2SD0VB\" data-type=\"storyId\" data-story-id=\"nL1N2SD0VB\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Powell &amp; company will most certainly be talking about inflation, which continues to sizzle, as evidences by Friday's hot CPI reading which showed the highest annual headline increase in nearly four decades. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2SV0W9\" data-type=\"storyId\" data-story-id=\"nL1N2SV0W9\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Here's your opening snapshot:</p><p><div class=\"tr-resource-ref\" id=\"g41e61d65-cfaf-42a1-b045-08374f089a37\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://graphics.reuters.com/USA-STOCKS/zgpomnzokpd/opener.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9ncmFwaGljcy5yZXV0ZXJzLmNvbS9VU0EtU1RPQ0tTL3pncG9tbnpva3BkL29wZW5lci5wbmc=&amp;storyId=urn:newsml:reuters.com:20211213:nL1N2SY22K:4&amp;key=7e668f69c09fa0241c385ad5716b6d23d09742e8a93bb5c171d77ba5856f5e35434d6cfc5dd1b00ae44b76a23999182f721e8fb72f7f0ca13802d896165ae295\"/></div></div></div></p><p>(Stephen Culp)</p><p>*****</p><p><br/></p><p>NASDAQ COMPOSITE: STOKING THE FURNACE? (0900 EST/1400 GMT)</p><p>Despite less than stellar breadth readings on Friday along with the S&amp;P 500's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.SPX\" data-type=\"ric\" data-ric=\".SPX\" translate=\"no\" dir=\"ltr\">.SPX</a> fresh record-high close <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2SV1X5\" data-type=\"storyId\" data-story-id=\"nL1N2SV1X5\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span>, the Nasdaq New High/New Low (NH/NL) index, has made a constructive turn:</p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"g217bbb18-9a4b-4fbc-99bb-64ed915a3929\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://fingfx.thomsonreuters.com/gfx/buzz/mopanqdaxva/IXICNHNL12132021.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9maW5nZngudGhvbXNvbnJldXRlcnMuY29tL2dmeC9idXp6L21vcGFucWRheHZhL0lYSUNOSE5MMTIxMzIwMjEucG5n&amp;storyId=urn:newsml:reuters.com:20211213:nL1N2SY22K:4&amp;key=a3592ac760435981ed1f37fd4a29dad11857f6e70fc6998daea73bfa6d96200f4664d70132e9fcf53b6b5fef96d88bb69dc2de71c774445a728f35fcfa9eb177\"/></div></div></div></p><p><br/></p><p>This measure of internal strength may have become sufficiently washed out with the Nasdaq's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.IXIC\" data-type=\"ric\" data-ric=\".IXIC\" translate=\"no\" dir=\"ltr\">.IXIC</a> recent weakness. After falling to 12.5% on December 6 <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2ST0OJ\" data-type=\"storyId\" data-story-id=\"nL1N2ST0OJ\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span>, which was its lowest reading since early-April 2020, the NH/NL index has now risen four-straight days.</p><p>In so doing, this measure ended Friday at 21.1% which put it above its descending 10-day moving average, at 19.5%, for the first time since November 12. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2SV0MO\" data-type=\"storyId\" data-story-id=\"nL1N2SV0MO\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>It now remains to be seen if last week's sharp NH/NL index upturn from especially depressed levels will lead to the broader Nasdaq re-heating, and therefore, fuel a more sustained IXIC rise. Indeed, there certainly is room for the NH/NL index to rise before it will encounter resistance lines from its highs earlier this year. The measure's early November peak was at 75.7%.</p><p>Of note, current readings on the NYSE show a similar picture as the Nasdaq. After also falling to its lowest level since early-April 2020, the NYSE's measure also ended Friday above its 10-DMA.</p><p>A Nasdaq NH/NL index violation of its Dec. 6 low can open the door for a test of its March 2020 trough at 1.2%, something which could put the IXIC on ice.</p><p><br/></p><p>(Terence Gabriel)</p><p>*****   </p><p><br/></p><p>FOR MONDAY'S LIVE MARKETS' POSTS PRIOR TO 0900 EST/1400 GMT - CLICK HERE: <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2SY0UC\" data-type=\"storyId\" data-story-id=\"nL1N2SY0UC\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span>  </p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Terence Gabriel is a Reuters market analyst. The views expressed are his own)</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: GLOBAL-STOCKS/</p></div>"}