{"date": "2022-01-13 23:28:23.224000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3304.14, "close": 3242.76}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> -owned grocery store <a href=\"https://www.independent.co.uk/topic/whole-foods\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Whole Foods</a> is fighting a legal battle for the right to stop its employees from wearing \" <a href=\"https://www.independent.co.uk/topic/black-lives-matter\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Black Lives Matter</a> \" insignia on their face masks.</p><p>According to a report by <a href=\"https://www.bloomberg.com/news/articles/2021-12-04/u-s-accuses-whole-foods-of-banning-black-lives-matter-masks\"><span>Bloomberg</span> </a> , the grocery chain's latest filing argues that forcing it to allow its employees to wear Black Lives Matter insignia suppresses the company's First Amendment rights.</p></div><div class=\"tr-npp-body\"><p>The filing comes as a response to a National Labour Relations Board complaint in December that the grocery chain was violating its employees' rights by banning the BLM imagery.</p><p>According to the NLRB, Whole Foods is denying its workers the right to participate in \"concerted activities for their mutual aid and protection\". The NLRB is also accusing Whole Foods of participating in retaliatory behaviour by threatening to fire workers who wore BLM logos after being warned not to do so.</p><p>According to the NLRB, Whole Foods workers in 10 states were punished for wearing BLM insignia.</p><p>Whole Foods argues that the NRLB is trying to \"compel\" speech because it singled out the phrase \"Black Lives Matter\".</p><p>\"By singling out the phrase 'Black Lives Matter', the General Counsel is impermissibly favoring, and requiring that WFM favour, certain expressions of political speech over others in its retail grocery stores,\" the filing said, according to <a href=\"https://www.businessinsider.com/whole-foods-black-lives-matter-constitutional-rights-violated-first-amendment-2022-1\"><span>Business Insider.</span> </a> </p><p>\"The General Counsel seeks to compel employer speech by WFM in violation of the WFM's rights under the First Amendment to the United States Constitution, and enforcement of any Order from the Board to compel such speech would violate the Constitution.\"</p><p>The grocery store's dress code prohibits employees for wearing any visible slogans, logos or messages not related to the company.</p><p>\"Our dress code policy is designed to ensure we are giving team members a workplace and customers a shopping experience focused entirely on excellent service and high-quality food,\" a spokesperson told <span>Business Insider</span> . \"We do not believe we should compromise that experience by introducing any messages on uniforms, regardless of the content, that shift the focus away from our mission.\"</p><p>A group of employees pushed back against the dress code and sued Whole Foods in July 2020 after they were barred from wearing BLM imagery. The group claims that Whole Foods threatened to fire them if they wore the images in defiance of the dress code.</p><p>Employees claim that they had \"commonly worn Pride flags in support of their LGBTQ+ coworkers without being disciplined by Whole Foods\", calling the company's alleged threat \"selective enforcement\" that \"constitutes unlawful discrimination\".</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/news/colorado-whole-foods-university-of-michigan-denver-california-b1985462.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Climate change, new construction mean more ruinous fires</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/us-politics/fauci-hot-mic-roger-marshall-b1991054.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Fauci caught on hot mic calling senator 'a moron' after heated questioning</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/helicopter-crash-philadelphia-church-survivors-b1991076.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Four, including a baby, survive helicopter crash next to church in 'absolute miracle'</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 Independent, The (UK) (Online). All rights reserved.</p></div>"}