{"date": "2021-11-22 15:10:56.904000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>AMAZON.COM INC (\"AMZN-Q\")\n- Customers Can Shop and Save on Thousands of Deals During Cyber\n- Monday Weekend\n\n  Mark your calendars for a weekend of savings. Amazon today revealed a\nsneak peek of the thousands of deals customers can shop during its Cyber\nMonday deals weekend, which kicks off on Saturday, November 27, and runs\nthrough Monday, November 29. Throughout the deals event, customers can\nscore incredible savings across every category, as well as deep discounts\non popular products and must-have items including electronics from Samsung\nand LG, home and kitchen essentials from Shark, Vitamix, and Cuisinart,\nmust-have toys from Hasbro, LEGO, and Crayola, beauty favorites from\nRevlon, top fashion picks from Ray-Ban, and select Alexa-enabled devices\nlike the Amazon Fire TV 50\" 4-Series. All weekend long, customers can also\nshop thousands of amazing deals from independent selling partners, most of\nwhich are small and medium-sized businesses, including deals from\nwomen-owned, Black-owned, and military family-owned businesses.\n\n  Gifting Inspiration\n\n  For customers who need a little extra inspiration on what to gift their\nloved ones this year, Amazon has you covered. All throughout the season\ncustomers can continue to shop and discover items from Amazon's biggest\nselection of gift guides yet--including the popular Holiday Toy List and\nOprah's Favorite Things list, as well as the curated Customers' Most-Loved\nGifts guide and Experts' Gift Picks gift guide, which features top picks\nfrom A-list celebrities like Jessica Alba, Jojo Siwa, gold medalist Suni\nLee and influencer duo Aint Afraid, and media outlets including BuzzFeed\nand Refinery29, among others.\n\n  On Cyber Monday, Amazon Live will hold various livestream events\nshowcasing a curated selection of the best deals, product demonstrations,\ntry-on hauls, and live chats hosted by celebrities and influencers,\nincluding supermodel and entrepreneur Miranda Kerr, country singer and\nsongwriter Jessie James Decker, and fashion influencer Aimee Song. Viewers\ncan easily shop featured products and brands through a carousel that\nupdates in real-time. To watch, visit amazon.com/live or the Amazon Live\nShopping app on Fire TV.\n\n  Cyber Monday Deals Preview\n\n  Below is a sampling of top deals and products that will be available at\nvarious dates and times between Saturday, November 27, and Monday, November\n29, while supplies last. Customers can shop Cyber Monday deals at\namazon.com/cybermonday, on the Amazon shopping app, or by asking, \"Alexa,\nwhat are my deals?\" Select Cyber Monday deals will also be available at all\nAmazon 4-star store and Amazon Books store locations. Prime members also\ncan enjoy 30 minutes of early access to the hottest Lightning Deals on\nAmazon throughout the holiday season, and every day.\n\n//st\n\n* Toys and Games: Save up to 30% on select building sets, including from\n  LEGO and Playmobil. Save up to 30% on Hasbro games. Save up to 30% on\n  arts and crafts toys from Crayola and other brands. Save up to 30% on\n  select board games including Catan and Ticket to Ride. Save up to 30% on\n  Osmo educational kits and games. Save up to 30% on Learning Resources and\n  Educational Insights learning toys.\n* Seasonal Fashion: Save up to 40% on select Orolay down jackets and\n  parkas. Save up to 30% on select Crocs. Save up to 30% on select True &amp;\n  Co. bras and underwear. Save up to 30% on select Ray-Ban sunglasses. Save\n  up to 20% on select outerwear from Calvin Klein, Tommy Hilfiger, DKNY,\n  and more. Save up to 25% on a Made For You custom t-shirt. Save up to 25%\n  on select active and lounge styles from Shopbop, including Honeydew\n  Intimates, Z Supply, and Alala.\n* Home and Kitchen: Save up to 35% on select Instant Pot appliances, and\n  select cookware and kitchen essentials from All-Clad, Ninja, Vitamix,\n  Calphalon, Cuisinart, and SodaStream. Save up to 31% on select iRobot\n  Roomba vacuums, select air purifiers from Blue Air and Coway, and sewing\n  machines from Brother and Singer. Save up to 30% on select furniture.\n* Electronics: Save up to 33% on select TVs from Samsung, Sony, and LG.\n  Save on select headphones from Bose, Sony, and JBL. Save up to 30% on\n  select HP monitors, laptops, and all-in-one desktops. Save up to 34% on\n  select Nixplay digital picture frames. Save $20 on select Nintendo Switch\n  Pro controllers. Save 25% on the MYNT3D Professional Printing 3D Pen.\n* Beauty and Personal Care: Save up to 50% on select electric toothbrushes\n  from Oral-B and Philips Sonicare. Save up to 39% on electric shavers,\n  razors, and blades from Braun, Gillette, and more. Save up to 30% on hair\n  care from Revlon, Bed Head, and other brands. Save up to 52% on 23andMe\n  Personal Genetic Service DNA Test Kits.\n* Amazon Brands: Save up to 30% on Amazon Basics kitchen products. Save up\n  to 30% on clothing for kids and babies from Our Brands. Save up to 30% on\n  coffee from Our Brands.\n* Amazon Devices: Save up to 47% on the Echo Show 5. Save up to 45% on\n  Amazon Halo Band fitness tracker. Save up to 40% on Kindle and up to 28%\n  on Kindle Paperwhite Kids. Save up to 40% on Fire HD 10 Kids Pro tablet.\n  Save up to 36% on the Fire TV Stick 4k Max. Save up to 30% on Amazon Fire\n  TV 50\" 4-Series.\n* Home Improvement, Tools, and Garden: Save up to 30% on select\n  BLACK+DECKER tools. Save on select tools from DEWALT, GEARWRENCH, and\n  SKIL. Save 25% on select Level Home smart locks. Save up to 40% on select\n  spas and pools from Bestway and more.\n* Baby: Save on select baby essentials from Philips Avent. Save on select\n  feeding products from Dr. Brown's such as bottles and pacifiers. Save on\n  select Cybex gb Pockit strollers. Save up to 30% on select Britax car\n  seats. Save 25% on select Safety 1st Grow and Go car seats. Plus, save on\n  select items from Joovy this holiday season.\n* Pets: Save 30% on select pet gifts and supplies, including toys, treats,\n  beds, and crates. Save up to 25% on select Bissell pet care items. Save\n  20% on Petmate Husky Dog House for dogs up to 90 pounds. Receive a free\n  sample of Greenies new supplement product, while supplies last.\n* Sports and Outdoors: Save up to 30% on select Nalgene Sustain water\n  bottles. Save up to 30% on select Weider Platinum Strength products. Save\n  up to 30% on select CamelBak bottles and accessories. Save up to 30% on\n  select electric scooters, bike racks, and stands from Segway, Hover-1,\n  and more.\n* Entertainment: Save up to 50% on select Prime Video movies to rent or\n  buy, from new releases to classics, plus hit TV shows, seasonal content,\n  and more. Plus, new customers get 50% off this season's NBA League Pass\n  and NBA Team Pass subscription following a seven-day free trial. Save\n  with Amazon Music Unlimited, free for three months for new customers, or\n  free for six months with the purchase of select Amazon Echo devices.\n  Plus, customers can listen to their favorite Wondery podcasts with 40%\n  off a one-year subscription to Wondery+. Save up to 59% on a new annual\n  membership to IMDbPro. Readers can save up to 80% on popular eBooks, up\n  to 50% on select Kindle exclusive titles, and up to 30% on Wheel of Time\n  boxed sets.\n* Virtual Travel and Experiences: For those on your list who have\n  everything or are experience seekers, save up to 50% on all Amazon\n  Explore experiences, hosted by local experts. U.S. customers have access\n  to a wide range of livestreamed, interactive experiences across the\n  globe--all from the comfort of their homes. Customers can shop unique\n  items, learn how holidays are celebrated around the world, and gift\n  experiences to their friends and family.\n\n//et\n\n  Shop and Support Small and Medium-Sized Businesses\n\n  Amazon hosts more than 500,000 U.S. independent selling partners, most of\nwhich are small and medium-sized businesses, in its store and helps them\nreach hundreds of millions of customers globally, increase their sales, and\ncreate jobs--including an estimated 1.8 million U.S.-based jobs in 2020.\nCustomers can support these small and medium-sized businesses and save on\ngifts by shopping the Small Business, Amazon Handmade and Amazon Launchpad\ngift guides, and by visiting amazon.com/supportsmall.\n\n  How Amazon is Delivering this Season\n\n  Amazon employees around the world team up to meet the needs of customers\nduring the holiday season--and every day after. Recently, Amazon announced\nplans to add 125,000 full- and part-time roles, plus an additional 150,000\nseasonal jobs. Employees are the heart and soul of the company, which is\nwhy Amazon offers an average starting wage of $18 per hour, sign-on bonuses\nup to $3,000, and an additional $3 per hour depending on shifts in many\nlocations. In addition to hiring, Amazon has made investments across\ntechnology, supply chain planning, transportation, and delivery teams in\npreparation for the holiday season in an effort to get customers what they\nwant, when they want it, wherever they are. Visit About Amazon to learn\nmore about Amazon's plan to serve customers this holiday season.\n\n  Fast, Free, and Convenient Delivery Options\n\n//st\n\n* Free One-Day and Same-Day Delivery: Prime members in the U.S. can shop a\n  selection of over 10 million items eligible for Prime Free One-Day\n  Delivery with no minimum purchase, and millions of items are available\n  for Free Same-Day Delivery in 47 major metropolitan areas. Prime members\n  can also shop over 3 million items available for delivery in as fast as\n  five hours with faster Same-Day Delivery--now available in 15 cities.\n  These fast delivery options are not only convenient for customers,\n  they're better for the planet. Same-Day deliveries ship from local\n  fulfillment centers, so the items travel shorter distances and generate\n  less carbon emissions. This is just another way Amazon is reducing the\n  impact of climate change on future generations by building a sustainable\n  business. Learn more at amazon.com/primedelivery or start a free 30-day\n  trial of Prime at amazon.com/prime.\n* Ultrafast Grocery Delivery and Pickup: Prime members in more than 5,000\n  cities and towns have access to two-hour grocery delivery on more than\n  170,000 products from Whole Foods Market and Amazon Fresh. With Amazon\n  Fresh, Prime members get free two-hour delivery, plus free grocery pickup\n  at select Amazon Fresh stores on orders over $35. Prime members can also\n  find toys, gifts, household products, everyday essentials, electronics,\n  Amazon devices, and more at Amazon Fresh. Prime members get free pickup\n  on orders over $35 from Whole Foods Market stores nationwide.\n* Delivery Where it's Needed Most: Whether customers are road-tripping to\n  see family, staying home and need a secure delivery location, or sending\n  a gift to a loved one or friend, Amazon provides thousands of package\n  pickup locations for customers. These locations are conveniently located\n  near or in offices, convenience stores, malls, apartment buildings, and\n  grocery stores in more than 900 cities and towns across the U.S. Tens of\n  millions of products can be easily and conveniently delivered to an\n  Amazon pickup point at Whole Foods Market, 7-11, Chase Bank, Rite-Aid,\n  HealthMart, GNC, Stage Stores, and other locations. To find a location,\n  visit amazon.com/Hub.\n* Extended Returns Window: Most of the items purchased between October 1,\n  2021, and December 31, 2021, can be returned until January 31, 2022.\n\n//et\n\n  Get the latest news by visiting About Amazon, where you can find shopping\ntips and ways to save this season and learn more about holiday delivery.\n\n  About Amazon\n\n  Amazon is guided by four principles: customer obsession rather than\ncompetitor focus, passion for invention, commitment to operational\nexcellence, and long-term thinking. Amazon strives to be Earth's Most\nCustomer-Centric Company, Earth's Best Employer, and Earth's Safest Place\nto Work. Customer reviews, 1-Click shopping, personalized recommendations,\nPrime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career\nChoice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out\ntechnology, Amazon Studios, and The Climate Pledge are some of the things\npioneered by Amazon. For more information, visit amazon.com/about and\nfollow @AmazonNews.\n\nAmazon.com, Inc.\nMedia Hotline\nAmazon-pr@amazon.com\nwww.amazon.com/pr\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132500225.MNPRE2132501633-06594720211122</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}