{"date": "2021-12-07 20:11:45.121000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>UNISYS CORP (\"UIS-N\")\n- Unisys Transform California State University's Digital Strategy\n- With Fast, Secure Data for Application Development\n\n Delphix, an industry-leading data company for DevOps, and Unisys\nCorporation, a global IT solutions company, today announced that they have\naccelerated California State University's (CSU) digital strategy by\nproviding quick and secure access to data to support student application\ndevelopment.\n\n The nation's largest four-year public university can now provide its 23\ncampuses with data on-demand to implement their own digital strategies.\nThis kind of rapid access has enabled software engineers at the campuses to\nquickly develop innovative applications to enable Graduation Initiative\n2025, an ambitious project that aims to increase graduation rates while\neliminating opportunity and achievement gaps. The project also includes\napplications that enable students to check their grades, financial aid,\ngraduation status, etc.\n\n The initiative is a part of the university's larger hybrid architecture\nstrategy aimed at improving graduation rates, student experience and\nsatisfaction, and eliminating equity gaps in graduation rates.\n\n Hybrid architecture Strategy\nUnisys enables CSU to leverage the Delphix DevOps Data Platform to\naccelerate and simplify its Hybrid-Architecture enablement. The platform's\nability to easily spin up, refresh, and tear down private and public\ncloud-based data environments dramatically enhances the university's\napplication delivery pipeline.\n\n \"Using Delphix and Unisys to implement our hybrid architecture strategy\nallows us, for the first time, to create a unified and secure data lake,\npopulated daily with data from all 23 campuses. This makes the data easily\naccessible and quickly consumable at a large scale. Our data analysts, data\nscientists, and developers can now drive faster innovation and proactively\nestablish student support programs to improve graduation rates,\" said\nMichael Berman, CIO at CSU.\n\n The university's hybrid architecture strategy includes data migration from\nan on-premise Common Management System (CMS) to Amazon Web Services (AWS),\nacross all campuses. The CMS serves nearly 500,000 students and 56,000\nfaculty and staff, and is critical to everything from student enrollment,\nstudent management, scheduling, and registration to human resources,\nfinancials, and employee compensation.\n \"We are pleased CSU and Unisys selected AWS as a strategic cloud provider\nto power its digital transformation,\" said Kim Majerus, Vice President, US\nEducation, State and Local Government at AWS. \"Moving to AWS can help CSU\nbecome more agile and empower them to use data more strategically to gain\nvaluable insights that will improve the student experience. In addition, it\ncan help the university system scale faster, reduce technical debt, realize\ncost savings, and manage operations more efficiently.\"\n\n Impact on Cost and Efficiency\nDelphix and Unisys work together with CSU to help the university reduce\ncosts and improve operational efficiency.\n\n Using Delphix and Unisys, CSU has saved over $4.5M per year and avoided\nfuture costs of over $7M per year in data storage expenditures, thus\nfreeing up resources to fund innovation. The initiative has also\nsignificantly improved CSU's productivity measures.\n\n *  The Delphix DevOps Data Platform delivers virtual masked copies of the\nCMS production data on-demand, using a fraction of the storage space\ncompared to physical data storage. This has helped Unisys reduce CSU's\nphysical storage consumption while allowing its campuses to use\nself-service to clone and manipulate their data.\n *  Delphix's data automation helps Unisys deliver data faster and more\nfrequently to CSU's campuses. The application teams can now instantly\nrefresh copies with updated production data, rewind data to any previous\npoint in time, and branch out data copies so data versions align with\nrelease versions, all of which dramatically improve productivity.\n\n \"We are proud to partner with Delphix to enable CSU's hybrid architecture\nstrategy to provide improved data delivery, data access, and data\nintegration to better support the digital strategies at CSU,\" said Rudy\nGonzalez, Unisys CSU Program Director. \"We remain committed to helping CSU\nhave much greater agility to execute digital cloud strategies to better\nserve the campuses and improve the student experience.\"\n\n Jedidiah Yueh, Delphix CEO, added, \"Transformational automation is a\ngame-changer, enabling 100x increases in innovation velocity. Modern data\nautomation with integrated security and compliance enables CSU to improve\nstudent outcomes and experiences, spend less on infrastructure, and invest\nmore in strategic initiatives.\"\n\n About Delphix\nDelphix is the industry leading data company for DevOps.\n\n Data is critical for testing application releases, modernization, cloud\nadoption, and AI/ML programs. We provide an automated DevOps data platform\nfor all enterprise applications. Delphix masks data for privacy compliance,\nsecures data from ransomware, and delivers efficient, virtualized data for\nCI/CD.\n\n Our platform includes essential DevOps APIs for data provisioning,\nrefresh, rewind, integration, and version control. Leading companies,\nincluding Choice Hotels, J.B.Hunt, and Fannie Mae, use Delphix to\naccelerate digital transformation. For more information, visit\nwww.delphix.com or follow us on LinkedIn, Twitter, and Facebook.\n\n About Unisys\nUnisys is a global IT solutions company that delivers successful outcomes\nfor the most demanding businesses and governments. Unisys offerings include\ndigital workplace solutions, cloud and infrastructure solutions, enterprise\ncomputing solutions, business process solutions and cybersecurity\nsolutions. For more information on how Unisys delivers for its clients\nacross the commercial, financial services and government markets, visit\nwww.unisys.com.\n\nFollow Unisys on Twitter and LinkedIn.\n\nOrlando de Bruce\nVP of Corporate Marketing &amp; Brand\nOrlando.Debruce@delphix.com\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134000525.MNPRE2134002950-12060520211207</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}