{"date": "2021-11-07 18:00:44.915000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-abstract\"><p>Independent directors of Future Retail (FRL) have complained to the Competition Commission of India (CCI), saying that American retail giant Amazon had violated foreign direct investment norms when it picked up a 49 per cent stake in the company\u0092s promoter entity, Future Coupons (FCPL), and applied for the CCI\u0092s approval by concealing facts.</p></div><div class=\"tr-npp-lead\"><p>Asking the CCI to revoke the approval granted to Amazon to buy a stake in FCPL, the independent directors said the watchdog should act to stop Amazon from perpetuating \u0093its evil non-desirable designs\u0094 against the Indian company.</p><p>FCPL owns 9.9 per cent in FRL and Amazon had picked up a stake in FCPL in September 2019 just before FRL\u0092s</p></div><div class=\"tr-npp-body\"><p>sales started falling and the company started defaulting in payments to its vendors. Later, the pandemic made things worse for the group. After Future Group sold its businesses to Reliance Retail, Amazon moved the Singapore International Arbitration Centre, asking it to stop the transaction based on its non-compete and right of first refusal agreements with Future Group promoters.</p><p>In a statement to the stock exchanges, the independent directors of FRL said the board of the company, consisting of a majority of independent directors, was not aware that the strategic rights to the company were being acquired by Amazon.</p><p>The FCPL shareholders\u0092 agreement between the Future promoters and Amazon has not been approved by the FRL board.</p><p>Further, the FRL shareholders\u0092 agreement has not been incorporated in its articles of association, the directors said.</p><p>In its letter on Sunday, the directors said Amazon had not disclosed its strategic interest in FRL to the CCI.</p><p>This was to prevent it from referring the transaction to other governmental agencies. In that case, the agencies would have said the transaction was illegal and hence, Amazon could not have proceeded with it. \u0093Amazon sought and obtained the approval of the Commission on the basis that it was investing in the business of FCPL and not on the basis that it was acquiring strategic, material, and special rights over FRL in preference to all the shareholders of FRL, which it has claimed with success in the arbitral tribunal now,\u0094 the directors said.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}