{"date": "2022-02-01 08:30:34.534000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>System for IoT Devices</p>\n<p>The u-blox IoT certificate manager automatically renews device credentials according to industry requirements to ensure futureproof protection.</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>THALWIL, SWITZERLAND / ACCESSWIRE / February 1, 2022 / u-blox (SIX:UBXN)(OTC PINK:UBLXF), a leading global provider of positioning and wireless communication technologies and services, has announced the IoT certificate manager, a new security service that continuously renews device credentials in a fully automated mode. Together with u-blox's existing zero touch provisioning service, it provides out-of-the-box on-boarding to IoT cloud platforms with total control of the device certificate lifecycle.</p>\n<p>Certificate lifecycle control targets IoT devices that integrate with leading IoT cloud platforms including the AWS IoT Core, Azure IoT Hub, and DPS services. While these take charge of device management and data aggregation, the u-blox service provides an effortless, secure, and cost-effective way to manage the X.509 certificates required for device authentication.</p>\n<p>X.509 certificates have become a cornerstone of IoT security. Secure provisioning requires extensive experience, complex software development, and robust production line tools and processes.</p>\n<p>Certificate management efforts grow exponentially with increasing fleet size. While in the past issued certificates remained valid throughout a device's lifecycle, increases in infrastructure complexity and risks have forced regulatory authorities to demand more frequent - yearly or monthly - renewals. Failure to meet renewal deadlines can expose devices to cyberthreats, disrupt service availability, and undermine business.</p>\n<p>IoT certificate manager simplifies scaling...</p>\n<p>u-blox new IoT certificate manager eliminates the task of manually managing credential renewal on thousands of devices. Designed and optimized for IoT scenarios, it eliminates the errors that can occur during manual operation on large IoT deployments, freeing resources for other activities. Delivery via the intuitive Thingstream IoT service delivery platform with its simple and flexible price plans lets users engage more efficiently and reduce time to market.</p>\n<p>... and futureproofs protection</p>\n<p>The IoT certificate manager futureproofs protection by increasing security levels over the entire device lifetime. Building on the root of trust included in u-blox SARA-R5 series LTE-M cellular modems, it provides a fully integrated silicon-to-cloud security solution that is unmatched in the industry.</p>\n<p>&amp;quot;IoT certificate manager is all about enabling IoT solution developers to easily manage device credentials for an IoT lifetime, to scale seamlessly from prototyping to huge fleets, and to minimize set-up costs, giving companies more time and resources to grow their business,&amp;quot; says Giovanni Solito, Senior Product Manager, Product Center Services, at u-blox.</p>\n<p>Zero touch provisioning and IoT certificate manager services are available immediately.</p>\n<p>About u-blox</p>\n<p>u-blox (SIX:UBXN) is a global technology leader in positioning and wireless communication in automotive, industrial, and consumer markets. Their smart and reliable solutions, services and products let people, vehicles, and machines determine their precise position and communicate wirelessly over cellular and short range networks. With a broad portfolio of chips, modules, and secure data services and connectivity, u-blox is uniquely positioned to empower its customers to develop innovative and reliable solutions for the Internet of Things, quickly and cost-effectively. With headquarters in Thalwil, Switzerland, the company is globally present with offices in Europe, Asia, and the USA. (www.u-blox.com) Find us on Facebook , LinkedIn , Twitter @ublox and YouTube u-blox media contact:</p>\n<p>Natacha SeitzSenior Manager PR and Content MarketingMobile +41 76 436 0788natacha.seitz@u-blox.com</p>\n<p>SOURCE: u-blox AG</p>\n<p>View source version on accesswire.com: <a href=\"https://www.accesswire.com/686570/u-blox-AG-u-blox-Launches-Scalable-Digital-Certificate-Management-System-for-IoT-Devices\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.accesswire.com/686570/u-blox-AG-u-blox-Launches-Scalable-Digital-Certificate-Management-System-for-IoT-Devices</a></p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}