{"date": "2021-11-22 13:41:45+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By David Henry and Matt Scuffham</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW YORK, Nov 22 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>'s latest spat with Visa <a href=\"reuters://REALTIME/Verb=FullQuote/ric=V.N\" data-type=\"ric\" data-ric=\"V.N\" translate=\"no\" dir=\"ltr\">V.N</a> shows big retailers, armed with a growing array of payment options, are gaining the upper hand in their power struggle with card providers, but it's not a crisis for the payment company. </p><p>Amazon said last week that it would <a href=\"https://www.reuters.com/world/uk/amazon-stop-accepting-visa-credit-cards-britain-2021-11-17\" data-type=\"url\" class=\"tr-link\" translate=\"no\">stop accepting Visa</a> credit cards issued in the United Kingdom from Jan. 19, 2022, saying that despite technology advancements the fees on such transactions remained high or in some cases were rising. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2S84NP\" data-type=\"storyId\" data-story-id=\"nL8N2S84NP\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>While Amazon may yet back down on the UK front, where the company accounts for less than 1% of Visa's credit card volume, according to an estimate by Piper Sandler analysts, the dispute is a bad sign for the card industry. Some analysts said it  could presage a fight in the much bigger U.S. market. </p><p>\"Amazon is treating this dispute with Visa as an experiment,\" said Piper Sandler analyst Christopher Donat. \"Our biggest concern is that Amazon seeks concessions from Visa in other geographies.\" </p><p>Visa Chief Financial Officer Vasant Prabhu <a href=\"https://www.reuters.com/business/finance/exclusive-visa-cfo-prabhu-says-company-confident-resolving-amazon-dispute-2021-11-19\" data-type=\"url\" class=\"tr-link\" translate=\"no\">told Reuters</a> in an interview on Friday that he expected a resolution. \"We've resolved these things in the past and I believe we'll resolve them in the future,\" he said. Amazon declined to comment. </p><p>Credit cards dominated a third of North American ecommerce spending in 2020, according to payments giant WorldPay, but mobile payment options like Venmo and 'buy now, pay later' (BNPL) financing plans are chipping away at their market share.  </p><p>While alternative payments have been growing for years, the pandemic accelerated a downward trend in credit card applications boosting the popularity of BNPL financing, especially among younger consumers. </p><p>Credit cards' share of North American e-commerce spending declined 7% last year, according to WorldPay, while BNPL's share increased 78%, making it the fastest-growing form of payment.</p><p>In <a href=\"https://www.reuters.com/business/retail-consumer/affirm-amazon-partner-enable-pay-over-time-feature-2021-08-27\" data-type=\"url\" class=\"tr-link\" translate=\"no\">August</a>, Amazon partnered with BNPL provider Affirm to offer installment financing option on U.S. Amazon purchases. </p><p>\"Credit cards are still dominant players for non-cash transactions, but they need to be aware of the growing competition,\" Chris Dinga, payments analyst at GlobalData, wrote on Friday.</p><p>\"BNPL is gradually being adopted by retailers as they see higher conversion and growth opportunity by providing it to their customers,\" Dinga wrote, adding high credit card fees could accelerate BNPL adoption by retailers.  </p><p>Some analysts said past disputes suggested Visa may have to blink before Amazon, such as when U.S. restaurant owners stopped taking Amex cards in the 1990s, leading Amex to reduce its fees. </p><p>\"Visa may need to follow American Express's example,\" Evercore analysts said in a research note.</p><p><br/></p><p>'AGNOSTIC'</p><p>Still, Visa has survived such fights and few other merchants have Amazon's heft, said Prabhu. </p><p>\"Even a very large retailer like Amazon represents a relatively small portion of our payment volume,\" he said.  </p><p>And Visa is not wedded to credit cards as the primary transaction source, he added. </p><p>\"If a merchant wants to offer credit in a different way, we're agnostic. We will do both. The buy now, pay later business has been a positive for us.\"</p><p>Visa has been partnering with BNPL providers, including Sweden's Klarna.</p><p>Retailers also benefit from credit card issuers offering their customers cash rebates and rewards programs to encourage them to spend more than they otherwise would.  </p><p>Prabhu said he expected credit card spending to pick up now that borders are opening and affluent customers are spending more on travel, entertainment and eating out.</p><p>And Amazon also needs a partner for its own co-branded credit card. The company is considering replacing Visa on U.S. co-branded credit cards with either Mastercard or American Express, suggesting its UK fee dispute could be a negotiating tactic, said analysts. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2S84NP\" data-type=\"storyId\" data-story-id=\"nL8N2S84NP\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>\"It's not necessarily a good idea for merchants to restrict consumer choice,\" said Prabhu. \"Amazon will have to think about that, too.\"</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Editing Michelle Price and Nick Zieminski)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:David.Henry@thomsonreuters.com\" data-type=\"email\" translate=\"no\">David.Henry@thomsonreuters.com</a> ; +1-332-219-1974; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://david.henry.thomsonreuters.com@reuters.net\">david.henry.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-VISA/ (ANALYSIS, PIX)</p></div>"}