{"date": "2021-09-15 22:42:39.221000+00:00", "ticker": "III", "mrkt_info": {"open": 1271.0, "close": 1292.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>WESTCOAST ENERGY INC (\"W.PR.M-T\")\nENBRIDGE INC (\"ENB-TN\")\n- Westcoast Energy Announces Redemption of Cumulative 5-Year Minimum\n- Rate Reset Redeemable First Preferred Shares, Series 12\n\n     Westcoast Energy Inc. (\"Westcoast\") announced today that it intends to\nexercise its right to redeem all of its outstanding Cumulative 5-Year\nMinimum Rate Reset Redeemable First Preferred Shares, Series 12 (\"Series 12\nShares\") on October 15, 2021 at a price of $25.00 per Series 12 Share,\ntogether with all accrued and unpaid dividends, if any.\n\n     Beneficial holders who are not directly the registered holders of the\nSeries 12 Shares should contact the financial institution, broker or other\nintermediary through which they hold these shares to confirm how they will\nreceive their redemption proceeds. Inquiries from registered shareholders\nshould be directed to Westcoast's Registrar and Transfer Agent,\nComputershare Investor Services Inc., at 1-800-564-6253 (Canada and United\nStates) or 1-514-982-7555 (Outside North America).\n\n     Westcoast Energy Inc. is an indirect subsidiary of Enbridge Inc.\n\n     About Enbridge Inc.\n\n     Enbridge Inc. is a leading North American energy infrastructure\ncompany. We safely and reliably deliver the energy people need and want to\nfuel quality of life. Our core businesses include Liquids Pipelines, which\ntransports approximately 25 percent of the crude oil produced in North\nAmerica; Gas Transmission and Midstream, which transports approximately 20\npercent of the natural gas consumed in the U.S.; Gas Distribution and\nStorage, which serves approximately 3.8 million retail customers in Ontario\nand Quebec; and Renewable Power Generation, which generates approximately\n1,766 MW of net renewable power in North America and Europe. The Company's\ncommon shares trade on the Toronto and New York stock exchanges under the\nsymbol ENB. For more information, visit www.enbridge.com.\n\nInvestment Community\nJonathan Morgan\nToll Free: (800) 481-2804\nEmail: investor.relations@enbridge.com\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2125700694.MNPRE2125703318-15213320210915</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}