{"date": "2021-12-02 14:05:00.381000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Blue Apron Now Available with Amazon Alexa</b>\n</p><p class=\"bwalignc\">\nCustomers Can Prepare Their Favorite Recipe or Order a Meal Kit Using Their Alexa-Enabled Device\n</p><p>\nBlue Apron (NYSE: APRN) recipes are now available with Amazon Alexa, allowing for easier home cooking and more culinary exploration. Customers can prepare their Blue Apron Two-Serving and Four-Serving recipes with hands-free instructions on Alexa-enabled devices. In addition, individuals with Echo Show devices have the option to order select Blue Apron meal kits, no subscription required.\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: <a href=\"https://www.businesswire.com/news/home/20211202005586/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211202005586/en/</a></p><div id=\"bwbodyimg\" style=\"width:480px;float:left;padding-left:0px;padding-right:20px;padding-top:0px;padding-bottom:0px\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Blue Apron meal kits are now available on all Alexa-enabled devices. (Photo: Business Wire)\" src=\"https://mms.businesswire.com/media/20211202005586/en/932281/4/Blue_Apron_Amazon_Alexa_%281%29.jpg\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbXMuYnVzaW5lc3N3aXJlLmNvbS9tZWRpYS8yMDIxMTIwMjAwNTU4Ni9lbi85MzIyODEvNC9CbHVlX0Fwcm9uX0FtYXpvbl9BbGV4YV8lMjgxJTI5LmpwZw==&amp;key=ffaeb3ef1345ef53b9d722be3b9572998dba1370b2e6cd30bed1fe167972006d211481510848bff6dff8b9ed94c22a3105f0fee6cf12ae32dc551ea8a9bb2324\"/></div></div><p style=\"font-size:85%\">Blue Apron meal kits are now available on all Alexa-enabled devices. (Photo: Business Wire)</p></div><p>\n“We continue to add more product flexibility that addresses our customers’ diverse cooking interests and desire for unique flavors. Through this collaboration, Alexa customers in the United States can now prepare our delicious recipes in a new and convenient way,” said Dani Simpson, Blue Apron’s Chief Marketing Officer. “This is just the start of our work with Alexa as we look forward to expanding this partnership in 2022.”\n</p><p>\nBlue Apron continues to look for ways to bring more convenience and ease to its customers’ cooking experiences, and the collaboration with Alexa helps expand on those efforts. The cook-along feature on Alexa-enabled devices allows customers to follow step-by-step recipe instruction prompts, with the option to set the pace for a seamless cooking experience.\n</p><p>\nIn addition, a selection of meal kits is available to order each week and feature a variety of Blue Apron favorites, including their Wellness offerings, Quick &amp; Easy Family recipes, Butcher Bundles, Meal Prep and more.\n</p><p>\n“Our current work with Alexa, along with our plans to expand our partnerships throughout 2022, are part of our efforts to substantially grow our customer connections, which we expect to be a key contributor to increasing our engagement and retention rates,” continued Simpson.\n</p><p>\nThe collaboration with Alexa is part of Blue Apron’s plan to double the number of its partnerships in 2022, while continuing to invest in current brand and acquisition partners.\n</p><p>\nTo learn more about the benefits of cooking Blue Apron with Alexa, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fblog.blueapron.com%2Fblue-apron-amazon-alexa&amp;esheet=52543818&amp;newsitemid=20211202005586&amp;lan=en-US&amp;anchor=cook.ba%2Famazonalexa&amp;index=1&amp;md5=2a5ef6ca967e1438c042bc8fd439ea2c\" data-type=\"url\" class=\"tr-link\" translate=\"no\">cook.ba/amazonalexa</a>.\n</p><p>\n<b>About Blue Apron\n<br/></b>Blue Apron’s vision is “better living through better food.” Launched in 2012, Blue Apron offers fresh, chef-designed recipes that empower home cooks to embrace their culinary curiosity and challenge their abilities to see what a difference cooking quality food can make in their lives. Through its mission to spark discovery, connection and joy through cooking, Blue Apron continuously focuses on bringing incredible recipes to its customers, while minimizing its carbon footprint, reducing food waste, and promoting diversity and inclusion.\n</p><p>\n<b>Forward-Looking Statements\n<br/></b>This press release includes statements concerning Blue Apron Holdings, Inc. and its future expectations, plans and prospects that constitute \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. For this purpose, any statements contained herein that are not statements of historical fact may be deemed to be forward-looking statements. In some cases, you can identify forward-looking statements by terms such as \"may,\" \"should,\" \"expects,\" \"plans,\" “forecasts,” \"anticipates,\" \"could,\" \"intends,\" \"target,\" \"projects,\" \"contemplates,\" \"believes,\" \"estimates,\" \"predicts,\" \"potential,\" or \"continue,\" or the negative of these terms or other similar expressions. Blue Apron has based these forward-looking statements largely on its current expectations and projections about future events and financial trends that it believes may affect its business, financial condition and results of operations. These forward-looking statements speak only as of the date of this press release and are subject to a number of risks, uncertainties and assumptions including, without limitation, the company’s ability to double its partnerships in 2022 and continue to invest in current brand and acquisition partners as part of its efforts to substantially grow its customer connections and increase customer engagement and retention rates; the company’s ability, including the timing and extent, to successfully support the acceleration and execution of its growth strategy (including the ability to successfully increase marketing and technology improvements on the company’s planned timeline), cost-effectively attract new customers and retain existing customers, including its ability to sustain any increase in demand resulting from both its growth strategy and the COVID-19 (coronavirus) pandemic, and its ability to continue to expand direct-to-consumer product offerings, and to execute operational efficiency practices; changes in consumer behaviors that could lead to declines in demand, including as the COVID-19 pandemic’s impact on consumer behaviors such as travel and dining out, continues to taper; its ability to maintain and grow the value of its brand and reputation; general changes in consumer tastes and preferences or in consumer spending, including as a result of inflation or other negative economic factors, whether as a result of the COVID-19 pandemic or otherwise; its ability to comply with modified or new laws and regulations applying to its business or the impact that such compliance may have on its business; its ability to obtain and maintain intellectual property protection; and other risks more fully described in the company’s Annual Report on Form 10-K for the year ended December 31, 2020 filed with the SEC on February 23, 2021, the company’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2021 filed with the SEC on May 6, 2021, the company’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2021 filed with the SEC on August 3, 2021, the company’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2021 filed with the SEC on November 9, 2021, and in other filings that the company may make with the SEC in the future. The company assumes no obligation to update any forward-looking statements contained in this press release as a result of new information, future events or otherwise.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211202005586r1&amp;sid=ucdp4&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMjAyMDA1NTg2cjEmc2lkPXVjZHA0JmRpc3Rybz1ueCZsYW5nPWVu&amp;key=1e7745fb1ee782d60705744ff922b9b0e80dc37bc1c6828a4b092af2d0dcf44398479c4e869b4c82e6e963433406dd0dbcfb923730de490a5f16b4eba0a41e4a\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211202005586/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211202005586/en/</a></span></p><p>\n<b>Media \n</b><br/>Muriel Lussier\n<br/>Blue Apron\n<br/><a href=\"mailto:muriel.lussier@blueapron.com\" data-type=\"email\" translate=\"no\">muriel.lussier@blueapron.com</a>\n</p><p>\n<b>Investor \n</b><br/>Joseph Jaffoni, Richard Land, James Leahy\n<br/>JCIR\n<br/><a href=\"mailto:aprn@jcir.com\" data-type=\"email\" translate=\"no\">aprn@jcir.com</a> or 212-835-8500\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NY-BLUE-APRON</p></div>"}