{"date": "2021-12-17 07:00:00+00:00", "ticker": "ABDN", "mrkt_info": {"open": 234.9, "close": 236.9}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Repeats story with no changes to the text</p><p class=\"tr-by\">By Iain Withers and Carolyn Cohn</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">LONDON, Dec 16 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>The explosion in DIY investing since the start of the pandemic has led to a scramble among Britain's more traditional asset managers and banks to buy or build online platforms that give consumers more direct control of their investment portfolios. </p><p>While the 'meme stock' frenzy that saw a rush by consumers to buy shares in companies talked up on social media such as Gamestop <a href=\"https://www.reuters.com/markets/europe/meme-stocks-gamestop-amc-slump-multi-month-lows-2021-12-13\" data-type=\"url\" class=\"tr-link\" translate=\"no\">has simmered down a notch</a><span class=\"tr-strong\">, </span>there's still a growth in demand from people to pick their own investments or tailored wealth products. </p><p>This month abrdn <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ABDN.L\" data-type=\"ric\" data-ric=\"ABDN.L\" translate=\"no\" dir=\"ltr\">ABDN.L</a> bought interactive investor for 1.5 billion pounds ($1.98 billion) while earlier this year banks JPMorgan <a href=\"reuters://REALTIME/Verb=FullQuote/ric=JPM.N\" data-type=\"ric\" data-ric=\"JPM.N\" translate=\"no\" dir=\"ltr\">JPM.N</a> and Lloyds <a href=\"reuters://REALTIME/Verb=FullQuote/ric=LLOY.L\" data-type=\"ric\" data-ric=\"LLOY.L\" translate=\"no\" dir=\"ltr\">LLOY.L</a> snapped up wealth platforms Nutmeg and Embark respectively to bolt-on more customer-friendly digital products. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2SN2L2\" data-type=\"storyId\" data-story-id=\"nL4N2SN2L2\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>\"If you don't move as an incumbent, you are in trouble. No doubt,\" Antonio Lorenzo, head of insurance and wealth at Lloyds, told Reuters.</p><p>Platforms offering investment tools directly to consumers are the fastest growing part of the consumer investment industry, according to data shared with Reuters by research firm Platforum.</p><p>Assets under administration at these direct platforms jumped 40% to 289 billion pounds in the year to March, making up a third of the consumer market.</p><p>Reuters was unable to obtain more recent industry-wide data, but some of the industry's leading players said net inflows remained above pre-pandemic levels and were outstripping market gains. Research firm Fundscape forecasts the market will more than double in size to 658 billion pounds by 2026.</p><p>Independent online platform Freetrade says its assets had leapt to 1.1 billion pounds, from 240 million prior to the pandemic. Its best month for sign-ups was October with 115,000 joiners, compared to 75,000 in February at the height of the meme stocks phenomenon typified by social media favourite Gamestop.</p><p>\"Gamestop was a catalyst for sure, but it's not like that was the peak,\" Freetrade co-founder Viktor Nebehaj said.</p><p>\"It's obvious to us that investment accounts are going to be as normal as bank accounts.\"</p><p>        </p><p>NEW GENERATION OF INVESTORS</p><p>Britain may not be as synonymous with have-a-go investors as the United States, but it's growing a more lively retail investor community.</p><p>Around 14% of adults in Britain are interested in automated investing, behind the U.S. (16%) but ahead of France (12%), surveys by Forrester show.</p><p>UK consumers posted the highest rise in the world of those likely to invest in future, at 58% from 41% pre-pandemic, according to a survey by fund network Calastone.</p><p>Britain sports a band of fast-growing platforms, including Hargreaves Lansdown <a href=\"reuters://REALTIME/Verb=FullQuote/ric=HRGV.L\" data-type=\"ric\" data-ric=\"HRGV.L\" translate=\"no\" dir=\"ltr\">HRGV.L</a>, Trading 212 and Moneyfarm.</p><p>Joiners are more likely to be younger or first-time investors.  </p><p>More than half of new investors - with less than two years experience - are less than 35 years old, according to a survey by Oliver Wyman in October. Freetrade said over 55% of its new customers were first-time investors. </p><p>The platforms sense further opportunities. As many as 8.6 million people in Britain consistently have more than 10,000 pounds in cash deposits, <a href=\"https://www.fca.org.uk/publications/corporate-documents/consumer-investments-strategy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">research by the Financial Conduct Authority shows, a figure the regulator wants to reduce</a>.</p><p>        </p><p>SCRAMBLE</p><p>Among those maneuvering to appeal to this new cohort of investors is AJ Bell <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AJBA.L\" data-type=\"ric\" data-ric=\"AJBA.L\" translate=\"no\" dir=\"ltr\">AJBA.L</a>. The 26-year-old firm is launching commission-free investment app Dodl, with those new to investing offered guidance from furry \"monster\" characters.</p><p>Banks are also weighing in. JPMorgan plans to offer investments to customers of its fledgling British bank Chase next year via Nutmeg. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2SV2RE\" data-type=\"storyId\" data-story-id=\"nL4N2SV2RE\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Lloyds wants to nearly double assets in personal pensions and investments to 100 billion pounds, from 60 billion today.</p><p>Experts are concerned though that the new band of investors could face a rude awakening whenever the bull market ends.</p><p>Only two in five DIY investors (41%) thought losing money they invested was a genuine risk, a survey by polling firm Britain Thinks found this year. The platforms say they educate customers on potential risks, but concerns remain.</p><p>\"There's been a lot of concern about the gamification of investing,\" said Ryan Skinner, principal analyst at Forrester. \"In terms of the future of these platforms, a lot is going to be dependent on how regulators respond.\"    </p><p>($1 = 0.7548 pounds)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Iain Withers and Carolyn Cohn, Additional reporting by Muvija M in Bengaluru<br/>Editing by Raissa Kasolowsky)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Iain.Withers@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Iain.Withers@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: BRITAIN-WEALTH/PLATFORMS (REPEAT, FOCUS, PIX)</p></div>"}