{"date": "2021-11-30 14:00:00.212000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p align=\"left\">LAS VEGAS, Nov.  30, 2021  (GLOBE NEWSWIRE) -- <strong>AWS re:Invent 2021 </strong><strong>–</strong> Sumo Logic (Nasdaq: SUMO), the pioneer in <a href=\"https://www.globenewswire.com/Tracker?data=0UuoqV2ROgXu6wIcJWbmYZ7_X3JR1sOl61gP5rk-e4Yt7NLRd-F_NsP6-JJcrlyp2bpFJMmQvuoVGBBVTxYC-dlMz2aQh41KzYw7qu4cH4Zhbn4kCGqtJcXztMG47gceSpj4d7nzlSK6IoUkFDWCOQ==\"><u>continuous intelligence</u></a>, today announced it has been selected by Amazon Web Services (AWS) as its Independent Software Vendor (ISV) Partner of the Year for 2021. Announced at the annual AWS Partner Summit at AWS re:Invent, the AWS ISV Partner of the Year award recognizes Sumo Logic’s performance and commitment to helping customers drive innovation on AWS. Sumo Logic will be showcasing its AWS security and observability solutions, which help companies increase the reliability and security of modern applications by providing a unified view of key AWS services, accounts, and regions, this week at <a href=\"https://www.globenewswire.com/Tracker?data=B52BCiyaSRON50pWkPfLs0KGCDF5uCZGf5KMxehzDTpyX3KSIFcyH68Ulv7aLBezHs4jgIidmGVvXP8PwL3BqxOiLkhwSaAL_iF_Lp6KrdtepeXEZmGxSu6nKV76t8iq\"><u>AWS re:Invent at booth #969</u></a>.<br/></p><p>“The AWS ISV Partner of the Year Award is an opportunity for us to recognize the exceptional contributions of AWS Partners across the globe who strive to go above and beyond on behalf of our customers,” said Rachel Mushahwar, Director, North America Partners, AWS. “By leaning into the AWS Partner Network (APN) and helping to drive deep partner innovation, Sumo Logic is delivering cloud-native machine data analytics to break down data silos across security and IT operations, delivering the real-time insights needed to accelerate digital transformation and power modern businesses and we congratulate them on this well-deserved recognition.”</p><p>As a cloud-native SaaS analytics platform, Sumo Logic turns machine-generated data, including logs, metrics, and traces, into continuous intelligence to drive real-time business, security, and IT insights. Sumo Logic’s platform uniquely addresses the DevSecOps challenges and complexities of digital transformation, modern applications and cloud migration by helping customers: ensure application reliability; manage and optimize multi-cloud infrastructure; and Secure and protect against modern security threats.</p><p>Together with AWS, Sumo Logic is delivering significant return on investment to its customers through innovative integrations across security and observability that deliver immediate value. Examples of this innovation include the recent launch of <a href=\"https://www.globenewswire.com/Tracker?data=6k2yUPdvYEr9c-N-YNBUPP6VnkwlnltQ0usXOFMdQY8hISrMbKCM_RphmE7FP6aRBU6WPrGuj6ZbePPYBxi6ihglihTC514C6wtnzwsYm4JtYEH-8E7nv7_N6yfyaY_q-d7ZuXd2QFzzuW23g2tLsi2i5so8ApaBAtvS22vBn00=\"><u>Sumo Logic Cloud SIEM Powered by AWS</u></a>, a multi and hybrid cloud threat protection solution that reduces security blind spots with comprehensive visibility of AWS, across clouds and on-premises to identify issues before they become incidents, enhance security posture, and improve customer’s risk profile. In addition, the <a href=\"https://www.globenewswire.com/Tracker?data=f241htSQyGl7z-zKJyWDWPJN-eZFQW5P7tZzixp14U3BvLpDrc913H_Gq4KADainH4roZwmi2bzM_RI1uCfzQr8KtPgry-xqesByy3Dj_epY6Uab57-jEuBjlfVy7LQXDNhahSl_uprs491AgRrkpIIhA0cDse5MiqGK_IX6vVw=\"><u>AWS for Observability Solution for Sumo Logic</u></a> enables visibility of AWS environments in a single-pane-of-glass while accelerating troubleshooting.</p><p>“We made a strategic bet early on to go all-in on AWS and build deep integration allowing us to adapt quickly and build rich functionality on top of our Continuous Intelligence Platform to address a broad set of use cases across observability, security analytics, compliance, Cloud SIEM, and more,” said Ramin Sayar, president and CEO for Sumo Logic. “Today our joint customers and mutual ecosystem partners continue to benefit from these technology integrations, which provide better end-user experiences as well as a variety of innovative joint go-to-market efforts which further help to improve the value of our offerings. We are honored to be recognized as AWS’ ISV Partner of the Year and look forward to continuing to innovate together to architect the future.”</p><p>The AWS Partner Network (APN) is the global community of Partners who leverage Amazon Web Services to build solutions and services for customers. AWS helps Partners build, market, and sell their AWS offerings by providing valuable business, technical, and marketing support. There are tens of thousands of AWS Partners across the globe who are uniquely positioned to help businesses take full advantage of all that AWS has to offer and accelerate their journey to the cloud.</p><p><strong>Additional Resources</strong></p><ul type=\"disc\" class=\"bulleted-list arrowlist\"><li><a href=\"https://aws.amazon.com/solutions/case-studies/sumo-logic-case-study/\"><u>Download</u></a> this case study on AWS and Sumo Logic’s partnership</li><li><a href=\"https://www.sumologic.com/blog/2021-gartner-magic-quadrant-for-siem/\"><u>Learn</u></a> why Sumo Logic is a Visionary in the 2021 Gartner Magic Quadrant for SIEM</li><li><a href=\"https://www.sumologic.com/video/aws-observability-overview/\"><u>Watch</u></a> this video tour of the Sumo Logic AWS Observability solution</li><li><a href=\"https://www.sumologic.com/sign-up/\"><u>Sign up</u></a> for a free trial of Sumo Logic</li></ul><p><strong>About Sumo Logic</strong><br/>Sumo Logic Inc. (Nasdaq: SUMO) is the pioneer in continuous intelligence, a new category of software, which enables organizations of all sizes to address the data challenges and opportunities presented by digital transformation, modern applications, and cloud computing. The Sumo Logic Continuous Intelligence Platform™ automates the collection, ingestion, and analysis of application, infrastructure, security, and IoT data to derive actionable insights within seconds. More than 2,100 customers around the world rely on Sumo Logic to build, run, and secure their modern applications and cloud infrastructures. Only Sumo Logic delivers its platform as a true, multi-tenant SaaS architecture, across multiple use-cases, enabling businesses to thrive in the Intelligence Economy. For more information, visit <a href=\"https://www.globenewswire.com/Tracker?data=OLvp-WXR-AvSJ-QWV4aGHpk1o_yOhtzNOIlP7S8dqFdT2QyrtveMUNq0vqsg6CGvunOtizNGm14jY7lHfouEww==\"><u>www.sumologic.com</u></a>.</p><p>Sumo Logic is a trademark or registered trademark of Sumo Logic in the United States and in foreign countries. All other company and product names may be trademarks or registered trademarks of their respective owners.</p><p>Any information regarding offerings, updates, functionality, or other modifications, including release dates, is subject to change without notice. The development, release, and timing of any offering, update, functionality, or modification described herein remains at the sole discretion of Sumo Logic, and should not be relied upon in making a purchase decision, nor as a representation, warranty, or commitment to deliver specific offerings, updates, functionalities, or modifications in the future.</p><p><strong>Media Contact</strong><br/>Melissa Liton<br/>Sumo Logic<br/><a href=\"https://www.globenewswire.com/Tracker?data=ApczQhNXJ-gmKD3RpFVmcgaxCCC9h5N92Hf2MAePeUnIw6fWMgFsfuDI-6NB513IqUDPQVI2E6Zw0nMUsuPN-bES-7V98apQ2Uu1dki6rDc=\"><u>mliton@sumologic.com</u></a> <br/>(650) 814-3882</p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODQwMjU2NSM0NTg3NjY0IzIwOTM3NDM=\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RRd01qVTJOU00wTlRnM05qWTBJekl3T1RNM05ETT0=&amp;key=397129d7c944c29ffbef6ad6dc1d7d18086e9f95dfc6ff7e7e2317c6a2643dffb84e6469d9896d79495c45fe2c54beba72ded56e11dd9697dd9974e0b89b2bf4\"/></div></div><br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/Zjk2MTc5NDAtYWUzMi00NzkyLTk1OTEtMWU2MzNmYjczMzQ4LTExMDUzMTQ=/tiny/Sumo-Logic-Inc-.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9aamsyTVRjNU5EQXRZV1V6TWkwME56a3lMVGsxT1RFdE1XVTJNek5tWWpjek16UTRMVEV4TURVek1UUT0vdGlueS9TdW1vLUxvZ2ljLUluYy0ucG5n&amp;key=ad889d5604a5bda4277b9b74f0cf0a2a2b8e9757858fc4506a49d19f49a3b85689007d9d61e05b43c88210a55e7c4eb3d79f5d8d82c6d26c101b55541150d7cf\"/></div></div><p><a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/e305eb9a-106f-4758-91fe-5089dcb384e4\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Primary Logo\" border=\"0\" src=\"https://ml.globenewswire.com/media/e305eb9a-106f-4758-91fe-5089dcb384e4/small/slack-imgs-jpg.jpg\" style=\"max-height:79px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9lMzA1ZWI5YS0xMDZmLTQ3NTgtOTFmZS01MDg5ZGNiMzg0ZTQvc21hbGwvc2xhY2staW1ncy1qcGcuanBn&amp;key=6158a1e70fe734e264852aa010cbd2ca7039e25d420a2cd319afd3d9f765f925de58bf1f62a698f61d8562fc3e730c089875d762f7d88f40c3593f6da9c7b79a\"/></div></div></a></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">GlobeNewswire, Inc. 2021</p></div>"}