{"date": "2021-12-01 19:53:19.182000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwlistdisc{list-style-type:disc;}</style><p class=\"bwalignc\">\n<b>CrowdStrike Delivers A Fully Integrated Breach Prevention Platform for Cloud Workloads Across AWS Cloud and Edge Environments</b>\n</p><p class=\"bwalignc\">\n<span>CrowdStrike expands support across AWS Outposts and Amazon EKS Anywhere to further deliver security consistency from the edge to the cloud, and launches new AWS integrations with Humio</span>\n</p><p>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.crowdstrike.com%2F&amp;esheet=52542908&amp;newsitemid=20211130006129&amp;lan=en-US&amp;anchor=CrowdStrike+Inc.&amp;index=1&amp;md5=5984b2cfe7439eb721e60fcbddf5b41a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">CrowdStrike Inc.</a>, (NASDAQ: CRWD)<b> </b>a leader in cloud-delivered endpoint and workload protection, today announced new product integrations and certifications that deliver breach protection and streaming observability. These solutions provide consistent security and simplified operational management across Amazon Web Services, Inc. (AWS) cloud-to-edge and customer-managed infrastructure, and break down silos across information technology (IT) security and development operations (DevOps) teams.\n</p><p>\n“Many organizations lack the visibility and streamlined security needed to properly protect their cloud workloads with precision from end-to-end,” said Matthew Polly, vice president of World Wide Alliances, Channels and Business Development at CrowdStrike. “With these latest certifications and integrations, joint customers are provided a consistent security posture and holistic observability of their edge workloads, on-premises data centers and cloud-native deployments, bridging the gap between IT security and DevOps.”\n</p><p>\nThe expanded CrowdStrike support includes new product integrations, AWS Certifications achievements and participants as launch partners for the following AWS programs:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\n<b>EKS Anywhere Support -</b> CrowdStrikeprovides continuous posture management and breach protection for Amazon Elastic Kubernetes Service (EKS), Amazon EKS with AWS Fargate and now Amazon EKS running on customers’ on-premises infrastructure via Amazon EKS Anywhere. Customers benefit from greater visibility, compliance and the industry’s fastest threat detection and response to outsmart the adversary.\n</li>\n</ul><ul class=\"bulleted-list arrowlist\">\n<li>\n<b>AWS Outposts Launch Partner - </b>IDC predicts that by 2024, due to an explosion of edge data, 65% of the Forbes Global 2000 will embed edge-first data stewardship, security and network practices into data protection plans.¹ As a result, CrowdStrike is proud to be a launch partner of AWS Outposts, spanning the 1U, 2U and 42U form factors. Customers will be afforded a unified security experience across AWS-supported on-premises edge, data center and cloud-native services.\n</li>\n</ul><ul class=\"bulleted-list arrowlist\">\n<li>\n<b>AWS Quick Starts for Humio -</b> Customers will be able to initiate Humio clusters via AWS Quick Starts templates. This will reduce dozens of manual AWS procedures to a few steps, empowering customers to start attaining Humio’s streaming observability at scale and with consistency, within minutes.\n</li>\n</ul><ul class=\"bulleted-list arrowlist\">\n<li>\n<b>Humio Integration with AWS FireLens -</b>Customers are now able to ingest AWS service and event data into Humio via AWS FireLens, container log router for Amazon Elastic Container Service (Amazon ECS) and AWS Fargate. Humio customers will now have greater extensibility to use the breadth of services at AWS to simplify routing of logs to Humio, enabling accelerated threat hunting and search across their AWS footprint for novel and advanced cyber threats.\n<br/>\n<br/>\n</li>\n<li>\n<b>AWS Well Architected ISV Certification Achieved - </b>CrowdStrike has passed the AWS technical review and achieved a certification for being an <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fpartners%2Fisv%2Fwell-architected-review%2F&amp;esheet=52542908&amp;newsitemid=20211130006129&amp;lan=en-US&amp;anchor=AWS+Well+Architected+ISV&amp;index=2&amp;md5=3bec855a39a5c678de39b756089f1376\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Well Architected ISV</a>, having proven to adopt AWS best practices, drive improved security and performance outcomes, adopt cloud-native architectures and achieve industry compliance at scale.\n</li>\n</ul><p>\nVisit CrowdStrike in booth #152 at AWS re:Invent.\n</p><p>\nFor more information, please visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fmarketplace%2Fseller-profile%3Fid%3Df4fb055a-5333-4b6e-8d8b-a4143ad7f6c7&amp;esheet=52542908&amp;newsitemid=20211130006129&amp;lan=en-US&amp;anchor=AWS+Marketplace&amp;index=3&amp;md5=30a5f49c26187d720d77e629519015fe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Marketplace</a> or <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.crowdstrike.com%2Fcloud-security-products%2Ffalcon-for-aws%2F&amp;esheet=52542908&amp;newsitemid=20211130006129&amp;lan=en-US&amp;anchor=CrowdStrike.com&amp;index=4&amp;md5=2b7cf59046557c775e43aa8f79172253\" data-type=\"url\" class=\"tr-link\" translate=\"no\">CrowdStrike.com</a> for available CrowdStrike product offerings.\n</p><p>\n<span>¹IDC FutureScape: Worldwide Future of Digital Infrastructure 2022 Predictions</span> (IDC #US47441321, October 2021)\n</p><p>\n<b>About CrowdStrike</b>\n</p><p>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.crowdstrike.com%2F&amp;esheet=52542908&amp;newsitemid=20211130006129&amp;lan=en-US&amp;anchor=CrowdStrike&amp;index=5&amp;md5=7111269feebad49820b7b784af629df0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">CrowdStrike</a> Holdings, Inc. (Nasdaq: CRWD), a global cybersecurity leader, is redefining security for the cloud era with an endpoint and workload protection platform built from the ground up to stop breaches. The CrowdStrike Falcon® platform’s single lightweight-agent architecture leverages cloud-scale artificial intelligence (AI) and offers real-time protection and visibility across the enterprise, preventing attacks on endpoints and workloads on or off the network. Powered by the proprietary CrowdStrike Threat Graph®, CrowdStrike Falcon captures<span> </span>approximately 1 trillion high-fidelity signals per day in real time from across the globe, fueling one of the world’s most advanced data platforms for security.\n</p><p>\nWith CrowdStrike, customers benefit from better protection, better performance and immediate time-to-value delivered by the cloud-native Falcon platform.\n</p><p>\nThere’s only one thing to remember about CrowdStrike: We stop breaches.\n</p><p>\nQualifying organizations can gain full access to Falcon Prevent™ by starting a free trial.\n</p><p>\nLearn more:<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.crowdstrike.com%2F&amp;esheet=52542908&amp;newsitemid=20211130006129&amp;lan=en-US&amp;anchor=https%3A%2F%2Fwww.crowdstrike.com%2F&amp;index=6&amp;md5=b66dab05694d90a15cfb40aba293b483\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> https://www.crowdstrike.com/</a>\n</p><p>\nFollow us:<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.crowdstrike.com%2Fblog%2F&amp;esheet=52542908&amp;newsitemid=20211130006129&amp;lan=en-US&amp;anchor=Blog&amp;index=7&amp;md5=77b3c055c7a11aba9186ac4458fe22ca\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> Blog</a> |<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Ftwitter.com%2FCrowdStrike&amp;esheet=52542908&amp;newsitemid=20211130006129&amp;lan=en-US&amp;anchor=Twitter&amp;index=8&amp;md5=07f6c1985fc1bbafac6d3bf74fabd3f1\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> Twitter</a>\n</p><p>\n<b>Forward-Looking Statements</b>\n</p><p>\nThis press release contains forward-looking statements about CrowdStrike’s expectations, plans, and intentions, regarding AWS Quick Start for Humio. You should not rely on these forward-looking statements, as actual outcomes and results may differ materially from those anticipated or implied by these forward-looking statements as a result of such assumptions, risks and uncertainties. All forward-looking statements in this press release are based on information available to us as of the date hereof, and we do not assume any obligation to update the forward-looking statements provided to reflect events that occur or circumstances that exist after the date on which they were made. Information on new products, features, and functionality, including our expectations with respect to the development, release and timing thereof, is for informational purposes only and should not be relied upon.\n</p><p>\n© 2021 CrowdStrike, Inc. All rights reserved. CrowdStrike, the falcon logo, CrowdStrike Falcon and CrowdStrike Threat Graph are marks owned by CrowdStrike, Inc. and registered with the United States Patent and Trademark Office, and in other countries. CrowdStrike owns other trademarks and service marks, and may use the brands of third parties to identify their products and services.\n</p><p><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211130006129/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211130006129/en/</a></span></p><p>\nCrowdStrike, Inc.\n<br/>Kevin Benacci, 216-409-5055\n<br/><a href=\"mailto:kevin.benacci@crowdstrike.com\" data-type=\"email\" translate=\"no\">kevin.benacci@crowdstrike.com</a>\n</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: CA-CROWDSTRIKE</p></div>"}