{"date": "2021-11-19 16:15:31+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3696.06, "close": 3572.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><span>\n              <p>NEW YORK, Nov 19 (IFR) - Nasdaq-listed digital printing firm <strong>Kornit Digital</strong> priced an upsized US$399.5m marketed follow-on late on Thursday that saw it raise fresh capital and enabled key backer Amazon to sell more than half of its remaining stake in the company.</p>\n              <p>After two days of marketing and coming off Kornit's record third-quarter numbers earlier this month, a syndicate led by <span>Citigroup</span>, <span>Barclays</span>, <span>Goldman Sachs</span> and <span>Morgan Stanley</span> sold 2.65m Kornit shares, about 5% of the company, at US$151, a 5.8% file-to-offer discount. The shares rebounded 6.6% early on Friday in one of the strongest post-deal performances of the week.</p>\n              <p>The offering was increased in size from 2.21m shares at launch all in the form of additional primary shares. Amazon sold about 700,000 shares as expected to raise about US$106.6m and cut its stake by more than half to 1.2%.</p>\n              <p>Kornit went public at just US$10 a share in 2015, later forging a partnership to work with Amazon that also saw it issue warrants to the e-commerce giant.</p>\n              <p>Amazon also sold part of its Kornit stake (1.7m shares on that occasion) via a US$230.4m follow-on in September 2020 that was priced at just US$56.50 per share. Shares are up 70% this year. </p>\n              <p>Kornit plans to use the primary proceeds from the offering for potential acquisitions and general corporate purposes.</p>\n              <p>(Anthony Hughes)</p>\n              <p>((anthony.hughes@refinitiv.com; (646) 552-4852))</p>\n            </span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © Refinitiv 2021. Click For Restrictions - https://www.refinitiv.com/en/policies/copyright-notice</p></div>"}