{"date": "2021-11-12 13:05:26+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3482.05, "close": 3525.15}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><span>\n              <p>By Anthony Hughes</p>\n              <p>NEW YORK, Nov 12 (IFR) - Amazon-backed electric vehicle maker <strong>Rivian Automotive</strong> broke the run of poor debuts by jumbo IPOs, surging by nearly one-third in its opening Nasdaq session on Wednesday after earlier raising US$11.9bn from the biggest US IPO in seven years.</p>\n              <p>Though many of the largest US IPOs in the past decade have disappointed investors – examples include Facebook, Uber Technologies and several sizeable IPOs this year such as GlobalFoundries and Robinhood Markets – Rivian successfully tapped into the current EV mania and the hope that the company might eventually prove as lucrative an investment as Elon Musk's Tesla.</p>\n              <p>The offering ranked as the largest US IPO since Alibaba's US$25bn NYSE listing in 2014 and the 15th biggest IPO on record globally (rising to 14th with exercise of the greenshoe). It was all the more extraordinary given Rivian has generated no meaningful revenues since its 38-year-old CEO RJ Scaringe founded the company in 2009.</p>\n              <p>Employing the so-called hybrid auction/direct order entry process rather than a traditional bookbuild to execute the offering, a syndicate led by <span>Morgan Stanley</span>, <span>Goldman Sachs</span> and <span>JP Morgan</span> on Tuesday priced the upsized sale of 153m Rivian shares at US$78, US$4 above the top of the already revised US$72–$74 range.</p>\n              <p>Debuting the following day, the shares opened at US$106.75 before pulling back to close at US$100.73 for a 29.1% day-one gain. </p>\n              <p>“We are super-pleased that this went so well, particularly for this time of the year,” one syndicate member said. “Large deals are incredibly challenging to get to trade well in any situation. We didn’t push price to the maximum so that there was nothing left for the market, which is important, especially for a company that will need to raise more capital to fund their business plan.”</p>\n              <p>There was little doubt the deal was headed for a strong outcome given Rivian earlier in the roadshow upped the marketing range from US$57–$62, though a 12% slump in Tesla shares on the day of pricing was ill-timed (it was later revealed that founder Elon Musk had sold US$5bn of stock).</p>\n              <p>Yet not only did the final price come well above the revised range but the syndicate also upped the number of shares by 13% from 135m at launch.</p>\n              <p>The final terms gave Rivian an enterprise value of more than US$60bn, rising to more than US$100bn based on the stock's Thursday close of US$122.99. </p>\n              <p>Ahead of the IPO's launch in early November, Rivian secured US$5bn of cornerstone demand for stock in the offering from a high-powered group of investors, including existing major shareholders Amazon and T Rowe Price, as well as Coatue Management, Franklin Templeton, Capital Research Global Investors, Dan Loeb’s Third Point, Blackstone, Dragoneer and Soros Fund Management. Other large existing shareholders include Ford and Cox Enterprises, the owner of wholesale car auction company Manheim.</p>\n              <p>Bankers said the offering drew broad-based support, including from tech-dedicated hedge funds.</p>\n              <p>From a retooled former Mitsubishi factory in Illinois, Rivian began deliveries of its all-electric pickup truck in September and expects to begin producing and delivering both its SUV and electric commercial delivery van by the end of the year.</p>\n              <p>The company has 55,400 pre-orders it expects to fill by the end of 2023. Amazon has also committed to buy 100,000 delivery vans, the biggest EV order ever.</p>\n              <h3>Ambitions</h3>\n              <p>Rivian emerges from the IPO with about US$19bn of cash to pursue its lofty long-term ambitions, which include broadening its range of consumer and commercial models, expanding internationally, developing digital services (including its fleet management platform) and offering energy charging, generation and storage products.</p>\n              <p>Though now extremely well-funded, Rivian's doubters include Elon Musk himself.</p>\n              <p>\"I hope they’re able to achieve high production and breakeven cashflow,\" Musk tweeted on Thursday. \"That is the true test. There have been hundreds of automotive startups, both electric and combustion, but Tesla is [the] only American carmaker to reach high volume production and positive cashflow in [the] past 100 years.\"</p>\n              <p>Yet one of Rivian's key backers, Dan Loeb's Third Point, told its investors last month that Rivian stood out with \"a compelling brand, an excellent first vehicle, and a unique partnership with Amazon that allows them to scale quickly\".</p>\n              <p>\"They are taking full advantage of the direct-to-consumer model/digital ecosystem to attack the full lifetime revenue potential from vehicles rather than simply an upfront sale.\"</p>\n              <p>(Anthony Hughes)</p>\n              <p>((anthony.hughes@refinitiv.com; (646) 552-4852))</p>\n            </span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © Refinitiv 2021. Click For Restrictions - https://www.refinitiv.com/en/policies/copyright-notice</p></div>"}