{"date": "2022-02-01 15:47:04.241000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>IGEN NETWORKS CORP (\"IGN-Z;IGEN-0\")\n- IGEN Networks Corporation And County Executives of America\n- Extends Partnership Agreement\n\n     IGEN Networks Corporation, a leading innovator of cloud-based and\nInternet of Things (IoT) solutions for the protection and management of\nmobile assets, today announced the extension of its partnership agreement\nwith the County Executives of America (CEA) for an additional three years.\nThe extended agreement facilitates the recently announced GSA Multiple\nAward Schedule Contracts with the exclusive endorsement from the County\nExecutives of America.  The County Executives of America represent more\nthan 700 member Counties across the US with an estimated 350,000 Light\nCommercial Fleet assets.\n\n     IGEN's Medallion GPS is a Fleet Management Platform designed for the\nLight Commercial Fleet owner who requires asset management tools at lower\ncosts.  The system is organized around both asset and driver with dispatch\ncapabilities, automated reporting, maintenance, diagnostics reporting, and\ndriver behavior scoring built on a Nationwide AWS Cloud-based\ninfrastructure.  Medallion GPS incorporates IGEN's patented \"Digital\nTelematics Signature\", offering greater accuracy for measuring and scoring\ndriver behavior across diverse fleets.\n\n     \"With both the CEA's exclusive endorsement along with the GSA Multiple\nAward Schedule Contracts, IGEN now has direct access to Counties, State,\nand Federal Government Fleet Management opportunities across the US,\" said\nNeil G Chan, CEO of IGEN Networks Corp.  The diversity of these assets\nalong with the self-insurance of County assets creates an excellent fit\nwith our patented \"Digital Telematics Signature\", a powerful tool for\nassessing actuarial risk of County assets and their drivers.\"\n\n     About IGEN Networks Corporation\n\n     IGEN Networks Corporation creates software services for the consumer\nautomotive and commercial asset management industries enabling their\ncustomers to better manage their assets and protect their drivers.  IGEN is\na fully reporting company in both Canada and the United States. It is\npublicly traded on the OTC Markets under the symbol IGEN, and listed on the\nCSE under the symbol IGN. For more information, please visit:\nwww.igennetworks.net\n\n     About County Executives of America\n\n     County Executives of America's mission is two-fold:  To help county\ngovernments serve the American people in the most responsive, most\nefficient way by acting as a national voice for its leaders and\nrepresenting its interests on all levels of government.  To develop,\npromote, and preserve the core philosophy of federalism and devolution.\n\n     CEA began as a league formed by county executives who believed that\nthe job as the chief elected officer of a county was too important to\noverlook. Their initial desire to create an alliance that would assist\ncounty officers in executing their duties sparked a dramatic evolution that\nproduced today's association.  CEA's current membership includes County\nExecutives, County Judges, Parish and Borough Presidents, City-County\nMayors, Commission Presidents and Chairs, and all county leaders elected\nat-large by the public constituency.\n\n     A long-time affiliate group of the National Association of Counties,\nCEA has operated as an independent organization since 1994. With its\nheadquarters in Washington D.C., CEA brings together top-level local\nofficials to discuss and determine policy on wide-ranging issues that\naffect local governments and the people they serve.\n\n     CEA also provides a voice at the national level among the various\npolicy making representatives including members and staff of the United\nStates Congress, officials in the Executive Branch at both the federal and\nstate government level and various interest groups and associations based\non Capitol Hill.\n\n     CEA is governed by a Board of Directors and selected Executive\nOfficers. The Board President is elected and serves two-year terms.  For\nmore information, please visit: www.countyexecutives.org\n\n     Forward-Looking Statements\n\n     This news release may contain forward-looking statements or\nforward-looking information within the meaning of the U.S. Private\nSecurities Litigation Reform Act of 1995 and Canadian securities law. The\nterms and phrases \"goal\", \"commitment\", \"guidance\", \"expects\", \"would\",\n\"will\", \"continuing\", \"drive\", \"believes\", \"indicate\", \"look forward\",\n\"grow\", \"outlook\", \"forecasts\", \"intend\", and similar terms and phrases are\nintended to identify these forward-looking statements. Forward-looking\nstatements are based on estimates and assumptions made by IGEN in light of\nits experience and its perception of historical trends, current conditions\nand expected future developments, as well as other factors that IGEN\nbelieves are appropriate in the circumstances, including but not limited to\nstatements regarding investment liquidity, financing options and long term\ngoals of the Company, general economic conditions, IGEN's expectations\nregarding its business, customer base, strategy and prospects, and IGEN's\nconfidence in the cash flow generation of its business. Many factors could\ncause IGEN's actual results, performance or achievements to differ\nmaterially from those expressed or implied by the forward-looking\nstatements, including, without limitation: risks related to competition;\nIGEN's reliance on key personnel; IGEN's ability to maintain and enhance\nits brand; and difficulties in forecasting IGEN's financial results,\nparticularly over longer periods given the rapid technological changes,\ncompetition and short product life cycles that characterize the mobile\napplication industry. These risk factors and others relating to IGEN that\nmay cause actual results to differ are set forth in the under the heading\n\"Risk Factors\" in IGEN's periodic filings with the British Columbia\nSecurities Commission and the U.S. Securities and Exchange Commission\n(copies of which filings may be obtained at www.sedar.com or www.sec.gov.\nThese factors should be considered carefully, and readers should not place\nundue reliance on IGEN's forward-looking statements. IGEN has no intention\nand undertakes no obligation to update or revise any forward-looking\nstatements, whether as a result of new information, future events or\notherwise, except as required by law.\n\n     Contact: IGEN Networks Corporation Neil G. Chan  +1 (855) 912-5378\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203100324.MNPRE2203102211-07300120220201</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}