{"date": "2022-01-19 18:12:08.244000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>PROGRESS SOFTWARE CORP (\"PRGS-Q\")\n- Delivers Next-Level Developer Productivity with the Largest\n- Suites of Native Components for Blazor, Angular and React\n\n     Progress, the leading provider of products to develop, deploy and\nmanage high-impact applications, today announced the R1 2022 release of\nProgress(R) Telerik(R) and Progress(R) Kendo UI(R), the most powerful .NET\nand JavaScript UI libraries for app development available. With this\nrelease, Progress is continuing its commitment to developer productivity\nwith a variety of new and updated components and framework support to\nenable developers to bring modern, feature-rich apps to market faster than\never before.\n\n     With the latest Developer Tools release, Progress is delivering\npowerful new UI components and advanced features for .NET and JavaScript.\nIt continues to lead the market with the largest truly native UI component\nsuites for Blazor, Angular and React. The release also includes REPL\nPlaygrounds for Blazor and ASP.NET Core enabling developers to write, run,\nsave and share code snippets in the browser, and support for .NET 6 and\nVisual Studio 2022 across all Telerik UI tools. In addition, Progress is\nsimplifying the collaboration between developers and designers by expanding\nits design kits for Figma with new components, and adding theme\nimprovements to its .NET and JavaScript libraries.\n\n     New in Telerik:\n\n     *  Progress(R) Telerik(R) UI for Blazor now has more than 90 truly\nnative components with the addition of Map, Heatmap, File Select, QR Code,\nColor Picker, Color Gradient, Flat Color Picker and Dialog. The robust Data\nGrid now includes additional customization options when exporting data to\nExcel, enhanced built-in editing for large grids and multiple validation\nmodes.\n\n     *  REPL Playgrounds for Blazor and ASP.NET Core, the newly introduced\nbrowser-based tools for Blazor and ASP.NET Core, enable developers to\nwrite, run, save and share code snippets without any additional setup.\n\n     *  Progress(R) Telerik(R) UI for WinUI and Progress(R) Telerik(R) UI\nfor .NET MAUI are now the largest libraries for their respective\nframeworks. Telerik UI for WinUI adds the Buttons component. Telerik UI for\n.NET MAUI offers 13 new components, including new ListView, MaskedEntry,\nand TabView, along with a new sample application for cryptocurrencies.\n\n     *  Progress delivers support for .NET 6 and Visual Studio 2022. .NET 6\nis supported across all relevant Telerik UI libraries and tools: Telerik UI\nfor Blazor, Telerik UI for ASP.NET Core, Telerik UI for WinUI, Telerik UI\nfor WPF, Telerik UI for WinForms, Telerik UI for MAUI, Telerik Reporting,\nTelerik JustMock, Telerik Test Studio Dev Edition, Telerik Document\nProcessing. All Telerik products with the exception of Telerik Test Studio\nDev Edition support Visual Studio 2022.\n\n     Furthermore, Progress released enhancements and new components for\n.NET web, mobile and desktop development across its UI libraries,\nreporting, testing and mocking tools, including Telerik UI for ASP.NET MVC,\nTelerik UI for ASP.NET Core, Telerik UI for ASP.NET AJAX, Telerik UI for\nXamarin, Telerik UI for WPF, Telerik UI for WinForms, Telerik Reporting,\nTelerik JustMock and Telerik Test Studio Dev Edition.\n\n     New in Kendo UI:\nWith this release, Progress brings more than 25 new components across its\nKendo UI JavaScript libraries, theme improvements, support for Angular 13\nand now offers the largest native UI libraries for Angular and React.\n\n     *  Kendo UI(R) for Angular features a Filter component for building\ncomplex data queries. Also included are Popover, Barcode, QR Code\ncomponents, theme improvements and multiple user experience enhancements.\n\n     *  KendoReact(TM) adds new components like FlatColorPicker, Drag &amp;\nDrop Utilities, ExpansionPanel and more. The PivotGrid has been updated to\nable to load local data and many other components have been enhanced.\n\n     *  Kendo UI(R) for Vue provides 15 new truly native components for\nVue, including Filter, Toolbar, Menu, Gauge, Loader, Editor, Drawer,\nStepper, DateRangePicker, Switch, TextArea, Tooltip and more.\n\n     *  Kendo UI(R) for jQuery includes a new and improved PivotGrid and an\nAvatar component, plus a new sample application.\n\n     \"With this release, the new productivity enhancements we're providing\nplace more power in the hands of teams to design and build functional and\ncompelling apps faster,\" said Loren Jarrett, GM, Developer Tools, Progress.\n\"We're proud to be able to help our developer community continue to push\nthe envelope of productivity and quality, and this release is the next step\nin that journey.\"\n\n     The Telerik and Kendo UI R1 2022 release is available today. To learn\nmore, visit the R1 2022 release overview page or register for the R1 2022\nrelease webinars: Telerik .NET Web, Desktop &amp; Mobile Products, Telerik\nReporting, Automated Testing, Mocking and Debugging Tools and Kendo UI R1\n2022 Release Webinar.\n\n     Additional Resources\n\n     *  Follow Progress on Twitter, Facebook, LinkedIn, Twitch and\nInstagram\n     *  Read the Progress blog\n     *  Read the Developer Tools blog\n\n     About Progress\nProgress (NASDAQ: PRGS) provides the leading products to develop, deploy\nand manage high-impact applications. Our comprehensive product stack is\ndesigned to make technology teams more productive, and we have a deep\ncommitment to the developer community, both open source and commercial\nalike. With Progress solutions, organizations can accelerate the creation\nand delivery of strategic business applications, automate the process by\nwhich apps are configured, deployed and scaled, and make critical data and\ncontent more accessible and secure -- leading to competitive\ndifferentiation and business success. Over 1,700 independent software\nvendors, 100,000+ enterprise customers, and a three-million-strong\ndeveloper community rely on Progress to power their applications. Learn\nabout Progress at www.progress.com or +1-800-477-6473.\n\n     Progress, Telerik, KendoReact, and Kendo UI are trademarks or\nregistered trademarks of Progress Software Corporation and/or one of its\nsubsidiaries or affiliates in the US and other countries. Any other\ntrademarks contained herein are the property of their respective owners.\n\n     Press\n\n Contact Information:\n\nContact:\nKim Baker\nProgress\n+1-781-280-4000\npr@progress.com\n\nTel   : 781-280-4000    PROGRESS SOFTWARE CORP\nEmail : Flanagan@progress.com\nWWW   : <a href=\"http://www.progress.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.progress.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201800478.MNPRE2201802368-09423420220119</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}