{"date": "2021-12-14 14:53:31+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\"><li class=\"tr-summaryitem\">Amazon-Future locked in legal disputes for more than a year</li><li class=\"tr-summaryitem\">Amazon says sentiment will be hit if 2019 Future deal revoked</li><li class=\"tr-summaryitem\">Amazon argues India watchdog has no power to revoke deal</li><li class=\"tr-summaryitem\">Future-Reliance deal would \"further restrict competition\" -Amazon</li></ul><p class=\"tr-by\">By Aditya Kalra</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW DELHI, Dec 14 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon has warned India's antitrust body that revoking its 2019 deal with Future Group would send a negative signal to foreign investors and allow local retail behemoth Reliance to \"further restrict competition\", a legal document seen by Reuters showed.</p><p>The Competition Commission of India (CCI) in reviewing its prior approval of the $200 million investment the U.S. company made in a Future unit in 2019, amid allegations that Amazon <a href=\"http://reut.rs/3I1MJ4r\" data-type=\"url\" class=\"tr-link\" translate=\"no\">concealed facts</a> when it sought approval for the transaction. </p><p>The CCI's review was triggered after a complaint from Amazon's now estranged partner Future. The two sides have been at loggerheads since last year with the U.S. company successfully using the terms of its toehold investment in 2019 <a href=\"https://reut.rs/3BV0tJG\" data-type=\"url\" class=\"tr-link\" translate=\"no\">to block debt-laden Future's</a> attempt to sell retail assets to Reliance <span class=\"tr-strong\">Industries</span> <span class=\"tr-strong\"><a href=\"reuters://REALTIME/Verb=FullQuote/ric=RELI.NS\" data-type=\"ric\" data-ric=\"RELI.NS\" translate=\"no\" dir=\"ltr\">RELI.NS</a> </span>for $3.4 billion. </p><p>While Future is staring at liquidation, the legitimacy of the small $200 million deal could have far-reaching consequences for India's retail sector.     </p><p>If Amazon prevails, it will slow Reliance's plan to acquire <span class=\"tr-strong\">Future</span> at a time when <span class=\"tr-strong\">it </span>is already rapidly expanding into e-commerce. </p><p>And if the 2019 deal is voided, it could make it easier for Reliance to close the Future deal, hurting Amazon's retail ambitions, people familiar with the dispute say.   </p><p>Amazon in a confidential filing on Dec. 12 said <span class=\"tr-strong\">CCI's approval </span>revocation is \"bound to send a message to foreign investors that the economy and regulatory landscape of India are still not developed enough to provide stability and certainty to foreign investments\".</p><p>Amazon in its 60-page submission went on to say Future's aim \"to unwind the investment\" to allow Reliance to consolidate its position \"will further restrict competition in the Indian retail market\".</p><p>The <a href=\"https://www.reuters.com/article/amazon-india-future-reliance-idUSKBN2871AM\" data-type=\"url\" class=\"tr-link\" translate=\"no\">bruising public battle</a> over Future Retail pits Jeff Bezos' Amazon against Reliance, run by one of India's richest men, Mukesh Ambani, in a bid for retail dominance in India.</p><p>Reliance is India's No. 1 retailer with more than 13,000 outlets, and rapidly expanding into e-commerce.</p><p>Future Retail ranks second with more than 1,500 outlets.</p><p>Amazon, Reliance and Future did not respond to a request for comment. The CCI also did not respond.</p><p>    </p><p>NO INFO CONCEALED, CCI HAS 'NO POWER' </p><p>The Future-Reliance deal has been on hold as Amazon got favourable interim rulings from a Singapore arbitrator and Indian courts. Future denies any wrongdoing, and the dispute continues to be heard in multiple forums.</p><p>Amazon has argued that terms agreed upon in its 2019 deal to pay $200 million for a 49% stake in Future's gift voucher unit prevent its parent, Future Group, from selling its Future Retail Ltd <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FRTL.NS\" data-type=\"ric\" data-ric=\"FRTL.NS\" translate=\"no\" dir=\"ltr\">FRTL.NS</a> business to certain rivals, including Reliance.</p><p>In June, the CCI <a href=\"http://reut.rs/3I1MJ4r\" data-type=\"url\" class=\"tr-link\" translate=\"no\">sought explanation</a> from Amazon saying it hid factual aspects of the transaction by not revealing its strategic interest in Future Retail while seeking approvals.</p><p>In its Dec. 12 response to the CCI - being reported here for the first time - Amazon argues no information was concealed from the CCI and lawyers representing the Future Group \"had vetted and approved\" all submissions.</p><p>\"There was no concealment of any material information,\" Amazon's filing states. </p><p>The CCI's 2019 approval order states its decision \"shall stand revoked if, at any time, the information provided\" is found to be incorrect. </p><p>But Amazon in its submission argues the CCI has no power to do so, saying <span class=\"tr-strong\">its </span>approval order as per Indian laws is a final one, not conditional.</p><p>\"The power to revoke an approval is a drastic power and is not available to a statutory authority unless expressly provided\" in Indian law, Amazon argued.</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Aditya Kalra in New Delhi; editing by Euan Rocha and Jason Neely)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:aditya.kalra@tr.com\" data-type=\"email\" translate=\"no\">aditya.kalra@tr.com</a> ; +91-11-49548021; Twitter <a href=\"https://twitter.com/adityakalra\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/adityakalra</a>; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-INDIA/FUTURE-RELIANCE (EXCLUSIVE, PIX)</p></div>"}