{"date": "2021-12-29 15:11:57.894000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3393.39, "close": 3384.02}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>FANDOM SPORTS MEDIA CORP (\"FDM-Z;FDMSF-0\")\n- Fandom Sports Peer to Peer Esports Wagering Platform Live\n\n     Fandom Sports Media Corp. (\"Fandom Sports\" or the \"Company\"), is\npleased to announce the Company's peer to peer (P2P) Esports wagering\nplatform (www.fandomesports.com) is live and ready for revenue generation.\n\n     The Company recently announced that it had been approved to provide\nSkrill and Neteller payment services as solutions.  Wagering customers are\nnow able to fund their accounts to facilitate P2P wagering on Esports, with\neventual sports and other igaming offerings being deployed in Q1 2022.  The\nCompany's P2P platform is now fully integrated with payment solutions and\nthe Company's banking partners.\n\n     \"We are super excited to have completed our banking and payments\nintegrations.  Now that the first iteration of our modular wagering\nplatform is live, the Company will be transitioning to an operating and\nrevenue generation trajectory.  The P2P Esports is the first instance of\nour modular approach to building out a holistic wagering and prediction\nplatform,\" states David Vinokurov, CEO and President.\n\n     The Company's all-ages sports, Esports prediction and fan engagement\nplatform is on track for completion in Q1 2022 and will serve as the\nprimary tool for audience aggregation to the overall platform.  Fandom\nSports is currently developing a detailed marketing and user activation\nroadmap to support the launch of the all-ages platform and associated\nrevenue streams.\n\n     \"Given that the platform as of launch has been purpose built from\nscratch since Fall of 2020, I am pleased with the corporate progress and\ndevelopment road map to date.  Furthermore, with the steady flow of product\nrollouts and additional potential partnerships on the horizon, I'm\nconfident that 2022 will be a transformational year for value creation and\nan even more fruitful one than this past year,\" continued Mr. Vinokurov.\n\n     Key operational 2021 highlights and accomplishments include:\n\n//st\n\n  * Letter of Intent with Funjoy Company Limited of China - January\n  * Announcement of Letter of Intent with Gamerwager UK - February\n  * Marketing Partnership with Yalla Esports - February\n  * Beta launch of 3 leading Esports titles: League of Legends, DOTA 2,\nCSGO\n    - March\n  * Successfully raising $5,067,588 in April\n  * Completion of first deployment of global server infrastructure - April\n  * Exclusive use license of Databionix UIA platform - May\n  * Joining the Canadian Gaming Association - May\n  * Enabling eleven additional Esports titles for wagering and predictions\n    and enables social sharing across leading social platforms: Facebook,\n    Google, Twitch, Whatsapp, Viber, Pinterest, Reddit, Telegram and\nTwitter\n    - June\n  * Commencement of Malta Gaming Authority applications and corporate\n    formation for B2C and B2B licenses - July\n  * Initiation of corporate wide compliance processes to support global\n    wagering and Non-Fungible Token (NFT) business initiatives - September\n  * Completion of Sports modules (NBA, NHL, MLB, Nascar) for P2P, odds line\n    wagering and all ages fan engagement - September\n  * Key Management and Board Additions - April and September (CFO)\n  * Partnership with Polygon for NFT technology deployment for Fandom\nSports'\n    NFT marketplace; www.fandomart.com - October\n  * Solidifying overseas banking relationships to support global wagering\n    platform - November\n  * Finalizing deployment of Skrill and Neteller for launch of wagering\n    platform - December\n\n//et\n\n     \"We enter 2022 with a strong cash position and as evident from the\nabove list, numerous opportunities that we will begin weaving together to\namplify and expand our presence both in the global wagering and rapidly\nexpanding fan engagement vertical.  I'd like to congratulate and thank our\nentire team for the hard work and dedication to date and we all look\nforward to realizing our vision for Fandom Sports for the coming year,\" Mr.\nVinokurov states.\n\n     About Fandom Sports Media:\n\n     Fandom Sports Media operates an Esports/Sports wagering platform at\nwww.fandomesports.gg  The platform is the ultimate mobile friendly\napplication for unfiltered raw Esports and Sports  predictions and data\ninteractions. Fandom allows passionate fans to unleash their primal\npassions, make predictions and/or wagers and earn rewards.  Fandom Sports\nis a web application which instantly operates on an Android and iOS mobile\ndevice targeting \"Superfans,\" who aspire to show the world they know their\nstuff better than the experts and their friends - giving them a chance to\nPlay, Predict, and Get Rewarded. Fandom Sports is revolutionizing the way\nthat consumers interact with streamed and broadcast content through the\ncreation of www.fandomart.com the Company's own NFT marketplace.  Fans will\nbe able to tune in, watch, predict, wager and create NFTs all on-platform.\n\n     \"PLAY. PREDICT. GET REWARDED.\"\n\n     For additional Information:\n\n     Investor Relations\nEmail:  info@fandomesports.com\nPhone +1 (604) 256 6990\n\n     DISCLAIMER:\n\n     The CSE has not reviewed and does not accept responsibility for the\nadequacy and accuracy of this information. This news release may contain\nforward-looking statements. These forward-looking statements do not\nguarantee future events or performance and should not be relied upon.\nActual outcomes may differ materially due to any number of factors and\nuncertainties, many of which are beyond the Company's control. Some of\nthese risks and uncertainties may be described in the Company's corporate\nfilings (posted at www.sedar.com).\n\n     The Company has no intention or obligation to update or revise any\nforward-looking statements due to new information or events. This press\nrelease contains forward-looking statements about FANDOM SPORTS.\nForward-looking statements may be identified by the use of words like\n\"believe,\" \"expect,\" \"anticipate,\" \"estimate,\" \"plan,\" \"consider,\"\n\"project,\" and similar references to the future. Forward-looking statements\nreflect FANDOM SPORTS' good-faith evaluation of information available at\nthe time the forward-looking statements were made. These forward-looking\nstatements are subject to a number of risks and uncertainties, and our\nactual results may differ materially from those projected. Please refer to\nFANDOM SPORTS' annual and quarterly reports filed on SEDAR for a full\ndiscussion of those risks and uncertainties we view as most important.\nForward-looking statements are not, and should not be relied upon as, a\nguarantee of future performance or results, nor will they necessarily prove\nto be accurate indications of the times at or by which any such performance\nor results will be achieved. As a result, actual outcomes and results may\ndiffer materially from those expressed in forward-looking statements. We\nundertake no obligation to update or revise forward-looking statements.\n     SOURCE FANDOM SPORTS\n\nTel   : 604-256-6990    FANDOM SPORTS MEDIA CORP\nFax   : 604-395-7068\nEmail : info@fandomesports.com\nWWW   : <a href=\"https://www.fandomesports.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.fandomesports.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2136200053.MNPRE2136200355-05221220211229</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}