{"date": "2022-01-03 12:18:08.781000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Future Retail asks court to declare arbitration with Amazon illegal</p><p>India's Future Retail has asked a New Delhi court to declare arbitration proceedings in Singapore with Amazon.com as illegal, arguing that India's antitrust agency had suspended a 2019 deal used by Amazon to assert rights over Future.</p></div><div class=\"tr-npp-body\"><p>Amazon successfully used the terms of its toehold $200 million investment in debt-laden Future to block the Indian retailer's attempt to sell retail assets to a rival, alleging breach of certain contracts.</p><p>But the Indian antitrust body, the Competition Commission of India, in December suspended the 2019 deal saying Amazon suppressed information while seeking approvals. Read more</p><p>Over 500 employees, ex-staff of IPO-bound OYO buy around 30 mn shares</p><p>More than 500 employees and ex-employees of IPO-bound OYO have exercised their stock options grants to purchase over three crore shares of the company, according to regulatory filings by the hospitality chain.</p><p>These shares have been purchased by the employees and alumni by exercising their vested Employees' Stock Option Plan (ESOPs), as per the filings.</p><p>OYO had offered deeply discounted ESOPs to both current and former employees when the impact of COVID-19 led to pay cuts and furloughs. Read more</p><p>Manufacturing PMI eases to three month low in December amid Covid fears</p><p>India\u0092s manufacturing activity lost some momentum in December easing to a three month low after hitting a 10 month high in November, amid fears that the rapidly spreading third wave of the Coronavirus (Covid-19) pandemic may hit consumer sentiment and output.</p><p>Data released by the analytics firm IHS Markit showed that the Purchasing Managers\u0092 Index (PMI) for manufacturing fell to 55.5 in December from 57.6 in November. Read more</p><p>Delhi logs 4,099 new Covid cases, positivity rate jumps to 6.46%</p><p>The national capital on Monday reported 4,099 new Covid cases, 28 per cent more than on Sunday, and one death due to the disease as the positivity rate rose to 6.46 per cent, according to the data shared by the health department.</p><p>If the positivity rate is over five per cent for two consecutive days, it would trigger a 'red alert' under the Delhi Disaster Management Authority-approved Graded Response Action Plan (GRAP) leading to a 'total curfew' and halting of most economic activities. Read more</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Business Standard Ltd.</p></div>"}