{"date": "2021-11-30 07:27:30.818000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 9553TJD Sports Fashion Plc30 November 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>\n</span></p>\n<p>\n<span>30 November 2021</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>JD Sports Fashion Plc</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>DIRECTORSHIP CHANGE</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>JD Sports Fashion Plc (the \"Company\"), the leading retailer of sports, fashion and outdoor brands, today announces that, after more than six years on the Board, Heather Jackson has stepped down from her position as Non-Executive Director, with effect from 29 November 2021.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Peter Cowgill, Executive Chairman, commented:</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\"I would like to thank Heather for her valuable contribution to the Board throughout the last six years. During that period, the Company has developed considerably to become one of the UK's prominent global retailers. I wish her all the best for the future.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The Company also announces that, with effect from 29 November 2021, Mahbobeh Sabetnia has been appointed as a Non-Executive Director.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Mahbobeh</span>\n<span>is a strategic and results driven executive with significant digital transformation experience across various sectors. She has been at the forefront of e-business expansions, leading data-driven consumer insights to unlock value and framing new business propositions. Mahbobeh has an extensive track record delivering digital growth in global organisations and has held executive roles within Amazon.com Inc, McDonald's Corporation, HSBC and, most recently, Mars Inc.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Peter Cowgill, commented:</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>\"On behalf of the Board and the Nominations Committee, I am pleased to welcome</span>\n</span>\n<span>Mahbobeh</span>\n<span>\n<span>\n</span>\n<span>Sabetnia</span>\n<span>\n<span>to the Board of Directors.</span>\n</span>\n<span>Mahbobeh has very relevant digital and e-commerce experience and her expertise will add significantly to the balance and skill sets of the JD Board. I have every confidence that she will be a real asset, as we continue the global expansion of our best in class digital and physical retail proposition. The appointment of Mahbobeh will further strengthen the Board for the benefit of all stakeholders.\"</span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>There are no matters which require to be disclosed pursuant to Listing Rule 9.6.13.</span>\n</p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>BOADBBDBRSDDGBC</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}