{"date": "2021-12-15 09:20:00.686000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">Organizations of all sizes across all industries are modernizing legacy technologies and ecosystems into robust and modern cloud architectures using OutSystems and Amazon Web Services (AWS).</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">SINGAPORE, Dec. 15, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span id=\"spanHghlt8868\"><span class=\"xn-location\">SINGAPORE</span></span>, Dec. <span id=\"spanHghltf475\">15</span>, 2021 /PRNewswire/ -- <u><a href=\"https://www.outsystems.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">OutSystems</a></u>, a global leader in modern application development, today announced that Dr. <span class=\"xn-person\">Max Wang</span>, CTO of International SOS Assistance Inc., and <span class=\"xn-person\">Paulo Rosado</span>, CEO and Founder of OutSystems, <span id=\"spanHghlt2c50\">was present</span> at the 10th annual AWS re:Invent this week. International SOS is the world's largest provider of health and security services and an OutSystems customer. </p>\n\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/1439868/OutSystems_Logo_Logo.html\">\n                    <div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"OutSystems Logo (PRNewsfoto/OutSystems)\" src=\"https://mma.prnewswire.com/media/1439868/OutSystems_Logo_Logo.jpg\" title=\"OutSystems Logo (PRNewsfoto/OutSystems)\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMTQzOTg2OC9PdXRTeXN0ZW1zX0xvZ29fTG9nby5qcGc=&amp;key=9a67a733d339f30eb7167feb88ece27bd2fa8d676f095bea40d990615ae19c8283439ca9685d022be494c5d1eafd4d439e5cc6fc7018e0abc053b01c2e93aa49\"/></div></div>\n                        </a>\n                </p>\n\n    </div>\n<p>International SOS tapped OutSystems to transform its 20-year old legacy applications and development processes and migrated its product ecosystem into AWS Cloud. In the session, Wang and Rosado will describe how custom-built, state-of-the-art cloud applications are creating business value and empowering developers to deliver exceptional software and digital experiences. </p>\n<p>OutSystems has been the platform of choice for companies building applications to address the most significant business issues and opportunities, including streamlining the supply chain, implementing Covid-19 protocols, managing workplace health and safety measures, and modernizing business processes and technologies. Wang will share how the combined power of OutSystems and AWS has helped International SOS migrate their entire product ecosystem into AWS Cloud for best in class cloud infrastructure and transform their legacy applications into highly available, scalable, and robust cloud applications.</p>\n<p>\"As a global organization enabling international businesses to operate safely in complex and often remote environments, it's extremely important that we're able to build secure and scalable software at a speed that keeps pace with our business,\" said Wang. \"Tapping into OutSystems and AWS has dramatically transformed our development processes and capabilities, infusing a new level of agility into our company that has set us up to successfully tackle new ideas and software needs.\" </p>\n<p>OutSystems recently unveiled a new platform, code-named <u><a href=\"https://www.outsystems.com/platform/project-neo/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Project Neo</a></u>, that combines the productivity benefits of visual, model-based development with a state-of-the-art container- and Kubernetes-based cloud architecture, hosted on AWS. Project Neo will empower any company to build custom cloud apps capable of global-scale and continuous change. With its current and future platform offerings, OutSystems enables businesses of all sizes, regardless of industry, to develop serious applications that solve some of the biggest global business challenges, including:</p>\n<p><b>The Global Supply Chain Crisis </b></p>\n<p>With backlogs across the global supply chain impacting life and business around the world, logistics companies have sought out sophisticated solutions that enable them to create apps that track and manage transportation and shipping processes with great success.</p>\n<ul type=\"disc\" class=\"bulleted-list arrowlist\"><li><u><a href=\"https://www.outsystems.com/case-studies/estafeta-agile-logistics-solutions/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Estafeta Mexicana</a></u>, a <span class=\"xn-location\">Mexico City</span>-based shipping contractor, experienced a significant short-term drop in shipping volume at the onset of the Covid-19 crisis, forcing it to pivot and innovate quickly using OutSystems to develop six new or adapted apps that helped Estafeta increase delivery volume by 50 percent. </li><li><u><a href=\"https://www.outsystems.com/case-studies/hermes-borderguru-parcel-tracking/?sc_lang=en\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Hermes BorderGuru</a></u>, a leading consumer delivery company in <span class=\"xn-location\">Europe</span>, embraced OutSystems and adopted a lean, iterative development approach to deliver an initial iteration of a parcel tracking system in just over a week, and then a customized supply chain solution in two months. Thanks to two applications built on the OutSystems platform, Hermes has full visibility as they process 20 million cross-border parcel deliveries each year. </li><li><u><a href=\"https://www.outsystems.com/case-studies/vopak-escapes-erp-lock-in/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Vopak</a></u>, a Dutch multinational company, adopted OutSystems to move off its JD Edwards ERP system. The company was able to achieve a 4x agility boost with its new terminal management system, enabling new capabilities to market sooner. </li></ul><p><b>Pandemic-related Challenges</b></p>\n<p>With global Covid-19 mandate deadlines looming, organizations are scrambling to handle the logistics required to ensure workers are vaccinated or tested regularly, and they're developing digital trackers and applications to help.</p>\n<ul type=\"disc\" class=\"bulleted-list arrowlist\"><li>In under a month, insurance giant <u><a href=\"https://www.outsystems.com/videos/humana-covid-19-test-locator/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Humana</a></u> rolled out a Covid-19 testing site finder, pivoting from an in-progress pharmacy finder app project which was underway in early 2020. After adopting a platform development approach using OutSystems, Humana's digital team has delivered numerous other solutions 4x faster and at a quarter of the cost. </li><li> When the U.S. government launched the Paycheck Protection Program, a team of four developers at SMB fintech <u><a href=\"https://www.outsystems.com/case-studies/lendr-accelerates-app-dev/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Lendr</a></u> used OutSystems to create an app in less than six hours to help their clients through the PPP application process. </li><li>After implementing a work-from-home policy for the majority of its global staff during the Covid-19 crisis, <u><a href=\"https://www.outsystems.com/case-studies/stemcell-low-code-and-reuse-speeds-application-delivery/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">STEMCELL</a></u> used OutSystems to create a new mobile app overnight that monitors the health, availability, and location of all employees on a daily basis. STEMCELL tapped OutSystems to move off its legacy SAP ERP system and has embraced the speed of low-code development to deliver new capabilities 3x faster.</li></ul><p>\"Our relationship with AWS is helping us drive forward our mission to help every organization innovate through software,\" said Rosado. \"AWS re:Invent presents an excellent opportunity to learn from organizations like International SOS about real-world examples of how massive developer productivity is possible on a global scale. As we look ahead to next year and continue to navigate the growing complexities and pace of technology and business change, our continued partnership with AWS provides developers across all company sizes and industries the tools and strategies they need to build the future they want with cloud innovation at the core.\" </p>\n<p>Register for free to watch the OutSystems and International SOS session at AWS re:Invent on <span class=\"xn-chron\">December 1</span> at <u><a href=\"https://reinvent.awsevents.com/register/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://reinvent.awsevents.com/register/</a></u>. </p>\n<p><b>About OutSystems - </b>OutSystems was founded in 2001 with the mission to give every organization the power to innovate through software. The OutSystems modern application platform's high productivity, connected, and AI-assisted tools help developers rapidly build and deploy a full range of applications anywhere the organization requires. With over 525,000 community members, approximately 1,700 employees, more than 400 partners, and active customers in 87 countries and across 22 industries, OutSystems has achieved global scale while helping organizations change the way they develop applications. Visit us at <a href=\"http://www.outsystems.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.outsystems.com</a> or follow us on Twitter <u><a href=\"https://twitter.com/OutSystems\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@OutSystems</a></u> or LinkedIn at<a href=\"https://www.linkedin.com/company/outsystems\" data-type=\"url\" class=\"tr-link\" translate=\"no\"> </a><u><a href=\"https://www.linkedin.com/company/outsystems\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.linkedin.com/compa</a><a href=\"https://www.linkedin.com/company/outsystems\" data-type=\"url\" class=\"tr-link\" translate=\"no\">ny/outsystems</a></u>.</p>\n<p><b>About International SOS</b> – International SOS was founded in 1985 with the mission of providing global medical, security, health, and travel assistance. The company provides services in 90 countries and 1,000 locations. Its 27 Assistance Centers, 64 Clinics, and near 100,000 providers worldwide protect and save lives worldwide. Its enterprise grades SaaS products are used globally by millions of customers in almost every country. <span id=\"spanHghlt86ce\">Visit us at:</span><span id=\"spanHghlt7f22\"> </span><u><a href=\"https://www.internationalsos.com/\"><span id=\"spanHghlt5341\">https://www.internationalsos.com</span></a></u>. For more information on Work Force Resilience (WFR) services and providers, please visit us at: <a href=\"https://www.internationalsos.com/services/workforce-resilience\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.internationalsos.com/services/workforce-resilience</a> </p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n</div>\n<p>SOURCE  OutSystems APAC</p>\n</div>\n<div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: OutSystems</p></div>"}