{"date": "2021-12-07 07:27:54+00:00", "ticker": "ABDN", "mrkt_info": {"open": 237.0, "close": 242.6}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><span>\n              <p>By Sudip Roy</p>\n              <p>LONDON, Dec 7 (IFR) - <b>Investors pour cash into trades</b></p>\n              <p>\n                <strong>Latvia</strong> printed its debut sustainability bond on Monday, a €600m January 2030 offering that priced close to fair value.</p>\n              <p>The upsized deal, which was originally due to raise €500m, came at 25bp over swaps from IPTs of the low 30s as books swelled to more than €2.35bn.</p>\n              <p>Latvia is a well-regarded name and on the sovereign's previous visit to the market nearly six months ago, it also priced the €500m no-grow January 2029 bond close to fair value.</p>\n              <p>Latvia was one of three issuers in the European market on Monday - the international financing and leasing arm of Japan’s Nippon Telegraph and Telephone raised €1.5bn through a dual-tranche issue, while UK asset manager <strong>abrdn</strong> printed a sterling AT1. What was noticeable about all three trades was the strength of demand. <strong>NTT Finance</strong>, for example, saw combined books of more than €6.5bn. An ESG label - the bonds were issued under a green use-of-proceeds structure - may have played a part, as it may have done on Latvia's deal. But even so there were encouraging signs that investors have yet to shut up shop.</p>\n              <p>The US dollar market, meanwhile, was busy with eight issuers, including <strong>Banco de Chile</strong>, raising US$16bn. So although there are central bank meetings to navigate, Monday's deals might yet encourage one or two more issuers to try their hand before year-end.</p>\n              <p>Indeed, risk-on price action has extended across global markets overnight. Nominally it has come amid easing anxiety over the Omicron variant of Covid-19, although Treasuries erasing the excess exuberance after last Thursday’s superficially weak US employment report, and setting up for big duration supply over the rest of the week, has also played a role.</p>\n              <p>Ten-year Treasury futures are down a few ticks from their settle, but are down almost half a point from when Europe went home. S&amp;P futures meanwhile are up more than 25 points or 0.6%, after the S&amp;P 500 gained 1.2% yesterday.</p>\n              <p>Asian bourses show the Nikkei up 1.9%, and the CSI300 up 0.3%. The dollar has given back much of yesterday’s moderate gains, the index easing to DXY96.20, with the euro slightly stronger at EUR/USD1.1294. The yen in contrast is slightly weaker at USD/JPY113.71. Gold is a little higher at US$1,781.60, and Bitcoin continues to recover after Saturday’s sharp sell-off, up slightly to over US$51,000.00. Oil is also strong, Brent crude up US$0.84 at US$73.92.</p>\n              <p>Finally, Turkey’s lira remains steady below USD/TRY14.000, but still has not rallied from this level, and so remains poised to break weaker above last Thursday’s high of USD/TRY13.9000, and so presumably in short order last week’s high of USD/TRY14.0000, beyond which we can only guess at when it will eventually stabilize.</p>\n              <p>News from overnight saw the Reserve Bank of Australia leave policy unchanged, as had been expected, and come across with a neutral statement.</p>\n              <p>Sudip Roy: +44(207) 542 4617, sudip.roy@refinitiv.com </p>\n              <p>Robert Hogg: +44(207) 542 9077, Robert.Hogg@refinitiv.com</p>\n              <p>Client Support: IFR.Clientsupport@refinitiv.com</p>\n              <p>Subscription sales:</p>\n              <p>Asia-Pacific &amp; Japan: cmi.asiasales@refinitiv.com</p>\n              <p>Europe, Middle East &amp; Africa: cmi.emeasales@refinitiv.com</p>\n              <p>Americas: cmi.americassales@refinitiv.com</p>\n              <p>(Reporting by Sudip Roy)</p>\n              <p>((sudip.roy@refinitiv.com; +44 207 542 4617))</p>\n            </span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © Refinitiv 2021. Click For Restrictions - https://www.refinitiv.com/en/policies/copyright-notice</p></div>"}