{"date": "2022-02-08 08:13:04.963000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p> <br/>   By Ujjwal Narayan<br/>NewsRise<br/>   Adds Delhi High Court hearing details <br/>   NEW DELHI (Feb 8) -- India’s Supreme Court today rejected Amazon’s plea to file a written submission after the top court reserved its order on Future Group’s prayer for permission to go ahead with Reliance Industries' acquisition deal.<br/><br/>“You want to complicate matters, drag on hearings; best not to list these matters, it appears to be a luxurious litigation,” Chief Justice N.V. Ramana observed.<br/><br/>In 2019, Amazon invested $200 million in Future Coupons for a 49% stake, which gave the U.S. company a 7.3% foothold in flagship Future Retail. However, the two companies fell out after debt-laden Future Group agreed to sell its retail, wholesale, warehousing, and logistics businesses in August 2020 to billionaire Mukesh Ambani’s Reliance Industries in a $3.4 billion deal. The deal with Reliance is crucial to Future Group, which is on the brink of liquidation.<br/><br/>Amazon tried to block the deal by getting a freeze order from Singapore arbitration court. Future Group’s prospective sell out to Reliance threatens the U.S. company’s dominance in India.<br/><br/>The Competition Commission of India kept its approval for the 2019 deal between Amazon and Future on hold, accusing the U.S. e-commerce company of hiding information while seeking regulatory approval.<br/><br/>Meanwhile, the Delhi High Court today asked both Amazon and Future Retail to give details of all pending issues between the two groups and clubbed cases, citing an apex court order.<br/><br/>“Three different single-judge benches were hearing cases. The Supreme Court order mandated clubbing of pending issues, both parties to give small note of four pages,” Justice C Hari Shankar said. <br/><br/>The court will hear the pending cases on Feb. 11, the judge said.  <br/>   - By Ujjwal Narayan; Ujjwal.Narayan@newsrise.org; 01166767700<br/>- Edited by Dhanya Ann Thoppil<br/>- Send Feedback to feedback@NewsRise.org<br/>- Copyright (c) 2022 NewsRise Financial Research &amp; Information Services Pvt. Ltd.<br/>    </p></div>"}