{"date": "2022-01-10 11:00:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Ross Kerber</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Jan 10 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>A Texas-based fund manager is not jumping on the bandwagon of peers backing shareholder resolutions that call on companies to take stronger action on climate change. Dimensional Fund Advisors argues it would be more effective to just replace corporate directors who fail to address the issue.</p><p>Austin-based Dimensional backed just a tiny fraction of the climate-related shareholder resolutions tracked by Boston-based advocacy group Ceres last year.</p><p>Firm executives said the measures demanding everything from emissions reports to contingencies for extreme temperatures can be ineffective or not material to investors, even if the measures pass.</p><p>While Dimensional wants boards to oversee environmental risks, \"not every issue of environmental concern is material to shareholders,\" said Jim Whittington, Dimensional's head of responsible investment, <span class=\"tr-strong\">in a recent interview.</span></p><p>    Meanwhile Dimensional has voted against corporate directors more often than rivals, although it is unclear how often those votes stemmed from environmental issues.</p><p><span class=\"tr-strong\">Whittington said corporate </span>directors are the ones best-placed to judge a company's exposure to climate risk<span class=\"tr-strong\">. </span></p><p>\"Our overall philosophy is that we're trying to protect and enhance shareholder value,\" Whittington added. For some companies, steps to counter or adapt to climate change can certainly make sense, he said.</p><p><span class=\"tr-strong\">In </span>2021 Dimensional supported just two of 49 climate-related shareholder resolutions tracked by Ceres, about the same level as in 2020 and the lowest support rate by a significant margin among 58 top asset managers.</p><p>The average vote on the resolutions rose to 41% in 2021 from 31% in 2020, <span class=\"tr-strong\">Ceres found, as </span>giant asset managers BlackRock Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=BLK.N\" data-type=\"ric\" data-ric=\"BLK.N\" translate=\"no\" dir=\"ltr\">BLK.N</a> and Vanguard Group <span class=\"tr-strong\">ramped up their support</span>. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2SM2EH\" data-type=\"storyId\" data-story-id=\"nL1N2SM2EH\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Ceres said Dimensional risks losing assets as investors put more <span class=\"tr-strong\">money into funds focused on environmental, social and governance (ESG) matters</span>. <span class=\"tr-strong\">Dimensional actually has seen outflows from its funds firmwide, although analysts cited other factors. Still, Dimensional's own ESG funds have had substantial inflows.</span></p><p>Many climate activists blast Dimensional's voting approach, saying the resolutions can spur companies to quicker action.</p><p>    \"Dimensional needs to face the gravity of the systemic risk created by climate change,\" said Rob Berridge, Ceres' senior director of shareholder engagement.</p><p><br/></p><p><span class=\"tr-strong\">STRATEGY PIONEER</span></p><p>With $710 billion in assets, Dimensional developed a reputation on Wall Street as an influential pioneer of quantitative and value-investing strategies. Its contrarian take on climate change-related resolutions stands out <span class=\"tr-strong\">as more of the  </span>asset management industry <span class=\"tr-strong\">pays attention to ESG matters</span>.<span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2SZ1XA\" data-type=\"storyId\" data-story-id=\"nL1N2SZ1XA\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>    The Austin-based firm saw <span class=\"tr-strong\">net </span>withdrawals of $10.<span class=\"tr-strong\">3</span> billion for the first 11 months of 2021 and $37.7 billion for all of 2020, according to Morningstar Direct.</p><p><span class=\"tr-strong\">For last year, Dimensional said its specialized </span>U.S. sustainability-focused funds, which supported more <span class=\"tr-strong\">of the </span>climate resolutions tracked by Ceres, had net deposits of about $2 billion.</p><p>    Morningstar analyst Daniel Sotiroff said the outflows were likely due to its investment focus on smaller companies <span class=\"tr-strong\">at a time investors were chasing</span> gains in companies with large capitalizations, such as Tesla Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TSLA.O\" data-type=\"ric\" data-ric=\"TSLA.O\" translate=\"no\" dir=\"ltr\">TSLA.O</a> and Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>.</p><p>Dimensional's ESG approach \"fits in with its house philosophy\" that with sufficient disclosures, efficient markets will price in the risks companies face, Sotiroff said.</p><p>    When Dimensional votes against climate-related resolutions, it is often in the minority. Last May, it voted against a proposal for ConocoPhillips <a href=\"reuters://REALTIME/Verb=FullQuote/ric=COP.N\" data-type=\"ric\" data-ric=\"COP.N\" translate=\"no\" dir=\"ltr\">COP.N</a> to disclose so-called 'Scope 3' carbon emissions, created when consumers burn its fuel. The resolution passed <span class=\"tr-strong\">with 59% </span>support.</p><p>Dimensional's head of investment stewardship, Kristin Drake, said in an interview that the oil and gas exploration and production company has little control of how its fuels are used. \"For them to even be able to calculate their Scope 3 emissions would be really difficult,\" she said. </p><p>A Conoco representative declined to comment on Dimensional's voting or whether it might set a Scope 3 target.</p><p>In the case of Monster Beverage Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MNST.O\" data-type=\"ric\" data-ric=\"MNST.O\" translate=\"no\" dir=\"ltr\">MNST.O</a>, Dimensional's views carried the day. The firm voted in June against a proposal for the soft drinks giant to offer investors an annual \"say-on-climate\" vote. Drake said the idea would insulate boards from accountability<span class=\"tr-strong\">. At Monster it </span>won just 7% support.</p><p>\"If shareholders <span class=\"tr-strong\">are unhappy, </span>they should be voting against directors,\" Drake said. </p><p>A Monster spokesperson declined to comment.</p><p><br/></p><p>BACKING DIRECTORS LESS</p><p>Dimensional has been less supportive of board directors than other major asset managers. It voted in favor of company-nominated directors just 86% of the time at U.S. shareholder meetings in 2021, compared to an average of 91% for investors of its size and larger, according to research firm Insightia.</p><p>Insightia also found about 8% of Dimensional's critical board votes went against directors who served on a board committees overseeing environmental or similar matters.</p><p>Since few companies have such committees, the finding suggests Dimensional was willing to vote against directors where it saw environmental concerns, said Doug Chia, president of consulting firm Soundboard Governance.</p><p>Dimensional did not provide a breakdown of how often its critical board votes were tied to climate change. </p><p>\"We vote against directors for reasons that we think are likely to contribute to insufficient oversight of E&amp;S (environmental and social) risk such as a lack of independence, poor attendance, and serving on an excessive number of boards,\" Drake said.</p><p><span class=\"tr-strong\">Dimensional backed two of three dissident directors who won seats at Exxon Mobil </span><a href=\"reuters://REALTIME/Verb=FullQuote/ric=XOM.N\" data-type=\"ric\" data-ric=\"XOM.N\" translate=\"no\" dir=\"ltr\">XOM.N</a> last May, choosing to support nominees of hedge fund Engine No. 1 <span class=\"tr-strong\">which </span>argued the oil major was not doing enough to tackle climate change. </p><p><span class=\"tr-strong\">In addition, o</span>n April 9 Dimensional also voted against the re-election of a Rio Tinto Plc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RIO.L\" data-type=\"ric\" data-ric=\"RIO.L\" translate=\"no\" dir=\"ltr\">RIO.L</a> director who chairs its sustainability board committee. <span class=\"tr-strong\">In an e-mail to Reuters </span>Dimensional said the vote was due to \"ongoing concerns about Rio Tinto’s oversight of material environmental and social risks.\"</p><p><span class=\"tr-strong\">The nominee, Megan Clark</span>, won 74% of votes, the lowest of any director. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2T40HT\" data-type=\"storyId\" data-story-id=\"nL1N2T40HT\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>A Rio Tinto spokesman declined to comment on Dimensional's votes.</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Ross Kerber in Boston<br/>Editing by Greg Roumeliotis and David Gregorio)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:ross.kerber@thomsonreuters.com\" data-type=\"email\" translate=\"no\">ross.kerber@thomsonreuters.com</a> ; (617) 856 4341; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://Ross.Kerber.Reuters.com@reuters.net\">Ross.Kerber.Reuters.com@Reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: CLIMATE-INVESTORS/DIMENSIONAL (FOCUS, PIX)</p></div>"}