{"date": "2021-12-06 15:47:24+00:00", "ticker": "ABDN", "mrkt_info": {"open": 237.0, "close": 242.6}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><span>\n              <p>LONDON, Dec 6 (IFR) - The first issuance of Additional Tier 1 capital by an asset manager was rapturously received by investors on Monday as <strong>abrdn </strong>rode strong momentum to compress the size of the pick-up offered versus conventional bank bonds, with the pioneering £210m deal pulling in more than £1.75bn of orders at the peak. </p>\n              <p>Abrdn, which changed its name from Standard Life Aberdeen in a rebrand earlier this year, did not only have to convince its peers in an untested format, but also had to navigate a market that has seen liquidity dry up towards the year-end and in which some Tier 1 products have suffered. </p>\n              <p>A modest rebound in broader conditions teed up a swift entry to the market, following the conclusion of two days of marketing efforts. </p>\n              <p>Leads <span>Barclays</span>, <span>Bank of America</span>, <span>HSBC </span>and <span>JP Morgan </span>showed the perpetual non-call June 2027 transaction with initial price thoughts of 6% area for an expected size of £200m. </p>\n              <p>An investor said the IPTs seemed to offer an attractive premium rewarding investors for the \"complexity\" of the deal.</p>\n              <p>\"The business model is solid, it's a highly-rated issuer and the bond is going to be investment-grade,\" he said.</p>\n              <p>\"If you compare it to similarly rated AT1s, based on the IPTs, it does seem you're getting a premium for something that is less well-known in the debt market and the business models you're less used to seeing.\"</p>\n              <p>Abrdn and its leads were, however, able to significantly reduce the size of that pick-up thanks to strong demand. </p>\n              <p>Guidance was set at 5.5% area and the size at £210m before the coupon was fixed at 5.25%, with books closing in excess of £1.75bn (pre-rec). </p>\n              <p>Prior to the execution, bankers had suggested the two book-ends for the price were the sterling AT1s of established UK bank issuers, cited in the high 4s, and deals from rarer bank issuers such as OSB Group, whose £150m perpetual non-call 2027s were bid at around 6%. </p>\n              <p>\"I was thinking a 6% land would be about fair, taking a view from OSB, but clearly I was wrong and it's gone much better than I would have thought,\" said a syndicate banker away from the leads.</p>\n              <p>\"It's very well rated, which is obviously in its favour, but to some degree I thought investors would have taken a bit more advantage given the time of year and the fact [abrdn] need to do the trade... it speaks towards the bid for yield continuing in the sterling market.\"</p>\n              <h3>Eye-catching coupon</h3>\n              <p>Bankers said there a few investment-grade alternatives that also offer a yield of more than 5%. The deal is expected to be rated Baa2/BBB- by Moody’s/S&amp;P.</p>\n              <p>\"When you've got a book of £1.7bn-£1.8bn for a £210m maximum size, you feel as if you might have started a little wide, but the 6% was eye-catching and got the right momentum,\" said a banker at one of the leads.</p>\n              <p>\"There was a healthy debate this morning about whether it could start in the high 5s and have a chance to get close to 5%, but it is an age old debate - if you start at 6% you can get 75bp, but if you start at 5.75% are you going to get that same 75bp leverage? This is ending up where it should end up.\"</p>\n              <p>The lead banker added that the deal benefited from the best market conditions of the last two weeks, suggesting the conducive backdrop allowed them to shave off an additional 25bp from the price. </p>\n              <p>He said the composition of the order book was broadly similar to that of a traditional sterling AT1, with good participation from abrdn's fellow asset managers.</p>\n              <p>\"One thing it doesn't have is some of the fast money accounts - I think it's slightly better quality than the average bank AT1 book,\" he said, adding that the demand bodes well for the deal's performance in the secondary market. </p>\n              <p>\"This should be locked down because it is really a museum piece and I don't think there will be a raft of these deals coming behind. Even if there were four or five asset managers wanting to do similar deals, they would be limited on the size they could do.\"</p>\n              <p>Bankers suggested a sizeable buffer to the deal's equity conversion trigger helped investors to get comfortable with the new product. The trigger will first be set at 7% of abrdn's risk weighted assets, but will switch to 70% of the own funds requirement under new Investment Firms Prudential Regime (IFPR) rules that will apply from January 1 2022, translating to a buffer of around £900m.</p>\n              <p>Market participants also pointed to some advantageous features of the deal when compared with bank AT1s. Unlike with traditional AT1s, there are no maximum distributable amount restrictions applicable and the deal does not feature statutory point of non-viability loss absorption.</p>\n              <p>Abrdn announced the mandate for the deal last Thursday on the same day it confirmed it will buy interactive investor, an online investment platform, for £1.49bn.</p>\n              <p>Abrdn said the acquisition, which will be funded by available cash from its capital reserves, will increase its assets under management fivefold to £69bn and more than double its revenue to £199m.</p>\n              <p>The AT1 is aimed at optimising abrdn's capital under the new IFPR rules. While abrdn's Tier 2 bucket is already filled, it has scope for around £200m of the total capital requirement to be met by AT1.</p>\n              <p>(Reporting by Tom Revell, editing by Helene Durand, Sudip Roy)</p>\n              <p>((tom.revell@refinitiv.com; +44 (0) 7557 138961))</p>\n            </span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © Refinitiv 2021. Click For Restrictions - https://www.refinitiv.com/en/policies/copyright-notice</p></div>"}