{"date": "2021-09-13 07:00:22+00:00", "ticker": "AVV", "mrkt_info": {"open": 3956.0, "close": 3910.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><br/>\nBy Staff Writer<br/>\n<p><span class=\"round articleImage\" id=\"span\"></span></p>\n<div id=\"atext\">\n<div>Aveva, a global leader in industrial software, driving digital transformation and sustainability, has announced the launch of Aveva Unified Learning as part of its portfolio available on Aveva Connect, common cloud platform.</div>\n</div>\n<div> </div>\n<div>The new cloud-based employee development solution helps Aveva customers advance industrial workers from novice to expert by using blended custom and generic experiential training modules, including Aveva’s Process Competency Training, Pipeline Competency Training, and The Operations Excellence Group’s OEG Knowledge Library, the company said in a statement.</div>\n<div> </div>\n<div>Harpreet Gulati, Senior Vice President, Planning, Simulation and Optimization Business, Aveva commented: “Effective training programs are essential to help prevent industrial accidents and ensure safety, especially when the workforce is inexperienced or unaccustomed to new plant technologies. As the name suggests, Aveva Unified Learning combines a set of development elements within one cloud-based platform so training managers can customize learning development to each member of their workforce wherever they are. Experiential learning can now be delivered in safe, simulation-based environments while workforce competence and operational excellence can be tracked at the same time.”</div>\n<div> </div>\n<div>Aveva Unified Learning drives competency and consistency through experiential learning on a single platform, serving as a unique offering at a time when companies are focused on improving skills to contend with radically altered business environments and an influx of new staff. Without Aveva Unified Learning, training leaders face major challenges in managing learning programs across a diverse and dispersed workforce with varying skill levels. By eliminating deployment hurdles and simplifying program management, Aveva empowers customers to improve the learning experience and extract greater value from their training investments.</div>\n<div> </div>\n<div>Aveva Unified Learning closes the competency gap between a retiring workforce and the new generation of connected workers. Overall, employees are empowered to perform better in a shorter time, thanks to targeted eLearning, video content, and simulation-based learning programs.</div>\n<div> </div>\n<div>Since Aveva Unified Learning simulators are entirely cloud-based and offered as Software-as-a-Service (SaaS), organizations benefit from global accessibility and scalability. With training delivered directly to each worker’s device, cost, time and energy outlays are reduced alongside the organization’s carbon footprint.</div>\n<div> </div>\n<div>Aveva Unified Learning provides access to Aveva’s vast portfolio of training and simulation applications in a single hub on Aveva Connect. It is licensed via Aveva Flex, a flexible subscription program designed to simplify license purchase, usage and management. The product leverages Aveva’s digital twin technology for ongoing operational excellence including operator training simulators and 3D virtual reality environments, delivering these on the Cloud.</div>\n<div> </div>\n<div>The launch of Aveva Unified Learning responds to a growing demand for learning solutions aimed at a digitally native workforce. By 2030, the bulk of the workforce will be made up of Generations Y and Z, most of whom are only familiar with a digital-first, mobile-first world. For these digital natives, workplace technology is now a factor in the choice of job. Over 90% of Generation Z – people born after 1996 – say technology offered by an employer influences their job choice.<strong>--TradeArabia News Service</strong></div>\n<p class=\"syndigate_disclaimer\">Copyright 2021 Al Hilal Publishing and Marketing Group Provided by SyndiGate Media Inc. (<a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a>).</p>\n<div class=\"footnote-disclaimer\">Disclaimer: The content of this article is syndicated or provided to this website from an external third party provider. We are not responsible for, and do not control, such external websites, entities, applications or media publishers. The body of the text is provided on an “as is” and “as available” basis and has not been edited in any way. Neither we nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this article. <a href=\"https://d3a0oa8cittb3t.cloudfront.net/researchreports/Disclaimers/TR%20Disclaimer.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read our full disclaimer policy here</a>.</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© TradeArabia</p></div>"}