{"date": "2022-01-29 10:52:46.449000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2792.75, "close": 2991.47}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Jan. 29 -- Apple iPhones continue to attract buyers and to cater the demands the e-commerce portals like Flipkart and Amazon extend the benefits on buying an iPhone. The 2020-made, iPhone 12 models, iPhone 12 mini and iPhone 12, are being offered at discounts on Flipkart and Amazon. With the exchange offer in place both these e-commerce portals are offering Rs.13,600 and Rs.14,950 respectively on iPhone 12 model. Similarly, the iPhone 12 mini price could reach at Rs.28,399 on Flipkart.</p><p>As we told you before as well, these offers may vary from place to place and largely depends on the smartphone that is going for the exchange. The recent purchased phones may get you better returns in the exchange offer.</p></div><div class=\"tr-npp-body\"><p>You can manually check the buyback applicable on your smartphone by entering the IMEI number of the phone. The offer may not be available at all ZIP codes in the country. The offer on the Apple iPhones can be even sweeter if you're using a credit card.</p><p>Flipkart is offering 5 per cent cashback on the Axis Bank credit card users whereas Amazon is offering it to Citi card users.</p><p>The Apple iPhone 12 price can be brought down to Rs.39,399 for the 64GB variant with exchange offer. The similar offer is available on the 12GB variant as well. Similarly, the iPhone 12 mini can be yours at just Rs.28,399 with the exchange offer on Flipkart.</p><p>On Amazon, the iPhone 12 can be purchased at Rs.42,049 for the 64GB version.</p><p>The Apple iPhone 12 comes with a 6.1 inch notch display. It has dual 12MP rear lenses along with a 12MP selfie camera. iPhone 12 runs on A14 Bionic chipset. Similarly, the iPhone 12 mini gets a 5.4 inch Retina display, with same camera set up as iPhone 12, and same chipset. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}