{"date": "2021-12-23 16:11:18.186000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3420.74, "close": 3393.39}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NEXTECH AR SOLUTIONS CORP (\"NTAR-Z\")\n- Sees Demand For Its 3D Models Rapidly Growing As It Signs Deals\n- Across A Wide Spectrum of Industries\n\n     Nextech AR Solutions Corp. (\"Nextech\" or the \"Company\") a Metaverse\nCompany and leading provider of augmented reality (\"AR\") experience\ntechnologies and services is pleased to announce the signing of multiple AR\necommerce deals across a variety of industries. By leveraging its AI\npowered 3D model factory, ARitize 3D, the Company has expanded its 3D for\necommerce business into winter sports equipment, ultra-specialized\nfurniture markets, eyewear, consumer goods, handbags and more highlighting\nthe range of specialty assets that ARitize 3D can create.\n\n     Nextech AR CEO, Evan Gappelberg commented, \"It really feels like the\nwhole world is going 3D - and I believe that the mass adoption of 3D models\nhas started. Since the launch of ARitize 3D in October - we have signed\nover 60 new accounts which have cumulatively purchased thousands of 3D\nmodels and as our upcoming January 15th Shopify integration goes live we\nexpect that demand will only increase. This is a big validation of our\nefforts, and showcases our 3D/AR tech stack as a true disrupter in the\nemerging multi-billion dollar 3D model market. He continues - With our AI\nand CAD powered 3D model factory, I believe that we have the highest\nquality, lowest cost, most scalable solution anywhere. Currently, all signs\nare pointing to 2022 being a breakout year for everything 3D!\"\n\n     With the mass adoption of 3D models underway, seeing a wide variety of\ncompanies from different industries that are implementing our 3D/AR models\nto showcase their products. This is evident through Nextech's recent\ncustomer sign ups for ARitize 3D, (see below). These companies are now\noffering their customers an immersive, engaging shopping experience, which\nhas been proven to result in higher click-through rates, higher\nconversions, and decreased returns.\n\n     Ultra-Specialized Furniture\n\n     Partnering with a number of specialized furniture manufacturers,\nNextech AR has begun to dominate the ultra specialized furniture market for\nshowcasing products in 3D and Augmented Reality. Nextech's ARitize 3D\nprovides the level of precision and detail required to properly showcase\nthese companies assets in 3D and Augmented Reality, providing their clients\nwith a more engaging experience. Notable brands include the following:\n\n     View a sampling of customers and 3D/AR models here:\n\n     * NorthByNorth, a specialized bamboo furniture manufacturer. Click\nHERE\n\n     * Blooming Tables, a specialty furniture manufacturer aiming to bring\nthe beauty of the outdoors - indoors with their unique living furniture.\nClick HERE\n\n     * The Office Group, a specialty office furniture manufacturer with a\nlarge variety of office furniture solutions. Click HERE\n\n     * Just Recliners, a customized recliner manufacturer using innovative\nand custom designs. Click HERE\n\n     * Ezooza, an Italian home goods manufacturer with a large variety of\ninnovative products. Click HERE\n\n     Winter Sports Equipment\n\n     Nextech has partnered with Never Summer, a premier snowboard and\nwinter apparel manufacturer to create assets both in 3D and Augmented\nReality using ARitize 3D. The detailed view that Nextech is able to provide\nincreases customer confidence when buying online. This partnership marks\nthe beginning of Nextech's expansion into the winter apparel market.\n\n     Click HERE for an example of the 3D / AR snowboard.\n\n     Other Speciality Markets\n\n     In addition to specialized furniture and winter sports, Nextech has\ncontracted with a variety of industries to create 3D and Augmented Reality\nassets using ARitize 3D. These include:\n\n     * Bizr Klan Eyewear, where clients get a 3D / AR view of their new\nglasses\n\n     * Mitra10, an Indonesia company specializing in consumer home goods,\nhighlighting their products in 3D/ AR. See a an example of a shower column\nHERE and a toilet HERE\n\n     * Cle Privee, a provider of bespoke gift experiences, showcased a\nBirkin bag on their website in Augmented Reality\n\n     These are just a few of the most recent customers and sectors the\nCompany has expanded into. With their Metaverse suite of products, Nextech\nwill continue to reach new markets, expand their solutions into the\necommerce sector.\n\n     To learn more, please follow us on Twitter, YouTube, Instagram,\nLinkedIn, and Facebook, or visit our website: <a href=\"https://www.Nextechar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.Nextechar.com</a>.\n\n     About Nextech AR\n\n     Nextech AR Solutions is a Metaverse company that develops and operates\naugmented reality (\"AR\") platforms, transporting three-dimensional (\"3D\")\nproduct visualizations, human holograms and 360 portals to its audiences\naltering e-commerce, digital advertising, hybrid virtual events (events\nheld in a digital format blended with in-person attendance) and learning\nand training experiences.\n\n     Nextech focuses on developing AR solutions for the Metaverse, however\nmost of the Company's revenues are derived from three e-Commerce platforms:\nvacuumcleanermarket.com (\"VCM\"), infinitepetlife.com (\"IPL\") and\nTrulyfesupplements.com (\"TruLyfe\"). VCM and product sales of residential\nvacuums, supplies and parts, and small home appliances sold on Amazon.\n\n     Forward-looking Statements\n\n     The CSE and the NEO have not reviewed and do not accept responsibility\nfor the adequacy or accuracy of this release.\n\n     Certain information contained herein may constitute \"forward-looking\ninformation\" under Canadian securities legislation. Generally,\nforward-looking information can be identified by the use of forward-looking\nterminology such as, \"will be\" or variations of such words and phrases or\nstatements that certain actions, events or results \"will\" occur.\nForward-looking statements regarding the completion of the transaction are\nsubject to known and unknown risks, uncertainties and other factors. There\ncan be no assurance that such statements will prove to be accurate, as\nfuture events could differ materially from those anticipated in such\nstatements. Accordingly, readers should not place undue reliance on\nforward-looking statements and forward-looking information. Nextech will\nnot update any forward-looking statements or forward-looking information\nthat are incorporated by reference herein, except as required by applicable\nsecurities laws.\n\nContacts\nInvestor Relations\nLindsay Betts\ninvestor.relations@Nextechar.com\n866-ARITIZE (274-8493) Ext 7201\n\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2135600302.MNPRE2135600876-07473620211223</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}