{"date": "2021-01-26 07:10:46.187000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3815.0, "close": 3720.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 8307MIdeagen PLC26 January 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>THIS ANNOUNCEMENT CONTAINS INSIDE INFORMATION</span>\n</p>\n<p>\n<span>26 January 2021</span>\n</p>\n<p>\n<span>Ideagen PLC</span>\n</p>\n<p>\n<span>(\"Ideagen\" the \"Company\" or the \"Group\")</span>\n</p>\n<p>\n<span>Succession of Chairman</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Ideagen PLC (AIM: IDEA), a leading supplier of regulatory and compliance software, today announces that David Hornsby, executive chairman, has informed the Board of his intention to retire from the Group in May 2021 with the announcement of the Group's trading update for the year ending 30 April 2021.</span>\n</p>\n<p>\n<span>David will be succeeded as chairman, in a non-executive capacity, by Richard Longdon. Richard is currently the Company's senior independent director. Prior to joining the Group in November 2019, Richard spent 33 years at Aveva Group plc, including 17 years as CEO. During this time, that business grew from a £7m management buyout to a £42m public listing and was valued at £1.4bn on his retirement in 2016.</span>\n</p>\n<p>\n<span>David's executive responsibilities will move over to Ben Dorks, the Group's Chief Executive Officer since 2018, and to Emma Hayes, Chief Finance Officer, who brings extensive M&amp;A experience from her role in Corporate Finance for Deloitte for 10 years.</span>\n</p>\n<p>\n<span>\n<span>Commenting on his retirement, David Hornsby, said:</span>\n</span>\n</p>\n<p>\n<span>\"I am extremely proud of what I have achieved at Ideagen over the last twelve years. Having established the Group in 2009 through my investment in Datum I am a significant shareholder and the continued success of Ideagen is of the utmost importance to me. I am confident that the Company is today in the strongest position it has ever been, led by an exceptional executive group and a strong board who are successfully implementing a clear strategy. Following the acquisition of Huddle on 23 December 2020 and with a further deal progressing well it is the right time to announce my retirement. I now look forward to effecting a smooth transition before my departure in May and I thank all employees, partners, customers and investors who have supported the Group over the years.\".</span>\n</p>\n<p>\n<span>\n<span>\n</span>\n<span>\n<span>Commenting on David's retirement Ben Dorks said:</span>\n</span>\n</span></p>\n<p>\n<span>\"I have worked closely with David for the last 8 years. What he has achieved at Ideagen is quite outstanding. Under his leadership, first as chief executive officer from 2009 to 2018, and then as executive chairman, the Group has grown from a market value of £0.5m and a share price of 2p to its current position. Having made 20 acquisitions Ideagen is now a world leader in the provision of regulatory and compliance software with over 5000 customers, 600 employees with offices in EMEA, Europe and Asia.</span>\n</p>\n<p>\n<span>His work ethic and dedication to the Company and its employees has been remarkable. He leaves an extraordinary legacy to follow and we wish him the very best for the future.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Richard Longdon, non-executive chairman-elect, commented:</span>\n</span>\n</p>\n<p>\n<span>\"I am honoured and excited to have been asked to succeed David as Chair of Ideagen and I look forward to working with the Board, Ben Dorks and his executive leadership team as the Company continues to grow.\"</span>\n</p>\n<p>\n<span>Alan Carroll has agreed to postpone his planned retirement as a non-executive director of the Group so as to provide continuity and maintain levels of experienced non-executive board representation. Alan had intended to retire in July 2021 after nine years in line with best corporate governance practice. The Group's audit committee will now comprise of Julian Clough (chair) and Tony Rodriguez, the nomination committee of Alan Carroll (chair) and Richard Longdon, and the remuneration committee of Tony Rodriguez (chair) and Alan Carroll.</span>\n</p>\n<p>\n<span>Enquiries:</span>\n</p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>Ideagen plc</span>\n</p>\n</td>\n<td>\n<p>\n<span>01629 699100</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Ben Dorks, Chief Executive Officer</span>\n</p>\n</td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Emma Hayes, Chief Financial Officer</span>\n</p>\n</td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n<span>finnCap Limited (NOMAD and Joint Broker)</span>\n</p>\n</td>\n<td>\n<p>\n<span>020 7220 0500</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Henrik Persson / James Thompson / Kate Washington (Nomad)</span>\n</p>\n</td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Alice Lane / Sunila Da Silva (ECM)</span>\n</p>\n</td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Canaccord Genuity Limited (Joint Broker)</span>\n</p>\n</td>\n<td>\n<p>\n<span>020 7523 8000</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Simon Bridges</span>\n</p>\n</td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Richard Andrews</span>\n</p>\n</td>\n<td>\n<p>\n</p></td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<p>\n<span>About Ideagen plc</span>\n</p>\n<p>\n<span>Ideagen is a UK-headquartered, global technology company quoted on the London Stock Exchange AIM market (Ticker: IDEA.L).</span>\n</p>\n<p>\n<span>A global supplier of regulatory and compliance solutions, Ideagen provides a common software platform and an integrated risk- based approach to meet multi-industry standards, enabling compliance with relevant laws, policies, and regulations.</span>\n</p>\n<p>\n<span>The Group provides software and services to organisations operating within highly regulated industries such as life sciences, healthcare, banking and finance, insurance, aviation, and aerospace and defence, with its main operational premises spread throughout the UK, EU, US, Middle East and SE Asia.</span>\n</p>\n<p>\n<span>Currently, more than 5,700 organisations use Ideagen's products including nine of the top 10 UK accounting firms, all of the top aerospace and defence companies globally and 75% of the world's leading pharmaceutical firms. Ideagen's diverse and varied customer base includes many well-known, global brands such as British Airways, Aggreko, BAE, Ryanair, US Navy, KLM, BBVA, Bank of New York, Commerzbank, Meggitt, Heineken, Johnson Matthey, Haeco Group and European Central Bank. As well as this, Ideagen counts 250 hospitals across the UK and US amongst its client base. For further information please visit www.ideagen.com .</span>\n</p>\n<p>\n<span>Ideagen directly employs over 600 members of staff and is present in every continent globally.</span>\n</p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> . <br/>\n<br/> RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>BOASESFAIEFSEDF</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}