{"date": "2021-10-25 18:00:25+00:00", "ticker": "ABDN", "mrkt_info": {"open": 256.9, "close": 258.9}, "html": "<div class=\"storyContent\" lang=\"pt\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">Por Tatiana Bautzer</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">SÃO PAULO,25 Out (Reuters)</span><span class=\"tr-dl-sep\"> - </span>A empresa brasileira de private equity Tarpon Capital tentará vender sua empresa de energia renovável Omega Desenvolvimento, caso uma proposta de fusão com a Omega Geração <a href=\"reuters://REALTIME/Verb=FullQuote/ric=OMGE3.SA\" data-type=\"ric\" data-ric=\"OMGE3.SA\" translate=\"no\" dir=\"ltr\">OMGE3.SA</a> falhe, disseram duas fontes com conhecimento do assunto.</p><p>Uma assembleia de acionistas está marcada para quinta-feira para votar os termos da proposta de fusão entre a Omega Geração, que opera ativos de geração de energia renovável, e a Omega Desenvolvimento, que tem projetos de energia renovável em construção.</p><p>A Tarpon, acionista controladora de ambas as empresas, não vai votar na assembleia. Os acionistas minoritários questionaram o negócio dizendo que a avaliação da Omega Desenvolvimento era muito alta.</p><p><span class=\"tr-strong\">Em discussões com os acionistas minoritários, a Tarpon concordou em reduzir o valor implícito da Omega Desenvolvimento de 2,7 bilhões de reais para 1,9 bilhão de reais. Mas agora alguns acionistas minoritários, liderados pelos gestores de ativos da Squadra e da IP Capital, querem um corte de preço adicional e a Tarpon não concorda com isso, disseram as fontes, pedindo anonimato para divulgar as discussões privadas.</span></p><p>Se o negócio for rejeitado, a Tarpon deve procurar um comprador para a empresa, disseram as fontes.</p><p>O Banco BTG Pactual, que foi contratado pela Tarpon para negociar os termos do negócio com os acionistas minoritários da Omega Geração, terá mandato de venda caso a fusão não seja aprovada em assembleia.</p><p>Omega Geração, Tarpon e BTG Pactual não se manifestaram imediatamente sobre o assunto.</p><p>(Reportagem de Tatiana Bautzer)</p><p>((Tradução Redação São Paulo, 55 11 56447745))</p><p>REUTERS LM RS</p><p><br/></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: EMPRESAS-TARPON-OMEGA DESENVOLVIMENTO/</p></div>"}