{"date": "2022-01-24 22:50:27.849000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">One of the industry's most prominent people-first culture leaders made investments to growing happiness in mental health and DEI initiatives</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">NEW YORK, Jan. 24, 2022</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">NEW YORK</span>, <span class=\"xn-chron\">Jan. 24, 2022</span> /PRNewswire/ -- Tinuiti, the largest independent performance marketing firm across Streaming TV and the Triopoly of Google, Facebook, Amazon, today was named again to the <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3421786-1&amp;h=3660885394&amp;u=https%3A%2F%2Fadage.com%2F2022-best-places-to-work&amp;a=Ad+Age+Best+Places+to+Work+list+for+2022\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Ad Age Best Places to Work list for 2022</a></u>. This is the firm's 4th consecutive year on the list with previous years including: 2019, 2020 and 2021. To earn this year's 14th spot, Tinuiti never lost focus of its people-first approach, mission of growing happiness, and commitment to improving diversity, equity and inclusion within the industry.</p>\n\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/1732515/Tinuiti_2022_Best_Places_to_Work.html\">\n                    <div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Tinuiti Named to Ad Age’s Best Places to Work for 4th Consecutive Year\" src=\"https://mma.prnewswire.com/media/1732515/Tinuiti_2022_Best_Places_to_Work.jpg\" title=\"Tinuiti Named to Ad Age’s Best Places to Work for 4th Consecutive Year\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMTczMjUxNS9UaW51aXRpXzIwMjJfQmVzdF9QbGFjZXNfdG9fV29yay5qcGc=&amp;key=80c99d948918b5f3877793aeef69f1e66b5f09978caf89af81fc1def61b3b3a5e3ea79011a3ee12b761e1bfa7f471a40baa5adbeb1608ca86e87e4aa4acbf587\"/></div></div>\n                        </a>\n                </p>\n\n    </div>\n<p>Ad Age's Best Places to Work 2022 honors 50 companies that did a standout job over the past year as the ad business rebounded, the talent pool tightened and the specter of COVID-19 remained omnipresent at work, at home—and at work at home. The winners reflect the highest overall numerical scores based on an analysis of questionnaires submitted by employers and survey responses from their employees.</p>\n<p>\"Ad Age's Best Places to Work is a highly-coveted award that reaffirms Tinuiti as a best in business and culture place to be and that's why we continue to attract, retain, and cultivate the very best talent in the industry. But we aren't done yet – in the year ahead we are building on an already strong foundation of our core values to ensure we evolve to meet the needs of today's talent and clients.\" - <b><span class=\"xn-person\">Jeff Batuhan</span>, chief people officer at Tinuiti.</b></p>\n<p>Tinuiti has experienced rapid expansion, growing seven times in size since 2017. Tinuiti welcomed nearly 700 new employees in the last 12 months, nearing 1,100 in headcount, a 59% year-over-year increase. The firm has consistently been on the forefront of emerging spaces years ahead of the competition—from the Amazon and Retail Media space, a respected industry thought leader on data privacy, to breaking out ahead on streaming advertising. The company is <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3421786-1&amp;h=3470265454&amp;u=https%3A%2F%2Ftinuiti.com%2Fcareers%2Fjob-openings%2F&amp;a=currently+hiring\" data-type=\"url\" class=\"tr-link\" translate=\"no\">currently hiring</a></u> for multiple roles across divisions to keep pace with growth.</p>\n<p><b>Talent Over Geography<br/></b>Unlike most other marketing agencies and tech companies, Tinuiti has been a \"talent over geography\" company since the beginning, allowing the top minds in the industry to work from wherever they'd like. Tinuiti made its first remote hire back in 2008 and a decade later, the majority of its employees work remotely. Tinuiti's core values and company culture allow the firm to continuously attract and retain the top minds in digital marketing wherever they live, embracing the agency's 'talent over geography' philosophy to build the best team of thought leaders in the industry.</p>\n<p><b>Growing Happiness is Fundamental<br/></b>Tinuiti has used its status as an independent agency to create a thriving work culture where people want to give their best every day and have fun while they're at it—while also being recognized for the work they do, receiving generous benefits and being seen and heard at their jobs. This culture of ownership fuels the company flywheel, which is aided by reinvesting into the business through technology, innovation and people.</p>\n<p>In 2021, Tinuiti debuted three innovative employee activations designed to grow employee happiness, unite Tinuitians in person for the first time, prioritize mental health over profits, and give back to local communities (a program that recently took home a Web Excellence Award for Corporate Communications). The activations—called Second Impressions, Recharge, and Thankful Giving—will continue to evolve in 2022 as Tinuiti cements its place as the industry leader in innovation when it comes to agency culture.</p>\n<p><b>A Proven Home For Diversity, Equity, and Inclusion <br/></b>Tinuiti is growing fast but has never been more devoted to building an inclusive workforce. The firm remains committed to improving diversity, equity and inclusion at the company and in the digital marketing industry at large through informative webinars, philanthropic initiatives and leading by example with new hires. Overall, of Tinuiti's entire employee base of 1000+ people, 68 percent identify as women and is proud of its 57% percent female representation in leadership. Tinuiti also strives for racial equality in the workplace with a public pledge to have over 35% of our employees from underrepresented minority groups (Black, Indigenous, People of Color) by 2023. The firm is strongly positioned to exceed that goal ahead of schedule.</p>\n<p><b>Winning Major Industry Culture Awards<br/></b>Tinuiti has received numerous awards for its culture including ranking #1 in <u style=\"font-size:10pt\"><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3421786-1&amp;h=2985192288&amp;u=https%3A%2F%2Ftinuiti.com%2Fnews%2Fpress-release%2Ftinuiti-ranked-number-1-best-place-to-work-by-ad-age-for-the-second-consecutive-year%2F&amp;a=Ad+Age%27s+2019+%26+2020+Best+Workplaces\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Ad Age's 2019 &amp; 2020 Best Workplaces</a></u>, receiving an <u style=\"font-size:10pt\"><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3421786-1&amp;h=3465720501&amp;u=https%3A%2F%2Fdigiday.com%2Fawards%2Fbloomberg-media-group-and-new-york-media-take-top-honors-in-the-digiday-worklife-awards%2F&amp;a=Employer+of+the+Year+and+Top+Boss+awards+from+Digiday\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Employer of the Year and Top Boss awards from Digiday</a></u>, and being named to <u style=\"font-size:10pt\"><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3421786-1&amp;h=223523440&amp;u=https%3A%2F%2Ftinuiti.com%2Fnews%2Fpress-release%2Fincbestplaces2021%2F&amp;a=Inc.%27s+Best+Places+to+Work\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Inc.'s Best Places to Work</a></u> list in 2020 and 2021. The firm pulls in Employee Net Promoter Scores unheard of in the industry with a consistent eNPS of over 50 and ranks much higher than the industry average for its employee retention rates.</p>\n<p>\"The advertising business saw a healthy comeback and ad tech firms and health care agencies thrived, making 2021 a decidedly strong year for the industry. The pandemic continued to impact—and permanently change—how we work, and this year's Ad Age Best Places to Work winners created the right culture and opportunities for their teams.\" - <span class=\"xn-person\">Dan Peres</span>, associate publisher and editor-in-chief, Ad Age</p>\n<p><b>About Tinuiti<br/></b>Tinuiti is the largest independent performance marketing firm across Streaming TV and the Triopoly of Google, Facebook, Amazon, with nearly <span class=\"xn-money\">$3 billion</span> in digital media under management and over 1000 employees. With industry-leading expertise in search, social, Amazon and marketplaces, addressable TV and mobile apps, CRM and email marketing and more, Tinuiti understands that success requires both strategy and channel expertise. Each solution is delivered through Tinuiti's performance planning framework, GAMMA, and is enabled by a proprietary suite of marketing intelligence and media activation technology – <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3421786-1&amp;h=1128310508&amp;u=https%3A%2F%2Ftinuiti.com%2Four-technology%2F&amp;a=Mobius\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Mobius</a></u>. For more information visit <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3421786-1&amp;h=1192362758&amp;u=http%3A%2F%2Fwww.tinuiti.com%2F&amp;a=http%3A%2F%2Fwww.tinuiti.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.tinuiti.com</a></u>.</p>\n<p><b>About Ad Age<br/></b>Created in 1930 to cover a burgeoning industry with objectivity, accuracy and fairness, Ad Age continues to be powered by award-winning journalism. Today, Ad Age is a global media brand focusing on curated creativity, data and analysis, people and culture, and innovation and forecasting. From vital print editions to must-attend events and innovative platform offerings, Ad Age's industry-leading content includes the coveted A-List &amp; Creativity Awards, the Ad Age Next conference series and proprietary data including the Leading National Advertisers Report from the Ad Age Datacenter.</p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n</div>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=LA39934&amp;sd=2022-01-24\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1MQTM5OTM0JnNkPTIwMjItMDEtMjQ=&amp;key=095693dd208c8540ccb106fb4651982a894f670f8f8b8a0a920d07eeea62f89350ce1bfa806d6d4a2ff03ba6290abff1d39c8397c9841fb0de1518ebbfd044b5\"/></div></div> View original content to download multimedia:<a href=\"https://www.prnewswire.com/news-releases/tinuiti-named-to-ad-ages-best-places-to-work-for-4th-consecutive-year-301466954.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/tinuiti-named-to-ad-ages-best-places-to-work-for-4th-consecutive-year-301466954.html</a><p></p>\n<p>SOURCE  Tinuiti</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NY-TINUITI-award</p></div>"}