{"date": "2022-02-15 17:45:58.289000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_2vt25sl3&amp;referenceId=1_2vt25sl3&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_2vt25sl3&amp;referenceId=1_2vt25sl3&amp;pageId=RefinitivNewscasts</a></pre>Source: Stocktube<br/><br/>Description: Boosh Plant-Based Brands CEO Jim Pakulis joined Steve Darling from Proactive to share news the company has made significant acquisition acquiring Beanfields Inc. That company features sustainable chips made from beans.&amp;#xD;Pakulis telling Proactive this deal will see Boosh's revenues increase to an estimated $14,500,000. Pakulis also said stores carrying either Beanfields or Boosh increases from 600 to 7,000 with the potential of 7,000 more stores. This deal will also provide immediate substantial cost savings as well.<br/>Short Link: <a href=\"https://refini.tv/3Bik488\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3Bik488</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; All right, welcome back inside our proactive newsroom and joining us now is Jim Pakulis. He is the CEO of Boosh Food. And Jim, It's good to have you back again. How are you? &gt;&gt; Good. Great. Thank you, Steve. Thanks for having me. &gt;&gt; So a huge announcement from the company talking about an acquisition of a company called Beanfields. And I'll get you to talk about this. We should mention that it doesn't close official until Wednesday, but I have to tell you, I reading the news release, and one thing that caught my eye the most was the fact that you in there say this is the most significant acquisition of your career, which is quite a statement from the CEO of a company. So tell me a little about Beanfields and why you love this one so much. &gt;&gt; Absolutely, plant based, obviously, which is fantastic. They did a wonderful job over the last 11 years, getting into over 70,000 grocery stores. On top of that, they taste fantastic. I'm a huge fan of their onion rings. They have a whole slew of the chips which are comparable to Doritos, except healthy. And then they also have the onion rings, which are just phenomenal. I don't have a Whole Foods near me, I have a Harmons, which is a comparable to a Whole Foods. And I went in there about a month ago when we were just beginning our dialogue. And they had probably 10 by 15 section in the salty snack food. And that's the reference that this sector of the industry is called salty snack food. And it was fantastic to see this huge display. And next to it was FritoLay, and next to it was Doritos. So I just thought, wow, what a wonderful job that they have done to create a foot print in the plant based sector that has caught the attention of the consumers. So just love it. &gt;&gt; Tell me a little bit about what is this adds to the company right off the bat as far as revenue was concerned? &gt;&gt; Well, conditional and closing Friday. And of course, as we know it, the audit too, if there's a variance of over 20% when the audit is complete, we have the ability to go ahead and marshall back the assets or keep the assets. But let's assume fast forward, we close the audits, complete Canadian above $14.5 million. Comparing that to boost switch, even though Boucher is doing well as far as increasing revenues on a matter of month basis. Obviously, it's significantly smaller than the 14.5 million. So that's going to put us in a completely different category. If you look at the emerging plant-based sector that we are in, and let's say we have 20-30 peers, we're going to be, I believe, in the top two or three of that category. That's how big this transaction is. And with that said, I'm always looking for more transactions as well. So I don't want this to be one and done. We did three nice boutique transactions last year. This is huge, obviously, and puts us in a whole different category. We'll have analyst, I believe. We'll have analysts start to cover us. It opens the door for a lot more arrows for us to have in our quiver, because of the size of the transaction, and because of the revenue flow. &gt;&gt; Now you mentioned obviously the barrier in about seven thousand stores. So does that give you potential to add Boosh, what your current offering is now, into potentially those stores as well? Is that's something that is a part of this deal also to help along? &gt;&gt; Absolutely. A key element is for us to be able to coat tail into those grocery stores with the Boosh products and at least have a dialogue with the various purchasers in each of the different categories, whether it's frozen, refrigerated or shelf-stable. So yeah, absolutely. So it really is a win across the board. And then, of course, how we are paying for the transaction is fantastic for us as shareholders and investors in Boosh, in which we've provided the sellers eight million shares, six months restriction, 4% bleed out, so no one gets hurt. And also the fact that we still have a very conservative cap table. So on the assumption all of this gets completed, we'll have 27 million shares outstanding doing roughly just shy of 15 million Canadian annually and growing. And I couldn't see a better scenario for us. And also note we're assuming $400,000 worth of debt, which will be about two grand a month. And payments within 18 month balloon. Relatively small. But overall, this is one of the best transactions I have been fortunate to be involved in. &gt;&gt; And last one, I wanted to address it as you mentioned also in the news release, about cost-savings as well. Can you take us through that as well, because that's always a positive? &gt;&gt; Yeah, sure. The philosophy prior to COVID with the previous management was different than the philosophy others may have taken. Who knew how long COVID was going to ask? So there were some transactions that were done such as the food service industry that because of COVID, cause some challenges. There's management. As you know, we run a very frugal, very lean and mean organization and so we will be able to go ahead and decrease that. There was previously a fairly large body of debt service that we're not assuming. There's one more element in that. From our understanding, if we talk, if we go ahead and secure another co packer, there's going to be significant savings, I don't want to go ahead and say it right now until I know for sure. But when you combine those three or four elements, then that equals a fairly decent cost savings as we continue and grow the company. &gt;&gt; Absolutely. Well, it's really interesting and obviously it seems like a really smart acquisition that you've made here, Jim, and I look forward to hearing more about it as the week rolls on and then months after that as well. So great to see you again. Congratulations. &gt;&gt; Thank you, Steve. I appreciate it. Thanks man. &gt;&gt; There's Jim Pakulis, he is the CEO of Boosh Food.<br/></span></div></div></div></div>"}