{"date": "2022-01-13 17:42:38.632000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3304.14, "close": 3242.76}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Every day, we scour Amazon to find the best deals available. Whether it's something for your kitchen or top-rated tech to give your smart home an upgrade, the online shopping giant offers some of the best prices on a  <span>very</span> wide range of items. Whatever you need, Amazon has you covered.</p></div><div class=\"tr-npp-body\"><p><span><span>Make 2022 the year of good decisions.</span> Start by signing up for our newsletter for twice-weekly tips, reviews and more from our experts.</span> </p><p>Below, you'll find our top Amazon deals right now, including one of our favorite laptops, some high-quality dumbbells and a portable electric shaver, all of which have been vetted by our team of deals experts to make sure they're \"best of web\" prices. </p><p>► <span>Cloth masks are no longer recommended to protect against the omicron variant: </span> Here's how to find the best KN95 masks for kids and N95 masks are your best mask option—here's where to buy them online.</p><p>► <span>Accessibility</span><span>:</span>  Reviewed launches new vertical dedicated to accessibility.</p><p>If you're not already an Amazon Prime subscriber, you can sign up for a 30-day membership for free. An Amazon Prime subscription gets you free two-day shipping and tons of other benefits for $12.99 a month ($6.49 for students and $5.99 for those receiving qualifying government assistance).</p><p class=\"tr-npp-section-title\">The best Amazon deals of the day</p><p><big>1. 11% off: One of our favorite laptops</big> </p><p>If you need a computer that's powerful, compact and can do it all, the 2020 Apple MacBook Pro is loaded up with features and functionality. Typically listed from $1,299, you can get the 13-inch device starting as low as $1,149.99 in the 256-gigabyte model. We picked the 2020 Pro as the best upgrade option for laptops for its best-in-class Apple M1 processing chip that makes for faster app responses and work rates. It also has an impressive 14-hour battery life, a Touch Bar with shortcuts to the apps you're using and a fan to keep the laptop from overheating no matter how much work it's doing.</p><p><span>Get the 2020 Apple 13-inch MacBook Pro from $1,149.99 (Save $149.01 to $200)</span> </p><p><big>2. Less than $10: This durable basting brush</big> </p><p>Get just the right coating of sauce or gravy on your next feast with this Zyliss basting brush, on sale now for just $7.93, or 39% off the $12.99 list price. Zyliss says its silicone brush features an angled handle so users can keep their hands away from heat while basting, marinating or BBQing. The developer added the brush is heat resistant up to 600 degrees and has bristles that won't shed or change shape over time.</p><p><span>Get the Zyliss Silicone Basting Brush for $7.93 (Save $5.06)</span> </p><p><big>3. 16% off: This portable water flosser</big> </p><p>If you want to keep your teeth clean no matter where you are, the Waterpik ION water flosser makes thorough dental hygiene more portable than ever. You can get this compact dental essential for 16% off its list price of $99.99, or $84.37. Waterpik boasts the ION's cordless design and an advanced rechargeable battery that provides up to four weeks of use per charge. The ION is said to be 30% smaller than other water flosser models, but still boasts 10 water pressure settings and a one-minute timer to help remove up to 99.9% of plaque from treated areas.</p><p><span>Get the Waterpik ION water flosser for $84.37 (Save $15.62)</span> </p><p><big>4. Save $10: This easy-to-use electric trimmer</big> </p><p>Score the Philips Norelco 2300 electric shaver on sale at Amazon today. Typically listed for $39.95, this compact hair trimmer can be yours at 25% off, or $29.95. Philips says this Norelco model features 27 stainless steel ComfortCut blades on a head that flexes and floats in four directions to ensure smooth contact with the face. There's also a pop-up trimmer on the back of the shaver for sideburns and mustaches. You'll get 40 minutes of cordless power with each charge of the shaver's battery.</p><p><span>Get the Philips Norelco 2300 Electric Shaver for $29.95 (Save $10)</span> </p><p><big>5. 29% off: These durable dumbbells</big> </p><p>Get your reps in at home with these Sporzon! Hex dumbbells, on sale in multiple weights right now. You can get a pair of these workout essentials from 15-pound weight for $34.99 (29% off) up to the 45-pounds weights for $45.76 (14% off). Sporzon! says its dumbbells are made from a high-quality cast encased in rubber to make them long lasting and able to be left on home floors over time without denting or leaving marks. They also feature contoured, textured handles for a comfortable grip</p><p><span>Get the Sporzon! Rubber Encased Hex Dumbbells from $34.99 (Save $7.61 to $66.59)</span> </p><p class=\"tr-npp-section-title\">The best Amazon deals from this week</p><p><big>1. SupplyAid KN95 Face Masks</big> </p><p>Stay protected this winter with these SupplyAid KN95 face masks on sale at Amazon today. Typically listed for $15.99, you can get a five-pack of the masks for 14% off, or $13.71. SupplyAid says the masks come with an exhalation valve to offer better airflow and prevent humidity inside the mask. The developer recommends users store the masks in a dry and ventilated location.</p><p><span>Get the SupplyAid KN95 Face Mask 5-Pack for $13.71 (Save $2.28)</span> </p><p><big>2. Hisense Class H9 Quantum Series Android 4K Smart TV</big> </p><p>Make your favorite shows and movies truly pop with the Hisense Class H9 Quantum Series 4K ULED Smart TV. Normally priced from $649.99, this Android TV can be yours for as low as $499.99 in its 55-inch size. Hisense says its big screen features Dolby vision HDR picture and Dolby Atoms sound technologies for an enhanced viewing experience. It also features Google Assistant built in so you can use the voice-enabled remote to search for downloadable apps or new programs to watch. </p><p><span>Get the Hisense Class H9 Quantum Series Android 4K ULED Smart TV from $499.99 (Save $78.85 to $150)</span> </p><p><big>3. Tribit XSound Go</big> </p><p>Turn any occasion into a party with your favorite tunes on the Tribit XSound Go portable speaker. Typically listed for $45.99, this Bluetooth device can be yours for just $23.58 thanks to the already-active $14.55 price cut and the additional 25% coupon on the product page. The pill-shaped Tribit XSound Go is one of our favorite portable Bluetooth speakers under $50 thanks to a metal chassis that made it feel sturdy and its user-friendly labeled buttons. You'll have to blast the volume to truly feel the sound, but the speaker won't vibrate or distort easily. </p><p><span>Get the Tribit XSound Go Portable Bluetooth Speaker from $23.58 with coupon (Save $6 to $22.41)</span> </p><p><big>4. Wvze Cam v3 Spotlight</big> </p><p>Keep a close eye on what's going on around your house—even at night!—with the Wyze Cam v3 Spotlight security camera. Normally priced at $52.96, it's on sale for 31% off at $36.29 right now. Wyze says its camera turns on automatically when it detects motion and records video clips of its focused location in 1080p meant to go directly to your phone. Its spotlight add-on is as weather-resistant (as the camera itself) and helps the camera capture imagery in environments up to 25 times darker than traditional cameras.</p><p><span>Get the Wyze Cam v3 Spotlight Security Camera for $36.29 (Save $16.67)</span> </p><p><big>5. Amazon Echo Show 5 (Second Generation)</big> </p><p>Bring your media streaming, video calls and music outlet together in one compact package with Amazon's second-generation Echo Show 5. Normally priced at $84.99, this smart home display can be yours for nearly half off at $44.99. When we tested the latest Echo Show 5, we were impressed with the improved camera that provided clear video calls and even offered home security video feeds. Not only is its design compact for any kitchen counter or desk, but it's also made from post-consumer recycled plastics and fabrics. </p><p><span>Get the Amazon Echo Show 5 (2nd Generation) for $44.99 (Save $40)</span> </p><p class=\"tr-npp-section-title\">Other noteworthy Amazon deals we found </p><ul class=\"bulleted-list arrowlist\"><li>Save 15% on Tuft &amp; Needle sleep essentials</li><li>Save up to 46% on Brita water products</li><li>Save up to 50% on select Nintendo Switch games</li><li>Mallory 26-Inch 532 Cool-Force Snowbrush with Ice Scraper for $7.98 (Save $4.47)</li><li>iHealth 2020 No Touch Forehead Thermometer for $14.56 (Save $3.90)</li><li>Gaiam 5mm Premium Yoga Mat from $15.10 (Save $3.75 to $9.88)</li><li>Tessan Power Strip for $16.14 with coupon (Save $3.85)</li><li>ThisWorx Car Vacuum Cleaner for $22.79 with coupon (Save $22.18)</li><li>On/Go at-Home COVID-19 Rapid Antigen Self-Test 2-Pack for $24.88 (Save $15.11)</li><li>JavaPresse Manual Coffee Grinder for $33.99 (Save $12)</li><li>Renpho Eye Massager for $62.99 with coupon (Save $17)</li><li>Dreo 4-Quart Air Fryer for $68.95 (Save $21.04)</li><li>Eufy Boost IQ RoboVac 11S for $159.99 (Save $70)</li><li>Apple AirPods Pro for $189.99 (Save $59.01)</li><li>Bose Sleepbuds II for $199 (Save $50)</li><li>Fitbit Sense Advanced Smartwatch for $199.95 (Save $100)</li><li>Bissell ProHeat 2X Revolution Max Clean Pet Pro Carpet Cleaner for $278.99 (Save $30)</li><li>KitchenAid Artisan Series 5-Quart Stand Mixer from $429 (Save $30.04 to $30.99)</li><li>NordicTrack T 6.5 S Treadmill with 30-Day iFIT Membership for $549 (Save $100)</li><li>Samsung HW-Q900A 7.1.2ch Soundbar for $1,147.99 (Save $152)</li> </ul><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Updated daily: Here are the 10 best Amazon deals today in January 2022</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}