{"date": "2022-01-13 14:19:11.058000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3307.24, "close": 3224.28}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>BLENDER BITES LTD (\"BITE-Z\")\n- Smoothie Innovation Nominated for 2022 Best New Product Award\n\n     Blender Bites Ltd. (the \"Company\", \"Blender Bites\" or \"Blender\"), a\nCanadian company that develops and markets a line of premium, organic and\nplant-based pre-portioned frozen functional foods, is proud to announce\nthat has been nominated for Best New Product Award (\"BNPA\") in Canada under\nthe Frozen Food /Healthy Beverages category (the \"Award\").\n\n     BNPA is North America's most credible and influential consumer product\ninnovation award programs; a consumer award program conducted by BrandSpark\nInternational, an independent market research firm working alongside\nthousands of consumer goods brands worldwide. For over 17 years, BNPA's\nhave recognized thousands of new and innovative products in a variety of\ncategories such as new beauty, food &amp; beverage, health, household,\nchildren, pet and tech products.\n\n     Blender Bites' one step smoothie puck product line has been nominated\nfor the 2022 Best New Product Award in Canada, under the Frozen Food\n/Healthy Beverages category. The winner in each BNPA category will be\ndetermined through a unique consumer-voting process whereby nominees will\nbe evaluated by a national sample of tens of thousands of consumers who\nhave voted for their favorite products.\n\n     Included along with the nomination, Blender Bites had the opportunity\nto participate in a sample program, allowing consumers to test and provide\nhonest feedback on the innovation. Blender Bites was highly received as 91%\nof respondents gave 5 or 4 stars with a 96% recommendation rate. Winners in\neach category of BNPA are expected to be announced in the coming weeks.\n\n     Blender's one step smoothie pucks are made with a variety of delicious\norganic fruits, greens and functional ingredients such as immune supporting\nplant-based vitamins and minerals to provide consumers with a convenient\nsolution for their daily smoothie routine. They come in three flavours:\nGreen Dtox, Power Berry and Vita Smoothie, and are also perfect for bowls,\nice creams and popsicles, desserts, and sweet treats.\n\n     \"Blender Bites is extremely proud to have been nominated for this\nprestigious Canadian award. Our smoothie innovation has simplified the\nlives of thousands of Canadians during this extremely trying pandemic and\nwe are honored to be recognized as a nominee for the healthy food/frozen\nbeverage category. The exposure that this type of award could provide the\ncompany would be extremely beneficial to the brand as we pioneer into the\nUS market.\" commented Chelsie Hodge, Blender Bites CEO.\n\n     About Blender Bites\n\n     Blender Bites is a Canadian company involved in the development and\nmarketing of a line of premium frozen food products with a focus on\nfunctionality. Blender Bites was founded in 2016 and was first to market in\nWestern Canada with a pre-portioned \"easy smoothie\" product that is free of\nany unnecessary inner plastic packaging. Blender Bites products are\ncertified organic, vegan, non-GMO, gluten free, dairy free and soy free.\nThey contain no added sugars and are made in Canada. Blender Bites products\nare distributed internationally across Canada and the US, and are currently\nsold in over 850 stores, including Sobeys, Safeway, Save on Foods, Whole\nFoods Market, Buy-Low/Nesters, IGA and Fresh Street.\n\n     On behalf of the Board of Directors,\n     Blender Bites Limited\n     Chelsie Hodge, Chief Executive Officer\n\n     For further information, contact Blender IR Team at:\n     Email - investors@blenderbites.com\n     Telephone - 1-888-997-2055\n\n     CAUTIONARY DISCLAIMER STATEMENT\n\n     This news release includes certain \"forward-looking statements\" under\napplicable Canadian securities legislation. Forward-looking statements are\nnecessarily based upon several estimates and assumptions that, while\nconsidered reasonable, are subject to known and unknown risks,\nuncertainties, and other factors which may cause the actual results and\nfuture events to differ materially from those expressed or implied by such\nforward looking statements. Such factors include, but are not limited to\ngeneral business, economic, competitive, political, and social\nuncertainties, and uncertain capital markets. Readers are cautioned that\nactual results and future events could differ materially from those\nanticipated in such statements. Accordingly, readers should not place undue\nreliance on forward-looking statements. The Company disclaims any intention\nor obligation to update or revise any forward-looking statements, whether\nas a result of new information, future events or otherwise, except as\nrequired by law.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201200572.MNPRE2201201658-06175520220113</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}