{"date": "2021-08-12 03:46:38.975000+00:00", "ticker": "III", "mrkt_info": {"open": 1322.0, "close": 1330.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>BAYLIN TECHNOLOGIES INC (\"BYL-T\")\n- Financial Results for the Second Quarter of 2021\n- and $10 Million Private Placement\n\n     Baylin Technologies Inc. (the \"Company\" or \"Baylin\"), a leading\ndiversified global wireless technology company focused on research, design,\ndevelopment, manufacturing and sales of passive and active radio frequency\nproducts, terrestrial microwave products, and services, today announced its\nfinancial results for the three and six months ended June 30, 2021. All\namounts are stated in Canadian dollars unless otherwise indicated.\n\n     SECOND QUARTER SUMMARY\n\n//st\n\n  * Announced industry veteran Leighton Carroll as the new Chief Executive\n    Officer.\n  * Launched the Summit II advanced solid state power amplifier product\nline\n    for high power applications for the satellite industry.\n  * Received technical approval for two macro tower antennas for use by a\n    major US wireless carrier - a first for the Company.\n  * Revenue was $21.6 million in the second quarter of 2021, a decrease of\n    $9.0 million or 29.4% compared to the second quarter of 2020.\n  * Wrote down to zero the remaining goodwill of $15.9 million related to\nthe\n    Company's 2018 acquisitions.\n  * Wrote off $5.5 million in unusable inventory related to the Company's\n    2018 acquisitions.\n  * Net cash as at June 30, 2021 decreased by $3.0 million from December\n31,\n    2020 mainly due to operating losses and principal and interest\npayments,\n    offset by proceeds from the exercise of common share purchase warrants\n    issued in December 2020, drawdown of the loan from the Company's credit\n    facility in Vietnam and a decrease in non-cash working capital.\n  * Conversion of 70% of the Company's outstanding convertible debentures\n    reduced debt by $12.1 million and annual interest burden by $0.8\nmillion.\n\n//et\n\n     RECENT DEVELOPMENTS\n\n     New Chief Executive Officer\n\n     On June 7, 2021, the Company announced the appointment of Leighton\nCarroll as the new Chief Executive Officer. Mr. Carroll brings over 25\nyears of experience in telecommunications, holding progressively senior\npositions within AT&amp;T, including as leader of significant business units\nwhere he consistently beat performance targets for his businesses. Since\nleaving AT&amp;T he has worked in the telecommunications infrastructure sector,\nrunning two separate businesses. In each case he was able to grow those\ncompanies significantly through customer diversification, service growth,\nand through successful M&amp;A. Throughout his career, Mr. Carroll has\ndemonstrated strong corporate leadership and the ability to achieve\nsignificant revenue and customer growth, increasing value for stakeholders.\n\n     \"I am thrilled to join the team at Baylin. While the company has been\nthrough a challenging period and has certainly been impacted by the\nCOVID-19 pandemic, a few things are very clear to me. Baylin and its\noperating companies have solid products customers need, terrific\nengineering and manufacturing capabilities, and great people. With the\nsupport of the board and our investors I am confident that our best days\nlay in front of us,\" said Mr. Carroll.\n\n     \"Leighton is a terrific choice as CEO for Baylin,\" said Mr. Jeffrey\nRoyer, Chairman. \"Leighton's track record of building and growing\nbusinesses in telecommunications is strong, including extensive North\nAmerican and international experience. He also successfully grew two\nbusinesses built on satellite technology. I am excited to see what the team\ncan accomplish under his leadership.\"\n\n     Private Placement\n\n     The Company has entered into an engagement letter dated August 11,\n2021 with Paradigm Capital Inc., as lead agent, on behalf of a syndicate of\nagents (collectively, the \"Agents\"), in connection with a proposed best\nefforts private placement financing (the \"Offering\") of 11,112,000 common\nshares of the Company (the \"Common Shares\") at a price of $0.90 per Common\nShare for total proceeds of approximately $10 million. The Company has\ngranted the Agents an option to sell up to an additional 15% of the number\nof Common Shares offered pursuant to the base Offering to cover\nover-allotments. As part of the Offering, the Company has entered into a\nseparate agreement with 2385796 Ontario Inc. (the \"Insider\"), the Company's\nlargest shareholder, under which the Insider has agreed to support the\nOffering by agreeing to purchase Common Shares with a purchase price equal\nto the lesser of: (i) $10 million (subject to increase by the amount (if\nany) of the over-allotment option); and, (ii) the difference between the\nfull amount of the Offering and the aggregate purchase price paid by all\nother investors (if any) in the Offering. Accordingly, the Company is\nassured of receiving at least $10 million in proceeds from the Offering,\nsubject to receipt of applicable regulatory approvals and satisfaction of\nother customary closing conditions, including listing of the Common Shares\non the Toronto Stock Exchange (the \"TSX\"). Jeffrey C. Royer, Chairman of\nthe Board of Directors of the Company, exercises control and direction over\ninvestment decisions of the Insider. The Company is relying on the\n\"financial hardship\" exemption available to it under the rules of the TSX\nto permit the Insider to purchase more than 10% of the 62,447,014 common\nshares of the Company currently outstanding without the Company having to\nobtain disinterested shareholder approval. The Offering is expected to\nclose on or about September 1, 2021.\n\n     Credit Agreement\n\n     The Company and its lenders (Royal Bank of Canada and HSBC Bank\nCanada) have agreed to further amendments to the Company's Credit Agreement\ndated March 29, 2019. These amendments include a waiver of compliance with\nthe Fixed Charge Coverage Ratio as at June 30, 2021, change to the manner\nin which the Fixed Charge Coverage Ratio is calculated for the quarters\nending September 30 and December 31, 2021, so that the twelve month\ncalculation period commences July 1, 2021 on a cumulative basis, removal of\nthe minimum EBITDA covenant and increase in the minimum Liquidity covenant\nfrom $7 million to $10 million. The Company's lenders have also agreed to\nwaive the obligation to apply the net proceeds from the Offering to repay\ndebt provided that the proceeds are deposited in an account with one of the\nlenders not later than September 1, 2021. A copy of the amendments will be\navailable under the Company's SEDAR profile on www.sedar.com.\n\n     Asia Pacific Group\n\n     In late 2020, the Asia Pacific business line was contracted by a major\ncustomer to produce an antenna and its housing for use in a consumer\nproduct. This represented an opportunity to diversify into a new product\ncategory. However, the product suffered from significant production quality\nissues, resulting in low yields and high customer returns, and we reported\na loss of $2.0 million in the first quarter of 2021. At that time, we\nannounced that we would cease further production and ship a small number of\nremaining antennas over the next few months. While there were declining\nproduction volumes in the second quarter of 2021, there was a further loss\nof $2.0 million, principally related to return shipments from the first\nquarter of 2021 and quality issues in inventory as at the end of the second\nquarter. Since our earlier announcement, our customer has asked us to\ncontinue production until the program ends later in 2021, albeit at lower\nvolumes than in the first quarter. We are continuing discussions with our\ncustomer to minimize the impact while securing other profitable businesses\nin 2021, and importantly in 2022. The Asia Pacific business line was also\naffected during the second quarter of 2021 by lower gross margins(3), which\nwas mainly due to lower production of higher-margin LDS (laser direct\nstructuring) and higher production of lower-margin MFA (multi-functional)\nantennas.\n\n     SELECTED FINANCIAL INFORMATION\n\n     The table below discloses selected financial information for the\nperiods indicated.\n\n//st\n\n  (in $000's except per share amounts)\n\n                       Three Months Ended June     Six Months Ended June\n30,\n                       30,\n\n                       2021              2020      2021              2020\n\n                       $                 $         $                 $\n\n  Revenue              21,622            30,629    45,082            57,571\n\n  Gross profit         (3,549)           9,678     48                18,277\n  (loss)\n\n  Loss before          (33,981)          (4,090)   (42,425)\n(7,360)\n  income taxes\n\n  Income tax           (46)              617       (28)              (192)\n  expense (recovery)\n\n  Net loss             (33,935)          (4,707)   (42,397)\n(7,168)\n\n  Basic and diluted    ($0.64)           ($0.12)   ($0.83)\n($0.18)\n  net loss per share\n\n  EBITDA(1)            (29,887)          1,905     (32,603)          1,710\n\n  Adjusted EBITDA(2)   (12,721)          2,658     (14,978)          3,213\n\n  Current assets       48,087            68,535    48,087            68,535\n\n  Total assets         102,127           152,011   102,127\n152,011\n\n  Current              57,794            45,307    57,794            45,307\n  liabilities\n\n  Non-current          22,544            52,189    22,544            52,189\n  liabilities\n\n  Total liabilities    80,338            97,496    80,338            97,496\n\n//et\n\n//st\n\n  (1) See \"Non-GAAP Measures\". EBITDA refers to operating income (loss)\n  plus depreciation and amortization.\n\n  (2) See \"Non-GAAP Measures\". Adjusted EBITDA refers to EBITDA plus the\n  sum of: a) acquisition expenses, fair value step up of inventory acquired\n  as part of an acquisition, expenses for litigation relating to\n  acquisition agreements, expenses relating to planned restructuring post\n  an acquisition, impairment on fixed and intangible assets (including\n  goodwill) post an acquisition; b) expenses to permanently close/relocate\n  a facility, shut down a line of business, eliminate positions; c)\n  corporate re-organization expenses; and, d) non-cash compensation.\n\n  (3) See \"Non-GAAP Measures\". Gross margin refers to gross profit divided\n  by revenue.\n\n//et\n\n     A copy of the Company's unaudited interim condensed consolidated\nfinancial statements for the three and six months ended June 30, 2021 and\ncorresponding management's discussion and analysis (the \"MD&amp;A\") are\navailable under the Company's SEDAR profile on www.sedar.com.\n     OUTLOOK\n\n     The Company's business continues to face challenges brought about by\nthe COVID-19 pandemic and expects that these will continue for the balance\nof 2021. However, we expect second-half revenue and Adjusted EBITDA to show\nan improvement over the first half. Travel restrictions are continuing to\nhamper some business development activities.\n\n     MMU Facility\n\n     Our MMU facility in Vietnam continues to experience delays in the\nfinal commissioning and approval of the facility, in part due to the effect\nof COVID-19 related travel restrictions, which has prevented engineers from\noutside Vietnam travelling to Vietnam to complete the installation and\ninspection of testing equipment. Over the course of the 18-month plus\ndelay, our customer's sales of their MMU product have softened\nsignificantly. This has led to lower forecasts through mid-year 2022 as\nwell as a redesign of the product by our customer to reduce complexity and\ntheir cost structure. We now do not expect the facility to be\nproduction-ready until some time in 2022, and in light of market conditions\nand changes to the product design, we will be assessing the long-term\nstrategic options for this facility over the next two quarters.\n\n     Satcom Group\n\n     The commercial side of the Satcom business line, which represents a\nmajority of its business, continues to feel the effects of the downturn due\nto the impact of COVID-19. Although there are clear signs of recovery, we\nexpect capital spending by our commercial customers will remain constrained\nfor the remainder of 2021 until a more sustained recovery becomes evident.\nSimilarly, the recently completed C-band spectrum auction in the United\nStates will eventually open up opportunities with the satellite operators\nonce they receive incentive payments and once their C-band spectrum has\nbeen cleared. However, those payments will not be made until the blocks of\nspectrum are allocated to the successful bidders in the auction. For that\nreason, any benefit to the Satcom business line from the build-out of the\nrelated infrastructure is not expected to begin to be realized at the\nearliest until the beginning of 2022.\n\n     We expect sales for military and other government-related uses, which\nrepresents the balance of Satcom's business, will remain firm during the\nthird quarter and to the end of 2021. Although we experienced a delay in\nthe launch of our new Ultra High-Power Summit II solid state power\namplifiers, with the first deliveries in June 2021, the launch of the\nSummit II has demonstrated this product's unique competitive\ndifferentiation. We believe there is no other platform in the market that\ncan deliver the capabilities of our Summit II and that over time it will\nopen up significant opportunities. Overall, we expect revenue of the Satcom\nbusiness line to be stronger in the second half of 2021 as certain\nindustries start to invest as the world comes out of the COVID-19 pandemic.\n\n     Wireless Infrastructure Group\n\n     The Wireless Infrastructure business line has been adversely affected\nby the delayed timing of in-building and small cell deployments due to the\nCOVID-19 impact and increases in freight costs due to supply chain\nconstraints. We expect these constraints will lessen over the second half\nof 2021 as economies, particularly in the United States, continue to open\nup, and be reflected in higher revenue.\n\n     Embedded Antenna Group\n\n     The Embedded Antenna business line was a stable performer in the first\nhalf of 2021. Despite a significant chipset shortage, which impacted its\ncustomers' build schedules and forecasts, resulting in lower volumes and\nrevenue, this business line is expected to improve in the second half of\n2021 based on increased availability of global chipsets.\n\n     INVESTOR CONFERENCE CALL\n\n     Baylin will hold a conference call on August 12, 2021 at 8:00 a.m.\n(ET) to discuss its financial results for the three and six months ended\nJune 30, 2021. The call will be hosted by Leighton Carroll, President and\nChief Executive Officer, Cliff Gary, Vice President Finance and Daniel Kim,\nExecutive Vice President of Corporate Development. All interested parties\nare invited to participate using the dial-in details provided below.\n\n//st\n\n  Date:        August 12, 2021\n\n  Time:        8:00 a.m. (ET)\n\n  Dial-in      888-664-6392 or 416-764-8659\n  Number:\n\n  Conference   28959644\n  ID#:\n\n  Webcast:\n<a href=\"https://produceredition.webcasts.com/starthere.jsp?ei=1427576&amp;&quot;\" class=\"tr-link\">https://produceredition.webcasts.com/starthere.jsp?ei=1427576&amp;</a>;tp_key=99cf27\nb2ad\n\n//et\n\n     FORWARD-LOOKING STATEMENTS\n\n     This press release includes forward-looking information and\nforward-looking statements (together, \"forward-looking statements\") within\nthe meaning of applicable securities laws. They are not statements of\nhistorical fact. Rather, forward-looking statements are disclosure\nregarding conditions, developments, events or financial performance that we\nexpect or anticipate may or will occur in the future including, among other\nthings, information or statements concerning our objectives and strategies\nto achieve those objectives, statements with respect to management's\nbeliefs, estimates, intentions and plans, and statements concerning\nanticipated future circumstances, events, expectations, operations,\nperformance or results. Forward-looking statements can be identified\ngenerally by the use of forward-looking terminology, such as \"anticipate\",\n\"believe\", \"could\", \"should\", \"would\", \"estimate\", \"expect\", \"forecast\",\n\"indicate\", \"intend\", \"likely\", \"may\", \"outlook\", \"plan\", \"potential\",\n\"project\", \"seek\", \"target\", \"trend\" or \"will\" or the negative or other\nvariations of these words or other comparable words or phrases and is\nintended to identify forward-looking statements, although not all\nforward-looking statements contain these words.\n\n     The forward-looking statements in this press release include\nstatements concerning the continuing effect of the COVID-19 pandemic on our\nbusiness, the outlook for our business lines otherwise, timing of new\nproducts and revenue, and timing of commencement of production from our new\nfactory in Vietnam. The completion and timing of the Offering is subject to\na number of conditions, including that all approvals for the Offering will\nbe received, that no material change in Baylin's operations or the markets\nfor its services prior to closing of the Offering and completion of\nsatisfactory due diligence. Forward-looking information and statements are\nbased on certain assumptions and estimates made by us in light of the\nexperience and perception of historical trends, current conditions,\nexpected future developments, including projected growth in sales of\npassive and active radio frequency and terrestrial microwave products and\nservices, and other factors we believe are appropriate and reasonable in\nthe circumstances, but there can be no assurance that such assumptions and\nestimates will prove to be correct.\n\n     Many factors could cause our actual results, level of activity,\nperformance or achievements or future events or developments to differ\nmaterially from those expressed or implied by the forward-looking\nstatements, including the risk factors discussed in the Company's most\nrecent Annual Information Form, which is available under the Company's\nprofile on SEDAR at www.sedar.com. All the forward-looking statements made\nin this press release are qualified by these cautionary statements and\nother cautionary statements or factors in this press release. There can be\nno assurance that the actual results or developments will be realized or,\neven if substantially realized, will have the expected consequences to, or\neffects on, the Company. Unless required by applicable securities law, the\nCompany does not intend and does not assume any obligation to update these\nforward-looking statements.\n\n     NON-GAAP MEASURES\n\n     This press release includes a number of measures that are not\nprescribed by Canadian generally accepted accounting principles (\"GAAP\")\nand as such may not be comparable to similar measures presented by other\ncompanies. We believe these measures are commonly employed to measure\nperformance in our industry and are used by analysts, investors, lenders\nand interested parties to evaluate financial performance and our ability to\nincur and service debt to support our business activities. While management\nof the Company believes that non-GAAP measures are helpful supplemental\ninformation, they should not be considered in isolation as an alternative\nto net income, cash flows generated by operating, investing or financing\nactivities, or other financial statement data presented in accordance with\nGAAP. See \"Non-GAAP Measures\" on page 2 of the MD&amp;A for further\ninformation.\n\n     ABOUT BAYLIN\n\n     Baylin Technologies Inc. is a leading diversified global wireless\ntechnology company. Baylin focuses on research, design, development,\nmanufacturing and sales of passive and active radio frequency products,\nterrestrial microwave products, and services. Baylin aspires to meet its\ncustomers' needs and anticipate the direction of the market. For further\ninformation, please visit www.baylintech.com.\n\n Contact Information:\n\nInvestor Relations: Kelly Myles, Marketing and Communications Director,\nBaylin Technologies Inc., kelly.myles@baylintech.com\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2122200511.MNPRE2122202574-13205920210811</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}