{"date": "2022-01-14 15:11:26.257000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3304.14, "close": 3242.76}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>IZEA WORLDWIDE INC (\"IZEA-Q\")\n- Research Discovers 56% of Social Media Influencers Currently\n- Participate in the Metaverse\n\n     IZEA Worldwide, Inc., the premier provider of influencer marketing\ntechnology, data, and services for the world's leading brands, released its\nlatest research initiative, \"Influencing the Metaverse,\" today. The U.S.\nconsumer study examines how social media influencers are leading the way\ninto virtual worlds.\n\n     The new report is available to download for free, here:\nizea.com/influencing-the-metaverse/\n\n     IZEA fielded the study Nov. 17-18, 2021. Results are based on the\nresponses from 1,034 U.S. internet users ages 18 to 60-plus. The report is\nthe first in a series of research studies focusing on influencers' key\nroles in adopting new trends, technologies, and platforms in and around the\nmetaverse.\n\n     Key Insights for Influencers and the Metaverse:\n\n     *  60% of social media influencers see themselves as creators in\nvirtual worlds.\n     *  72% say they are considering or are already making money in the\nmetaverse.\n     *  85% have played virtual world games like Minecraft and Fortnite.\n\n     Key Insights for Consumer Adoption of the Metaverse:\n\n     *  Top activities of those looking to participate in the metaverse\ninclude gaming (68%), exercising (53%), and watching media (48%).\n     *  When asked what is holding consumers back from joining the\nmetaverse, 20% said they are waiting for virtual reality (VR) technology to\nbecome more affordable and 12% are waiting for VR tech to improve.\n     *  66% of consumers looking to join the metaverse expect to purchase a\nVR device in the next three years.\n\n     Key Insights for Brand Sponsorships in the Metaverse:\n\n     *  90% of influencers and 72% of social media users support brand\nsponsorships in virtual world games.\n     *  73% of all respondents who have played virtual world games have\nseen sponsorships in those games, and 42.2% remember the brand names.\n     *  Respondents named Chipotle, Coca-Cola, Clorox, Google, Marvel,\nCartoon Network, Nike, Red Bull, Skillshare, and Skittles as brands they\nhave seen in the metaverse.\n\n     Key Insights for Brands that are Building the Metaverse:\n\n     *  15% of social media influencers and 6% of social media users\nsurveyed own VR devices.\n     *  Of the consumers surveyed who already own VR devices, 50% own a\nPlayStation VR, and 48% own an Oculus (Meta) Quest 2.\n     *  Consumers rank Apple and Amazon above Facebook, Microsoft, and Sony\nas the brands they believe will build the most compelling virtual reality\nexperiences of the future.\n\n     \"We believe the future of virtual worlds is as vast as the web itself\nand will fundamentally alter brand collaborations and how they are\nexecuted,\" said Ted Murphy, founder and CEO of IZEA. \"Our research shows\nthat influencers are early adopters of these new platforms and share our\nexcitement around the opportunities available in the rapidly developing\nmetaverse. IZEA has already been executing collabs in the metaverse with\ncustomers and expects this trend to accelerate as adoption spreads.\"\n\n     If you are interested in partnering with a brand or influencer, visit\nizea.com.\n\n     All product names, logos, and brands are the intellectual property of\ntheir respective owners. All company, product, and service names used in\nthis press release are for identification purposes only. Use of these\nnames, logos, and brands does not imply endorsement or partnership.\n\n     About IZEA\n\n     IZEA Worldwide, Inc. (\"IZEA\") is a marketing technology company\nproviding software and professional services that enable brands to\ncollaborate and transact with the full spectrum of today's top social\ninfluencers and content creators. The company serves as a champion for the\ngrowing Creator Economy, enabling individuals to monetize their content,\ncreativity, and influence. IZEA launched the industry's first-ever\ninfluencer marketing platform in 2006 and has since facilitated nearly 4\nmillion transactions between online buyers and sellers. Leading brands and\nagencies partner with IZEA to increase digital engagement, diversify brand\nvoice, scale content production, and drive measurable return on investment.\n\n     Safe Harbor Statement\n\n     All statements in this release that are not based on historical fact\nare \"forward-looking statements\" intended to qualify for the safe harbor\nfrom liability established by the Private Securities Litigation Reform Act\nof 1995. Forward-looking statements, which are based on certain assumptions\nand describe our future plans, strategies and expectations, can generally\nbe identified by the use of forward-looking terms such as \"may,\" \"will,\"\n\"would,\" \"could,\" \"should,\" \"expect,\" \"anticipate,\" \"hope,\" \"estimate,\"\n\"believe,\" \"intend,\" \"likely,\" \"projects,\" \"plans,\" \"pursue,\" \"strategy\" or\n\"future,\" or the negative of these words or other words or expressions of\nsimilar meaning.  Examples of forward-looking statements include, among\nothers, statements we make regarding expectations concerning IZEA's ability\nto increase revenue and bookings, growth or maintenance of customer\nrelationships, and expectations concerning IZEA's business strategy.\nForward-looking statements involve inherent risks and uncertainties which\ncould cause actual results to differ materially from those in the\nforward-looking statements, as a result of various factors including, among\nothers, the following: competitive conditions in the content and social\nsponsorship segment in which IZEA operates; failure to popularize one or\nmore of the marketplace platforms of IZEA; our ability to establish\neffective disclosure controls and procedures and internal control over\nfinancial reporting; our ability to satisfy the requirements for continued\nlisting of our common stock on the Nasdaq Capital Market; changing economic\nconditions that are less favorable than expected; and other risks and\nuncertainties described in IZEA's periodic reports filed with the\nSecurities and Exchange Commission. The forward-looking statements made in\nthis release speak only as of the date of this release, and IZEA assumes no\nobligation to update any such forward-looking statements to reflect actual\nresults or changes in expectations, except as otherwise required by law.\n\n    Attachments\n\n\n\n                 *\n        Influencing the Metaverse\n\n                 *\n        Influencers participate in the Metaverse\n\n                 *\n        Influencer understand the Metaverse\n\n                 *\n        Metaverse brand recall\n\nTel   : 1-407-674-6911    IZEA INC\nEmail : pr@izea.com\nWWW   : <a href=\"https://www.izea.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.izea.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201300241.MNPRE2201300779-07071620220114</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}