{"date": "2021-12-20 15:00:21.543000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>CINEDIGM CORP (\"CIDM-Q\")\n- Strikes Deal With Shout! Factory For Mutual Streaming Content-Deal\n\n     Cinedigm, the leading independent streaming company super-serving\nenthusiast fan bases, announced they have signed a rights-in and rights-out\nstreaming deal with Shout! Factory, a multi-platform media company. Through\nthis agreement, Cinedigm will provide Shout with over 40 films and TV\nseries for Shout! Factory TV, a digital entertainment streaming service\nthat brings timeless and contemporary cult favorites to pop culture fans.\nSuch hits include The English Teacher, 22 Bullets, and Wolfblood Season 1.\nIn addition, Cinedigm will receive over 120 Shout Factory film and TV\nseries to use across popular streaming channels such as Fandor, Screambox\nand Bloody Disgusting TV.\n\n(figure class=\"image image_resized\" style=\"width:501px;\")(/figure)\nFandor presents exceptional, hand-picked films to a community of film\nlovers and makers connected by meaningful and entertaining cinematic\nexperiences. Screambox, started by fans for fans, the streaming channel\ndelivers every type of terror imaginable -- Supernatural, Slashers,\nClassics, Zombies, Extreme, Psychological, Cult, Underground, Banned\nMovies, and more. Bloody Disgusting TV is a free streaming channel\ncontaining new originals, exclusive interviews with your favorite stars,\nvideo podcasts &amp; 'Bloody Bites' shorts.\n\n     Cinedigm plans to launch the following films on the Company's\nstreaming channels:\n\n*  The Plague Dogs: A stunning animated adaptation of Richard Adams' novel,\nThe Plague Dogs follows a pair of dogs who escape from a research\nlaboratory and try to survive in the wild with the help of a cunning fox.\nLaunching on Fandor.\n*  The Slumber Party Massacre: A horror cult classic about a group of\nfemale high school students whose slumber party is stalked by a serial\nkiller. Launching on Screambox and Bloody Disgusting TV.\n*  On Golden Pond: The Academy Award(R)-winning film featuring Henry Fonda,\nKatharine Hepburn and Jane Fonda. Launching on Fandor.\n*  The Count of Monte Cristo: A young man, falsely imprisoned by his\njealous \"friend\", escapes and uses a hidden treasure to exact his revenge.\nLaunching on Fandor.\n*  Camp Cold Brook: A paranormal team sets to check out an abandoned summer\ncamp where a mass murder occurred decades ago. Launching on Screambox and\nBloody Disgusting TV.\n*  Raining Stones: The Cannes Film Festival Jury Prize-winning film by\ncelebrated British auteur Ken Loach, about a man devoted to his family and\nhis religion, who is determined to make sure his little girl to have a\nbeautiful (and costly) new dress for her First Communion. Launching on\nFandor.\n*  The House That Dripped Blood: Four tales of terror regarding the events\nat a creepy old mansion that features Horror icons Peter Cushing and\nChristopher Lee. Launching on Screambox and Bloody Disgusting TV.\n*  The Neon Bible: British auteur Terence Davies' Palme d'Or Nominee\nfeaturing Gena Rowlands in this heartfelt portrait of a boy's life in rural\n1940s Southern Town. Launching on Fandor.\n\n     Shout! Factory TV, which debuted in early 2015, is a digital streaming\nservice bringing cult and classic films, TV, original programs,\nlive-streaming events, and original content to a wide audience.\n\n     Some of Cinedigm's top-performing titles will launch on Shout! Factory\nTV, including:\n\n*  The English Teacher: An English teacher's life is disrupted when a\nformer student returns to her small town after failing as a playwright in\nNew York.\n*  22 Bullets: A retired mobster goes on a revenge spree after being left\nfor dead with 22 bullets in his body by his former childhood friend.\n*  Wolfblood Season 1:Maddy Smith and her family are the only wolfbloods in\nStoneybridge, which is a well-kept secret. They lead a peaceful life until\nRhydian, a wolfblood, arrives and triggers chaos.\n*  Short Term 12: A staff member at a foster care facility works to balance\ncaring for the teens and the struggles of her own childhood. Starring Brie\nLarson, Rami Malek, Stephanie Beatriz and LaKeith Stanfield.\n*  Highlander Season 1: the cult series from the 90s about the 400-year-old\nScotsman Duncan MacLeod, who's one of the immortals -- a group of entities\nwho for centuries have waged a war between good and evil that's destined to\nculminate in the Gathering ... where only one force can triumph.\n\n     \"Given our long-standing relationship with Shout! Factory, we are\nfurthering our company's objectives to offer our catalog to targeted\naudiences,\" said Yolanda Macias, Chief Content Officer at Cinedigm. \"The\npartnership also provides Cinedigm an abundance of fresh content to refresh\nour streaming channels and excite our viewers. We know that genre fans are\nincredibly passionate about what they're consuming, so we take great care\nin sourcing meaningful titles to enhance their programming experience.\"\n\n     \"In the burgeoning world of AVOD, SVOD, and FAST channels, having the\nright content mix is critical to building a successful digital streaming\nbusiness,\" said Gene Pao, EVP of Strategy and Digital at Shout! Factory.\n\"Our collaborative relationship with Cinedigm allows us to offer the best\npossible programming to our respective audiences. This unique partnership\nallows both Shout! Factory and Cinedigm maintain its leadership position in\nthe industry.\"\n\n     An innovator in the digital transformation of the entertainment\nindustry for more than two decades, Cinedigm's core mission is to entertain\nthe world by building the world's best portfolio of enthusiast channels and\nservices for the streaming generation. Through a diverse mix of premium\nSVOD services and dedicated AVOD and FAST channels, Cinedigm's streaming\nportfolio reaches indie film (Fandor), horror (Screambox &amp; Bloody\nDisgusting) and family entertainment (Dove Channel), as well as dedicated\nchannels for iconic entertainers, led by Bob Ross (The Bob Ross Channel).\nCinedigm's ultimate goal is to build destinations that immerse viewers in\ncontent they love while staying at the forefront of technology as the\nstreaming industry continues to evolve.\n\n     About Cinedigm:\n\n     For more than 20 years, Cinedigm (NASDAQ:CIDM) has led the digital\ntransformation of the entertainment industry. Today, Cinedigm entertains\nconsumers around the globe by providing premium feature film and television\nseries, enthusiast streaming channels and technology services to the\nworld's largest media, retail and technology companies. As a leader in the\nrapidly evolving streaming ecosystem, Cinedigm continues its legacy as an\ninnovator through its adoption of next-generation technologies, such as\nartificial intelligence and machine learning, through its proprietary,\nhighly-scalable Matchpoint(TM) technology platform. For more information,\nvisit www.cinedigm.com.\n\n     Cinedigm uses, and will continue to use, its website, press releases,\nSEC filings, and various social media channels, including Twitter (Cinedigm\nTwitter), LinkedIn (Cinedigm LinkedIn), Facebook (Cinedigm Facebook),\nStockTwits (Cinedigm Stocktwits) and the Company website (www.cinedigm.com)\nas additional means of disclosing public information to investors, the\nmedia and others interested in the Company. It is possible that certain\ninformation that the Company posts on its website, disseminated in press\nreleases, SEC filings, and on social media could be deemed to be material\ninformation, and the Company encourages investors, the media and others\ninterested in the Company to review the business and financial information\nthat the Company posts on its website, disseminates in press releases, SEC\nfilings and on the social media channels identified above, as such\ninformation could be deemed to be material information.\n\n     About Shout! Factory\n\n     Shout! Factory, LLC is a leading multi-platform media company devoted\nto film and TV distribution, development, and production, as well as the\npreservation and revitalization of the very best in pop-culture\nentertainment. Founded by Richard Foos, Bob Emmer, and Garson Foos in 2003,\nShout! owns and manages a large portfolio of films, contemporary and\nclassic TV series, animation, and documentaries. The company's creative\nacquisition mandate has established it as a leading independent\ndistributor, with partners and properties including GKIDS, Sesame Street,\nThe Carol Burnett Show, The Johnny Carson Show, IFC Films, Stephen J.\nCannell Productions, ITV Studios, Major League Baseball Productions, and\nmany others. Shout! Factory Kids focuses on live-action and animated kids\nand family properties as well as anime, and the company releases films and\ntelevision shows in other genres under the Scream Factory and Shout Select\nimprints. Shout! develops, acquires and distributes new films via Shout!\nStudios, owns and operates libraries including Mystery Science Theater 3000\n(in partnership with creator Joel Hodgson) and the Roger Corman New Horizon\nPictures Library, and operates the acclaimed streaming service Shout!\nFactory TV. Shout! Factory is based in Los Angeles, California. For more on\nShout! Factory, visit shoutfactory.com.\n\n     About Shout! Factory TV(TM)\n\n     Shout! Factory TV(TM) is a digital entertainment streaming service\nthat brings timeless and contemporary cult favorites to pop culture fans.\nShout! Factory TV offers an unrivaled blend of original programming and TV\nshows and movies curated from major studios, independent producers and its\nown distinctive entertainment library. The Shout! Factory TV family of\nchannels also includes Mystery Science Theater 3000, The Carol Burnett\nShow, Johnny Carson TV and TokuSHOUTsu(TM), with more to come soon. Shout!\nFactory TV provides an immersive, high-quality viewing experience across a\nwide variety of platforms: online at ShoutFactoryTV.com, on smartphone\ndevices, tablets and connected TV, and via apps on the Roku player,\nAndroid, Apple TV, and Amazon Fire TV. Shout! Factory TV channels are also\navailable as branded channels on Amazon Prime Channels, Crackle, IMDb TV,\nLocalNow, Plex, Pluto TV, Redbox, The Roku Channel, Roku Premium\nSubscriptions, Samsung TV Plus, Sling TV, STIRR, STRUUM, Theta TV, Tubi,\nTwitch, Vizio and XUMO, with more to come. For more information, please\nvisit ShoutFactoryTV.com.\n\nPRESS CONTACT FOR CIDM:\n\nDKC Public Relations\nHigh Touch Investor Relations\ncinedigm@dkcnews.com\nCinedigm@htir.net\n\nTel   : 212-206-8600    CINEDIGM CORP\n\nWWW   : <a href=\"https://www.cinedigm.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.cinedigm.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2135300309.MNPRE2135301440-06575220211220</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}