{"date": "2022-02-11 14:11:13.353000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3223.79, "close": 3065.87}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MACE SECURITY INTERNATIONAL INC (\"MACE-0\")\n- Sanjay Singh Named New Chairman and CEO at Mace(R) Security\n- International, a Global Leader in Personal Self-Defense Sprays\n\n   Mace Security International, Inc. announced Sanjay Singh as its new\nChairman and CEO. Mr. Singh succeeds Gary Medved, the former President and\nCEO, who has resigned from the company effective February 10, 2022 as part\nof the board of directors' business and leadership planning process.\n\n   Singh, 56, has served as Executive Chairman of the company since April\n2020. He joined the board as Vice-Chairman in 2018. \"It is a privilege to\ntake on this new role,\" Singh said.\n\n   \"A lot of hard work is in front of us as the company plans to further\ntransform the business and unlock the value of MACE. We had lukewarm\nfinancial results in the first nine months of 2021 when compared to a very\nrobust 2020. Over the last few quarters, the company has lowered its four\nwall costs and increased prices to mitigate the impact of lower revenues.\nWe have a resolute team of employees who I am honored to work with every\nday. My priorities this year are to overhaul our revenue generating\nprocesses, solidify our financial position and strengthen our operations\nand I support the board's decision to reorganize the leadership to\nstreamline decision making. Mace has significant brand presence with a\ngrowing base of customers across all its channels backed by a strong line\nof credit to support the growth. I am excited to accelerate the board's\nstrategy,\" Singh said.\n\n   The company intends on participating in various investor conferences as\nit did in prior years. A calendar of those events will be available on the\ncompany's web site in the coming weeks.\n\n   About Mace Security International, Inc.\nMace(R) Security International, Inc. (MACE) is a globally recognized leader\nin personal safety and security. Based in Cleveland, Ohio, the company has\nspent more than 40 years designing and manufacturing consumer and tactical\nproducts for personal defense and security under its world-renowned Mace(R)\nBrand - the original trusted brand of defense spray products. The company\nalso offers aerosol defense sprays and tactical products for law\nenforcement and security professionals worldwide through its Mace(R) Take\nDown(R) brand, KUROS!(R) Brand personal safety products, Vigilant(R) Brand\nalarms, and Tornado(R) Brand pepper spray and stun guns. MACE(R)\ndistributes and supports Mace(R) Brand products through mass market\nretailers, wholesale distributors, independent dealers, Amazon.com,\nMace.com, and other channels. For more information, visit www.mace.com.\n\n   Mace Security International distributes and supports its products and\nservices through mass-market retailers, wholesale distributors, independent\ndealers, e-commerce channels and through its website, www.Mace.com. For\nmore information, please visit www.mace.com.\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204100127.MNPRE2204100657-05534120220211</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}