{"date": "2021-11-29 14:47:42+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><h4>\n      This new audio processing capability makes it easy for enterprise customers to remove background noise from telephone calls without distorting human speech\n    </h4>\n              <h4>\n      Ooma is among the first providers to implement this new audio processing capability from Inteliquent\n    </h4>\n              <p>\n      Chicago, IL - Inteliquent, a leading provider of cloud communications solutions for voice, messaging, and emergency services, announced that it is implementing the noise suppression capabilities of the Amazon Chime SDK in its voice network. This new machine learning capability, powered by Amazon Web Services (AWS), improves the clarity of phone calls by reducing unwanted background noises and focusing on the human voice. By improving the intelligibility of enterprise and call center customer communications, customers can now increase productivity, while reducing talk time, and eliminating friction and frustration from their phone calls.\n    </p>\n              <p>\n      The global workforce has seen a seismic shift in businesses supporting fully remote or part-time in-office arrangements since the beginning of the COVID health pandemic. As the workforce participates from home, undesirable background noises such as lawnmowers or barking dogs disrupt their communication sessions. Furthermore, the ability to eliminate these disruptions requires the workforce to use certain phones or purchase proprietary software.\n    </p>\n              <p>\n      \"Our award-winning noise suppression technology, Amazon Voice Focus, uses pre-trained deep machine learning to remove unwanted environmental and background noises that clutter calls,\" said Sid Rao, General Manager, Amazon Chime SDK at AWS. \"We are excited that Inteliquent is making this unique capability of the Amazon Chime SDK available to their customers on any of the more than 100 million phone numbers on their network.\"\n    </p>\n              <p>\n      Inteliquent integrated the Amazon Chime SDK seamlessly into their global phone network to eliminate disrupting and distracting background noises. Customers can purchase phone numbers or connectivity that automatically applies this innovative machine learning capability to their calls. Implementing this capability requires no changes to the enterprise phone network and works with any device the customer uses to place telephone calls. Inteliquent customers can choose to enable Amazon Voice Focus on any phone numbers they purchase from Inteliquent.\n    </p>\n              <p>\n      \"This powerful combination of high-quality voice service and enhanced machine learning provides remote employees, on-the-go callers, and call centers with a superior calling experience unparalleled in the market,\" said Surendra Saboo, President of Inteliquent. \"Now you can have a stress-free calling experience without distracting background noises.\"\n    </p>\n              <p>\n      Ooma, a leading provider of voice and unified communications service to businesses and consumers, is among the first adopters of this new capability from Inteliquent. \"Our early test results with Amazon Voice Focus demonstrate the technology can intelligently reduce background distractions that interfere with audio calls,\" said Toby Farrand, Vice President of Engineering and Operations at Ooma. \"Ooma has been a pioneer in improving audio quality on phone calls, with initiatives such as prioritization of voice traffic, adaptive redundancy, Forward Error Correction coding and our patented Pure Voice technology. Working with Inteliquent, we look forward to making Amazon Voice Focus technology available to our customers.\"\n    </p>\n              <p>\n      To get started, <a href=\"https://www.inteliquent.com/talk-to-expert\" data-type=\"url\" class=\"tr-link\" translate=\"no\">contact Inteliquent</a> via their website for information about becoming a customer.\n    </p>\n              <h4>\n      About Inteliquent\n    </h4>\n              <p>\n      Inteliquent empowers communications for the leading communication service providers and enterprises. The foundation of Inteliquent's communications platform is its fully redundant, geo-diverse, carrier-grade tier 1 network. This network is trusted by the nation's largest service providers, as it provides the most expansive footprint of local and toll-free phone numbers in the United States with over 115 million phone numbers in service across 12,800 on-net rate centers and carrying 300 billion minutes of traffic on the network annually.\n    </p>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.inteliquent.com/blog/inteliquent-aws-voice-focus\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Inteliquent Inc.</strong> published this content on <strong>29 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>29 November 2021 14:47:42 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Inteliquent Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Inteliquent-Inc.</p></div>"}