{"date": "2022-01-09 20:04:58.812000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>JLL Capital Markets announced that it has closed the $54.25 million sale of Whole Foods Santa Monica, a 29,064-square-foot, single-tenant retail building triple net leased on a long-term basis to Whole Foods Market in the Los Angeles-area community of Santa Monica.</p><p>JLL marketed the property on behalf of the seller, Tooley Interests LLC. Deka Immobilien acquired the asset for its open-ended real estate fund, Deka-ImmobilienNordamerika, as its second investment on the West Coast.</p></div><div class=\"tr-npp-body\"><p>The building, which Tooley acquired in 2013 and significantly renovated, has been occupied by Whole Foods since 2017. The trophy property is located at 2021 Cloverfield Blvd. in an irreplaceable location within Santa Monica and at the epicenter of technology and media within Silicon Beach. The area has become the primary location for technology, advertising and media information (TAMI) industries in Southern California.</p><p>Additionally, Whole Foods Santa Monica is less than a half mile from the 10 Freeway. This strategic last-mile location allows the tenant to fulfill delivery and click-and-collect orders and serves a dense and affluent population base of more than 283,000 residents within a two-mile radius and earning an average annual household income of $160,000.</p><p>?Since grocery stores are experiencing record sales, we were drawn to this stand-alone, single-tenant Whole Foods Market, as it is the perfect investment for a long-term investor,? said Driss Oualkadi, President Deka Immobilien in the USA. ?This asset?s established and necessity-based footprint, combined with a long-term lease in the heart of Santa Monica, is an ideal example of the opportunities we seek to acquire as we enter into 2022.?</p><p>The JLL Retail Capital Markets team representing the seller was led by Managing Directors Gleb Lvovich, Geoff Tranchina and Bryan Ley and Senior Director Danial Tyner.</p><p>?The sale of Whole Foods Santa Monica demonstrates continued demand for net-lease real estate in strong locations with credit and a durable business,? Lvovich said. ?Our unique process generated interest from national and global investors across product types.?</p><p>JLL Capital Markets is a full-service global provider of capital solutions for real estate investors and occupiers. The firm's in-depth local market and global investor knowledge delivers the best-in-class solutions for clients ? whether investment sales and advisory, debt advisory, equity advisory or a recapitalization. The firm has more than 3,000 Capital Markets specialists worldwide with offices in nearly 50 countries.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Euclid Infotech Pvt Ltd.</p></div>"}