{"date": "2021-11-29 08:30:42+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n      UK grocer opens SmartShop Pick &amp; Go, a Just Walk Out-enabled convenience store in Holborn Circus, London.\n    </div>\n              <div>\n                <p>\n        When we first announced Just Walk Out technology would be available to other retailers in March 2020, we were met with a great deal of excitement, interest, and opportunities from all corners of the globe. Now, I'm excited to share that we have collaborated with Sainsbury's-one of the largest supermarket chains in the UK-to enable a checkout-free convenience store powered by Amazon's Just Walk Out technology at their Holborn Circus location in the heart of London. Our work with Sainsbury's means that they have become the first international business customer of Just Walk Out technology. The opening of the SmartShop Pick &amp; Go also marks the first time Amazon has retrofitted a store with Just Walk Out technology, meaning the store uses Sainsbury's existing fixtures and fittings with our technology.\n      </p>\n                <p>\n        Here's how the store works: First, Sainsbury's shoppers open or download the Sainsbury<span>'</span>s SmartShop app and select the Holborn Circus location to generate a QR code on their phone. They then scan the QR code at the entry gate, take what they need from the shelves, and shop like normal. It's that simple.\n      </p>\n                <div>\n        Images courtesy of Sainsbury's\n      </div>\n                <p>\n        There are no checkout lanes, no lines, and no need to self-scan any products as they take them from the shelves. When shoppers leave through the store's exit gates, they scan their SmartShop app on the way out and the credit or debit card linked to their app will be charged for the items they took. A little later, shoppers will receive a receipt via email.\n      </p>\n                <p>\n        Integrating Sainsbury's SmartShop app into Amazon's Just Walk Out Shopping experience is new-it's the first time we've enabled a business customer to use their own app to manage store entry, exit, receipts, and payments for shoppers. The integration enables Sainsbury's to leverage existing systems, and their shoppers are able to use the Sainsbury's app they're already accustomed to. Sainsbury's checkout-free store offers a selection of grab-and-go food, candy, dairy, packaged meat, and fresh produce and includes a beer, wine, and spirits section (where Sainsbury's store employees will check IDs).\n      </p>\n                <p>\n        \"We are always looking at new ways to make shopping easy and convenient for our customers,\" said Clo Moriarty, Sainsbury's retail and digital director. \"We are excited about launching SmartShop Pick &amp; Go, which offers contactless, checkout-free shopping to our customers, and are looking forward to hearing their feedback.\"\n      </p>\n                <p>\n        We're proud of our collaboration with Sainsbury's and look forward to seeing more people enjoy the Just Walk Out Shopping experience.Learn more about the <span><a href=\"https://www.about.sainsburys.co.uk/news/latest-news/2021/29-11-21-smartshop-pick-and-go\" data-type=\"url\" class=\"tr-link\" translate=\"no\">announcement from Sainsbury's</a></span>. Learn more about <span><a href=\"https://justwalkout.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Just Walk Out technology</a></span>.\n      </p>\n                <h4>\n        FAQs\n      </h4>\n                <h4>\n        Do you need an Amazon account to enter the new Sainsbury's store?\n      </h4>\n                <p>\n        No, you do not need an Amazon account or an Amazon Prime membership to shop at the SmartShop Pick &amp; Go store. This is a Sainsbury's store powered by Amazon's Just Walk Out technology.\n      </p>\n                <h4>\n        Do you need Sainsbury's SmartShop app access to enter the store?\n      </h4>\n                <p>\n        Yes, you need the Sainsbury's SmartShop app to shop at the SmartShop Pick &amp; Go store. Access to the store will be granted when a shopper scans the QR code generated on their SmartShop app at the entry gates. When customers leave through the store's exit gates, they scan their SmartShop app, and the credit or debit card linked to their app will be charged for the items they took. A little later, customers will receive a receipt via email.\n      </p>\n                <h4>\n        Will there be any employees in the SmartShop Pick &amp; Go store?\n      </h4>\n                <p>\n        Yes, there will be Sainsbury's employees in the store to greet shoppers, answer questions, and replenish products in store.\n      </p>\n                <h4>\n        How is this different from Amazon Fresh stores with Just Walk Out technology in the UK?\n      </h4>\n                <p>\n        Sainsbury's is a third-party customer of Amazon's Just Walk Out technology, and they manage and operate all aspects of the SmartShop Pick &amp; Go store, including the store operations and employees, merchandising, pricing, managing payments, and issuing receipts. Our Amazon Fresh stores in the UK are Amazon-owned and operated stores, powered by Just Walk Out technology, that customers can shop at using the Amazon mobile shopping app.\n      </p>\n              </div>\n              <div>\n                <div>\n        Related Tags\n      </div>\n                <div>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/physical-retail\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Physical retail</a>\n                  </span>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/just-walk-out-technology\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Just Walk Out technology</a>\n                  </span>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/uk\" data-type=\"url\" class=\"tr-link\" translate=\"no\">UK</a>\n                  </span>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/retail/sainsburys-becomes-first-international-third-party-customer-to-use-amazons-just-walk-out-technology\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>29 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>29 November 2021 08:30:42 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}