{"date": "2021-11-16 13:48:13.059000+00:00", "ticker": "III", "mrkt_info": {"open": 1444.5, "close": 1434.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>GRAVITAS ONE CAPITAL CORP. (\"GONE.P-V\")\n- Completion of Qualifying Transaction\n\n     Gravitas One Capital Corp. (\"GONE\"), a capital pool company listed on\nthe TSX Venture Exchange, is pleased to announce that it has completed its\nqualifying transaction (the \"Qualifying Transaction\") with Xybion\nCorporation (\"Xybion\"), a Delaware-based company specializing in low-code\ntechnology-based cloud software solutions. The resulting issuer, Xybion\nDigital Inc. (the \"Resulting Issuer\") and its class A subordinate voting\nshares (\"SVS\") are anticipated to start trading on the TSX Venture Exchange\non November 18, 2021, under the stock symbol \"XYBN\".\n\n     As part of the Qualifying Transaction, the subscription receipts\nissued by Xybion BC Finco Ltd. (\"Finco\"), a wholly-owned subsidiary of\nXybion, on August 6, 2021 pursuant to a brokered private placement (the\n\"Subscription Receipts\"), were converted into SVS of the Resulting Issuer.\nThe private placement, which was completed through a syndicate of agents\nled by Stifel GMP (the \"Lead Agent\") and including Echelon Wealth Partners\nInc. and Gravitas Securities Inc. (together with the Lead Agent, the\n\"Agents\"), consisted of 696,404 Subscription Receipts issued at CDN$3.20\nper Subscription Receipt for gross proceeds of CDN$2,228,492.80. The\nproceeds will assist the Resulting Issuer in pursuing its growth strategy,\nincluding acquisitions.\n\n     \"Listing on the TSXV is an important part of Xybion's growth\nstrategy,\" said Pradip Banerjee, CEO of the Resulting Issuer, \"We have\ndeveloped a unique low-code software platform to help life sciences\ncompanies to digitally transform their operations to safely accelerate the\ndevelopment and regulatory approvals of life saving treatments for people\neverywhere. We believe that the TSXV listing will deliver access to\nliquidity and growth capital that will help us to attract talent,\nprofitably scale faster, and generate excellent returns for shareholders.\nWe are excited about our future together.\"\n\n     The Agents received a cash commission of CDN$132,017.18, representing\n6% of gross proceeds for the sold Subscription Receipts (other than those\nsold to certain identified buyers for which the Agents received a cash\ncommission of 3%) as well as 41,255 compensation options exercisable into\nFinco common shares. Through the Qualifying Transaction, the compensation\noptions were replaced by compensation options exercisable into SVS of the\nResulting Issuer equal to 6% of the number of Subscription Receipts sold\n(3% in respect of certain identified purchasers).\n\n     Prior to the completion of the Qualifying Transaction, GONE effected a\nconsolidation of its outstanding common shares on the basis of one\npost-consolidation common share for every 10.65 pre-consolidation common\nshares. Furthermore, the Resulting Issuer implemented a three-class share\nstructure with SVS, Class B Proportionate Voting Shares (\"PVS\") and Class C\nProportionate Non-Voting Shares (\"NVS\"), collectively, the SVS, PVS and\nNVS, the \"Resulting Issuer Shares\"). Each SVS carries one vote per share\nand each PVS carries 100 votes per share. Each NVS is a non-voting share.\n\n     Prior to the completion of the Qualifying Transaction, Xybion effected\na consolidation of its outstanding shares of common stock on the basis of\none post-consolidation share of common stock for every 2.95\npre-consolidation shares of common stock. As part of the Qualifying\nTransaction, all of the outstanding shares of common stock of Xybion were\nexchanged for 60,532.24 PVS, convertible into SVS on a 1:100 basis and\n4,479.4234 NVS convertible into SVS on a 1:10,000 basis. In addition, the\nQualifying Transaction was completed through the conversion of all of\nXybion's and Finco's securities exercisable or exchangeable for, or\nconvertible into, or other rights to acquire Xybion or Finco securities\noutstanding, including those acquired by way of the private placement.\n\n     The Qualifying Transaction was done by way of a three-cornered\namalgamation and a reverse-triangular merger pursuant to which, among other\nthings, (i) Finco amalgamated with a wholly-owned BC subsidiary of GONE,\nincorporated for the purposes of the Qualifying Transaction, to become a\nwholly-owned BC subsidiary of GONE; and (ii) a wholly-owned U.S. subsidiary\nof GONE, incorporated for the purposes of the Qualifying Transaction,\nmerged with and into Xybion, with Xybion as the surviving corporation and a\nwholly-owned U.S. subsidiary of GONE.\n\n     Following completion of the Qualifying Transaction, the officers and\ndirectors of the Resulting Issuer are as follows:\n\n//st\n\n* Pradip Banerjee, Chairman of the Board, Chief Executive Officer, Director\n* Steven Porfano, Chief Financial Officer\n* Kamal Biswas, Chief Operating Officer, President\n* Peter Bailey, Director\n* William (Bill) Cheliak, Director\n* Mary LeBlanc, Director\n* John McCoach, Director\n\n//et\n\n     As a result of the Qualifying Transaction, the security holder of\nXybion holds 60,532.24 PVS (or on an as converted basis to SVS, 6,053,224\nSVS) and 4,479.4234 NVS (or on an as converted basis to SVS, 44,794,234\nSVS) representing approximately 80% of the issued and outstanding SVS and\nPVS, on an as converted basis to SVS (\"Voting Shares\"). The current\nshareholders of GONE hold 816,902 SVS representing approximately 10.8% of\nthe outstanding Voting Shares. Investors in the private placement hold\n696,404 SVS representing approximately 9.2% of the outstanding Voting\nShares. Percentages are not expressed on a fully diluted basis.\n\n     The SVS will be listed and posted for trading on the TSX Venture\nExchange (\"TSXV\") under the symbol \"XYBN\", and are expected to commence\ntrading on November 18, 2021 at market open. The PVS and NVS will not be\nlisted for trading on the TSXV but may be converted into SVS in certain\ncircumstances. Each PVS shall be convertible into such number of SVS as is\ndetermined by multiplying the number of PVS in respect of which the share\nconversion right is exercised by 100 and each NVS shall be convertible into\nsuch number of SVS as is determined by multiplying the number of NVS in\nrespect of which the share conversion right is exercised by 10,000.\n\n     Following the completion of the Qualifying Transaction, a total of\n1,513,306 SVS, 60,532.24 PVS and 4,479.4234 NVS (such PVS convertible into\nan aggregate of 6,053,224 SVS and such NVS convertible into an aggregate of\n44,794,234 SVS) representing a total of 52,360,764 SVS on an as converted\nbasis into SVS are issued and outstanding.\n\n     In accordance with TSXV policies, a total of 347,415 SVS (3,700,000\nGONE common shares, pre-consolidation and before the completion of the\nQualifying Transaction) will remain subject to the CPC Escrow Agreement. A\ntotal of 16,129 SVS, 60,532.24 PVS, 4,479.4234 NVS, 4,063,292 Resulting\nIssuer legacy options (the \"Resulting Issuer Legacy Options\") and 8,062\nResulting Issuer Warrants will be in escrow as \"Value Shares\". Furthermore,\ncertain non-Principal holders of an aggregate of 297,081 Xybion Legacy\nOptions will be subject to seed share resale restrictions (\"SSRRs\")\npursuant to a pooling agreement. The terms of the SSRRs are based on the\nlength of time such Xybion Legacy Options have been held and the price at\nwhich such Xybion Legacy Options were originally issued.\n\n     As a result of the completion of the Qualifying Transaction, Chief\nExecutive Officer and Chairman of the Board of Directors of the Resulting\nIssuer Mr. Pradip Banerjee acquired ownership and control of 7,814 SVS,\nrepresenting 0.52% of the issued and outstanding SVS, 470,844 Resulting\nIssuer Legacy Options and 3,907 Resulting Issuer Warrants and has control\nover 60,532.24 PVS and 4,479.4235 NVS which are owned by Banerjee Group,\nLLC, an entity controlled by Mr. Banerjee, which represent 100% of the\nissued and outstanding PVS and NVS. Assuming the exercise of Mr. Banerjee's\nResulting Issuer Legacy Options and Resulting Issuer Warrants, and the\nconversion of the PVS and NVS owned by Banerjee Group, LLC into SVS, Mr.\nBanerjee, together with Banerjee Group, LLC, will have ownership or control\nover 51,340,023 SVS, representing 97.2% on a partial diluted basis on an as\nconverted basis to SVS. The securities of the Resulting Issuer owned and\ncontrolled by Mr. Banerjee are being held for investment purposes. Mr.\nBanerjee did not hold shares in GONE prior to closing of the Qualifying\nTransaction.\n\n     To obtain a copy of the early warning report to be filed in connection\nwith the receipt of SVS, PVS, NVS, Xybion Legacy Options, Resulting Issuer\nOptions, and Resulting Issuer Warrants in connection with the Qualifying\nTransaction, please visit the Resulting Issuer's profile on SEDAR at\nwww.sedar.com or please contact Pradip Banerjee at 609-512-5790. The head\noffice of the Resulting Issuer is located at 105 College Street E.,\nPrinceton, New Jersey, United States, 08540.\n\n     In connection with the Qualifying Transaction, the auditor of Xybion,\nRotenberg Meril Solomon Bertiger &amp; Guttilla, P.C., has been appointed the\nauditor of the Resulting Issuer.\n\n     This news release does not constitute an offer to sell or a\nsolicitation of an offer to buy any of the securities in the United States.\nThe securities have not been and will not be registered under the U.S.\nSecurities Act of 1933, as amended (the \"U.S. Securities Act\"), or any\nstate securities laws and may not be offered or sold in the \"United States\"\n(as such term is defined in Regulation S under the U.S. Securities Act)\nunless registered under the U.S. Securities Act and applicable state\nsecurities laws or an exemption from such registration is available.\n\n     Advisors\n\n     Fasken Martineau DuMoulin LLP acted as Canadian counsel to Xybion and\nTroutman Pepper Hamilton Sanders LLP acted as U.S. counsel to Xybion.\nDuMoulin Black LLP acted as legal counsel to GONE and Stifel Nicolaus\nCanada Inc. acted as lead agent on the Private Placement. Stikeman Elliott\nLLP acted as counsel to the Agents in the private placement.\n\n     About Xybion Digital Inc.\n\n     Xybion Digital is a leading low-code technology-based cloud software\nsolution offering unified end-to-end cloud software as a SaaS (software as\na service) for core business processes like research and development,\ntesting laboratory operations, workplace and employee health and safety\nmanagement with embedded compliance, quality, risk and enterprise content\nmanagement systems all on a single cloud and a single database. For more\nthan 40 years, Xybion Digital's software and services help corporations\nsolve end-to-end business problems and create new digital capabilities,\nspeed up innovation, make critical medicines available to patients faster\nwhile reducing compliance risks and achieving cost savings. Serving more\nthan 160 customers in 25 countries, Xybion Digital has the global scale and\nexpertise to optimize workflows and manage complex business processes.\nXybion Digital's broad and diverse customer base is comprised of major\nglobal corporations in the pharmaceutical, biotechnology, contract\nresearch, diagnostic and testing laboratories, health systems, and\ngovernment agencies.\n\n     About Gravitas One Capital Corp.\n\n     Gravitas One Capital Corp. was incorporated under the Business\nCorporations Act (British Columbia) on June 25, 2020, and is a capital pool\ncompany listed on the TSXV. GONE has no commercial operations and has no\nassets other than cash. The company's only business is to identify and\nevaluate assets or businesses with a view to completing a qualifying\ntransaction.\n\n     Forward-Looking Statements\n\n     This news release may contain forward-looking statements (within the\nmeaning of applicable securities laws) which reflect the Resulting Issuer's\ncurrent expectations regarding future events. Forward-looking statements\nare identified by words such as \"believe\", \"anticipate\", \"project\",\n\"expect\", \"intend\", \"plan\", \"will\", \"may\", \"estimate\" and other similar\nexpressions. These statements are based on the Resulting Issuer's\nexpectations, estimates, forecasts and projections and include, without\nlimitation, statements regarding the future success of the Resulting\nIssuer's business. The forward-looking statements in this news release are\nbased on certain assumptions, including without limitation the Shares\nbeginning trading on the TSXV. The forward-looking statements are not\nguarantees of future performance and involve risks and uncertainties that\nare difficult to control or predict. A number of factors could cause actual\nresults to differ materially from the results discussed in the\nforward-looking statements. Readers, therefore, should not place undue\nreliance on any such forward-looking statements. Please refer to risks set\nforth in the Resulting Issuer's Filing Statement dated November 10, 2021\nand the Resulting Issuer's continuous disclosure documents that can be\nfound on SEDAR at www.sedar.com. The forward-looking statements are made as\nof the date of this news release and, except as expressly required by\napplicable law, the Resulting Issuer assumes no obligation to publicly\nupdate or revise any forward-looking statement, whether as a result of new\ninformation, future events or otherwise.\n\n     Neither the TSXV nor its Regulation Services Provider (as that term is\ndefined in policies of the TSXV) accepts responsibility for the adequacy or\naccuracy of this release.\n\n     All information contained in this press release with respect to GONE\nand Xybion was supplied by the parties respectively, for inclusion herein,\nwithout independent review by the other party, and each party and its\ndirectors and officers have relied on the other party for any information\nconcerning the other party.\n\n     For more information regarding Xybion Digital Inc., please contact\nPradip Banerjee, Chief Executive Officer, PBanerjee@xybion.com\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2131900395.MNPRE2131901635-05470520211116</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}