{"date": "2021-11-08 12:27:38.399000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Nov 08, 2021</p></div><div class=\"tr-npp-lead\"><p>Chicago, IL – November 8, 2021 – Zacks.com releases the list of companies likely to issue earnings surprises. This week's list includes Amazon.com, Inc. <a href=\"https://www.zacks.com/stock/quote/AMZN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AMZN</a> , The Walt Disney Company <a href=\"https://www.zacks.com/stock/quote/DIS\" data-type=\"url\" class=\"tr-link\" translate=\"no\">DIS</a> , PayPal Holdings, Inc. <a href=\"https://www.zacks.com/stock/quote/PYPL\" data-type=\"url\" class=\"tr-link\" translate=\"no\">PYPL</a> and D.R. Horton, Inc. <a href=\"https://www.zacks.com/stock/quote/DHI\" data-type=\"url\" class=\"tr-link\" translate=\"no\">DHI</a> .</p><p>Earnings and revenue growth has come down in the ongoing Q3 earnings season from the first-half's breakneck speed, but it is still very high.</p></div><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">For Immediate Release</p><p class=\"tr-npp-section-title\"> Are Earnings Estimates Going Down? </p><p>The unfavorable comparison to the first half of the year isn't only with respect to the growth rates, as the proportion of these companies beating EPS and revenue estimates is also tracking below what we had seen from this same group earlier in the year.</p><p>The decelerated growth pace notwithstanding, aggregate Q3 earnings for the S&amp;P 500 index are on track to reach a new all-time quarterly record, surpassing the record set in the preceding quarter. The 2021 Q3 aggregate total stands at $475.8 billion.</p><p>The one notable disconcerting development this earnings season is on the revisions front, with estimates for the current period (2021 Q4) turning modestly lower over the last few days.</p><p>This is in contrast to the persistent positive revisions trend that we have been seeing since the Summer of 2020. While the magnitude of negative revisions in the aggregate to Q4 estimates is fairly modest, it is relatively more pronounced for the Retail and Transportation sectors.</p><p>A case in point is Amazon, part of the Zacks Retail sector, whose Q4 consensus EPS estimate has dropped from $12.13 a few weeks back to $5.11 at present.</p><p>Partly offsetting these estimate cuts are rising estimates for the Energy sector, which have been steadily going up lately.</p><p>While estimates for 2021 Q4 have modestly come down, we are seeing the opposite for next year's estimates. Earnings estimates for full-year 2022 have gone up +24.8% since January 2020 and +10% since the start of October.</p><p>Sectors enjoying the strongest positive estimate revisions include Consumer Discretionary, Autos, Transportation, Aerospace, Energy, Construction, Business Services and Finance.</p><p>The bottom line on the revisions front is that it still remains positive, with estimates for next year going up even though they have trended down modestly for the current period (2021 Q4).</p><p class=\"tr-npp-section-title\">Q3 Earnings Season Scorecard</p><p>Including all the results that came out through Friday, November 5<span>th</span>, we now have Q3 results from 445 S&amp;P 500 members or 89.2% of the index's total membership. Total earnings (or aggregate net income) for these companies are up +42.9% from the same period last year on +18.6% lower revenues, with 80.2% beating EPS estimates and 74.4% beating revenue estimates. The proportion of these companies beating both EPS and revenue estimates is 62.9%, the blended beats percentage.</p><p>This week brings Q3 results from more than 850 companies, including 13 S&amp;P 500 members. The notable index members reporting results this week include Disney, PayPal and DR Horton.</p><p>For the<span><span>Technology sector</span></span>, we now have Q3 results from 82.5% of the sector's market capitalization in the S&amp;P 500 index. Total Q3 earnings for these Tech companies are up +35.8% from the same period last year on +17.3% higher revenues, with 86.4% beating EPS estimates and 71.2% beating revenue estimates.</p><p>The proportion of Tech companies beating revenue estimates has been clearly on the low side this earnings season.</p><p class=\"tr-npp-section-title\">Expectations for Q3 &amp; Beyond</p><p>Looking at the quarter as a whole, combining the actual results that have come out with estimates for the still-to-come companies, total Q3 earnings for the S&amp;P 500 index are expected to be up +39.7% from the same period last year on +16.5% higher revenues.</p><p>For a detailed look at the overall earnings picture, including expectations for the coming periods, please check out our weekly Earnings Trends report<span>&amp;gt;&amp;gt;&amp;gt;&amp;gt; <a href=\"https://www.zacks.com/commentary/1823034/looking-at-margins-in-the-face-of-inflationary-logistical-issues\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Looking At Margins in the Face of Inflationary and Logistical Issues</a> </span></p><p>Join us on Facebook: <a href=\"https://www.facebook.com/home.php#/pages/Zacks-Investment-Research/57553657748?ref=ts\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.facebook.com/home.php#/pages/Zacks-Investment-Research/57553657748?ref=ts</a> </p><p>Zacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates.</p><p>Media ContactZacks Investment Research</p><p>800-767-3771 ext. 9339</p><p><a href=\"mailto:support@zacks.com\" data-type=\"email\" translate=\"no\">support@zacks.com</a> </p><p><a href=\"https://www.zacks.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.zacks.com</a> </p><p>Zacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. <a href=\"https://www.zacks.com/disclaimer/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.zacks.com/disclaimer</a> .</p><p>Past performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&amp;P 500 is an unmanaged index. Visit <a href=\"https://www.zacks.com/performance\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.zacks.com/performance</a> for information about the performance numbers displayed in this press release.</p><p><span>Bitcoin, Like the Internet Itself, Could Change Everything</span></p><p>Blockchain and cryptocurrency has sparked one of the most exciting discussion topics of a generation. Some call it the \"Internet of Money\" and predict it could change the way money works forever. If true, it could do to banks what Netflix did to Blockbuster and Amazon did to Sears. Experts agree we're still in the early stages of this technology, and as it grows, it will create several investing opportunities.</p><p>Zacks' has just revealed 3 companies that can help investors capitalize on the explosive profit potential of Bitcoin and the other cryptocurrencies with significantly less volatility than buying them directly.</p><p><a href=\"https://www.zacks.com/registration/ultimatetrader/welcome/eoffer/3b9f?add=1424&amp;adid=NEWSTEX_CONTENT_ZU_CRYPTOCURRENCYREPORT_PRESSRELEASES_11082021&amp;cid=CS-NEWSTEX-FT-press_releases-1824828\" data-type=\"url\" class=\"tr-link\" translate=\"no\">See 3 crypto-related stocks now &gt;&gt;</a></p><p>Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.</p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=RPT_7BST_LP194&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_PRESSRELEASES&amp;cid=CS-NEWSTEX-FT-press_releases-1824828\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Click to get this free report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=AMZN&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_PRESSRELEASES&amp;cid=CS-NEWSTEX-FT-press_releases-1824828\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. (AMZN): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=DIS&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_PRESSRELEASES&amp;cid=CS-NEWSTEX-FT-press_releases-1824828\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Walt Disney Company (DIS): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=DHI&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_PRESSRELEASES&amp;cid=CS-NEWSTEX-FT-press_releases-1824828\" data-type=\"url\" class=\"tr-link\" translate=\"no\">D.R. Horton, Inc. (DHI): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=PYPL&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_PRESSRELEASES&amp;cid=CS-NEWSTEX-FT-press_releases-1824828\" data-type=\"url\" class=\"tr-link\" translate=\"no\">PayPal Holdings, Inc. (PYPL): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/stock/news/1824828/amazon-disney-paypal-and-d-r-horton-are-part-of-zacks-earnings-preview?cid=CS-NEWSTEX-FT-press_releases-1824828\" data-type=\"url\" class=\"tr-link\" translate=\"no\">To read this article on Zacks.com click here.</a></p><p><a href=\"http://www.zacks.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Zacks Investment Research</a></p><p>The views expressed in any and all content distributed by Newstex and its re-distributors (collectively, the \"Newstex Authoritative Content\") are solely those of the respective author(s) and not necessarily the views of Newstex or its re-distributors. Stories from such authors are provided \"AS IS,\" with no warranties, and confer no rights. The material and information provided in Newstex Authoritative Content are for general information only and should not, in any respect, be relied on as professional advice. Newstex Authoritative Content is not \"read and approved\" before it is posted. Accordingly, neither Newstex nor its re-distributors make any claims, promises or guarantees about the accuracy, completeness, or adequacy of the information contained therein or linked to from such content, nor do they take responsibility for any aspect of such content. The Newstex Authoritative Content shall be construed as author-based content and commentary. Accordingly, no warranties or other guarantees are offered as to the quality of the opinions, commentary or anything else appearing in such Newstex Authoritative Content. Newstex and its re-distributors expressly reserve the right to delete stories at its and their sole discretion.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Zacks Investment Research</p></div>"}