{"date": "2021-12-07 16:12:15.237000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ELSE NUTRITION HOLDINGS INC (\"BABY,BABY.WT.A-V\")\n- To Participate in the Lytham Partners Winter 2021\n- Investor Conference\n\n   ELSE NUTRITION HOLDINGS INC. (\"Else\" or the \"Company\"), the plant-based\nbaby, toddler and children nutrition company, announced today that it will\nbe participating in the Lytham Partners Winter 2021 Investor Conference\ntaking place from December 13-16, 2021. During the event, the company will\nbe participating in a webcasted Fireside Chat discussing its vision for\n2022 and conducting 1x1 virtual investor meetings.\n\n   The webcasted Fireside Chat will be available for viewing at 11:00am ET\non Monday, December 13, 2021 on the Company's website at\n<a href=\"https://elsenutrition.com/pages/investor-relations\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://elsenutrition.com/pages/investor-relations</a> or\n<a href=\"https://wsw.com/webcast/lytham3/babyf/2166600\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://wsw.com/webcast/lytham3/babyf/2166600</a>. The webcast will also be\navailable for replay following the event.\n\n   To arrange a 1x1 meeting with management, please contact Lytham Partners\nat 1x1@lythampartners.com or register at\nwww.lythampartners.com/winter2021invreg.\n\n   About Else Nutrition Holdings Inc.\n\n   Else Nutrition GH Ltd. is an Israel-based food and nutrition company\nfocused on developing innovative, clean and plant-based food and nutrition\nproducts for infants, toddlers, children, and adults. Its revolutionary,\nplant-based, non-soy, formula is a clean-ingredient alternative to\ndairy-based formula. Else Nutrition (formerly INDI) won the \"2017 Best\nHealth and Diet Solutions\" award at the Global Food Innovation Summit in\nMilan. Else Plant-Based Complete Nutrition for Toddlers was recently ranked\nas the #1 Top seller in the baby and toddler formula category on Amazon.\nThe holding company, Else Nutrition Holdings Inc., is a publicly traded\ncompany, listed as TSX Venture Exchange under the trading symbol BABY and\nis quoted on the US OTC Markets QX board under the trading symbol BABYF and\non the Frankfurt Exchange under the symbol 0YL. Else's Executives include\nleaders hailing from leading infant nutrition companies. Many of Else\nadvisory board members had past executive roles in companies such as Mead\nJohnson, Abbott Nutrition, Plum Organics and leading infant nutrition\nSocieties, and some of them currently serve in different roles in leading\nmedical centers and academic institutes such as Boston Children's Hospital,\nPediatrics at Harvard Medical School, USA, Tel Aviv University, Schneider\nChildren's Medical Center of Israel, Rambam Medical Center and Technion,\nIsrael and University Hospital Brussels, Belgium.\n\n   For more information, visit: elsenutrition.com or @elsenutrition on\nFacebook and Instagram.\n\n Contact Information:\n\nContact:Erin Jundef\nBrilliant PR\nerinj@brilliantpr.com\n\n   Contact:\n\n   Mrs. Hamutal Yitzhak, CEO, Co-Founder &amp; Director\nELSE Nutrition Holdings Inc.\nE: hamutaly@elsenutrition.com\nP: +972(0)3-6445095\n\n   Mr. Sokhie Puar, Director of Else Nutrition\nE: sokhiep@elsenutrition.com\nP: 604-603-7787\n\n   US Investor Relations Contact:\n\n   Lytham Partners, LLC\nMr. Ben Shamsian\nNew York | Phoenix\nE: shamsian@lythampartners.com\nP: 646-829-9701\n\n   TSX Venture Exchange\n\n   Neither the TSX Venture Exchange nor its regulation services provider\n(as that term is defined in the policies of the TSX Venture Exchange)\naccepts responsibility for the adequacy or accuracy of this release.\n\n   Caution Regarding Forward-Looking Statements\n\n   This press release contains statements that may constitute\n\"forward-looking statements\" within the meaning of applicable securities\nlegislation. Forward-looking statements are typically identified by words\nsuch as \"will\", \"expect\" or similar expressions. Forward-looking statements\nin this press release include statements with respect to the anticipated\ndates for filing the Company's financial disclosure documents.   Such\nforward-looking statements reflect current estimates, beliefs and\nassumptions, which are based on management's perception of current\nconditions and expected future developments, as well as other factors\nmanagement believes are appropriate in the circumstances. No assurance can\nbe given that the foregoing will prove to be correct. Forward-looking\nstatements made in this press release assume, among others, the expectation\nthat listing on the FSE will create additional liquidity and attract\nadditional investors in the European market. Actual results may differ from\nthe estimates, beliefs and assumptions expressed or implied in the\nforward-looking statements.   Readers are cautioned not to place undue\nreliance on any forward-looking statements, which reflect management's\nexpectations only as of the date of this press release. The Company\ndisclaims any obligation to update or revise any forward-looking\nstatements, whether as a result of new information, future events or\notherwise, except as required by law.\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134000330.MNPRE2134002245-08004020211207</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}