{"date": "2021-11-24 15:22:12+00:00", "ticker": "AVV", "mrkt_info": {"open": 3388.0, "close": 3229.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Panel</strong></p>\n<ul class=\"bulleted-list arrowlist\">\n<li>Salman Abdulla, Executive Vice President – HSSEQ, Emirates Global Aluminium</li>\n<li>Caspar Herzberg, Chief Revenue Officer, AVEVA</li>\n<li>Maria Strandesen, Head of Future Fuels, Maersk</li>\n<li>Jürgen Petersiem, Senior Manager – Sustainability Services, PwC</li>\n</ul>\n<p><strong>Key Insights</strong></p>\n<ul class=\"bulleted-list arrowlist\">\n<li>Around 90% of countries today have net zero carbon targets. Electrification is critical to achieving net zero, but it is limited in terms of timelines, technology, and infrastructure.</li>\n<li>The Middle East is investing in upgrading infrastructure for electrification. Electricity consumption in the region is expected to at least double over the next 20 years, driven largely by desalination, urbanisation, and digitalisation.</li>\n<li>For deep-sea-going vessels, hydrogen fuel is not an option currently as it takes up too much cargo space. Maersk is looking instead at liquid fuels like green methanol.</li>\n<li>Large industrial companies not only need to decarbonise their operations but also need to align their supply chains with their own decarbonisation objectives.</li>\n<li>Digitalisation and the need to harvest and analyse huge amounts of data in the industrial sector is a major driver of increased demand for electricity.</li>\n</ul>\n<p><strong>Key Quotes</strong></p>\n<p><strong>Salman Abdulla, Executive Vice President – HSSEQ, Emirates Global Aluminium</strong></p>\n<p>“Unfortunately, there is a lot of stigma and concern around the safety of nuclear power and the parties involved in that space need to have much stronger advocacy groups to educate people on its safety and security. Because it’s an important fuel if we want to truly decarbonise.”</p>\n<p>“Commercial organisations have to look at fuel through three lenses. It has to have a secure supply, it has to be safe, and it has to be economically viable.”</p>\n<p><strong>Caspar Herzberg, Chief Revenue Officer, AVEVA</strong></p>\n<p>“Many of our clients are in the energy industry, which is under tremendous pressure to demonstrate sustainability commitments not just with initiatives but with data. At the heart of all of that is the data from your assets and you can only access that data if you’re digitised.”</p>\n<p><strong>Maria Strandesen, Head of Future Fuels, Maersk</strong></p>\n<p>“One thing we’ve learnt from evaluating future fuels is that we can decarbonise faster than we originally thought in 2018, when we set out the goal of decarbonising our fleet by 2050. We planned to launch the world’s first carbon neutral container vessel in 2030 but it will now be in 2023 followed a year later by eight more vessels.”</p>\n<p><strong>Jürgen Petersiem, Senior Manager – Sustainability Services, PwC</strong></p>\n<p>“There is no silver bullet to green energy sources because the world is complex. You need diversification. And we will still need a green molecule in the future as electricity for example cannot power a transatlantic commercial flight.”</p>\n<p>“One thing I wish for is we see all these commitments and enthusiasm around decarbonising industry translate to overall global emissions reduction, because in the end, that’s what counts.”</p>\n<p>-Ends-</p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}