{"date": "2022-02-15 15:11:26.867000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MOTORSPORT GAMES INC (\"MSGM-Q\")\n- Next Gen Car For NASCAR 21: Ignition\n\n     Motorsport Games Inc. (\"Motorsport Games\"), a leading racing game\ndeveloper, publisher and esports ecosystem provider of official motorsport\nracing series throughout the world, announces today the addition of\nNASCAR's Next Gen car to NASCAR 21: Ignition, the officially licensed\nvideo game of the world's most popular stock car racing series. The Next\nGen car update will be available starting Thursday, February 17, 2022\nwithin a new \"Test Drive mode\" for players on all platforms (PlayStation,\nXbox and PC).\n\n     The Next Gen car update arrives just in time for the start of the 2022\nNASCAR regular season and its first race - the Daytona 500 - scheduled to\nbe held Sunday, February 20, 2022. With the Next Gen cars being the most\nhighly anticipated change coming to NASCAR this year, Motorsport Games has\nbeen working on implementing the car into NASCAR 21: Ignition since its\nlaunch to ensure that players will have authentic representation of the\nsport in its most current state. Players can look forward to driving the\nNo. 78 Live Fast Motorsports Next Gen Ford Mustang test car in-game within\nthe all-new Test Drive mode, getting a handle on the new car for the first\ntime.\n\n     \"Our development team couldn't be happier about adding Next Gen cars\nto the current iteration of Ignition, especially prior to the kickoff of\nthe 2022 NASCAR season,\" said George Holmquist, Vice President of\nPublishing and Marketing at Motorsport Games. \"We have shared in the\nexcitement of our players and NASCAR fans with this highly anticipated game\naddition. We made sure to recreate the Next Gen car as close to its\nreal-life counterpart as possible and we can't wait for everyone to get\nacclimated with driving the newest stock car in-game, just like the drivers\nwill be throughout the year.\"\n\n     Not only will users at home get to use the Next Gen cars in-game, but\nattendees of the Daytona 500 race weekend will have the opportunity to test\ndrive the Next Gen car at the eNASCAR Arcade on site. Players will be able\nto drive the car around the iconic Daytona International Speedway prior to\nthe showcase event on race day. Motorsport Games representatives will be on\nhand to assist players and answer questions about the newest update.\n\n     In addition, fans can look forward to kicking off the 2022 NASCAR\nseason with a Free Play Weekend of NASCAR 21: Ignition, available on the\nXbox platform from February 17 - 20, 2022. The game comes complete with a\nnumber of modes, such as Race Now, Online Multiplayer and the brand new\nPaint Booth. NASCAR 21: Ignition contains all drivers, teams and tracks\nfrom the 2021 NASCAR Cup Series season and is accessible for players of all\nskill levels.\n     The Daytona 500 weekend will also see Live Fast Motorsports kick off\nthe second year of its partnership with Motorsport Games by racing with a\nNASCAR 21: Ignition and Xbox-themed scheme on its No. 78 Ford Mustang. This\nmarks the first of seven select races this season that B.J. McLeod's No. 78\ncar will feature a Motorsport Games-inspired livery. Additionally, McLeod\nwill race with a custom-designed Motorsport Games helmet and the Live Fast\nMotorsports pit crew will wear Motorsport Games branded fire suits\nthroughout the season.\n\n     To purchase NASCAR 21: Ignition, please visit the PlayStation Store,\nXbox Store and Steam.\n\n     To keep up with the latest Motorsport Game news visit\nwww.motorsportgames.com and follow on Twitter, Instagram, Facebook and\nLinkedIn.\n\n     About Motorsport Games:\nMotorsport Games, a Motorsport Network company, combines innovative and\nengaging video games with exciting esports competitions and content for\nracing fans and gamers around the globe. The Company is the officially\nlicensed video game developer and publisher for iconic motorsport racing\nseries across PC, PlayStation, Xbox, Nintendo Switch and mobile, including\nNASCAR, INDYCAR, 24 Hours of Le Mans and the British Touring Car\nChampionship (\"BTCC\"). Motorsport Games is an award-winning esports partner\nof choice for 24 Hours of Le Mans, Formula E, BTCC, the FIA World\nRallycross Championship and the eNASCAR Heat Pro League, among others.\n\n     Forward-Looking Statements:\nCertain statements in this press release which are not historical facts are\nforward-looking statements within the meaning of Section 27A of the\nSecurities Act of 1933, as amended, and Section 21E of the Securities\nExchange Act of 1934, as amended, and are provided pursuant to the safe\nharbor provisions of the Private Securities Litigation Reform Act of 1995.\nAny statements in this press release that are not statements of historical\nfact may be deemed forward-looking statements. Words such as \"continue,\"\n\"will,\" \"may,\" \"could,\" \"should,\" \"expect,\" \"expected,\" \"plans,\" \"intend,\"\n\"anticipate,\" \"believe,\" \"estimate,\" \"predict,\" \"potential,\" and similar\nexpressions are intended to identify such forward-looking statements. These\nforward-looking statements include, but are not limited to, statements\nconcerning the Company's expectations regarding the future impact of new or\nplanned products, features, offerings or events, and the timing of\nlaunching such products, features, offerings or events. All forward-looking\nstatements involve significant risks and uncertainties that could cause\nactual results to differ materially from those expressed or implied in the\nforward-looking statements, many of which are generally outside the control\nof Motorsport Games and are difficult to predict. Examples of such risks\nand uncertainties include, but are not limited to the Company experiencing\ndifficulties and/or delays in enhancing the quality of its product\nofferings that could negatively impact its future development plans, such\nas due to difficulties or delays in launching new products, higher than\nanticipated costs incurred in developing, launching and continuing to\nenhance and improve such products and/or less than anticipated consumer\nacceptance of the Company's products and/or difficulties, delays in or\nunanticipated events that may impact the timing and scope of new product\nlaunches, such as due to delays and higher than anticipated expenses\nrelated to the ongoing and prolonged COVID-19 pandemic and related economic\nlockdowns and government mandates; unanticipated operating costs,\ntransaction costs and actual or contingent liabilities; adverse effects of\nincreased competition; and unanticipated changes in consumer behavior,\nincluding as a result of general economic factors, such as increased\ninflation. Factors other than those referred to above could also cause\nMotorsport Games' results to differ materially from expected results. All\nforward-looking statements involve significant risks and uncertainties that\ncould cause actual results to differ materially from those expressed or\nimplied in the forward-looking statements, many of which are generally\noutside the control of Motorsport Games and are difficult to predict.\nFactors other than those referred to above could also cause Motorsport\nGames' results to differ materially from expected results. Additional\nfactors that could cause actual results to differ materially from those\nexpressed or implied in the forward-looking statements can be found in\nMotorsport Games' filings with the SEC, which may be found at www.sec.gov\nand at ir.motorsportgames.com, including its Annual Report on Form 10-K for\nthe fiscal year ended December 31, 2020, its Quarterly Reports on Form 10-Q\nfiled with the SEC during 2021, as well as in its subsequent filings with\nthe SEC. Motorsport Games anticipates that subsequent events and\ndevelopments may cause its plans, intentions and expectations to change.\nMotorsport Games assumes no obligation, and it specifically disclaims any\nintention or obligation, to update any forward-looking statements, whether\nas a result of new information, future events or otherwise, except as\nexpressly required by law. Forward-looking statements speak only as of the\ndate they are made and should not be relied upon as representing Motorsport\nGames' plans and expectations as of any subsequent date. Additionally, the\nbusiness and financial materials and any other statement or disclosure on,\nor made available through, Motorsport Games' website or other websites\nreferenced or linked to this press release shall not be incorporated by\nreference into this press release.\n\n     Website and Social Media Disclosure:\nInvestors and others should note that we announce material financial\ninformation to our investors using our investor relations website\n(ir.motorsportgames.com), SEC filings, press releases, public conference\ncalls and webcasts. We use these channels, as well as social media and\nblogs, to communicate with our investors and the public about our company\nand our products. It is possible that the information we post on our\nwebsites, social media and blogs could be deemed to be material\ninformation. Therefore, we encourage investors, the media and others\ninterested in our company to review the information we post on the\nwebsites, social media channels and blogs, including the following (which\nlist we will update from time to time on our investor relations website):\n\n//st\n\n         Websites              Social Media\n\n         motorsportgames.com   Twitter:@msportgames &amp; @traxiongg\n\n         traxion.gg            Instagram: msportgames &amp; traxiongg\n\n         motorsport.com        Facebook: Motorsport Games &amp; traxiongg\n\n                               LinkedIn: Motorsport Games\n\n                               Twitch: traxiongg\n\n                               Reddit: traxiongg\n\n//et\n\n     The contents of these websites and social media channels are not part\nof, nor will they be incorporated by reference into, this press release.\n\n     Investors:\nAshley DeSimone\nAshley.Desimone@icrinc.com\n\n     Press:\nMotorsport Games PR\npress@motorsportgames.com\n\n     A photo accompanying this announcement is available at:\n<a href=\"https://prdesk.globenewswire.com/ResourceLibrary/ResourceLibrary/GetDynamic\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://prdesk.globenewswire.com/ResourceLibrary/ResourceLibrary/GetDynamic</a>\nThumbnailContentContent/?resourceId=45fa0b15-1f17-4e85-8bc9-2f918f3bdc6d&amp;ma\nxHeight=280&amp;maxWidth=280\n\nTel   : 305-507-8799    MOTORSPORT GAMES INC\nEmail : investors@motorsportgames.com\nWWW   : <a href=\"https://www.motorsportgames.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.motorsportgames.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204500304.MNPRE2204501954-07021420220215</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}