{"date": "2021-12-29 18:51:21+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3413.22, "close": 3372.89}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n        Welcome to our series, \"Real (cool) jobs at Amazon,\" where we highlight employees with some of the most interesting jobs across the company. In this article, meet Kane Diep, the strategist who helped launch Prime Video's TikTok account.\n      </div>\n                <div>\n                  <p>\n          If we told you a TikTok post had the power to inspire and educate millions of people in a meaningful way, would you believe us? The popular video sharing app is often known for viral dance trends, talking pets, and celebrity impersonations, but it's also a space where creators of all backgrounds can share insightful content that drives inclusion, understanding, and lasting impact.\n        </p>\n                  <p>\n          One of those creators is Kane Diep, the Amazon leader behind <span><a href=\"https://www.tiktok.com/@amazonprimevideo/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Prime Video's TikTok account</a></span>. Diep is working to influence real-life change through TikTok content.\n        </p>\n                  <p>\n          \"The world is vast. There are so many stories, identities, and relationships of all kinds that historically have been ignored on screen,\" said Diep, Prime Video's senior social video manager. \"My goal is to highlight stories that help people feel seen and heard in new ways.\"\n        </p>\n                  <p>\n          Diep joined Amazon in January 2020 to launch the Prime Video TikTok account. Since then, Diep and his team of creatives have built a following of more than 9.3 million-and earned recognition from <span><a href=\"https://www.adweek.com/brand-marketing/10-brands-and-organizations-rocking-tiktok-marketing/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Ad Week</a></span>and even <span><a href=\"https://newsroom.tiktok.com/en-us/year-on-tiktok-the-brands-that-inspired-us\" data-type=\"url\" class=\"tr-link\" translate=\"no\">TikTok</a></span>for their innovative and impactful approach to content creation.\n        </p>\n                  <p>\n          We chatted with Diep to learn more about how he has helped build a successful brand TikTok account from the ground up. We also dove into what inspired his career in storytelling and social media. Keep reading to learn more about his real, cool job as a TikTok strategist at Amazon.\n        </p>\n                  <div>\n                    <div>\n                      <a href=\"https://www.instagram.com/reel/CWdi_fTpo9E/?utm_source=ig_embed&amp;utm_campaign=loading\" data-type=\"url\" class=\"tr-link\" translate=\"no\">View this post on Instagram</a>\n                    </div>\n                    <p>\n                      <span>\n                        <a href=\"https://www.instagram.com/reel/CWdi_fTpo9E/?utm_source=ig_embed&amp;utm_campaign=loading\" data-type=\"url\" class=\"tr-link\" translate=\"no\">A post shared by Inside Amazon (@insideamazon)</a>\n                      </span>\n                    </p>\n                  </div>\n                  <h4>\n          How would you describe your role?\n        </h4>\n                  <p>\n          I strategized the launch of the <span><a href=\"https://www.tiktok.com/@amazonprimevideo/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@AmazonPrimeVideo</a></span>TikTok account in 2020, and currently lead the growth and curation strategy on the platform. My team works to discover new and innovative ways to connect TikTok users to our amazing library of content on Prime Video.\n        </p>\n                  <h4>\n          What is your vision for the Prime Video TikTok account?\n        </h4>\n                  <p>\n          It's always been my north star to push representation forward and help as many people as possible feel seen and heard across the board, regardless of their background. The vision of serving all communities and helping them feel at home on our account is key. We work to highlight different cultures, relationship dynamics, and intersectional identities that aren't typically represented by prominent entertainment brands or publications. Prime Video wants to mirror all of our customers, so my focus is a direct social extension of what our brand aims to accomplish. The Gen Z and Millennial audiences typically found on TikTok are really eager to learn, and that shows in our engagement data-the more representation we have, the faster the account grows.\n        </p>\n                  <div>\n                    <a href=\"https://www.tiktok.com/@amazonprimevideo\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@amazonprimevideo</a>\n                    <p>\n            Comment your future wedding vows. <a href=\"https://www.tiktok.com/tag/ginabrillon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">#ginabrillon</a><a href=\"https://www.tiktok.com/tag/thefloorislava\" data-type=\"url\" class=\"tr-link\" translate=\"no\">#thefloorislava</a> @gbrillon80 <a href=\"https://www.tiktok.com/tag/hottakesonly\" data-type=\"url\" class=\"tr-link\" translate=\"no\">#hottakesonly</a><a href=\"https://www.tiktok.com/tag/primevideo\" data-type=\"url\" class=\"tr-link\" translate=\"no\">#primevideo</a><a href=\"https://www.tiktok.com/tag/standup\" data-type=\"url\" class=\"tr-link\" translate=\"no\">#standup</a><a href=\"https://www.tiktok.com/tag/wedding\" data-type=\"url\" class=\"tr-link\" translate=\"no\">#wedding</a><a href=\"https://www.tiktok.com/tag/weddingvows\" data-type=\"url\" class=\"tr-link\" translate=\"no\">#weddingvows</a><a href=\"https://www.tiktok.com/tag/vows\" data-type=\"url\" class=\"tr-link\" translate=\"no\">#vows</a><a href=\"https://www.tiktok.com/tag/marriage\" data-type=\"url\" class=\"tr-link\" translate=\"no\">#marriage</a></p>\n                    <a href=\"https://www.tiktok.com/music/original-sound-6843971526165809926\" data-type=\"url\" class=\"tr-link\" translate=\"no\">♬ original sound - Amazon Prime Video</a>\n                  </div>\n                  <h4>\n          What has it been like to launch an account on a relatively new and uncharted social media platform?\n        </h4>\n                  <p>\n          What's cool about launching on a new platform is that there are no rules. It comes down to diligently testing, learning, and adapting to signals customers give us. We think about how our content adds to the conversation and ecosystem of TikTok. In a sea of content, what feels fresh and new is important. Even as best practices have started to pop up for TikTok, we find it important to test our own theories and have often proved \"best practices\" wrong through our own findings. I believe you can't be a leader in the space if you're only following what everyone else is doing. We're driven by finding our own path to best serve our customers while earning new ones.\n        </p>\n                  <h4>\n          Have you had a chance to work with any of the stars from Amazon Original Series?\n        </h4>\n                  <p>\n          Right after I started, I flew to New Zealand to direct a behind-the-scenes set tour with <span>The Wilds</span> cast. We discussed some deeply relatable topics with the young ensemble cast and dove into what they've learned about themselves, their characters, and each other while filming the show. It was a great experience to get to know the actors from one of my favorite shows on a deeper level, and I loved that we got to share that experience with fans of the show. The actors were so kind and hardworking in person, and I'm glad that it came across. <span><a href=\"https://www.youtube.com/watch?v=EC5U45eGSXU&amp;list=PL04SJpRGCR-71rIpZA9mZRBEugCZ42M2E&amp;index=5\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The full video</a></span>is on YouTube with smaller sections cut for TikTok, Instagram, and Twitter.\n        </p>\n                  <div>\n          The Wilds Actors Give A Set Tour | Prime Video\n        </div>\n                  <h4>\n          When did you know you had a passion for video storytelling?\n        </h4>\n                  <p>\n          When I was about 14 years old, my Chinese-Vietnamese immigrant grandma gave me $400 to put toward my first camcorder. That really kicked off my fascination with telling stories through video. I was obsessed with shows like MTV's <span>Making The Video-</span>I loved watching the behind-the-scenes of how popular music videos were made. So when I got my camcorder, one of my earliest projects was re-creating the music video for Britney Spears' <span>Lucky.</span> Ioften recruited my cousins to make silly videos with me after school. I was also inspired by the prominent Asian American music video directors in the business-it was really cool to see that representation at such a young age.\n        </p>\n                  <div>\n                    <div>\n                      <a href=\"https://www.instagram.com/p/CRSe-wmH6pF/?utm_source=ig_embed&amp;utm_campaign=loading\" data-type=\"url\" class=\"tr-link\" translate=\"no\">View this post on Instagram</a>\n                    </div>\n                    <p>\n                      <span>\n                        <a href=\"https://www.instagram.com/p/CRSe-wmH6pF/?utm_source=ig_embed&amp;utm_campaign=loading\" data-type=\"url\" class=\"tr-link\" translate=\"no\">A post shared by Kane Diep (@kanediep)</a>\n                      </span>\n                    </p>\n                  </div>\n                  <h4>\n          What inspired you to focus your work on social media?\n        </h4>\n                  <p>\n          Right out of college, I directed a feature-length documentary about Asian Americans finally finding their voice and sharing their artistry through YouTube. In the beginning of the documentary, I asked people to name as many Asian American actors they could, and they were literally only able to say Jackie Chan and Jet Li. After watching this part of the finished film, I realized I should take the lesson from my own documentary and apply it to my career. If the YouTubers I featured could use social media to amplify the voices and representation of diverse groups, I could use social platforms and my videography skills to help people feel heard and seen too.\n        </p>\n                  <div>\n          UPLOADED: The Asian American Movement (Official Trailer)\n        </div>\n                  <h4>\n          What is your favorite project you've worked on for the Prime Video TikTok account?\n        </h4>\n                  <p>\n          One of my favorite projects was figuring out how well <span><a href=\"https://www.tiktok.com/tag/hottakesonly\" data-type=\"url\" class=\"tr-link\" translate=\"no\">standup specials</a></span>resonate with our customers on TikTok. Specifically, we found that tapping into Jimmy O. Yang and Gina Brillion's standup comedy specials led to some amazing responses and helped us connect to TikTok users in new ways. These comedians share such relatable stories that resonate broadly while also touching on very specific cultural moments that help some people feel seen for the first time.\n        </p>\n                  <span>\n                    <a href=\"https://www.tiktok.com/@amazonprimevideo\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@amazonprimevideo</a>\n                  </span>\n                  <p>\n          Who has a parent like this? <span><a href=\"https://www.tiktok.com/tag/jimmyoyang\" data-type=\"url\" class=\"tr-link\" translate=\"no\">##jimmyoyang</a></span><span><a href=\"https://www.tiktok.com/tag/gooddeal\" data-type=\"url\" class=\"tr-link\" translate=\"no\">##gooddeal</a></span>@funnyasiandude <span><a href=\"https://www.tiktok.com/tag/primevideo\" data-type=\"url\" class=\"tr-link\" translate=\"no\">##primevideo</a></span><span><a href=\"https://www.tiktok.com/tag/hottakesonly\" data-type=\"url\" class=\"tr-link\" translate=\"no\">##hottakesonly</a></span><span><a href=\"https://www.tiktok.com/tag/gooddealapv\" data-type=\"url\" class=\"tr-link\" translate=\"no\">##gooddealapv</a></span><span><a href=\"https://www.tiktok.com/tag/asianamerican\" data-type=\"url\" class=\"tr-link\" translate=\"no\">##asianamerican</a></span><span><a href=\"https://www.tiktok.com/tag/parents\" data-type=\"url\" class=\"tr-link\" translate=\"no\">##parents</a></span></p>\n                  <p>\n                    <span>\n                      <a href=\"https://www.tiktok.com/music/original-sound-6900021073346038534\" data-type=\"url\" class=\"tr-link\" translate=\"no\">♬ original sound - Amazon Prime Video</a>\n                    </span>\n                  </p>\n                  <h4>\n          How have you seen your work make an impact?\n        </h4>\n                  <p>\n          We've developed a robust influencer program with <span><a href=\"https://www.tiktok.com/tag/apvcreator\" data-type=\"url\" class=\"tr-link\" translate=\"no\">over 300 videos</a></span>so far. We've been able to tap into brilliant creators from all backgrounds and disciplines like songwriters, comedians, drag queens, VFX artists, and dressmakers. TikTok is the modern-day calling card for artists, and we're tapping into that in a big way. My experience as a creator myself has helped me understand how to effectively communicate Prime Video's needs to the creators while allowing their artistry to thrive. I remember how important these brand deals were as a creator, and being able to offer many of these influencers their first branded opportunities is meaningful. One of the most impactful moments for me was being told by a creator that our influencer collaborations helped them afford their move to Los Angeles to fully pursue their creative career.\n        </p>\n                  <h4>\n          How have you built the career you have today?\n        </h4>\n                  <p>\n          After I finished college in 2011, I spent two years directing my documentary (called Uploaded: The Asian American Movement). Between doing the film festival circuit and speaking to students at universities, I also filmed over 50 weddings to support myself. I then moved to LA and partnered up with a friend on a YouTube channel, where I wrote, directed, shot, and edited hundreds of comedy and dance videos. During this time, I was a sponge and took as many screenwriting, directing, and improv classes as I could afford. Eventually, with the documentary and YouTube experience, I got hired at Buzzfeed as a video creator. After four years of writing, directing, editing, and appearing on camera in hundreds of videos on YouTube, Facebook, and Snapchat for Buzzfeed, I developed my skills to harmoniously pair art and algorithm. In this role, I learned how to understand user behavior and listen to audience responses.\n        </p>\n                  <p>\n          I've always been ambitious, and that helped me make videos for Buzzfeed that hit the YouTube trending page while consistently garnering millions of views on each of the platforms. I was driven by making content that I'd never seen before, and I learned the importance of putting ego aside and letting the work, data, and audience speak for itself. <span>One of the videos I'm most proud of, that I made in</span> my last role, was called <span><span><a href=\"https://www.youtube.com/watch?v=RBgC5b4TIAk&amp;list=PL04SJpRGCR-71rIpZA9mZRBEugCZ42M2E&amp;index=1\" data-type=\"url\" class=\"tr-link\" translate=\"no\">I Asked My Mom 11 Intimate Questions Before It's Too Late</a></span></span>. Not only was it deeply personal for me, but commenters shared how emotional and inspired they were after watching it.\n        </p>\n                  <p>\n          From my experience at BuzzFeed, I got hired at Prime Video to launch the TikTok account. With each step in my career, I've harnessed every bit of knowledge and intuition I've developed to apply to my current projects. I've built the career I have today by constantly investing in developing my skills and knowledge. I've surrounded myself with people who inspire me, and I hope I'm inspiring them in return. I try to make a bigger and more positive impact with each step forward.\n        </p>\n                  <div>\n                    <div>\n                      <a href=\"https://www.instagram.com/p/BtMkYofhnA0/?utm_source=ig_embed&amp;utm_campaign=loading\" data-type=\"url\" class=\"tr-link\" translate=\"no\">View this post on Instagram</a>\n                    </div>\n                    <p>\n                      <span>\n                        <a href=\"https://www.instagram.com/p/BtMkYofhnA0/?utm_source=ig_embed&amp;utm_campaign=loading\" data-type=\"url\" class=\"tr-link\" translate=\"no\">A post shared by Kane Diep (@kanediep)</a>\n                      </span>\n                    </p>\n                  </div>\n                  <h4>\n          What advice do you have for others who aspire to a career like yours?\n        </h4>\n                  <p>\n          Try to figure out what your north star is. What's the positive impact you want to leave through your work? For example, my north star is building empathy between people of all backgrounds through quality storytelling. What drives me is the desire to continue to expand that scope of my impact and to try to outdo myself instead of comparing my path to others. What I've found helpful about a north star is that you're your own internal compass, and that can remain intact regardless of what happens externally. For example, my current job actually didn't exist two years ago, and TikTok as a platform was at risk of being shut down toward the end of 2020. Regardless of what happens in my life, I'll still have my north star to guide me.\n        </p>\n                  <p>\n                    <span>If you enjoyed learning about Kane Diep's work at Amazon, <span><a href=\"https://www.aboutamazon.com/news/tag/real-cool-jobs-at-amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">read more articles from this series</a></span>. For more information about opportunities at the company, <span>visit</span><span><a href=\"https://www.amazon.jobs/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.jobs</a></span>.</span>\n                  </p>\n                </div>\n                <div>\n                  <div>\n          Related Tags\n        </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/prime-video\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Prime Video</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/real-cool-jobs-at-amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Real (cool) jobs at Amazon</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/signature-story\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Signature Story</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/amazon-jobs\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon jobs</a>\n                    </span>\n                  </div>\n                </div>\n                <div>\n                  <div>\n                    <span>About the Author</span>\n                  </div>\n                  <div>\n                    <div>\n                      <span>Cosette Jarrett</span>\n                    </div>\n                    <div>\n            Cosette is a cat-crazy writer and content marketing specialist from Salt Lake City. She supports About Amazon as a Digital Content Producer.\n          </div>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/workplace/the-amazon-artist-behind-prime-videos-7-million-tiktok-followers\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>29 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>29 December 2021 18:51:21 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}