{"date": "2022-01-21 07:07:55.642000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3125.98, "close": 2852.86}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_ayr6odp6&amp;referenceId=1_ayr6odp6&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_ayr6odp6&amp;referenceId=1_ayr6odp6&amp;pageId=RefinitivNewscasts</a></pre>Source: Thomson Reuters<br/><br/>Description: Microsoft’s $69 bln offer for Activision is likely to run into trouble with regulators in Washington. That presents an opportunity for rival bidders who have gaming ambitions and don’t face as much of a risk with watchdogs. Jennifer Saba argues that Netflix fits the bill.<br/>Short Link: <a href=\"https://refini.tv/33CHPLJ\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/33CHPLJ</a><br/><br/>Video Transcript:<br/><br/>This video is sponsored by Refinitiv, a London Stock Exchange Group business, powering financial markets around the world.<br/><br/>Microsoft's $69 billion deal with Activision Blizzard is likely to run into trouble in Washington. It could be an opening for rival bidders especially those that covet video games and don't face the same scrutiny with watchdogs. Netflix fits the bill. Microsoft's bid of $95 per share in cash is its largest deal ever, yet investors are signaling there are hurdles ahead. Activisionâ\u0080\u0099s stock is trading at about 15% discount to the offer price. While the software giant hasn't been under the regulatory microscope, like peers; Meta Platforms, Alphabet, Amazon, or Apple, it's reasonable to think the deal will raise eyebrows. The Department of Justice and the Federal Trade Commission are rethinking the rules of anti-trust. That's where Netflix could come in. Its leaders Reed Hastings and Ted Sarandos have highlighted video games as a priority, and the company cites Epic Gamesâ\u0080\u0099 Fortnite as a competitor. It doesn't have a full-fledged gaming business like Microsoft either. While Netflix has huge cash obligations to fund movies like â\u0080\u009cDon't Look Upâ\u0080\u009d, it could throw in stock. Hastings and Sarandos have shunned flashy value destructive deals, and that's why its market cap is around $226 billion. But they are right to worry about video games as competition for people's time. The only way to win is to play the game.<br/></span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}