{"date": "2021-11-16 18:51:16.511000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon is the latest to share details of its Black Friday sale.</p><p>The online retail giant announced Monday that it will hold a 48-hour sale starting 12:01 a.m. PST Thanksgiving. While supplies last, the deals will be available at Amazon.com/blackfriday, on the Amazon app, Amazon Book Stores, Amazon 4-star stores or by asking \"Alexa, what are my deals?\"</p></div><div class=\"tr-npp-body\"><p>In a statement to USA TODAY, Amazon said it is \"upping its Black Friday game this year, offering more deals than ever before during its 48-hour Black Friday deals event\" with thousands of deals across electronics, toys, home and kitchen, fashion beauty and more. </p><p>Walmart and Target also unveiled their Black Friday ads Monday.</p><p><span><span>►Black Friday 2021 deals:</span> Amazon, Walmart, Target and more have unveiled holiday shopping plans</span> </p><p><span><span>►Amazon Black Friday 2021 deals are live:</span> Save on Tuft &amp; Needle, Bose and more</span> </p><p>Amazon started rolling out \"Black Friday-worthy deals\" in early October.</p><p>Experts recommend that consumers start shopping for holiday gifts ahead of Thanksgiving and Black Friday, which is often seen as the official kickoff to the holiday shopping season.</p><p>With widespread supply chain disruptions and labor shortages continuing, procrastinating on purchasing some gifts – especially toys and electronics – could end up hitting your wallet.</p><p>Prices also are rising and product inventory will be more limited because of consumer demand and availability.</p><p><span><span>►Amazon's most-loved gifts:</span> Amazon just announced the most-loved gifts of 2021—here are the best ones to buy</span> </p><p><span><span>►Walmart Black Friday 2021:</span> Ad shows PS5, Xbox Series X as online only. How to get early access.</span> </p><p><span><span>Follow USA TODAY reporter Kelly Tyko on Twitter:  <a href=\"https://twitter.com/KellyTyko\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@KellyTyko. For shopping news, tips and deals, join us on our Shopping Ninjas Facebook group. </a> </span> </span> </p><p><span>This article originally appeared on USA TODAY: Amazon Black Friday 2021 sale to start on Thanksgiving with 'more deals than ever before'</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}