{"date": "2020-12-05 08:06:09.754000+00:00", "ticker": "AAF", "mrkt_info": {"open": 91.6, "close": 93.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>CSG announced that its long-standing partnership with Airtel Africa has been extended.</p></div><div class=\"tr-npp-body\"><p>As part of the enhanced agreement, CSG will provide Airtel Africa with managed services, including customer relationship management and convergent charging and billing solutions to support the growth the company is experiencing through its 14-country footprint across Africa.“Airtel Africa actively seeks solutions that support a holistic and seamless IT landscape so that we can benefit from reduced operational overhead, streamlined business operations, and scalable growth models,” said Neelesh Pratap Singh, group CIO, Airtel Africa. “We continue to partner with CSG to help drive differentiation and innovation in our strategic markets and support robust business transformation that enables us to offer the next-generation of products and services our customers have come to expect.”CSG managed services will help bring consistency and scalability across Airtel Africa’s business operations to support its growth across Africa, bring new services to market quickly, boost operational efficiencies and reduce costs.“Airtel Africa’s leadership and industry innovation are reflected in the company’s growth in voice, data and mobile money across Africa, said Ian Watterson, head of CSG’s Asia-Pacific business. “Our complete solution stack gives Airtel Africa the market-leading flexibility necessary to deliver an enhanced customer experience, reduce the amount of time it takes to bring new offerings to market, and deliver long-term revenue growth.”CSG Managed Services provides application configuration management and business operations for companies worldwide. By supporting customers’ IT and business operations, CSG allows companies to focus on their core business functions resulting in reduced annual technology costs while increasing reliability, scalability, security, and overall system performance.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2020 MarketLine</p></div>"}