{"date": "2022-01-27 07:42:29.310000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2799.72, "close": 2792.75}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Jan. 27 -- Future is right to seek more time to service its loans and point out the futility of any attempts to resolve its nearly Rs.5,000 crore unpaid debt via insolvency resolution. The ideal solution is for Future to take funds from either of two large retail players only too eager to provide it with the resources needed to pay off the debt, either Amazon or Reliance. However, Future has turned down an offer by Amazon to make credit available from Samara Capital. At the same time, the contract Future promoters had signed with Amazon in August 2019 prevents Future from selling Future Retail Ltd's retail assets to a Reliance arm to receive the proceeds and use these to pay off its debts. This transaction is held up in litigation that has drawn in an arbitrator from the Singapore International Arbitration Centre, the Competition Commission of India, the high court of Delhi and the Supreme Court of India.</p><p>The ongoing legal tussle between Amazon and the Future Group over the sale of Future's retail assets to Mukesh Ambani's retail ventures mixes corporate interest with national interest and shows a cavalier disregard for the consumers' interests.</p></div><div class=\"tr-npp-body\"><p>Indian regulation prohibits foreign direct investment in multi-brand retail, although FDI is permitted in 'Cash and Carry' or wholesale operations that sell goods to retail shops in bulk. Therefore, Amazon and Walmart's Indian unit Flipkart operate as marketplaces rather than inventory-holding retail operations. In addition, the government has prohibited group companies of the marketplace operator from being major sellers on the platforms to prevent retailers from circumventing the no-inventory condition.</p><p>A group company is one in which a common set of investors hold at least 26% of the equity and/or appoint a majority of the directors. An Indian company is one in which foreign investment is less than 50%. It might seem that proscribing foreign investment in a sector is a pretty definitive act. In reality, things are not that simple. Take the case of investment in current affairs media. Right now, there is an FDI cap of 26% in this segment. Suppose Rupert Murdoch were to give HSBC in Hong Kong the assurance that, were its Indian subsidiary to lend amounts up to $100 million to a specified Indian national, Newscorp would stand guarantee for that loan. Without a single dollar of FDI flowing into a new media operation, Newscorp would be able to fund and run a current affairs journal or website through bank finance.</p><p>So, even if no FDI is allowed, by routing investment through Indian companies, in which the foreign holding is 49%, and bank support is guaranteed by parent firms abroad, it is possible for a determined foreign entity to enter India and run operations, provided it can find someone to hold 51% equity in a company in which the multinational owns 49%. Many Indian companies and individuals are only too keen to work with MNCs searching for local partners. Some local partners can be sleeping partners who cede economic interest and control to their foreign partner, or they can be active players who seek to gain from such collaborations.</p><p>In the deal Amazon entered into with Future in August 2019, while it knew that Indian policy did not allow Amazon to pick up a controlling stake in Future's retail operations, it was confident that it would find a local partner legally entitled to invest in Future and was willing to work in cooperation with Amazon. Thus, it invested an amount of Rs.1,431 crore in Future Coupons Pvt Ltd, a company the Biyanis used to own a stake in Future Retail Ltd (FRL). This investment was preceded by an FRL shareholders' agreement, which stipulated that the Biyanis would remain its owners, that all retail operations of the group would be conducted through FRL, and the company or its 1,500 odd retail assets would not be sold without the consent of FCPL shareholders. This FRL shareholder agreement also listed some 'restricted persons' to whom FRL or its retail assets would not be sold, comprising Mukesh Dhirubhai Ambani and his group entities. Thus, by investing in FCPL, Amazon acquired, via the FRL shareholders' agreement that gave special privileges to FCPL, the right to prevent the sale of Future's retail operations to Reliance without Amazon's permission.</p><p>For good measure, Amazon sought and obtained the Competition Commission of India's approval for its deal with FCPL, although there was no threat to competition in retail due to the deal.</p><p>Yet, a year later, the Biyanis decided to sell FRL's retail assets to Reliance, at which point Amazon initiated its arbitration process under the Singapore International Arbitration Centre. Under an Emergency Arbitration clause, the Arbitrator evaluated the dispute and gave an interim verdict upholding Amazon's objections to FRL's deal with Reliance. Future then dragged it through the judicial process, only to be rebuffed by the Supreme Court. It then moved the Competition Commission of India, which performed the remarkable feat of holding in abeyance an approval it had given more than two years ago for the Amazon-FCPL deal, imposed a fine on Amazon and accused it of suppressing facts. Amazon got this obstruction from the CCI overruled by a single bench of the Delhi high court, but a division bench stayed the single bench's order. This, too, ended up in the Supreme Court.</p><p>How do consumers gain from restricting foreign investment in organized retail? Organized retail will reshape the retail industry. Some jobs would be lost, and some organized sector jobs would be created. This reality isn't changed by the national identity of the organized retail business. Hindustan Unilever, a subsidiary of Unilever, an Anglo-Dutch giant in the fast-moving consumer goods segment, competes with Indian companies in the FMCG space, such as ITC, Godrej, Marico and some MNC subsidiaries, such as Colgate Palmolive and P&amp;G. This competition only benefits the consumer. Plausibly, it also benefits the Indian competitors, forcing them to improve their quality and efficiency.</p><p>Why should the organized retail business be seen any differently? Organized retail can remove layers of avoidable intermediation and associated cost while delivering goods from the producer to the end consumer. Allowing organized retail to grow while keeping foreign retail players hobbled serves the corporate interests of the Indian Big Retail, not of the consumers or the traditional small-time grocers.</p><p>One major service done by organized retail is to make distribution relatively simple for a new FMCG entrant to the Indian market. The entrenched incumbents have built up distribution networks that cannot be imitated or displaced by new entrants in a hurry. But e-commerce allows a new entrant to achieve a certain level of distribution. This could promote fresh investment in India by Indian and foreign companies, create jobs and incomes and improve consumer welfare by offering a greater range of products at competitive prices.</p><p>The point is to make Big Retail efficient. And the best way to make it efficient is to expose it to competition from efficient rivals. Instead of cosseting particular firms, Indian or foreign, opening up Big Retail to competition would refine Big Retail's ability to improve customer choice and affordability.</p><p>The choice is not between organized retail and traditional kirana; both will coexist, even if organized retail's share grows from its present level of 15%. The choice is between efficient Big Retail and inefficient Big Retail. In the 60s and the 70s, India chose to stick with the Ambassador car by not exposing its maker to competition from foreign carmakers. Should we make a similar choice now is the question. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}