{"date": "2021-11-10 08:04:39+00:00", "ticker": "AVV", "mrkt_info": {"open": 3480.0, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds shares, CEO and analyst quotes, background</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Nov 10 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>British industrial software provider Aveva Group <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AVV.L\" data-type=\"ric\" data-ric=\"AVV.L\" translate=\"no\" dir=\"ltr\">AVV.L</a> posted a rise in interim profit on Wednesday and said it expected continued growth in the second half, lifted by revenue gains at recently acquired OSIsoft and global economic recovery.</p><p>S<span class=\"tr-strong\">hares of the company were up 1.4% at 3,560p in early trading.</span></p><p>Aveva, which bought peer OSIsoft for $5 billion last year, has been eyeing revenue gains of at least $100 million from that deal, banking on OSIsoft's PI system that captures data from ships, power plants and other facilities.</p><p>\"The integration of the AVEVA and OSIsoft businesses has progressed well, with both cost and revenue synergies starting to materialise as planned,\" Chief Executive Officer Peter Herweck said, adding that market conditions were also improving.</p><p>Aveva said it also benefited from companies adopting digital tools, increased efforts across industries to move to \"net-zero\" emissions, and improved activity in the energy and marine sectors.</p><p>Adjusted operating profit rose 20.5% to 125.2 million pounds ($168.87 million) for the six months ended Sept. 30 on a pro forma basis, the London-listed company said, while revenue edged 0.8% higher. </p><p>Jefferies analysts said Aveva's headline figures were \"broadly positive,\" but pointed to lower operating cash flow, saying its dynamics would \"remain a topical issue.\"</p><p>        </p><p><br/></p><p>($1 = 0.7414 pounds)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Pushkala Aripaka and Yadarisa Shabong in Bengaluru; Editing by Ramakrishnan M.)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Pushkala.A@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Pushkala.A@thomsonreuters.com</a> ; Twitter: <a href=\"https://twitter.com/pullthekart\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/pullthekart</a>; Mobile: +91 852 751 3793 ; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AVEVA GROUP-RESULTS/ (UPDATE 1)</p></div>"}