{"date": "2021-12-08 14:53:13+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The author is a Reuters Breakingviews columnist.  The opinions expressed are her own.</p><p class=\"tr-by\">By Gina Chon</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">WASHINGTON, Dec 8 (Reuters Breakingviews)</span><span class=\"tr-dl-sep\"> - </span>The White House’s balancing act isn’t always working. U.S. President Joe Biden’s team has taken a more distant approach to business compared with Donald Trump, partly because it’s trying to appease progressive Democrats. That has led to some unforced errors, including a <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2021/12/01/remarks-by-president-biden-on-the-nations-supply-chains\" data-type=\"url\" class=\"tr-link\" translate=\"no\">tardy response</a> to supply chain problems and delays in filling important financial posts. </p><p>When Biden’s administration has collaborated with corporate America, it has gone well. The White House worked with pharmaceutical companies and distribution centers like CVS <a href=\"reuters://REALTIME/Verb=FullQuote/ric=CVS.N\" data-type=\"ric\" data-ric=\"CVS.N\" translate=\"no\" dir=\"ltr\">CVS.N</a> to help 160 million Americans get vaccinated in the president’s first five months in office. On other vital matters, however, businesses have felt they got less of a hearing. </p><p>Several corporate executives told Breakingviews that their early warnings in February about impending supply-chain problems weren’t initially taken seriously by administration officials. Pandemic-induced disruptions that began in 2020 worsened with a surge in consumer demand. That has contributed to a jump in inflation, which hit a 31-year high of 6.2% in October, hurting vulnerable Americans, whom Biden wants to help. </p><p>The Federal Trade Commission in November asked Walmart  <a href=\"reuters://REALTIME/Verb=FullQuote/ric=WMT.N\" data-type=\"ric\" data-ric=\"WMT.N\" translate=\"no\" dir=\"ltr\">WMT.N</a> <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2SK1B8\" data-type=\"storyId\" data-story-id=\"nL1N2SK1B8\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span>, Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and grocers for internal documents about supply-chain strategies to see if these have led to anticompetitive practices. That’s unlikely to solve bottlenecks and is more of a distraction.  </p><p>Biden’s political balancing act also means a couple of key financial positions are in limbo. After opposition from at least five moderate Democrats, Saule Omarova, a progressive pick to lead the Office of the Comptroller of the Currency to oversee JPMorgan <a href=\"reuters://REALTIME/Verb=FullQuote/ric=JPM.N\" data-type=\"ric\" data-ric=\"JPM.N\" translate=\"no\" dir=\"ltr\">JPM.N</a> and others, withdrew her name from consideration on Tuesday. Community banks, a key political constituency, were against her nomination. The Federal Reserve’s head of supervision role has been vacant since October. </p><p>Trump was too chummy with business but a dash of his style could be useful. The White House has made a start by pulling together disparate parts of a largely private supply chain to improve transparency and ease logjams. It is also providing federal grants for pop-up spaces for containers. At a November meeting with Biden, Walmart boss Doug McMillon noted a 51% improvement in his company’s flow of goods. Another sign that Biden is on occasion willing to resist pressure from progressive Democrats was his nomination of Jerome Powell for a second term as Fed boss. That reassured financial markets there would be no sudden shifts in monetary policy. </p><p>More such pragmatic decisions would be welcome. The White House cannot ignore politics and will have to work with progressive Democrats as well as moderate Republicans to pass bills. However, keeping closer tabs on what companies are seeing and worrying about will make Biden’s team better able to promote economic prosperity for all. </p><p>Follow <a href=\"https://twitter.com/GinaChon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@GinaChon</a> on Twitter</p><p><br/></p><p>CONTEXT NEWS </p><p>-  U.S. President Joe Biden said on Dec. 1 that his administration had helped extend hours at major ports in southern California and provided flexibility in working hours for truck drivers that transport critical goods like food. The length of time that containers were left sitting on docks blocking movement had been cut by 40% compared with a month earlier, Biden said. </p><p>- The White House said on Dec. 7 that Saule Omarova, Biden’s nominee to lead the Office of the Comptroller of the Currency, had withdrawn her name from consideration. She faced opposition from at least five moderate Democrats in the Senate, as well as from Republicans. </p><p><br/></p><p class=\"tr-signoff\"> (Editing by Swaha Pattanaik and Sharon Lam)</p><p class=\"tr-contactinfo\">((For previous columns by the author, Reuters customers can click on <a href=\"reuters://REALTIME/verb=Headlines/ric=CHON/\" data-type=\"newsExpression\" data-expression=\"CHON/\" translate=\"no\" dir=\"ltr\">CHON/</a> <br/> SIGN UP FOR BREAKINGVIEWS EMAIL ALERTS <a href=\"https://bit.ly/BVsubscribe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://bit.ly/BVsubscribe</a> | <a href=\"mailto:gina.chon@thomsonreuters.com\" data-type=\"email\" translate=\"no\">gina.chon@thomsonreuters.com</a> ; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://gina.chon.thomsonreuters.com@reuters.net\">gina.chon.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: BIDEN-WASHINGTON/BREAKINGIVEWS</p></div>"}