{"date": "2021-11-22 12:17:42.005000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"fr\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">Equisoft accueille le nouveau président de son conseil Emilio B. Imbriglio, président et chef de la direction de Raymond Chabot Grant Thornton</p>\n<p>MONTRÉAL, le 23 nov. 2021</p>\n<p>\n<span>Cette nomination vient affermir la gouvernance et le leadership d'Equisoft alors que s'accélèrent sa croissance et son expansion à l'international.</span>\n</p>\n<p>MONTRÉAL, le <span>23 nov. 2021</span> /CNW Telbec/ - Equisoft, chef de file des solutions numériques pour le secteur financier à l'échelle mondiale, est fière d'annoncer la nomination d'Emilio B. Imbriglio (FCPA, FCA, MBA, IAS.A, CFE) au poste de <a href=\"https://c212.net/c/link/?t=0&amp;l=fr&amp;o=3368289-1&amp;h=3524961888&amp;u=https%3A%2F%2Fhubs.li%2FH0_xpQD0&amp;a=pr%C3%A9sident+du+conseil+d%27administration\" data-type=\"url\" class=\"tr-link\" translate=\"no\">président du conseil d'administration</a> .</p>\n<p>\n\n</p>\n<p>Président et chef de la direction de <span>Raymond Chabot Grant Thornton</span> (RCGT) depuis 2013, M. Imbriglio pilote une équipe de plus de 2 800 professionnels, répartis dans plus de 100 bureaux, qui contribuent à la croissance d'un grand nombre d'entreprises à travers le monde. À la barre de RCGT, <span>Emilio Imbriglio</span> a établi de nouveaux records de rentabilité pendant huit années consécutives, mis en œuvre une réforme de la gouvernance visant à éliminer un maximum d'angles morts, et implanté de nouvelles stratégies ESG qui ont amené des changements positifs pour les employés, les fournisseurs et les clients.</p>\n<p>\n<span>Emilio Imbriglio</span> a siégé à plus de 25 conseils d'administration, souvent comme président. Il a notamment occupé la présidence du Conseil des associés de RCGT avant de devenir chef de la direction. Pendant 15 ans, il a présidé le conseil d'administration de l'hôpital <span>Santa Cabrini</span> et du centre d'accueil Dante. Il siège actuellement aux conseils d'Hexo (NYSE et TSX), de la Société Générale du <span>Canada</span> et de Finance Montréal.</p>\n<p>Un leader parlant couramment quatre langues, il est membre du conseil des gouverneurs de Grant Thornton International Ltd, qui représente plus de 140 pays, et président du comité du budget et de l'audit. Il a reçu de nombreux prix pour ses réussites professionnelles remarquables, au pays comme à l'étranger.</p>\n<p>« Nous sommes ravis d'accueillir Emilio à la tête de notre conseil d'administration. La richesse de son expérience en leadership et de son expertise internationale sera un atout précieux pour l'accélération de notre croissance, se réjouit <span>Luis Romero</span> , fondateur et président d'Equisoft. La qualité de la gouvernance d'entreprise et l'efficacité du conseil d'administration ont été des facteurs essentiels du succès d'Equisoft au cours des 10 dernières années. La présence d'Emilio consolidera notre mission de longue date d'agir en entreprise modèle en matière de responsabilité sociale et renforcera notre culture de transparence. »</p>\n<p>À la tête du Groupe conseils financiers de <span>Grant Thornton</span> , M. Imbriglio a joué pendant près de 10 ans un rôle clé dans la croissance mondiale et l'expansion des produits. À ce titre, il a piloté des fusions, des acquisitions et des transactions de financement de grande envergure, jouant un rôle de conseiller de premier plan en matière d'infrastructure et de financement du gouvernement.</p>\n<p>Dans son nouveau poste de président du conseil d'administration d'Equisoft, il est soutenu par un groupe de leaders accomplis qui mettent leur bagage de connaissances et d'expérience au service d'Equisoft : <span>Sylvain Brosseau</span> (Gestion d'actifs mondiale Walter), <span>Fulvio Bussandri</span> (Corporation des Aliments I-D), Laird Elliott (Preneur Consulting Services), Robert Héroux (expansio), <span>Annalee Moore</span> (anciennement Sun Life) et <span>Peter Strom</span> (March Networks).</p>\n<p>« Je suis honoré d'accepter ce poste et de prendre les rênes d'un conseil d'administration dont les membres ont des parcours aussi impressionnants, s'enthousiasme M. Imbriglio. C'est une période très excitante pour Equisoft alors qu'elle étend sa présence à l'étranger et met à profit sa culture d'innovation pour résoudre les plus grands défis qui touchent les secteurs de l'assurance et des placements. Nous sommes tous ravis de contribuer à modeler cet avenir. »</p>\n<p>Pour en savoir plus sur le conseil d'administration d'Equisoft : <a href=\"https://c212.net/c/link/?t=0&amp;l=fr&amp;o=3368289-1&amp;h=1818339517&amp;u=https%3A%2F%2Fcan01.safelinks.protection.outlook.com%2F%3Furl%3Dhttps%253A%252F%252Fhubs.li%252FH0_520l0%26data%3D04%257C01%257CManon.Duhamel%2540equisoft.com%257Cfb4a4d9f0d4a4bd83c1508d9a5ea4ee2%257C6db80314c9064d958ca72fdc2499ee59%257C0%257C0%257C637723248022878623%257CUnknown%257CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%253D%257C1000%26sdata%3DD%252BquG6HIJHar9H6rwM5oWgQY2SsA4Y6Cn4JbGygi1GE%253D%26reserved%3D0&amp;a=Visitez+notre+site+Web\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Visitez notre site Web</a>\n</p>\n<p>\n<span>À propos d'Equisoft</span>\n</p>\n<p>Fondée en 1994, Equisoft est un fournisseur mondial de solutions numériques pour l'assurance et l'investissement. Reconnue par plus de 250 des plus grandes institutions financières établies dans 16 pays, Equisoft offre un écosystème complet de solutions, que ce soit des applications frontales innovatrices, une gamme intégrale de services d'arrière-guichet ou une expertise unique en migration de données. Ses produits phares incluent : solution d'administration de polices SaaS, CRM, analyse des besoins financiers, planification financière, répartition de l'actif, analyse de fonds et portefeuilles, soumissions et illustrations, propositions électroniques, gestion d'agence et portails clients, conseillers et courtiers. Equisoft est aussi le principal partenaire mondial d'Oracle pour la plateforme OIPA. Par son approche axée sur les besoins d'affaires, sa connaissance approfondie du secteur, ses technologies de pointe et ses équipes d'experts établies au <span>Canada</span> , aux États-Unis, au Royaume-Uni, en Amérique latine, en Afrique du Sud, en Inde et en Australie, Equisoft aide ses clients à relever tous les défis qu'apporte cette ère de transformation numérique. Pour plus d'information sur nos produits et services, visitez <a href=\"https://c212.net/c/link/?t=0&amp;l=fr&amp;o=3368289-1&amp;h=3165444488&amp;u=https%3A%2F%2Fwww.equisoft.com%2Ffr%2F&amp;a=www.equisoft.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.equisoft.com</a> .</p>\n<p>SOURCE Equisoft</p>\n<p>Consulter le contenu original pour télécharger le multimédia : <a href=\"http://www.newswire.ca/fr/releases/archive/November2021/23/c2895.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/fr/releases/archive/November2021/23/c2895.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 CNW Group Ltd.</p></div>"}