{"date": "2021-12-16 23:41:19.150000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3466.3, "close": 3400.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SOL CUISINE LTD (\"VEG-V\")\n- Files Information Circular to Approve Proposed\n- Plan of Arrangement with PlantPlus Foods\n\n     Sol Cuisine Ltd. (\"Sol Cuisine\" or the \"Company\") announces that it\nhas mailed and filed a management information circular of the Company dated\nas of December 7, 2021 (the \"Circular\") and related meeting and proxy\nmaterials (together with the Circular, the \"Meeting Materials\") in\nconnection with a special meeting of the shareholders of the Company (\"Sol\nShareholders\") to be held virtually on January 7, 2022 at 10:00 a.m.\n(Toronto time) at <a href=\"https://virtual-meetings.tsxtrust.com/1248\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://virtual-meetings.tsxtrust.com/1248</a> (the\n\"Meeting\"). The Meeting will be held in accordance with the terms of an\ninterim order of the Ontario Superior Court of Justice (Commercial List)\n(the \"Court\") obtained on December 7, 2021.\n\n     The Meeting Materials have been filed on Sol Cuisine's SEDAR profile\nat www.sedar.com. Sol Cuisine has mailed the Meeting Materials to all Sol\nShareholders of record as of December 6, 2021. Holders of Sol Cuisine\nwarrants, compensation options and stock options will also be sent a copy\nof the Circular.\n\n     The purpose of the Meeting is to seek Sol Shareholder approval of the\nproposed acquisition by PlantPlus Foods Canada Inc. of all of the\noutstanding common shares, all of the outstanding common share purchase\nwarrants and compensation options, and all of the outstanding stock options\nof Sol Cuisine, pursuant to a plan of arrangement under the Business\nCorporations Act (Ontario) (the \"Arrangement\"), all as more particularly\ndescribed in the Circular.\n\n     At the Meeting, Sol Shareholders will be asked to consider and vote on\na special resolution to approve the Arrangement (the \"Arrangement\nResolution\"). The Arrangement Resolution must be approved, with or without\nvariation, by the affirmative vote of (i) at least two-thirds of the votes\ncast on the Arrangement Resolution by Sol Shareholders, present in person\nor represented by proxy at the Meeting; and (ii) a simple majority of the\nvotes cast on the Arrangement Resolution at the Meeting by Sol\nShareholders, present in person or represented by proxy at the Meeting,\nother than Dror Balshine.\n\n     Sol Shareholders are encouraged to carefully review the Meeting\nMaterials, as they contain important information regarding the Arrangement\nand its consequences to Sol Shareholders. In order to streamline the\nMeeting process, the Company is encouraging Sol Shareholders to vote in\nadvance of the Meeting using the voting instruction form or the form of\nproxy mailed to them with the Meeting Materials and submitting them by no\nlater than 10:00 a.m. (Toronto time) on January 5, 2022, the cut-off time\nfor deposit of proxies prior to the Meeting in accordance with the above\ninstructions. Details on how to attend the Meeting and how to vote are\ncontained in the Circular.\n\n     After careful consideration, and following the recommendation of the\nindependent directors (and with Dror Balshine having previously declared\nhis interests in the Arrangement (given he is indirectly a significant\nshareholder) and having recused himself from the Sol Cuisine board's\ndeliberations relating to the Arrangement and abstaining from voting), the\nSol Cuisine board determined that the Arrangement is in the best interests\nof Sol Cuisine and is fair to Sol Shareholders and holders of Sol Cuisine\nwarrants, compensation options and stock options. Sol Cuisine's board of\ndirectors (with Dror Balshine abstaining from voting) unanimously\nrecommends, for the reasons set out in the Circular, that Sol Shareholders\nvote in favour of the Arrangement Resolution.\n\n     The directors and officers of Sol Cuisine and certain shareholders,\ncollectively holding approximately 88% of Sol Cuisine common shares, have\nalready entered into support and voting agreements and agreed to vote their\ncommon shares in favour of the Arrangement at the Meeting.\n\n     If the Arrangement Resolution receives the requisite approvals of Sol\nShareholders at the Meeting, then a final order on the Arrangement will be\nsought from the Court on or about January 12, 2022. Assuming all other\nclosing conditions are satisfied or waived, it is expected that the\nArrangement will become effective thereafter in January 2022.\n\nFor more details on Sol Cuisine's consumer brands:\n\nWebsite:     www.solcuisine.com Instagram:   @solcuisine Facebook:\n@solcuisine Twitter:      @solcuisine LinkedIn:     @solcuisine\n\n     About Sol Cuisine Ltd.\n\n     Sol Cuisine is the publicly traded parent company of Sol Cuisine Inc.,\nfollowing the completion of its \"qualifying transaction\" on May 19, 2021.\nSol Cuisine is a fast-growing producer of branded and private label,\nconsumer-preferred plant-based protein offerings across key center-of-plate\nand appetizer categories. The Company's products are offered through an\nestablished omni-channel distribution platform in Canada, the U.S. and\nMexico, and are available in over 11,000 stores and more than 41,000 unique\npoints of distribution across four primary channels: Canada Retail Sales &amp;\nClub; U.S. Retail Sales &amp; Club; Food Service &amp; Industrial; and Private\nLabel. Over a history of 20+ years, Sol Cuisine has consistently\ndemonstrated an ability to innovate and delight consumers in Canada and the\nU.S., while remaining true to its commitment to producing great tasting,\nnutritionally superior products. This commitment has resulted in several\nCanadian product wins, including the #1 frozen plant-based burger in\nCanada, the #1 consumer-preferred chicken alternative and the #1 quality\nroast product as determined by Whole Foods Market. The Company's taste and\nnutritional superiority has also resulted in private label contracts with\nsome of the most recognized natural brands in North America. These products\nare all produced at Sol Cuisine's two state of the art facilities, totaling\n35,000 square foot facility in Mississauga, Ontario, capable of supporting\nup to 10 million kilograms of volume per annum.\n\n     Forward-Looking Statements.\n\n     This press release contains forward-looking statements within the\nmeaning of Canadian securities laws regarding the Company and its business.\nThese forward-looking statements contain statements of intent, belief or\ncurrent expectations of Sol Cuisine. Forward-looking information is often,\nbut not always identified by the use of words such as \"anticipate\",\n\"believe\", \"expect\", \"plan\", \"intend\", \"forecast\", \"target\", \"project\",\n\"may\", \"will\", \"should\", \"could\", \"estimate\", \"predict\" or similar words\nsuggesting future outcomes or language suggesting an outlook.\n\n     The forward-looking statements included in this press release,\nincluding statements regarding the Arrangement, the receipt of necessary\nshareholder, Court, regulatory and stock exchange approvals, and completion\nof the Arrangement, are not guarantees of future results and involve risks\nand uncertainties that may cause actual results to differ materially from\nthe potential results discussed in the forward-looking statements.\n\n     In respect of the forward-looking statements and information\nconcerning the completion of the Arrangement and the anticipated timing for\ncompletion of the Arrangement, the Company has provided such in reliance on\ncertain assumptions that it believes are reasonable at this time, including\nassumptions as to the ability of the parties to receive, in a timely manner\nand on satisfactory terms, the necessary regulatory, Court, shareholder,\nstock exchange and other third party approvals and the ability of the\nparties to satisfy, in a timely manner, the other conditions to the\ncompletion of the Arrangement. These dates may change for a number of\nreasons, including the inability to secure necessary shareholder,\nregulatory, Court or other third party approvals in the time assumed or the\nneed for additional time to satisfy the other conditions to the completion\nof the Arrangement. Accordingly, readers should not place undue reliance on\nthe forward-looking statements and information contained in this news\nrelease concerning these times.\n\n     Risks and uncertainties that may cause such differences include but\nare not limited to: the risk that the Arrangement may not be completed on a\ntimely basis, if at all; the conditions to the consummation of the\nArrangement may not be satisfied; the risk that the Arrangement may involve\nunexpected costs, liabilities or delays; the possibility that legal\nproceedings may be instituted against the Company and/or others relating to\nthe Arrangement and the outcome of such proceedings; the possible\noccurrence of an event, change or other circumstance that could result in\ntermination of the Arrangement; risks relating to the failure to obtain\nnecessary shareholder, Court, regulatory and stock exchange approval; other\nrisks inherent in the plant-based food industry. Failure to obtain the\nrequisite approvals, or the failure of the parties to otherwise satisfy the\nconditions to or complete the Arrangement, may result in the Arrangement\nnot being completed on the proposed terms, or at all. In addition, if the\nArrangement is not completed, the announcement of the Arrangement and the\ndedication of substantial resources of the Company to the completion of the\nArrangement could have a material adverse impact on the Company's share\nprice, its current business relationships and on the current and future\noperations, financial condition and prospects of the Company. When relying\non forward-looking statements to make decisions, investors and others\nshould carefully consider the foregoing factors and other uncertainties and\npotential events. Readers are cautioned that the foregoing list of factors\nis not exhaustive. Additional information on these and other factors that\ncould affect the Company's operations or financial results are included in\nreports on file with applicable securities regulatory authorities and may\nbe accessed through the SEDAR website (www.sedar.com).\n\n     The forward-looking statements in this press release are made as of\nthe date it was issued and the Company does not undertake any obligation to\nupdate publicly or to revise any of the included forward-looking\nstatements, whether as a result of new information, future events or\notherwise, except as required by applicable law. By their very nature,\nforward-looking statements involve inherent risks and uncertainties, both\ngeneral and specific, and risks that outcomes implied by forward-looking\nstatements will not be achieved. The Company cautions readers not to place\nundue reliance on these statements.\n\n     Neither the TSX Venture Exchange nor its Regulation Services Provider\n(as that term is defined in the policies of the TSX Venture Exchange)\naccepts responsibility for the adequacy or accuracy of this press release.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134900766.MNPRE2134903490-15381020211216</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}