{"date": "2021-03-18 07:00:05+00:00", "ticker": "AAF", "mrkt_info": {"open": 82.2, "close": 87.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent ol{margin-bottom:0cm;}.storyContent ul{margin-bottom:0cm;}.storyContent .ad{margin:72.0pt 72.0pt 72.0pt 72.0pt;}.storyContent p.av{margin:0cm;margin-bottom:.0001pt;text-autospace:none;font-size:11.0pt;font-weight:bold;}.storyContent span.at{font-size:10.0pt;}.storyContent p.aw{margin:0cm;margin-bottom:.0001pt;text-autospace:none;font-size:11.0pt;font-weight:bold;text-align:center;}.storyContent p.ax{margin:0cm;margin-bottom:.0001pt;text-autospace:none;font-size:11.0pt;text-align:center;}.storyContent p.a,.storyContent li.a,.storyContent div.a{margin:0cm;margin-bottom:.0001pt;text-autospace:none;font-size:11.0pt;}.storyContent p.ay{margin-right:0cm;margin-left:0cm;font-size:12.0pt;text-align:justify;}.storyContent span.ap{font-size:10.0pt;}.storyContent p.az{margin-right:0cm;margin-left:0cm;font-size:12.0pt;font-weight:bold;text-align:justify;}.storyContent p.ba{margin-right:0cm;margin-left:0cm;font-size:12.0pt;margin-left:36.0pt;text-align:justify;text-indent:-18.0pt;}.storyContent span.am{font-size:10.0pt;}.storyContent span.ak{font-size:10.0pt;}.storyContent p.bb{margin-right:0cm;margin-left:0cm;font-size:11.0pt;margin:0cm;margin-bottom:.0001pt;text-align:justify;}.storyContent span.bc{font-size:10.0pt;font-weight:bold;}.storyContent span.bd{font-size:10.0pt;}.storyContent table.be{margin-left:-5.4pt;border-collapse:collapse;}.storyContent td.ag{width:214.6pt;padding:0cm 5.4pt 0cm 5.4pt;}.storyContent p.bf{margin-right:0cm;margin-left:0cm;font-size:12.0pt;font-weight:bold;text-align:justify;}.storyContent p.bg{margin-right:0cm;margin-left:0cm;font-size:12.0pt;text-align:justify;}.storyContent span.ae{font-size:10.0pt;}</style><div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><div style=\"text-align:left;font-size:10pt\"><div>RNS Number : 6381S</div>  <div>Airtel Africa PLC</div>  <div>18 March 2021</div>  <div> </div></div>\n<div class=\"ad\">\n<p class=\"av\"><span class=\"at\"> </span></p>\n<p class=\"aw\"><span class=\"at\">THIS ANNOUNCEMENT CONTAINS INSIDE INFORMATION</span></p>\n<p class=\"aw\"><span class=\"at\"> </span></p>\n<p class=\"aw\"><span class=\"at\">Airtel Africa plc</span></p>\n<p class=\"ax\"><span class=\"at\"> </span></p>\n<p class=\"ax\"><span class=\"at\">(\"Airtel Africa\", or the \"Group\")</span></p>\n<p class=\"a\"><span class=\"at\"> </span></p>\n<p class=\"aw\"><span class=\"at\">The Rise Fund to invest $200 million in Airtel Africa's mobile money business,<br/>\nat $2.65 billion valuation. </span></p>\n<p class=\"aw\"><span class=\"at\">Airtel Africa to explore potential listing of mobile money business within four years.</span></p>\n<p class=\"ax\"><span class=\"at\"> </span></p>\n<p class=\"ax\"><span class=\"at\"> </span></p>\n<p class=\"ay\"><span style=\"font-weight:bold\"><span class=\"ap\">London and Lagos, 18 March 2021: </span></span><span class=\"at\">Airtel Africa, a leading provider of telecommunications </span><span class=\"ap\">and mobile money services, with a presence in 14 countries across Africa, today announces the signing of an agreement under which The Rise Fund, the global impact investing platform of leading alternative investment firm TPG, will invest $200 million in Airtel Mobile Commerce BV (\"AMC BV\"), a wholly owned subsidiary of Airtel Africa plc (the \"Transaction\")</span><span class=\"at\">. </span><span class=\"at\">AMC BV is currently the holding company for several of Airtel Africa's mobile money operations; and is now intended to own and operate the mobile money businesses across all of Airtel Africa's fourteen operating countries. </span></p>\n<p class=\"ay\"><span class=\"ap\">The Transaction values Airtel Africa's mobile money business at $2.65 billion on a cash and debt free basis. The Rise Fund will hold a minority stake in AMC BV upon completion of the Transaction, with Airtel Africa continuing to hold the remaining majority stake. The Transaction is subject to customary closing conditions including necessary regulatory filings and approvals, as necessary, and the inclusion of specified mobile money business assets and contracts into AMC BV. </span></p>\n<p class=\"ay\"><span class=\"ap\">The Transaction is the latest step in the Group's pursuit of strategic asset monetization and investment opportunities, and i</span><span class=\"at\">t is the aim of Airtel Africa to explore the potential listing of the mobile money business within four years. </span><span class=\"ap\">The Group is in discussions with other potential investors in relation to possible further minority investments into Airtel Money, up to a total of 25% of the issued share capital of AMC BV. There can be no certainty that a transaction will be concluded or as to the final terms of any transactions.</span></p>\n<p class=\"ay\"><span class=\"ap\">The proceeds from the Transaction will be used to reduce Group debt and invest in network and sales infrastructure in the respective operating countries. </span></p>\n<p class=\"ay\"><span class=\"ap\"> </span></p>\n<p class=\"az\"><span class=\"ap\">Airtel Africa mobile money services</span></p>\n<p class=\"ay\"><span class=\"ap\">Operating under the Airtel Money brand, Airtel Africa's mobile money services is a leading digital mobile financial services platform catering to a large addressable market in Africa (characterised by limited access to formal financial institutions with limited banking infrastructure) and includes mobile wallet deposit and withdrawals, merchant and commercial payments, benefits transfers, loans and savings, virtual credit card and international money transfers.</span></p>\n<p class=\"ay\"><span class=\"ap\">Mobile money services are available across the Group's 14 countries of operation, however in Nigeria the Group offers Airtel Money services through a partnership with a local bank and has applied for its own mobile banking licence. It is the intention that all mobile money operations will be owned and operated by AMC BV.</span></p>\n<p class=\"ay\"><span class=\"ap\">In our most recent reported results for Q3, the mobile money service segment (corresponding to all the businesses that are intended to be transferred to AMC BV) delivered a strong operational performance:</span></p>\n<p class=\"ba\"><span class=\"am\">·      </span><span class=\"at\">Generated revenue of $110 million ($440 million annualised), and underlying EBITDA of<br/>\n$54 million ($216 million annualised) at a margin of 48.7%. </span></p>\n<p class=\"ba\"><span class=\"am\">·      </span><span class=\"at\">Year on year revenue growth for the quarter was 41.1% in constant currency, largely driven by 29% growth in the customer base to 21.5 million, and 9.7% ARPU growth.</span></p>\n<p class=\"ba\"><span class=\"am\">·      </span><span class=\"at\">Growth in transaction value was 53.0% to $12.8 billion ($51 billion annualised). </span></p>\n<p class=\"ay\"><span class=\"ap\"> </span></p>\n<p class=\"ay\"><span class=\"ap\">Our mobile money business benefits from strong network presence with our core telecom business through the extensive distribution platform of kiosks and mini shops as well as dedicated Airtel Money branches supplementing our extensive agent network, to facilitate customers' assured wallet and cash.</span></p>\n<p class=\"ay\"><span class=\"ap\">We have a clear strategy to continue to drive sustainable long-term growth in Airtel Money with a focus on assured float availability, distribution expansion and increased usage cases for our customers. </span></p>\n<p class=\"ay\"><span class=\"ap\">In this year alone we have added partnerships with Mastercard, Samsung, Asante, Standard Chartered Bank, MoneyGram, Mukuru and WorldRemit to expand both the range and depth of the Airtel Money offerings and to further drive customer growth and penetration.</span></p>\n<p class=\"ay\"><span class=\"ap\">The profits before tax in the full year ending 31 March 2020 and the value of gross assets as of that date, attributable to the mobile money businesses were $143.4 million and $463.2 million, respectively.</span></p>\n<p class=\"ay\"><span class=\"ap\"> </span></p>\n<p class=\"az\"><span class=\"ap\">Key elements of the Transaction</span></p>\n<p class=\"ba\"><span class=\"am\">·      </span><span class=\"at\">Agreement values Airtel Africa's mobile money business at $2.65 billion on a cash and debt free basis.</span></p>\n<p class=\"ba\"><span class=\"am\">·      </span><span class=\"at\">AMC BV, a wholly owned subsidiary of Airtel Africa, </span><span class=\"ap\">is currently the holding company for several of Airtel Africa's mobile money operations; and is now intended to own and operate the mobile money businesses across all of Airtel Africa's fourteen operating countries once the inclusion of the </span><span class=\"ak\">remaining mobile money operations under AMC BV is completed.</span></p>\n<p class=\"ba\"><span class=\"am\">·      </span><span class=\"at\">A newly incorporated investment vehicle of The Rise Fund will invest $200 million through a secondary purchase of shares in AMC BV from Airtel Africa. The transaction will close in two stages. $150 million will be invested at first close, once the transfer of sufficient mobile money operations and contracts into AMC BV has been completed, with $50 million to be invested at second close upon further transfers.</span></p>\n<p class=\"ba\"><span class=\"am\">·      </span><span class=\"at\">Airtel Africa aims to explore the potential listing of the mobile money business within four years. Under the terms of the Transaction, and in very limited circumstances (in the event that there is no Initial Public Offering of shares in AMC BV within four years of first close, or in the event of changes of control without TPG's prior approval), TPG would have the option, so as to provide liquidity to them, to sell its shares in AMC BV to Airtel Africa or its affiliates at fair market value (determined by a mutually agreed merchant bank using an agreed internationally accepted valuation methodology). The option is subject to a minimum price equal to the consideration paid by The Rise Fund for its investment (less the value of all distributions and any proceeds of sale of its shares, and with no time value of money or minimum return built in) and a maximum number of shares in AMC BV such that the consideration does not exceed $400 million. </span></p>\n<p class=\"ay\"><span class=\"ap\">The Transaction is expected to reach first close over the next three to four months. From first close The Rise Fund will be entitled to appoint a director to the board of AMC BV and to certain customary information and minority protection rights.</span></p>\n<p class=\"ay\"><span class=\"ap\"> </span></p>\n<p class=\"bb\"><span class=\"bc\">Raghunath Mandava, CEO of Airtel Africa, commented:</span></p>\n<p class=\"ay\">\"<span class=\"ap\">In line with our vision of enhancing financial inclusion, Airtel Africa offers a unique digital mobile financial services platform under the Airtel Money brand. In most of our markets there is limited access to traditional financial institutions, and little banking infrastructure, with less than half of the population having a bank account across sub-Saharan Africa. Our markets therefore afford substantial market potential for mobile money services to meet the needs of the tens of millions of customers in Africa who have little or no access to banking and financial services, and this demand is driving growth. </span></p>\n<p class=\"ay\"><span class=\"ap\">With today's announcement we are pleased to welcome The Rise Fund as an investor in our mobile money business and as a partner to help us realise the full potential from the substantial opportunity to bank the unbanked across Africa</span>.\"</p>\n<p class=\"ay\"><span class=\"bd\"> </span></p>\n<p class=\"ay\"><span class=\"bc\">Yemi Lalude, Partner at TPG who leads Africa investing for The Rise Fund, added:</span></p>\n<p class=\"ay\"><span class=\"ap\">\"Financial inclusion is a global issue that is most acute in Africa. Through Airtel Money, Airtel Africa has built a unique platform that is closing the gap between traditional financial institutions and the millions of unbanked Africans across the 14 countries where Airtel Africa operates. We look forward to working with Airtel Africa to enhance their mobile money services, broaden its use cases, and grow into new markets. With this investment in Airtel Africa's mobile money operations, we are excited to expand The Rise Fund's global fintech portfolio and continue to deepen our focus on improving financial inclusion in Africa and around the world.\" </span></p>\n<p class=\"ay\"><span class=\"bd\"> </span></p>\n<p class=\"aw\"><span class=\"at\">-ENDS-</span></p>\n<p class=\"aw\"><span class=\"at\"> </span></p>\n<p class=\"av\"><span class=\"at\">Enquiries</span></p>\n<p class=\"av\"><span class=\"at\"> </span></p>\n<div class=\"story-table-container\"><table cellpadding=\"0\" cellspacing=\"0\" class=\"be\">\n<tbody>\n<tr>\n<td class=\"ag\" style=\"width:286\">\n<p class=\"av\"><span class=\"at\">Airtel Africa - Investor Relations</span></p>\n<p class=\"a\"><span class=\"at\">Pier Falcione</span></p>\n<p class=\"a\"><span class=\"at\">Morten Singleton</span></p>\n<p class=\"a\"><span><span class=\"at\"><a href=\"mailto:Investor.relations@africa.airtel.com\" data-type=\"email\" translate=\"no\">Investor.relations@africa.airtel.com</a></span></span></p>\n</td>\n<td class=\"ag\" style=\"width:286\">\n<p class=\"a\"><span class=\"at\">+44 207 493 9315</span></p>\n</td>\n</tr>\n<tr>\n<td class=\"ag\" style=\"width:286\">\n<p class=\"av\"> </p>\n</td>\n<td class=\"ag\" style=\"width:286\">\n<p class=\"av\"> </p>\n</td>\n</tr>\n<tr>\n<td class=\"ag\" style=\"width:286\">\n<p class=\"av\"><span class=\"at\">Hudson Sandler</span></p>\n<p class=\"a\"><span class=\"at\">Nick Lyon</span></p>\n<p class=\"a\"><span class=\"at\">Bertie Berger</span></p>\n<p class=\"a\"><span><span class=\"at\"><a href=\"mailto:airtelafrica@hudsonsandler.com\" data-type=\"email\" translate=\"no\">airtelafrica@hudsonsandler.com</a></span></span></p>\n</td>\n<td class=\"ag\" style=\"width:286\">\n<p class=\"a\"><span class=\"at\">+44 207 796 4133</span></p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p class=\"bf\"><span class=\"ap\"> </span></p>\n<p class=\"bg\"><span class=\"ap\">The person responsible for making this announcement is Simon O'Hara, Group Company Secretary.</span></p>\n<p class=\"bf\"><span class=\"ap\"> </span></p>\n<p class=\"bf\"><span class=\"ap\">About Airtel Africa</span></p>\n<p class=\"ay\"><span class=\"ap\">Airtel Africa is a leading provider of telecommunications and mobile money services, with a presence in 14 countries in Africa, primarily in East Africa and Central and West Africa.</span></p>\n<p class=\"ay\"><span class=\"ap\">Airtel Africa offers an integrated suite of telecommunications solutions to its subscribers, including mobile voice and data services as well as mobile money services, both nationally and internationally.</span></p>\n<p class=\"ay\"><span class=\"ap\">The Group aims to continue providing a simple and intuitive customer experience through streamlined customer journeys. </span></p>\n<p class=\"ay\"><span class=\"ap\">For more information visit </span><span class=\"at\"><a href=\"http://www.airtel.africa.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.airtel.africa</a></span></p>\n<p class=\"bf\"><span class=\"ap\">About The Rise Fund</span></p>\n<p class=\"ay\"><span class=\"ap\">The Rise Fund is the world's largest global impact platform committed to achieving measurable, positive social and environmental outcomes alongside competitive financial returns. </span></p>\n<p class=\"ay\"><span class=\"ap\">With more than $5 billion in assets under management across its platform, The Rise Fund works with growth-stage, high potential, mission-driven companies that have the power to change the world. Headquartered in San Francisco, The Rise Fund was founded in 2016 to deliver deep expertise in business solutions to help achieve the United Nations' Sustainable Development Goals. </span></p>\n<p class=\"ay\"><span class=\"ap\"> </span></p>\n<p class=\"ay\"><span class=\"ap\"> </span></p>\n<p class=\"ay\"><span class=\"ap\">As part of TPG, The Rise Fund offers investment resources, business-building skills, rigorous measurement and a global network to help portfolio companies accelerate growth and impact. With the ability to invest across a wide variety of sectors and countries at scale, The Rise Fund focuses on opportunities in education, energy, food and agriculture, financial technology, healthcare and technology.</span></p>\n<p class=\"ay\"><span class=\"ap\">For more information visit </span><span class=\"ae\"><a href=\"http://www.therisefund.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.therisefund.com</a></span><span class=\"at\"> </span><span class=\"at\">or </span><span class=\"ap\"><a href=\"http://www.instagram.com/therisefund\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@therisefund</a></span><span class=\"at\"> on Instagram.</span></p>\n</div>\n<div style=\"text-align:left;font-size:10pt\"><div>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a>.<br/><br/>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a>.</div><div> </div>  END</div><div> </div><div> </div>AGRFDLLFFXLZBBB</div>"}