{"date": "2022-01-24 19:39:22.181000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Reinsurance Group of America (RGA) has launched its FAC Optimization solution featuring Amazon Textract, a machine learning service from Amazon Web Services (AWS) that uses optical character recognition (OCR) to extract text, handwriting, and data from scanned documents.</p><p>By integrating machine learning, state-of-the-art OCR, and natural language processing (NLP) technology into the underwriting process, RGA is continuing to find ways to innovate underwriting and risk selection by augmenting its already industry-leading facultative underwriting process.RGA is the worldwide leader in facultative reinsurance, or individual large-case underwriting and substandard risk assessment. Now through the addition of OCR, a form of AI that can find patterns and images, and NLP, which can mine text for sequences of words, information can be digitized and converted into a more concise, easily understandable format to assist underwriters.\"RGA has always been deeply committed to innovation, and in line with that commitment, we are at the forefront of incorporating emerging technologies in our underwriting operations,\" said Dave Rengachary, Senior Vice President, Head of Underwriting, U.S. Mortality Markets, RGA. \"Our FAC Optimization solution creates meaningful efficiencies in the underwriting process enabling RGA to make the best and most competitive offers to our clients, which saves them time and allows them to write more business.\"  \"RGA is using AWS machine learning technologies to reduce friction in the underwriting process for its clients,\" said Tony Jacob, Global Business Development Lead for the Insurance Industry at AWS. \"RGA's use of Amazon Textract in their FAC Optimization solution will help make the underwriting processes more efficient, but more importantly, the solution will enable RGA to deliver more accurate and timely insurance quotes and improve the customer experience.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}