{"date": "2022-02-03 14:57:04+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3023.87, "close": 2776.91}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>PLANTABLE HEALTH INC (\"PLBL-Z\")\n- Bolsters Executive Team To Foster Growth and Expansion\n\n   Plantable Health Inc. (\"Plantable\" or the \"Company\"), a leader in\nclinically-supported holistic healthcare programs that leverage behavioural\ncoaching, immersive software and whole food plant-based nutrition today\nannounced key additions to its executive team as the Company embarks on its\naggressive growth strategy.\n\nPlantable\n\n   To view an enhanced version of this graphic, please visit:\n<a href=\"https://orders.newsfilecorp.com/files/8118/112650_fc03b277a48ab9e5_001full\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://orders.newsfilecorp.com/files/8118/112650_fc03b277a48ab9e5_001full</a>.\njpg\n\n   The new team members include:\n\n//st\n\n* Richard Lee, who has been appointed Chief Financial Officer (CFO),\n  effective February 1st, 2022, replacing Alex McAulay who will be\n  transitioning out of the Company to pursue new opportunities.\n* Published author Matt Siegel who joins as the Head of Communication &amp;\n  Content to enhance premium subscriber content and consumer facing\n  marketing initiatives.\n* Elisa Udaskin, a Director of Plantable's Board, who will assume\n  additional responsibilities and become the Chief Marketing Officer (CMO),\n  leading the Company's marketing strategy and brand development.\n\n//et\n\n   \"With our IPO successfully behind us, Plantable has been able to add\nexceptional skill to its executive team to support our next phase of\ngrowth,\" said CEO Dr. Nadja Pinnavaia. \"Rick, Matt and Elisa are excellent\nadditions to the company who all bring tremendous value and expertise from\ntheir extensive and relevant former careers. By strengthening our team with\nthese remarkable leaders, we are confident in our ability to continue to\nlead in the alternative healthcare sector as we work towards optimizing\nhealth and well-being.\"\n\n   &amp;#8203;&amp;#8203;In addition, the Company has granted an aggregate of\n600,000 incentive stock options to certain officers, directors and other\neligible persons of the Company. The options are exercisable, subject to\nvesting provisions, over a period of ten years at a price of $0.40 per\nshare.\n\n   Executive Backgrounds\n\n   Richard Lee is a graduate of the University of British Columbia with a\nBachelor's degree in Commerce. In addition, he is a Chartered Professional\nAccountant, Certified Management Accountant having obtained his designation\nin 1991. Richard has spent more than 30 years working for public accounting\nfirms or for companies that trade on recognized stock exchanges. He has\ngained a wealth of experience in corporate finance, acquisitions and\naccounting while working with and for public companies trading in Canada as\nwell as registered with the SEC in the United States.\n\n   Matt Siegel is an acclaimed author and former English professor, who has\nwritten about food and culture for publications including The Wall Street\nJournal, Eater, The Atlantic, and The Paris Review. His first book, The\nSecret History of Food: Strange but True Stories About the Origins of\nEverything We Eat, was published in 2021 by HarperCollins/Ecco and selected\nas an Editor's Pick by Amazon.\n\n   Elisa Udaskin is an accomplished senior brand marketer and\ncollaborative, inspirational leader with 20 years of experience driving top\nline growth and bottom line efficiencies both globally and locally through\nsound strategic planning and innovation. Elisa's marketing career at Kraft\nFoods and Mondelez International spanned traditional profit and loss\nmanagement, innovation, customer relationship management and corporate\npartnerships in Canada, the US, Singapore and globally. She has spearheaded\ncorporate initiatives partnering with nonprofit organizations throughout\nher career. After leaving Mondelez International in 2016, Elisa has since\nbecome an author and motivational speaker through her book \"Be A Mensch:\nUnleash Your Power to Be Kind and Help Others\".\n   About Plantable Health Inc.\n\n   Plantable is a clinically supported lifestyle change program that\ncombines behavioral psychology, neuroscience and nutritional science to\ntransform health and wellness. Plantable drives healthy weight loss and an\nimprovement in performance, health and well-being by bringing together\nplant-based meals, personalized coaching support and lifestyle tools to\nempower people to change their dietary habits. To view the Company's\nproducts and become a customer, click the link here: <a href=\"https://plantable.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://plantable.com</a>\n\n   If you are interested in investing in the Company and would like more\ninformation, click the link here: <a href=\"http://invest-plantable.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://invest-plantable.com</a>\n\n   Become a part of the Plantable investor community on WhatsApp by joining\nthe link here: <a href=\"https://chat.whatsapp.com/CNupoG2sVitJRhzpfGJGHt\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://chat.whatsapp.com/CNupoG2sVitJRhzpfGJGHt</a>\n\n   On behalf of the Board of Directors,\n\n   Dr. Nadja Pinnavaia\nChief Executive Officer\n\n   For investor inquiries please contact:\n\n   Olenka Slawski\nCorporate Communications and Investor Relations\nEmail: Invest@plantable.com\nPhone: 778-200-4926\n\n   Cautionary Note Regarding Forward-Looking Information\n\n   Certain statements contained in this news release constitute\nforward-looking statements as defined under applicable securities laws. All\nstatements in this news release, other than statements of historical facts,\nthat address events or developments that management of the Company expect,\nare forward-looking statements. Specifically, the references in this news\nrelease to the benefits the Company expects to gain from the appointment of\nnew executive team members constitute forward-looking statements.\nForward-looking statements are based on a number of assumptions and are\nsubject to a number of risks and uncertainties, many of which are beyond\nthe Company's control, that could cause actual results and events to differ\nmaterially from those that are disclosed in or implied by such\nforward-looking statements, see \"Notice to Investors - Forward-Looking\nInformation\" and \"Risk Factors\" in the Prospectus. The Company disclaims\nany intention or obligation to update or revise any forward-looking\nstatements, whether as a result of new information, future events or\notherwise, save and except as may be required by applicable securities\nlaws.\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203300339.MNPRE2203301615-06555220220203</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}