{"date": "2021-12-16 19:47:57.667000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3466.3, "close": 3400.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_h53hwyzo&amp;referenceId=1_h53hwyzo&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_h53hwyzo&amp;referenceId=1_h53hwyzo&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: Wall Street bankers are set for a windfall after a record year of dealmaking. Goldman Sachs, JPMorgan and peers have more flowing into the bonus pool. But as fintech and crypto firms poach talent, banks may need to keep the riches flowing even in lesser years, John Foley argues.<br/>Short Link: <a href=\"https://refini.tv/3dYExE6\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3dYExE6</a><br/><br/>Video Transcript:<br/><br/>Big banks are planning astronomical bonuses this year. It may be hard to bring them back down to Earth. As a rule, when Wall Street does well that Wall Street bankers do well. And bonus season for deal advisors and traders at the US banks is going to be a windfall this year. Goldman Sachs and JPMorgan are two that are already considering raising the size of the pot the dole out to their investment bankers. The danger is that these lucky recipients get too used to the generosity. Because Wall Street tends to pay based on performance, pay goes up pretty much mathematically when revenue does, which isn't so much the case of other kinds of company like, say, Wal-Mart or Amazon.com. So, for example, Goldman's revenue is up around 31% year-on-year in 2021 to-date. And the amount it's put aside for pay is up 34%. When you look back over the past decade or so, those two numbers - pay and revenue - tend to move instead. Last year was an exception for most banks because mostly pay went up less than revenue. Maybe that was an attempt not to appear too greedy when the world was in the throws of a pandemic. Two things though suggest the pay is going to keep going up. One is that bank bosses are again being lavished with awards. Look at Goldman Sachs Chief Executive David Solomon. He took a $10 million pay cut at the beginning of 2021 and then got a $30 million equity bonus just a couple of months ago. JPMorgan Chief Operating Officer Daniel Pinto also just got a $25 million incentive package. More junior employees who see that kind of generosity are understandably going to assume that some of those riches will come their way too. Meanwhile, the biggest threat when it comes to banks, certainly to pouching their talent, is fintech and crypto firms. And that threat is not going to ease off. Even if bank profits fall next year, which means that pay should too, opportunities for ambitious bankers to work in new industries are only going to get more enticing. So, shrinking bonus pool on Wall Street could be exactly what the new breed of financial upstarts needs.   <br/></span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}