{"date": "2021-03-07 06:24:09+00:00", "ticker": "AVV", "mrkt_info": {"open": 3341.0, "close": 3454.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Dubai, UAE:</strong> AVEVA, a global leader in engineering and industrial software, has been selected as one of the top ‘Channel Influencers of the Year’ by the editors at Channel Partners and Channel Futures in the annual 2021 Channel Influencer Awards. AVEVA was recognized for dedication to its channel business and for the focus on sustainability to drive innovation and business outcomes. The annual Channel Influencer Awards celebrate people, organizations, technology and trends that have made an impact on the Channel globally, especially during the pandemic.</p>\n<p>AVEVA’s focus is on emerging technologies, such as artificial intelligence (AI), Cloud, digital twin, visualization, and data &amp; analytics, which are helping organizations make impactful changes to improve the environment while also meeting business goals. AVEVA’s software enables the design and management of complex industrial assets like power and chemical plants, water treatment facilities and food and beverage factories – deploying IIoT strategies, big data, and AI to digitally transform industries.</p>\n<p>Kerry Grimes, Head of Global Partners at AVEVA, said, “It is a great honor to be recognized for our relentless efforts in championing pioneering technologies that help make industrial companies sustainable and also author robust business outcomes for our network of channel partners. Our goal is to empower partners to help their customers achieve their ever-evolving digital business goals. Our recently launched partner program, AVEVA Select, enables our channel ecosystem to gain complete access to AVEVA’s comprehensive portfolio, empowering them to build capabilities and capitalize on the digital future.”</p>\n<p>AVEVA Select aligns to both market and technology trends, offering programs designed to suit every product and solution specialization in the engineering and industrial segments. By leveraging the breadth of AVEVA’s software portfolio, AVEVA Select partners can now help their customers simplify design and optimize opportunities, and also maximize performance.</p>\n<p>The AVEVA Partner Network has over 5,000 members providing opportunities for alliances, systems integrators, distributors, solution providers, and technology partners to actively engage and participate in the AVEVA community. With AVEVA Select, partners access the entire AVEVA portfolio through the channel that they have known and trusted, often for as long as 30 years.</p>\n<p>\"As we put the wheels in motion for our strategy for 2021 and beyond, we can see that we are well on track to meet our ambitious business goals and this would not be possible without the collaboration of our channel partners. We look forward to working even more closely with our partners and continuing to support them as their customers navigate the path to digital transformation,” Grimes concluded.</p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}