{"date": "2022-02-04 16:40:08.464000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2776.91, "close": 3158.71}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_pb6myi3g&amp;referenceId=1_pb6myi3g&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_pb6myi3g&amp;referenceId=1_pb6myi3g&amp;pageId=RefinitivNewscasts</a></pre>Source: IG Group<br/><br/>Description: Q4 earnings beat all the forecasts at Amazon and so powerful was the move is turned one of the worst days on the Nasdaq in 2 years into profit.<br/>Short Link: <a href=\"https://refini.tv/3J4NkSw\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3J4NkSw</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; The Internet giant, Amazon was one of the big stock stories after the close of Wall Street markets on Thursday evening. And in fact, what Amazon did was, it actually steered the post-market trade in the whole of the Nasdaq. So powerful was this move after the session last night, what caused it? The company came through with earnings, but I think beyond earnings, one of the big messages that Amazon has sent out is that it is raised, its popular Prime membership in US dollar is gone up from $119-$139 a year. Due in part, the company says to a rise in wages and transportation costs in its logistics network. But I think beyond this, it was also the big rise in earnings that was unexpected that saw the stock up. Let's take a look at where we were as at the closed last night and then this big move up. Now these are hourly candles. So you can see clearly the point at which Wall Street closed out and the point at which the company produced earnings is big rise in the price of Amazon stock, adjusted earnings per share coming at $5.80, we've been looking for $3.57 sources way above what had been expected. Revenue came in as expected at $137 billion for the fourth quarter. Web services revenue coming in better than expected. So all is adding up to a very positive performance. Since then and indeed at the start of today's all sessions trade on the IG platform. You can trade this out of hours on IG. You've seen a little bit of a pullback in the markets, but most of this game has been seen to be sustained. And I think this is really going to drive the Nasdaq at the start of today's session as well. This is the daily chart for the Nasdaq and it's on the way down at the moment. But if you look at this on an hourly chart as well, you can see clearly the performance that Amazon gave this index bouncing off the 200 period moving average. So the Nasdaq will open stronger on from the closed last night driven mostly by that rise in Amazon stock. For more videos from us here at IGTV join us on Twitter at IGcom, Instagram, and subscribe to our YouTube channel.<br/></span></div></div></div></div>"}