{"date": "2021-11-19 11:43:17.259000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3549.0, "close": 3676.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Global strike action is being taken against <a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> on its infamous Black Friday sale to demand the shopping giant provide better treatment to its employees.</p><p>The 'Make Amazon Pay' <a href=\"https://www.independent.co.uk/topic/coalition\" data-type=\"url\" class=\"tr-link\" translate=\"no\">coalition</a> , which includes over 70 <a href=\"https://www.independent.co.uk/topic/trade-unions\" data-type=\"url\" class=\"tr-link\" translate=\"no\">trade unions</a> , civil society organisations, environmentalists and tax watchdogs including UNI Global Union, Progressive International, <a href=\"https://www.independent.co.uk/topic/oxfam\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Oxfam</a> , <a href=\"https://www.independent.co.uk/topic/greenpeace\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Greenpeace</a> , and Amazon Workers International, will take action in 20 countries on 26 November.</p></div><div class=\"tr-npp-body\"><p>Make Amazon Pay will also use eight locations – including a Latin American oil refinery, a trucking depot in Europe, and a supply chain factory in Asia – to demonstrate what it describes as \"the depth of Amazon's abuse and the scale and unity of resistance to it.\"</p><p>\"On global action days like Black Friday, we are seeing how the movement pushing to change the rules of our economy and challenge corporate power is growing bolder and stronger,\" Christy Hoffman, UNI Global Union's General Secretary, said.</p><p>\"More and more people are asking more questions about Amazon ́s brutal anti-union behaviour, antisocial tax-dodging practices and obsession with control.\"</p><p>\"As we are seeing all over the world, workers – whether they are coders, pickers, drivers or UX designers – are marching, striking and raising their voices together to demand the dignity and respect that comes with a union. Solidarity doesn't scare easily, and Amazon will not break workers' alliances.\"</p><p>Casper Gelderblom, Make Amazon Pay coordinator at the Progressive International, also added: \"From natural resource extraction, to manufacturing; from shipping and storing products around the world to delivering them to consumers; from controlling untold amounts of data and management to influencing our governments: Amazon takes workers, people and the planet for a ride.\"</p><p>GMB union national officer Mick Rix said that further actions and protests will be conducted at the company's UK facilities, to demand \"the pandemic profiteer provides safer and better work, higher pay, and allows our union to organise workers without interference.\"</p><p>The coronavirus pandemic reportedly <a href=\"https://www.independent.co.uk/news/world/americas/coronavirus-jeff-bezos-amazon-net-worth-online-shopping-a9465856.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">boosted the net worth of American billionaire Jeff Bezos – the founder and former CEO of Amazon</a> – <a href=\"https://www.independent.co.uk/news/world/americas/coronavirus-jeff-bezos-amazon-net-worth-online-shopping-a9465856.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">by $24bn (£19bn)</a> as many were forced to shop online in lieu of access to physical retail.</p><p>\"These groups represent a variety of interests, and while we are not perfect in any area, if you objectively look at what Amazon is doing in each one of these areas you'll see that we do take our role and our impact very seriously\", an Amazon spokesperson told <span>The Independent</span> .</p><p>\"We are inventing and investing significantly in all these areas, playing a significant role in addressing climate change with the Climate Pledge commitment to be net zero carbon by 2040, continuing to offer competitive wages and great benefits, and inventing new ways to keep our employees safe and healthy in our operations network, to name just a few. Anyone can see for themselves by taking a live virtual tour at our sites.\"</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/independentpremium/business/amazon-visa-mastercard-retail-payment-fees-b1959395.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon kicking out Visa credit cards over charges: A case of Thanos v Magneto?</a> </p><p><a href=\"https://www.independent.co.uk/independentpremium/business/march-muses-diverse-black-christmas-decorations-b1958510.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">How March Muses is bringing diversity to your Christmas tree</a> </p><p><a href=\"https://www.independent.co.uk/news/business/news/greggs-vegan-sausage-rolls-disruption-b1959452.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Supply crisis hits Greggs vegan sausage rolls</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Independent, The (UK) (Online). All rights reserved.</p></div>"}