{"date": "2021-11-17 05:06:07+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n      Learn how Amazon's new packaging for frozen and chilled foods is curbside recyclable and is helping Amazon Fresh and Whole Foods Market customers reduce waste.\n    </div>\n              <div>\n                <p>\n        As the leader of Amazon's grocery business, and as a mom who frequently has her family's groceries delivered via Amazon Fresh and Whole Foods Market, I love the convenience, speed, and selection of being able to order my groceries online. At the same time, I'm committed to continuing to drive innovation around the packaging that comes with these groceries, to make even more of it easily recyclable for customers.\n      </p>\n                <div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/sustainability/shop-from-over-200-000-climate-pledge-friendly-products-on-amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Shop from over 200,000 Climate Pledge Friendly products on Amazon</a>\n                    </span>\n                  </div>\n                  <div>\n          Amazon's Climate Pledge Friendly program continues to grow, bringing more sustainable products to customers in the U.S. and Europe.\n        </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/sustainability/shop-from-over-200-000-climate-pledge-friendly-products-on-amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read more</a>\n                    </span>\n                  </div>\n                </div>\n                <p>\n        That's why I'm excited to share an update on a new packaging solution we've been working on for a while-and to take you behind the scenes with one of the Amazon managers who led the project.\n      </p>\n                <p>\n        Rolling out just in time for Thanksgiving, Amazon's new packaging is made from recycled paper and is curbside recyclable. Whether customers are <span><a href=\"https://www.amazon.com/fmc/m/30002252?almBrandId=QW1hem9uIEZyZXNo\" data-type=\"url\" class=\"tr-link\" translate=\"no\">ordering</a></span>turkey, green beans, or frosty pints of ice cream, chilled and frozen foods from Amazon Fresh and Whole Foods Market will arrive insulated in packaging that is easy and convenient for customers to recycle at home.\n      </p>\n                <p>\n        Moving to all curbside-recyclable insulation packaging reduces material waste and each year replaces approximately 735,000 pounds of plastic film, 3.15 million pounds of natural cotton fiber, and 15 million pounds of non-recyclable mixed plastic. The new packaging is also produced regionally in the U.S., enabling us to deliver it to Amazon Fresh grocery hubs, stores, and Whole Foods Market locations with fewer miles traveled across the supply chain.\n      </p>\n                <div>\n                  <span>\n                    <a href=\"https://assets.aboutamazon.com/15/bf/869a060a4d22acb503bf3e10fcf1/bettertomorrow-1-edit.jpg\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Download this image.</a>\n                  </span>\n                </div>\n                <p>\n        I'm excited and optimistic about the feedback we're hearing from customers. One customer shared with us this great sentiment: \"<span>Absolutely LOVEEEE the new cold foods packaging you are using! Prefer it over the non-recyclable 'cooler bags.' And my food was just as cold! Thank you for taking care of our environment.\"</span></p>\n                <p>\n        This new packaging is just the latest step in Amazon's commitment to both <span><a href=\"https://sustainability.aboutamazon.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Climate Pledge</a></span>, a bold commitment to be net-zero carbon across our business by 2040, and to building a sustainable business for our employees, customers, and the planet. We couldn't have done it without Joe Rake, who spearheaded the new project while a senior program manager on the grocery delivery packaging team.\n      </p>\n                <p>\n        I recently sat down to talk with Rake, who shared some great behind-the-scenes insights about the project that I want to share with you. We know that addressing the global crisis of climate change will take a combination of big, bold commitments <span>and</span> everyday actions. We're doing both as we build an environmentally sustainable business and support the communities where we live and work.\n      </p>\n                <h4>\n        How would you describe the problem we were trying to solve for customers?\n      </h4>\n                <p>\n        We have long wanted to find a more sustainable solution for the plastic liners and bubble bags that are often used to insulate chilled and frozen items. The criteria for any new packaging solution came down to five key considerations. First, and probably the most obvious, we wanted to ensure the packaging maintained product chill chain and Amazon's high bar for food safety.\n      </p>\n                <div>\n                  <div>\n                    <span>\n                      <a href=\"https://assets.aboutamazon.com/30/8f/ac4984dd42bea281b051eb064749/bettertomorrow-2.jpg\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Download this image.</a>\n                    </span>\n                  </div>\n                  <div>\n                    <span>\n                      <a href=\"https://assets.aboutamazon.com/f0/86/90de13154fd6ad57a8cb3ec46427/bettertomorrow-3-edit.jpg\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Download this image.</a>\n                    </span>\n                  </div>\n                </div>\n                <p>\n        Second, the packaging needed to be small, compact, and flexible for our delivery drivers. Think of it as fitting multiple grocery bags into the trunk of a Prius, so switching to stiff cardboard boxes for insulation wouldn't work. Although they'd maintain food-safe temperatures, boxes would take up more room, which would mean fewer grocery deliveries per vehicle, ultimately resulting in more vehicles-and carbon emissions.\n      </p>\n                <p>\n        The third major consideration was that any new packaging needed to be easily recyclable-as in, customers could leave it with the rest of their curbside recyclable material. Fourth, it also needed to be inexpensive and scalable because we wanted to continue to ensure that Amazon's grocery delivery offerings were widely accessible for customers.\n      </p>\n                <p>\n        And finally, we wanted to generate less overall packaging for customers. We are continually inventing new packaging solutions, and sometimes the simplest action is to use less of it, especially when Mother Nature provides her own \"chill chain\" in colder months.\n      </p>\n                <h4>\n        How did you and the team go about getting started?\n      </h4>\n                <p>\n        We started by taking a lot of inspiration from past <span><a href=\"https://sustainability.aboutamazon.com/environment/circular-economy/packaging\" data-type=\"url\" class=\"tr-link\" translate=\"no\">sustainable packaging innovations</a></span>at Amazon. Our teams are constantly working on ways to minimize waste, increase recycling, and provide options for customers to reuse, repair, and recycle their products. The goal is to send less material to the landfill and more back into the circular economy loop.\n      </p>\n                <div>\n                  <span>\n                    <a href=\"https://assets.aboutamazon.com/c3/66/8797b1674d1fa594e9fcb17fba5f/bettertomorrow-4-edit.jpg\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Download this image.</a>\n                  </span>\n                </div>\n                <p>\n        We also built on the progress we'd already made with grocery delivery packaging. In 2018, we introduced frozen water bottles as an alternative to frozen gel packs to provide a grocery insulation solution that's widely recyclable or reusable by our customers. That step had a similar ethos to what we were looking to do with this new packaging initiative. And then in 2019, we started investigating a solution for the plastic liners and bubble-bag insulation. Nothing on the market was able to meet our physical, thermal, and sustainable design criteria, which started us on our journey to develop a solution ourselves.\n      </p>\n                <p>\n        After a lot of rigorous testing and customer feedback, we landed on a version of recycled paper tissue layering that's relatively common in the moving and packing industry but that we reinvented for our grocery delivery customers.\n      </p>\n                <h4>\n        How did you test the product and gather customer feedback?\n      </h4>\n                <p>\n        We tested the thermal effectiveness of the all-recyclable paper solution in our internal thermal labs, as well as in multiple external labs in North America and Europe, to validate it met the needs of our delivery chill chain. The chill chain is the process of keeping frozen foods frozen, and refrigerated products chilled, at the correct temperature until the end of a customer's delivery window.\n      </p>\n                <p>\n        In this controlled environment, we tested worst-case scenarios in temperature barriers and how changing the thickness, or \"wadding,\" of the packaging would affect the outcome of the results. Once we started seeing consistent results in the lab, we moved to the pilot stage in 2020. We conducted pilots in multiple cities and under a variety of temperature scenarios.\n      </p>\n                <p>\n        At the same time, as we slowly rolled this out, our food safety team conducted secret-shopper programs to validate the thermal effectiveness of the packaging. We also paid very close attention to customer feedback along with employee feedback on how to best pack orders using the new packaging.\n      </p>\n                <h4>\n        Why is this packaging unique to the grocery delivery industry?\n      </h4>\n                <p>\n        As the leader of grocery delivery, we recognized an urgent need to find sustainable solutions that can eliminate hard-to-recycle materials-and we are proud to be focused on scaling these solutions. This recyclable packaging will hopefully inspire others, both at Amazon and elsewhere, to continue finding creative, sustainable solutions for customers and communities around the world.\n      </p>\n                <p>\n                  <span>\n                    <a href=\"https://sustainability.aboutamazon.com/environment/circular-economy/packaging\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Learn more about Amazon's efforts to improve our packaging and reduce waste.</a>\n                  </span>\n                </p>\n              </div>\n              <div>\n                <div>\n        Related Tags\n      </div>\n                <div>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/amazon-fresh\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Fresh</a>\n                  </span>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/physical-retail\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Physical retail</a>\n                  </span>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/sustainability\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Sustainability</a>\n                  </span>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/shopping\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Shopping</a>\n                  </span>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/retail/grocery-delivery-just-got-more-sustainable-with-amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>17 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>17 November 2021 05:06:07 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}