{"date": "2021-11-16 23:42:43.063000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>GOOD FLOUR CORP (\"GFCO-Z\")\n- Provides Corporate Overview\n\n     The Good Flour Corp. (\"GFCO\") is pleased to provide an overview of\nGFCO's corporate strategy and near term business objectives. GFCO recently\ncommenced trading on the Canadian Securities Exchange following the\nacquisition (the \"Transaction\") of VGAN Brands Inc. and Nextjen Gluten-Free\n(collectively referred to as the \"Company\").\n\n     Market Overview\n\n     Consumer tastes are changing. Globally all major food staple markets\nhave been disrupted - meat products, dairy (milk, cheese, yogurt) and\nprepared foods. Recently there has been a significant focus on the global\nvegan products market which has an estimated size of US$14.7 billion\n(Source: August 19, 2021 Press Release from Research and Markets). There\nremains a food staple market that is 10 times the size of the global vegan\nmarket that has not yet been disrupted. This market is the global wheat\nflour market which reached an estimate value of US$160 Billion in 2020\n(Source: July 9, 2021 Press Release from Research and Markets).\n\n     The Company's mission is to disrupt the US$160 billion global flour\nindustry with its range of gluten-free, allergen-free, and additive-free\nbaking mixes for retail and food service customers. Gluten-free and\nallergen-free foods are part of a growing under-tapped global market.\n\n//st\n\n* 10 priority allergens cause over 90% of all adverse food reactions\n  (Source: Health Canada)\n* Almost half of all children suffer from food allergies (Source: American\n  Academy of Allergy Asthma and Immunology)\n* 1 in 4 people have a food sensitivity -28% of the population suffer from\n  some form of food intolerance with lactose and gluten being the two most\n  common (Source: US Food and Drug Administration)\n* 55 diseases are reported to improve on a gluten-free diet such as autism,\n  diabetes, celiac disease, multiple sclerosis and most other autoimmune\n  diseases (Source: New England Journal of Medicine)\n\n//et\n\n     The Products\n     With the acquisition of Nextjen Gluten-Free, the Company provides a\nrange of gluten-free &amp; allergen-free products for retail &amp; food service.\nThese products have been developed to allow individuals with gluten and\nother food allergies to enjoy life without giving up their favorite foods\nor settling for low-quality alternatives. Simply put, \"Flour\" but good for\nyou. The products which have been developed over the last decade include:\nAll-purpose baking flour; Pizza &amp; pasta flour; Tempura batter mix; Fish &amp;\nchips batter mix; Fried chicken mix; Pancake &amp; waffle mix; Vanilla bean\ncake mix; and Pizza shells.\n\n     The Company's products are trusted by some of the most notable names\nin food service and are available to consumers at Canadian retailers. Food\nservice accounts include Panago Pizza, Earls, Fairmont Hotels, Four Seasons\nHotels and Virtuous Pie. Broadline food distributors include Sysco and\nGordon Food Service. Retailers include Amazon, Choices Markets, Nesters,\nIGA and Whole Foods.\n\n     In the Company's mission to reach an even larger audience with\nNextjen's creations, the Company is relaunching these superior mixes under\nThe Good Flour Co. brand with the vision of putting them next to every\nboring old gluten-filled yellow bag on the shelves.\n\nImage 1\n\n     To view an enhanced version of Image 1, please visit:\n<a href=\"https://orders.newsfilecorp.com/files/4789/103689_0f58849254220aab_002full\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://orders.newsfilecorp.com/files/4789/103689_0f58849254220aab_002full</a>.\njpg.\n\n     Production Expansion\n\n     There has always been a significant demand for the Company's products,\nbut supply and manufacturing constraints have hindered the Company's\nability to scale its production. Following the recent completion of the\nTransaction, one of the first initiatives of the Company is to\nsignificantly expand its production capacity. A new 8,000 square foot\nfacility has been secured in Burnaby, British Columbia, and the Company is\nin the final stages of acquiring an automated production line that will\ndramatically increase its production of both retail and food service\nproduct lines by a magnitude of eight-fold. This will allow the Company to\nmeet the significant demand for its products, and to take on a focused\ndistribution initiative with its experienced management team.\n\n     The Company anticipates the automated production facility will be\noperational in the second calendar quarter of 2022. Once operational, the\nCompany expects that a single shift will be able to generate an annual $5\nmillion retail value in product with a single daily shift and an annual $10\nmillion retail value in product with two daily shifts. This assumes a\nproduct mix consisting of food service bags and retail bags and does not\ninclude additional retail value from the production of frozen pizza shells.\nThe Company is also evaluating partnering with co-packers in North America\nto provide additional production capacity.\n\n     Founders &amp; Management\n     The Company is managed by the founders of Nextjen Gluten-Free and an\nexperienced executive team:\n\n     Chef Jen Peters (Founder) - Chef Peters honed her skills as a protege\nof Chef Bruno Marti, the beloved godfather of fine dining cuisine in\nCanada. With Chef Marti's guidance, Jen developed an uncompromising\ndedication to high-quality food ingredients. She then worked and trained in\nMichelin-starred restaurants in England. After returning home to Vancouver,\nBC and discovering she was gluten intolerant, she was determined to find a\nway to keep delicious breads, scones, and pastas in her life. In 2012, Jen\nfinally perfected her recipe and founded Nextjen Gluten-Free with her\npartner, Chef Hamid Salimian.\n\n     Chef Hamid Salimian (Founder) - Chef Salimian has a 30-year career in\nthe hospitality industry as a top executive chef in Vancouver's fine dining\nrestaurants and an international award-winning culinary competitor. He is\nthe co-founder of NextJen Gluten-Free and jointly manages this successful\ngluten-free food production company with his partner. Hamid continues to be\na member of the culinary development team for a large restaurant chain with\n67 locations across North America and an annual revenue of over $270\nmillion. Three years ago, he joined a group of top BC chefs to create, open\nand run two new restaurants on Granville Island, PopinaCanteen and\nPopinaCantina. Hamid is also a full time Culinary Arts Instructor at\nVancouver Community College (VCC) and created a modern cooking course for\nprofessional chefs.\n\n     Matthew Clayton (Chief Executive Officer) - Over the last twenty-three\nyears, Matthew's career has been spent developing, building, and managing\npublic and private companies across North America. He has spent focused\nsegments of his professional life in; nutritional sciences, sport\nsupplements, organic skincare, craft beverages, rapid diagnostic testing,\ntransportation, and has consulted to First People's, and all levels of\ngovernment, and on recent energy related projects on the West Coast of\nCanada. Matthew has worked closely with regulatory bodies such as Health\nCanada, the U.S. Food &amp; Drug Administration, and various other agencies\nacross European Union countries.\n\n     Dean Golbeck (Chief Financial Officer) - Mr. Golbeck holds a Chartered\nAccountant designation (CPA, CA) with a Bachelor of Business Administration\nin Finance from Vancouver Island University. He started his career with a\nBig Four accounting firm where he worked on a mix of large public company\naudits and mid-market assurance and advisory services. In 2017, Mr. Golbeck\nachieved the Certificate of Completion for the CPA In-Depth Tax Course.\nShortly after, he moved to a mid-sized accounting firm where he focused on\ncorporate reorganizations and tax planning for high-net-worth individuals.\n\n     Molly Millar (VP Operations &amp; Marketing) - Ms. Millar brings several\nyears of experience working with growth-stage companies, focusing on\nmarketing, e-commerce, sales and operations. She is passionate about\nworking with small teams to help them develop and execute their brand\nvoice, as well as their sales &amp; marketing strategy. She holds a B.A. from\nthe University of British Columbia and is currently the Chair of the\nTransportation Advisory Committee for the City of Vancouver.\n\n     About The Good Flour Corp.\n\n     GFCO's mission is to provide a gluten-free, allergen free, hassle-free\nall-purpose baking flour blend that allows individuals with gluten and\nother food allergies to enjoy life without giving up their favorite foods\nor settling for low-quality alternatives. The Company also provides gluten\nand allergen free fried chicken batter, fish &amp; chip batter, pizza &amp; pasta\nmix, tempura batter, pancake and waffle blend, cake mix and pizza crusts.\n\n     For additional information on The Good Flour Corp. please refer to\nwww.goodflour.co.\n\n     Company Contact\n\n     info@goodflour.co\n604-568-1598\n\n     Cautionary Note Regarding Forward-Looking Information\n\n     This news release contains \"forward-looking information\" concerning\nanticipated developments and events related to the Company that may occur\nin the future. Forward-looking information contained in this news release\nincludes, but is not limited to, statements with respect to the Company's\nfuture business objectives, its ability to disrupt the global wheat flour\nmarket, product details, plans to expand production capacity and demand for\nthe Company's product.\n\n      In certain cases, forward-looking information can be identified by\nthe use of words such as \"expects\", \"intends\", \"anticipates\" or variations\nof such words and phrases or state that certain actions, events or results\n\"may\", \"would\", or \"might\" suggesting future outcomes, or other\nexpectations, assumptions, intentions or statements about future events or\nperformance. Forward-looking information contained in this news release is\nbased on certain factors and assumptions regarding, among other things, the\ntimely receipt of regulatory approvals; the ability to source ingredients;\nthe ability to attract qualified management and staff; the ability to\neffectively expand manufacturing and production capacity; the success of\nmarket initiatives and the ability to grow brand awareness; the ability to\nobtain retail partners to distribute Company's products; the ability to\nattract, maintain and expand relationships with key strategic restaurant\nand food service partners and the Company will continue to have access to\nfinancing until it achieves profitability. While the Company considers\nthese assumptions to be reasonable, they may be incorrect.\n\n     Forward-looking information involves known and unknown risks,\nuncertainties and other factors which may cause the actual results to be\nmaterially different from any future results expressed by the\nforward-looking information. Such factors include risks related to general\nbusiness, economic and social uncertainties; local and global market and\neconomic uncertainties arising in respect of the COVID-19 pandemic; risks\nassociated with supply chain for machinery and equipment; litigation,\navailability of key product ingredients; legislative, environmental and\nother judicial, regulatory, political and competitive developments; failure\nto effectively expand manufacturing and production capacity; the ability to\nobtain retail partners to distribute Company's products; failure to\nattract, maintain and expand relationships with key strategic restaurant\nand food service partners; changing consumer taste preferences; delay or\nfailure to receive regulatory approvals; the sufficiency of our cash to\nmeet liquidity needs; failure to attract qualified management and staff,\nlabour disputes; and the additional risks identified in the \"Risk Factors\"\nsection of the Company's filings with applicable Canadian securities\nregulators.\n\n     Although the Company has attempted to identify factors that could\ncause actual results to differ materially from those described in\nforward-looking information, there may be other factors that cause results\nnot to be as anticipated. Readers should not place undue reliance on\nforward-looking information. The forward-looking information is made as of\nthe date of this news release. Except as required by applicable securities\nlaws, the Company does not undertake any obligation to publicly update\nforward-looking information.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2131900501.MNPRE2131902114-06194820211116</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}