{"date": "2021-11-09 00:00:05.827000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><p>Expanded Marketing Strategy Deploying Robust Content Strategy, Social and Paid\r\nMedia to Drive Awareness and Educate Consumers</p><p class=\"line-break\"><br/></p><p>Vancouver, British Columbia--(Newsfile Corp. - November 8, 2021) - Rritual\r\nSuperfoods Inc. (CSE: RSF) (FSE: 0RW) (OTCQB: RRSFF) (\"Rritual\" or the\r\n\"Company\") is pleased to share highlights from the Company's expanded\r\nmarketing program,</p><p class=\"line-break\"><br/></p><p>\"This phase of Rritual's growth requires a highly coordinated and purposeful\r\nmarketing campaign to further establish the brand, build knowledge with\r\nconsumers regarding superfoods and their applications, building customer\r\nloyalty and driving sales,\" said Mr. Greg McCauley, Rritual Chief Operating\r\nOfficer. \"The new strategy is designed to support existing and new retailer\r\nlaunches, growing direct to consumer business through Rritual.com and\r\nAmazon.com, and the upcoming Canadian launch.\"</p><p class=\"line-break\"><br/></p><p>Rritual Marketing Program Highlights</p><p class=\"line-break\"><br/></p><p>Content Strategy and SEO</p><p class=\"line-break\"><br/></p><p>Rritual has made significant strides in editorial content found on the Journal\r\nof rritual.com focusing on key topics such as Usage, Education, and health\r\nRritual has been able to rank #1 and on the first page of Google for numerous\r\nkey topics, such as but not limited to:</p><ul class=\"bulleted-list arrowlist\"><li>How much lion's mane should I take?</li><li>How to use Chaga mushroom powders?</li><li>What is the best time to take lion's mane mushroom?</li><li>Top mushroom mycelium health benefits</li><li>Reishi mushroom benefits for skin</li><li>Chaga mushroom powder uses and benefits\r\nCreating engaging content that ranks highly on search engines is an important\r\ntactic the Company is deploying to engage direct to consumer customers and\r\nretail businesses educating potential customers who are interested in\r\nfunctional mushroom users. The content is designed to further connect with our\r\ncustomers on best uses of our products and to answer product questions, and as\r\nimportantly to have existing users of competing brands to understand Rritual's\r\nkey benefits and points of differentiation.</li></ul><p>Social Media</p><p class=\"line-break\"><br/></p><p>Rritual is continuing to create engaging content on Instagram, Facebook,\r\nTwitter, Tik Tok and Pinterest. Rritual is staying top of mind with awareness\r\ncampaigns on paid social, while deploying new tactics to engage new audiences\r\nsuch as Tik Tok and Instagram Reels. Rritual will continue to foster their\r\nsocial media content pillars which focus on Q&A about the functional food\r\nspace, recipes, education, mindfulness, motivation, and product explanation.\r\nRritual's community is increasing daily, and the steady stream of content is\r\nperforming well with its followers.</p><p class=\"line-break\"><br/></p><p>Rritual has had success with its macro influencer campaigns and looks to\r\npartner with MediaVine again in the future with a campaign dedicated to the\r\nCompany's Amazon store. Rritual's micro-influencer and affiliate strategy is\r\ngrowing steadily each week with over 70 micro influencers signed up to post\r\nregular content as an affiliate. Rritual should grow this to over 100 before\r\n2022. Rritual has seen positive engagement through social media contesting and\r\npartnerships with complimentary CPG goods such as Ethical Bean coffee and\r\nSproud plant Based milk. In addition, the Company has identified multiple\r\ncontest opportunities and social media partnerships, which are being lined up\r\nfor 2022.</p><p class=\"line-break\"><br/></p><p>Paid Media</p><p class=\"line-break\"><br/></p><p>Rritual is continuing its efforts to use keyword-specific research and\r\ngeo-targeting to target media as efficiently as possible. Rritual's paid media\r\nstrategy is targeting high-interest areas to support retail and direct to\r\nconsumers sales. Rritual is continuing to create new campaigns communicating\r\nits key benefits and targeting its core consumer.</p><p class=\"line-break\"><br/></p><p>Amazon</p><p class=\"line-break\"><br/></p><p>Rritual began its paid advertising campaigns on Amazon in Early September.\r\nRritual has continued to see steady growth in sales and new customer\r\nacquisition. Rritual's Amazon store is evolving with its Brand store and A+\r\ncontent launching in the immediate future. Rritual continues to see strong\r\ncustomer reviews on its products. Rritual is also seeing continued positive\r\ngrowth to its Amazon Return on Ad Spend (ROAS) making it a great opportunity\r\nfor future customer growth.</p><p class=\"line-break\"><br/></p><p>The Company is also pleased to announce it has granted a number of equity\r\nincentive awards (the \"Securities\") to certain directors, officers, and\r\nconsultants of the Company. In particular, an aggregate of 1,000,000\r\nrestricted share units (each, a \"RSU\") were granted to certain directors of\r\nthe Company pursuant to the Company's Omnibus Equity Incentive Plan (the\r\n\"Plan\"). Each RSU represents the right to receive, once vested, one common\r\nshare in the capital of the Company (each, a \"Share\"). The RSUs will vest as\r\nto the first 25% on the date which is six months from the date of grant and\r\n25% every six months thereafter until fully vested. In addition, the Company\r\ngranted 2,000,000 performance share units (each, a \"PSU\") to officers of the\r\nCompany pursuant to the Plan. Each PSU represents the right to receive, once\r\nvested, one Share. The PSUs will vest in accordance with certain milestones\r\nbased on the revenues of the Company. Finally, the Company granted an\r\naggregate of 4,200,000 stock options (each an \"Option\") to certain directors,\r\nofficers, and consultants of the Company. Each Option is each exercisable for\r\nthe purchase of one Share at an exercise price of $0.35 per Share until the\r\ndate which is five years from the date of issuance. An aggregate of 200,000 of\r\nthe Options issued to certain officers of the Company shall vest immediately\r\non the date of the issuance. An aggregate of 4,000,000 of the Options granted\r\nto certain directors and consultants of the Company shall vest as to the first\r\n25% on the date which is six months from the date of grant and 25% every six\r\nmonths thereafter until fully vested.</p><p class=\"line-break\"><br/></p><p>In accordance with the policies of the Canadian Securities Exchange, the\r\nSecurities issued to the directors and officers of Rritual are subject to a\r\nhold period of four months from the date of the distribution.</p><p class=\"line-break\"><br/></p><p>About Rritual</p><p class=\"line-break\"><br/></p><p>Rritual is a functional superfood company that creates plant-based elixirs,\r\nwhich support immunity, focus and relaxation. The company is poised to\r\ndominate a segment where demand and sales are growing exponentially. Under the\r\nexecutive leadership with over 100 years of CPG pedigree, Rritual is\r\npositioned as a leader in the functional health and wellness industry.\r\nRritual's superfood elixirs can be found online at <a href=\"https://www.rritual.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rritual.com</a>.</p><p class=\"line-break\"><br/></p><p>Follow Rritual on Twitter (<a href=\"https://www.newsfilecorp.com/redirect/aVw7rtoxRe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.newsfilecorp.com/redirect/aVw7rtoxRe</a>),\r\nLinkedIn (<a href=\"https://www.newsfilecorp.com/redirect/2JKqEfvaVQ\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.newsfilecorp.com/redirect/2JKqEfvaVQ</a>), Facebook\r\n(<a href=\"https://www.newsfilecorp.com/redirect/MZOmASXOJv\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.newsfilecorp.com/redirect/MZOmASXOJv</a>), and Instagram\r\n(<a href=\"https://www.newsfilecorp.com/redirect/bAbeVHz8bJ\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.newsfilecorp.com/redirect/bAbeVHz8bJ</a>).</p><p class=\"line-break\"><br/></p><p>For further information please contact:</p><p class=\"line-break\"><br/></p><p>Warren Spence - Chief Executive Officer and Director\r\nInvestor Relations:\r\n<br/>E-mail: <a href=\"mailto:investors@wearerritual.com\" data-type=\"email\" translate=\"no\">investors@wearerritual.com</a></p><p class=\"line-break\"><br/></p><p>Telephone: (778) 400-1242</p><p class=\"line-break\"><br/></p><p>Functional Foods Market</p><p class=\"line-break\"><br/></p><p>According to Grandview Research*, it is estimated that the global functional\r\nfood market is projected to reach $275 billion by 2025, growing at 7.9% each\r\nyear with consumers putting more emphasis on health and wellness.</p><p class=\"line-break\"><br/></p><p>*<a href=\"https://www.grandviewresearch.com/press-release/global-functional-foods-market\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.grandviewresearch.com/press-release/global-functional-food...</a></p><p class=\"line-break\"><br/></p><p>Neither the Canadian Securities Exchange nor its Regulation Services Provider\r\n(as that term is defined in the policies of the Canadian Securities Exchange)\r\naccepts responsibility for the adequacy or accuracy of this release.</p><p class=\"line-break\"><br/></p><p>Forward-Looking Information</p><p class=\"line-break\"><br/></p><p>This news release contains forward-looking statements and forward-looking\r\ninformation within the meaning of Canadian securities legislation\r\n(collectively, \"forward-looking statements\") that relate to Rritual's current\r\nexpectations and views of future events. Any statements that express, or\r\ninvolve discussions as to, expectations, beliefs, plans, objectives,\r\nassumptions or future events or performance (often, but not always, through\r\nthe use of words or phrases such as \"will likely result\", \"are expected to\",\r\n\"expects\", \"will continue\", \"is anticipated\", \"anticipates\", \"believes\",\r\n\"estimated\", \"intends\", \"plans\", \"forecast\", \"projection\", \"strategy\",\r\n\"objective\" and \"outlook\") are not historical facts and may be forward-looking\r\nstatements and may involve estimates, assumptions and uncertainties which\r\ncould cause actual results or outcomes to differ materially from those\r\nexpressed in such forward-looking statements. No assurance can be given that\r\nthese expectations will prove to be correct and such forward-looking\r\nstatements included in this news release should not be unduly relied upon.\r\nThese statements speak only as of the date of this news release. In particular\r\nand without limitation, this news release contains forward-looking statements\r\nrelating to the Company's plans to leverage third party manufacturing and\r\nlogistics, the Company's broader retail distribution plans and the Company's\r\nother plans, focus and objectives.</p><p class=\"line-break\"><br/></p><p>Forward-looking statements are based on a number of assumptions and are\r\nsubject to a number of risks and uncertainties, many of which are beyond\r\nRritual's control, which could cause actual results and events to differ\r\nmaterially from those that are disclosed in or implied by such forward-looking\r\nstatements. Such risks and uncertainties include, but are not limited to, the\r\nimpact and progression of the COVID-19 pandemic and other factors set forth\r\nunder \"Forward-Looking Statements\" and \"Risk Factors\" in the final long form\r\nprospectus of the Company dated February 26, 2021 and available under the\r\nCompany's profile on SEDAR at <a href=\"https://www.sedar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.sedar.com</a>. Rritual undertakes no obligation\r\nto update or revise any forward-looking statements, whether as a result of new\r\ninformation, future events or otherwise, except as may be required by law. New\r\nfactors emerge from time to time, and it is not possible for Rritual to\r\npredict all of them or assess the impact of each such factor or the extent to\r\nwhich any factor, or combination of factors, may cause results to differ\r\nmaterially from those contained in any forward-looking statement. Any\r\nforward-looking statements contained in this news release are expressly\r\nqualified in their entirety by this cautionary statement.</p><p class=\"line-break\"><br/></p><p class=\"line-break\"><br/></p><p>To view the source version of this press release, please visit\r\n<a href=\"https://www.newsfilecorp.com/release/102522\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.newsfilecorp.com/release/102522</a></p></div>"}