{"date": "2022-01-13 15:11:29.769000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3307.24, "close": 3224.28}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>FOUNDER SPAC (\"FOUN-Q\")\n- Rubicon Acquires CIVIX, a Routing Software and Solutions Company\n\n     Rubicon Technologies, LLC (\"Rubicon\" or the \"Company\"), an innovative\nsoftware leader that provides smart waste and recycling solutions for\nbusinesses and governments worldwide, today announced that it has acquired\nCIVIX LLC (\"CIVIX\"), a routing software and solutions company based out of\nFreiburg, Germany. The acquisition expands and enhances the routing\ncapabilities of Rubicon's flagship software products for municipal and\nprivate fleets, RUBICONSmartCity(TM) and RUBICONPro(TM), while also helping\nto drive Rubicon's growth into additional international markets.\n\n     Founded in 1999, CIVIX is the developer of the market-leading\nFleetRoute(R) route optimization and strategic planning software and\nassociated technologies for data collection, in-cab navigation,\ndispatching, tracking, performance monitoring, and messaging. FleetRoute's\ngeographic information system (GIS) and cloud-based route optimization\nsoftware is used to solve the most complex high-density routing problems\nthrough advanced network algorithms developed specifically for the\nmunicipal services, utility, and street surveying industries. With\ncustomers in North America, Europe and the Middle East, FleetRoute's book\nof business includes local governments, councils and municipalities;\nprivate companies and corporations; public utilities; and federal and\nregional government agencies. In addition to CIVIX's full suite of route\noptimization services, it also provides operational consulting services as\npart of its offering.\n\n     As part of the acquisition, the President of CIVIX, Dr. Paul\nPatterson, and his team have joined Rubicon.\n\n     \"On behalf of our team, we are thrilled to have joined the Rubicon\nfamily to do our part in accelerating the Company's mission to end waste,\"\nsaid Dr. Patterson. \"Rubicon has partnered with FleetRoute for several\nyears, and now with this acquisition we will be able to directly integrate\nour best-of-breed technologies and leverage the synergies between them to\nbring our customers to new levels of efficiency and performance.\"\n\n     RUBICONSmartCity is a proprietary, cloud-based technology suite that\nhelps city governments run faster, smarter, and more effective waste,\nrecycling, and heavy-duty municipal fleet operations. RUBICONSmartCity\nhelps city governments ensure every resident's trash and recycling is\ncollected on their scheduled day, meaning no missed pickups. It also\ndocuments litter, bulky waste and illegal dumping with photos, thus\nensuring that these piles are cleaned up in a timely manner. It reduces\nrecycling contamination, so cities can sell their recyclable commodities\nfor as much money as possible, and it reduces the cost of collection by\nensuring trucks are taking the most efficient path to collect waste and\nrecycling. Finally, it also equips these vehicles, which go up and down\nevery street in every city at least once a week, with capabilities to look\nfor critical infrastructure and quality of life issues that can plague\ncommunities, helping our city partners deliver better public services\nacross all zip codes. RUBICONPro, a complementary product offering, helps\nprivate waste and recycling haulers deliver best-in-class customer service\nto commercial and residential customers through a similar feature set.\n\n     \"This acquisition will help Rubicon provide current and future public\nand private sector customers with an expanded level of service and will\nenhance our ability to deliver on the promise of creating more efficient,\neffective, and sustainable waste and recycling services for communities,\"\nsaid Michael Allegretti, Chief Strategy Officer at Rubicon. \"The addition\nof Paul and his experienced team to Rubicon brings a wealth of knowledge\nand expertise to our business as we expand to more and more fleets across\nNorth America and abroad.\"\n\n     RUBICONSmartCity has been rolled out in over 70 cities across the\nUnited States, including Asheville, NC; Baltimore, MD; Columbus, OH;\nDurham, NC; Fort Collins, CO; Fort Smith, AR; Glendale, AZ; Greenville, NC;\nHartford, CT; Kansas City, MO; Memphis, TN; Montgomery, AL; Santa Fe, NM;\nSan Antonio, TX; Savannah, GA; Spokane, WA; and Roseville, CA. The solution\nis available to purchase on Sourcewell, the Amazon Web Services (AWS)\nMarketplace, the HGACBuy consortium, and Marketplace.city.\n\n     About Rubicon\n\n     Rubicon is a Lexington, Kentucky-based software platform that provides\nsmart waste and recycling solutions for businesses and governments\nworldwide. Creating a new industry standard by using technology to drive\nenvironmental innovation, the Company helps turn businesses into more\nsustainable enterprises, and neighborhoods into greener and smarter places\nto live and work. Rubicon's mission is to end waste. It helps its partners\nfind economic value in their waste streams and confidently execute on their\nsustainability goals. Learn more at Rubicon.com.\n\n     Rubicon previously announced an agreement for a business combination\nwith Founder SPAC (Nasdaq: FOUN), which is expected to result in Rubicon\nbecoming a public company listed on the New York Stock Exchange (\"NYSE\")\nunder the new ticker symbol \"RBT\" in the second quarter of 2022, subject to\ncustomary closing conditions.\n\n     About Founder SPAC\n\n     Founder is a blank check company whose business purpose is to effect a\nmerger, capital stock exchange, asset acquisition, stock purchase,\nreorganization, or similar business combination with one or more\nbusinesses. While Founder is not limited to a particular industry or\ngeographic region, the company focuses on businesses within the technology\nsector, with a specific focus on the theme of Digital Transformation.\nFounder is led by CEO Osman Ahmed, CFO Manpreet Singh, and Executive\nChairman Hassan Ahmed. The company's independent directors include Jack\nSelby, Steve Papa, Allen Salmasi, and Rob Theis. Sponsor and advisor,\nNikhil Kalghatgi, leads the company's advisory board.\n\n     Forward-Looking Statements\n\n     This press release contains certain \"forward-looking statements\"\nwithin the meaning of the United States Private Securities Litigation\nReform Act of 1995, Section 27A of the Securities Act of 1933, as amended\n(the \"Securities Act\"), and Section 21E of the Securities Exchange Act of\n1934, as amended. All statements other than statements of historical fact\ncontained in this press release, including statements as to future results\nof operations and financial position, revenue and other metrics, planned\nproducts and services, business strategy and plans, objectives of\nmanagement for future operations of Rubicon, market size and growth\nopportunities, competitive position and technological and market trends,\nare forward-looking statements. Some of these forward-looking statements\ncan be identified by the use of forward-looking words, including \"may,\"\n\"should,\" \"expect,\" \"intend,\" \"will,\" \"estimate,\" \"anticipate,\" \"believe,\"\n\"predict,\" \"plan,\" \"targets,\" \"projects,\" \"could,\" \"would,\" \"continue,\"\n\"forecast\" or the negatives of these terms or variations of them or similar\nexpressions. All forward-looking statements are subject to risks,\nuncertainties, and other factors which could cause actual results to differ\nmaterially from those expressed or implied by such forward-looking\nstatements. All forward-looking statements are based upon estimates,\nforecasts and assumptions that, while considered reasonable by Founder and\nits management, or Rubicon and its management, as the case may be, are\ninherently uncertain and many factors may cause the actual results to\ndiffer materially from current expectations, which include, but are not\nlimited to: 1) the occurrence of any event, change or other circumstance\nthat could give rise to the termination of the merger agreement with\nrespect to the business combination; 2) the outcome of any legal\nproceedings that may be instituted against Rubicon, Founder, the combined\ncompany or others following the announcement of the business combination\nand any definitive agreements with respect thereto; 3) the inability to\ncomplete the business combination due to the failure to obtain the approval\nof the shareholders of Founder or Rubicon, or to satisfy other conditions\nto the closing of the business combination; 4) changes to the proposed\nstructure of the business combination that may be required or appropriate\nas a result of applicable laws or regulations or as a condition to\nobtaining regulatory approval of the business combination; 5) the ability\nto meet NYSE's listing standards following the consummation of the business\ncombination; 6) the risk that the business combination disrupts current\nplans and operations of Rubicon as a result of the announcement and\nconsummation of the business combination; 7) the inability to recognize the\nanticipated benefits of the business combination, which may be affected by,\namong other things, competition and the ability of the combined company to\ngrow and manage growth profitably, maintain relationships with customers\nand suppliers and retain its management and key employees; 8) costs related\nto the business combination; 9) changes in applicable laws or regulations;\n10) the possibility that Rubicon or the combined company may be adversely\naffected by other economic, business and/or competitive factors; 11)\nRubicon's estimates of its financial performance; 12) the risk that the\nbusiness combination may not be completed in a timely manner or at all,\nwhich may adversely affect the price of Founder's securities; 13) the risk\nthat the transaction may not be completed by Founder's business combination\ndeadline and the potential failure to obtain an extension of the business\ncombination deadline if sought by Founder; 14) the impact of the novel\ncoronavirus disease pandemic, including any mutations or variants thereof,\nand its effect on business and financial conditions; 15) the inability to\ncomplete the PIPE investment in connection with the business combination;\nand 16) other risks and uncertainties set forth in the sections entitled\n\"Risk Factors\" and \"Cautionary Note Regarding Forward-Looking Statements\"\nin Founder's  registration statement on Form S-4, to be filed with the\nSecurities and Exchange Commission (the \"SEC\")  (the \"Registration\nStatement\"), and other documents filed by Founder from time to time with\nthe SEC. These filings identify and address other important risks and\nuncertainties that could cause actual events and results to differ\nmaterially from those contained in the forward-looking statements. Nothing\nin this press release should be regarded as a representation by any person\nthat the forward-looking statements set forth herein will be achieved or\nthat any of the contemplated results of such forward-looking statements\nwill be achieved. You should not place undue reliance on forward-looking\nstatements, which speak only as of the date they are made. Neither Founder\nnor Rubicon gives any assurance that either Founder or Rubicon or the\ncombined company will achieve its expected results. Neither Founder nor\nRubicon undertakes any duty to update these forward-looking statements,\nexcept as otherwise required by law.\n\n     Additional Information and Where to Find It\nThe proposed transactions will be submitted to Founder's shareholders for\ntheir consideration and approval at a special meeting of shareholders. In\nconnection with the proposed transactions, Founder will file a Registration\nStatement, which will include a preliminary proxy statement / consent\nsolicitation statement / prospectus in connection with Founder's\nsolicitation  of proxies for the vote by Founder's shareholders in\nconnection with the proposed transactions and other matters described in\nsuch Registration Statement, as well as the prospectus relating to the\noffer of the securities to be issued to Rubicon's shareholders in\nconnection with the completion of the proposed transaction. After the\nRegistration Statement has been declared effective, Founder will mail a\ndefinitive proxy statement / consent solicitation statement / prospectus\nand other relevant documents to its shareholders as of the record date\nestablished for voting on the proposed transactions. Investors and security\nholders of Founder are advised to read the preliminary proxy statement and\nany amendments thereto, and, when available, the definitive proxy\nstatement, in connection with Founder's solicitation of proxies for its\nspecial meeting of shareholders to be held to approve the proposed\ntransaction because the proxy statement / consent solicitation statement /\nprospectus will contain important information about the proposed\ntransaction and the parties to the proposed transaction.\n\n     Investors and security holders will be able to obtain free copies of\nthe Registration Statement, the proxy statement / consent solicitation\nstatement / prospectus and all other relevant documents filed or that will\nbe filed with the SEC by Founder through the website maintained by the SEC\nat www.sec.gov.\n\n     The documents filed by Founder with the SEC also may be obtained free\nof charge at Founder's website at <a href=\"https://www.thefounderspac.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.thefounderspac.com</a> or upon\nwritten request to 800 Capital Street, Suite 2400, Houston, TX 77002.\n\n     NEITHER THE SEC NOR ANY STATE SECURITIES REGULATORY AGENCY HAS\nAPPROVED OR DISAPPROVED THE TRANSACTIONS DESCRIBED IN THIS PRESS RELEASE,\nPASSED UPON THE MERITS OR FAIRNESS OF THE BUSINESS COMBINATION OR RELATED\nTRANSACTIONS OR PASSED UPON THE ADEQUACY OR ACCURACY OF THE DISCLOSURE IN\nTHIS PRESS RELEASE. ANY REPRESENTATION TO THE CONTRARY CONSTITUTES A\nCRIMINAL OFFENSE.\n\n     Participants in the Solicitation\n\n     Founder and Rubicon and their respective directors and executive\nofficers may be deemed to be participants in the solicitation of proxies\nfrom Founder's shareholders in connection with the proposed transactions.\nFounder's shareholders and other interested persons may obtain, without\ncharge, more detailed information regarding the directors and executive\nofficers of Founder in the Registration Statement to be filed with the SEC.\nInformation regarding the persons who may, under SEC rules, be deemed\nparticipants in the solicitation of proxies from Founder's shareholders in\nconnection with the proposed business combination will be set forth in the\nRegistration Statement.\n\n     No Offer or Solicitation\n\n     This press release is not intended to and does not constitute an offer\nto sell or the solicitation of an offer to buy, sell or solicit any\nsecurities or any proxy, vote or approval, nor shall there be any sale of\nsecurities in any jurisdiction in which such offer, solicitation or sale\nwould be unlawful prior to registration or qualification under the\nsecurities laws of such jurisdiction. No offer of securities shall be\ndeemed to be made except by means of a prospectus meeting the requirements\nof Section 10 of the Securities Act. founder_logo\n\nTel   : 713-651-2600    FOUNDER SPAC\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201200719.MNPRE2201201961-06540020220113</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}