{"date": "2022-02-08 23:32:27+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n                  <span>More than 530 families from eight native communities belonging to the Indigenous Association for the Development of the Marañón River (Aidema) and adjacent to Section I of the North Peruvian Pipeline (ONP), benefited from the awareness and vaccination campaign against Covid 19 carried out by the Regional Health Directorate (Diresa) of Loreto, the Nauta Health Network and the Maypuco Health Micronetwork, which had the logistical support of PETROPERÚ.</span>\n                </p>\n                <p>\n                  <span>Residents of the San Antonio, San Antonio I Zone, 6 de Mayo, Urarinas, Santa Teresa, Nueva Alianza, Chanchamayo, Monterrico and Vista Alegre communities participated in the event; those that are located in the Urarinas district, province and department of Loreto.</span>\n                </p>\n                <p>\n                  <span>PETROPERÚ facilitated the transfer of health personnel by air and river to the communities, as well as providing support with their lodging and food. Thus, spaces for dialogue were established that made it possible to bring positions closer to the indigenous peoples and make them aware of the importance of immunization and achieve the consequent vaccination of their inhabitants.</span>\n                </p>\n                <p>\n                  <span>In this way, the state company once again demonstrated its concern for the well-being of the communities near its operations and ratified its commitment to promoting health care for the population living in vulnerable areas of the Amazon, a task that will continue to support future medical campaigns.</span>\n                </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.petroperu.com.pe/english/petroperu-continues-to-support-the-vaccination-against-covid-19-in-the-amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>PETROPERÚ - Petróleos del Perú SA</strong> published this content on <strong>07 February 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>08 February 2022 23:32:27 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - PETROPERÚ - Petróleos del Perú SA</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: PETROPERÚ---Petróleos-del-Perú-SA</p></div>"}