{"date": "2021-11-30 23:21:50.870000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Bangkok</p><p>THAILAND'S majority state-owned energy giant PTT could soon be better known abroad for its cappuccinos and espressos, rather than its petroleum products and exploration activities.</p></div><div class=\"tr-npp-body\"><p>PTT Oil and Retail Business (PTTOR) - the retail arm of PTT - recently announced plans to expand its international Cafe Amazon outlets to 1,000 by 2025, or a trebling of its current global presence.</p><p>\"Our ambition is to become a global brand,\" PTTOR said in a written response to The Business Times.</p><p>In February this year, PTTOR listed on the Stock Exchange of Thailand, raising US$1.57 billion in one of the largest initial public offerings in the country's history.</p><p>Jungle-themed Cafe Amazon outlets have been a familiar sight at PTT petrol stations in Thailand since the coffee shop chain was launched back in 2002, as part of an effort to boost PTTOR's on-site non-petrol sales and keep motorists awake at the wheel.</p><p>Petrol and coffee have proven to be a good market mix, stock analysts say.</p><p>Cafe Amazon sales contributed around 15 per cent of PTTOR's operating profit in 2019 and 2020, while PTTOR itself contributes 10-15 per cent to PTT's overall operating profit, and these percentages are growing, according to Bualuang Securities.</p><p>\"Coffee chains are valuable to petrol service stations,\" said Lertchai Kocharoenrattanakul, a senior analyst at Fitch Ratings (Thailand). \"When you operate a petrol station, you need to increase the non-oil revenue in order to improve your margin, because the margins on petrol service is very small,\" he said.</p><p>PTT, which operates about 2,367 petrol stations in Thailand - nearly 40 per cent of the total in South-east Asia's second-largest economy - is among several petroleum and energy conglomerates that have started their own coffee shop chains.</p><p>PTG Energy has the Punthai Coffee chain and Bangchak Corp has Inthanin, while Chevron has the Chaodoi Coffee chain.</p><p>But after 2 decades in the coffee business, and thanks to its 42 per cent share of the petrol station market, Cafe Amazon is by far the biggest coffee chain franchise in Thailand with 3,432 outlets. This also makes it the world's sixth largest coffee chain by number of outlets.</p><p>In South-east Asia as of June 2021, the chain has close to 300 outlets in Cambodia, China, Japan, Laos, Malaysia, Myanmar, Oman, the Philippines, Singapore and Vietnam.</p><p>Cafe Amazon first launched in Singapore in 2019. There are two stores currently - at Jewel Changi Airport and Republic Plaza. A branch at Jurong Point closed earlier this year.</p><p>While most Cafe Amazon outlets are wholly owned by PTTOR, about 20 per cent are franchised out to private operators.</p><p>Besides Thailand, PTTOR also operates PTT petrol stations in Cambodia, Laos and the Philippines, all of which have Cafe Amazon outlets as well.</p><p>PTTOR said its Cafe Amazon expansion overseas will depend on its ability to franchise and find new partners.</p><p>\"For new countries, many projects are in development with a number of partners, and this will be important for achieving our target of 1,000 outlets, PTTOR said.</p><p>Cambodia, Vietnam and China are the countries expected to have the highest growth potential for Cafe Amazon, the company said.</p><p>It has targeted total Cafe Amazon sales (both domestic and international) to reach US$1 billion by 2025, with the bulk of that generated in Thailand.</p><p>In Thailand, PTTOR has gone on a merger and acquisition spree to expand its food and beverage outlets at PTT stations as part of its \"Retailing Beyond Fuel\" strategy, following the success of Cafe Amazon in increasing its non-oil income.</p><p>PTT's Cafe Amazon push is part of the wider effort to diversify out of the high-carbon petroleum sector, which faces a questionable future amid rising global concerns about climate change and sustainability, analysts said.</p><p>\"Many large Thai oil companies now are thinking about the energy transition over the long term,\" said Fitch's Lertchai. \"They need to find other businesses in order to sustain their growth. PTT is not exceptional in this, and every oil company needs to do it too.\"</p><p>During the Covid-19 pandemic, PTTOR has purchased shares in Peaberry Thailand, which operates the premium Pocamara coffee brand; in Pluk Phak Praw Rak Mae, which operates Ohkajhu organic restaurants; Flash Express, an express delivery service to facilitate online deliveries; and Insub Global Cuisine, owner of the Kourn Sushi Bar chain.</p><p>This year, PTTOR will also add 100 electric vehicle (EV) charging outlets at PTT petrol stations in order to penetrate the lucrative EV market.</p><p>In May, PTT and Taiwan's Foxconn electronics manufacturer, announced plans to jointly manufacture EVs in Thailand. An agreement was signed in September to set up the EV joint venture, with an estimated investment of between US$1 billion and US$2 billion.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SPH</p></div>"}