{"date": "2021-12-02 16:17:12+00:00", "ticker": "ABDN", "mrkt_info": {"open": 239.0, "close": 233.9}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><span>\n              <p>LONDON, Dec 2 (IFR) - An eye-catching spread ensured strong demand for a €375m green Tier 2 from Austria's <strong>Uniqa Insurance Group</strong> on Thursday, while investment company <strong>abrdn</strong> set to work readying a pioneering Additional Tier 1 transaction. </p>\n              <p>Uniqa announced the mandate for its deal last Thursday, before the identification of the new Covid-19 variant Omicron triggered a major sell-off on Friday. Shockwaves continued to ripple through equity markets this week, but credit markets have regained some stability, eventually allowing the insurer to proceed.</p>\n              <p>Leads <span>JP Morgan</span> and <span>RBI</span> opened books for the 20-year non-call 10 transaction with initial price thoughts of mid-swaps plus 275bp area.</p>\n              <p>The spread was ultimately fixed at 235bp as demand surpassed €3bn, allowing the leads to upsize the deal to €375m from the expected €300m. </p>\n              <p>Bankers away from the leads said the deal, which is expected to be rated BBB by S&amp;P, offered a hefty premium, noting few similarly rated Tier 2 transactions trade much wider than 200bp. The final spread is the widest of any euro-denominated insurance Tier 2 this year. </p>\n              <p>Looking at the final outcome, some suggested the deal could have started at a tighter level but acknowledged that after the recent volatility a cautious approach was understandable. </p>\n              <p>\"It felt very generous to me,\" said one. \"At the same time, it is good they managed to tighten it, and if you want to do a trade at this time of year, you cannot take any chances and you need to be prepared to pay the price.\"</p>\n              <p>The deal was launched in conjunction with a capped tender offer for Uniqa's €350m 6.875% July 2043 non-call 2023 and €500m 6% July 2046 non-call 2026 Tier 2 notes. It announced on Thursday that €198.5m of the former and €101.5m of the latter had been validly tendered. </p>\n              <h3>Addtnl tr 1</h3>\n              <p>Abrdn is also set to test appetite for sub debt, having unveiled plans for a sub-benchmark sterling-denominated AT1 – a first from an investment company. </p>\n              <p>Abrdn, which changed its name from Standard Life Aberdeen earlier this year, announced the mandate on the same day as confirming it will buy online investment platform interactive investor for £1.49bn. It said the acquisition, which will be funded by available cash, will increase its assets under management fivefold to £69bn and more than double its revenue to £199m. </p>\n              <p>The AT1 is aimed at optimising abrdn's capital for new IFPR rules that will apply from January 1 2022.</p>\n              <p>The UK-based company has mandated <span>Barclays</span>, <span>Bank of America</span>, <span>HSBC </span>and <span>JP Morgan</span> to arrange investor calls starting on Thursday to market the perpetual non-call 5.5-year transaction. It is expected to be sized at £200m and is set to be launched early next week. </p>\n              <p>Bankers said the timing of the deal was not ideal, coming after substantial volatility in Tier 1 products and with the market shifting to a year-end footing. But some cited reasons for optimism in the secondary market, with AT1s having tightened as some buyers took opportunities to add after the recent repricing. </p>\n              <p>\"You can argue this doesn't suit the market, but look at the deals from Banco Sabadell and Deutsche Bank [last month] ... which came when Tier 1 was under pressure but paid reasonable resets and went well,\" said a lead banker.</p>\n              <p>\"It's sub-benchmark, yes, but it has rarity value, it's a well-known name [with] a scalable acquisition, and arguably a smaller transaction size is not that rare in sterling.\"</p>\n              <p>Bankers expect the deal to price somewhere in between the sterling AT1s of established UK bank issuers in the high 4s and deals from rarer bank issuers such as OSB Group, whose £150m perpetual non-call 2027s are bid at around 6%.</p>\n              <p>Abrdn has only two bonds outstanding, according to Tradeweb, comprising a 5.5% 2042 non-call 2022 Tier 2 sold in 2012, of which just £92m remains outstanding, and a 4.25% US$750m June 2028 Tier 2 sold in October 2017. </p>\n              <p>The deal is expected to be rated Baa2/BBB– by Moody's/Fitch. </p>\n              <p>Fitch noted the deal is expected to be rated three notches below abrdn's issuer rating of A–, a narrower notching than for most bank AT1s it rates because the agency considers the possibility of mandatory interest cancelation to be more remote than for banks. </p>\n              <p>(Reporting by Tom Revell, editing by Philip Wright, Sudip Roy)</p>\n              <p>((tom.revell@refinitiv.com; +44 (0) 7557 138961))</p>\n            </span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © Refinitiv 2021. Click For Restrictions - https://www.refinitiv.com/en/policies/copyright-notice</p></div>"}