{"date": "2021-12-29 18:22:52.062000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3413.22, "close": 3372.89}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Every day, we scour Amazon to find the best deals available. Whether it's something for your kitchen or top-rated tech to give your smart home an upgrade, the online shopping giant offers some of the best prices on a  <span>very</span> wide range of items. Whatever you need, Amazon has you covered.</p></div><div class=\"tr-npp-body\"><p><span><span>Make 2022 the year of good decisions.</span> Start by signing up for our newsletter for twice-weekly tips, reviews and more from our experts.</span> </p><p>Below, you'll find our top 10 Amazon deals right now, including noise-canceling earbuds, streaming services and a variety of dental hygiene essentials, all of which have been vetted by our team of deals experts to make sure they're \"best of web\" prices. </p><p>► <span>Style savings:</span> These Tory Burch deals are extra special with 25% off all sale styles—shop now for chic bags, sandals and more</p><p>► <span>Year-end deals:</span> The 70 best end-of-year sales available right now—shop Amazon, Walmart, Best Buy and more</p><p>If you're not already an Amazon Prime subscriber, you can sign up for a 30-day membership for free. An Amazon Prime subscription gets you free two-day shipping and tons of other benefits for $12.99 a month ($6.49 for students and $5.99 for those receiving qualifying government assistance).</p><p class=\"tr-npp-section-title\">The 10 best Amazon deals you can get today</p><p><big>1. Save $30: This user-friendly tax software</big> </p><p>Get a head start on tax season by grabbing a TurboTax Deluxe download card for PC. Not only is the card marked down to $39.99, 42% off its list price of $69.99, but it comes with a $10 Amazon gift card for free. TurboTax says the card lets you make five electronic filings of federal tax returns and one filing for state tax returns, and suggests that this specified package is best for homeowners who have made charitable donations and have high medical expenses.</p><p><span>Get the TurboTax Deluxe 2021 Download Card with Amazon Gift Card for $39.99 (Save $30)</span> </p><p><big>2. Less than $500: This stylish TV</big> </p><p>Upgrade your TV while adding some style to your living room with Samsung's The Frame TV, on sale today. Typically listed from $599.99, you can get this smart screen for as low as $457.99 in its 32-inch size. Not only does it offer QLED HDR visuals, but Samsung says The Frame's Art Mode also lets you display purchasable pieces of art when you're not watching any shows or movies. Whether you want it to be the house entertainment hub or a moving painting, The Frame's built-in Alexa technology lets you talk into the provided remote to access those features and more.</p><p><span>Get the Samsung The Frame QLED LS03 Series HDR Smart TV from $457.99 (Save $142 to $302)</span> </p><p><big>3. Up to 37% off: These classic toys</big> </p><p>If you're still looking for gifts to give to the youngest ones in your family, Amazon has a handful of Melissa &amp; Doug toys on sale today. The little mechanics in your life can enjoy the brand's 48-piece wooden construction set, on sale for $14.99, or 30% off. Kids ages four and up can use the included nuts, bolts, drilled bars and screwdriver to start their own passion for engineering. There's also the Melissa &amp; Doug Mine to Love Mariana baby doll marked down to $18.49 from $26.99. The 18-inch poseable doll is a size fit for kids ages 18 months and up to hug, cuddle and care for.</p><p><span>Save up to 37% on Melissa &amp; Doug Toys</span> </p><p><big>4. Save $80: These powerful noise-canceling earbuds</big> </p><p>Bose is one of the biggest names in the world of headphones and it's packed some of the best noise-canceling technology in a package that can fit in the palm of your hand with these earbuds. The brand's QuietComfort earbuds are now on sale for $199—an $80 price cut from its regular listing of $279. In our testing, we adored the best-in-class noise-canceling technology built into the buds, which we found blocked out bustling traffic and strong winds. That tech is the cherry on top of the buds' well-balanced fit and highly-detailed sound output. </p><p><span>Get the Bose QuietComfort Noise-Canceling Earbuds for $199 (Save $80)</span> </p><p><big>5. Less than $11: This compact music streaming package</big> </p><p>For the rest of the month, Amazon is offering its most compact smart speaker for a massive discount when users try out its premiere streaming service. Through <span>Friday, December 31</span> , new subscribers to Amazon Music Unlimited will get the third-generation Echo Dot speaker for just $0.99—a whopping $39 discount from the speaker's usual price of $39.99, and $19 down from its current price. That means you pay $9.99 ($7.99 for Prime members, $0.99 for students) to stream and even download as many as 70 million songs on your mobile device, then less than a dollar for the device to play your favorite tunes via Bluetooth connection over the Echo Dot, for a total cost of $10.98. Though smaller than its newer brethren (now at $29.99), the third-generation Dot is still one of the best Echo speakers for giving you access to all standard Alexa features at a fraction of the cost of the rest of the Echo series.</p><p><span>Get 1 Month of Amazon Music Unlimited and the Amazon Echo Dot (3rd Generation) for $10.98 (Save $39)</span> </p><p><big>6. Up to 49% off: These bundled Colgate products</big> </p><p>Keep your teeth pearly white with these sets of Colgate dental products on sale for major price cuts at Amazon today. There's the hum electric toothbrush kit, available for as low as $37.49 in blue thanks to an already active 33% discount and an additional 25% coupon on the product page. Colgate says the hum brush uses Bluetooth technology connected to your smartphone to guide you to the spots of your teeth that need the most thorough cleaning. Along with the brush itself, the kit comes with a charger, carrying case and a refill brush you can swap after six months. All you need to make your teeth cleaning complete is a two-pack of Colgate Optic Renewal teeth whitening toothpaste, which Amazon is selling for just $6.10 (provided you use the on-page coupon). </p><p><span>Save up to 49% on Colgate Dental Products</span> </p><p><big>7. Save $120: This durable frying pan</big> </p><p>Upgrade your kitchen tools with this All-Clad 12-inch frying pan, on sale for just $99.99. Typically listed for $220, this stainless-steel pan is now available at a 55% discount. All-Clad says the pan is made with a responsive aluminum core bonded together with two layers of tough stainless steel for durability and more even heat distribution. The pan also promises easy handling with its riveted handle and a polished cooking surface that's stick-resistant.</p><p><span>Get the All-Clad 12-Inch D3 Stainless Steel Frying Pan for $99.99 (Save $120.01)</span> </p><p><big>8. 31% off: This responsive video doorbell</big> </p><p>If you're looking to keep an eye on your front door, the Eufy Security video doorbell can help. Currently priced at $159.99, you can get the wired device for $109 if you use the $50 coupon on the product page. Eufy says its doorbell captures 2K high-definition video of your front door and sends it to your smartphone via the Eufy Security app. If you don't want to be bombarded with notifications, the camera can detect body shape and face pattern to identify when someone is looking to stop and notify you only in those instances.</p><p><span>Get the Eufy Security Wi-Fi Video Doorbell for $109.99 with coupon (Save $50)</span> </p><p><big>9. Less than $30: This lightweight lawn tool</big> </p><p>Prepare for the lengthy yard work next year by picking up this Greenworks 18-inch string trimmer. Normally priced at $35.34, this 10-amp corded lawn tool is now $26.64, or 25% off. Greenworks says the trimmer features a simple electric start, an over-mold grip and weighs only 9.9 pounds, making for an easy-to-handle experience. The trimmer itself features an 18-inch cutting path that makes for a quicker time cleaning up the grass growing on your property.</p><p><span>Get the Greenworks 10-Amp 18-Inch Corded String Trimmer for $26.64 (Save $8.70)</span> </p><p><big>10. Up to $49 off: This popular streaming service</big> </p><p>If you want to test out one of the best music streaming apps we've ever tried, you can also add another streaming service for free! Right now, Amazon is offering up to six months of free access to Disney+ through its Amazon Music Unlimited service. New subscribers to AMU get six months of the House of Mouse's media library, while current subscribers get three months free. That means you can access Amazon Music Unlimited's library of 75 million songs ad-free one minute and watch the newly-released space adventure <span>Star Wars: The Book of Boba Fett</span> the next. The six-month bundle of Amazon and Disney's streaming apps together would normally run shoppers $107.88 (or $95.88 for Amazon Prime members), but this offer lets new subscribers cut that price down to $59.94 (or $47.94 for Prime members).</p><p><span>Get 6 Months of Amazon Music Unlimited and Disney+ for $59.94 (Save $47.94)</span> </p><p class=\"tr-npp-section-title\">Amazon deals you may have missed</p><p><big>1. Sony WF-1000XM4 Wireless Earbuds</big> </p><p>If you've been curious about noise-canceling headphones, you can get that technology in a package able to go anywhere you want. The Sony WF-1000XM4 earbuds are typically listed for $279.99 but can now be yours for $248 with the current $31.99 price cut. Not only are these buds one of the best noise-canceling headphones we've ever tried, but also one of our favorite headphones overall.  We loved the innovative design, waterproof build and fantastic sound quality as well as its top-tier noise-canceling technology. Though they're a small pair of headphones, the WF-1000XM4 can get you up to eight hours of your favorite beats non-stop.</p><p><span>Get the Sony WF-1000XM4 Noise-Canceling Wireless Earbuds for $248 (Save $31.99)</span> </p><p><big>2. Amazon Echo Dot (4th Generation) with Clock</big> </p><p>Amazon's vast line of Echo devices has offered homeowners easy and intuitive entries into the world of smart home technology and now one of its most popular pieces is back on sale. The fourth-generation Echo Dot speaker with clock is now available at a 42% discount from its list price of $59.99 down to just $34.99. When we tested the Echo Dot, we were impressed with the sleek aesthetic of its orb-like design and surprisingly good sound coming from the built-in speakers. The ever-useful Alexa smart assistant also offers compatibility with other smart devices when you're ready to add more to your home setup.</p><p><span>Get the Amazon Echo Dot (4th Generation) with Clock for $34.99 (Save $25)</span> </p><p><big>3. Polaroid Hi-Print Portable Printer</big> </p><p>If you're a photographer with your smartphone and want your favorite pictures in physical form, you can try the Polaroid Hi-Print printer. Typically listed for $99.99, this portable device is now 12% off for $87.72. The Hi-Print is our favorite portable photo printer, having impressed us with its design that's both playful and sturdy. We also found it easy to connect to smartphones via Bluetooth and liked its companion mobile app which lets you make basic edits to your photos before printing.</p><p><span>Get the Polaroid Hi-Print Portable Printer for $87.72 (Save $12.27)</span> </p><p><big>4. Eufy BoostIQ RoboVac 11S Max Robot Vacuum</big> </p><p>If you're looking for a vacuum at a great price with powerful performance, the Eufy 11S Max robot vacuum is the perfect pick. The robot vacuum usually runs shoppers $249.99, but Amazon is offering it for $159.99, a 36% discount. The Max is a larger version of our favorite affordable robot vacuum, the Eufy 11S Slim ($154.99), which we adored for its quiet operation and strong self-navigating abilities. We found that the Max still has the ultra-slim 2.85-inch size and 100-minute battery life of the 11S Slim while boasting even more powerful suction.</p><p><span>Get the Eufy BoostIQ RoboVac 11S Max for $159.99 (Save $90)</span> </p><p><big>5. Instant Pot 6-Quart Duo Crisp Pressure Cooker</big> </p><p>Save some time on your next meal prep with the Instant Pot Duo Crisp pressure cooker. Typically listed at $149.99, the six-quart multi-function appliance is now available for $99.95 courtesy of a 33% discount. The Duo Crisp is one of our favorite pressure cookers for being easy to clean and doing a reliable job preparing everything from ribs to soup. You can roast, bake, broil or even turn this appliance into an air fryer with its replaceable lid.</p><p><span>Get the Instant Pot 6-Quart Duo Crisp Electric Pressure Cooker with Air Fryer Lid for $99.95 (Save $50.04)</span> </p><p class=\"tr-npp-section-title\">Other noteworthy Amazon deals we found </p><ul class=\"bulleted-list arrowlist\"><li>Save up to 41% on Sony Wireless Portable Speakers</li><li>Save up to 42% on DeWalt 20-Volt Tools</li><li>Save up to 50% on Razer gaming accessories</li><li>Save up to 63% on GE kitchen appliances</li><li>Prime Video Channels from $0.99</li><li>Zataye LED 100-Foot Strip Lights for $24.63 (Save $4.35)</li><li>Beckham Hotel Collection Bed Pillows, Set of Two, for $29.99 with coupon (Save $20)</li><li>MoCuishle Shiatsu Massager for $40.37 with coupon (Save $19.62)</li><li>YnM Weighted Blanket from $41.56 (Save $7.34 to $20.78)</li><li>Cuisinart ICE-21 Ice Cream Maker from $59 (Save $51)</li><li>Amazon Echo Buds (2nd Generation) for $69.99 (Save $50)</li><li>23andMe DNA Testing Kit with Traits Service for $79 (Save $20)</li><li>Amazon Echo Show 8 (2nd Generation) for $94.99 (Save $35)</li><li>Sony WH-CH710N Wireless Headphones for $98 (Save $81.99)</li><li>Winix 5500-2 Air Purifier for $159.99 (Save $90)</li><li>Le Creuset 3.5-Quart Enameled Cast Iron Signature Sauteuse Oven from $179.95 (Save $120.05)</li><li>Sandisk 1-Terabyte Extreme Pro Portable SSD for $184.99 (Save $125)</li><li>Apple AirPods Pro for $197 (Save $52)</li><li>Cricut Maker for $229 (Save $140)</li><li>iRobot Roomba j7+ Self-Emptying Robot Vacuum for $649 (Save $200.99)</li> </ul><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Updated daily: Here are the 10 best Amazon deals today in December 2021</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}