{"date": "2022-02-23 14:00:02.354000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwlistdisc{list-style-type:disc;}</style><p class=\"bwalignc\">\n<b>Markacy and Maxbone Partnership Grows the Pet Brand’s E-commerce on Shopify and Amazon</b>\n</p><p class=\"bwalignc\">\n<span>Markacy’s strategy led to 58% Year-over-Year e-commerce growth in Q4 2021</span>\n</p><p>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fmarkacy.com%2F&amp;esheet=52583635&amp;newsitemid=20220222006166&amp;lan=en-US&amp;anchor=Markacy&amp;index=1&amp;md5=eb75dd397bd6acca5b5c5ee59289c334\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Markacy</a>, a digital strategy and marketing firm headquartered in New York City, announced that it partnered with <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.maxbone.com%2F&amp;esheet=52583635&amp;newsitemid=20220222006166&amp;lan=en-US&amp;anchor=Maxbone&amp;index=2&amp;md5=79378d3ed2ab5d83fad6f8e4ef76e143\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Maxbone</a>, a direct-to-consumer luxury pet brand that offers modern and personalized accessories as well as sustainably-made food. Markacy helped launch Maxbone’s presence on Amazon in January 2022 and has been working with the company since fall 2021 to accelerate its e-commerce sales growth. Markacy manages the brand’s paid media, email and SMS campaigns, website, SEO, and direct mail channels, further enhancing the company’s digital infrastructure and strengthening relationship with its customers.\n</p><p>\nMarkacy’s expertise in website optimization, paid media acquisition and creative advisory services all played a crucial role in advancing Maxbone’s digital footprint and customer acquisition strategy starting in Q4 2021. To that end, Markacy’s marketing support helped Maxbone achieve 58% YoY e-commerce growth during the 3-month period of working together.\n</p><p>\n“The pet market is highly competitive. Maxbone is in a strong position to provide consumers with a user-friendly, one-stop shop for pet essentials, and this is a centerpiece of our strategy. We enabled Maxbone to expand its digital channels and drive e-commerce revenue by leveraging first-party data and by thinking creatively about what kind of pet brand customers want but don’t have,” said <b>Tucker Matheson,</b> <b>Managing Partner and</b> <b>Co-founder of Markacy</b>.\n</p><p>\nIn one quarter of working together, Markacy and Maxbone:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\nLaunched Amazon storefront which enabled Maxbone to tap into a new customer base to drive continued e-commerce growth.\n</li>\n<li>\nAdvised on the launch of Direct Mail channel by leveraging third-party data which resulted in a higher return on ad spend (ROAS) than Facebook during the brand’s first holiday season campaign.\n</li>\n<li>\nMade recommendations for content creation to enable the brand to scale its business on Facebook, Instagram, Google and Amazon.\n</li>\n<li>\nAchieved a 31% increase in purchase volume and a 23% increase in revenue Month-over-Month (MoM) on Google through automated bid strategies, keyword coverage expansion and customer shopping feed enhancements.\n</li>\n</ul><p>\n<b>Mariana Alves, Maxbone's Head of Creative and Brand Marketing, </b>added<b>: </b>“Markacy understands our ambitious revenue targets and their team has built a strategy that enables us to continue to grow, serve existing and reach new customers. Their team identified our biggest opportunities and challenges in a very crowded market and successfully devised a digital marketing strategy in alignment with our business objectives.”\n</p><p>\nMarkacy also advised on e-commerce KPIs to drive profitability through new customer acquisition and help build financial models to achieve Q4 2021 and Q1 2022 targets.\n</p><p>\n<b>About Markacy\n<br/></b>Markacy is a digital strategy firm helping DTC brands launch, grow and scale, by developing and executing cross-channel strategies. Specializing in finance, media, strategic planning, and marketing operations, the company is headquartered in New York City with teams in multiple cities including Boston and Los Angeles. Visit us at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fmarkacy.com%2F&amp;esheet=52583635&amp;newsitemid=20220222006166&amp;lan=en-US&amp;anchor=http%3A%2F%2Fmarkacy.com%2F&amp;index=3&amp;md5=3ca7157af7cf7f2a55e8513b8827a499\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://markacy.com/</a>.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20220222006166r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjIwMjIyMDA2MTY2cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=a7d8957211a1ef77025f3a88713776afe0cbca1a890ba2c0167051f70b172c1a6ce6102e0952d34e22e1527b74fbc8460c8f0a47ef23a1139f549069fbcc6998\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20220222006166/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220222006166/en/</a></span></p><p>\nErika Leigh\n<br/><a href=\"mailto:eleigh@montiethco.com?subject=Maxbone%20x%20Markacy\" data-type=\"email\" translate=\"no\">eleigh@montiethco.com</a><br/>+1 813 553 2144\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2022</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NY-MARKACY/MAXBONE</p></div>"}