{"date": "2022-01-05 15:13:50.288000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_ew5uno9a&amp;referenceId=tag:reuters.com,2022:newsml_OVFSYR157_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_ew5uno9a&amp;referenceId=tag:reuters.com,2022:newsml_OVFSYR157_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: Samsung Electronics is likely to post a record fourth-quarter profit thanks to solid demand for server memory chips and higher margins in contract manufacturing, analysts' estimates showed. Francis Maguire reports.<br/>Short Link: <a href=\"https://refini.tv/3pS6J2e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3pS6J2e</a><br/><br/>Video Transcript:<br/><br/>Samsung is likely to post a record profit in the fourth quarter. Analysts project the smartphone maker could have hit $12.7 billion profit in the quarter ended December. That would be up almost 70% on the year, and a record Q4 number for the South Korean company. Forecasters believe strong demand for memory chips from companies like Amazon and Microsoft could be key. Analysts also said Samsung's chip contract manufacturing business has sharply improved profitability from the previous quarter. They project profit there is likely more than double last year's number at $8 billion. The company's mobile business also saw shipments likely rise slightly from the previous quarter as components became more available. The tech giant is due to announce its preliminary results on Friday. Samsung shares have climbed around 12% over the last two months in anticipation of higher memory chip prices this year.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}