{"date": "2022-01-05 22:53:53.334000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3350.44, "close": 3265.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Jan. 6 -- The Delhi High court on Wednesday stayed till February 1 Amazon's arbitration proceedings against Future Group at the Singapore International Arbitration Centre (SIAC)'s Delhi Tribunal, while also staying the single judge order of the same court which dismissed the latter's plea for suspension of the arbitration -- a move seen as a setback for the US e-commerce company.</p><p>Before the single judge, Future Group sought the suspension of the arbitration proceedings citing a December 17, 2021 order of the Competition Commission of India (CCI) which kept in abeyance the approval granted for its 2019 deal with Amazon.</p></div><div class=\"tr-npp-body\"><p>Amazon will likely challenge the order, which provided the latest twist in a bitter case between it and its stranged partner Future.</p><p>In 2020, Future Group decided to sell its retail assets to Reliance Retail Limited (RRL), following which Amazon initiated arbitration proceedings, claiming this violated the 2019 deal it had with the former. Future Retail has around 1500 retail outlets including supermarkets, and some analysts see the legal battle as a fight between Amazon and Reliance for the control of the Indian organised retail business.</p><p>Future argued in court that after the antitrust regulator's order, its application for termination of arbitration proceedings with Amazon should be decided before the start of the final hearing in the main arbitration case. Amazon has already said that it will challenge the CCI order.</p><p>It also contended that several of its lawyers handling the case have tested Covid-19 positive and ignoring this, the arbitral tribunal fixed January 5 to 8 for the cross examination of expert witnesses.</p><p>On Tuesday, the single judge dismissed Future's plea saying that it cannot dictate a duly constituted tribunal on the manner in which it should carry out proceedings and any interference would violate the autonomy of the tribunal.</p><p>After hearing both the sides, the bench said that there is a prima facie case in favour of Future Retail Ltd (FRL) and Future Coupons Pvt Ltd (FCPL) and if a stay is not granted, it would cause an irreparable loss to them. \"We hereby stay further proceedings of the arbitral tribunal till the next date of hearing (February 1) and we also stay the single judge's January 4 order till the next date of hearing,\" the bench said.</p><p>The court also issued a notice to Amazon.com NV Investment Holdings LLC on the appeals filed by FRL and FCPL challenging the single judge's order.</p><p>During the hearing, senior advocate Mukul Rohatgi, appearing for Future Coupons Pvt. Ltd, contended that once the CCI approval to the 2019 deal between his client and Amazon was put on hold, the agreement between them automatically ceased to matter.</p><p>\"This means approval doesn't exist. If it doesn't exist, the agreement has no legal effect in India. The arbitration has no legal effect in India and is a nullity,\" he submitted.</p><p>\"Nobody has filed an appeal (against the CCI order). The impact of the order is clear. They are not willing to deal with it as a preliminary issue. Heavens are not going to fall. Half of the solicitor's office is down with Covid. So we went to the single bench,\" he said.</p><p>On Tuesday, the single judge rejected this argument and said that the big corporations have a battery of lawyers representing them before multiple fora. Even if some of the lawyers have tested positive for Covid-19, it can be duly expected that the parties would endeavor to make alternate arrangements, he said.</p><p>Claiming that the reasoning by the single judge was flawed, Rohatgi argued that the judge failed to appreciate the termination application and also the fact that the agreement would have no effect after CCI's order.</p><p>Senior advocate Harish Salve, for Future Retail Ltd, referred to the Arbitration and Conciliation Act and argued that while the Arbitral Tribunal is master of it's procedure, its jurisdiction is limited. Opposing the appeals, senior advocate Gopal Subramanium for Amazon, submitted that it was not fair to say that the Tribunal was not taking cognizance of the application to terminate.</p><p>The court will now hear the matter on February 1. Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}