{"date": "2021-11-22 21:39:20.327000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>IBEX LTD (\"IBEX-Q\")\n- First Quarter of Fiscal Year 2022 Financial Results\n\n   IBEX Limited (\"ibex\"), a leading global provider in business process\noutsourcing and end-to-end customer engagement technology solutions, today\nannounced financial results for its first fiscal quarter ended September\n30, 2021.\n\n   \"We are continuing to make strong progress on our strategic growth\ninitiatives, with a focus on our omni-channel customer offering, and new,\ntechnology-led clients,\" said Bob Dechant, CEO of ibex. \"We remain on a\ntrajectory to meet our financial goals for fiscal 2022 while continuing to\ninvest in our business and in our customers' success.\"\n\n   Dechant continued, \"While our top line growth paused for the first time\nin 16 quarters, driven by one-time events last year within our legacy top 3\nclient group, our growth engine, comprised of new clients won since FY16\nwho are adopting our omni-channel and WaveX capabilities, now make up 62%\nof our business, up from 46% compared to the year ago quarter, and continue\nto grow at an explosive rate.\n\n   As of this quarter, our largest client is now one of the most valued\ncompanies on the planet, continues to grow at double digit rates with ibex,\nand is truly a partner with partial ownership in our business. As a result,\nand as we indicated last quarter, we expect our growth to resume and\naccelerate in Q2 and beyond.\n\n   Our growth in spending this quarter outpaced our revenue growth as we\nonboard new clients that will come online during the remainder of the\nfiscal year. We are also investing in key long-term growth initiatives,\nwhich we expect will drive significant long-term value creation.\nAccordingly, we expect adjusted EBITDA margin to improve in Q2 and beyond\nas this business and our new geographies begin to ramp.\"\n\n   First Quarter of Fiscal Year 2022 Financial Highlights\n\n   Revenue\n\n   *  Revenue was flat at $108.6 million, compared to $108.8 million in the\nprior year quarter.\n   *  Current quarter revenue was impacted by significant decreases related\nto our legacy top 3 clients, which now represents only 25% of our revenue.\n   *  Revenue related to our new clients won since FY16 grew 34% compared\nto the prior year quarter.\n   *  Revenue related to digital marketing decreased year over year\nprimarily due to lower affiliate marketing volumes.\n   *  $3.5 million of net training revenue deferred in the quarter compared\nto $1.2 million net deferred in the prior year quarter. We expect this\ntraining to drive significant future revenue growth.\n\n   Net Income / (Loss)\n\n   *  Net income was $3.0 million, compared to net loss of $3.4 million in\nthe prior year quarter.\n   *  Net income / (loss) margin increased to 2.8%, compared to (3.1)% in\nthe prior year quarter.\n   *  Non-GAAP adjusted net income was $0.9 million, compared to $5.5\nmillion in the prior year quarter (see Exhibit 1 for reconciliation).\n   *  Non-GAAP adjusted net income margin was 0.8%, compared to 5.0% in the\nprior year quarter (see Exhibit 1 for reconciliation).\n   *  The Company will recognize a deferred tax benefit of approximately\n$4.0 million by the end of fiscal year 2022 as the result of a legal entity\ntax reorganization completed this quarter.\n\n   Adjusted EBITDA\n\n   *  Non-GAAP adjusted EBITDA was $11.5 million, compared to $15.8 million\nin the prior year quarter (see Exhibit 2 for reconciliation).\n   *  Non-GAAP adjusted EBITDA margin was 10.6%, compared to 14.5% in the\nprior year quarter (see Exhibit 2 for reconciliation).\n   *  Adjusted EBITDA margin decreased primarily due to significant costs\nrelated to ramping new business in the quarter, lower digital marketing\nvolumes, and long term investments in our sales and marketing organization\nand cyber-security technologies.\n\n   Earnings / (Loss) Per Share\n\n   *  IFRS basic and fully diluted earnings per share was $0.17 and $0.16,\ncompared to IFRS basic and fully diluted loss per share of $0.21 in the\nprior year quarter.\n   *  Non-GAAP adjusted fully diluted earnings per share was $0.05,\ncompared to $0.32 in the prior year quarter (see Exhibit 1 for\nreconciliation).\n\n   Cash Flow and Balance Sheet\n\n   *  Cash flow from operations grew 16% year over year to $6.9 million.\n   *  Growth capex increased to $5.3 million as we invest for the future\nand expand our capacity across both existing and new geographies.\n   *  Cash and cash equivalents were $54.0 million, total borrowings were\n$28.3 million, and lease liabilities were $86.6 million as of September 30,\n2021, compared to cash and cash equivalents of $57.8 million, total\nborrowings of $28.5 million, and lease liabilities of $84.0 million as of\nJune 30, 2021.\n\n   Business Highlights\n\n   *  We have a new #1 client, as defined by revenue over the last twelve\nmonths, who is the leading technology provider and marketplace in the\nworld, and continues to grow at an impressive rate.\n   *  Won 9 new clients, primarily Digital First companies in the Retail\nand E-Commerce, FinTech, and HealthTech verticals.\n   *  Top 3 client concentration decreased to 28.7% of revenue from 38.1%\nin the prior year.\n   *  Telecommunications vertical decreased to 21.5% of revenue from 33.5%\nin the prior year.\n   *  Added over 860 seats in high margin nearshore and offshore locations.\n\n   Fiscal Year 2022 Business Outlook\n\n   We are reaffirming our fiscal year 2022 guidance provided last quarter.\n\n   *  Fiscal year 2022 organic revenue growth of 7% to 9%. Revenue growth\nwill accelerate beginning in the second quarter as we onboard new capacity.\n   *  Adjusted EBITDA of $69.0 million to $71.0 million.\n   *  Capex of $30.0 million to $35.0 million. We expect to return to\nsignificantly lower, normalized capex spend when social distancing\nrestrictions subside.\n\n   Conference Call and Webcast Information\nIBEX Limited will host a conference call and live webcast to discuss its\nfirst quarter of fiscal year 2022 financial results at 4:30 p.m. Eastern\nTime today, November 22, 2021. To access the conference call, dial (833)\n614-1408 for the U.S. or Canada, or for international callers (914)\n987-7129 and provide conference ID 3885337. The webcast will be available\nlive on the Investors section of ibex's website at:\n<a href=\"https://investors.ibex.co\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://investors.ibex.co</a>/.\n\n   An audio replay of the call will also be available to investors\nbeginning at approximately 7:30 p.m. Eastern Time on November 22, 2021,\nuntil 7:30 p.m. Eastern Time on November 29, 2021, by dialing (855)\n859-2056 for the U.S. or Canada, or for international callers, (404)\n537-3406 and entering passcode 3885337. In addition, an archived webcast\nwill be available on the Investors section of ibex's website at:\n<a href=\"https://investors.ibex.co\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://investors.ibex.co</a>/.\n\n   Financial Information\nThis announcement does not contain sufficient information to constitute an\ninterim financial report as defined in International Accounting Standards\n34, \"Interim Financial Reporting.\" The financial information in this press\nrelease has not been audited.\n\n   Non-GAAP Financial Measures\nWe present non-GAAP financial measures because we believe that they and\nother similar measures are widely used by certain investors, securities\nanalysts and other interested parties as supplemental measures of\nperformance and liquidity. We also use these measures internally to\nestablish forecasts, budgets and operational goals to manage and monitor\nour business, as well as evaluate our underlying historical performance, as\nwe believe that these non-GAAP financial measures are a more accurate\ndepiction the performance of the business by encompassing only relevant and\nmanageable events, enabling us to evaluate and plan more effectively for\nthe future. The non-GAAP financial measures may not be comparable to other\nsimilarly titled measures of other companies, have limitations as\nanalytical tools, and should not be considered in isolation or as a\nsubstitute for analysis of our operating results as reported under IFRS as\nissued by the IASB. Non-GAAP financial measures and ratios are not\nmeasurements of our performance, financial condition or liquidity under\nIFRS as issued by the IASB and should not be considered as alternatives to\noperating profit or net income / (loss) or as alternatives to cash flow\nfrom operating, investing or financing activities for the period, or any\nother performance measures, derived in accordance with IFRS as issued by\nthe IASB or any other generally accepted accounting principles.\n\n   ibex is not providing a quantitative reconciliation of forward-looking\nnon-GAAP adjusted EBITDA to the most directly comparable IFRS measure\nbecause it is unable to predict with reasonable certainty the ultimate\noutcome of certain significant items without unreasonable effort. These\nitems include, but are not limited to, non-recurring expenses, fair value\nadjustments, and share-based compensation expense. These items are\nuncertain, depend on various factors, and could have a material impact on\nIFRS reported results for the guidance period.\n\n   About ibex\nibex helps the world's preeminent brands more effectively engage their\ncustomers with services ranging from customer support, technical support,\ninbound/outbound sales, business intelligence and analytics, digital demand\ngeneration, and CX surveys and feedback analytics.\n\n   Forward Looking Statements\nIn addition to historical information, this release contains\n\"forward-looking statements\" within the meaning of the Private Securities\nLitigation Reform Act of 1995. In some cases, you can identify\nforward-looking statements by terminology such as \"believe,\" \"may,\" \"will,\"\n\"estimate,\" \"continue,\" \"anticipate,\" \"intend,\" \"should,\" \"plan,\" \"expect,\"\n\"predict,\" \"potential,\" or the negative of these terms or other similar\nexpressions. These statements include, but are not limited to, statements\nregarding our future financial and operating performance, including our\noutlook and guidance, and our strategies, priorities and business plans.\nOur expectations and beliefs regarding these matters may not materialize,\nand actual results in future periods are subject to risks and uncertainties\nthat could cause actual results to differ materially from those projected.\nFactors that could impact our actual results include: developments relating\nto COVID-19; our ability to attract new business and retain key clients;\nour ability to enter into multi-year contracts with our clients at\nappropriate rates; the potential for our clients or potential clients to\nconsolidate; our clients deciding to enter into or further expand their\ninsourcing activities; our ability to operate as an integrated company\nunder the ibex brand; our ability to manage portions of our business that\nhave long sales cycles and long implementation cycles that require\nsignificant resources and working capital; our ability to manage our\ninternational operations, particularly in Pakistan and the Philippines and\nincreasingly in Jamaica and Nicaragua; our ability to comply with\napplicable laws and regulations, including those regarding privacy, data\nprotection and information security; our ability to manage the inelasticity\nof our labor costs relative to short-term movements in client demand; our\nability to realize the anticipated strategic and financial benefits of our\nrelationship with Amazon; our ability to recruit, engage, motivate, manage\nand retain our global workforce; our ability to anticipate, develop and\nimplement information technology solutions that keep pace with evolving\nindustry standards and changing client demands; our ability to maintain and\nenhance our reputation and brand; and other factors discussed under the\nheading \"Risk Factors\" in our annual report on Form 20-F filed with the\nU.S. Securities and Exchange Commission on October 14, 2021 and any other\nrisk factors we include in subsequent reports on Form 6-K. Because of these\nuncertainties, you should not make any investment decisions based on our\nestimates and forward-looking statements. Except as required by law, we\nundertake no obligation to publicly update any forward-looking statements\nfor any reason after the date of this press release whether as a result of\nnew information, future events or otherwise.\n\n   Media\n\n Contact Information:\n\nContact: Brad Jones, Senior Director, PR &amp; Communications, ibex,\n720.882.7343, Brad.Jones@ibex.co\n\n   IR Contact: Daniel Bellehsen, Executive Vice President, Investor\nRelations &amp; Corporate Development, ibex, Dan.Bellehsen@ibex.co\n\nIBEX Limited\nUnaudited Consolidated Statements of Financial Position\n\n//st\n\n    September 30,      June 30,\n\nUS$ in thousands    2021       2021\n\nAssets\n\nCurrent assets\n\nCash and cash   $   53,986     $  57,842\nequivalents\n\nTrade and other     91,294    81,104\nreceivables\n\nDue from related    1,098     1,755\nparties\n\nWarrant asset       866       673\n\nTotal current   $   147,244    $  141,374\nassets\n\nNon-current\nassets\n\nProperty and    $   35,758     $  30,828\nequipment\n\nRight of use        77,939    75,875\nassets\n\nGoodwill        11,832    11,832\n\nOther intangible    3,240     3,209\nassets\n\nWarrant asset       1,520     1,420\n\nInvestment in       276       258\njoint venture\nDeferred tax        4,130     4,252\nasset\n\nOther assets        5,508     5,239\n\nTotal   $   140,203    $  132,913\nnon-current\nassets\n\nTotal assets    $   287,447    $  274,287\n\nLiabilities and\nequity\n\nCurrent\nliabilities\n\nTrade and other $   61,567     $  54,863\npayables\n\nDeferred revenue    5,837     4,077\n\nLease liabilities       13,780    12,121\n\nBorrowings      26,950    26,716\n\nDue to related      3,699     4,275\nparties\n\nIncome tax      4,102     3,663\npayables\n\nTotal current   $   115,935    $  105,715\nliabilities\n\nNon-current\nliabilities\n\nDeferred revenue    $   4,646  $  3,010\n\nLease liabilities       72,799    71,878\n\nBorrowings      1,354     1,801\n\nDeferred tax        86        86\nliability\n\nOther       9,167     11,138\nnon-current\nliabilities\n\nTotal   $   88,052     $  87,913\nnon-current\nliabilities\nTotal liabilities   $   203,987    $  193,628\n\nEquity\n\nShare capital   $   2      $  2\n\nAdditional      158,157       158,157\npaid-in capital\n\nOther reserves      32,967    33,180\n\nAccumulated     (107,666)      (110,680)\ndeficit\n\nTotal equity    $   83,460     $  80,659\n\nTotal   $   287,447    $  274,287\nliabilities and\nequity\n\n//et\n\n   IBEX Limited\nUnaudited Consolidated Statements of Profit or Loss\nand Other Comprehensive Income / (Loss)\n\n//st\n\n    Quarter ended September 30,\n\nUS$ in      2021         2020\nthousands,\nexcept share and\nper share amounts\n\nRevenue     $   108,573  $  108,771\n\nPayroll and     76,437      72,264\nrelated costs\n\nShare-based     360     2,089\npayments\n\nReseller        3,192       4,102\ncommission and\nlead expenses\n\nDepreciation and    7,643       6,439\namortization\n\nFair value      (2,800)  3,586\nmeasurement of\nshare warrants\n\nOther operating     18,024      21,204\ncosts\n\nIncome / (loss) $   5,717    $  (913)\nfrom operations\n\nFinance expenses    $   (2,110)   $  (2,239)\n\nIncome / (loss) $   3,607    $  (3,152)\nbefore taxation\n\nIncome tax  $   (593)   $  (271)\nexpense\n\nNet income /    $   3,014    $  (3,423)\n(loss)\n\nOther\ncomprehensive\nincome / (loss)\n\nItems that will\nbe subsequently\nreclassified to\nprofit or loss\n\nForeign currency    $   (445)   $  (36)\ntranslation\nadjustment\n\nCash flow hedges    (311)  33\n- changes in\nfair value\n\n    $   (756)   $  (3)\n\nTotal   $   2,258    $  (3,426)\ncomprehensive\nincome / (loss)\nfor the period\n\nEarnings /\n(loss) per share\n\nBasic   $   0.17     $  (0.21)\n\nDiluted     $   0.16     $  (0.21)\n\nWeighted average\nshares\noutstanding\n\nBasic       18,246,672      16,368,143\n\nDiluted         18,849,139      16,368,143\n\n//et\n\n   IBEX Limited\nUnaudited Consolidated Statements of Cash Flows\n\n//st\n\n       Quarter ended September 30,\n\nUS$ in thousands   2021         2020\n\nCASH FLOWS FROM\nOPERATING ACTIVITIES\n\nIncome / (loss)    $      3,607     $  (3,152)\nbefore taxation\n\nAdjustments to\nreconcile income\nbefore taxation to\nnet cash provided\nby operating\nactivities:\n\nDepreciation and      7,643    6,439\namortization\n\nAmortization of       (294)  205\nwarrant asset\n\nForeign currency      (22)  148\ntranslation (gain)\n/ loss\n\nFair value        (2,800)  3,586\nmeasurement of\nshare warrants\n\nShare-based payments      360      2,089\n\nAllowance of      (225)  243\nexpected credit\nlosses\n\nShare of profit       (225)  (123)\nfrom investment in\njoint venture\n\nGain on lease         (2)  (192)\nterminations\n\nProvision for         19       78\ndefined benefit\nscheme\n\nFinance expenses      2,110    2,239\n\nIncrease in trade     (7,597)  (10,727)\nand other\nreceivables\n\nIncrease in       (269)  (316)\nprepayments and\nother assets\n\nIncrease in trade     6,916    9,153\nand other payables\nand other\nliabilities\n\nCash inflow from      9,221    9,670\noperations\n\nInterest paid         (2,110)  (2,239)\n\nIncome taxes paid     (213)  (1,492)\n\nNet cash inflow    $      6,898     $  5,939\nfrom operating\nactivities\n\nCASH FLOWS FROM\nINVESTING ACTIVITIES\n\nPurchase of    $      (4,935)   $  (2,901)\nproperty and\nequipment\n\nPurchase of other     (389)  (310)\nintangible assets\n\nDividend received     205      115\nfrom joint venture\n\nNet cash outflow   $      (5,119)   $  (3,096)\nfrom investing\nactivities\n\nCASH FLOWS FROM\nFINANCING ACTIVITIES\n\nProceeds from line $      24,815    $  32,344\nof credit\n\nRepayments of line        (24,920)  (31,388)\nof credit\nProceeds from         -    1,714\nborrowings\n\nRepayment of      (2,238)  (2,796)\nborrowings\n\nNet proceeds from     -    63,107\ninitial public\noffering\n\nPayment of listing        -    (825)\nrelated cost\n\nPrincipal payments        (3,023)  (3,055)\non lease obligations\n\nDividend          -    (4,000)\ndistribution\n\nNet cash (outflow) $      (5,366)   $  55,101\n/ inflow from\nfinancing activities\n\nEffects of exchange       (269)  (35)\nrate difference on\ncash and cash\nequivalents\n\nNet (decrease) /   $      (3,856)   $  57,909\nincrease in cash\nand cash equivalents\n\nCash and cash  $      57,842    $  21,870\nequivalents at\nbeginning of the\nperiod\n\nCash and cash  $      53,986    $  79,779\nequivalents at end\nof the period\n\nNon-cash items\n\nNew leases        7,750    10,362\n\nAcquisition of        4,339    -\nfixed assets\nthrough increase in\naccounts payable\n\n//et\n\n   IBEX Limited\nReconciliation of IFRS Financial Measures to Non-GAAP Financial Measures\n\n   EXHIBIT 1: Adjusted net income and adjusted fully diluted earnings per\nshare\nWe define \"adjusted net income\" as net income / (loss) before the effect of\nthe following items: non-recurring expenses (including litigation and\nsettlement expenses, costs related to COVID-19, and listing costs, as\napplicable), amortization of warrant asset, foreign currency translation\ngains or losses, fair value measurement of share warrants, share-based\npayments, gain or loss on disposal of fixed assets and/or lease\nterminations, and impairment of intangibles, as applicable, net of the tax\nimpact of such adjustments. The following table provides a reconciliation\nof adjusted net income to net income / (loss) for the periods presented:\n\n//st\n\n     Quarter ended September 30,\n\n     2021         2020\n\nUS$ in   Amount       Per Share   Amount      Per Share\nthousands,\nexcept share\nand per share\namounts,\nunaudited\n\nNet income / $   3,014    $   0.16    $    (3,423)     $   (0.20)   (b)\n(loss)\n\nNon-recurring    862      0.05     4,398      0.26\nexpenses\n\nAmortization     (294)   (0.02)    205        0.01\nof warrant\nasset\n\nForeign      (22)   (0.00)    148        0.01\ncurrency\ntranslation\n(gain) / loss\n\nFair value       (2,800)   (0.15)    3,586      0.21\nmeasurement\nof share\nwarrants\n\nShare-based      360      0.02     2,089      0.12\npayments\n\nGain on lease    (2)   (0.00)    (192)     (0.01)\nterminations\n\nTotal    $   (1,896)   $   (0.10)   $    10,234     $   0.60\nadjustments\n\nTax impact of    (250)   (0.01)    (1,360)     (0.08)\nadjustments(a)\n\nAdjusted net $   868      $   0.05    $    5,451      $   0.32\nincome\n\nAdjusted net     0.8  %        5.0  %\nincome margin\n\nWeighed      18,246,672   0.05     16,368,143     0.33\naverage\nshares\noutstanding -\nbasic\n\nDilutive     602,467      (0.00)    666,796        (0.01)\nimpact of\nshare-based\ncompensation\nand the\nAmazon warrant\n\nWeighted     18,849,139   $   0.05     17,034,939   (c)   $   0.32\naverage\nshares\noutstanding -\ndiluted and\nadjusted\nfully diluted\nearnings per\nshare\n\n//et\n\n    *  The tax impact of each adjustment is calculated using the effective\ntax rate in the relevant jurisdiction.\n   *  For the period noted, the amount represents net income divided by the\nweighted average shares outstanding - diluted.\n   *  The weighted average shares outstanding - diluted for September 30,\n2020 reflect an additional 666,796 shares that are anti-dilutive on an IFRS\nbasis.\n\n   EXHIBIT 2: EBITDA and Adjusted EBITDA\nWe define \"EBITDA\" as net income / (loss) before the effect of the\nfollowing items: finance expenses (including finance expense related to\nright-of-use lease liabilities), income tax (benefit) / expense, and\ndepreciation and amortization (including depreciation on right-of-use\nassets). We define \"Adjusted EBITDA\" as EBITDA before the effect of the\nfollowing items: non-recurring expenses (including litigation and\nsettlement expenses, costs related to COVID-19, and listing costs, as\napplicable), amortization of warrant asset, foreign currency translation\ngains or losses, fair value measurement of share warrants, share-based\npayments, gain or loss on disposal of fixed assets and/or lease\nterminations, and impairment of intangibles, as applicable. The following\ntable provides a reconciliation of adjusted EBITDA to net income / (loss)\nfor the periods presented:\n\n//st\n\n        Quarter ended September 30,\n\nUS$ in thousands,   2021         2020\nunaudited\n\nNet income / (loss) $       3,014    $  (3,423)\n\nFinance expenses        2,110   2,239\n\nIncome tax expense      593     271\n\nDepreciation and        7,643   6,439\namortization\n\nEBITDA      $       13,360   $  5,526\n\nNon-recurring       862     4,398\nexpenses\n\nAmortization of         (294)  205\nwarrant asset\n\nForeign currency        (22)  148\ntranslation (gain) /\nloss\n\nFair value          (2,800)  3,586\nmeasurement of share\nwarrants\n\nShare-based payments        360     2,089\n\nGain on lease       (2)  (192)\nterminations\n\nAdjusted EBITDA     $       11,464   $  15,760\n\nAdjusted EBITDA         10.6 %  14.5 %\nmargin\n\n//et\n\n   EXHIBIT 3: Free cash flow\nWe define \"free cash flow\" as net cash provided by operating activities\nless cash capital expenditures.\n\n//st\n\n         Quarter ended September 30,\n\nUS$ in thousands,    2021         2020\nunaudited\n\nNet cash provided by     $        6,898   $  5,939\noperating activities\n\nLess:\n\nCash capital expenditures         5,324  3,211\n\nFree cash flow(1)    $        1,574   $  2,728\n\n//et\n\n    *  Excluded from free cash flow are the principal portion of\nright-of-use lease payments of $3,015 and $2,328 for the three months ended\nSeptember 30, 2021 and 2020, respectively. We believe it is useful to\nconsider these payments when analyzing free cash flow as these amounts\ndirectly relate to revenue generating assets used in operations.\n\n   EXHIBIT 4: Net debt\nWe define \"net debt\" as total debt less cash and cash equivalents.\n\n//st\n\n        September 30,   June 30,\n\n  US$ in thousands, unaudited   2021    2021\n\n  Borrowings\n\n  Current       $   26,950  $   26,716\n\n  Non-current       1,354   1,801\n\n        $   28,304  $   28,517\n\n  Leases\n\n  Current       $   13,780  $   12,121\n\n  Non-current       72,799      71,878\n\n        $   86,579  $   83,999\n  Total debt    $   114,883     $   112,516\n\n  Cash and cash equivalents     53,986      57,842\n\n  Net debt      $   60,897  $   54,674\n\n//et\n\nTel   : 441-295-6500    IBEX LTD\nWWW   : <a href=\"https://www.ibex.co\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.ibex.co</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132500548.MNPRE2132502998-13385620211122</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}