{"date": "2022-01-19 16:11:11.450000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>CONCIERGE TECHNOLOGIES INC (\"CNCG-0\")\n- Product Promotion With Prime Video\n\n    Concierge Technologies, Inc., a diversified global holding firm, today\nannounced that its wholly owned subsidiary, Original Sprout, is\ncollaborating with Prime Video and their recently released motion picture\nHotel Transylvania: Transformania.\n\n   Original Sprout customers are being invited to enter a Surprise &amp;\nDelight Sweepstakes via Original Sprout's social platforms, now through\nJanuary 20, where lucky winners will receive a Hotel Transylvania Prize\nPack, along with Original Sprout product.\n\n   \"What better way to kick off the new year than to collaborate with Prime\nVideo on the release of Hotel Transylvania: Transformania? We are big fans\nof this movie franchise, and excited to play a part in this newest\nrelease,\" said Michael Ambacher, general manager of Original Sprout, which\noffers a complete line of safe, effective, dermatologist-tested, 100% vegan\nhair and body products for the entire family.\n\n   \"We are always looking for innovative and fun ways to reward our loyal\ncustomers and believe this release is a great fit for our brand and\naudience. The theme, 'Start 2022 with a Transformed New Look,' was the\nideal message to start the new year,\"  Ambacher added.\n\n   Details for the Original Sprout Hotel Transylvania: Transformania\nSweepstakes will be announced and updated on the Original Sprout website\nwww.originalsprout.com and through social media outlets, encouraging their\ncustomers to engage with the chance to win the Prime Video Hotel\nTransylvania: Transformania Prize Packs.\n\n   Fusion Promotional Marketing helped secure and execute the partnership\nfor Original Sprout, working in conjunction with Allied Global Marketing\nand Prime Video.\n\n   About Original Sprout\n\n   Original Sprout, founded in 2003, offers a complete line of hair and\nskin care products, including their Classic line, Tahitian Collection and\nthe Worry-Free selection, all formulated and packaged in San Clemente, CA\nUSA. All products are completely non-toxic, 100% vegan &amp; cruelty free,\ngluten &amp; dairy free, have no petroleum oils, parabens or phytoestrogens,\ndioxanes, harmful sulfates, phthalates, formaldehyde &amp; propylene glycol.\nFree of clove (eye numbing agent), soy, strawberry &amp; peanut. The luxury\nTahitian Collection products perform at salon quality level, the Classics\nare blended especially for babies and toddlers, while the Worry-Free\nselection is the perfect combination of cost savings and performance sought\nafter by our Gen-Z clientele; all without the worry of harmful ingredients.\nOriginal Sprout products can be found online world-wide, or on the shelf at\nmany retailers, including Wholefoods, Sprouts Farmers Market, Target,\nLassens, Mothers Market &amp; Kitchen, specialty salons including Pigtails and\nCrewcuts, Regis Salons, CoolCuts4Kids, Disneyland and Disneyworld resorts,\nand Costco.com. Internationally, products can be found throughout the U.K,\nthe E.U., Malaysia, Singapore, New Zealand, Dubai, Africa, Canada, Saudi\nArabia and the Philippines. Original Sprout is a wholly owned subsidiary of\nConcierge Technologies.\n\n   About Concierge Technologies, Inc.\nConcierge Technologies, originally founded in 1996, was repositioned as a\nglobal holding firm in 2015, and currently has operating subsidiaries in\nfinancial services, food manufacturing, printing, security systems and\nbeauty products. Offices and manufacturing operations are in the U.S., the\nU.K., New Zealand and Canada. For more information, visit\nwww.conciergetechnology.net.\n\n   About Prime Video\n\n   Prime Video offers customers a vast collection of movies, series, and\nsports--all available to watch on hundreds of compatible devices.\n\n   *   Included with Prime Video: Watch movies, series, and sports,\nincluding Thursday Night Football. Enjoy series and films including\nCinderella, Emmy Award-nominated satirical superhero drama The Boys,\nlimited series The Underground Railroad, and the films Sylvie's Love and\nUncle Frank; and the smash hits Coming 2 America, Tom Clancy's Without\nRemorse, The Tomorrow War, Tom Clancy's Jack Ryan, Upload, and My Spy, as\nwell as Emmy- and Golden Globe-winners Fleabag and The Marvelous Mrs.\nMaisel, Golden Globe-winner Small Axe, Academy Award-winner Sound of Metal,\nGolden Globe-winner and Academy Award-nominee Borat Subsequent Moviefilm,\nand Academy Award-nominees One Night in Miami... and Time. Prime members\nalso get access to licensed content.\n\n       *   Prime Video Channels: Prime members can add channels like\ndiscovery+, Paramount+, BET+, EPIX, Noggin, NBA League Pass, MLB.TV, STARZ,\nand SHOWTIME--no extra apps to download, and no cable required. Only pay\nfor the ones you want, and cancel anytime.  View the full list of channels\navailable at amazon.com/channels.\n\n       *   Rent or Buy: Enjoy new-release movies to rent or buy, entire\nseasons of current TV shows available to buy, and special deals just for\nPrime members.\n\n       *   Instant access: Watch at home or on the go with your choice of\nhundreds of compatible devices. Stream from the web or using the Prime\nVideo app on your smartphone, tablet, set-top box, game console, or select\nsmart TV.\n\n       *   Enhanced experiences: Make the most of every viewing with 4K\nUltra HD- and High Dynamic Range (HDR)-compatible content. Go behind the\nscenes of your favorite movies and TV shows with exclusive X-Ray access,\npowered by IMDb. Save it for later with select mobile downloads for offline\nviewing.\n\n   Prime Video is just one of many shopping, savings and entertainment\nbenefits included with a Prime membership, along with fast, free shipping\non millions of Prime-eligible items at Amazon.com, ultrafast grocery\ndelivery and pickup, unlimited photo storage, exclusive deals and\ndiscounts, prescription savings, and access to ad-free music, books and\ngames. To sign up or start a 30-day free trial of Prime, visit:\namazon.com/prime.\n\nOriginal Sprout\nMichael Ambacher\n888-805-2229\n\nKaren Hill\n949-482-1963\nkaren@fusionpromos.com\n\nConcierge Technologies\nInvestor Relations\nRoger Pondel\nPondelWilkinson\n310-279-5965\nrpondel@pondel.com\n\nTel   : 866-800-2978    CONCIERGE TECHNOLOGIES INC\nFax   : 888-312-0124\nEmail : info@conciergetechnology.net\nWWW   : <a href=\"http://conciergetechnology.net\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://conciergetechnology.net</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201800433.MNPRE2201802001-07521120220119</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}