{"date": "2021-12-22 17:41:43.862000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.34, "close": 3421.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-abstract\"><p>Prione Business Services Pvt Ltd, the joint venture (JV) between Infosys co-founder N R Narayana Murthy\u0092s Catamaran Ventures and Amazon, will be acquired by the e-commerce giant subject to regulatory approvals.</p></div><div class=\"tr-npp-lead\"><p>On August 9, 2021, the partners had announced their decision to not continue with the JV beyond the end of its current term of May 2022.</p><p>\u0093Amazon will acquire Catamaran\u0092s shareholding in Prione in compliance with applicable laws, including all assets and liabilities,\u0094 said an Amazon spokesperson on Wednesday.</p></div><div class=\"tr-npp-body\"><p>He added, \u0093The businesses of the joint venture shall continue under the leadership of the current management. On receipt of regulatory approvals, the board of Prione &amp; Cloudtail (owned by Prione) will take steps to complete the transaction in compliance with applicable laws.\u0094</p><p>In August this year, Amazon and Catamaran Ventures \u0093mutually decided\u0094 to not continue their JV beyond the end of its current term. The JV, which has been running successfully for the past seven years, was coming up for renewal on May 19, 2022.</p><p>The JV had enabled over 300,000 sellers and entrepreneurs to go online. It also enabled 4 million merchants with digital payment capabilities, providing small and medium-sized businesses (SMBs) and merchants access to millions of customers across the country.</p><p>The relationship between Murthy and Amazon founder Jeff Bezos dates back to 2014, when Prione, a 49:51 JV between Amazon and Murthy\u0092s venture capital company Catamaran, was formed.</p><p>In 2019, the JV was restructured after the government issued Press Note 2, stipulating that foreign e-commerce marketplaces cannot sell products of their group companies on their platforms.</p><p>Following this, Catamaran Ventures increased its stake in Prione to 76 per cent, reducing Amazon Asia\u0092s stake to 24 per cent.</p><p>Prione\u0092s mission was to enable SMBs to grow in e-commerce, which was at a nascent stage in India.</p><p>With operations in Bengaluru, Delhi and Mumbai, Prione has over 700 employees and a reach in at least 150 Indian cities.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}