{"date": "2021-11-14 02:35:04.644000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3525.15, "close": 3540.7}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>A team of researchers from the San Ignacio de Loyola University (USIL) has been working on the prevention of Alzheimer's, Parkinson's and other neurodegenerative diseases, based on the study of two exotic fruits from our Amazon: aguaje and camu camu, which stand out for their high content of vitamin C. Neurodegenerative diseases are diseases that affect the nervous system. Currently, there is no cure for these. Its main characteristics are progressive memory loss and involuntary movement in the form of tremor, respectively.</p><p>?An important characteristic is that Alzheimer's and Parkinson's do not appear overnight. Studies indicate that before 15 to 20 years certain metabolic biases may appear that could lead to it. If we deal with it, from the molecular point of view, with the antioxidants, vitamins and all the components that we are studying, we can prevent the appearance of these diseases ?, indicated Dr. Luis ?ngel Aguilar Mendoza, principal investigator of the project.</p></div><div class=\"tr-npp-body\"><p>According to figures from the Ministry of Health (MINSA), it is estimated that in Peru about 200 thousand people suffer from Alzheimer's and another 30 thousand from Parkinson's. In addition, these diseases appear mainly in the long-lived population and are produced by a genetic cause. This leads to the reason being unknown, being a possible cause the imbalance of antioxidants present in the body.</p><p>?It is necessary to investigate the possible neuroprotective function of camu camu and aguaje for human consumption, first going through neuronal cell culture studies, studies in animals such as rats and, finally, the preparation of solid foods such as chocolates and liquids such as juices and juices, to prevent Alzheimer's and Parkinson's, specifying the appropriate amount of consumption in order to achieve the expected results, ?the researcher reported.</p><p>This research has also determined that these fruits have a great amount of vitamin C, anthocyanins and polyphenols, which are important molecules to be able to fight metabolic diseases, which cause these degenerative diseases.</p><p>It is for this reason that, through prevention and using the antioxidant properties of these fruits, such as camu camu, which has 32 times more vitamin C than lemon, it is possible to cleanse and detoxify the cells of the body. In addition, in this project that focuses on improving people's quality of life, a group of neurologists, neuropsychologists, biochemists, molecular biologists, radiologists and psychiatrists in charge of diagnosis in an interdisciplinary way participate. \"We are a group of Peruvians who have been working to revalue what is ours and give our people an opportunity, and as professionals give a lot for Peru and the world,\" explained Dr. Aguilar.</p><p>This project, developed for the first time in our country, has the support of the Peruvian Amazon Research Institute. For its execution, it has been receiving financing from Concytec, through its executing unit Prociencia.</p><p>Finally, it should be noted that the USIL will present this research at the Peru Con Ciencia Fair, which will be held for the second consecutive year virtually from November 8 to 12, where it will also be possible to know the progress of some initiatives developed by various public institutions , academic and cooperation for the benefit of society. To participate in the most recognized national scientific fair, enter through the link <a href=\"https://peruconciencia.pe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://peruconciencia.pe</a></p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}