{"date": "2021-12-04 04:17:44.146000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3437.36, "close": 3427.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Read Article Qlik announced that it has achieved Amazon Web Services (AWS) Migration and Modernization Competency status for AWS Partners. This designation recognizes Qlik as an AWS Partner that has demonstrated technical proficiency and proven custome...</p><p>Qlik announced that it has achieved Amazon Web Services (AWS) Migration and Modernization Competency status for AWS Partners. This designation recognizes Qlik as an AWS Partner that has demonstrated technical proficiency and proven customer success automating and accelerating customer application migration and modernization journeys.</p></div><div class=\"tr-npp-body\"><p>AWS launched the AWS Migration and Modernization Competency to allow customers to easily and confidently engage with highly specialized AWS Partners that help customers modernize their applications, either before or after they move to AWS. The AWS Migration and Modernization Competency takes on the heavy lifting of identifying and validating industry leaders with proven customer success and technical proficiency in migration and application modernization tooling.</p><p>\"Being named as one of the first AWS Partners to achieve the new AWS Migration and Modernization Competency reinforces Qlik's track record of helping customers innovate in the cloud and leverage AWS as a platform in their transformation efforts,\" said Itamar Ankorion, SVP of Technology Alliances at Qlik. \"We look forward to continuing our mutual efforts in supporting customers' ability to combine Qlik and AWS to scale the power of modern analytics across their organization.\"</p><p>The AWS Migration and Modernization Competency is the latest milestone in Qlik's continued work with AWS centered around maximizing the value of cloud analytics. Qlik has been an AWS Advanced Technology Partner since 2020 and Qlik Sense® SaaS is available in AWS Marketplace. Qlik also holds a variety of AWS designations, including Amazon Redshift Ready Product validation for data analytics, and Amazon Relational Database Service (Amazon RDS) Ready Product validation for its data analytics platform. The breadth and depth of integrations and designations all point to customers being able to confidently deploy AWS technology alongside Qlik to drive more value from all their data in the cloud.</p><p>Achieving the AWS Migration and Modernization Competency differentiates Qlik as an AWS Partner with deep domain expertise delivering software products that help customers embrace cloud and application transformation, reducing licensing costs, optimizing operational costs, and improving performance, agility, and resiliency. These tools can perform an application portfolio assessment, identifying the applications that are candidates for modernization; the tools augment and automate developer tasks to carry out the modernization of legacy applications.</p><p>\"The AWS Migration and Modernization Competency raises the bar again by choosing to solve the hardest challenge faced in application migration and modernization,\" said Bill Platt, General Manager, AWS Migration Services. \"I am confident that solutions, validated by the AWS Migration and Modernization Competency, will provide a complete portfolio of migration and modernization solutions to customers and partners.\"</p><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}