{"date": "2021-05-28 13:36:39.401000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3416.0, "close": 3499.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>ENPNEWSWIRE-(C)2021 ENPUBLISHING</p><p>Release date- 28052021 - Industrial Software Leader Joins Forces with Global Resources Company to Deliver Innovative Solutions Across the Value Chain to Optimize Performance and Return on Investment.</p></div><div class=\"tr-npp-body\"><p>AVEVA, a global leader in industrial software, driving digital transformation and sustainability, today announced that it has strengthened its strategic partnership with global resource company BHP to deliver increased productivity across multiple assets.</p><p>AVEVA's Flex Subscription program will provide BHP with flexibility in how it purchases, designs, and uses industrial software thereby removing the traditional barriers to adoption, responding to evolving market demands faster and enhancing business agility.</p><p>'Adopting this technology will help BHP better support our operating assets around the globe,' said Pat Bourke, BHP Vice President of Technology, Minerals Australia. 'With greater visibility of operational data from sites, including at our remote operating canters, we can improve our decision making and efficiency. And, we will also be able to better manage our products across assets by tracking production of ore and inventory. Working collaboratively with AVEVA, we have put in place a commercial framework and partnering model that leverages their capability and solutions, unlocks our own latent capacity, improves data quality, and mitigates cyber security risks in BHP's operational technology (OT) environments.'</p><p>As well as providing flexibility in the use of industrial, engineering and operations software, the AVEVA Flex Subscription program also simplifies the consumption of new capabilities and makes digital transformation easier change to adopt.</p><p>'The recent global pandemic has accelerated the adoption of digitalization and organizations that have leveraged this fundamental change have seen immediate benefit. AVEVA Flex eliminates the traditional barriers to the adoption of technology and digital assets by ensuring that our industry partners can choose from a scalable set of solutions aligned to specific business goals and objectives,' said AVEVA's Vice President, Pacific, Damien McDade.</p><p>'Flexibility and the need for business agility are driving the demand for subscription licensing. AVEVA is the only industrial infrastructure software vendor to offer full portfolio coverage within a subscription, alongside the flexibility to maintain perpetual licensing in the deployment mix. AVEVA will help BHP deploy innovative solutions across its value chain from the conceptualization of technology and process through to decommissioning legacy systems,' McDade concluded.</p><p>About BHP</p><p>BHP is a world-leading resources company. We extract and process minerals, oil, and gas, with more than 80,000 employees and contractors, primarily in Australia and the Americas. Our products are sold worldwide, with sales and marketing led through Singapore and Houston, United States. Our global headquarters are in Melbourne, Australia. Our corporate purpose is to bring people and resources together to build a better world. We do this through our strategy: to have the best capabilities, best commodities, and best assets, to create long-term value and high returns. We are among the world's top producers of major commodities, including iron ore, metallurgical coal, and copper. We also have interests in oil, gas, and energy coal. For more details visit: www.bhp.com</p><p>About AVEVA</p><p>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence. AVEVA's comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries. Learn more at www.aveva.com.</p><p>Copyright 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</p><p>Enquiries:</p><p>AVEVA Media Contacts</p><p>Rose Bambi</p><p>Senior Director Global PR and External Communications</p><p>Tel: +44 (0) 208 323 2789</p><p>rose.bambi@aveva.com</p><p>Caroline Stephens</p><p>Senior Global PR Manager</p><p>caroline.stephens@aveva.com</p><p>Catherine Singh</p><p>Global PR/Social Media Coordinator</p><p>catherine.singh@aveva.com</p><p>External Communications Alias</p><p>external.communications@aveva.com</p><p>[Editorial queries for this story should be sent to newswire@enpublishing.co.uk]</p><p>((Comments on this story may be sent to info@enpublishing.co.uk))</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 M2 Communications Ltd.</p></div>"}