{"date": "2022-01-21 04:09:45.541000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3125.98, "close": 2852.86}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Jan. 21 -- In a first the online commerce empire, Amazon is taking another step into the real world with plans announced Thursday to open a shop in Los Angeles that would be its first bricks-and-mortar clothing store.</p><p>An Amazon Style store to launch later this year is to let customers use the retailer's app to scan QR codes of garments, chose from sizes and colors, then have items sent to fitting rooms to try on, according to a blog post.</p></div><div class=\"tr-npp-body\"><p>The move to expand its retail presence with a physical clothing store comes as authorities and competitors raise warnings over the Seattle-based firm accumulating too much control over the market.</p><p>This move would come on the heels of Amazon's 2017 acquisition of the Whole Foods Market grocery chain for $13.7 billion, which significantly expanded the e-commerce giant's presence in physical retail.</p><p>Fitting rooms in the Style shop are designed to be a \"personalized space\" where shoppers will find items they requested through the app along with options added based on their choices, according to Amazon.</p><p>\"Our machine learning algorithms produce tailored, real-time recommendations for each customer as they shop,\" Amazon said.</p><p>Customers will be able to share style preferences in the app, if they want, to better customize recommendations. The app also lets people see reviews about items from other shoppers.</p><p>Touchscreens in fitting rooms will let people continue to shop, with items delivered \"in just minutes\" for them to try on, according to Amazon.</p><p>\"This fast delivery is made possible by Amazon Style's on-site operations, with advanced technologies and processes used in Amazon fulfillment centers,\" the company said. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}