{"date": "2021-11-29 14:06:18+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>\n      Today at AWS re:Invent, Fortinet is pleased to announce new Cloud Consulting Service offerings in <a href=\"https://www.fortinet.com/products/cloud-firewall-security/fortigate-aws.html?utm_source=blog&amp;utm_campaign=aws-fortinet-overview-main-page\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS</a> Marketplace to help customers simplify and future-proof their application journeys on AWS and across <a href=\"https://www.fortinet.com/resources/cyberglossary/what-is-hybrid-cloud?utm_source=blog&amp;utm_campaign=what-is-hybrid-cloud\" data-type=\"url\" class=\"tr-link\" translate=\"no\">hybrid</a> and <a href=\"https://www.fortinet.com/solutions/enterprise-midsize-business/cloud-security.html?utm_source=blog&amp;utm_campaign=multi-cloud\" data-type=\"url\" class=\"tr-link\" translate=\"no\">multi-clouds</a>. The new services provide expert guidance, and in some cases custom-built cloud architectures, giving organizations of all sizes the ability to approach <a href=\"https://www.fortinet.com/solutions/enterprise-midsize-business/cloud-security.html?utm_source=blog&amp;utm_campaign=cloud-security\" data-type=\"url\" class=\"tr-link\" translate=\"no\">cloud</a> in a thoughtful, security-driven, and operationally efficient manner to meet their cloud journey goals of today and tomorrow.\n    </p>\n              <h4>\n      Digital Acceleration, Work-from-Anywhere, and Accidental Multi-clouds are Leaving Security Gaps\n    </h4>\n              <p>\n      When I speak to customers about their current cloud migration initiatives, most have expedited their journey to the cloud in response to external factors such as the need to support digital acceleration efforts or the push to enable employees to <a href=\"https://www.fortinet.com/solutions/enterprise-midsize-business/network-access/teleworker-work-remote.html?utm_source=blog&amp;utm_campaign=telework\" data-type=\"url\" class=\"tr-link\" translate=\"no\">work from anywhere</a> (WFA). Often organizations have ended up with an \"accidental multi-cloud\" made up of disparate tools and solutions to address different functions and applications. Unfortunately, moving to the cloud quickly has left many dealing with increased operational and deployment complexities, loss of visibility, and increased security risks, particularly in light of skills and resource gaps. When it comes to security, many have found that the biggest threat to their cloud deployments is not the threats themselves, but misconfiguration.\n    </p>\n              <h4>\n      Fortinet Introduces New Cloud Services in AWS Marketplace\n    </h4>\n              <p>\n      Amongst our customers, there is unanimous agreement that the future of cloud will remain fluid, and organizations need adaptable cloud solutions to provide them with flexibility to incrementally build toward their cloud of tomorrow. To get there, many teams need help rationalizing and designing a viable roadmap to successfully deploy the right solutions and cloud architectures to realized their digital accelerations goals for today and tomorrow. To support these customers, Fortinet is announcing new offerings in AWS Marketplace to make migrating and securing the AWS Cloud and multi-cloud environments as simple as possible:<br/></p>\n              <h4>\n      JumpStart Consulting Services with AWS Marketplace\n    </h4>\n              <p>\n      For those early in their cloud journey, Fortinet is now offering two \"JumpStart\" services to help customers design the optimal architecture and successfully deploy and configure a <a href=\"https://aws.amazon.com/marketplace/pp/prodview-cgfprxqhk6p4a?sr=0-4&amp;ref_=beagle&amp;applicationId=AWSMPContessa\" data-type=\"url\" class=\"tr-link\" translate=\"no\">FortiGate-VM next-generation firewall</a> or <a href=\"https://aws.amazon.com/marketplace/pp/prodview-i53u57jsebyiy?sr=0-14&amp;ref_=beagle&amp;applicationId=AWSMPContessa\" data-type=\"url\" class=\"tr-link\" translate=\"no\">FortiWeb-VM web application firewall</a> on AWS Cloud. Each JumpStart Consulting Service includes a five-day engagement and two free VM instances for one year.\n    </p>\n              <ul class=\"bulleted-list arrowlist\">\n                <li>\n                  <strong>Cloud Security Posture Assessment Service</strong>\n                </li>\n              </ul>\n              <p>\n      Fortinet's Cloud Security Posture Assessment (CSPA) service enables customers to lower business risks, augment skilled staff, and execute cloud in a thoughtful manner. Through the CSPA service, Fortinet assesses your AWS deployments to identify potential risks and provide recommendations to improve your overall security posture. A proactive assessment to identify and address potential misconfiguration can help fortify cloud deployments against threats and security risks.\n    </p>\n              <ul class=\"bulleted-list arrowlist\">\n                <li>\n                  <strong>Network &amp; Application Security Consulting Service</strong>\n                </li>\n              </ul>\n              <p>\n      Fortinet additionally offers a custom engagement for those looking for a tailored experience. Not every organization has the time or in-house expertise to set up a holistic security architecture across private and public cloud environments that is resilient enough to withstand the continuous changes in the threat landscape. To meet this need, Fortinet has assembled some of the industry's top cloud architects to provide strategic guidance. Our experts partner with business leaders to help them discover, align, and guide their organizations through the cloud-enablement journey. The end result is a custom-built cloud security architecture design that is based on best practices with consistent security that spans the entire multi-cloud environment.\n    </p>\n              <p>\n      The Network &amp; Application Security Consulting Service takes a vendor-agnostic approach that takes advantage of the most appropriate products and solutions regardless of vendor. The services help organizations:\n    </p>\n              <ul class=\"bulleted-list arrowlist\">\n                <li>\n        Identify existing security solutions\n      </li>\n                <li>\n        Align findings to business goals\n      </li>\n                <li>\n        Guide current projects\n      </li>\n                <li>\n        Create a roadmap to guide future cloud security integration\n      </li>\n              </ul>\n              <p>\n      All of the Fortinet Cloud Security Consulting service listings are available now through AWS Marketplace.\n    </p>\n              <h4>\n      Fortinet Secures Cloud Applications on AWS and Across Hybrid and Multi-Cloud Deployments\n    </h4>\n              <p>\n      Fortinet's entire of portfolio of <a href=\"https://www.fortinet.com/solutions/enterprise-midsize-business/cloud-security.html?utm_source=blog&amp;utm_campaign=cloud-security\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Adaptive Cloud Security</a> solutions provide tight integrations across AWS technologies and empowers customers with a seamless and streamlined cloud journey. And because our solutions are integrated with the <a href=\"https://www.fortinet.com/solutions/enterprise-midsize-business/security-fabric.html?utm_source=blog&amp;utm_campaign=security-fabric\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Fortinet Security Fabric</a> - the industry's highest-performing cybersecurity mesh architecture - customers benefit from simplified operations and increased security effectiveness with consistent policies, centralized management and visibility across their AWS and hybrid or multi-cloud deployments.\n    </p>\n              <p>\n      Fortinet also offers the broadest portfolio of integrated cloud security products across the top cloud providers, as well as the broadest support from Fortinet Fabric-Ready ecosystem partners. This enables enterprises to more effectively secure and interconnect with applications and workloads running across their entire cloud deployment.\n    </p>\n              <p>\n                <span>\n                  <a href=\"https://www.fortinet.com/resources/security-consulting-services/aws-cloud-consulting\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Learn more</a>\n                </span>\n                <span>about all of Fortinet's Cloud Consulting service offerings on AWS.</span>\n              </p>\n              <p>\n                <span>Learn how <a href=\"https://www.fortinet.com/solutions/enterprise-midsize-business/cloud-security?utm_source=blog&amp;utm_campaign=multi-cloud\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Fortinet's adaptive cloud security solutions</a> provide the necessary visibility and control across cloud infrastructures, enabling secure applications and connectivity from data center to cloud.</span>\n              </p>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.fortinet.com/blog/business-and-technology/fortinet-announces-new-service-offerings-on-aws-including-custom-built-cloud-architectures\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Fortinet Inc.</strong> published this content on <strong>29 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>29 November 2021 14:06:18 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Fortinet Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Fortinet-Inc.</p></div>"}