{"date": "2022-02-24 13:52:42+00:00", "ticker": "AAL", "mrkt_info": {"open": 3576.5, "close": 3595.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-story-p1\"><span class=\"tr-dateline\">GABORONE, Feb 24 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>De Beers is bringing its sales activities back to Botswana's capital Gaborone, it said on Thursday, almost two years after the COVID-19 pandemic forced them to be held in cities including Antwerp and Dubai.</p><p>The Anglo American <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAL.L\" data-type=\"ric\" data-ric=\"AAL.L\" translate=\"no\" dir=\"ltr\">AAL.L</a> subsidiary had moved its pre-sale viewings - a marketing exercise to showcase its new batch of diamonds - from Botswana in May 2020 when travel restrictions to curb the pandemic prevented its international customers from flying to the Southern African country. </p><p>Customers from across the world fly ten times a year to participate in week-long diamond sales, known as sights, in Botswana, which accounts for 90% of the company's total annual sales.</p><p>\"From March, we are bringing back the sights to Gaborone and we look forward to meeting again as an industry after a long time,\" De Beers Executive Vice-President Diamond Trading Paul Rowley told a press briefing.</p><p>\"We will of course maintain some flexibility for some customers who will still not be able to come to Botswana.\"</p><p>The return is expected to bring in valuable foreign exchange to Botswana, which had lost out additional earnings from travel, hospitality and ancillary services, even though sales income still came to the country.</p><p>The majority of diamond mining in the country is done by Debswana, a company jointly held by De Beers and the Botswana government, which sells 75% of the diamonds mined to De Beers. The remaining 25% of the diamonds is sold to state-owned Okavango Diamond Company. </p><p>Apart from the large business delegations who visit the country ten times a year, the pre-sale viewings are known to attract more than 100 high net worth diamond magnates who spend heavily in the country.</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Brian Benza in Gaborone; Editing by Promit Mukherjee and Barbara Lewis)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:promit.mukherjee@thomsonreuters.com\" data-type=\"email\" translate=\"no\">promit.mukherjee@thomsonreuters.com</a> ; +27 64833 4448; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: BOTSWANA-DE BEERS/</p></div>"}