{"date": "2021-12-07 16:05:00.166000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>\n<b>Magnify Announces CTO and Co-Founder Sajo Jacob</b>\n</p><p>\n<b>Jacob brings deep technical vision and leadership experience from Amazon, Microsoft</b>\n</p><p>\nMagnify, a startup that transforms the customer experience through post-sales orchestration, announced today that <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.linkedin.com%2Fin%2Fsajojacob%2F&amp;esheet=52546053&amp;newsitemid=20211207005424&amp;lan=en-US&amp;anchor=Sajo+Jacob&amp;index=1&amp;md5=1730f6fd05df04475189a33fdf5fe97a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Sajo Jacob</a> has joined Magnify as CTO and co-founder. This announcement comes on the heels of a recent announcement of a $6M Seed Series raise led by Madrona Venture Group, Decibel, and a who’s who of PNW SaaS executives.\n</p><p>\nJacob (his preferred name) leads Magnify’s engineering and product teams, helping to bring to life the vision of automating and personalizing the customer experience for software through code.\n</p><p>\nJacob brings a depth of experience in automation, enterprise software, and building successful engineering teams to Magnify. He was recently at Amazon where he was a GM and Head of Engineering, leading large global engineering and product teams that worked on digital commerce platforms and new products in Devices &amp; Services. During his 8-year tenure at Amazon, he led cross-disciplinary teams across engineering, product, and applied science on problems spanning e-commerce lifecycle, content moderation, risk/fraud detection, analytics and product growth. Before Amazon, Jacob spent his professional career in the enterprise world, which included being one of the early members on the Microsoft Azure team, helping architect and migrate multi-billion dollar products like Office and Windows to the cloud, and leading engineering efforts for Fortune 500 companies across several verticals.\n</p><p>\n“I’m incredibly excited about Magnify and our mission to transform the customer experience in software through automation. Over the last couple of decades, the industry has moved from Data silos to BI to AI. We live in a world where ‘data-driven<span>’</span> decision making is the standard but processing that data to extract insights and actions still requires humans. Without the help of AI-powered orchestration of the customer experience, enterprise product and customer success teams struggle to react quickly to customer needs while drowning in data and BI spreadsheets. We need to evolve to AI-driven orchestration and do this at scale across verticals--essentially, ‘AI as a Service.’ Magnify’s vision is exactly that in the post-sales enterprise software space,” commented Jacob.\n</p><p>\nMagnify CEO and co-founder, Josh Crossman adds, “Jacob is a proven, world-class technology leader with the very rare and special combination of cutting-edge technical insight, enterprise software experience, and values-driven leadership. I’m looking forward to collaborating with him to build our product and technical teams, and more importantly, partnering to build a remarkable company.”\n</p><p>\nMagnify is <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.magnify.io%2Fopportunities&amp;esheet=52546053&amp;newsitemid=20211207005424&amp;lan=en-US&amp;anchor=actively+hiring&amp;index=2&amp;md5=fe0ec1220d3b559bc196e1e579acc92b\" data-type=\"url\" class=\"tr-link\" translate=\"no\">actively hiring</a> across product and engineering teams, including product managers, senior developers, engineers, and technical leaders. Magnify has a remote-first culture, with a physical presence for engineering in Seattle, WA, along with their Bend, OR offices.\n</p><p>\n<b>About Magnify:\n<br/></b>Magnify transforms the enterprise software customer experience by automating and optimizing the many different touchpoints that customers experience when they onboard and use software. It simplifies and reduces work for Customer Success and Product teams, integrating with their existing systems.\n</p><p>\nUsing AI and ML, Magnify creates the ideal sequence and timing of your customer interactions, from emails to videos to product alerts. Designed to drive deep adoption and usage in a customer account, Magnify will identify where churn or expansion is likely and automatically launch the appropriate action in software. Magnify is a no-code tool that integrates with existing customer experience products.\n</p><p>\nMagnify recently closed $6M in seed funding from Madrona Venture Group, Decibel Partners (led by GP <b>Sudip Chakrabart</b><b>i</b>), and a bevy of PNW SaaS executives, including <b>Bill Richter</b>,<b> </b>CEO of Qumulo;<b> Christal Bemont</b>,<b> </b>CEO of Talend;<b> Elissa Fink</b>, former Tableau CMO; <b>Jon Gelsey</b>, former Xnor and Auth0 CEO; <b>Will Arora</b>, CTO of Assurance, and several others.\n</p><p>\nTo learn more about Magnify, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fmagnify.io&amp;esheet=52546053&amp;newsitemid=20211207005424&amp;lan=en-US&amp;anchor=magnify.io&amp;index=3&amp;md5=6dad83db6632452c0d581088ca2e4492\" data-type=\"url\" class=\"tr-link\" translate=\"no\">magnify.io</a>.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211207005424r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMjA3MDA1NDI0cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=74c1abab2b842975a4f9255f18b3a97a5ec1f0fbe8cac692b4c08d23708fe8c1032a842514e30b6187d0e54f0e03462aa3fa7e53ca4008588be576db79ed0e96\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211207005424/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211207005424/en/</a></span></p><p>\nErika Shaffer\n<br/><a href=\"mailto:erika@madrona.com\" data-type=\"email\" translate=\"no\">erika@madrona.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-MAGNIFY</p></div>"}