{"date": "2021-12-04 20:42:35.992000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3389.79, "close": 3523.29}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>As part of the signing activities of the inter-institutional cooperation framework agreement, which allows promoting sustainable businesses towards an economy that encourages impact investments, the regional governor, Juan Alvarado Cornelio, and the representatives of the NGO Conservation International, the Business Alliance for the Amazon, the United States Agency for International Development (USAID, for its acronym in English), visited the Regional Conservation Area ?Bosque Montano de Carpish?.</p><p>The regional president indicated that it is important to continue working to take care of the environment and avoid greater ecological disasters such as predation, which occurs due to the need of farmers to work for a better quality of life. \"Man must learn to conserve the space that surrounds him to leave a more stable planet for future generations,\" he added; at the same time, he thanked USAID for the work it does for the benefit of the environment.</p></div><div class=\"tr-npp-body\"><p>The USAID Environmental Governance specialist, ?lvaro Gaillour, indicated that Hu?nuco has a great challenge with the cooperation agreement with the Business Alliance for the Amazon project, ?we are happy to have the opportunity to sign this agreement with the governor, who it will develop in a period of 5 years ?, he explained, in addition to bringing private budgets for ecological businesses and the search for markets.</p><p>The senior technical director of Conservation International, Claudio Snaider, said that this is the time to amend our mistakes and show that human beings can live in harmony with nature, therefore it is important to work together as allies with the Hu?nuco Regional Government and communities of this part of the ACR Carpish.</p><p>The director of the Business Alliance for the Amazon, Janet Benavides, showed her joy at coming to work in her homeland (Hu?nuco), to generate that the business initiatives of Hu?nuco contribute to caring for the environment, ?we will work with different strategies, which it includes technical assistance and financing mechanisms, that is why we continue to coordinate to achieve the proposed goals for mitigation and adaptation to climate change ?, he said.</p><p>During the presentation ceremony of the project and visit of ACR Carpish, the regional manager of Natural Resources and Environmental Management, Silvia Sullca Parra, also reported that farmers in the area have partnered to start businesses such as Carpish organic coffee and the activity of beekeeping.</p><p>Finally, it should be noted that this project will contribute to the transition of the region towards an economy that encourages impact investments, providing opportunities to strengthen conservation that contribute to national climate goals and Sustainable Development Goals.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}