{"date": "2021-11-20 09:27:34.156000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3696.06, "close": 3572.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>India</p></div><div class=\"tr-npp-lead\"><p>India, Nov. 19 -- The Jabalpur police has told online shopping sites such as Flipkart and Amazon to stop delivery of flip-open knives in the city after it came across multiple instances where people including young women were carrying such knives, colloquially referred to as Chinese knives, people familiar with the matter said.</p><p>The knives came under the spotlight after the accused in two murders over the past month were found to have used the flip-open knife. A female engineering student arrested by Gorakhpur police in Jabalpur for carrying the knife said she wasn't the only one, and many women carried the knife for protection.</p></div><div class=\"tr-npp-body\"><p>When the police inquired, it turned out that everyone bought the knife from online shopping sites.</p><p>\"When we checked with the shopping sites, they informed us that 2,300 Chinese knives were sold in the past one year to residents of Jabalpur,\" said superintendent of police, Jabalpur, Siddharth Bahuguna.</p><p>Bahuguna said they sought a list of people who purchased the knives online and started the process of taking action against them.</p><p>Under the Arms Act, it is illegal to carry a knife with a blade longer than 9 inches and a width of 2 inches, or more.</p><p>The district police chief said he has ordered all police stations to put out notices and awareness posters informing people that Chinese knives are banned in the city and file FIRs under the Arms Act against people carrying such knives.</p><p>Additional superintendent of police Rohit Keswani said it wasn't that the police will start booking everyone who bought the knife. \"The action will be taken against people as per the size and purpose of purchase of knives,\" he said.</p><p>The engineering student who found herself on the wrong side of the law because of the knife, said: \"Many women carry this knife for self-protection and because it was a foldable folding knife so it is easy to carry\".</p><p>\"The police came to me and checked my bag like I am a criminal. Later, they took me to the police station. My family is still in shock because of this incident,\" said the student who was released on bail in the case. Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}