{"date": "2021-12-14 11:06:38+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Foo Yun Chee</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">BRUSSELS, Dec 14 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>A key European Parliament committee agreed on Tuesday to a ban on \"dark patterns\" <span class=\"tr-strong\">that trick web users </span>and advertising <span class=\"tr-strong\">targeting</span> minors as part of new rules aimed at U.S. tech giants, taking a tougher stand that could spell trouble in forthcoming negotiations with EU countries.</p><p>The Digital Services Act (DSA) is a landmark set of rules proposed by European Commission antitrust chief Margrethe Vestager in response to the slow pace of competition investigations which targets Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, Apple <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a>, Alphabet <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a> unit Google and Facebook <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a>.</p><p>The goal is to force the firms to do more to tackle illegal content on their platforms, with fines of up to 6% of global turnover for non-compliance.</p><p>Vestager's proposal needs to be ironed out with EU countries and EU lawmakers next year before it can become law, the first in the world. </p><p>EU countries last month agreed to a common position, in general sticking to the Commission's draft rules. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2SG1VY\" data-type=\"storyId\" data-story-id=\"nL8N2SG1VY\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>The <span class=\"tr-strong\">Internal Market and Consumer Protection Committee's </span>position, which needs the green light from Parliament next month, includes a ban on dark patterns which are practices that online platforms use to mislead people into giving personal data to companies or otherwise trick them.</p><p>The <span class=\"tr-strong\">committee</span> also agreed to a ban on targeted advertising for minors, extensive rules that requires online platforms to be more transparent on their algorithms and rules on pornography.</p><p>Christel Schaldemose, who is steering the DSA through <span class=\"tr-strong\">Parliament</span>, said her proposal also took aim at platforms' algorithms.</p><p>\"We are moving in the direction where we get the algorithms to play by the democratic rulebook, they haven't done so today but they will do in future,\" <span class=\"tr-strong\">Schaldemose</span> told Reuters in an interview.  </p><p>\"We are doing lots of things to reduce the risks on democracy, we have done a lot of things in order to make it easier, more safe for consumers, we have created a level playing field for companies using the platforms,\" she said.</p><p>EU lawmaker Dita Charanzova said the draft rules address a lot of issues raised by Facebook whistleblower Frances Haugen.</p><p>\"Not only will they (online platforms) have to remove illegal content, but will have to assess the real harms that come from their services for minors and general civil discourse. They will have to act and do so in a transparent way. This is something they have not yet been forced to do,\" she told Reuters.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Foo Yun Chee; editing by Jason Neely)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:foo.yunchee@thomsonreuters.com\" data-type=\"email\" translate=\"no\">foo.yunchee@thomsonreuters.com</a> ; +32 2 287 6844; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://foo.yunchee.thomsonreuters.com@reuters.net\">foo.yunchee.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: EU-TECH/RULES</p></div>"}