{"date": "2021-12-14 14:27:10.079000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>CBD LIFE SCIENCES INC (\"CBDL-0\")\n- Introduces First Bitcoin ATM Machine at Retail Location\n\n   CBD Life Sciences through its wholly owned subsidiary, LBC Bioscience\nInc. announces that the company is going to be placing a Bitcoin ATM\nMachine in one of its retail locations in the upcoming weeks.\n\n   CBD Life Sciences Inc. has been producing several effective strategies\nand one of these strategies is to place a Bitcoin ATM Machine in one of its\nretail locations and as time goes on put about a dozen more machines in\nother CBD locations along with Medical Marijuana Facilities as the company\nmoves forward. The Bitcoin ATM Machine CBD Life Sciences Inc. is working\nwith is called the Finney3 which is the newest machine out on the market as\nof today. A bitcoin ATM allows customers to buy bitcoin and other\ncryptocurrencies. The use of \"ATM\" is a misnomer. The machines are not\nactually ATMs and do not dispense cash. Rather, they are kiosks that\nconnect to the bitcoin network and allow customers to purchase crypto\ntokens with deposited cash. Bitcoin ATMs are rarely operated by major\nfinancial institutions and do not connect customers to a bank account.\nPresident &amp; CEO Lisa Nelson states \"Overall, cryptocurrency is the future\nand by placing these kiosks in multiple locations, it will bring more foot\ntraffic into someone's store.\" Lisa Nelson also states, \"As a team, our\ngoal is to be one step ahead of the competition and I think this is a great\nidea to help not only us, but other companies as well that may be\ninterested in getting one of these machines in their store.\"\n\n   One of the most popular benefits of Bitcoin ATMs is the privacy they\noffer. Bitcoin was designed to be a private, secure, and decentralized unit\nof exchange. When you transfer Bitcoin from one wallet to another, the\nrecord of this is visible for anyone to see. However, as there is no link\nbetween your wallet and your identity, transactions are kept 100% private.\nAnother reason for using Bitcoin ATMs, is they are very secure. While\nexchanges are commonly hacked and scams abound online, physical Bitcoin\nATMs are pretty much tamper-proof. Besides being highly secure, Bitcoin\nATMs also offer an instant way to buy or sell cryptocurrencies. Although\ntransactions on online exchanges are speedy, the signup process can be very\ndrawn out.\n\n   The number of benefits CBD has is tremendous! These benefits may help\nwith behavioral/neurological complications such as ADD/ADHD, anxiety,\nautism, bipolar, OCD, PTSD, epilepsy, Parkinson's, osteoporosis, and ALS.\nCBD may also benefit pain management that can stem from\nheadaches/migraines, arthritis, cramps, spinal injuries, and fibromyalgia.\nCBD has been found to also have gastrointestinal benefits with\ngastro-disorders and complications such as anorexia, cachexia, Crohn's,\ndiabetes, and nausea. Physical complications/disorders such as muscular\ndystrophy and even immune system-based deficiencies and other complications\nsuch as cancer and hypertension even our bodies way and ability to maintain\nhomeostasis have all been said to benefit from CBD.\n\n   LBC BIOSCIENCE INC. ONLINE STORE\n\n   LBC BIOSCIENCE'S Online Emporium\n\n   LBC Bioscience Inc. is well stocked already as it is with some very\nhigh-quality CBD offerings - all at very reasonable prices. Check out LBC\nBioscience Inc's newest product offerings including its: 100MG CBD Bath\nBombs in a variety of scents, Delta 8 Gummies, 1500 MG Premium Berry Drops,\nand a variety of all-new Skincare products. Or shop our top selling\nproducts (based on order frequency) which include our CBD Pain Cream, CBD\nOils and CBD Pet Treats.\n\n   Become a Distributor\n\n*  Large Selection of Products (over 50 items and growing)\n*  100% USA Made Products \"organic &amp; kosher.\"\n*  All Products are THC-FREE (they contain 0.00% THC)\n*  Weekly Deals (new deals every week)\n*  25% off on all products using code \"LBC25.\"\n\n   LBC Bioscience Inc. accepts: Visa, MasterCard, American Express,\nDiscover etc.\n\n   Shareholders and interest holders may also stay current with LBC\nBioscience Inc Updates:\n\n   LBC Bioscience Inc's Main Website at www.lbcbioscienceinc.com\nTwitter: <a href=\"https://www.twitter.com/lbcbioscience\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.twitter.com/lbcbioscience</a>\nFacebook: <a href=\"https://www.facebook.com/lbcbioscience\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.facebook.com/lbcbioscience</a>\nInstagram: <a href=\"https://www.instagram.com/lbcbioscience\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.instagram.com/lbcbioscience</a>\n\n   Amazon: <a href=\"https://www.amazon.com/shops/lbcbioscienceinc\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.amazon.com/shops/lbcbioscienceinc</a>\n\n   eBay: <a href=\"https://www.ebay.com/usr/lbcbioscience\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.ebay.com/usr/lbcbioscience</a>\n\n   Alibaba: <a href=\"https://lbcbioscience.trustpass.alibaba.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://lbcbioscience.trustpass.alibaba.com</a>/\n\n   About LBC Bioscience Inc.\nLBC Bioscience Inc. is a wholly owned subsidiary of CBD Life Sciences Inc.\nLBC has developed and is retailing/wholesale a full line of cannabidiol\nbased organic products including CBD Drops, Gumballs, Honey Sticks, Pain\nRelief Creams, Anxiety &amp; Sleep Supplements, Edibles, Coffee, Skincare Line,\nPet Line, Tablets and more. LBC's products can be viewed and purchased on\nthe Company's website at www.lbcbioscienceinc.com.\n\n   Ten Associates LLC\n\nForward-Looking Statements\n\n   Except for the historical information contained herein, the matters\ndiscussed in this press release are forward-looking statements. Actual\nresults may differ materially from those described in forward-looking\nstatements and are subject to risks and uncertainties. See CBD Life\nSciences, Inc's, Inc.'s filings with OTC Markets, which may identify\nspecific factors that may cause actual results or events to differ\nmaterially from those described in the forward-looking statements.\n\n   Safe Harbor Statement\n\n   This release includes forward-looking statements, which are based on\ncertain assumptions and reflects management's current expectations. These\nforward-looking statements are subject to a number of risks and\nuncertainties that could cause actual results or events to differ\nmaterially from current expectations. Some of these factors include:\ngeneral global economic conditions; general industry and market conditions,\nsector changes and growth rates; uncertainty as to whether our strategies\nand business plans will yield the expected benefits; increasing\ncompetition; availability and cost of capital; the ability to identify and\ndevelop and achieve commercial success; the level of expenditures necessary\nto maintain and improve the quality of services; changes in the economy;\nchanges in laws and regulations, including codes and standards,\nintellectual property rights, and tax matters; or other matters not\nanticipated; our ability to secure and maintain strategic relationships and\ndistribution agreements. The Company disclaims any intention or obligation\nto update or revise any forward-looking ability to secure and maintain\nstrategic relationships and distribution agreements. The Company disclaims\nany intention or obligation to update or revise any forward-looking\n\nThomas E. Nelson\nTelephone: (480) 326-8577\nEmail: tenassociates33@gmail.com\nWebsite: www.tenassociatesllc.com\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134700180.MNPRE2134701592-06255720211214</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}