{"date": "2022-01-21 23:00:17+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3033.35, "close": 2890.88}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\"><li class=\"tr-summaryitem\">A labor board official found merit to claims that firing was unlawful</li><li class=\"tr-summaryitem\">Complaint will be issued unless Amazon settles</li><li class=\"tr-summaryitem\">Company was accused of interfering with Alabama union election</li></ul><p class=\"tr-by\">By Daniel Wiessner</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Jan 21 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> may soon face claims from a U.S. labor board that it unlawfully fired a vocal union supporter at a New York warehouse in the midst of an organizing campaign.</p><p>A National Labor Relations Board (NLRB) official in Brooklyn recently found that claims involving the worker, Daequan Smith, had merit and plans to issue a complaint against Amazon unless the company settles the case, board spokeswoman Kayla Blado said in an email on Friday.</p><p>The development was first reported by Bloomberg. </p><p>Amazon did not immediately respond to a request for comment. </p><p>A new complaint against Amazon would fuel claims by labor organizers and advocacy groups that the company uses unlawful tactics to thwart unionizing while placing profits over worker safety. </p><p>In November, a NLRB official found that Amazon unlawfully interfered with a union election at an Alabama facility in which workers overwhelmingly voted against unionizing. The results of a second election will be tallied at the end of March. </p><p>Smith worked at an Amazon warehouse in Staten Island, New York, that is the subject of a more recent election petition by a group of employees. A fundraising campaign launched on Smith's behalf in November says he was left homeless after his firing. </p><p>The NLRB has the power to reinstate workers who are fired for engaging in union activities and to compensate them for lost work, but cannot grant other types of money damages. </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Daniel Wiessner in New York, Editing by Alexia Garamfalvi and Bill Berkrot)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:daniel.wiessner@thomsonreuters.com\" data-type=\"email\" translate=\"no\">daniel.wiessner@thomsonreuters.com</a> ; 518-414-0693) )</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-LABOR/ (PIX)</p></div>"}