{"date": "2022-02-09 13:27:09.249000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>PLANTING HOPE CO INC (\"MYLK-V;MYLKF-0\")\n- Launches Hope and Sesame(R) Non-GMO Sesamemilk in Sustainable\n- Shelf-Stable Cartons\n\n     The Planting Hope Company Inc. (\"Planting Hope\" or the \"Company\"), a\nplant-based food and beverage company focused on producing the world's most\nnutritious and planet-friendly products, has launched a line of six Non-GMO\nProject Verified flavors of award-winning Hope and Sesame(R) Sesamemilk in\nshelf-stable, planet-friendly 1L Tetra Pak cartons. Shelf-stable, Non-GMO\nsesamemilk is now available in Unsweetened Original, Unsweetened Vanilla,\nOriginal, Vanilla, Chocolate, and Chocolate Hazelnut flavors. Shelf-stable\nHope and Sesame(R) Sesamemilk is packaged in planet-friendly, recyclable\nTetra Pak cartons, and requires no refrigeration to maintain the freshness\nand quality for an extended period of time.\n\n     The full Non-GMO Hope and Sesame(R) Sesamemilk product suite is\navailable through established online retailers and e-commerce wholesalers\nin both the United States and Canada. In the United States, Hope and\nSesame(R) Sesamemilk is available for consumers to purchase at the brand's\nwebsite, HopeandSesame.com, as well as Amazon.com and Deliciousness.com,\nand is available to wholesale customers at Faire.com and Tundra.com. Online\nbuying platforms Faire.com and Tundra.com connect brands with retailers and\nhave a combined total of over 375,000 merchants in over 15,000 cities\nworldwide, with the added benefit of a merchant network that can reach and\ncapture customers outside of traditional purchasing channels. In Canada,\nNon-GMO Hope and Sesame(R) Sesamemilk is currently available for wholesale\npurchase through EcoIdeas and will be available to consumers later this\nweek at EcoIdeas.ca.\n\n     \"We are excited to launch our nutrient-dense, planet-friendly, Non-GMO\nProject Verified Hope and Sesame(R) Sesamemilk, featuring our new branding\nwhich brings to life the magic of sesame,\" said Julia Stamberger, CEO and\nCo-Founder of Planting Hope. \"Shelf-stable cartons lock in taste and\nnutrients for an extended period, allowing our customers to stock their\npantries with sesamemilk and always have enough on hand to meet their\nfamily's needs.\"\n\n     Hope and Sesame(R) Sesamemilk\n\n*  Vegan\n*  Like dairy milk, sesamemilk provides a complete source of protein: 8\ngrams of protein per serving (complete protein = contains all nine of the\nessential amino acids that humans need to obtain from food sources)\n*  An excellent source of vitamin D and calcium\n*  Certified Gluten-Free\n*  Certified Kosher\n*  Non-GMO Project Verified\n*  Certified by the Plant Based Foods Association\n*  Unsweetened flavors contain 0 grams of sugar and are keto-friendly\n\n     Hope and Sesame(R) has unlocked the dense nutrition in tiny sesame\nseeds to create a delicious plant milk that is both ultra-nutritious and\nhighly sustainable. Hope and Sesame(R)'s full product line-up now features\nNon-GMO sesamemilk in both refrigerated and shelf-stable formats: three\nflavors in refrigerated 48 oz bottles (Unsweetened Original, Unsweetened\nVanilla, and Chocolate Hazelnut); and six flavors in shelf-stable 1L Tetra\nPak cartons (Unsweetened Original, Unsweetened Vanilla, Original, Vanilla,\nChocolate, and Chocolate Hazelnut), as well as recently launched Barista\nBlend, specially formulated to perform like a dream in hot and cold\nbeverages.\n\n     About Hope and Sesame(R)\n\n     Hope and Sesame(R) has cracked the code on unlocking the dense\nnutrition in tiny sesame seeds to create an important new trend in plant\nmilk: sesamemilk, both ultra-nutritious and highly planet-friendly. Sesame\nis sustainable, requiring very little water to cultivate, it's naturally\ndrought- and pest-resistant, and can self-pollinate. Sesamemilk is\nnutritionally comparable to dairy milk, delivering 8g of complete protein\nper serving (including all 9 essential amino acids) - that's 8x the protein\nin most nut milks and 3x the protein in most oat milks. Hope and Sesame(R)\nSesamemilk is vegan, a good source of protein, an excellent source of\nvitamin D and calcium, is Certified Gluten-Free and Certified Kosher, and\nis free from soy and dairy. All Hope and Sesame(R) products are Non-GMO\nProject Verified and Certified by the Plant Based Foods Association. Hope\nand Sesame(R) was awarded Best Milk Alternative and Best Plant-Based\nSustainability in FoodBev's 2021 World Plant-Based Food Awards and its\nsignature Chocolate Hazelnut flavor received the 2020 Sofi Award for Best\nNew Product, Plant-Based Milk from the Specialty Food Association.\n\n     About The Planting Hope Company Inc.\n\n     Planting Hope develops, launches and scales uniquely innovative\nplant-based and planet-friendly food and beverage brands. Planting Hope's\naward-winning and cutting-edge products fill key unmet needs in the\nskyrocketing plant-based food and beverage space. The Planting Hope brand\nfamily includes Hope and Sesame(R) Sesamemilk, RightRice(R) Veggie Rice,\nMozaics(TM) Real Veggie Chips, and Veggicopia(R) Veggie Snacks. Founded by\nexperienced food industry entrepreneurs, Planting Hope is a women-managed\nand woman-led company with a focus on nutrition, sustainability, and\ndiversity. For more information visit: www.plantinghopecompany.com.\n\nContact:\nJulia Stamberger\nCEO and Co-founder\n(773) 492-2243\njulia@plantinghopecompany.com\n\nRachel Kay Public Relations\nBecca Stonebraker\n(818) 383-3929\nbecca@rkpr.net\n\nCaroline Sawamoto\nInvestor Relations\n(773) 492-2243\nir@plantinghopecompany.com\n\n     Neither the TSX Venture Exchange nor its Regulation Services Provider\n(as that term is defined in the policies of the TSX Venture Exchange)\naccepts responsibility for the adequacy or accuracy of this release.\n\n     Forward-Looking Statement\n\n     This news release contains \"forward-looking statements\" or\n\"forward-looking information\" (collectively referred to hereafter as\n\"forward-looking statements\") within the meaning of applicable Canadian\nsecurities legislation. All statements that address activities, events, or\ndevelopments that the Company expects or anticipates will, or may, occur in\nthe future, including statements about the Company's ability to execute on\nits goals, the timing pertaining to these goals the potential demand for\nthe Company's products, the timing and success of anticipated product\nlaunches and distribution of the Company's products, and the Company's\nbusiness prospects, future trends, plans and strategies. In some cases,\nforward looking statements are preceded by, followed by, or include words\nsuch as \"may\", \"will,\" \"would\", \"could\", \"should\", \"believes\", \"estimates\",\n\"projects\", \"potential\", \"expects\", \"plans\", \"anticipates\", \"continues\", or\nthe negative of those words or other similar or comparable words. In\npreparing the forward-looking statements in this news release, the Company\nhas applied several material assumptions, including, but not limited to,\nthe assumption that demand for the Company's product will be sustained or\nincrease in accordance with management's projections, that the Company's\ncurrent business objectives can be achieved and that its other corporate\nactivities will proceed as expected, and that general business and economic\nconditions will not change in a materially adverse manner. Although the\nmanagement of the Company believes that the assumptions made and the\nexpectations represented by such statements are reasonable, there can be no\nassurance that any forward-looking statement herein will prove to be\naccurate. Forward-looking statements involve known and unknown risks,\nuncertainties, and other factors which may cause the actual results,\nperformance, or achievements of the Company to be materially different from\nany future results, performance, or achievements expressed or implied by\nsuch forward-looking statements. Although management of the Company has\nattempted to identify important factors that could cause actual results to\ndiffer materially from those contained in forward-looking information,\nthere may be other factors that cause results not to be as anticipated,\nestimated, or intended. Risks and uncertainties applicable to the Company,\nas well as trends identified by the Company affecting its industry can be\nfound in the Company's annual information form dated January 6, 2022 and\nthe Company's continuous disclosure record available on SEDAR at\nwww.sedar.com. Such cautionary statements qualify all forward-looking\nstatements made in this news release. The Company undertakes no obligation\nto update or revise any forward-looking statements, whether as a result of\nnew information, future events, or otherwise, except as required by\napplicable law.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203900057.MNPRE2203900849-05255920220209</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}