{"date": "2021-11-18 08:34:53+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>Abu Dhabi : du, from Emirates Integrated Telecommunications Company (EITC), showcased at ADIPEC a live use case of a 5G controlled robot, powered by du’s 5G Private Network with Athonet’s cloud native 5G Standalone (5G SA) core network, and running on Amazon Web Services (AWS) Snowball Edge.</p>\n<p>The live demonstration relied on robotic solutions from Energy Robotics, and can be adapted to a variety of use cases, including providing 5G ultra reliable low latency connectivity (URLLC) to remote-controlled robots that handle on-site inspection in hazard environment such as energy applications, manufacturing, security surveillance, and others. These robots would have the capability to see, hear, measure, move, and act autonomously in any challenging and hazard environments. This improves the safety of facilities by ensuring reliable inspections and by capturing high quality data and processing it at the edge for faster actions.<br/>\n<br/>\nSaleem Al Blooshi, Chief Technology Officer, EITC, said, \"5G SA network is a key enabler to support enterprise use cases such as energy, utilities, manufacturing and agriculture. In collaboration with AWS, du can extend the compute capabilities along with IoT/AI/ML use cases to our enterprise customers premises through our fastest and most capable 5G network in the UAE. Our efforts to improve the efficiency and performance of our network have resulted in us delivering the fastest network speeds in the UAE, which is a testament to our commitment to providing the best 5G network for enterprises and consumers across UAE.”</p>\n<p>Utilizing du’s 5G SA Private Network, the demoed solution is powered by AWS Snowball Edge, an edge compute and storage device with on-board S3 storage and EC2 compute for disconnected mode ruggedized environments. AWS Snowball Edge can do local data analytics and edge-computing workloads in addition to transferring data between local environments and AWS. Athonet's next generation Connectivity Platform - based on the industry-leading Private 5G SA Core - enables cost-effective deployment of high-performance 5G networks.</p>\n<p>The 5G SA Private Networks can power mission-critical systems and applications that require ultra-reliable (99.999%) and low latency (~ one millisecond), with very high security. du’s private 5G networks can provide customers with a scalable, customizable platform to take advantage of the comprehensive set of AWS edge-to-cloud services and solutions that package IoT, artificial intelligence (AI), ML, robotics, analytics, compute, and storage capabilities to help customers achieve business outcomes across common industrial workloads.</p>\n<p>“We are delighted to work with innovative companies like du and AWS to power 5G-SA private mobile solutions in the region,” said Gianluca Verin, CEO of Athonet. “We enable operators like du to deploy agile private networks on customer premises that combine localized connectivity and control with access to the infinite resources and applications of AWS.”</p>\n<p>-Ends-</p>\n<p><strong>About du</strong></p>\n<p><span>Operating under the steadfast umbrella of Emirates Integrated Telecommunications Company (EITC), du is an integral driver of the UAE’s economic, social and digital transformation. Thriving on digitally innovating all facets of the contemporary telecom experience, we touch the lives of millions of customers everyday as a dedicated enabler of connectivity, continuity and growth across consumer and enterprise segments. Whether delivering state-of-the-art Smart City infrastructure, bespoke enterprise ICT solutions, government communications, secure data solutions, or the very best in home entertainment and value, we are a reliable telco and ICT player shaping the future of communication for a more connected tomorrow.</span></p>\n<p><a href=\"http://du.ae\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://du.ae</a> </p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}