{"date": "2021-12-10 00:25:09.483000+00:00", "ticker": "ABDN", "mrkt_info": {"open": 242.6, "close": 236.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ABERDEEN INCOME CREDIT STRATEGIES FUND (\"ACP.PR.A-N\")\n- Declares Quarterly Dividend for Its 5.25% Series a Perpetual\n- Preferred Shares\n\n     The Board of Trustees of Aberdeen Income Credit Strategies Fund (the\n\"Fund\"), has declared a cash distribution of $0.328125 per share of the\nFund's 5.250% Series A Perpetual Preferred Shares (NYSE:ACP PRA) (\"Series A\nPreferred Shares\"). The distribution is payable on December 31, 2021 to\nholders of Series A Preferred Shares of record on December 20, 2021\n(ex-dividend date December 17, 2021).\n\n    The Series A Preferred Shares trade on the NYSE under the symbol \"ACP\nPRA\", are rated \"A2\" by Moody's Investors Service and have an annual\ndividend rate of $1.3125 per share. The Series A Preferred Shares were\nissued on May 10, 2021 at $25.00 per share and pay distributions quarterly.\n\n     Distributions may be paid from sources of income other than ordinary\nincome, such as net realized short-term capital gains, net realized\nlong-term capital gains and return of capital. The actual amounts and\nsources of the amounts for tax reporting purposes will depend upon the\nFund's investment experience during the remainder of its fiscal year and\nmay be subject to changes based on tax regulations. In January 2022, a Form\n1099-DIV will be sent to shareholders, which will state the amount and\ncomposition of distributions and provide information with respect to their\nappropriate tax treatment for the 2021 calendar year.\n\n     You should not draw any conclusions about the Fund's investment\nperformance from the amount of this distribution.\n\n     In the United States, abrdn is the marketing name for the following\naffiliated, registered investment advisers: Aberdeen Standard Investments\nInc., Aberdeen Asset Managers Ltd., abrdn Australia Limited, abrdn Asia\nLtd., Aberdeen Capital Management, LLC, Aberdeen Standard Investments ETFs\nAdvisors LLC and Aberdeen Standard Alternative Funds Limited.\n\n     Closed-end funds are traded on the secondary market through one of the\nstock exchanges. The Fund's investment return and principal value will\nfluctuate so that an investor's shares may be worth more or less than the\noriginal cost. Shares of closed-end funds may trade above (a premium) or\nbelow (a discount) the net asset value (NAV) of the fund's portfolio. There\nis no assurance that the Fund will achieve its investment objective.\n\n     If you wish to receive this information electronically, please contact\nInvestor.Relations@abrdn.com\n\n     For More Information\nContact:\nAberdeen Standard Investments Inc.\nInvestor Relations\n1-800-522-5465\nInvestor.Relations@abrdn.com\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134200708.MNPRE2134203310-16223720211209</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}