{"date": "2022-02-25 19:44:26.517000+00:00", "ticker": "AAL", "mrkt_info": {"open": 3595.0, "close": 3823.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Anglo American has released financial results for 2021.</p><p>Strong market dynamics and operational performance drive underlying EBITDA of $20.6 billionFinancial highlights for the year ended 31 December 2021** Underlying EBITDA of $20.6 billion: strong demand and prices, and resilient operational performance** Profit attributable to equity shareholders of $8.6 billion** Net debt of $3.8 billion (0.2x underlying EBITDA): strong cash generation partially offset by investment in growth** $6.2 billion shareholder return: capital discipline and commitment to return excess cash? $2.1 billion proposed final dividend, equal to $1.18 per share final dividend, consistent with our 40% payout policy, and $0.50 per share special dividend? $4.1 billion return announced at half year, including $1.0 billion special dividend and $1.0 billion buyback** Exit from thermal coal operations completedMark Cutifani, Chief Executive of Anglo American, said: \"In a year of two distinct halves, we recorded strong demand and prices for many products as economies recouped lost ground, spurred by government stimulus. Copper and PGMs - essential to the global decarbonisation imperative - and premium quality iron ore for greener steelmaking, supported by an improving market for diamonds, all contributed to a record financial performance, generating underlying EBITDA of $20.6 billion.\"We generated attributable free cash flow of $7.8 billion due largely to a strong price environment in the first half, which moderated in the second half. Our return on capital employed of 43% was well above our targeted 15% through-the-cycle return, as it should be in times of strong pricing, and we increased our mining EBITDA margin to 56%. We are resolutely committed to capital discipline and to maintaining a strong and flexible balance sheet. At the end of 2021, net debt of $3.8 billion, or 0.2x underlying EBITDA, reflects the strong cash generation of the business, partially offset by our investments in growth. The proposed final dividend of $1.18 per share, in line with our 40% payout policy, in addition to a special dividend of $0.50 per share, will bring our total return to shareholders in respect of 2021 to $6.2 billion (including our share buyback), equal to $4.99 per share.\"We continue to make progress in reducing fatal incidents and our broader safety processes and procedures. Sadly, however, we still lost one colleague in a vehicle incident in Peru. Our total injury frequency rate tracked up marginally, after multiple years of progressive improvement, reflecting the changed operating configurations necessary to manage Covid-19. Our health focus remains on helping keep our people protected from Covid-19. In many ways, the pandemic has proven more challenging in 2021, particularly where vaccination roll-outs have been slower and uptake lower. We have provided significant monetary and other support to accelerate vaccination rates, including by using our own health facilities and encouraging vaccination at the earliest opportunity.\"Our balanced investments are driving margin-enhancing volume growth of 35%(1) over the next decade, including copper from Quellaveco, due to start up mid-year. The large majority of our output and investment capital is focused on future-enabling products - metals and minerals essential for decarbonisation and to meet global consumer demand. Through our integrated technology and sustainability programme, we are well positioned to run the business safely and sustainably, further enhance our competitive position and - disciplined with our capital - deliver value-adding growth as a foundation for future returns.\"SafetyAnglo American's most important priority is always safety - keeping our colleagues safe and well. We also look beyond safety, working towards everyone being better off and healthier having worked for Anglo American. This drives our thinking and the commitment to quality of life and sustainable livelihoods across the company. We continue to make progress in reducing fatal incidents and our broader safety processes and procedures. Sadly, however, we still lost one colleague in a vehicle incident on our major project in Peru. Our total injury frequency rate tracked up marginally, after multiple years of progressive improvement, reflecting the changed operating configurations necessary to manage Covid that tend to disrupt planned work routines. The increase in the first half of the year reduced in the second half as we reinforced the importance of these new routines across the business.On fatal incidents, our Elimination of Fatalities Taskforce has supported a 93% reduction in fatal incidents since 2013 and we are engaging with our non-managed joint operations and our approach to influencing better performance, as they reported three fatal incidents in the year. For us, every loss of life is a tragedy, and we will continue to mobilise our resources across the Group to support our zero harm imperative.HealthWe tackle the threats to health and wellbeing wherever we find them, with separate programmes for physical and mental health - including our Living with Dignity programme to help tackle gender-based and domestic violence; for creating a healthier working environment; and for encouraging healthy lifestyles. We are paying greater attention to psychological safety, intrinsic to embedding a safety-conscious mindset, establishing a steering group to investigate psychological safety issues while also introducing the thinking into an array of other programmes.Our health focus remains on helping keep our people protected from Covid-19, while sustaining our work to continuously improve our key health measures. The pandemic proved to be more challenging in 2021, particularly in those countries where vaccination roll-outs lagged. We provided significant monetary and other support to accelerate vaccination rates, using our own health facilities and encouraging vaccination at the earliest opportunity, including in many host communities. With the pandemic as a backdrop, we are pleased to have met our three major annual improvement targets for health - for occupational disease, noise exposure and inhalable hazards.Recognising the link between employee health and broader community wellbeing, in 2021 we completed community health improvement strategies for our operations in support of our Sustainable Mining Plan targets. Building on our extensive Covid-19 support, implementation of these strategies will begin in 2022.EnvironmentOur Sustainable Mining Plan (SMP) includes commitments to be a leader in environmental stewardship. By 2030, we aim to: reduce GHG emissions (Scopes 1 and 2) by 30%; improve energy efficiency by 30%; achieve a 50% net reduction in freshwater abstraction in water-scarce areas; and deliver net-positive impacts in biodiversity wherever we operate.Our environmental performance continues to improve, with no Level 5 or 4 incidents in 2021. This achievement reflects the improvements to our planning and operating disciplines across the business. We launched a 'no repeats' challenge during the year to help us learn from low level incidents and prevent repeats of a similar nature across the business, which has led to improvements in controls, specifically helping to prevent significant incidents.Energy consumption increased in line with production following the operational shutdowns during the first half of 2020 due to the pandemic. Nevertheless, we achieved an 8% reduction in GHG emissions due to our Copper business in Chile moving to a renewable electricity supply in 2021, thereby reducing its Scope 2 emissions, as well as a reduction in methane emissions from our metallurgical coal mines in Australia.We have a target to be carbon neutral across our operations by 2040, and an ambition to reduce our Scope 3 emissions by 50%, also by 2040. We are making encouraging progress. In 2020, around one third of the electricity Anglo American used globally was drawn from renewables. Having secured 100% renewable electricity supply across our operations in South America, by 2023 we expect to be drawing 56% of our global grid supply from renewables.Socio-politicalAs we grow our business and improve our performance, so our total tax contribution increases, benefiting host countries. Total taxes and royalties borne and collected in 2021 amounted to $7.1 billion, an 89% increase from 2020. We also made further progress with our enterprise and supplier development initiatives, supporting 147,374 jobs in the year - a key component of our SMP goal to support five jobs offsite for every job onsite by 2030.PeopleTightly linked to our safety imperative and our Values, we strive to create a workplace that is safe in every respect, inclusive and that empowers every colleague to bring their whole self to work. We have zero tolerance for any form of bullying, harassment or victimisation and we know there is no room for complacency when it comes to culture in any organisation. To that end, we have extensive training, systems and processes in place to keep improving both physical and psychological safety, with an increased focus on addressing gender-based and domestic violence since 2019, including in host communities. We will continue to embed and launch initiatives that will allow us to realise our vision of a truly inclusive workplace where every employee can reach their full potential.We also continue to make progress against our diversity goals, including to achieve 33% female representation in management by 2023. The proportion of women at this level increased to 31% (2020: 27%), while female employees across the company represent 23% of our workforce.WeCare - our global response to the pandemicAnglo American acted quickly at the onset of the pandemic to support the lives and livelihoods of our workforce and host communities through the health, social and economic effects of the Covid-19 pandemic - through our global \"WeCare\" response programme. Our mines and host communities, which are also often home to much of our workforce, operate as an ecosystem and both must be healthy to prosper. Across our operational footprint and in those communities that are local to our operations, WeCare provides information and extensive practical support across four pillars of: physical health, mental health, Living with Dignity, and community response:Physical health - education and behavioural change to support personal health and hygiene; health screening and testing; PPE and medical equipment and facilities; vaccination information programme; and support for government-led vaccination programmes, including licensing our own medical facilities in South Africa to vaccinate employees, to encourage vaccination at the earliest opportunity.Mental health - employee support programmes, including via our employee app, expanding the number of professionally trained mental health first aiders, and online events and other digital materials.Living with Dignity - direct employee and community support to combat the prevalence of gender-based and domestic violence; work with health authorities to identify abuse cases and referrals to support mechanisms.Community response - wide-ranging livelihoods programme to support communities through the social and economic effects of the pandemic, including: public information campaigns aimed at health and hygiene; health screening and Covid-19 testing; support for health service provision; continuation of essential services (e.g. water, energy, accommodation); food package distribution; employee match-giving programme; support for SMEs and entrepreneurs; support for teachers and students; job training for post-pandemic employability; and regional development planning to enhance local economic activity for the long term.Anglo American Foundation - special endowment of $100 millionBuilding on the extensive in-kind support and financial contributions as part of the WeCare programme detailed above, in July 2021 we committed to endowing the Anglo American Foundation with a $100 million donation. The Anglo American Foundation is focused on accelerating progress towards the United Nations' Sustainable Development Goals (UNSDGs), placing a particular importance on programmes that empower women, youth and vulnerable groups. By partnering with non-profit, public and private organisations, the Anglo American Foundation supports health, education, economic and environmental projects aligned with the goals of Anglo American's Sustainable Mining Plan - itself designed to align with the UNSDGs.This special endowment presented an opportunity for the Foundation to redefine its strategy, including governance and operating model, to ensure it can deliver to an entirely new level - creating systemic impact at scale. Aligned with Anglo American's Purpose, the Foundation will become a strategic grant-maker focusing on long-term system-level change within three themes, each with two 'signature' topics:** Clean water and energy: water resource management; access to (clean) energy / off-grid solutions** Skills and job creation for growth: development of relevant skills for current and future jobs (focus on youth); incubating innovative tech; and supporting SMEs and entrepreneurs** Healthy living: access to primary health care; preventative health careGeographically, the Foundation focuses its funding on the current, and potential future, footprint of Anglo American. During 2022, the Foundation is working with strategic partners to detail the priority areas of focus and design a number of programmatic interventions.Operational and financial review of Group results for the year ended 31 December 2021Operational performanceImproved operational performances at PGMs, De Beers and Kumba (Iron Ore) contributed to a 5% production increase on a copper equivalent basis(1). This was driven in part by the easing of certain Covid-19 related restrictions that impacted production throughout 2020, as well as improved mining performance and processing stability at PGMs, planned higher rough diamond production at De Beers in response to strong consumer demand, and improved plant availability at Kumba. These improvements were partially offset by the continued suspension of longwall operations at Grosvenor, operational issues and geological conditions at Moranbah (Metallurgical Coal), unplanned maintenance at Minas-Rio (Iron Ore), and licensing delays at Nickel. In response to the pandemic, comprehensive safeguarding measures remain in place at operations, which have helped a return to more normal operating levels, with production generally maintained at approximately 95%(2) of normal capacity across the year.De Beers' rough diamond production increased by 29% to 32.3 million carats (2020: 25.1 million carats), in response to the strong recovery in consumer demand following the impact of Covid-19 in 2020.Copper production was in line with the prior year at 647,200 tonnes (2020: 647,400 tonnes). At Los Bronces, production increased marginally by 1% to 327,700 tonnes (2020: 324,700 tonnes) due to higher water availability owing to water management initiatives, partially offset by planned lower grades. A strong plant performance at Collahuasi improved attributable production to a record 277,200 tonnes (2020: 276,900 tonnes).Nickel production decreased by 4% to 41,700 tonnes (2020: 43,500 tonnes), due to licencing delays and lower ore grades.PGMs' production (metal in concentrate) increased by 13% to 4,298,700 ounces (2020: 3,808,900 ounces), reflecting the impact in 2020 of the temporary shutdown of operations in response to the Covid-19 pandemic, the improved mining performance at both Amandelbult and Mogalakwena, as well as processing stability. Refined PGM production increased to a record 5,138,400 ounces (2020: 2,713,000 ounces), reflecting the strong performance of the converter plant (ACP) Phase A unit following its successful rebuild in 2020. The ACP Phase B rebuild was completed in January 2022 and is expected to be recommissioned in the first quarter of 2022.Iron ore production increased by 3% to 63.8 Mt (2020: 61.7 Mt). At Kumba, production increased by 9% to 40.9 Mt (2020: 37.6 Mt), owing to the easing of Covid-19 related restrictions that had affected production in 2020, and improved plant availability. Minas-Rio production decreased by 5% to 22.9 Mt (2020: 24.1 Mt), due to unplanned maintenance at the beneficiation plant.Metallurgical coal production decreased by 11% to 14.9 Mt (2020: 16.8 Mt), principally due to the suspension of longwall operations at Grosvenor since May 2020 following the underground incident, and the elevated gas levels at Moranbah that resulted in the stoppage of longwall operations from 21 February 2021 until 3 June 2021. Operations at Moranbah were further impacted by challenging geological conditions in the second half of the year. Grosvenor longwall production received approval to restart in February 2022 and is now operational again.Manganese ore production increased by 5% to 3.7 Mt (2020: 3.5 Mt).Thermal coal export production was 9.3 Mt (2020: 20.6 Mt). In South Africa, production was 5.7 Mt (2020: 16.5 Mt), reflecting the demerger of operations on 4 June 2021. In Colombia, attributable production was 3.6 Mt (2020: 4.1 Mt), which reflects production until 30 June 2021, when the sale agreement for Cerrejón was reached. Both of these businesses have now been exited.Group copper equivalent unit costs(1) increased by 16% in US dollar terms and 10% in local currency terms, due to stronger producer currencies and input cost increases at most of our operations, despite higher production.   Financial performanceAnglo American's profit attributable to equity shareholders increased significantly to $8.6 billion (2020: $2.1 billion). Underlying earnings were $8.9 billion (2020: $3.1 billion), while operating profit was $17.6 billion (2020: $5.6 billion).Underlying EBITDAGroup underlying EBITDA increased by $10.8 billion to $20.6 billion (2020: $9.8 billion). The Group Mining EBITDA margin of 56% was significantly higher than the prior year (2020: 43%), due to the increase in the price for the Group's basket of products and improved production at PGMs, De Beers and Kumba (Iron Ore), partly offset by unfavourable exchange rates and higher input costs across the Group. A reconciliation of 'Profit before net finance costs and tax', the closest equivalent IFRS measure to underlying EBITDA, is provided within note 3 to the Condensed financial statements.Underlying EBITDA reconciliation for the year ended 31 December 2020 to year ended 31 December 2021The reconciliation of underlying EBITDA from $9.8 billion in 2020 to $20.6 billion in 2021 shows the controllable factors (e.g. cost and volume), as well as those outside of management control (e.g. price, foreign exchange, inflation and the impact of the pandemic), that drive the Group's performance.PriceAverage market prices for the Group's basket of products increased by 43% compared to 2020, increasing underlying EBITDA by $10.2 billion. Higher realised prices were achieved across all of our products, with the dollar PGM basket increasing by 36%, primarily driven by rhodium which increased by 85% in the year, as well as iron ore and copper which increased by 41% and 52% respectively.Foreign exchangeThe unfavourable year-on-year foreign exchange impact on underlying EBITDA of $1.0 billion was due to stronger local currencies in our countries of operation, principally the South African rand.InflationThe Group's weighted average CPI for the year was 5.0%, compared with 2.9% in 2020, as inflation increased in all countries of operation. The impact of inflation on costs reduced underlying EBITDA by $0.5 billion.Covid-19 volume recoveryThe positive $1.1 billion effect on the Group's underlying EBITDA reflects the easing of certain Covid-19 related restrictions that impacted global demand in 2020 (particularly in the first half), as well as the continued strong recovery in the diamond market. The ongoing cost of disruption to production owing to enhanced preventative Covid-19 safety measures and supply chain interruptions is included within net cost and volume.Net cost and volumeThe net effect of cost and volume was a $1.2 billion increase in underlying EBITDA, as strong PGM sales due to higher refined volumes following the successful restart of PGMs' converter plant (ACP) Phase A unit more than offset operational issues at Metallurgical Coal, unplanned maintenance at Minas-Rio and above CPI cost increases across the Group.OtherThe $0.2 billion negative movement in underlying EBITDA from other factors was largely driven by a change in inventory value estimation methodology at PGMs (see note 8 to the Condensed Financial Statements for more detail) and unfavourable foreign exchange movements at Samancor (Manganese). This was partially offset by a decrease in environmental restoration provisions at Copper Chile as a result of recent market volatility affecting the discount rate. Despite no underlying earnings from thermal coal assets in the second half of the year, high thermal coal prices in the first half of 2021, as well as the impact of Covid-19 disruptions in 2020, resulted in higher EBITDA than for the full year 2020.Underlying earningsGroup underlying earnings increased to $8.9 billion (2020: $3.1 billion), driven by the significantly higher underlying EBITDA, partly offset by a corresponding increase in income tax expense and earnings attributable to non-controlling interests.Depreciation and amortisationDepreciation and amortisation increased by 3% to $2.8 billion (2020: $2.8 billion), reflecting the increased production of the Group.Net finance costs and income tax expenseNet finance costs, before special items and remeasurements, were $0.3 billion (2020: $0.8 billion). The decrease was principally driven by foreign exchange gains and a decrease in other net fair value losses.The underlying effective tax rate was 31.4% (2020: 31.2%). The underlying effective tax rate was impacted by the relative levels of profits arising in the Group's operating jurisdictions. Over the longer term, the underlying effective tax rate is expected to be in the range of 31% to 35%. The tax charge for the period, before special items and remeasurements, was $5.3 billion (2020: $1.8 billion).Non-controlling interestsThe share of underlying earnings attributable to non-controlling interests of $3.1 billion (2020: $1.2 billion) principally relates to minority shareholdings in Kumba (Iron Ore), PGMs and Copper.Special items and remeasurementsSpecial items and remeasurements (after tax and non-controlling interests) are a net charge of $0.4 billion (2020: net charge of $1.0 billion), including tax special items and remeasurements arising in Iron Ore Brazil (Iron Ore) and Nickel of $0.3 billion; impairment charges of $0.6 billion at Moranbah/Grosvenor, Dawson and Capcoal (Metallurgical Coal); and a loss of $0.4 billion on the demerger of the South African thermal coal operations (Corporate and other), offset by impairment reversals of $1.0 billion mainly related to Minas-Rio (Iron Ore).Full details of the special items and remeasurements recorded are included in note 9 to the Condensed financial statements.         Net debt (including related derivatives) of $3.8 billion has decreased by $1.7 billion since 31 December 2020, driven by robust cash flows from operations of $20.6 billion. The Group generated strong sustaining attributable free cash inflows of $9.6 billion, used in part to fund growth capital expenditure of $1.8 billion and dividends paid to Anglo American plc shareholders of $4.0 billion. New leases entered into, including for the Group's  London head office, added $0.7 billion to net debt. Net debt at 31 December 2021 represented gearing (net debt to equity) of 10% (2020: 14%).Cash flowCash flows from operationsCash flows from operations increased to $20.6 billion (2020: $8.0 billion), reflecting an increase in underlying EBITDA from subsidiaries and joint operations, and a working capital reduction of $1.1 billion (2020: increase of $1.5 billion). A reduction in inventories of $0.3 billion was driven by a change in the inventory value estimation methodology that reduced the cost of purchased concentrate at PGMs ; and an increase in payables of $1.4 billion was driven by a higher customer pre-payment within PGMs and provisionally priced sale adjustments within Iron Ore. These were partly offset by an increase in receivables of $0.6 billion, mainly owing to increased base metal prices.Capital expenditureCapital expenditure increased to $5.2 billion (2020: $4.1 billion), as comprehensive response plans partially mitigated the impact of the Covid-19 pandemic, which affected spend in 2020, and ensured business continuity.Sustaining capital expenditure increased to $3.4 billion (2020: $2.6 billion), driven by the roll-over of deferred expenditure from 2020 owing to Covid-19 related restrictions and the effect of stronger local currencies in our countries of operation.Growth capital expenditure increased to $1.8 billion (2020: $1.4 billion), largely due to higher expenditure incurred at the Woodsmith polyhalite project of $0.5 billion (2020: $0.3 billion) following the acquisition of the project in the first half of 2020.Attributable free cash flowThe Group's attributable free cash flow increased to $7.8 billion (2020: $1.2 billion) due to higher cash flows from operations of $20.6 billion (2020: $8.0 billion). This was partially offset by increased capital expenditure of $5.2 billion (2020: $4.1 billion), higher tax payments of $4.3 billion (2020: $1.6 billion) and increased dividends paid to non-controlling interests of $2.8 billion (2020: $0.7 billion).Shareholder returnsIn line with the Group's established dividend policy to pay out 40% of underlying earnings, the Board has proposed a dividend of $1.18 per share (2020: $0.72 per share), as well as a special dividend of $0.50 per share, bringing the total dividends paid and proposed in respect of 2021 to $4.19 per share (2020: $1.00 per share), equivalent to $5.2 billion (2020: $1.2 billion). The timetable for the special dividend will follow the same timetable as for the payment of Anglo American's final dividend. For further information, please refer to the 'Notice of Final Dividend' set out on page 91.The Group has made significant progress in deleveraging and strengthening the balance sheet and, given the levels of cash generated in the business, along with the further value potential in Anglo American, excess cash was paid out to shareholders in the second half of the year. In September 2021, in addition to the interim base dividend, the Group paid a special dividend of $1.0 billion equal to $0.80 per share. Anglo American also returned $0.8 billion to shareholders in 2021, as part of a $1.0 billion on-market share buyback programme that completed on 11 February 2022, at an average price of £28.84 per share.AcquisitionsThe Group completed no material acquisitions in the year. In the prior year, on 17 March 2020, the Group completed the acquisition of Sirius Minerals Plc for a cash consideration of $0.5 billion.DisposalsOn 4 June 2021, the Group demerged its thermal coal operations in South Africa into a newly incorporated company, Thungela Resources Limited ('Thungela'), that was subsequently admitted to trading on both the Johannesburg and London stock exchanges on 7 June 2021. The demerged assets included net cash of $0.2 billion. Following the demerger, no further production from South African thermal coal was reported by Anglo American.Net cash received from disposals was $0.1 billion (2020: $0.4 billion), being deferred and contingent consideration in respect of previous divestments by PGMs and Copper, partially offset by the net cash disposed in 2021 through the demerger of the Group's South African thermal coal operations.Balance sheetNet assets increased by $2.0 billion to $34.8 billion (2020: $32.8 billion), reflecting the profit for the period, offset by dividend payments to Company shareholders and non-controlling interests.Attributable ROCEAttributable ROCE increased to 43% (2020: 17%). Attributable underlying EBIT was higher at $13.5 billion (2020: $5.3 billion), reflecting the impact of significantly higher realised prices achieved for the Group's products and the easing of Covid-19 related restrictions that impacted sales in 2020. Average attributable capital employed increased to $31.4 billion (2020: $30.5 billion), primarily due to growth capital expenditure, largely at Quellaveco (Copper) and Woodsmith (Crop Nutrients).Liquidity and fundingGroup liquidity remains conservative at $17.1 billion (2020: $17.5 billion), comprising $9.1 billion of cash and cash equivalents (2020: $7.5 billion) and $8.0 billion of undrawn committed facilities (2020: $10.0 billion).In March 2021, the Group issued $500 million 2.250% Senior Notes due 2028, and $500 million 2.875% Senior Notes due 2031, as part of the Group's routine financing activities.In June 2021, the Group bought back US dollar denominated bonds with maturities in 2025. The Group used $1.0 billion of cash to retire $0.9 billion of contractual repayment obligations (including derivatives hedging the bonds).The weighted average maturity on the Group's bonds decreased marginally to 6.2 years (31 December 2020: 6.3 years).The Group has an undrawn $4.7 billion revolving credit facility due to mature in March 2025.In April 2020, the Group signed a new $2.0 billion revolving credit facility with an initial maturity date of April 2021. After the Group's $1.0 billion bond issuance in March 2021, the Group issued a notice of cancellation for the facility, which became effective in March 2021 and, accordingly, this facility is no longer available.Portfolio upgradeAnglo American continues to evolve its portfolio of competitive, world class assets towards those future-enabling products that are fundamental to enabling a low carbon economy and that cater to global consumer demand trends. Aligned to this strategy, the Group commenced or completed several transactions in 2021.In April 2021, Anglo American reached a significant milestone in delivering our environmental commitments, securing 100% renewable electricity supply for all our operations in South America including by, for example, signing an agreement to provide 100% renewable electricity for the Quellaveco copper operation in Peru, where the mains power supply will come entirely from renewables from 2022, having already met our objective to source electricity entirely from renewables in Chile from 2021, and Brazil from 2022.In June 2021, we completed the demerger of our thermal coal operations in South Africa through the creation of a new stand-alone company, Thungela, which has a primary listing on the Johannesburg Stock Exchange, and a standard listing on the London Stock Exchange.On 20 December 2021, Anglo American Platinum announced its sale of its 49% interest in Bokoni. The transaction is subject to the fulfilment or waiver of notable conditions precedent and is expected to complete during 2022.In January 2022, Anglo American Platinum entered into transaction agreements for the sale of its 50% interests in the Kroondal and Marikana pool-and-share agreements (the 'PSAs') to Sibanye-Stillwater (Sibanye). The transaction is subject to regulatory approvals, including section 11 consent for the transfer of the mining right and approvals by the Competition Authorities, as well as the delivery of 1.35 million 4E ounces of metal in concentrate by the Kroondal PSA (100% basis).On 11 January 2022, we completed the sale of our 33.3% shareholding in Cerrejón to Glencore plc for a total cash consideration of $0.3 billion, before adjustment for dividends received in 2021. The agreement is effective on 31 December 2020 and, therefore, economic benefits from 1 January 2021 onwards have not accrued to Anglo American.Both the Thungela demerger and Cerrejón sale represent the final stage of our responsible exit from thermal coal operations.Growth projects (metrics presented on a 100% basis unless otherwise indicated)The BoardChanges during 2021 to the composition of the Board are set out below.On 1 March 2021, Elisabeth Brinton joined the Board as a non-executive director and as a member of the Sustainability Committee in September 2021.On 1 June 2021, Hilary Maxson joined the Board as a non-executive director and member of the Audit Committee.The following non-executive changes were announced in October:** Ian Tyler joined the Board as a non-executive director and member of the Audit and Remuneration committees on 1 January 2022.** Anne Stevens and Byron Grote will step down from the Board at the Company's Annual General Meeting (AGM) on 19 April 2022, having both served for nine years.** Ian Tyler will succeed Anne Stevens as chair of the Remuneration Committee, and Hilary Maxson will succeed Byron Grote as chair of the Audit Committee, both with effect from the AGM in April 2022.The following executive changes were announced in November:** Duncan Wanblad will join the Board as chief executive at the Company's AGM on 19 April 2022.** Mark Cutifani will retire as chief executive and step down from the Board at the 2022 AGM, after nine years in the role.On 23 February 2022, the following non-executive appointments were announced; both to take effect on 19 April 2022:** Ian Tyler will succeed Byron Grote as the Board's senior independent director.** Marcelo Bastos will succeed Byron Grote as the designated non-executive director to chair the Anglo American Global Workforce Advisory Panel.De Beers - DiamondsMarketsThe diamond industry continued to recover from the impacts of the Covid-19 pandemic during 2021. In the first half of the year, consumer sales of diamond jewellery in the US and mainland China posted positive growth not only on the Covid-19 affected sales in 2020, but also in comparison to 2019 before the onset of the pandemic. Other global consumer markets initially saw a less pronounced rebound due to the uneven timing of pandemic impacts across the world, but the second half of 2021 saw a more positive recovery trend across the entire international diamond value chain.The ongoing increase in consumer demand led to strong growth rates in consumer sales of diamond jewellery in the US, with holiday season sales increasing by about a third compared to 2020. The strength of demand was the result of an accumulation of savings by US consumers through the various lockdowns and restrictions on movement seen earlier in the pandemic; a pent-up demand for weddings and engagements; a strong desire for diamonds as meaningful gifts that symbolise personal connection; less luxury travel; and supported by ongoing marketing campaigns (including an increase in marketing effectiveness from De Beers).The positive demand trends in retail underpinned the increased demand for polished diamonds and as a result, stocks of polished diamonds in cutting centres steadily declined during the course of the year. Lower supply and steady demand for polished diamonds from retailers supported growth in polished diamond prices.As downstream and midstream demand conditions continued to improve, rough diamond production and prices increased throughout the year, following the significant reductions seen at the start of the pandemic. Midstream sentiment and rough diamond demand were robust throughout 2021.Financial and operational overviewTotal revenue increased significantly to $5.6 billion(1) (2020: $3.4 billion), with rough diamond sales rising to $4.9 billion(1) (2020: $2.8 billion), driven by positive sentiment and strong demand for diamond jewellery in key consumer markets. With midstream capacity recovering, despite the second wave of Covid-19 infections in India in the second quarter of 2021, on a consolidated basis, rough diamond sales volumes were significantly higher at 33.4 million carats (2020: 21.4 million carats). The average realised price rose by 10% to $146/ct (2020: $133/ct), primarily as a result of positive market sentiment which gave rise to an 11% strengthening of the average rough price index. Revenue also increased within De Beers' other businesses, including Element Six.Underlying EBITDA increased to $1,100 million (2020: $417 million), reflecting the improvement in sales driven by the recovery in demand. Unit costs were broadly flat at $58/ct (2020: $57/ct), as the benefit of higher production volumes was offset by an increase in input costs and unfavourable exchange rates.Capital expenditure increased by 48% to $565 million (2020: $381 million), as spend returned to more normalised levels following the deferral of sustaining projects during 2020 in response to Covid-19. The execution of Venetia Underground (in South Africa) and Jwaneng Cut-9 (in Botswana) life extension projects continued to progress, and the mine life extension of the Namibian land operations was approved during the year. The new AMV3 vessel for Namibia, now named the Benguela Gem (the largest and most advanced diamond recovery vessel ever built), arrived in Cape Town in September 2021 to complete preparations for its commissioning in the first quarter of 2022.Operational performanceMining and manufacturingRough diamond production increased by 29% to 32.3 million carats (2020: 25.1 million carats) primarily due to the lower levels of production in 2020 as a result of the impact of Covid-19 related lockdowns and lower demand due to the pandemic. Despite the operational issues and heavy rains in southern Africa in the first quarter of 2021, production was increased to meet the stronger demand for rough diamonds.In Botswana, production was 35% higher at 22.3 million carats (2020: 16.6 million carats) as production was increased in response to stronger prevailing demand. Production at Jwaneng increased by 71% to 12.9 million carats (2020: 7.5 million carats) due to the planned treatment of higher grade ore, and as a result of Covid-19 related lockdowns in the previous year. Production at Orapa increased marginally by 5% to 9.4 million carats (2020: 9.0 million carats), despite the impact of heavy rainfall at the beginning of the year and the planned closure of Plant 1 in late 2020.In Namibia, production was broadly in line at 1.5 million carats (2020: 1.4 million carats), reflecting an increase from the remobilisation of most vessels in late 2020, partly offset by planned maintenance.In South Africa, production increased by 41% to 5.3 million carats (2020: 3.8 million carats), owing to the impact of the Covid-19 lockdowns in the first half of 2020 and the planned processing of higher grade ore from the final cut of the Venetia open pit.In Canada, production was marginally lower at 3.2 million carats (2020: 3.3 million carats), mainly due to a temporary Covid-19 related shutdown in the first quarter of 2021.Brands and consumer markets2021 saw a strong recovery in consumer demand for De Beers' branded diamond jewellery from De Beers Jewellers and De Beers Forevermark, with both achieving double digit retail growth year-on-year. De Beers also continued to expand its retail stores in 2021, including its new flagship store in Old Bond Street, London and new stores in China and Qatar.In August 2021, De Beers Group announced its new 'One De Beers' approach and its focus on establishing De Beers as a 'purpose-led' brand. De Beers has now launched its new brand campaign built around a widening interpretation of the phrase 'I do', itself the embodiment of one of the most time-honoured expressions of intent and values.Operational and market outlookExpectations for retail restocking in early 2022 are encouraging following the strong retail sales of diamond jewellery over the holiday season. The growth in consumer demand for diamond jewellery is expected to continue, driven by the US, primarily due to continued economic recovery, higher accumulated savings and postponed marriages. Rough diamond demand is expected to remain steady as the midstream continues to operate with lower stock levels, manufacturing below full capacity but using a faster manufacturing cycle. While there continue to be risks relating to the effects of Covid-19 across the pipeline, geo-political uncertainty and cost inflation pressures, sentiment in the midstream is expected to remain positive on the back of anticipated strong US retailer restocking in the first quarter.The longer term evolution of the diamond value chain continues, including a sustained focus on inventory balance, the efficient distribution of diamonds throughout the pipeline, increased online purchasing, and a greater focus on the provenance and sustainability credentials of companies and their products. De Beers is well positioned to take advantage of these changes. The long term outlook for diamond jewellery demand remains positive.Production guidance for 2022 is 30-33 million carats (100% basis), subject to trading conditions and the extent of further Covid-19 related disruptions. Unit cost guidance for 2022 is c.$65/ct, reflecting the impact of inflation.CopperFinancial and operational overviewUnderlying EBITDA more than doubled to $4,011 million (2020: $1,864 million), underpinned by record copper prices.Copper production of 647,200 tonnes was in line with the prior year (2020: 647,400 tonnes). Planned lower grades were fully offset by continued strong plant performance at Collahuasi and the implementation of water management initiatives at Los Bronces. Unit costs increased by 6% to 120 c/lb (2020: 113 c/lb), reflecting a stronger Chilean peso and high levels of local inflation impacting production and selling costs, partly offset by an increase in waste stripping capitalised and higher by-product credits.Capital expenditure increased by 23% to $1,773 million (2020: $1,443 million), reflecting adverse movements in the Chilean peso and higher capitalised waste stripping as a result of resuming mine development activity following the impact of the pandemic in 2020.MarketsThe difference between the market price and realised price is largely a function of provisional pricing adjustments, with 162,361 tonnes of copper provisionally priced at 442 c/lb at 31 December 2021 (2020: 140,599 tonnes provisionally priced at 352 c/lb), and the timing of sales across the year.The average LME copper price increased by 51%, due to a strong recovery in economic activity following the initial waves of the Covid-19 outbreak in 2020. While demand rebounded sharply in 2020 in China, momentum in 2021 was led by the US and Europe, as China faced headwinds in its real estate sector. The strength of demand for copper, like many commodities, was reinforced by government measures which were implemented to help offset the effects of the pandemic, and during the year this was further affected by supply-chain bottlenecks in major economies. Copper supply growth continued to be constrained, resulting in declines in reported inventories to multi-year lows. Demand for the metal has benefited from copper's key role in global decarbonisation efforts, with growth in copper-intensive applications, such as wind and solar power generation. Investment fund interest in copper also contributed to price strength, as prices reached a record high of 486c/lb in May 2021, although concerns about inflation and potential interest rate rises have tempered further advances.Operational performanceCopper production was in line with the prior year at 647,200 tonnes (2020: 647,400 tonnes).At Los Bronces, production increased marginally by 1% to 327,700 tonnes (2020: 324,700 tonnes) due to higher water availability owing to water management initiatives, partially offset by planned lower grades (0.70% vs. 0.81%). C1 unit costs increased by 6% to 158 c/lb (2020: 149 c/lb), with the benefit of higher waste stripping capitalised and higher by-product credits, offset by the stronger Chilean peso and inflation, as well as cost increases associated with water management.At Collahuasi, Anglo American's attributable share of copper production of 277,200 tonnes was a record and slightly above the prior year (2020: 276,900 tonnes). C1 unit costs decreased by 2% to 61 c/lb (2020: 62 c/lb), reflecting the benefit of higher production and by-product credits, offset by the stronger Chilean peso and inflation.Production at El Soldado decreased by 8% to 42,300 tonnes (2020: 45,800 tonnes) due to lower grades in accordance with the mine plan (0.73% vs. 0.84%). C1 unit costs of 206 c/lb are broadly in line with the prior year (2020: 204 c/lb), with the impact of lower production volumes, the stronger Chilean peso and inflation being offset by an increase in waste stripping capitalised.Chile´s central zone continues to face severe drought conditions. While production impacts during 2021 have been fully mitigated by the successful implementation of water management initiatives, record low levels of precipitation during the year have reduced water availability for Los Bronces in the first half of 2022 and have been factored into our production guidance.Operational outlook - Copper ChileProduction guidance for Chile for 2022 is 560,000-600,000 tonnes, subject to the extent of further Covid-19 related disruptions and water availability. C1 unit cost guidance for Chile for 2022 is c.145c/lb, reflecting lower production volumes, the impact of inflation, higher input costs and water purchases, as well as lower by-product credits.Quellaveco updateThe project is on track to achieve first production in mid-2022, in line with the original project schedule despite the challenges presented by the Covid-19 pandemic to date.2021 saw the achievement of several major milestones and, as at February 2022, construction on all work fronts is reaching the final stages. The Vizcachas Dam - part of the infrastructure that will provide water to both the operation and local communities - is now commissioned and turned over to the operating team, and the 95 km water pipeline to site is on track to complete in the first quarter of 2022. In the mine, pre-stripping started in April 2021, moving 24 million tonnes in the year, and first ore was reached and excavated in October. The majority of the mine equipment fleet is now assembled, being the first in Peru to use fully automated haul trucks and drills, and all three rope shovels are operation-ready. Significant progress has been made on the primary crusher, with commissioning due to begin in the first quarter of 2022. The overland ore transport conveyor belt to the processing plant is being installed following completion of excavation work in the tunnel section of the conveyor route. We are also nearing construction completion at the processing plant, and pre-commissioning of the first of two milling lines began in January 2022. In the tailings area, the starter dam is built to its full elevation, and at the port, works to expand the existing port facilities remain on-track to allow copper concentrate shipments to begin in 2022.During January and early February, Peru has been experiencing its third wave of Covid-19 following the spread of the Omicron variant throughout the country. While almost all of the on-site workforce is fully vaccinated and serious illness has been rare, progress has been negatively impacted by reduced workforce availability and the need to isolate the increasing number of Covid-19 cases identified on-site. To date, this disruption has not materially impacted the project schedule or capital estimate, however the camp has, at times, reduced to 50% occupancy rates, compared with 95% in December 2021 and early January 2022, and the full impact will depend on how long these challenging conditions last. As a result of this, production guidance for 2022 has been revised (see operational outlook below) and the total project capital expenditure estimate has been tightened to $5.4-5.5 billion (previously $5.3-5.5 billion), of which the Group's share is c.$2.8 billion. Capital expenditure in 2021 (on a 100% basis) was $1.3 billion, of which the Group's share is $0.8 billion. Guidance for 2022 remains $0.8-1.1 billion (100% basis), of which the Group's share is $0.5-0.7 billion.In 2022, focus is shifting to commissioning and operational readiness, which is aligned with the Anglo American Operating Model. The operating team is largely in place, along with a dedicated commissioning team implementing an integrated commissioning plan. All key obtainable permits have been received, and we are on track to obtain operational permits that become available as infrastructure is completed. In addition, key operational contracts are placed or under negotiation. The local Moqueguan workforce has been key to the success of the project and, as we near the close-out of construction activities, we are working closely with government and local communities to manage the demobilisation and support future employment opportunities for the local workforce.Revised mine design and planning at the Quellaveco district has led to an 18% increase in Ore Reserves, with estimated contained copper of c.8.9 million tonnes at 0.53% TCu, and a resultant six-year increase in the Life of Mine to 36 years.Operational outlook - QuellavecoWe expect to achieve first production in mid-2022, followed by a 12-month ramp-up to full capacity. Production guidance for Quellaveco for 2022 is 100,000-150,000 tonnes (previously 120,000-160,000 tonnes).  Both the schedule and production guidance remain subject to the extent of current and ongoing Covid-19 related disruption.C1 unit cost guidance for 2022 is c.125c/lb, based on ramp-up production volumes. It is, therefore, highly dependent on production start date and is subject to further Covid-19 impacts. Unit costs are expected to average c. 95c/lb over the first five years once the operation reaches full production capacity from 2023.All guidance, project progress and capital expenditure remain subject to the extent of ongoing and further Covid-19 related disruption. Quellaveco expects to deliver around 300,000 tonnes per year of copper equivalent production on average in its first 10 years of operation.NickelFinancial and operational metricsFinancial and operational overviewUnderlying EBITDA increased by 55% to $320 million (2020: $206 million), reflecting higher realised nickel prices and continued operational stability. C1 unit costs increased by 13% to 377 c/lb (2020: 334 c/lb) as a result of lower production volumes and higher input and selling costs, partly offset by energy sales and a favourable Brazilian real.Capital expenditure decreased by 12% to $29 million (2020: $33 million), primarily due to lower capitalised waste stripping.MarketsDifferences between the market price (which are LME-based) and our realised price (the ferronickel price) are due to the discounts (or premiums) to the LME price, which depend on market conditions, supplier products and consumer preferences.The average LME nickel price of 839 c/lb was 34% higher (2020: 625 c/lb), as demand outstripped supply, with demand benefiting from the easing of Covid-19 restrictions globally, and particularly robust consumption in stainless steel and batteries (electric vehicles and energy storage) end-markets.Operational performanceNickel production decreased by 4% to 41,700 tonnes (2020: 43,500 tonnes), due to licensing delays in the second half of the year (the relevant licences only being received towards the end of the final quarter of the year) and planned lower ore grades.Operational outlookProduction guidance for 2022 is 40,000-42,000 tonnes, subject to the extent of further Covid-19 related disruption.C1 unit cost guidance for 2022 is c.450 c/lb, reflecting the impact of inflation, higher input costs and marginally lower production volumes.  Platinum Group MetalsFinancial and operational overviewUnderlying EBITDA increased to $7,099 million (2020: $2,555 million), as a result of a 36% increase in the PGM basket price, driven mainly by the higher average rhodium price, as well as an 82% increase in sales volumes. EBITDA was slightly reduced by a change in inventory value estimation methodology, resulting in a $0.4 billion reduction in the value of inventory, with a corresponding increase in operating costs (see note 8 to the Condensed financial statements for more detail). Unit costs increased by 22% to $868/PGM ounce (2020: $713/PGM ounce), reflecting the stronger South African rand and input cost inflation, partly offset by higher production volumes following the Covid-19 lockdowns and ACP shutdown in 2020.Capital expenditure increased by 57% to $894 million (2020: $571 million) due to lower capital expenditure in the first half of 2020 as a consequence of deferred projects due to the impact of Covid-19.MarketsAnnual average PGM prices were significantly higher than the prior year, with a multitude of price records in the first half of 2021 giving way to lower prices in the second half, reflecting supply and demand dynamics. In the first half of the year, demand was supported by a recovering global economy and optimism over the automotive production outlook; it moderated in the second half as the semi-conductor chip shortage curtailed automotive production. Meanwhile, supply was disrupted by the temporary closure of two Russian mines early in the year, but increased later on due to robust South African refined production and a recovery in Russian refined production. The average realised basket price increased by 36% in dollar terms to $2,761 per PGM ounce (2020: $2,035 per PGM ounce), with all PGMs contributing.Operational performanceTotal PGM production increased by 13% to 4,298,700 ounces (2020: 3,808,900 ounces), primarily reflecting a strong recovery from the Covid-19 impacts in the prior period.Own-mined productionPGM production from own-managed mines (Mogalakwena, Amandelbult, Unki and Mototolo) and equity share of joint operations increased by 12% to 2,858,300 ounces (2020: 2,549,000 ounces) following a robust recovery from the Covid-19 impacts in the prior year.Mogalakwena PGM production increased by 3% to 1,214,600 ounces (2020: 1,181,600 ounces), largely driven by mining efficiencies resulting from P101initiatives, leading to higher throughput at the concentrators, despite overall lower grade.Amandelbult PGM production increased by 27% to 773,200 ounces (2020: 608,100 ounces), due to an improved underground mining performance, leading to increased stability and higher throughput at the concentrator, as well as a recovery from the impacts of Covid-19.Production from other operations increased by 15% to 870,500 ounces (2020: 759,300 ounces), reflecting the strong recovery from the impacts of Covid-19. During the year, the concentrator debottlenecking projects at Unki and Mototolo were successfully completed.Purchase of concentratePurchase of concentrate, excluding tolling, increased by 14% to 1,440,400 ounces (2020: 1,259,900 ounces), reflecting the strong recovery from the impact of Covid-19 at joint operations and third parties.Refined production and sales volumesRefined PGM production (excluding toll-treated metal) increased to a record 5,138,400 ounces (2020: 2,713,000 ounces), reflecting the strong recovery in the ACP Phase A unit's performance following its successful rebuild in 2020, as well as strong performance across all processing assets.The build-up in work-in-progress inventory following the temporary closure of the ACP has largely been processed and refined. The ACP Phase B unit rebuild has been completed in January 2022 and recommissioning is expected to commence in the first quarter of 2022.PGM sales volumes increased to 5,214,400 ounces (2020: 2,868,500 ounces), due to the higher refined production and the drawdown of refined inventory from minor metals to supplement sales. This was partially offset by the rebuild in 3E refined inventory to normalised levels.Operational outlookPGM metal in concentrate production guidance for 2022 is 4.1-4.5 million ounces, with own-mined output accounting for c.65%. Refined PGM production guidance for 2022 is 4.2-4.6 million ounces, subject to the impact of Eskom load-shedding. Both are subject to the extent of further Covid-19 related disruption. Unit cost guidance for 2022 is c.$900/PGM ounce, reflecting the impact of inflation and higher input costs, including labour and electricity.Iron OreFinancial and operational overviewUnderlying EBITDA for Iron Ore increased by 51% to $6,871 million, following a 41% increase in the blended realised iron ore price to $157/tonne, despite marginally lower sales volumes and higher unit costs.KumbaUnderlying EBITDA increased by 60% to $4,311 million (2020: $2,702 million), driven by a higher average realised FOB iron ore export price of $161/tonne (2020: $113/tonne), partly offset by the stronger South African rand. Unit costs of $39/tonne (2020: $31/tonne) reflected the stronger rand, as well as input cost inflation.Total sales volumes were in line with the prior year at 40.3 Mt (2020: 40.4 Mt) due to third-party logistics constraints. Production increased by 9%, reflecting the Covid-19 related lockdowns in the first half of 2020, as well as improved equipment availability and reliability.Capital expenditure increased by 18% to $417 million (2020: $354 million), owing to the effect of the stronger South African rand and spend related to the Kapstevel South pit life extension project at Kolomela and the Ultra High Dense Media Separation (UHDMS) technology growth project at Sishen as these projects ramp up.Minas-RioUnderlying EBITDA increased by 37% to $2,560 million (2020: $1,863 million), reflecting a higher average realised price, partly offset by lower volumes resulting from unplanned maintenance at the beneficiation plant. Unit costs increased by 16% to $24/tonne (2020: $21/tonne), as higher input costs, principally consumables and electricity, increased maintenance costs and lower production volumes more than offset the benefit of the weaker Brazilian real.Capital expenditure was 29% higher at $211 million (2020: $163 million), as planned higher expenditure, including P101 initiatives, was partly offset by the weaker Brazilian real.MarketsKumba's FOB realised price of $161/wet metric tonne was 18% higher than the equivalent Platts 62% Fe FOB Saldanha market price (adjusted for moisture) of $136/wet metric tonne. This reflects the premium for the higher iron content at 64.1% and relatively high proportion (approximately 69%) of lump that the product portfolio attracts (which helps steel mills reduce emissions). There was also a benefit of $3/tonne (2020: $7/tonne) related to marketing activities.Minas-Rio's pellet feed product is also higher grade (with iron content of 67% and lower impurities) than the reference product used for the Platts 62% Fe CFR China index. The Metal Bulletin (MB) 66 index, therefore, is used when referring to Minas-Rio product. The Minas-Rio realised price of $150/wet metric tonne was 6% higher than the equivalent MB 66 FOB Brazil index, (adjusted for moisture, of $142/wet metric tonne). This reflects the premium quality of the product, as well as a benefit of $5/tonne (2020: $13/tonne) related to marketing activities.Operational performanceKumbaDespite third-party logistical constraints, production increased by 9% to 40.9 Mt relative to 2020, which was impacted by Covid-19 related disruptions (2020: 37.6 Mt). The increase was partly driven by improved plant availability and reliability in 2021. Production at Sishen increased by 9% to 28.0 Mt (2020: 25.8 Mt) and at Kolomela by 8% to 12.8 Mt (2020: 11.9 Mt).Minas-RioProduction decreased by 5% to 22.9 Mt (2020: 24.1 Mt), due to lower plant availability as a result of unplanned maintenance at the beneficiation plant.Operational outlookKumbaProduction guidance for 2022 is 39-41 Mt, subject to the extent of further Covid-19 related disruption and third-party rail and port performance.2022 unit cost guidance is c.$41/tonne, reflecting the impact of inflation and higher input costs.Minas-RioProduction guidance for 2022 is 24-26 Mt, subject to the extent of further Covid-19 related disruption.2022 unit cost guidance is c.$25/tonne, reflecting the impact of inflation and higher input costs.Metallurgical CoalFinancial and operational overviewUnderlying EBITDA increased to $962 million (2020: $50 million), driven by an 83% increase in the weighted average realised price for metallurgical coal, partially offset by 16% lower sales volumes, and 22% increase in unit costs to $105/tonne (2020: $86/tonne), reflecting the impact of lower production and the stronger Australian dollar. The volume and cost performances were principally affected by the impact of the underground incident at Grosvenor in May 2020, where longwall production received approval to restart in February 2022 and is now operational again, as well as the temporary suspension at Moranbah during the first half of 2021 in response to elevated gas levels.Capital expenditure decreased by 5% to $649 million (2020: $683 million) due to reduced capitalised stripping at Grasstree, partly offset by the Aquila life extension project (replacing production from Grasstree), where longwall production commenced in February 2022.MarketsAverage realised prices differ from the average market prices owing to differences in material grade and timing of contracts. Hard coking coal price realisation increased to 93% of benchmark (2020: 90%), driven by the return of premium quality hard coking coal production from Moranbah in the second half of the year, in a higher price environment.The average market price for Australian hard coking coal increased by 82% to $226/tonne (2020: $124/tonne). Coking coal prices in the first half of 2021 were impacted by the ban on Australian-originated coal into Chinese ports and the Covid-19 outbreak in India, but recovered strongly in the second half of the year, due to a reduction of supply from Australian and North American producers, while demand from Asian steelmakers outside China, remained strong with steel production supported by robust margins.Operational performanceProduction decreased by 11% to 14.9 Mt (2020: 16.8 Mt), principally due to the suspension of longwall operations at Grosvenor since May 2020 following the underground gas incident, and at Moranbah from 21 February 2021 until 3 June 2021, in response to elevated gas levels. Operations at Moranbah were further impacted by challenging geological conditions during the second half of the year. Open cut operations returned to pre-Covid-19 production levels, having been scaled back at Dawson and Capcoal since mid-2020 in response to reduced demand for the products. At Grosvenor, development activities have progressed well and the longwall restarted operations in the first quarter of 2022, following approval from Resources Safety and Health Queensland.Operational outlookFollowing confirmation of the restart at Grosvenor, while export metallurgical coal production guidance for 2022 is 20-22 Mt, due to the impact of Covid-19 in early 2022 and a later than expected restart of operations at Grosvenor, production is expected to be towards the lower end of the guidance range. As a result, unit cost guidance for 2022 is revised to c.$85/tonne (previously c.$80/tonne and compared to 2021 unit costs of $105/tonne). These figures are subject to the extent of any further Covid-19 related disruptions.ManganeseFinancial and operational overviewManganese (Samancor)Underlying EBITDA increased by 4% to $315 million (2020: $304 million), benefiting from a 6% increase in manganese ore sales volumes, driven by higher South African production, partially offset by increased costs due to the stronger South African rand and Australian dollar.MarketsThe average benchmark price for manganese ore (Metal Bulletin 44% manganese ore CIF China) increased by 12% to $5.21/dmtu (2020: $4.67/dmtu), largely due to stronger demand and weather related supply disruptions that affected South African producers.Operational performanceAttributable manganese ore production increased by 5% to 3.7 Mt (2020: 3.5 Mt), reflecting the impact of Covid-19 lockdowns in South Africa in 2020. There was no manganese alloy production as the South African smelter has been on care and maintenance since the Covid-19 lockdown in 2020. During the fourth quarter of 2021, an agreement was entered into to divest the Metalloys business (the smelter in South Africa) and that transaction is expected to complete during 2022.Crop NutrientsCrop NutrientsAnglo American is developing the Woodsmith project in the north east of England to access the world's largest known deposit of polyhalite, a natural mineral fertiliser product containing potassium, sulphur, magnesium and calcium - four of the six nutrients that every plant needs to grow.The Woodsmith project is located approximately 3 km south of Whitby, where polyhalite ore will be extracted via two 1.6 km deep mine shafts and transported to Teesside on an underground conveyor belt in a 37 km tunnel, thereby minimising impact on the surface. It will then be granulated at a materials handling facility to produce a low carbon fertiliser product - known as POLY4 - that will be exported from our dedicated port facility to a network of customers around the world.In December, we appointed Tom McCulley, who has led the development of our Quellaveco copper project in Peru, as CEO of our Crop Nutrients business from 1 January 2022, replacing Chris Fraser who has taken up a strategic projects role for Anglo American.Woodsmith ProjectDevelopment of the project continued to progress, with capital expenditure of $530 million (2020: $292 million). Excavation of the mineral transport tunnel had passed 18 km by the end of the year, beyond the intermediate access shaft site at Lockwood Beck. The Lockwood Beck shaft is complete, having reached its target depth of 383 m, and shaft lining is currently underway. At the mine head itself, shaft boring has started in the services shaft, while progress is also being made on the production shaft infrastructure.Anglo American has conducted a detailed technical review of the project since mid-2020 to ensure the technical and commercial integrity of the full scope of its design. Now largely complete, the review has confirmed that a number of elements of the project's design would benefit from modification to bring it up to Anglo American's safety and operating integrity standards and to optimise the value of the asset for the long term.The Woodsmith team is further developing the engineering to optimise the configuration of the project, recognising the multi-decade life of the mine. Particular attention is on those aspects identified at the outset of Anglo American's ownership - namely, the sinking of the two main shafts, the development of the underground mining area, and the changes required to accommodate both increased production capacity and the more efficient and scalable mining method of using only continuous miners; such improvements will also require the installation of additional ventilation earlier in the development of the underground mining area.Ahead of the full project execution phase, the Woodsmith team, led by new CEO Tom McCulley, is working through the detailed design engineering throughout 2022 and is expected to make a number of changes to the phasing of work, particularly in relation to the two main shafts. The capital budget for 2022 is therefore expected to be reduced by approximately $0.1 billion to $0.6 billion to accommodate these changes.Anglo American expects that the improvements it is making to the project will result in an enhanced configuration and therefore a different and longer construction schedule. Anglo American's capital budget for the development of Woodsmith will reflect such scope and timing changes to ensure that its exacting standards are met and the full commercial value of the asset is realised. Once the detailed design engineering is complete, and the capital budget and schedule are updated, the full project will be submitted to the Board.Market development - POLY4The ongoing focus of the market development activities is to develop and implement detailed sales and marketing strategies for each region and to support customers with their own market development activities in order to further promote POLY4 to the end users of the product - farmers.We are accelerating the number of commercial scale on-farm demonstrations, with around 800 now in progress or complete. The demonstrations continue to validate the efficacy of the product and the improvements it can deliver to farmers in terms of crop yield, quality or both. In addition, POLY4 has been shown in studies to enhance soil health through resilience to compaction, erosion and run-off, as well as improving nutrient availability to crops, helping to reduce nutrient waste into watercourses. POLY4 offers farmers a solution to agricultural efficiency and sustainability challenges, through its naturally low chloride multi-nutrient composition, its suitability for organic use and ultra low carbon profile, generating up to 85% fewer carbon emissions than the equivalent conventional nutrient products, with little to no waste generated in its production.Corporate and OtherFinancial overviewExplorationExploration's underlying EBITDA loss was $128 million (2020: $101 million loss), driven by increased exploration activities across most product groups reflecting Covid-19 related restrictions in 2020.Corporate activities and unallocated costsUnderlying EBITDA was a $63 million loss (2020: $44 million loss), driven primarily by an increase in corporate costs across various technical and strategic projects, partially offset by an increase in profits on third-party shipping.Thermal Coal - South AfricaUnderlying EBITDA was $101 million (2020: $15 million loss), with underlying EBITDA no longer reported by Anglo American from 4 June 2021, the date of the demerger of the South Africa thermal coal operations. Anglo American's Marketing business continues to support Thungela in the sale and marketing of its products, and sales and purchases under the offtake agreement are reported on a net basis together with the Group's other third-party trading activities within corporate activities and unallocated costs.Thermal Coal - ColombiaUnderlying EBITDA increased to $87 million. The sale of our 33.3% shareholding in Cerrejón was completed on 11 January 2022, with the sale agreement having an economic effective date of 31 December 2020. After the sale was agreed in June 2021, no further underlying EBITDA was recorded, with an impairment charge being recognised to offset reported earnings in the first half of the year (see note 12 of the Condensed financial statements for more detail).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}