{"date": "2021-07-22 06:02:39+00:00", "ticker": "III", "mrkt_info": {"open": 1158.5, "close": 1263.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><h4>\n      Q1 Performance update\n    </h4><p><a href=\"https://www.3i.com/media/5353/q1-fy22-quarterly-performance-update.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Download this press release as a PDF</a></p><h4>\n      FY2022 Q1 performance update\n    </h4><h4>\n      A strong start to FY2022\n    </h4><ul class=\"bulleted-list arrowlist\"><li>\n        Increase in NAV per share to 1,063 pence (31 March 2021: 947 pence) and total return of 12.2% for the three months to 30 June 2021\n      </li><li>\n        Another strong quarter from the Private Equity portfolio with notable contributions from Action, AES, Basic-Fit, BoConcept, GartenHaus, Luqom, Q Holding, Royal Sanders, SaniSure and Tato\n      </li><li>\n        A powerful performance from Action in the quarter with very good sales and EBITDA growth. EBITDA for the quarter was €205 million, 107% above 2020 and 67% above 2019. Sales for the quarter were €1,688 million, 52% above 2020 and 39% above 2019\n      </li><li>\n        Received £84 million of refinancing proceeds from Royal Sanders and completed one bolt-on acquisition for Luqom with no further investment from 3i\n      </li><li>\n        3i Infrastructure plc ('3iN') completed its investment in DNS:NET and a bolt-on acquisition for Joulz, an existing portfolio company\n      </li><li>\n        Both investment divisions remain active with a healthy pipeline of new investment opportunities, bolt-ons and refinancing and realisation transactions\n      </li></ul><p><strong>Simon Borrows, Chief Executive, commented:</strong></p><p>\n      '3i has made a strong start to its new financial year. Our investment portfolios in Private Equity and Infrastructure are well positioned for another year of good progress. Action's impressive performance continues, and the group is trading very well now that all stores have fully reopened. We are working on<br/>\n       a number of investment and realisation opportunities across the investment teams, but we remain highly selective when deploying new capital in the current environment.'\n    </p><h4>\n      Private Equity\n    </h4><p><strong>Portfolio performance and valuation at 30 June 2021</strong></p><p>\n      The Private Equity portfolio generated a strong return for the quarter, including a marked step-up in Action's performance. Sales of €1,688 million in the quarter were up 31% from Q1 2021, while EBITDA increased by 151% over the same period. At the start of 2021, Action was impacted by widespread store closures and restrictions. However, the business executed an impressive trading recovery through the end of its Q1 2021 and in Q2 2021. Like-for-like ('LFL') sales comparisons between 2020 and 2021 are difficult due to differing store closures and restrictions over the two periods. However, June (P6) is the one period with all stores substantially open in both years: P6, 2020 delivered 11% LFL growth; P6, 2021 delivered 14.7% LFL growth. Action opened 63 new stores in the quarter and continues to target c.300 new stores in 2021. Cash flow has been strong with the group's cash balance now over €700 million.\n    </p><p>\n      At 30 June 2021, Action was valued using the last twelve months' ('LTM') run-rate earnings to 30 June 2021 (€783 million) and an unchanged multiple of 18.5x net of the liquidity discount, resulting in a valuation of £5,512 million (31 March 2021: £4,566 million) for 3i's 52.7% equity stake.\n    </p><p>\n      The remainder of the Private Equity portfolio generated good returns in the quarter, with good momentum across most of our top 20 assets. Our portfolio is well positioned to benefit from a number of structural growth trends which have continued to support strong performance in a number of our investments, and particularly in assets operating in markets such as biologics (SaniSure), e-commerce (Luqom and GartenHaus), or with exposure to the value-for-money theme (Royal Sanders, Hans Anders). BoConcept and Q Holding are also trading significantly ahead of last year. Of our top 20 portfolio companies, 94% by value grew their LTM adjusted earnings to March 2021.\n    </p><p><strong>Private Equity investments and realisations</strong></p><p>\n      In April 2021, Luqom funded and completed the bolt-on acquisition of Lampemesteren, an online retailer of premium lighting products in the Nordic region.\n    </p><p>\n      In June 2021, we received proceeds of £84 million, of which £4 million was recognised as income, from the refinancing of Royal Sanders.\n    </p><h4>\n      Infrastructure\n    </h4><p>\n      3iN's share price was stable in the three months to 30 June 2021 closing at 298 pence (31 March 2021: 296 pence), valuing 3i's 30% stake at £801 million (31 March 2021: £797 million). We also recognised dividend income of £13 million from 3iN in the quarter. In the period, 3iN completed the acquisition of a 60% stake in DNS:NET, an independent telecommunications provider in Germany for €182 million, and Joulz, one of 3iN's existing portfolio companies, completed the acquisition of Zonel Energy, a provider of solar rooftop solutions to businesses across the Netherlands.\n    </p><p><strong>Scandlines</strong></p><p>\n      Scandlines continued to be impacted by travel restrictions in the three months to 30 June 2021. However, freight continued to perform strongly with volumes ahead of the prior year YTD. Leisure volumes started to pick up towards the end of the period. Our core DCF valuation assumptions remain consistent with the March 2021 valuation.\n    </p><h4>\n      Top 10 investments by value at 30 June 2021\n    </h4><div class=\"story-table-container\"><table class=\"story-basic-table\"><tbody><tr><td></td><td><strong>Valuation<br/>\n             basis</strong></td><td><p><strong>Valuation<br/>\n               currency</strong></p></td><td><p><strong>Valuation<br/>\n               Mar-21<br/>\n               £m</strong></p></td><td><p><strong>Valuation<br/>\n               Jun-21<br/>\n               £m</strong></p></td><td><strong>Activity in the quarter</strong></td></tr><tr><td><p><strong>Action</strong></p></td><td><p>\n              Earnings\n            </p></td><td><p>\n              EUR\n            </p></td><td><p>\n              4,566\n            </p></td><td><p>\n              5,512\n            </p></td><td></td></tr><tr><td><p><strong>3iN</strong></p></td><td><p>\n              Quoted\n            </p></td><td><p>\n              GBP\n            </p></td><td><p>\n              797\n            </p></td><td><p>\n              801\n            </p></td><td></td></tr><tr><td><p><strong>Cirtec Medical</strong></p></td><td><p>\n              Earnings\n            </p></td><td><p>\n              USD\n            </p></td><td><p>\n              444\n            </p></td><td><p>\n              450\n            </p></td><td></td></tr><tr><td><p><strong>Scandlines</strong></p></td><td><p>\n              DCF\n            </p></td><td><p>\n              EUR\n            </p></td><td><p>\n              435\n            </p></td><td><p>\n              449\n            </p></td><td></td></tr><tr><td><p><strong>Tato</strong></p></td><td><p>\n              Earnings\n            </p></td><td><p>\n              GBP\n            </p></td><td><p>\n              368\n            </p></td><td><p>\n              386\n            </p></td><td></td></tr><tr><td><p><strong>Luqom</strong></p></td><td><p>\n              Earnings\n            </p></td><td><p>\n              EUR\n            </p></td><td><p>\n              307\n            </p></td><td><p>\n              359\n            </p></td><td><p>\n              Completed the bolt-on acquisition of Lampemesteren in April 2021.\n            </p></td></tr><tr><td><p><strong>Royal Sanders</strong></p></td><td><p>\n              Earnings\n            </p></td><td><p>\n              EUR\n            </p></td><td><p>\n              364\n            </p></td><td><p>\n              291\n            </p></td><td><p>\n              Returned £84 million of proceeds to 3i.\n            </p></td></tr><tr><td><p><strong>Evernex</strong></p></td><td><p>\n              Earnings\n            </p></td><td><p>\n              EUR\n            </p></td><td><p>\n              281\n            </p></td><td><p>\n              278\n            </p></td><td></td></tr><tr><td><p><strong>Hans Anders</strong></p></td><td><p>\n              Earnings\n            </p></td><td><p>\n              EUR\n            </p></td><td><p>\n              262\n            </p></td><td><p>\n              270\n            </p></td><td></td></tr><tr><td><p><strong>WP</strong></p></td><td><p>\n              Earnings\n            </p></td><td><p>\n              EUR\n            </p></td><td><p>\n              259\n            </p></td><td><p>\n              263\n            </p></td><td></td></tr></tbody></table></div><p>\n      The 10 investments in this table comprise 78% (31 March 2021: 78%) of the total Proprietary Capital portfolio value of £11,558 million (31 March 2021: £10,408 million).\n    </p><h4>\n      Total return and NAV position\n    </h4><p>\n      We recognised a net gain on foreign exchange of £47 million in the quarter, as sterling weakened against the euro. Based on the balance sheet at <span>30 June 2021</span>, 6<span>9% of the Group's net assets were denominated in euro and 15% in US dollar.</span><span>A 1% movement in the euro and US dollar would result in a total return movement of £70</span>million and £15 million respectively, net of any hedging. The diluted NAV per share increased to 1,063 pence (31 March 2021: 947 pence) or 1,042 pence after deducting the 21 pence per share second FY2021 dividend, which will be paid on 23 July 2021.\n    </p><h4>\n      Balance sheet\n    </h4><p>\n      At 30 June 2021, cash was £286 million (31 March 2021: £225 million), and including our undrawn<br/>\n       £500 million revolving credit facility liquidity was £786 million (31 March 2021: £725 million). Net debt<br/>\n       was £689 million and gearing 6.7% (31 March 2021: £750 million and 8.2%). The 21 pence per share second FY2021 dividend, totaling £203 million, will be paid on 23 July 2021.\n    </p><p>\n      ​\n    </p><p><strong>- ENDS -</strong></p><h4><span><strong>Notes</strong></span></h4><ol><li>\n        Balance sheet values are stated net of foreign exchange translation. Where applicable, the GBP equivalents at 30 June 2021 in this update have been calculated at a currency exchange rate of €1.1652: £1 and $1.3812: £1 respectively.\n      </li><li>\n        At 30 June 2021 3i had 969 million diluted shares.\n      </li><li>\n        Action was valued using a post discount run-rate EBITDA multiple of 18.5x based on its run-rate earnings to 30 June 2021.<br/><br/></li></ol><p><strong>For further information, please contact:</strong></p><p>\n      Silvia Santoro<br/>\n       Investor Relations Director<br/>\n       Tel: 020 7975 3258\n    </p><p>\n      Kathryn van der Kroft<br/>\n       Communications Director<br/>\n       Tel: 020 7975 3021<br/><br/></p><p><strong>About 3i Group</strong></p><p>\n      3i is a leading international investment manager focused on mid-market Private Equity and Infrastructure. Our core investment markets are northern Europe and North America. For further information, please visit: <a href=\"http://www.3i.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.3i.com</a>.\n    </p><p>\n      All statements in this performance update relate to the three-month period ended <span>30 June 2021</span> unless otherwise stated. The financial information is unaudited<span>and is presented on 3i's non-GAAP Investment basis in order to provide users with the most appropriate description of the drivers of 3i's performance.</span></p><p><span>Net asset value ('NAV') and total return are the same on the Investment basis and on an IFRS basis. Details of the differences between 3i's consolidated financial statements prepared on an IFRS basis and under the Investment basis are provided in the 2021 Annual report and accounts.</span><span>There have been no material changes to the financial position of 3i from the end of this quarter to the date of this announcement.</span></p><div id=\"public_attachments\"><p><strong>Attachments</strong></p><ul class=\"bulleted-list arrowlist\"><li><a href=\"https://www.3i.com/investor-relations/financial-news/2021/q1-performance-update/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a></li></ul></div><div id=\"public_disclaimer\"><p><strong>Disclaimer</strong></p><p><strong>3i Group plc</strong> published this content on <strong>22 July 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>22 July 2021 06:02:39 UTC</strong></p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - 3i Group plc</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: 3i-Group-plc</p></div>"}