{"date": "2021-11-21 22:25:04.650000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>E-commerce firm Amazon India said that more than 70,000 Indian exporters part of its Global Selling programme are geared to showcase several \u0091Made in India\u0092 products to global customers during the annual Black Friday and Cyber Monday (BFCM) sale. Indian exporters are launching over 52,000 new products on Amazon\u0092s global websites for the upcoming holiday season. The Black Friday and Cyber Monday sale starts on Thursday, November 25 and ends on Monday, November 29.</p><p>\u0093The BFCM sale marks the beginning of the global holiday season. Coming right after the festive season in India, it has traditionally been a key growth period for our selling partners,\u0094 said Abhijit Kamra, Director of Global Trade, Amazon India. \u0093With more and more people relying on ecommerce for products globally, we believe that the 2021 BFCM sale period will help accelerate the exports business for our sellers.\u0094</p></div><div class=\"tr-npp-body\"><p>Amazon customers globally will be able to discover and enjoy a range of products across categories including home and kitchen, STEM Toys, apparel, health and personal care, office products, jewellery, beauty and furniture by exporters across India. Black Friday and Cyber Monday are significant events marking the beginning of the holiday season in the USA and customers at this time are looking at items for use at home and for gifting to friends and family.</p><p>Amazon works with Indian exporters to help them identify key holiday shopping trends to bring in relevant product assortment. It supports them with logistics solutions to get their inventory ready, and guides them to market their products through a range of deals and advertising options.</p><p>\u0093E-commerce Exports helps lower the entry barrier for Indian MSMEs to build and scale their exports business,\u0094 said Kamra. \u0093Through Amazon Global Selling, we will continue to make exports easy and accessible for MSMEs across India and contribute to the Government\u0092s vision of boosting exports.\u0094</p><p>Some of the globally popular Indian brands from Amazon Global Selling who would be offering their unique products and creations this holiday season include Skillmatics which has a wide range of engaging toys that enable children to build core skills through the joy of play. Their latest launches for the Holiday season diversify their foray into Educational Science Kits in Build and Play formats (Buildables range) and interactive treasure hunt card games for the family. Clothing brands like Virgin Crafts and Stylore will be showcasing their exclusive holiday range of shirts, and scarves and Vahdam will be showcasing it's new and exclusive bespoke collection of TeaGift Sets that are an assortment of beautifully curated wellness teas packed in exquisite gift sets.</p><p>\u0093Our mission is to expand access to healthy food products made from millets and natural sugars, which are aligned with the needs of Indian and global consumers,\u0094 said Shauravi Malik and Meghana Narayan, Co-founders, Slurrp Farm. They launched Slurrp Farm on Amazon in October 2016 and over the years have expanded operations to global markets such as the UAE, Europe and most recently the USA. They have participated in numerous sale events on Amazon, which have increased the discoverability of our products. This is the first BFCM sale they will be participating in, where they will showcase a wide range of their offerings- including millet-based pancake, porridge and cake mixes, natural sweeteners and immunity-boosting products. \u0093With the Slurrp Farm storefront live on Amazon and increased consumer demand during the BFCM sales, we\u0092re expecting 3x growth in sales on Amazon,\u0094 said Malik and Narayan.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}