{"date": "2022-02-07 13:54:41+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <h4>\n        Amazon creates immersive shopping experiences using Substance 3D\n      </h4>\n                <p>\n                  <span>Image source: Amazon.</span>\n                </p>\n                <p>\n        Imagine if you could shop for new furniture by bringing a dozen sofas into your house and comparing how they look in your living room. Sounds unrealistic? With augmented reality, that type of virtual shopping might be closer than you think.\n      </p>\n                <div>\n                  <a href=\"https://www.youtube.com/watch?v=77ZJ3jw6EkA\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.youtube.com/watch?v=77ZJ3jw6EkA</a>\n                </div>\n                <p>\n        Amazon is leading the online retail industry by finding new ways of using technology to bring shoppers closer to products. To accomplish its ambitious goals, Amazon set up the 3D Digital Studios within the Amazon Development Center. It took several years of research to develop a reliable and scalable workflow capable of meeting Amazon's growing demand for 3D images. Today, artists work with Maya for modeling, Zbrush for sculpting, and <a href=\"https://www.adobe.com/products/substance.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Adobe Substance</a> 3D Collection, including <a href=\"https://www.adobe.com/products/substance3d-painter.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Adobe Substance 3D Painter</a> and <a href=\"https://www.adobe.com/products/substance3d-designer.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Adobe Substance 3D Designer</a>, for texturing and shading.\n      </p>\n                <p>\n        \"Adobe Substance 3D is an integral part of our 3D production workflow,\" says Durai Murugan Veerasamy, senior operations manager, 3D at Amazon. \"The non-destructive workflow offers many advantages that helps us create 3D assets that transform passive imagery and video into active experiences that customers can tailor to their own needs.\"\n      </p>\n                <div>\n                  <a href=\"https://blog.adobe.com/en/promotions/products/creative-cloud/3d-augmented-reality\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://blog.adobe.com/en/promotions/products/creative-cloud/3d-augmented-reality</a>\n                </div>\n                <h4>\n        3D assets inform purchase decisions\n      </h4>\n                <p>\n        Today, more than 400 artists around the world create photorealistic 3D assets for key product categories, including furniture and fittings, with plans to expand to home gym and home appliances, as well as soft line categories such as clothing, purses, wallets, and more. Amazon uses these 3D assets as the foundation for a variety of customer experiences. Customers can <a href=\"https://www.amazon.in/Adorn-India-Adillac-seater-corner/dp/B01N9W53J1/ref=srm_pd_d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">spin a product 360 degrees</a> to inspect it from every angle. They can use <a href=\"https://www.youtube.com/watch?v=77ZJ3jw6EkA\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon's View in Your Room feature</a> to see what furniture will look like in their homes, or the <a href=\"https://www.amazon.in/showroom/switch\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Showroom feature</a> to create virtual showrooms by mixing and matching products online.\n      </p>\n                <p>\n        3D assets also help Amazon accelerate content velocity by eliminating the need to manufacture prototypes and take photos of millions of products. Instead, artists can create photorealistic renderings that can be easily updated and showcased in different colors and environments based on customer demands.\n      </p>\n                <p>\n        \"We discovered several years ago that having more images enhanced the customer experience, leading to more sales and fewer returns,\" says Veerasamy. \"Having more visuals, particularly interactive experiences using 3D images, builds trust in the product by giving customers the ability to make more informed buying decisions.\"\n      </p>\n                <h4>\n        Creating photoreal textures and shading\n      </h4>\n                <p>\n        Amazon artists rely on Adobe Substance 3D Designer to create complex patterns and tillable textures, from wood grains to brick walls. The node-based material creation workflow allows artists to adjust materials on the fly and change colors to create new variations in minutes. Those materials can be pulled into Adobe Substance 3D Painter, which is the primary tool that Amazon artists use to add textures and shading that bring 3D assets to life.\n      </p>\n                <p>\n        For Amazon artists, Substance 3D Painter delivers all of the features needed to create photoreal assets combined with the intuitive UI and easy workflows that Adobe is known for.\n      </p>\n                <p>\n                  <strong>Layers.</strong> Like many <a href=\"https://www.adobe.com/creativecloud.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Adobe Creative Cloud</a> apps, Substance 3D Painter provides an intuitive layer panel that allows artists to see paints, fills, materials, masks, and effects easily. Adjusting materials is a snap since roughness, opacity, and other features are on separate channels. Adding a logo to a 3D object is as simple as creating a new layer and dropping the logo on top.\n      </p>\n                <p>\n                  <strong>Masking.</strong> Masking in Substance 3D Painter is fast and easy. Artists can quickly isolate areas of mesh and apply colors or tillable patterns to products with ease. With just a few clicks, artists can add shiny metallic fasteners, plastic soles, and color fabrics that make a sneaker or other item pop.\n      </p>\n                <p>\n                  <strong>PBR shading.</strong> PBR (physically based rendering) is the key to making assets look real, with lighting and shading that change based on the roughness and reflectiveness of a texture. Substance 3D Painter reproduces these real-life material behaviors with high accuracy for stunning results.\n      </p>\n                <p>\n                  <strong>Nondestructive painting.</strong> Substance 3D Painter records every action and every stroke of a brush while working. This allows artists to make changes-even adjusting resolution-at any point, leading to more efficient and streamlined workflows.\n      </p>\n                <h4>\n        Staying ahead of the curve to delight customers\n      </h4>\n                <p>\n        For Amazon, the future of shopping lies in 3D. In addition to opening the doors for new shopping experiences based on virtual reality and augmented reality, 3D models can be reused again and again. Amazon doesn't need to worry about setting up new photo shoots or shipping products to new locations, which halves the cost and time needed to create new visuals compared to working with physical products and traditional photography.\n      </p>\n                <p>\n        \"Customers' expectations for visual experiences change over time,\" says Veerasamy. \"We need to stay ahead of the status quo and build experiences that surprise and delight customers to improve customer satisfaction. Adobe Substance 3D will continue to play a vital role in how we create more 3D and innovate for our customers.\"\n      </p>\n                <p>\n        Learn more about using the <a href=\"https://www.adobe.com/products/substance3d/3d-augmented-reality.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Adobe Substance 3D Collection</a> to create state-of-the-art 3D imagery.\n      </p>\n                <div>\n                  <strong>\n                    <a href=\"https://blog.adobe.com/en/publish/2021/10/25/how-binyan-creates-photoreal-architecture-in-3d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://blog.adobe.com/en/publish/2021/10/25/how-binyan-creates-photoreal-architecture-in-3d</a>\n                  </strong>\n                  <strong>\n                    <a href=\"https://blog.adobe.com/en/publish/2021/11/24/3d-product-visualization-bastiaan-geluk-max-2021\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://blog.adobe.com/en/publish/2021/11/24/3d-product-visualization-bastiaan-geluk-max-2021</a>\n                  </strong>\n                  <strong>\n                    <a href=\"https://blog.adobe.com/en/publish/2022/01/14/innovative-3d-design-across-industries-max-2021\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://blog.adobe.com/en/publish/2022/01/14/innovative-3d-design-across-industries-max-2021</a>\n                  </strong>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://blog.adobe.com/en/publish/2022/02/07/amazon-creates-immersive-shopping-experiences-using-substance-3d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Adobe Inc.</strong> published this content on <strong>07 February 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>07 February 2022 13:54:41 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - Adobe Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Adobe-Inc.</p></div>"}