{"date": "2021-11-30 16:05:00.310000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p align=\"left\">SAN ANTONIO, Nov.  30, 2021  (GLOBE NEWSWIRE) -- <a href=\"https://www.globenewswire.com/Tracker?data=PH8_vBgfARfzYjV2YcfcGFPGJi9xYJh5ukLYNz9FCNNNREDBUEGg_lf41eBBoCanQ0Y-GvOWNbBQ11_55NXnKmZ7lXLcnnt2Fkxvyr4CWbw=\"><u>Rackspace Technology</u></a>® (NASDAQ: RXT), a leading end-to-end multicloud technology solutions company, today announced its momentum with Amazon Web Services (AWS) through customer transformations, Amazon Quicksight Service Delivery (Amazon Quicksight SDP) and AWS Shield Advanced partner designations, and an upcoming leadership session on the main stage at AWS re:Invent 2021.<br/></p>  <p align=\"left\">Rackspace Technology is an “all in” AWS Partner Network (APN) Premier Consulting Partner that has deep AWS expertise and scalability to take on the most complex AWS projects. Rackspace Technology customer Awaze demonstrate those capabilities:</p>  <p align=\"left\"><strong><span>Awaze</span></strong><br/>Due to its transition to AWS public cloud from an on-premises environment, supported by Rackspace Technology, Awaze, Europe’s leading managed vacation rentals group, has been able to meet the huge volumes of traffic to its Hoseasons and Cottages.com websites at points this year. Tightly aligning compute resources to demand as part of the multi-million-pound investment has led to a 30% reduction in web session costs for Awaze.</p>  <p align=\"left\">Awaze, the self-catering giant, which offers over 90,000 accommodation choices in 36 countries to more than six million holidaymakers a year, has seen unprecedented surges in demand over the last 12 months thanks to the rising popularity of domestic breaks in the wake of the global pandemic.</p>  <p align=\"left\">“Our partnership with Rackspace Technology has allowed us to optimize our cloud footprint and make it elastic at every layer and across every point of the customer and owner journey,” said James Baird, Technical Operations Director at Awaze. “This means it seamlessly expands and contracts in line with volatile patterns of demand, maintaining robustly consistent response times and performance whilst also being highly commercially optimised.”</p>  <p align=\"left\">Rackspace Technology, combined with the newly formed Onica by Rackspace Technology business group, achieved 15 AWS Partner competency designations within the APN, along with 2,700+ AWS Certifications. In addition, Onica by Rackspace has attained the AWS Machine Learning Competency designation. This validated designation differentiates Onica by Rackspace as an APN Partner that has demonstrated expertise in building artificial intelligence / machine learning (<a href=\"https://www.globenewswire.com/Tracker?data=Fwq_OHjZvhd2_E22qjf7ts6ip7VzP0jW2qJIlrkih6PoUclxZt83-5jTxKa5OAAZBy_V1dXsR_ls0KhiV69rWzlyNBu3xco65_HrDDh77JCrFysyoY-Now-I4mNRnZdx\"><u>AI/ML) solutions</u></a> on AWS and has helped organizations automate and innovate to solve their data challenges and gain actionable outcomes.</p>  <p align=\"left\">Recently, Onica by Rackspace Technology has earned the Quicksight SDP and AWS Shield Advanced Partner designations.</p>  <p align=\"left\"><strong>Amazon Quicksight SDP Designation</strong><br/>Rackspace has obtained a service delivery designation for Amazon <a href=\"https://www.globenewswire.com/Tracker?data=EQvlV0kQbTUyShgF3r5Cdaa-9WDOcjw_sOZZYvbaJCvtw44VmBSr6-Rqkn36rdAnxNL4gAEeh-cdQ4UD0Syj0eN09AJ8tfqdgWUtPZhkMhC1U5Z96mLyS2QUGp8OY6_wqGF-722mb8a4ZJVdKqaQMEkIOM_T2bcF_iAsTLUwqoI1EiwfoqOjR9p0-uDGx8uLjEJ7DURFd-9YIaIGUczHTDGGSbEi0mcpHHeVGpd-Yz4Z4RMBxiOHMkIIY1F7k9bo8Dw5f_1K9HkE9EIVQNhCkzK3k-rwFmqQpZLfMXisCMovurk29LDMUFFWek95k34L2VsCPuoJjFOrCL95YRIjR0oM764VQzNztC6x1Szn7RvWtn2Hsv6rpWDv--SU75z00FNCZydxJMoj-rgWhRJToA==\"><u>QuickSight</u></a>. The qualification for the program requires passing service-specific verification of customer references and a technical review on behalf of AWS. The designation provides customers confidence that they are working with AWS Partners who can offer the most up-to-date and relevant cloud solutions.</p>  <p align=\"left\">The AWS Quicksight SDP showcases APN Partners who have proven expertise delivering specific AWS services, allowing them to differentiate themselves in the marketplace and highlight areas of specialization to AWS customers.</p>  <p align=\"left\"><strong>AWS Perimeter Protection Managed Security Services Provider (MSSP) Partner Certification</strong> <br/>Rackspace Technology achieved the AWS Perimeter Protection MSSP Partner Certification, recommending Rackspace Elastic Engineering for Security as an expert consultative service to manage AWS Edge Security for organizations globally. </p>  <p align=\"left\">Rackspace Elastic Engineering for Security offers global consultative services to help implement and manage the suite of AWS Edge Security Services including AWS Shield, AWS Web Application Firewall (AWS WAF), and AWS Firewall Manager to protect AWS resources such as Elastic IP, Elastic Load Balancer (ELB), Amazon CloudFront, AWS Global Accelerator, and Amazon Route 53 from application threats like Distributed Denial of Services (DDoS), SQL Injection, and Cross-Site Scripting. Rackspace Elastic Engineering for Security offers extended visibility and access to a dedicated pod of cloud security experts, including pod members who have been trained and are directly supported by the AWS Shield Response Team (ASRT).  </p>  <p align=\"left\">Rackspace Technology achieved the AWS Perimeter Protection MSSP partner certification by being an APN Premier Tier Partner, demonstrating an established AWS security practice with Rackspace Elastic Engineering for Security, providing 24/7 cloud security support, and passing a multi-day training program with the AWS Shield Response Team (ASRT).  </p>  <p align=\"left\"><strong>re:Invent 2021</strong><br/>Onica by Rackspace Technology is also celebrating ten years of re:Invent as an AWS Premier Consulting Partner and Gold Sponsor of AWS re:Invent 2021 from November 28 through December 3 in Las Vegas, Nevada. The Onica by Rackspace Technology booth will have activities for everyone with labs, customer presentations, and networking events.</p>  <p align=\"left\">In addition, Josh Prewitt, Chief Product Officer at Onica by Rackspace Technology will join Bill Vass, Vice President of Engineering – Storage, Automation, and Management at AWS and Nandini Ramani, Vice President at AWS for the main stage presentation <a href=\"https://www.globenewswire.com/Tracker?data=ecyYse3wMIAYIJ3U-ebDKvfE5eX_399tYJAmbXwjvuxm3xWo2AuQUezKAh8BvmD8ePljAROVvlocMBLIK_GvvcSqKUyTc9eAphxhEwpMKgbRcQoKeunj2VIWJ9sbJWHXWtxMxhWEhVLkGCqTkrCWlc_f0Zt0cezdXEbnYaEnAkYGWzQDWXH_7cypKltPEk4Oj4duutIYXCD6GSvoxjUTtg==\"><strong><span><u>Ready, set, operate: The AWS Cloud operations model</u></span></strong></a> to explain how the AWS Cloud operations model can help customers build securely and successfully in the cloud.</p>  <p align=\"left\">For more information on Onica by Rackspace’s re:Invent participation click <a href=\"https://www.globenewswire.com/Tracker?data=jEpt4q2kRzCYUlJl8_msuFtW9Y6eQRktDhOu28yZaJa1gmMfytL6nyIGVrnfo9j43bZ3kUjuxsqa6-rt14jgfLsIWR67fsszIZODJa2nrAYl0rrhfWFhTVV2F-LvQzoI7Cdefsr_YTlyTbmlnVVedw==\"><u>here</u></a> or visit us at re:Invent at booth 706 at the Venetian Sands Expo to try out our interactive activity incorporating Industrial Internet of Things (IIoT) and Machine Learning (ML).</p>  <p align=\"left\"><strong>About Rackspace Technology</strong><br/><a href=\"https://www.globenewswire.com/Tracker?data=PH8_vBgfARfzYjV2YcfcGKS4LCoIeasmpnIarsJFX3LF9QefjIWddmIOKYs4ydurFEHlUW8HY3EE_0w_WpUEF1pa0NeVRRv7uLVt_WYfJ-E=\"><u>Rackspace Technology</u></a> is a leading end-to-end multicloud technology services company. We can design, build and operate our customers’ cloud environments across all major technology platforms, irrespective of technology stack or deployment model. We partner with our customers at every stage of their cloud journey, enabling them to modernize applications, build new products and adopt innovative technologies.</p>  <p align=\"left\"><strong>Media Contact</strong><br/>Natalie Silva<br/>Rackspace Corporate Communications<br/>publicrelations@rackspace.com</p> <div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODQwMzA4OSM0NTg5MTEzIzIwMDU3MjQ=\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RRd016QTRPU00wTlRnNU1URXpJekl3TURVM01qUT0=&amp;key=9622188760451ac75a0eed0576bdddad9f649f7eccb7906406af1f3bbf9a2131fc7d9ffdbda28e155b8392745c406bef4bf46cec55bf4d7302b00cd4e9ebeb41\"/></div></div> <br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/YWZiMTc1ZDktY2M2Ny00MGJhLTlkMDctYjczM2I4YTY3NDMwLTEwMTcyOTc=/tiny/Rackspace-Technology-Inc-.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9ZV1ppTVRjMVpEa3RZMk0yTnkwME1HSmhMVGxrTURjdFlqY3pNMkk0WVRZM05ETXdMVEV3TVRjeU9UYz0vdGlueS9SYWNrc3BhY2UtVGVjaG5vbG9neS1JbmMtLnBuZw==&amp;key=944269b169e53dee447d4819f56a99c4dded3a1df1ba790ad76db3679fb219fe9bd32facbb501aa32d4562b2837ba883ef486bf9feb51c8887e2dff80e982182\"/></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright GlobeNewswire, Inc. 2021</p></div>"}