{"date": "2021-11-27 22:55:49.440000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3504.56, "close": 3507.07}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Today, Amazon Web Services (AWS) announced the general availability of the Amazon EC2 R6i instances powered by Intel? Xeon? Scalable processors. Today?s news follows two earlier Amazon announcements of its EC2 instances powered by 3rd generation Intel Xeon Scalable processors, the Amazon EC2 M6i and C6i instances.</p><p>Designed for memory-intensive workloads, the R6i instances are powered by 3rd generation Intel Xeon Scalable processors (code named Ice Lake), Amazon measured up to 15% better compute price performance over R5 instances, with an all-core turbo frequency of 3.5 GHz and always-on memory encryption using Intel Total Memory Encryption (TME). R6i instances are SAP-Certified and are ideal for workloads such as relational and noSQL databases, distributed web scale in-memory caches like Memcached and Redis, in-memory databases like SAP HANA, and real time big data analytics like Hadoop and Spark clusters.</p></div><div class=\"tr-npp-body\"><p>Built on the AWS Nitro System, a combination of dedicated hardware and lightweight hypervisor, R6i instances deliver practically all of the compute and memory resources of the host hardware to the customers? instance.</p><p>Finally, to meet customer demands for increased scalability, R6i instances provide two new sizes (32xlarge and metal) with 128 vCPUs and 1,024 GiB of memory, which is 33% more than the largest previous generation R5 instance. They also provide up to 20% higher memory bandwidth per vCPU compared to R5 instances.</p><p>The EC2 R6i instances are generally available today in AWS Regions: U.S. East (Ohio), U.S. East (Northern Virginia), U.S. West (Oregon), Europe (Ireland).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}