{"date": "2022-02-20 21:52:51.443000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Get ready to serve up delicious cuisine with this Staub cast iron cocotte, on sale right now for an unbelievable price at Amazon. </p></div><div class=\"tr-npp-body\"><p><span><span>Get deals and shopping advice delivered straight to your phone. </span> Sign up for text message alerts from the deal-hunting nerds at Reviewed.</span> </p><p>Shoppers can snag the 4-quart round Dutch oven for as low as $99.95—a $30.07 price cut from the original $130.02 price tag at Amazon. The larger Staub cast iron 5.5-quart round cocotte (from $319) is the best Dutch oven we've ever tested, so this smaller model is sure to impress even the most skilled chefs. This model features a tempered glass lid for optimal heat control and a multi-coat enamel which the brand claims is resistant to chips, scratches and discoloration—and the sale price covers the cherry red, black and white models. </p><p>► <span>Allbirds sale:</span>  Get 20% off these popular sneakers right now</p><p>Designed for searing, boiling, deep-frying, braising, browning and so much more, this versatile pot can be used in the oven and on both induction and traditional stovetops. Better still, there's no pre-seasoning required, so you can start using your newest cooking essential right away. </p><p>► <span>Presidents' Day sales: </span> Shop all the best deals on furniture, mattresses and everything in between </p><p>When testing the bigger 5.5-quart model, our testers called the customer-favorite Dutch oven \"an absolute favorite for anything and everything in the kitchen,\" and noted that it \"produced a deeply flavorful broth, evenly roasted chicken pieces and the tallest sourdough loaf of the bunch.\" </p><p>Whether you want to perfect your culinary skills with some high-quality cookware or simply treat yourself to a tasty deal, look no further than the Staub cast iron 4-quart cocotte. A deal this good certainly won't last, so be sure to shop fast! </p><p class=\"tr-npp-section-title\">Get the Staub Cast Iron 4-Quart Round Cocotte from $99.95 (save $5.01 to $107.65).</p><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Get this beautiful Staub Dutch oven for less than $100 at Amazon today</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}