{"date": "2022-01-11 07:50:22+00:00", "ticker": "AVV", "mrkt_info": {"open": 3017.0, "close": 3130.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><br/>\nBy Staff Writer<br/>\n<p><span class=\"round articleImage\" id=\"span\"></span></p>\n<div id=\"atext\">\n<div>Aveva, a global leader in industrial software, said it has signed a long-term partnership deal with power generation major EDF to help elevate its 3D nuclear engineering programme and deliver leading-edge energy-efficient performance.</div>\n<div> </div>\n</div>\n<div>Under this deal, Aveva will help drive EDF’s Switch digital transformation programme with its Aveva E3D Design solution and other components of the Aveva Unified Engineering solution, while EDF will boost its engineering design portfolio by way of faster design and delivery of its nuclear plants as well as advanced safety and performance standards.</div>\n<div>By streamlining data from different design disciplines - including mechanical, electrical and civil works - several hundred users across different global locations will be able to work together within a digital twin repository, eliminating siloed engineering design approaches, avoiding data inconsistencies, and removing duplication.</div>\n<div> </div>\n<div>Aveva technology will enable users to collaborate on shared 3D models simultaneously, thus improving the competitiveness of EDF’s nuclear engineering design processes.</div>\n<div>This partnership builds on a long-term relationship between Aveva and EDF. Aveva has supported EDF with 3D digital engineering solutions at its N4 nuclear plants since the 1980s.</div>\n<div>To date, Aveva’s capabilities have enabled EDF to drive its sustainable nuclear vision by reducing operational work-hours and by enhancing data consistency.</div>\n<div> </div>\n<div>The new partnership between Aveva and EDF is expected to generate the following results:</div>\n<div> </div>\n<div>•Reduction in design work times and in engineering work times.</div>\n<div>•Decrease in the need for re-work due to consistently accurate and high-quality deliverables.</div>\n<div>•Faster development rate of 3D models.</div>\n<div>•Greater project visibility for all project stakeholders.</div>\n<div>•Greater collaboration between design and engineering teams.</div>\n<div>•Extended asset lifespans and the ability to reduce CO? emissions.</div>\n<div>The new agreement will also see Aveva digital design systems implemented as the gold standard for all new EDF nuclear projects.</div>\n<div>EDF Group Executive Director (Engineering and New Nuclear Project) Xavier Ursat said: \"The Switch digital transformation program is critical to reinforce EDF’s ambition of producing low-carbon electricity and achieving our carbon neutrality objective by 2050 across our portfolio.\"</div>\n<div>\"Aveva has been a trusted partner for EDF for more than 30 years, helping us to accomplish our digital transformation. Aveva understands our requirements and we trust them to enable us to accelerate our clean energy goals,\" noted Ursat.</div>\n<div> </div>\n<div>\"This extended long-term partnership supports our engineering design and operations teams and empowers them to optimize operational performance and to exploit nuclear energy efficiently,\" he added.</div>\n<div>Aveva CEO Peter Herweck said: \"We are proud to have built a trusted partnership with EDF that serves as the foundation stone of its digital transformation vision and sustainability program. Our market-leading digital engineering design enables us to support EDF in driving their net-zero energy strategy for the benefit of end consumers throughout the world.\"</div>\n<div> </div>\n<div>\"With our new agreement, Aveva will help EDF accelerate engineering collaboration, connect teams and unlock higher performance through shared contextual data and intelligence,\" he stated.</div>\n<div>\"We look forward to assisting EDF’s expert engineers to cut design time, improve collaboration and accelerate efficient decision-making to develop the nuclear industry of the future,\" he added.-<strong>TradeArabia News Service</strong></div>\n<p class=\"syndigate_disclaimer\">Copyright 2022 Al Hilal Publishing and Marketing Group Provided by SyndiGate Media Inc. (<a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a>).</p>\n<div class=\"footnote-disclaimer\">Disclaimer: The content of this article is syndicated or provided to this website from an external third party provider. We are not responsible for, and do not control, such external websites, entities, applications or media publishers. The body of the text is provided on an “as is” and “as available” basis and has not been edited in any way. Neither we nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this article. <a href=\"https://d3a0oa8cittb3t.cloudfront.net/researchreports/Disclaimers/TR%20Disclaimer.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read our full disclaimer policy here</a>.</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© TradeArabia</p></div>"}