{"date": "2021-12-01 19:52:01.590000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwalignl{text-align:left;}.storyContent .bwlistdisc{list-style-type:disc;}</style><p class=\"bwalignc\">\n<b>Amazon Investing in 274 Renewable Energy Projects Globally, Adds 18 New Projects in Europe and U.S.</b>\n</p><p class=\"bwalignc\">\n<span>Amazon is the largest corporate buyer of renewable energy globally and is on a path to power 100% of its business with renewable energy by 2025</span>\n</p><p class=\"bwalignc\">\n<span>Amazon’s renewable energy investments equivalent to energy use of 3 million U.S. homes and will eliminate 13.7 million metric tons of carbon emissions each year as Amazon works to reach net-zero carbon by 2040</span>\n</p><p class=\"bwalignl\">\nAmazon (NASDAQ: AMZN) today announced 18 new utility-scale wind and solar energy projects across the U.S., Finland, Germany, Italy, Spain, and the U.K., totaling 5.6 gigawatts (GW) of procured capacity to date in 2021. Amazon now has 274 renewable energy projects globally and is on a path to power 100% of its business operations with renewable energy by 2025—five years earlier than its original 2030 commitment.\n</p><p>\nThese new utility-scale wind and solar projects bring Amazon’s total committed renewable electricity production capacity to more than 12 GW and 33,700 gigawatt hours (GWh) when the projects become fully operational, or electricity output equivalent to powering more than 3 million U.S. homes for a year. The projects will supply renewable energy for Amazon’s corporate offices, fulfillment centers, and Amazon Web Services (AWS) data centers that support millions of customers globally. The projects will also help Amazon meet its <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2Fnews%2Fdevices%2Fintroducing-our-most-sustainable-devices-ever&amp;esheet=52543036&amp;newsitemid=20211201005372&amp;lan=en-US&amp;anchor=commitment&amp;index=1&amp;md5=9656a0851dc9643c68f6163ddc7fbdf2\" data-type=\"url\" class=\"tr-link\" translate=\"no\">commitment</a> to produce the clean energy equivalent of the electricity used by all consumer Echo devices. The amount of clean energy produced by these projects will avoid the equivalent of the annual emissions of nearly 3 million cars in the U.S. each year, or about 13.7 million metric tons.\n</p><p>\n“We are moving quickly and deliberately to reduce our carbon emissions and address the climate crisis,” said Kara Hurst, vice president of worldwide sustainability at Amazon. “Significant investments in renewable energy globally are an important step in delivering on The Climate Pledge, our commitment to reach net-zero carbon by 2040, 10 years ahead of the Paris Agreement. Renewable energy projects also bring new investment, green jobs, and advance the decarbonization of the electricity systems in communities around the world.”\n</p><p>\nFollowing today’s announcement, Amazon is the largest corporate buyer of renewable energy in the world, with 274 global projects including 105 utility-scale wind and solar projects and 169 solar rooftops on facilities and stores worldwide. The 18 new wind and solar projects announced today include:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\n<b>Eight new projects across the U.S.: </b>Amazon added more than 1 GW of utility-scale solar projects in the U.S., including Amazon’s first solar projects in Arizona and Georgia, and additional projects in Ohio, Texas, and Virginia. In total, Amazon has enabled more than 6 GW of renewable energy in the U.S. through 62 projects.\n</li>\n<li>\n<b>A second solar project paired with energy storage: </b>Based in Arizona, Amazon’s second solar project paired with energy storage enables the company to align solar generation with periods of the greatest demand, even when the sun is not shining. The 300-megawatt (MW) solar project is paired with a 150-MW battery energy storage system and brings Amazon’s battery storage projects to 220 MW.\n</li>\n<li>\n<b>Four new renewable projects in the Nordics: </b>Amazon added 158 MW through four wind projects in Finland, bringing its total renewable energy portfolio across the Nordics to more than 950 MW.\n</li>\n<li>\n<b>Additional projects in Italy, Spain, and Northern Ireland</b><b>:</b> Amazon’s new solar project in Italy is the company’s third in the country, adding 40 MW on top of the 66 MW already enabled.<b> </b>In Spain, Amazon’s four new solar projects together add more than 630 MW to the grid. A new wind project in Northern Ireland brings Amazon’s portfolio to 245 MW on Ireland’s all-island grid and its total U.K. portfolio to more than 545 MW of wind energy. In total, Amazon has enabled more than 3.5 GW of renewable energy in Europe through 34 projects, making it the largest procurer of renewable energy in Europe.\n</li>\n</ul><p>\nTo see Amazon’s renewable energy projects around the world, visit our <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fsustainability.aboutamazon.com%2Fabout%2Faround-the-globe%3FenergyType%3Dtrue&amp;esheet=52543036&amp;newsitemid=20211201005372&amp;lan=en-US&amp;anchor=interactive+map&amp;index=2&amp;md5=4394d462201a868c54461b2199f19d7e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">interactive map</a>.\n</p><p>\n“Amazon is wasting no time demonstrating that they are fully committed to a clean energy future for all,” said Gregory Wetstone, CEO of the American Council on Renewable Energy. “At COP26, the world agreed we needed bigger and bolder ambitions around global carbon reduction from all sectors. With hundreds of renewable energy projects already underway, Amazon is a model for the level of urgency and action we need from the private sector to combat the climate crisis.”\n</p><p>\n“For the second year in a row, Amazon has set new records as it works toward fully powering its operations with renewable energy by 2025, five years ahead of schedule,” said Miranda Ballentine, CEO of Clean Energy Buyers Association (CEBA). “Large-scale clean energy investments like these benefit us all and should be the new normal for industries of all shapes and sizes. They bring good-paying, green jobs to local communities and support progress toward our community's goal of a 90% carbon-free U.S. electricity system.”\n</p><p>\n“Amazon’s procurement of 12 GW of renewable energy capacity globally is a strong testament to the company’s commitment to reaching net-zero carbon by 2040,” said Hannah Hunt, impact director at RE-Source, a corporate renewable energy sourcing platform in Europe. “The company’s 10 new renewable energy operations across Europe will benefit communities, bring new green jobs, and help meet our commitments to curb the climate crisis.”\n</p><p>\nAmazon and Global Optimism co-founded The Climate Pledge in 2019. The Pledge now has more than 200 signatories, including Best Buy, IBM, Microsoft, PepsiCo, Siemens, Unilever, Verizon, and Visa. To reach its goal, Amazon will continue to reduce emissions across its operations by taking real business actions and establishing a path to power its operations with 100% renewable energy, five years ahead of the company’s original target of 2030; delivering its Shipment Zero vision to make all Amazon shipments net-zero carbon, with 50% net-zero carbon by 2030; purchasing 100,000 electric delivery vehicles, the largest order ever of electric delivery vehicles; and by investing $2 billion in the development of decarbonizing services and solutions through the Climate Pledge Fund. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fsustainability.aboutamazon.com%2F&amp;esheet=52543036&amp;newsitemid=20211201005372&amp;lan=en-US&amp;anchor=https%3A%2F%2Fsustainability.aboutamazon.com%2F&amp;index=3&amp;md5=becad048efb75a63128e62241901be8e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://sustainability.aboutamazon.com/</a>.\n</p><p>\n<b>About Amazon</b>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Fire tablets, Fire TV, Amazon Echo, and Alexa are some of the products and services pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Famazon.com%2Fabout&amp;esheet=52543036&amp;newsitemid=20211201005372&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=4&amp;md5=b03477734dbba544143fefe3c35c87db\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Ftwitter.com%2FAmazonNews&amp;esheet=52543036&amp;newsitemid=20211201005372&amp;lan=en-US&amp;anchor=%40AmazonNews&amp;index=5&amp;md5=f041dd517c9b9b28471c3f2e37950978\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@AmazonNews</a>.\n</p><p>\n<b>About Amazon Web Services</b>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com&amp;esheet=52543036&amp;newsitemid=20211201005372&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=6&amp;md5=621b69f46eedd4d10fbaec85cc85b68b\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211201005372/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211201005372/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fp&amp;esheet=52543036&amp;newsitemid=20211201005372&amp;lan=en-US&amp;anchor=www.amazon.com%2Fp&amp;index=7&amp;md5=581a40a9542bb378af4269a245de0a0c\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/p</a>\n</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON</p></div>"}