{"date": "2021-12-07 00:20:26.039000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SUMO LOGIC INC (\"SUMO-Q\")\n- Third Quarter Fiscal 2022 Financial Results\n\n     Sumo Logic, a pioneer of continuous intelligence, announced financial\nresults for the third quarter of its fiscal 2022 ended October 31, 2021.\n\n     \"Sumo Logic delivered another strong quarter of revenue growth for the\nfiscal third quarter. Results were again driven by continued adoption of\nour leading Continuous Intelligence platform, which helps our customers\nensure application reliability, manage and optimize multi-cloud\ninfrastructure, as well as secure and protect against modern security\nthreats,\" said Ramin Sayar, President and CEO of Sumo Logic. \"We continue\nto leverage our differentiated DevSecOps platform across a broad range of\nobservability and security uses cases, which we believe strengthens our\nposition and helps us further capture the significant opportunity created\nby digital transformations and cloud migrations.\"\n\n     Third Quarter Fiscal 2022 Financial Highlights\n\n     *  Revenue was $62.0 million, an increase of 20% year-over-year\n     *  Revenue, excluding our largest revenue customer, was $57.4 million,\nan increase of 19% year-over-year\n     *  GAAP gross margin was 67%; non-GAAP gross margin was 73%\n     *  GAAP operating loss was $31.4 million; GAAP operating margin was\n(51)%\n     *  Non-GAAP operating loss was $13.9 million; non-GAAP operating\nmargin was (22)%\n     *  GAAP net loss was $30.8 million or $0.28 per share\n     *  Non-GAAP net loss was $13.3 million or $0.12 per share\n     *  Net cash used in operating activities was $12.7 million; free cash\nflow was $(13.2) million\n     *  Cash and cash equivalents and marketable securities were $362.1\nmillion as of October 31, 2021\n\n     Recent Highlights\n\n     *  Appointed Lynne Doherty as President, Worldwide Field Operations.\nLynne brings extensive sales and go-to-market leadership experience scaling\ngo-to-market operations at multiple large tech companies. Her expertise\nwill help accelerate Sumo Logic's go-to-market strategy and transformation,\nstrengthen its global sales and partner ecosystem, and help Sumo further\nscale over the coming years.\n     *  Appointed Stewart Grierson as Chief Financial Officer effective\nDecember 13, 2021. Stewart brings extensive finance and operations\nexperience at high growth private and public technology companies. His\nexpertise in security and observability will allow him to help Sumo Logic\nexecute on its strategy and operational plans over the coming years.\n     *  Named Independent Software Vendor (ISV) Partner of the Year by\nAmazon Web Services (AWS) for 2021.\n     *  Released Sumo Logic's inaugural Environmental, Social and\nGovernance Report, highlighting the ways in which Sumo Logic is enabling\nprogress and sustainable growth in communities across the world.\n     *  Announced new products and features at Illuminate, Sumo Logic's\nannual user conference, where Sumo community experts shared how they are\nleveraging Sumo to better navigate digital transformation. Product\nannouncements included:      *  New and enhanced observability improvements\nto Sumo Logic's monitoring and troubleshooting capabilities with new alert\nresponse features, new real-time data sources and integrations, as well as\nadditional enhancements to support open source.\n     *  The integration of Sensu Go to Sumo Logic's platform and Sensu Go\nPlus which further enhances the monitoring-as-code capabilities of Sensu Go\nand allows real-time insights from all data types for improved\ntroubleshooting, reliability, and security.\n     *  Enhancements to Sumo Logic's Cloud Security Analytics and\nMonitoring solution, which improve our customers' ability to address modern\nworkload protection, Open XDR out-of-the-box XDR threat detection and\nresponse, and expanded security insights with new and updated applications\nfor AWS, multi-cloud, SaaS and productivity applications, and regulatory\nstandards.\n\n     Financial Outlook\n\n     For the fourth quarter of fiscal 2022, Sumo Logic expects:\n\n     *  Total revenue between $63.7 million and $64.7 million, representing\n18% to 20% growth year over year\n     *  Revenue, excluding our largest revenue customer, between $59.5\nmillion and $60.5 million, representing 17% to 19% growth year over year\n     *  Non-GAAP operating loss of $15.9 million to $15.4 million; non-GAAP\noperating margin of (25)% to (24)%\n     *  Non-GAAP net loss per share of $0.17 on approximately 112.0 million\nweighted average shares outstanding\n\n     For the full fiscal year 2022, Sumo Logic expects:\n\n     *  Total revenue between $238.8 million and $239.8 million,\nrepresenting 18% growth year over year\n     *  Revenue, excluding our largest revenue customer, between $222.8\nmillion and $223.8 million, representing 19% growth year over year\n     *  Non-GAAP operating loss of $53.0 million to $52.5 million; non-GAAP\noperating margin of (22)%\n     *  Non-GAAP net loss per share of $0.51 to $0.50 on approximately\n108.5 million weighted average shares outstanding\n\n     These statements are forward-looking and actual results may differ\nmaterially. Please refer to the Forward-Looking Statements safe harbor\nbelow for information on the factors that could cause our actual results to\ndiffer materially from these forward-looking statements.\n\n     Guidance for non-GAAP financial measures excludes stock-based\ncompensation expense and related employer payroll taxes, amortization of\nacquired intangible assets, and acquisition-related expenses. We have not\nprovided the most directly comparable GAAP measures because certain items\nare out of our control or cannot be reasonably predicted. Accordingly, a\nreconciliation for forward-looking non-GAAP operating loss and non-GAAP net\nloss per share is not available without unreasonable effort. Refer to\nNon-GAAP Financial Measures below.\n\n     Conference Call Details\n\n     The company will host a conference call and live webcast on Monday,\nDecember 6, 2021, at 1:30 p.m. Pacific time (4:30 p.m. Eastern time). The\nnews release with the financial results will be accessible on Sumo Logic's\ninvestor relations website at investor.sumologic.com prior to the\nconference call. To access the conference call, dial (877) 407-0784 from\nthe United States or (201) 689-8560 internationally and reference the\ncompany name and conference title. Following the completion of the call, a\nreplay will be available for approximately two weeks. The replay can be\naccessed by dialing (844) 512-2921 from the United States or (412) 317-6671\ninternationally and using the recording passcode 13725119. A live webcast\nand replay of the conference call can also be accessed from the Sumo Logic\nInvestor Relations website at investor.sumologic.com.\n\n     Supplemental Financial and Other Information\n\n     Supplemental financial and other information can be accessed through\nSumo Logic's investor relations website at investor.sumologic.com. Sumo\nLogic uses the investor relations section on its website as the means of\ncomplying with its disclosure obligations under Regulation FD. Accordingly,\nwe recommend that investors should monitor Sumo Logic's investor relations\nwebsite in addition to following Sumo Logic's press releases, SEC filings\nand social media.\n\n     Non-GAAP Financial Measures\n\n     In addition to our financial information presented in accordance with\nGAAP, we believe the following non-GAAP financial measures are useful in\nevaluating our operating performance. We use the following non-GAAP\nfinancial measures, collectively, to evaluate our ongoing operations and\nfor internal planning and forecasting purposes, including the preparation\nof our annual operating budget and quarterly forecasts, to evaluate the\neffectiveness of our business strategies, and to communicate with our board\nof directors concerning our financial performance. We believe that non-GAAP\nfinancial measures, when taken together with the corresponding GAAP\nfinancial measures, may be helpful to investors because they provide\nconsistency and comparability with past financial performance and\nmeaningful supplemental information regarding our performance by excluding\ncertain items that may not be indicative of our business, results of\noperations, or outlook. The non-GAAP financial measures are presented for\nsupplemental informational purposes only, have limitations as analytical\ntools, and should not be considered in isolation or as a substitute for\nfinancial information presented in accordance with GAAP and may be\ndifferent from similarly-titled non-GAAP financial measures used by other\ncompanies. In addition, other companies, including companies in our\nindustry, may calculate similarly-titled non-GAAP financial measures\ndifferently or may use other measures to evaluate their performance, all of\nwhich could reduce the usefulness of our non-GAAP financial measures as\ntools for comparison. Investors are encouraged to review the related GAAP\nfinancial measures and the reconciliation of these non-GAAP financial\nmeasures to their most directly comparable GAAP financial measures, and not\nto rely on any single financial measure to evaluate our business, which it\nincludes in press releases announcing quarterly financial results,\nincluding this press release.\n\n     Non-GAAP gross profit, non-GAAP gross margin, non-GAAP operating\nexpenses, non-GAAP loss from operations, non-GAAP operating margin,\nnon-GAAP net loss and non-GAAP net loss per share: We define these non-GAAP\nfinancial measures as their respective GAAP measures, excluding expenses\nrelated to stock-based compensation expense and related employer taxes on\nequity, amortization of acquired intangibles, and acquisition-related\nexpenses. We use these non-GAAP financial measures as part of our overall\nassessment of our performance, including the preparation of our annual\noperating budget and quarterly forecasts, to evaluate the effectiveness of\nour business strategies, and to communicate with our board of directors\nconcerning our financial performance.\n\n     Free cash flows: We define free cash flow as cash used in operating\nactivities less purchases of property and equipment and capitalized\ninternal-use software costs. We believe free cash flow is a useful\nindicator of liquidity that provides our management, board of directors,\nand investors with information about our future ability to generate or use\ncash to enhance the strength of our balance sheet and further invest in our\nbusiness and pursue potential strategic initiatives.\n\n     Please see the reconciliation tables at the end of this release for\nthe reconciliation of GAAP and non-GAAP results.\n\n     Forward-Looking Statements\n\n     This press release contains express and implied forward-looking\nstatements including but not limited to, statements regarding our GAAP and\nnon-GAAP guidance for the fourth fiscal quarter and full fiscal year 2022,\nthe expected benefits of hiring new executives and expectations regarding\nthe benefits of our offerings, our growth strategy and investments, our\nmarket opportunity, and our ability to achieve success. Forward-looking\nstatements are subject to a number of risks and uncertainties, many of\nwhich involve factors or circumstances that are beyond our control. Our\nactual results could differ materially from those stated or implied in\nforward-looking statements due to a number of factors, including but not\nlimited to our ability to realize the anticipated benefits from our\nacquisitions, our ability to achieve and maintain future profitability, our\nability to attract new customers and retain and sell additional\nfunctionality and services to our existing customers, our ability to\nsustain and manage our growth, our ability to successfully add new features\nand functionality to our platform, our ability to compete effectively in an\nincreasingly competitive market, and general market, political, economic,\nand business conditions, including the impact of COVID-19, and other risks\ndetailed in our Quarterly Report on Form 10-Q for the fiscal quarter ended\nJuly 31, 2021, filed with the Securities and Exchange Commission (SEC) on\nSeptember 10, 2021, and other filings and reports that we may file from\ntime to time with the SEC. Additional information will be made available in\nour Quarterly Report on Form 10-Q for the quarter ended October 31, 2021\nthat will be filed with the SEC, which should be read in conjunction with\nthis press release and the financial results included herein.\n\n     Past performance is not necessarily indicative of future results. The\nforward-looking statements included in this press release represent our\nviews as of the date of this press release. These forward-looking\nstatements should not be relied upon as representing our views as of any\ndate subsequent to the date of this press release. We anticipate that\nsubsequent events and developments could cause our views to change. We\nundertake no obligation to update or revise any forward-looking statements,\nwhether as a result of new information, future events or otherwise, except\nas required by law.\n\n     About Sumo Logic\n\n     Sumo Logic, Inc. (Nasdaq: SUMO), is the pioneer in continuous\nintelligence, a new category of software, which enables organizations of\nall sizes to address the data challenges and opportunities presented by\ndigital transformation, modern applications, and cloud computing. The Sumo\nLogic Continuous Intelligence Platform(TM) automates the collection,\ningestion, and analysis of application, infrastructure, security, and IoT\ndata to derive actionable insights within seconds. More than 2,100\ncustomers around the world rely on Sumo Logic to build, run, and secure\ntheir modern applications and cloud infrastructures. Only Sumo Logic\ndelivers its platform as a true, multi-tenant SaaS architecture, across\nmultiple use-cases, enabling businesses to thrive in the Intelligence\nEconomy. For more information, visit www.sumologic.com.\n\n     For more information, please contact:\n\n     Investor Relations Contact\n     Investor Relations\n     IR@sumologic.com\n\n     Contact:\n     Melissa Beck\n     mliton@sumologic.com\n     (650) 814-3882\n\nSumo Logic, Inc.\nCondensed Consolidated Statements of Operations\n(in thousands, except per share data)\n(unaudited)\n\n//st\n\n                     Three Months Ended October 31,                  Nine\nMonths Ended October 31,\n\n                     2021                    2020                    2021\n2020\n\n  Revenue            $         62,016        $         51,868        $\n175,076       $         148,485\n\n  Cost of revenue    20,384                  13,601                  55,557\n42,140\n\n  Gross profit       41,632                  38,267\n119,519                 106,345\n\n  Operating\n  expenses:\n\n  Research and       25,464                  18,753                  69,768\n51,756\n  development\n\n  Sales and          33,565                  26,904                  95,300\n80,534\n  marketing\n\n  General and        14,015                  15,507                  45,258\n32,096\n  administrative\n\n  Total operating    73,044                  61,164\n210,326                 164,386\n  expenses\n\n  Loss from          (31,412             )   (22,897             )\n(90,807             )   (58,041             )\n  operations\n\n  Interest and       (19                 )   (322                )   34\n(249                )\n  other (expense)\n  income, net\n\n  Interest expense   (44                 )   (290                )   (133\n)   (654                )\n\n  Loss before        (31,475             )   (23,509             )\n(90,906             )   (58,944             )\n  provision for\n  income taxes\n\n  Provision          (639                )   417                     (1,107\n)   764\n  (benefit) for\n  income taxes\n\n  Net loss           $         (30,836   )   $         (23,926   )   $\n(89,799   )   $         (59,708   )\n\n  Net loss per       $         (0.28     )   $         (0.43     )   $\n(0.84     )   $         (1.92     )\n  share, basic\n  and diluted\n\n  Weighted-average   110,409                 55,816\n107,479                 31,044\n  shares used to\n  compute net\n  loss per share,\n  basic and\n  diluted\n\n//et\n\n     Sumo Logic, Inc.\nCondensed Consolidated Balance Sheets\n(in thousands)\n(unaudited)\n\n//st\n\n                       October 31, 2021            January 31, 2021\n\n  Assets\n\n  Current assets:\n\n  Cash and cash        $             78,288        $             404,140\n  equivalents\n\n  Marketable           210,633                     --\n  securities,\n  current\n\n  Accounts             43,404                      44,761\n  receivable, net\n  Prepaid expenses     10,639                      10,509\n\n  Deferred sales       15,810                      12,790\n  commissions,\n  current\n\n  Other current        2,647                       3,110\n  assets\n\n  Total current        361,421                     475,310\n  assets\n\n  Marketable           73,153                      --\n  securities,\n  noncurrent\n\n  Property and         4,864                       4,156\n  equipment, net\n\n  Operating lease      7,162                       --\n  right-of-use\n  assets\n\n  Goodwill             95,815                      50,672\n\n  Acquired             30,421                      10,656\n  intangible\n  assets, net\n\n  Deferred sales       29,736                      27,857\n  commissions,\n  noncurrent\n\n  Other assets         1,507                       1,856\n\n  Total assets         $             604,079       $             570,507\n\n  Liabilities and\n  stockholders'\n  equity\n\n  Current\n  liabilities:\n\n  Accounts payable     $             9,338         $             4,832\n\n  Accrued expenses     25,839                      23,316\n  and other current\n  liabilities\n\n  Operating lease      4,612                       --\n  liabilities,\n  current\n  Deferred revenue,    118,668                     102,625\n  current\n\n  Total current        158,457                     130,773\n  liabilities\n\n  Operating lease      3,514                       --\n  liabilities,\n  noncurrent\n\n  Deferred revenue,    5,594                       4,076\n  noncurrent\n\n  Other liabilities    4,789                       4,246\n\n  Total liabilities    172,354                     139,095\n\n  Stockholders'\n  equity:\n\n  Common stock         11                          10\n\n  Additional           921,710                     829,238\n  paid-in-capital\n\n  Accumulated other    (2,406                  )   (45\n)\n  comprehensive loss\n\n  Accumulated          (487,590                )   (397,791\n)\n  deficit\n\n  Total                431,725                     431,412\n  stockholders'\n  equity\n\n  Total liabilities    $             604,079       $             570,507\n  and stockholders'\n  equity\n\n//et\n\n     Sumo Logic, Inc.\nCondensed Consolidated Statement of Cash Flows\n(in thousands)\n(unaudited)\n\n//st\n\n                   Three Months Ended October 31,                  Nine\nMonths Ended October 31,\n\n                   2021                    2020                    2021\n2020\n\n  Cash flows\n  from\n  operating\n  activities\n\n  Net loss         $         (30,836   )   $         (23,926   )   $\n(89,799   )   $         (59,708   )\n\n  Adjustments\n  to reconcile\n  net loss to\n  net cash used\n  in operating\n  activities:\n\n  Depreciation     4,282                   2,080                   9,889\n6,152\n  and\n  amortization\n\n  Amortization     4,188                   2,934                   11,353\n8,148\n  of deferred\n  sales\n  commissions\n\n  Accretion        789                     --                      2,156\n--\n  (amortization)\n  of marketable\n  securities\n  purchased at\n  a premium\n  (discount)\n\n  Stock-based      12,937                  18,943                  39,127\n28,666\n  compensation,\n  net of\n  amounts\n  capitalized\n\n  Non-cash         1,038                   --                      3,132\n--\n  operating\n  lease cost\n\n  Other            (806                )   104                     (1,852\n)   186\n\n  Changes in\n  operating\n  assets and\n  liabilities\n\n  Accounts         (12,807             )   (12,256             )   1,910\n(14,717             )\n  receivable\n\n  Prepaid          (3,678              )   (5,534              )   (133\n)   (2,276              )\n  expenses\n\n  Other assets     (282                )   (799                )   1,104\n(619                )\n\n  Deferred         (6,762              )   (10,800             )   (16,252\n)   (17,718             )\n  sales\n  commissions\n\n  Accounts         2,730                   843                     4,283\n(149                )\n  payable\n\n  Accrued          5,874                   1,611                   1,806\n1,781\n  expenses and\n  other current\n  liabilities\n\n  Deferred         11,550                  7,828                   16,436\n1,695\n  revenue\n\n  Operating        (1,124              )   --                      (3,371\n)   --\n  lease\n  liabilities\n\n  Other            218                     673                     265\n2,354\n  noncurrent\n  liabilities\n\n  Net cash used    (12,689             )   (18,299             )   (19,946\n)   (46,205             )\n  in operating\n  activities\n\n  Cash flows\n  from\n  investing\n  activities\n\n  Purchases of     (67,917             )   --                      (359,587\n)   --\n  marketable\n  securities\n\n  Maturities of    42,750                  --                      57,958\n--\n  marketable\n  securities\n\n  Sales of         15,480                  --                      15,480\n--\n  marketable\n  securities\n\n  Purchases of     (498                )   (168                )   (1,799\n)   (358                )\n  property and\n  equipment\n\n  Capitalized      --                      (246                )   --\n(1,205              )\n  internal-use\n  software costs\n\n  Cash paid for    (43                 )   --                      (40,340\n)   --\n  acquisitions,\n  net of cash\n  and\n  restricted\n  cash acquired\n\n  Net cash used    (10,228             )   (414                )   (328,288\n)   (1,563              )\n  in investing\n  activities\n\n  Cash flows\n  from\n  financing\n  activities\n\n  Proceeds from    --                      349,166                 --\n349,166\n  initial\n  public\n  offering, net\n  of\n  underwriting\n  discounts\n\n  Proceeds from    --                      --                      --\n24,250\n  borrowings\n\n  Repayment of     --                      (24,250             )   --\n(24,250             )\n  borrowings\n\n  Payments of      --                      (765                )   (93\n)   (1,321              )\n  deferred\n  offering costs\n\n  Proceeds from    --                      --                      4,725\n--\n  employee\n  stock\n  purchase plan\n\n  Proceeds from    4,647                   3,990                   17,974\n6,113\n  exercise of\n  common stock\n  options\n\n  Cash paid for    --                      --                      --\n(100                )\n  holdback\n  consideration\n  in connection\n  with\n  acquisitions\n\n  Net cash         4,647                   328,141                 22,606\n353,858\n  provided by\n  financing\n  activities\n\n  Effect of        (25                 )   (76                 )   (174\n)   (134                )\n  exchange rate\n  changes on\n  cash and cash\n  equivalents\n\n  Change in        (18,295             )   309,352                 (325,802\n)   305,956\n  cash and cash\n  equivalents\n  and\n  restricted\n  cash\n\n  Cash and cash\n  equivalents\n  and\n  restricted\n  cash:\n\n  Beginning of     96,933                  98,417                  404,440\n101,813\n  period\n\n  End of period    $         78,638        $         407,769       $\n78,638        $         407,769\n\n//et\n\n     Sumo Logic, Inc.\nReconciliation of GAAP to Non-GAAP Financial Measures\n(in thousands, except per share data and percentages)\n(unaudited)\n\n//st\n\n                        Three Months Ended October 31,\nNine Months Ended October 31,\n\n                        2021                     2020\n2021                     2020\n\n  Reconciliation of\n  gross profit and\n  gross margin\n\n  GAAP gross profit     $         41,632         $        38,267         $\n119,519        $         106,345\n\n  Add: Stock-based      192                      213\n558                      314\n  compensation and\n  related employer\n  payroll tax\n\n  Add: Amortization     3,614                    1,706\n8,157                    5,117\n  of acquired\n  intangible assets\n\n  Add:                  97                       --\n151                      --\n  Acquisition-related\n  expenses\n\n  Non-GAAP gross        $         45,535         $        40,186         $\n128,385        $         111,776\n  profit\n\n  GAAP gross margin     67                  %    74                 %    68\n%    72                  %\n\n  Non-GAAP gross        73                  %    77                 %    73\n%    75                  %\n  margin\n\n  Reconciliation of\n  operating expenses\n\n  GAAP research and     $         25,464         $        18,753         $\n69,768         $         51,756\n  development\n\n  Less: Stock-based     (6,538              )    (5,728             )\n(17,499             )    (9,606              )\n  compensation and\n  related employer\n  payroll tax\n\n  Less:                 (297                )    --\n(535                )    --\n  Acquisition-related\n  expenses\n\n  Non-GAAP research     $         18,629         $        13,025         $\n51,734         $         42,150\n  and development\n\n  GAAP sales and        $         33,565         $        26,904         $\n95,300         $         80,534\n  marketing\n\n  Less: Stock-based     (3,794              )    (4,747             )\n(11,807             )    (7,863              )\n  compensation and\n  related employer\n  payroll tax\n\n  Less: Amortization    (150                )    --\n(233                )    --\n  of acquired\n  intangible assets\n\n  Less:                 (95                 )    --\n(181                )    --\n  Acquisition-related\n  expenses\n\n  Non-GAAP sales and    $         29,526         $        22,157         $\n83,079         $         72,671\n  marketing\n\n  GAAP general and      $         14,015         $        15,507         $\n45,258         $         32,096\n  administrative\n\n  Less: Stock-based     (2,727              )    (8,255             )\n(10,821             )    (10,883             )\n  compensation and\n  related employer\n  payroll tax\n\n  Less:                 --                       --\n(3,756              )    --\n  Acquisition-related\n  expenses\n\n  Non-GAAP general      $         11,288         $        7,252          $\n30,681         $         21,213\n  and administrative\n\n  Reconciliation of\n  operating loss and\n  operating margin\n\n  GAAP loss from        $         (31,412   )    $        (22,897   )    $\n(90,807   )    $         (58,041   )\n  operation\n\n  Add: Stock-based      13,251                   18,943\n40,685                   28,666\n  compensation and\n  related employer\n  payroll tax\n\n  Add: Amortization     3,764                    1,706\n8,390                    5,117\n  of acquired\n  intangible assets\n\n  Add:                  489                      --\n4,623                    --\n  Acquisition-related\n  expenses\n\n  Non-GAAP operating    $         (13,908   )    $        (2,248    )    $\n(37,109   )    $         (24,258   )\n  loss\n\n  GAAP operating        (51                 )%   (44                )%\n(52                 )%   (39                 )%\n  margin\n\n  Non-GAAP operating    (22                 )%   (4                 )%\n(21                 )%   (16                 )%\n  margin\n\n  Reconciliation of\n  net loss\n\n  GAAP net loss         $         (30,836   )    $        (23,926   )    $\n(89,799   )    $         (59,708   )\n\n  Add: Stock-based      13,251                   18,943\n40,685                   28,666\n  compensation and\n  related employer\n  payroll tax\n\n  Add: Amortization     3,764                    1,706\n8,390                    5,117\n  of acquired\n  intangible assets\n\n  Add:                  489                      --\n4,623                    --\n  Acquisition-related\n  expenses\n\n  Non-GAAP net loss     $         (13,332   )    $        (3,277    )    $\n(36,101   )    $         (25,925   )\n\n  GAAP net loss per     $         (0.28     )    $        (0.43     )    $\n(0.84     )    $         (1.92     )\n  share\n\n  Non-GAAP net loss     $         (0.12     )    $        (0.06     )    $\n(0.34     )    $         (0.84     )\n  per share\n\n  Weighted average      110,409                  55,816\n107,479                  31,044\n  shares\n  outstanding, basic\n  and diluted\n\n  Reconciliation of\n  cash used in\n  operating\n  activities to free\n  cash flow\n\n  GAAP cash used in     $         (12,689   )    $        (18,299   )    $\n(19,946   )    $         (46,205   )\n  operating\n  activities\n\n  Less: Capital         (498                )    (168               )\n(1,799              )    (358                )\n  expenditures\n\n  Less: Capitalized     --                       (246               )    --\n(1,205              )\n  internal-use\n  software costs\n\n  Free cash flow        $         (13,187   )    $        (18,713   )    $\n(21,745   )    $         (47,768   )\n\n//et\n\nTel   : 650-810-8700    SUMO LOGIC INC\nWWW   : <a href=\"https://www.sumologic.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.sumologic.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133905321.MNPRE2133907444-15202120211206</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}