{"date": "2021-06-02 05:34:00+00:00", "ticker": "AVV", "mrkt_info": {"open": 3496.0, "close": 3441.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Dubai, UAE</strong> <strong>-</strong> AVEVA, a global leader in industrial software, driving digital transformation and sustainability, and International Maritime Industries (IMI), today announced that they have extended their existing long-term collaboration with a new strategic partnership.</p>\n<p>The partnership will further advance IMI’s engineering solutions to include production and manufacturing processes, developing best-in-class products and services for the maritime sector in the Middle East and Africa (MEA). The new a joint venture involves Saudi Aramco, Lamprell Plc, Bahri and Hyundai Heavy Industries and spans a 10-year period, to optimize digitalization across the maritime lifecycle utilizing AVEVA Unified Engineering and AVEVA Digital Ship and Shipyard Operations.</p>\n<p>Set to be fully operational by 2023, IMI is driving an accelerated and advanced digital program to ensure it is able to commence yard operations using the most advanced technology innovations. This will help IMI to deliver agile and efficient newbuild project execution, a connected, digitally-enabled workforce to ensure safe and effective ship production, and a smart connected shipyard to continuously optimize the operational efficiency of its facility. The partnership will see all parties collaborating on enhancing digital transformation for IMI’s core business processes and facilities. AVEVA and IMI will also join forces to power futuristic developments and co-innovation of new technologies, including  digital solutions and services for the maritime industry.    </p>\n<p>Fathi K. Al-Saleem, CEO at IMI, said: “The maritime industry is increasingly prioritizing and integrating the digitalization and automation of operations. IMI will offer a range of technologically advanced, high-quality sustainable products and innovative lifecycle management services for customers at internationally competitive prices. As the largest full-service yard in the MENA region,  IMI will help shape the maritime industry as a global leader and disruptor in applying digital solutions to manage, monitor and operate our innovative smart yard.” </p>\n<p>AVEVA is helping maritime sector organizations globally to transform their shipbuilding, utilizing its end-to-end solutions. Increasingly, organizations are examining energy-efficient digital transformation technologies as they focus on automating processes, optimizing operations, and enhancing efficiencies for a sustainable future. With AVEVA’s broad software portfolio addressing all aspects of design, engineering and operation, IMI is now well positioned to realize its digital goals.</p>\n<p>Peter Herweck, CEO, AVEVA, commented: “AVEVA has a comprehensive portfolio of cutting-edge solutions for large-scale digital transformational projects for the maritime industry. We provide an integrated, data- management platform that spans IMI’s core business processes. We are also committed to being a strong partner for co-innovating on transformational technologies and services. We aim to play a key role in delivering data solutions for IMI, enabling them to offer smart digital products to customers. Using insights from advanced AI-infused analytics will enable IMI to continuously optimize its operational agility and engineering efficiency. We look forward to further building this partnership and taking it to new heights over the coming years.”</p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}