{"date": "2021-11-22 09:15:08.476000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The ship has been commissioned by Shell to conduct a seismic survey in search of oil and gas deposits</p><p>CAPE TOWN - Environmental activists protested at the V&amp;A Waterfront against the arrival of the Amazon Warrior ship in Cape Town on Sunday morning.</p></div><div class=\"tr-npp-body\"><p>The ship has been commissioned by Shell to conduct a seismic survey in search of oil and gas deposits between Morgan's Bay and Port St Johns off the Wild Coast, starting on December 1.</p><p>Some protesters, who had gathered from as early as 5.30am, even entered the water around the ship.</p><p>The survey area is located more than 20km from the coast in water depths ranging between 700 and 3 000m. The vessel is expected to drag up to 48 air guns methodically through 6 011km² of ocean surface, firing shock wave emissions.</p><p>It is anticipated that the seismic survey would take in the order of four to five months to complete, depending on weather and current conditions.</p><p>Vessels engaged in fishing have been requested to, so far as possible, keep out of the way of the seismic operation.</p><p>Activists say the high noise blasting of sonar canons under water for seismic testing is a direct threat to whales, dolphins, fish and marine life.</p><p>They also say it is a threat to the livelihood of communities along the Wild Coast who use the riches of the sea to put food on the table and provide an income for their homes.</p><p>More than 145 000 people have already signed a petition calling on the South African government to withdraw approval for the Shell initiative.</p><p>To sign the petition, visit: <a href=\"https://www.change.org/ShellOil-Off-Our-Coast\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.change.org/ShellOil-Off-Our-Coast</a></p><p>* Video compiled by Armand Hough</p><p><span>Cape Times</span> </p><p>Cape Times © 1999 - 2021 Independent Newspapers (Pty) Limited. All rights strictly reserved. Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SyndiGate. All Rights Reserved.</p></div>"}