{"date": "2021-11-08 13:52:11+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><span>\n              <p>NEW YORK, Nov 8 (IFR) - EV pickup/SUV maker <strong>Rivian Automotive</strong> responded to hot early demand for its Nasdaq IPO by substantially upping the price range late Friday to lift potential proceeds to US$10bn.</p>\n              <p>Rivian increased the range for the sale of 135m shares by more than 20% at the midpoint to US$72-$74 from US$57-$62 at launch earlier last week.</p>\n              <p>The offering, which is scheduled to price post-close Tuesday, would be the largest US IPO of the year and the biggest since Alibaba's NYSE debut in 2014. Pricing at the top of the revised offering range would see Rivian raise US$10bn and value the company at close to US$70bn on a fully diluted basis. </p>\n              <p>“It’s not a question of who’s going to be in the deal but how high a price they are prepared to pay,” one buysider said.</p>\n              <p>Amazon, T. Rowe Price, Franklin Templeton, Third Point, Capital Research and Soros Capital Management have agreed to collectively buy US$5bn of shares in the offering, as disclosed at launch. </p>\n              <p>\n                <span>Morgan Stanley</span>, <span>Goldman Sachs</span> and <span>JP Morgan</span> lead a 22-firm syndicate that is employing an auction-like \"direct order entry\" bookbuild, requiring institutional investors to lob orders at a specific price in contrast to the traditional use of market orders for hot tech IPOs.</p>\n              <p>Rivian, billed as the next Tesla and benefiting from the latter's recent share price surge, delivered its first all-electric R1 pickup truck in September and expects to begin producing and delivering both its SUV and electric commercial delivery van by the end of the year.</p>\n              <p>The company has 55,400 pre-orders it expects to fill by the end of 2023 from its factory in Normal, Illinois. It also has an order for 100,000 delivery vans from Amazon, also a 20% shareholder.</p>\n              <p>(Anthony Hughes; Editing by Stephen Lacey)</p>\n              <p>((anthony.hughes@refinitiv.com; (646) 552-4852))</p>\n            </span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © Refinitiv 2021. Click For Restrictions - https://www.refinitiv.com/en/policies/copyright-notice</p></div>"}