{"date": "2022-01-28 15:11:48.347000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2777.45, "close": 2879.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>GOLAR LNG LTD (\"GLNG-Q\")\n- Golar Named Winner of North America Best ESG Energy Business\n- Strategy by Capital Finance International\n\n     Capital Finance International (\"CFI\") has awarded its Best Energy\nBusiness Strategy, North America 2021 Award to Golar LNG Limited (\"Golar\").\n\n     In its citation for the award, CFI  highlighted Golar's commitment to\nrepurposing existing assets and using those assets to produce and regasify\ncleaner burning LNG, facilitating a quicker transition away from higher\npolluting fossil fuels. Also cited was Golar's commitment to innovation in\nthe field of energy efficiency and evaluation of new technology and\nalternatives that could further reduce the carbon footprint of LNG.\n\n     Commenting on the award, Chief Executive Officer Karl-Fredrik Staubo\nsaid: \"Golar has a history of being an LNG market entrepreneur at the\nforefront of some of the key technology advances in the LNG industry,\nincluding first mover into FSRUs and FLNGs.\n\n     Repurposing of assets and innovation focused on energy efficiency\nmakes financial sense for both Golar and its customers and reduces the\nenvironmental footprint of LNG. We are very grateful to be recognized by\nCFI for our long-standing efforts in contributing to strengthen LNG's\nrelative competitiveness in the global energy market.\"\n\n     About Golar\n\n     Golar LNG is one of the world's most innovative and experienced\nindependent owners and operators of marine LNG infrastructure. The company\ndeveloped the world's first Floating LNG liquefaction terminal (FLNG) and\nFloating Storage and Regasification Unit (FSRU) projects based on the\nconversion of existing LNG carriers. Front End Engineering and Design\n(FEED) studies have also been completed for a larger newbuild FLNG\nsolution.\n\n     About CFI\nCFI is a print and online platform reporting on global business, economics\nand finance. Their main mandate is to spark conversations around business\ntransformation, technology and innovation and their annual awards have\nrecognised companies such as Microsoft, Credit Suisse, Fitch, PWC,\nEmirates, and Amazon for their work and the impact they have made in their\nsectors.\n\n     FORWARD LOOKING STATEMENTS\n\n     This press release contains forward-looking statements (as defined in\nSection 21E of the Securities Exchange Act of 1934, as amended) which\nreflects management's current expectations, estimates and projections about\nits operations. All statements, other than statements of historical facts,\nthat address activities and events that will, should, could or may occur in\nthe future are forward-looking statements. Words such as \"may,\" \"could,\"\n\"should,\" \"would,\" \"expect,\" \"plan,\" \"anticipate,\" \"intend,\" \"forecast,\"\n\"believe,\" \"estimate,\" \"predict,\" \"propose,\" \"potential,\" \"continue,\" or\nthe negative of these terms and similar expressions are intended to\nidentify such forward-looking statements.\n\n     These statements are not guarantees of future performance and are\nsubject to certain risks, uncertainties and other factors, some of which\nare beyond our control and are difficult to predict. Therefore, actual\noutcomes and results may differ materially from what is expressed or\nforecasted in such forward-looking statements. You should not place undue\nreliance on these forward-looking statements, which speak only as of the\ndate of this press release. Golar LNG Limited undertakes no obligation to\nupdate publicly any forward-looking statements whether as a result of new\ninformation, future events or otherwise, unless required by applicable law.\n\n     Hamilton, Bermuda\n\n     January 28, 2022\n\n     Enquiries:\n\n     Golar Management Limited: + 44 207 063 7900\n\n     Karl Fredrik Staubo - CEO\n\n     Eduardo Maranhao - CFO\n\n     Stuart Buchanan - Head of Investor Relations\n\n     This information is subject to the disclosure requirements pursuant to\nSection 5-12 the Norwegian Securities Trading Act\n\nTel   : 1-441-295-4705    GOLAR LNG LTD (BERMUDA)\nWWW   : <a href=\"https://www.golarlng.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.golarlng.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2202700191.MNPRE2202700790-07014220220128</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}