{"date": "2022-02-25 19:31:58+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3027.16, "close": 3071.26}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds details on automakers' access to precious metals</p><p class=\"tr-by\">By Ben Klayman</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Feb 25 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Several companies, including automakers Volkswagen <a href=\"reuters://REALTIME/Verb=FullQuote/ric=VOWG_p.DE\" data-type=\"ric\" data-ric=\"VOWG_p.DE\" translate=\"no\" dir=\"ltr\">VOWG_p.DE</a> and Renault <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RENA.PA\" data-type=\"ric\" data-ric=\"RENA.PA\" translate=\"no\" dir=\"ltr\">RENA.PA</a> and tire maker Nokian Tyres <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TYRES.HE\" data-type=\"ric\" data-ric=\"TYRES.HE\" translate=\"no\" dir=\"ltr\">TYRES.HE</a>, on Friday outlined plans to shut or shift manufacturing operations following Russia's invasion of Ukraine.</p><p>After invading earlier this week, Russian forces pressed their advance on Friday as missiles pounded Kyiv and authorities said they were girding for an assault aimed at overthrowing the government. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2UZ1Y5\" data-type=\"storyId\" data-story-id=\"nL1N2UZ1Y5\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2V001F\" data-type=\"storyId\" data-story-id=\"nL1N2V001F\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>The United States announced sweeping export restrictions against Russia on Thursday, hammering its access to global exports of goods ranging from commercial electronics and computers to semiconductors and aircraft parts. That could lead companies to alter manufacturing plans or seek alternative supply lines. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2UZ3KE\" data-type=\"storyId\" data-story-id=\"nL1N2UZ3KE\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>The invasion was a factor in consulting firms J.D. Power and LMC Automotive slashing their 2022 global new-car sales outlook by 400,000 vehicles to 85.8 million units. The auto industry had already been dealing with a tight supply of vehicles due to the global semiconductor shortage. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2V032A\" data-type=\"storyId\" data-story-id=\"nL4N2V032A\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>\"An already-tight supply of vehicles and high prices across the globe will be under added pressure based on the severity and duration of the conflict in Ukraine,\" said Jeff Schuster, president of global vehicle forecasts at LMC. </p><p>\"Rising oil and aluminum prices will likely affect consumers’ willingness and ability to purchase vehicles, even if inventory improves,\" he added. \"We have made significant downgrades to the Ukraine and Russia forecasts due to the escalating conflict between the two and the repercussions associated with sanctions against Russia.\"</p><p>The conflict could boost oil prices above $100 a barrel, which would add inflationary pressure on European and American consumers, Wells Fargo analyst Colin Langan said in a research note. While consumers have been willing to pay above sticker price to get new vehicles, sustained higher gas prices could impact long-term recovery, he said. </p><p>Germany's Volkswagen said it would halt production for a few days at two German factories after a delay in getting parts made in Ukraine. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2V079W\" data-type=\"storyId\" data-story-id=\"nL8N2V079W\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>France's Renault said it would suspend some operations at its car assembly plants in Russia next week due to logistics bottlenecks caused by parts shortages. It did not specify whether its supply chain had been hit by the conflict, but a spokeswoman said the action was a consequence of reinforced borders between Russia and neighboring countries through which parts are carried by truck. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2V014D\" data-type=\"storyId\" data-story-id=\"nL1N2V014D\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>The carmaker is among Western companies most exposed to Russia, where it makes 8% of its core earnings according to Citibank.</p><p>\"Interruptions are primarily caused by tighter border controls in transit countries and the forced need to change a number of established logistics routes,\" the company's Russian unit said, without naming any countries.   </p><p>Russian carmaker Avtovaz <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AVAZI_p.MM\" data-type=\"ric\" data-ric=\"AVAZI_p.MM\" translate=\"no\" dir=\"ltr\">AVAZI_p.MM</a>, controlled by Renault, also said it might suspend some assembly lines at a plant in central Russia for one day, on Monday, due to a persistent global shortage of electronic components. Avtovaz also did not mention the invasion in its statement. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nR4N2UT06B\" data-type=\"storyId\" data-story-id=\"nR4N2UT06B\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Finnish tire maker Nokian said it was shifting production of some key product lines from Russia to Finland and the United States to prepare for possible further sanctions following the invasion. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2V00MI\" data-type=\"storyId\" data-story-id=\"nL1N2V00MI\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p><br/></p><p>MANAGING DISRUPTION</p><p>Aptiv Chief Executive Kevin Clark said on Thursday that over the last couple of months the American auto parts maker had swapped high-volume parts work out of Ukraine in favor of lower-volume products \"so we were better-positioned to manage disruption.\" <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2V016X\" data-type=\"storyId\" data-story-id=\"nL1N2V016X\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Japanese auto supplier Sumitomo Electric Industries <a href=\"reuters://REALTIME/Verb=FullQuote/ric=5802.T\" data-type=\"ric\" data-ric=\"5802.T\" translate=\"no\" dir=\"ltr\">5802.T</a>, which employs some 6,000 people in Ukraine to make wire harnesses, said it suspended operations at its factories there and was talking to clients about potentially substituting supplies from other places. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2UZ1Y5\" data-type=\"storyId\" data-story-id=\"nL1N2UZ1Y5\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Ford Motor Co <a href=\"reuters://REALTIME/Verb=FullQuote/ric=F.N\" data-type=\"ric\" data-ric=\"F.N\" translate=\"no\" dir=\"ltr\">F.N</a> has a 50% joint venture in Ford Sollers, which has three assembly plants in Russia according to the Ford website. Ford said in a statement it was \"deeply concerned\" about the situation and would \"manage any effects\" on its business in real time. </p><p>The U.S. automaker also said it would follow any laws on trade sanctions, but declined to discuss whether the Sollers plants have been affected. </p><p>While French car parts maker Valeo <a href=\"reuters://REALTIME/Verb=FullQuote/ric=VLOF.PA\" data-type=\"ric\" data-ric=\"VLOF.PA\" translate=\"no\" dir=\"ltr\">VLOF.PA</a> said the direct impact on the company is minimal, the invasion could drag down industry production volumes, and hike energy or raw material prices. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nS8N2UE03E\" data-type=\"storyId\" data-story-id=\"nS8N2UE03E\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2V01VN\" data-type=\"storyId\" data-story-id=\"nL8N2V01VN\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> </p><p>For automakers, one of the supply-chain concerns created by the Ukraine conflict centers on the metals palladium, platinum and rhodium used in exhaust-scrubbing catalytic converters.</p><p>Russia produces about 38% of the world’s palladium, excluding recycled material, said Mark Wakefield, co-leader of consulting firm AlixPartners global automotive practice.</p><p>“It’s hard to think of a global auto business that doesn’t have palladium coming from Russia,” he said.</p><p>Automakers should not face an immediate shortage of palladium, Wakefield said, because there are stocks of the metal in London. There is “a six-month journey before palladium finds its way into a car,” he said.</p><p>Aluminum prices had been rising before the Ukraine conflict, Wakefield said. A cutoff of Russian aluminum supplies would add to the cost pressures on automakers.</p><p>Japan's biggest steelmaker, Nippon Steel Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=5401.T\" data-type=\"ric\" data-ric=\"5401.T\" translate=\"no\" dir=\"ltr\">5401.T</a>, said  on Friday it would secure alternatives for a raw material it buys from Russia and Ukraine in the event of any supply disruptions. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2UZ3D1\" data-type=\"storyId\" data-story-id=\"nL4N2UZ3D1\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Nippon Steel buys 14% of its iron ore pellets, small balls of iron ore powder used in steel production, from those countries. Officials said it switched sourcing to Brazil and Australia and the impact should be minimal. </p><p>Agricultural equipment maker Deere &amp; Co <a href=\"reuters://REALTIME/Verb=FullQuote/ric=DE.N\" data-type=\"ric\" data-ric=\"DE.N\" translate=\"no\" dir=\"ltr\">DE.N</a> said on Friday it had closed its Ukraine office in recent weeks as a precautionary measure. It employs about 40 people in Ukraine. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nFWN2V00WN\" data-type=\"storyId\" data-story-id=\"nFWN2V00WN\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Meanwhile, Russia said it was partially limiting access to Meta Platforms Inc's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a> Facebook, accusing it of \"censoring\" Russian media. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2V022O\" data-type=\"storyId\" data-story-id=\"nL1N2V022O\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Delta Air Lines Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=DAL.N\" data-type=\"ric\" data-ric=\"DAL.N\" translate=\"no\" dir=\"ltr\">DAL.N</a>, which does not operate services to Ukraine or Russia, said on Friday it had suspended its codesharing service with Russian airline Aeroflot. <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AFLT.MM\" data-type=\"ric\" data-ric=\"AFLT.MM\" translate=\"no\" dir=\"ltr\">AFLT.MM</a> <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2V049A\" data-type=\"storyId\" data-story-id=\"nL4N2V049A\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Amazon.com Inc’s <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> home security subsidiary, Ring,  said it was coordinating closely with its partners at Squad in Ukraine “to support the safety and well-being of the team and their families.” According to LinkedIn data, Squad employs more than 700 people, some of whom worked for the research arm Ring Ukraine until about a year ago. </p><p>Amazon had no additional comment about its footprint in Ukraine or Russia, or on how U.S. trade actions would impact its business, if at all.</p><p>Toronto-based Kinross Gold Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=K.TO\" data-type=\"ric\" data-ric=\"K.TO\" translate=\"no\" dir=\"ltr\">K.TO</a> said its underground Kupol gold mine in Russia's far northeast corner is operating normally. Nearly all of the company’s employees in the country are Russian, and Kupol has stored a full year's worth of supplies on site, given that it operates in a cold region, the company said. </p><p>Kinross added it was reviewing the latest sanctions against Russia to see how they could affect operations.</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Ben Klayman in Detroit, Additional reporting by Gilles Guillaume in Paris, Tom Sims in Frankfurt, Joseph White in Detroit, Ernest Scheyder in Houston and Jeffrey Dastin in San Francisco<br/>Editing by Matthew Lewis)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:benjamin.klayman@thomsonreuters.com\" data-type=\"email\" translate=\"no\">benjamin.klayman@thomsonreuters.com</a> ; 313-600-2277; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://benjamin.klayman.thomsonreuters.com@reuters.net\">benjamin.klayman.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: UKRAINE-CRISIS/RUSSIA-COMPANIES (WRAPUP 3, PIX)</p></div>"}