{"date": "2022-01-20 15:11:09.325000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>HEALTHCARE TRIANGLE INC (\"HCTI-Q\")\n- Shareholder Update\n\n     Healthcare Triangle Inc., (\"HCTI\" or the \"Company\") a leading provider\nof cloud and data transformation platform and solutions for healthcare and\nlife sciences, released a shareholder update:\n\n     Dear Shareholders:\n\n     Thank you for your continued commitment and investment in Healthcare\nTriangle, Inc . Our progress over the past year would not have been\npossible without your trust and belief in our mission. This is our first\nshareholder update since our Oct 2021 IPO and it has been a momentous\njourney and unique in every sense. We work alongside our customers and\npartners to help them build their own digital capability, creating new\nbusinesses, and earn their trust. I am very proud of how we are are using\nour platforms to help organizations innovate and deliver technology\ninitiatives on the Cloud.\n\n     Your Company\nHealthcare Triangle (\"HCTI\") is a healthcare IT provider that delivers\npersonalized healthcare, accelerates drug research, and supports digital\ntransformation through proprietary technology platforms. HCTI is a\nwell-recognized provider of cloud infrastructure migration, AI, data\nanalytics, security &amp; compliance and cloud managed services to Healthcare\nand Life Sciences customers. Our multi-cloud technology transformation\nplatform CloudEz, data analytics platform DataEz, AI based platform\nReadabl.AI, and our Cloud EHR Managed Services have been at the forefront\nof our customer service offering and are leading to deeper partnerships,\nlarger and multiyear cloud engagements. HCTI was recognized as one of the\ntop 100 premier partners of Amazon Web Services, which is a Global\ncommunity comprising of over 100,000 partners. The company also achieved\nPremier Partner status with Google Cloud in 2021.\n\n     Fiscal Year 2021 was a pivotal year for HCTI. We are focused on\nbecoming one of the top 10 US healthcare IT providers by revenue by 2025.\nThis impacts how we run the company, what investments we commit towards\nthis vision and how we take our platform and services to the market. We\nrecently hired a CRO with strong experience in the Healthcare and Life\nSciences market to help us achieve this goal by building a world class\nsales team.\n\n     Strategic acquisition - DevCool Inc\n\n     We firmly believe that an expedited way to drive revenue and expand\nour offerings is by acquiring profitable strategic assets. We recently\nannounced the acquisition of DevCool Inc, an EPIC EHR Implementation and\nManaged Services company servicing 6 of the top 10 hospitals in the USA.\nDevCool also specializes in providing healthcare IT services to cancer\nresearch hospitals and university medical centres. DevCool generated\napproximately $20 million in revenues in fiscal year 2020 and has generated\nconsistent top line growth over the past 4-6 quarters and is expected to be\nEBITDA accretive to HCTI. The combined entity will focus on accelerating\nhealthcare providers' adoption of cloud technologies to improve clinical,\noperational, and financial performance. The acquisition also opens\nopportunities to upsell our SaaS Platforms like CloudEz, DataEz, and\nReadabl.AI to DevCool's existing client base.\n\n     Cloud Solutions to drive IT growth\n\n     For all the disruption that the pandemic has imposed on our lives and\nour communities, it has also been the catalyst for an unprecedented digital\ntransformation and in the process has created new opportunities for our\ncustomers and for HCTI. As an increasing number of enterprises scale\ndigital transformations, cloud solutions will continue to drive growth for\ninformation technology services. According to Gartner research in 2022,\nglobal cloud revenue is estimated to total $474 billion, up from $408\nbillion in 2021. It is estimated that in the next few years, cloud services\nrevenues will surpass on-prem IT services revenues.\n\n     Real-world data analytics\n\n     Enterprises are seeking tie-ups with healthcare associations to access\npatient data from their registries. For example, companies need patient\ndata from unstructured clinical notes taken from electronic health records\n(EHRs) to advance their medical research. Our DataEz platform with digital\nand advanced analytics capabilities can assist large pharma organizations\nunderstand how patient characteristics and behaviors affect health\noutcomes, predict the progression of a disease, patient's responses to\ntherapy, or the risk of adverse events. Drug makers are increasingly\nleaning on real-world data to create innovative treatment. HCTI's DataEz\ncan also help companies take an already approved drug, apply it to new use\ncases while increasing the efficiency of R&amp;D investments and accelerating\ntime to market.\n\n     Covid-19 update\n\n     COVID-19 crisis taught us the importance of technology and enabling\nCloud computing to our customers. Customers around the world have leveraged\nthe cloud to scale up services and stand-up responses during the pandemic.\nWe want you to know we take this opportunity seriously, and we're proud of\nthe work our teams are doing to help customers through this difficult time.\nUnder very trying circumstances, we fulfilled many important objectives\nover the past year. With so many families and companies struggling with the\neffects of the pandemic, I want to acknowledge the resilience of our staff\nand their dedication to our mission to serve our customers. We were strong\nheading into the pandemic and, with the opportunities it created, we expect\nto emerge from it even stronger.\n\n     Moving forward\nWith the decisions we've made this year, the strategy we've implemented,\nthe organization design we have created and the platform and services\nofferings, we are well-positioned to deliver consistent and profitable\ngrowth long into the future. I am confident our best days are still ahead.\n\n     Suresh Venkatachari\nChairman &amp; CEO\n\n     Forward-Looking Statements\n\n     This document may include \"forward-looking statements.\" To the extent\nthat the information presented in this document discusses financial\nprojections, information, or expectations about our business plans, results\nof operations, products or markets, or otherwise makes statements about\nfuture events, such statements are forward-looking. Such forward-looking\nstatements can be identified by the use of words such as \"should,\" \"may,\"\n\"intends,\" \"anticipates,\" \"believes,\" \"estimates,\" \"projects,\" \"forecasts,\"\n\"expects,\" \"plans,\" \"goals\" and \"proposes.\" Although we believe that the\nexpectations reflected in these forward-looking statements are based on\nreasonable assumptions, there are a number of risks and uncertainties that\ncould cause actual results to differ materially from such forward-looking\nstatements. You are urged to carefully review and consider any cautionary\nstatements and other disclosures, including the statements made under the\nheading \"Risk Factors\" and elsewhere in documents that we file from time to\ntime with the SEC. Forward-looking statements speak only as of the date of\nthe document in which they are contained, and HCTI does not undertake any\nduty to update any forward-looking statements except as may be required by\nlaw.\n\n     Investor Relations Contact\n\n     TraDigital IR\nJohn McNamara\nEmail: john@tradigitalir.com\nPhone: (917) 658-2602\n\nTel   : 925-270-4812    HEALTHCARE TRIANGLE INC\nWWW   : <a href=\"https://www.healthcaretriangle.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.healthcaretriangle.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201900463.MNPRE2201901811-06572820220120</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}