{"date": "2021-11-18 18:41:55.484000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3549.0, "close": 3676.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ELSE NUTRITION HOLDINGS INC (\"BABY-V\")\n- to Expand Sales into Europe with Amazon\n\n     ELSE NUTRITION HOLDINGS INC. (\"Else\" or the \"Company\") the plant-based\nbaby, toddler and children nutrition company, is pleased to report on its\nAmazon progress and plans:\n\n     Following its stellar success on Amazon in the US, Else was recently\ninvited by Amazon EU to launch a European unified account that will allow\nElse to sell its unique products on all of Amazon European marketplaces\nincluding the UK, Germany, France, Italy, Spain, the Netherland, and Sweden\nrepresenting a market with over 300M people.\n     Else already started the onboarding process with Amazon's support and\nplans to launch its first European market in early 2022.\n\n     \"We're very excited by this opportunity offered by Amazon EU,\" said\nHamutal Yitzhak, CEO &amp; co-founder of Else Nutrition. \"Amazon has been a\nfantastic go-to-market channel for us in the US, and we expect it to\nperform well also in Europe and in other countries, such as Canada.\" She\nadded.\n\n     About Else Nutrition Holdings Inc.\n\n     Else Nutrition GH Ltd. is an Israel-based food and nutrition company\nfocused on developing innovative, clean and plant-based food and nutrition\nproducts for infants, toddlers, children, and adults. Its revolutionary,\nplant-based, non-soy, formula is a clean-ingredient alternative to\ndairy-based formula. Else Nutrition (formerly INDI) won the \"2017 Best\nHealth and Diet Solutions\" award at the Global Food Innovation Summit in\nMilan. The holding company, Else Nutrition Holdings Inc., is a publicly\ntraded company, listed as TSX Venture Exchange under the trading symbol\nBABY and is quoted on the US OTC Markets QX board under the trading symbol\nBABYF and on the Frankfurt Exchange under the symbol 0YL. Else's Executives\ninclude leaders hailing from leading infant nutrition companies. Many of\nElse advisory board  members had past executive roles in companies such as\nMead Johnson, Abbott Nutrition, Plum Organics and leading infant nutrition\nSocieties,  and some of them currently serve in different roles in leading\nmedical centers and academic institutes such as Boston Children's Hospital,\nPediatrics at Harvard Medical School, USA, Tel Aviv University, Schneider\nChildren's Medical Center of Israel, Rambam Medical Center and Technion,\nIsrael and University Hospital Brussels, Belgium.\n\n     For more information, visit: elsenutrition.com or @elsenutrition on\nFacebook and Instagram.\n\nContact:\nMs. Hamutal Yitzhak, CEO, Co-Founder &amp; Director\nELSE Nutrition Holdings Inc.\nE: hamutaly@elsenutrition.com\nP: +972(0)3-6445095\n\n     Mr. Sokhie Puar, Director of Else Nutrition\nEmail: sokhiep@elsenutrition.com\nP: 604-603-7787\n\n     US Investor Relations Contact:\n\n     Lytham Partners, LLC\nMr. Ben Shamsian\nNew York | Phoenix\nE: shamsian@lythampartners.com\nP: 646-829-9701\n     TSX Venture Exchange\n\n     Neither the TSX Venture Exchange nor its regulation services provider\n(as that term is defined in the policies of the TSX Venture Exchange)\naccepts responsibility for the adequacy or accuracy of this release.\n\n     Caution Regarding Forward-Looking Statements\n\n     This press release contains statements that may constitute\n\"forward-looking statements\" within the meaning of applicable securities\nlegislation. Forward-looking statements are typically identified by words\nsuch as \"will\" or similar expressions. Forward-looking statements in this\npress release include statements with respect to the anticipated dates for\nfiling the Company's financial disclosure documents.   Such forward-looking\nstatements reflect current estimates, beliefs and assumptions, which are\nbased on management's perception of current conditions and expected future\ndevelopments, as well as other factors management believes are appropriate\nin the circumstances. No assurance can be given that the foregoing will\nprove to be correct. Forward-looking statements made in this press release\nassume, among others, the expectation that there will be no interruptions\nor supply chain failures as a result of COVID 19 and that the\nmanufacturing, broker and supply logistic agreement with the Company do not\nterminate. Actual results may differ from the estimates, beliefs and\nassumptions expressed or implied in the forward-looking statements.\nReaders are cautioned not to place undue reliance on any forward-looking\nstatements, which reflect management's expectations only as of the date of\nthis press release. The Company disclaims any obligation to update or\nrevise any forward-looking statements, whether as a result of new\ninformation, future events or otherwise, except as required by law.\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132100405.MNPRE2132102248-07354220211118</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}