{"date": "2021-09-01 06:45:13.530000+00:00", "ticker": "AAF", "mrkt_info": {"open": 92.95, "close": 93.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Singapore, September 1 (ANI): Bharti Airtel Ltd's planned USD2.8 billion equity issuance will improve its funds from operations (FFO) net leverage to around 2x and provide funds to strengthen its market position, according to Fitch Ratings.</p><p>Singapore, September 1 (ANI): Bharti Airtel Ltd's planned USD2.8 billion equity issuance will improve its funds from operations (FFO) net leverage to around 2x and provide funds to strengthen its market position, according to Fitch Ratings.</p></div><div class=\"tr-npp-body\"><p>Bharti will raise equity in three tranches, a quarter of the proceeds to be received upfront and the balance in two installments within three years. Fitch said the company's management remains committed to an investment-grade rating.</p><p>The company raised about USD9 billion in financial year ended March 2020 (FY20) and FY21 via equity issuance, selling a stake in subsidiary Airtel Africa Plc and the sale-and-leaseback of towers in Africa.</p><p>The management aspires to achieve a debt/EBITDA ratio of around 2x in the long term.</p><p>Fitch forecast Bharti's capex to increase to about USD5 billion in FY22 of which USD1.5 billion is likely to be paid upfront to acquire 5G spectrum assets.</p><p>\"We believe that the company will also seek to strengthen its fibre infrastructure -- connecting towers with fibre and backhaul infrastructure to prepare its network to launch 5G services in 2022-23. Capex on 5G infrastructure during 2022-23 will replace 4G investments as 4G coverage is largely complete.\"</p><p>Fitch said it expects Bharti's main shareholders -- Bharti Telecom and Singapore Telecommunications Ltd -- will collectively subscribe to their full entitlement in Bharti's rights issue.</p><p>Singtel has yet to announce its exact subscription. \"However, we estimate Singtel's equity participation over a three-year period to be about USD400 million, based on its 14 per cent direct stake in Bharti.\"</p><p>Fitch said these investments underscore strategic importance of the Indian telecoms business to Singtel. (ANI)</p><p>Copyright © 2021 aninews.in All rights reserved. Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SyndiGate. All Rights Reserved.</p></div>"}