{"date": "2021-11-30 15:00:00.206000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p align=\"left\">LAS VEGAS, Nov.  30, 2021  (GLOBE NEWSWIRE) -- Rubrik, The Zero Trust Data Security™ Company, an Amazon Web Services, Inc. (AWS) Partner Network (APN) and AWS Storage Independent Software Vendor (ISV) Competency Partner, today announced extended protection against ransomware with support for Amazon Simple Storage Service (Amazon S3) Object Lock. Amazon S3 Object Lock provides a write-once-read-many (WORM) model for data in S3 to help further secure customers against ransomware and to prevent objects from being deleted or overwritten for the duration of a customer-defined retention period. Rubrik customers can now utilize Rubrik Zero Trust Data Security with Amazon S3 as an immutable archive, ensuring long term backups are kept on a reliable storage service to quickly recover from ransomware attacks.<br/></p><p>While ransomware attacks are on the rise, Rubrik continues to experience significant interest for its Zero Trust Data Security solutions following its recently announced $5 million Ransomware Recovery Warranty. This offering is a warranty that reassures customers they will be able to recover from cyber attacks and operational failures by using Rubrik’s Enterprise Edition offering.</p><p>“The combination of immutable backups from Rubrik and immutable object storage from Amazon S3 gives customers a strong foundation for protecting against a range of threats to the integrity of their backup data,” said Paul Meighan, Senior Manager, Product Management for Amazon S3 at AWS. “S3’s industry leading durability, availability, performance, and security make it ideal for keeping backups safe and secure. Rubrik’s integration with S3 Object Lock adds additional protection against both accidental and malicious deletes, which we think will make a big difference for customers.”</p><p>\"We live in an era where no business has the luxury of thinking of ransomware protection as an afterthought,” said Brian Chutro, IT Manager at Pampered Chef. “Given the sophistication and pervasiveness of cyberattacks today, IT leaders need to be proactive and strategic in their data security and cloud decisions to help keep their businesses safe. That's why Rubrik's new support for Amazon S3 Object Lock is so critical and helps further protect companies against ransomware. Working with companies like AWS and Rubrik help provide the peace of mind IT teams are seeking.\"</p><p>The global pandemic and increasing hybrid work models have driven even more demand for Rubrik and AWS, specifically across manufacturing, media, and state, local, and education (SLED) / public sector verticals. Rubrik’s data security platform continues to be a solution that delivers protection for customers’ hybrid cloud data estates. More than 3,800 customers have adopted Rubrik.</p><p>“We put a stake in the ground with our new warranty offering, reassuring customers of our confidence in our ability to recover their data in the event of a ransom attack,” said Vasu Murthy, VP of Product at Rubrik. “Our mission is to ensure our customers’ data is always available with our Zero Trust Data Security platform. With new support for Amazon S3 Object Lock, we are extending our immutable backups to provide customers with ransomware recovery assurance, regardless of cloud environment.”</p><p>At AWS re:Invent, Bill Gurling, Principal Architect, Rubrik and Jaap Brasser, Senior Developer Advocate, Rubrik will be hosting a session “Extending Rubrik’s Zero Trust Data Security to protect your AWS environment” on November 30th, 4:15 p.m. PT.</p><p>To connect with Rubrik at AWS re:Invent, visit booth #1633, visit us in AWS Marketplace or contact us via <a href=\"https://www.globenewswire.com/Tracker?data=g0Z6UAJ8O5ApcwOBnEkfprfeqRdkEJUhmaZOSpPb5YudMBK3OvSMi-e0Yf2mYZW17LKSc3Q5YgK-0OY30_Qpqg==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">sales@rubrik.com</a>.</p><p>Learn more about the Rubrik Ransomware Recovery Warranty.</p><p><strong>About Rubrik </strong><br/>Rubrik, the Zero Trust Data SecurityTM Company, delivers data security and operational resilience for enterprises. Rubrik’s big idea is to provide data security and data protection on a single platform, including: Zero Trust Data Protection, ransomware investigation, incident containment, sensitive data discovery, and orchestrated application recovery. This means data is ready at all times so you can recover the data you need, and avoid paying a ransom. Because when you secure your data, you secure your applications, and you secure your business.</p><p>For more information please visit <a href=\"https://www.globenewswire.com/Tracker?data=Ic4O7cJF3nrO6SMENjJMsmdONrXGRR154FaP-qXXzbeVoIcQq9mf539zaFAMdyMqME3q5trVboXS-U39zSP9hg==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rubrik.com</a> and follow @rubrikInc on Twitter and Rubrik, Inc. on LinkedIn.</p><p>Contact<br/>Kelsey Shively<br/>Sr. Director of Communications, Rubrik<br/><a href=\"https://www.globenewswire.com/Tracker?data=MTNsEgFBLOay0FJ4AEKof97Uz-YYQAy8MurPc3h5Y8SEnZWxGLnG74HCqHXxiZfzSoEabm9o-yxg68ps1qF9kuKuRx47euKlUkvKYif92ac=\"><u>kelsey.shively@rubrik.com</u></a></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODQwMjU0MSM0NTg3NjkwIzUwMDAzMzc2Mw==\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RRd01qVTBNU00wTlRnM05qa3dJelV3TURBek16YzJNdz09&amp;key=3076c4cda5a8483f83d263077c18fd3ee5d2a9319977bc425d625fbba88ca0d989092df65f9d83bd194b24852eeb45f6413c3788e40ae6f7aaa1b15b4ca80d9e\"/></div></div><br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/OTJiZTk2ZTYtM2YzZC00NDIwLWI4NmItZWUzMTZmYmJjYzA2LTUwMDAzMzc2Mw==/tiny/Rubrik.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9PVEppWlRrMlpUWXRNMll6WkMwME5ESXdMV0k0Tm1JdFpXVXpNVFptWW1Kall6QTJMVFV3TURBek16YzJNdz09L3RpbnkvUnVicmlrLnBuZw==&amp;key=e9fa1cd88dfbced3e2b44611cdb717e8cf9c18e4faf3f34e55c3624233e3a268574666706bfa0f0e3831cba4f51e8d904369432a2eea54963cafd6c6632cc6a0\"/></div></div><p><a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/dc018474-3230-4de3-bf07-693f57a7e145\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Primary Logo\" border=\"0\" src=\"https://ml.globenewswire.com/media/dc018474-3230-4de3-bf07-693f57a7e145/small/logo-rubrik-logo-highwire-for-light-digital-1720x690-2017111.png\" style=\"max-height:60px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9kYzAxODQ3NC0zMjMwLTRkZTMtYmYwNy02OTNmNTdhN2UxNDUvc21hbGwvbG9nby1ydWJyaWstbG9nby1oaWdod2lyZS1mb3ItbGlnaHQtZGlnaXRhbC0xNzIweDY5MC0yMDE3MTExLnBuZw==&amp;key=3d5359941615197e47a1185d7e78df86fd0a66c349ad9b49f61d01ea3d5d28414e5081c281a3ca250120bdafeea509a1952dc1e98a283debdd87b2feea1f792e\"/></div></div></a></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">GlobeNewswire, Inc. 2021</p></div>"}