{"date": "2022-01-18 08:47:34.795000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}.storyContent .prntac{TEXT-ALIGN:CENTER;}</style><div class=\"xn-newslines\">\n\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">BENGALURU, India, Jan. 18, 2022</p></div>\n\n<div class=\"xn-content\">\n\n<p class=\"prntac\"><span>Get ready for the #GOVOlife; Products featured in Amazon Specials</span></p>\n  <p>BENGALURU, <span class=\"xn-location\">India</span>, <span class=\"xn-chron\">Jan. 18, 2022</span> /PRNewswire/ -- Bangalore-based start-up, <a href=\"https://www.govo.life/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">GOVO</a> makes an entry into the Indian consumer durables market with the launch of their personal audio wearables series. GOVO's GOBUDS, GOBASS and GOKIXX series are designed to offer an exquisite audio experience for the customers. The brand has been developed in <span class=\"xn-location\">London</span> and the products engineered through Listen technology <span class=\"xn-location\">USA</span> devices and endorsed by TUV worldwide specialists.</p>\n\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/1728454/GOVO_Image.html\">\n                    <div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"GOVO's GOBUDS, GOBASS and GOKIXX series launched in India\" src=\"https://mma.prnewswire.com/media/1728454/GOVO_Image.jpg\" title=\"GOVO's GOBUDS, GOBASS and GOKIXX series launched in India\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMTcyODQ1NC9HT1ZPX0ltYWdlLmpwZw==&amp;key=8890baa6d219902f9836a7d055324176b1c7426db1ef7842c86de54c5a3f9d255fa9aff1df2fb021bcd1616fe2886b58089ddba50fc8d71a87d7b53a7232e707\"/></div></div>\n                        </a>\n                </p>\n\n    </div>\n<p>The variants of the series, GOBUDS 920 &amp; 600, GOBASS 610 &amp; 910, GOKIXX 900, 630, 620, 421 &amp; 410 are available for purchase on the brand <a href=\"https://www.govo.life/collections\" data-type=\"url\" class=\"tr-link\" translate=\"no\">website</a>, as well as on <a href=\"https://www.amazon.in/b?node=27365674031\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> from <span class=\"xn-chron\">January 5, 2022</span>. The company is offering a 50% discount as an introductory offer with a one year warranty for all the products.</p>\n<p>Commenting on the launch, <b>Unnikrishnan R, Vice President - Marketing, GOVO</b> said, <span>\"We are thrilled to announce the launch of our audio portfolio in <span class=\"xn-location\">India</span>. As a new entrant in the consumer durables market, we aim to fit in with the customers' ever-changing lifestyle and meet the product-based demands that arise with it. With the launch of our new variants, we hope to convey our brand beliefs to our consumers - of being energetic and confident. Given the competition in the wearables market, we hope to be viewed as a real and authentic brand, offering the best design and audio experience to our consumers.  With the growing need in the market for premium but affordable earphones, we hope that our new variants will make a difference.\"</span></p>\n<p><b><span class=\"xn-person\">Nishant Sardana</span>, Director-Mobile Phones &amp; Televisions, Amazon India </b>said, \"<span>We are happy to have partnered with GOVO for their launch in <span class=\"xn-location\">India</span>. As a consumer durable brand entering the market, it becomes imperative to have the best consumer reach across the country. We hope for many more such partnerships with them.\"</span></p>\n<p>Here are the feature and cost details of the champion products of GOVO:</p>\n<p><a href=\"https://www.govo.life/products/gobuds-920-earbuds\"><b>GOBUDS 920</b></a></p>\n<p></p><p></p><p>The GOBUDS 920 is a state-of-the-art Bluetooth headset that has been designed with the user's convenience in mind. It features a 30-hour battery life and a 6mm driver unit, along with voice assistance which ensures that the customers have superior sound quality on calls. The GOBUDS 920 is ergonomically designed that guarantees the perfect fit for any ear and will not fall off. They come with IPX5 water resistance, so they are sweatproof and can be used in the rain. The GOBUDS 920 priced at <span class=\"xn-money\">Rs 2,699</span> is the perfect wireless headphone for music lovers. It comes with a sleek carrying case and is available in platinum black color. The GOBUDS 920 has powerful bass and allows the customers to switch between multiple devices thanks to its dual pairing mode. One can also enjoy their music without any cords thanks to its wireless bluetooth connection.</p>\n<p><a href=\"https://www.govo.life/products/gobuds-600-earbuds\"><b>GOBUDS 600</b></a></p>\n<p></p><p></p><p></p><p>The sleek, durable, and lightweight design of GOBUDS 600 allows customers to stay connected to their favorite tunes, podcasts, audiobooks, and more for 33 hours without recharging. With a sleek design, IPX5 technology and Google and Siri voice enabled, this product is guaranteed to change the way one listens to music or takes a phone call.</p>\n<p><a href=\"https://www.govo.life/products/gokixx-620-bluetooth-earphones-neckband\"><b>GOKIXX 620</b></a></p>\n<p></p><p></p><p></p><p>GOKIXX 620 is IPX5 powered sweat-proof and water resistant, Bluetooth enabled wireless neckband earphone with a 20-hour battery life. One can do anything they want without worrying about the earphones dying on them. And don't forget - it's voice assistant enabled too! The GOKIXX 620 will not just sound good - it will feel good too. It has the best of both worlds: smart design, high performance, and high-quality sound.</p>\n<p><a href=\"https://www.govo.life/products/gobass-910-earphones\"><b>GOBASS 910</b></a></p>\n<p></p><p></p><p></p><p>The GOBASS 910 is priced at just Rs. 549 and is enabled with features such as hands-free pickup and high-definition mic. With a 9mm driver unit, the GOBASS 910 comes in a metallic bullet finish and offers a premium audio experience with 3D sound. The earphones also promise passive noise cancellation and elevated audio experience with deep bass. The perfect audio companion for the customers' on-the-go lifestyle, GOBASS 910 is a braided tangle-free headset that's built with magnetic earbuds. The 910s are ideal for workouts, travel, and anytime one is out and about. The enhanced call clarity will help customers stay connected to their loved ones while they take advantage of its lightweight design. </p>\n<p><b>About GOVO:</b></p>\n<p>GOVO was founded in <span class=\"xn-location\">Bangalore</span> in 2021. The designs have been developed in <span class=\"xn-location\">London</span>, keeping to the brands global aspirations. The GOVO brand is designed for you, with a product range that grows with you and fits into your ever-changing lifestyle, keeping the brand relevant as you move through your every day. Always moving, always adapting, just like its customers.</p>\n<p>Photo: <a href=\"https://mma.prnewswire.com/media/1728454/GOVO_Image.jpg\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://mma.prnewswire.com/media/1728454/GOVO_Image.jpg</a>  </p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n</div>\n</div>\n<div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 PR Newswire Association,LLC. All Rights Reserved.</p></div>"}