{"date": "2022-02-03 14:13:06+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3023.87, "close": 2776.91}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NEXTECH AR SOLUTIONS CORP (\"NTAR-Z;NEXCF-0\")\n- Kmart Australia Sign Annual 3D Model and AR Contract\n\n  Nextech AR Solutions Corp. (\"Nextech\" or the \"Company\"), a Metaverse\nCompany and leading provider of augmented reality (\"AR\") experience\ntechnologies and services is pleased to announce a multi-year expansion of\nits 3D/AR ecommerce contract with Kmart Australia which is part of the\nWesfarmers group (ASX.WES) one of Australia's largest listed companies\nwhose businesses include; Bunnings, Kmart Group, Officeworks and others.\nAfter a successful POC, Kmart Australia has signed an annual contract for\nnot only 500 homeware SKUs but also Nextech's ARitize Decorator platform\n(formerly known as 3D Rooms). As part of this annual contract, Nextech will\nbe indexing these 500 homeware assets with Google's 3D AR search. The\ncompany is experiencing a wave of new, global interest and demand for 3D\nmodels and AR visualizations for ecommerce.\n\n  Watch a video of ARitize Decorator - click here\n\n  As previously announced Nextech has been selected by Google as an Early\nAccess Partner with Google's 3D AR Search Program. With Nextech having been\nselected by Google as a partner, Google allows Nextech to grant Kmart\nAustralia exclusive early access to the 3D search program which will cause\nKmart Australia's 3D models to appear higher in organic Google search\nresults - possibly even on the first page, maximizing reach and awareness\nfor the retailer.\n\n  Watch a preview of 3D/Augmented Reality Furniture for Kmart Australia:\nclick here\n\n  The contract, which also includes Nextech's ARitize Decorator platform,\nis a solution that Kmart Australia sees as an exceptional component to help\ntheir customers' journey and decision making process, and an innovative\nopportunity to showcase groundbreaking technology on their website while\nincreasing sales and decreasing returns. ARitize Decorator enables\ncustomers to virtually preview home furnishing and decor in a desired\nlocation, using just a simple 2D photo of a room. The solution uses\nNextech's AI to analyze a room layout automatically and then parses out\nroom surfaces, reconstructs the scene, and allows multiple 3D AR objects to\nbe seamlessly placed inside a 2D photo, as if they were part of the room.\nWatch a video preview of the technology - click here.\n\n  Evan Gappelberg, Nextech AR CEO commented, \"This 1 year 500 homewares SKU\ncontract with Kmart Australia serves as a clear validation of the benefits\nof our 3D modeling and AR for ecommerce solutions and we are excited to\ncontinue working and growing with Kmart Australia, who are proving to be\ninnovators in their space. He continues \"We are continuing to create\ntremendous value through the ecommerce ecosystem with not just 3D models\nand AR visualizations but also with our relationships with big tech\ncompanies like Google and others \".\n\n  About Kmart AustraliaKmart opened Australia's first discount department\nstore in Burwood, Victoria in 1969. It was the beginning of a proud Aussie\nicon that has revolutionised the way Australians and New Zealanders shop.\nToday, Kmart has more than 200 stores across Australia and New Zealand and\nis recognised as one of the most profitable discount department stores in\nAustralia. Kmart Australia employs approximately 30,000 team members who\nmainly work in our retail stores. Our national office is based in Mulgrave,\nVictoria and is home to around 800 team members.\n\n  To learn more, please follow us on Twitter, YouTube, Instagram, LinkedIn,\nand Facebook, or visit our website: <a href=\"https://www.Nextechar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.Nextechar.com</a>.\n\n  About Nextech ARNextech AR Solutions is a Metaverse company that develops\nand operates augmented reality (\"AR\") platforms, transporting\nthree-dimensional (\"3D\") product visualizations, human holograms and 360\nportals to its audiences altering e-commerce, digital advertising, hybrid\nvirtual events (events held in a digital format blended with in-person\nattendance) and learning and training experiences.\n\n  Nextech focuses on developing AR solutions for the Metaverse, however\nmost of the Company's revenues are derived from three e-Commerce platforms:\nvacuumcleanermarket.com (\"VCM\"), infinitepetlife.com (\"IPL\") and\nTrulyfesupplements.com (\"TruLyfe\"). VCM and product sales of residential\nvacuums, supplies and parts, and small home appliances sold on Amazon.\n\n  Forward-looking StatementsThe CSE and the NEO have not reviewed and do\nnot accept responsibility for the adequacy or accuracy of this release.\n\n  Certain information contained herein may constitute \"forward-looking\ninformation\" under Canadian securities legislation. Generally,\nforward-looking information can be identified by the use of forward-looking\nterminology such as, \"will be\" or variations of such words and phrases or\nstatements that certain actions, events or results \"will\" occur.\nForward-looking statements regarding the completion of the transaction are\nsubject to known and unknown risks, uncertainties and other factors. There\ncan be no assurance that such statements will prove to be accurate, as\nfuture events could differ materially from those anticipated in such\nstatements. Accordingly, readers should not place undue reliance on\nforward-looking statements and forward-looking information. Nextech will\nnot update any forward-looking statements or forward-looking information\nthat are incorporated by reference herein, except as required by applicable\nsecurities laws.\n\nNextech AR Solutions Corp.\nContact: Lindsay Betts\ninvestor.relations@nextechar.com\n866-ARITIZE (274-8493) Ext 7201\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203300231.MNPRE2203301315-06122420220203</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}