{"date": "2022-02-22 16:51:15.325000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> is under scrutiny for its stake in an air transport company that is a key contractor providing <a href=\"https://www.independent.co.uk/topic/ice\" data-type=\"url\" class=\"tr-link\" translate=\"no\">ICE</a> deportation flights, which have a long history of alleged abuses onboard.</p><p>In March 2021, Amazon bought a $131m, roughly 20 per cent stake in Air Transport Services Group Inc (ATSG), a long-time partner in its delivery operations, and may be considering expanding its ownership in the future.</p></div><div class=\"tr-npp-body\"><p>Omni Air International, an ATSG subsidiary, regularly contracts with Immigrations and Customs Enforcement (ICE) to carry out deportation flights, where migrants say they have been subject to physical abuse and racist harassment.</p><p><span>The Independent</span> has reached out to Amazon and Omni for comment.</p><p>\"I want Amazon to recognize its complicity, by virtue of its connection to Omni, in the commission of egregious human rights violations,\" Sarah Towle, an author and immigrant advocate, said in <a href=\"https://theintercept.com/2022/02/17/amazon-ice-deportation-flights-omni/\"><span>an interview on Thursday with</span><span><span>The Intercept</span> </span> </a> , which reported on Amazon's link to Omni.</p><p>\"Amazon should sever Omni's relationship with ICE,\" she continued, noting that \"Amazon can cut ICE loose and never miss a cent.\"</p><p>In 2019, researchers at the University of Washington Center for Human rights put out a series of <a href=\"https://jsis.washington.edu/humanrights/projects/human-rights-at-home/ice-air-deportation-flights/\"><span>reports</span> </a> documenting a range of alleged abuses aboard ICE flights, which included the use of full-body, mummy-like shackles and \"racist epithets and insults\" as well as \"rough physical treatment upon boarding.\"</p><p>\"Over the past decade, the institutional infrastructure behind these flights has shifted from a government operation run by the US Marshals Service on government planes, to a sprawling, semi-secret network of flights on privately-owned aircraft,\" researchers wrote.</p><p>On one 2017 deportation flight, believed to be operated by Omni, Somali detainees reported \"physical beatings, the use of straitjackets, verbal abuse and threats, and the denial of access to restrooms, which forced passengers to soil themselves in their seats,\" an account which <a href=\"https://www.vice.com/en/article/9kdda3/somalis-say-they-were-shackled-and-beaten-on-aborted-ice-deportation-flight\"><span>ICE denied</span> </a> at the time.</p><p>On another Omni flight, a Cameroonian migrant said he was put in a full-body restraint with a mesh net over his face as \"a form of punishment.\"</p><p>ICE has received nearly 100 formal allegations of abuse and mistreatment on deportation flights between 2007 and 2018, according to data from the <a href=\"https://www.independent.co.uk/topic/department-homeland-security\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Department of Homeland Security</a> Office of Civil Rights and Civil Liberties.</p><p>The alleged mistreatment on ICE flights contrasts with Amazon's public positions on immigration, where it has said the company maintains a \" <a href=\"https://www.aboutamazon.com/news/policy-news-views/renewing-our-commitment-to-immigrant-rights-and-immigration-reform\"><span>commitment to immigrant rights and immigration reform</span> </a> \" and operates by \"embedding respect for human rights throughout our business.\"</p><p>In October, Harold Koh, a top State Department lawyer, resigned from the Biden administration because of its use of a Trump-era policy known as Title 42 to ramp up deportation flights sending migrants back to dangerous conditions in countries like Haiti, which he called \"illegal\" and \"inhumane.\"</p><p>Nonetheless, Amazon has multiple business relationships with ICE, including via Omni and through its cloud computing services, which have made it a \" <a href=\"https://gizmodo.com/amazon-is-reportedly-funding-a-network-of-ice-deportati-1848555731\"><span>key contractor</span> </a> \" with the Department of Homeland Security, according to researchers.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 Independent, The (UK) (Online). All rights reserved.</p></div>"}