{"date": "2021-12-01 04:48:06.772000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>AMAZON.COM INC (\"AMZN-Q\")\n- AWS Announces AWS Mainframe Modernization\n\n    Today, at AWS re:Invent, Amazon Web Services, Inc. (AWS), an\nAmazon.com, Inc. company announced AWS Mainframe Modernization, a new\nservice that makes it faster and easier for customers to migrate mainframe\nand legacy workloads to the cloud, and enjoy the superior agility,\nelasticity, and cost savings of AWS. With AWS Mainframe Modernization,\ncustomers can refactor their mainframe workloads to run on AWS by\ntransforming legacy applications into modern Java-based cloud services.\nAlternatively, customers can keep their applications as written and\nre-platform their workloads to AWS reusing existing code with minimal\nchanges. A runtime environment built into AWS Mainframe Modernization\nprovides the necessary compute, memory, and storage to run both refactored\nand replatformed applications and automatically handles the details of\ncapacity provisioning, security, load balancing, auto-scaling, and\napplication health monitoring. AWS Mainframe Modernization provides all the\ndevelopment, testing, and deployment tools necessary to automate the\nmigration from mainframe and legacy environments to AWS. Customers and\nsystems integrators (SIs) can use AWS Mainframe Modernization to help\nenterprise migration teams assess and analyze migration readiness and plan\nmigration projects. There are no upfront costs for using AWS Mainframe\nModernization, and customers only pay for the amount of compute\nprovisioned. To learn more about AWS Mainframe Modernization, visit\naws.amazon.com/mainframe-modernization.\n\n    Under the best of circumstances, mainframe systems are complex,\nexpensive, and difficult to scale. In today's world, applications written\nfor mainframe legacy systems also present significant operational\nchallenges to customers compounded by the dwindling pool of engineers who\nspecialize in these outdated technologies. Many organizations want to\nmigrate their legacy applications to the cloud, but to do so they need to\ngo through a lengthy migration process that is made more challenging by the\ncomplexity of mainframe applications. To migrate their mainframe workloads\nto AWS, organizations typically turn to SIs to lead modernization and\nmigration projects. Migrating mainframe workloads to the cloud requires\nmultiple steps to discover, access, migrate, test, and operate the new\nworkload environments. Each step is complex and requires custom or\nthird-party tooling that must be calibrated to each individual customer\nenvironment--before SIs can begin the intricate task of translating\nmainframe subsystems into cloud services. Aside from the migration itself,\nthere is also the challenge of needing to configure, run, and operate these\ncomplex systems with modern application development and deployment best\npractices in the new cloud environments. As more customers want to\nmodernize their infrastructure and migrate off of complex legacy\ntechnologies, they could benefit from better tools that make it easier for\nthem to move to the cloud.\n\n    AWS Mainframe Modernization provides a complete development and runtime\nenvironment that makes it faster and easier for customers to migrate,\nmodernize, and run their workloads on AWS. AWS Mainframe Modernization\nintegrates the tools needed for migrations into a single environment to\ncreate an end-to-end migration pipeline. With AWS Mainframe Modernization,\ncustomers can refactor their workloads written for mainframes in legacy\nprogramming languages (e.g. COBOL) to modern Java-based cloud services. Or,\ncustomers can keep their workloads as written and re-platform them to AWS\nwith minimal code changes. Whether customers choose to refactor or\nreplatform their workloads, AWS Mainframe Modernization provides a runtime\nenvironment for the migrated applications that includes all the benefits of\na fully managed service and automatically handles capacity provisioning,\nsecurity, load balancing, auto-scaling, and application health monitoring.\nAWS Mainframe Modernization also provides continuous integration and\ncontinuous delivery (CI/CD) capabilities to enable modern application\ndevelopment and deployment best practices, so customers can operate their\nmodernized workloads in production on an ongoing basis with the superior\nagility, elasticity, and cost savings of AWS. AWS Mainframe Modernization\nde-risks and accelerates the migration of mainframe and legacy workloads to\nAWS.\n\n    \"More and more customers are modernizing their applications by moving\nthem to the cloud to take advantage of the elasticity and agility of AWS\nand to reinvent customer experiences at a lower cost. But, for most\nenterprises, migrating their mainframe applications to the cloud is\nuncharted territory,\" said William Platt, General Manager of Migration\nServices at AWS. \"With today's launch of AWS Mainframe Modernization,\ncustomers and systems integrators can now more quickly modernize their\nlegacy mainframe workloads in a predictable way and get rid of much of the\ncomplexity and manual work involved in migrations. AWS Mainframe\nModernization provides automation in discovery, analysis, migration, and\ntesting phases, and it gives customers and systems integrators a managed\nruntime environment to deploy their replatformed and refactored mainframe\nworkloads for their customers, which makes modernizing applications faster\nand easier.\"\n\n    AWS Mainframe Modernization is available in preview today in US East\n(N. Virginia), US West (Oregon), Asia Pacific (Sydney), EU (Frankfurt), and\nSouth America (Sao Paulo) with availability in additional AWS Regions in\nthe coming months.\n\n    Established in 1994, Banco Inter is the first fully digital bank in\nBrazil, which as of 2021 has served 15 million customers and expects to\ndouble its customer base within a few years. Its mission is to simplify\nbanking and make it transparent and fair, with a one-stop shop that\nincludes day-to-day banking, investments, credit card, insurance, loans,\nand even ecommerce. \"The AWS Mainframe Modernization replatforming\ntoolchain is effective for migrating mainframe applications to AWS with\nsubstantial cost savings,\" said Guilherme Ximenes, Chief Technology Officer\nat Banco Inter S.A. \"By using the AWS Mainframe Modernization managed\nruntime, we expect to simplify our card processor operations for enhanced\nresiliency and scalability. We are also excited by the DevOps CI/CD\npipeline for increasing the agility we need to more quickly deliver new\ncredit and debit card transaction capabilities to our customers.\"\n\n    Accenture is a global professional services company with leading\ncapabilities in digital, cloud, and security. \"AWS Mainframe Modernization\nhelps to simplify moving and managing mainframe applications,\" said Chris\nWegmann, Global Technology and Practice Lead at Accenture's AWS Business\nGroup. \"The combination of AWS Mainframe Modernization with Accenture's\nextensive experience in mainframe application modernization and managing\nmainframe applications now provides a way for clients to realize the\nagility, elasticity, and cost efficiency of AWS sooner.\"\n\n    DXC Technology, a leading Fortune 500 global technology services\ncompany, provides mission-critical IT services that transform global\nbusinesses. \"DXC is excited to be leading mainframe legacy application\ntransformation and modernization, partnering with AWS on its AWS Mainframe\nModernization platform,\" said Rick Sullivan, Vice President and General\nManager of Applications at DXC Technology. \"DXC brings years of experience\nworking with customers' mainframe applications and modernization. We look\nforward to leveraging the new capabilities that AWS Mainframe Modernization\nwill provide to complement our approach for enabling successful mainframe\ntransformations on AWS.\"\n\n    About Amazon Web Services\n\n    For over 15 years, Amazon Web Services has been the world's most\ncomprehensive and broadly adopted cloud offering. AWS has been continually\nexpanding its services to support virtually any cloud workload, and it now\nhas more than 200 fully featured services for compute, storage, databases,\nnetworking, analytics, machine learning and artificial intelligence (AI),\nInternet of Things (IoT), mobile, security, hybrid, virtual and augmented\nreality (VR and AR), media, and application development, deployment, and\nmanagement from 81 Availability Zones within 25 geographic regions, with\nannounced plans for 27 more Availability Zones and nine more AWS Regions in\nAustralia, Canada, India, Indonesia, Israel, New Zealand, Spain,\nSwitzerland, and the United Arab Emirates. Millions of customers--including\nthe fastest-growing startups, largest enterprises, and leading government\nagencies--trust AWS to power their infrastructure, become more agile, and\nlower costs. To learn more about AWS, visit aws.amazon.com.\n\n    About Amazon\n\n    Amazon is guided by four principles: customer obsession rather than\ncompetitor focus, passion for invention, commitment to operational\nexcellence, and long-term thinking. Amazon strives to be Earth's Most\nCustomer-Centric Company, Earth's Best Employer, and Earth's Safest Place\nto Work. Customer reviews, 1-Click shopping, personalized recommendations,\nPrime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career\nChoice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out\ntechnology, Amazon Studios, and The Climate Pledge are some of the things\npioneered by Amazon. For more information, visit amazon.com/about and\nfollow @AmazonNews.\n\nContact Information:\n\nAmazon.com, Inc.\nMedia Hotline\nAmazon-pr@amazon.com\nwww.amazon.com/pr\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133300570.MNPRE2133302981-10422420211130</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}