{"date": "2021-11-22 22:41:43.965000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>PRIMO WATER CORP (\"PRMW-TN\")\n- Alliance for Water Stewardship Certification for its Mountain\n- Valley and Georgia Mountain Sites\n\n     Primo Water Corporation (the \"Company\" or \"Primo\"), a leading provider\nof sustainable drinking water solutions in North America and Europe,\nannounces that SCS Global Services (SCS), a global leader in third-party\ncertification of sustainability performance, confirmed that its Mountain\nValley site in Arkansas and its Georgia Mountain site, in Fannin County\nGeorgia, have achieved certification based on an independent, in-depth\nassessment. The Alliance for Water Stewardship (AWS) International Water\nStewardship Standard is a comprehensive global benchmark for responsible\nwater stewardship.\n\n     Two additional Primo water sources, Diamond Spring in Pennsylvania and\nWekiva Spring in Florida achieved AWS certification in December 2020.\n\n     Certification of the Mountain Valley and Georgia Mountain sites\ndemonstrates that the facilities have successfully completed each of the\nsteps in the AWS Standard and is confirmation of having met the global\nbenchmark for responsible water stewardship. AWS certification demonstrates\nthat Primo Water has addressed five aspects of responsible water\nstewardship: good water governance, sustainable water balance, good water\nquality, important water-related areas, and safe water, sanitation and\nhygiene. An AWS Standard certificate is issued independently of the site,\nits owners and AWS by a neutral, expert, third-party conformity assessment\nbody who has achieved AWS accreditation. A site's certificate will be valid\nfor three years, subject to successful surveillance audits.\n\n     \"After becoming the first company to have a spring water source\ncertified under the AWS program in December 2020, we have now obtained\ncertification for two additional sites within twelve months as we continue\nto demonstrate our commitment to responsible water usage and conservation,\"\nsaid Tom Harrington, Primo's Chief Executive Officer. \"Our ongoing focus on\nour sustainability initiatives continues to drive our industry leadership\nand we remain on track to achieve our goal of certifying all of our key\nowned spring water sources under by the AWS by the end of 2022.\"\n\n     ABOUT PRIMO WATER NORTH AMERICA\n\n     Primo Water North America, a wholly-owned subsidiary of Primo Water\nCorporation, is a U.S.-based company providing bottled water, break room\nsupplies, and equipment and services for water filtration systems. They\nprovide products to over a million homes, offices, restaurants, food\nservice organizations, convenience stores, and retail locations across the\ncountry. Among its best-known bottled water brands are Primo(r), Mountain\nValley(r), Alhambra(r), Crystal Rock(r), Crystal Springs(r), Deep Rock(r),\nHinckley Springs(r), Kentwood Springs(r), Mount Olympus(r), Sierra\nSprings(r), and Sparkletts(r). Learn more at <a href=\"https://www.water.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.water.com</a>/.\n\n     ABOUT PRIMO WATER CORPORATION\n\n     Primo Water Corporation is a leading pure-play water solutions\nprovider in North America and Europe and generates approximately $2.0\nbillion in annual revenue. Primo operates largely under a recurring\nrazor/razorblade revenue model. The razor in Primo's revenue model is its\nindustry leading line-up of sleek and innovative water dispensers, which\nare sold through retailers and online at various price points. The\ndispensers help increase household penetration which drives recurring\npurchases of Primo's razorblade offering. Primo's razorblade offering is\ncomprised of Water Direct, Water Exchange, and Water Refill. Through its\nWater Direct business, Primo delivers sustainable hydration solutions\nacross its 22-country footprint direct to the customer's door, whether at\nhome or to businesses. Through its Water Exchange and Water Refill\nbusinesses, Primo offers pre-filled and reusable containers at over 13,000\nlocations and water refill units at approximately 22,000 locations,\nrespectively. Primo also offers water filtration units across its\n22-country footprint representing a top five position.\n\n     Primo's water solutions expand consumer access to purified, spring,\nand mineral water to promote a healthier, more sustainable lifestyle while\nsimultaneously reducing plastic waste and pollution. Primo is committed to\nits water stewardship standards and is proud to partner with the\nInternational Bottled Water Association (IBWA) in North America as well as\nwith Watercoolers Europe (WE), which ensure strict adherence to safety,\nquality, sanitation and regulatory standards for the benefit of consumer\nprotection.\n\n     Primo is headquartered in Tampa, Florida (USA). For more information,\nvisit www.primowatercorp.com.\n\n     Safe Harbor Statement\n\n     This press release contains forward-looking statements within the\nmeaning of Section 27A of the Securities Act of 1933, Section 21E of the\nSecurities Exchange Act of 1934 and applicable Canadian securities laws\nconveying management's expectations as to the future based on plans,\nestimates and projections at the time Primo makes the statements.\nForward-looking statements involve inherent risks and uncertainties and\nPrimo cautions you that a number of important factors could cause actual\nresults to differ materially from those contained in any such\nforward-looking statements. The forward-looking statements in this press\nrelease include but are not limited to statements regarding future\ncertifications by the AWS of Primo's owned spring water sources. The\nforward-looking statements are based on assumptions regarding management's\ncurrent plans and estimates. Readers are cautioned not to place undue\nreliance on these forward-looking statements, which speak only as of the\ndate hereof. Readers are urged to carefully review and consider the various\ndisclosures, including but not limited to risk factors contained in Primo's\nAnnual Report in the Form 10-K and its quarterly reports on Form 10-Q, as\nwell as other periodic reports filed with the securities commissions. Primo\ndoes not, except as expressly required by applicable law, undertake to\nupdate or revise any of these statements in light of new information or\nfuture events.\n\n     ABOUT THE ALLIANCE FOR WATER STEWARDSHIP\n\n     The Alliance for Water Stewardship's (AWS) mission is to: Ignite and\nnurture global and local leadership in credible water stewardship that\nrecognizes and secures the social, cultural, environmental and economic\nvalue of freshwater.\n\n     AWS is a global membership collaboration comprising businesses, NGOs\nand the public sector. Its members contribute to the sustainability of\nlocal water-resources through their adoption and promotion of a universal\nframework for the sustainable use of water - the International Water\nStewardship Standard, or AWS Standard - that drives, recognizes and rewards\ngood water stewardship performance.\n\n     The AWS Standard offers a credible, globally-applicable framework for\nmajor water users to understand their own water use and impacts, and to\nwork collaboratively and transparently with others for sustainable water\nmanagement within the wider water catchment context. Implementers follow\nthe steps and guidance in the AWS Standard to achieve good water\nstewardship practices that improve site water performance and contribute to\nwider sustainability goals.\n\n     View original content to download\nmultimedia:https://www.prnewswire.com/news-releases/primo-water-announces-a\nlliance-for-water-stewardship-certification-for-its-mountain-valley-and-geo\nrgia-mountain-sites-301430313.html\n\nContact Information:\n\nJon Kathol, Vice President, Investor Relations, Tel:813-313-1732,\ninvestorrelations@primowater.com\n<a href=\"https://www.primowatercorp.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.primowatercorp.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132500613.MNPRE2132503145-14190720211122</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}