{"date": "2021-11-20 16:07:05.929000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3676.57, "close": 3580.04}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>India</p></div><div class=\"tr-npp-lead\"><p>India, Nov. 20 -- Police in Madhya Pradesh's Bhind on Saturday said that it made Amazon India's executive directors 'accused' under the NDPS Act in a case related to consignment of marijuana being allegedly delivered via e-commerce platform Amazon.</p><p>\"A case under section 38 of the Narcotic Drugs and Psychotropic Substances (NDPS) Act was registered against executive directors of Amazon India which operates as ASSL in the country,\" Bhind's superintendent of police Manoj Kumar Singh was quoted as saying by news agencies. The FIR, however, did not name any individual official by their name, news agency PTI reported.</p></div><div class=\"tr-npp-body\"><p>Earlier on Saturday, the Bhind Police busted an online 'marijuana sale racket' and arrested two people with 20kg of ganja from them. The police said that the accused were operating the racket through the e-commerce firm and also alleged that the firm received two-thirds of the profit generated by the sale of marijuana. It arrested two more individuals later.</p><p>Earlier this week Amazon India said that it is investigating the issue and said that it does not allow listing and sale of products illegal for sale in India. \"Amazon has a high bar on compliance and contractually our sellers are required to comply with all applicable laws for selling their products on amazon.in. We do not allow the listing and sale of products, which are prohibited under law to be sold in India,\" an Amazon India spokesperson said.</p><p>The police said that one among those arrested operated under a fake name with PAN and GST number etc and alleged that the e-commerce platform got 66.66% profit. They also said that the arrested formed a company named 'Babu Tex' and got it registered on Amazon as a seller. The allegedly supplied ganja from Visakhapatnam in Andhra Pradesh through the company under the guise of selling stevia, a plant-based sweetener. Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}