{"date": "2021-12-01 19:42:08.823000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>INNERSCOPE HEARING TECHNOLOGIES INC (\"INND-0\")\n- Partners with Giant Eagle to Deploy Hearing Screening\n- Kiosks\n\n   InnerScope Hearing Technologies Inc. (\"InnerScope\"), an emerging and\ndisruptive leader in the Direct-to-Consumer Hearing Technology space, is\npleased to announce today a partnership with Giant Eagle, Inc., (\"Giant\nEagle\") a neighborhood grocery and pharmacy chain. The companies have\npartnered to deploy InnerScope's automated self-check hearing screening\nkiosk (\"Hearing Kiosk\") in selected Giant Eagle's supermarkets in\nPennsylvania and Ohio. The partnership with Giant Eagle, one of the largest\nretailers in the nation, broadens InnerScope's reach to help the 48 million\nAmericans who have hearing loss and millions more who have undetected\nhearing loss due to not having convenient, free access to having their\nhearing tested.\n\n The initial rollout of the Hearing Kiosks is at the following Giant Eagle\nlocations:\n\n *  100 Settlers Ridge Center Dr., Pittsburgh, Pa.\n *  4010 Monroeville Blvd., Monroeville, Pa.\n *  30275 Detroit Rd., Westlake, Ohio\n *  1700 Corporate Woods Parkway, Uniontown, Ohio\n *  6700 Perimeter Loop, Dublin, Ohio\n *  840 W. 3rd Ave., Columbus, Ohio\n\n The Hearing Kiosks are prominently located within the Giant Eagle Pharmacy\nDepartment, which serves millions of consumers. Giant Eagle's guests can\neasily and quickly self-check their hearing (typically within 3 to 5\nminutes), instantly see their results, and have the results emailed to\nplace with their records. In addition, the Hearing Kiosk's 32-inch digital\ndisplay monitor provides important information about hearing loss and the\nmultiple health and cognitive risks due to untreated hearing loss.\nMoreover, since hearing aids are the most common treatment for hearing\nloss, the Hearing Kiosk provides recommendations of InnerScope's affordable\nhearing aid solutions and the importance of early treatment to help\nconsumers make an informed decision to take the next step for their hearing\nhealth. Early treatment of hearing loss is crucial to reduce an\nindividual's health and cognitive risks, including early onset of dementia.\n InnerScope and Giant Eagle will continue to strategically deploy\nInnerScope's Hearing Kiosks within Giant Eagle's 470+ locations throughout\nPennsylvania, Ohio, West Virginia, Maryland and Indiana. In addition, Giant\nEagle will be launching InnerScope's Direct-to-Consumer Hearing Aids and\nits other hearing health-related products (\"Hearing Products\") for Giant\nEagle customers to purchase in-store right off the shelf or purchase the\nHearing Products online at www.gianteagle.com to be shipped directly to\ntheir home. Currently, until the hearing products are launched in-store,\nGiant Eagle guests can go to <a href=\"http://gianteagle.myheariq.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://gianteagle.myheariq.com</a> and receive\nexclusive discounts offered for purchasing Hearing Products.\n\n Jim Tsipakis, executive vice president of pharmacy at Giant Eagle, stated:\n\"We are excited about bringing InnerScope's Hearing Screening Kiosks and\nhearing health-related products into Giant Eagle's pharmacies. We\nunderstand the importance of maintaining proper hearing health and are\ncommitted to helping raise awareness for hearing-related health issues in\nour communities. We look forward to offering a new Hearing Health Category,\nwhich will provide our communities with more affordable choices regarding\ntheir hearing health needs, including in-store and online purchases of\nInnerScope's Hearing Products. We want to give our guests the best tools\nnecessary to live a healthy lifestyle. We are delighted to partner with\nInnerScope, a company that shares our mission to make customers' lives\neasier, healthier and happier.\"\n\n Matthew Moore, president and CEO of InnerScope, stated: \"InnerScope is\nthrilled to have the opportunity to bring affordable hearing solutions to\nmillions of Americans through Giant Eagle's incredible and expansive\nnetwork of over 470 neighborhood grocery and pharmacy stores. Partnering\nwith Giant Eagle, one of the nation's largest retailers, is a tremendous\nopportunity for InnerScope to broaden its reach to help more of the 48\nmillion Americans who currently suffer from hearing loss to access more\naffordable choices of hearing aids to treat their hearing loss. We believe\nhaving convenient access to free self-check hearing screenings with\nInnerScope's Hearing Kiosks and its affordable hearing aids will lead the\ntens of millions of Americans to treat their hearing loss sooner rather\nthan later by purchasing hearing aids, preferably one of InnerScope's\nHearing Products. Moreover, we are excited to work with Giant Eagle's\nmanagement to expand on their new hearing health category for in-store and\nonline sales.\"\n\n About InnerScope Hearing Technologies, Inc. (OTC PINK: INND):\n\n InnerScope Hearing Technologies Inc. is a leading Direct-to-Consumer (DTC)\nmanufacturer and distributor of FDA-registered hearing aids, hearing\nassistive devices, hearing health-related products and Personal Sound\nAmplifier Products (PSAPs) (\"Hearing Products\") dedicated to addressing the\nglobal demand for affordable hearing solutions. InnerScope's Hearing\nProducts and its business model break through the persistent barriers that\nprevent access to effective hearing solutions.\n\n InnerScope's recent acquisition of iHear Medical Inc., a DTC cloud-based\nhearing solution provider, gives the Company access to over 40 patents and\nan FDA-registered manufacturing and R&amp;D facility. In addition, InnerScope\nhas acquired HearingAssist, an established leader in the direct-to-consumer\nhearing aid market with a customer base of over 400,000. These\nacquisitions, combined with a partnership with Atlazo Inc., a semiconductor\ninnovator for next-generation AI smart devices, will allow InnerScope to\ntake the lead position in the direct-to-consumer hearing solutions market\nby selling innovated proprietary advanced hearing products through Walmart\nand other major Big Box retailers.\n\n InnerScope's full line of Hearing Health products is currently available\nthrough these multiple retail/wholesale channels: Walmart.com,\nAmazon.com,  Giant Eagle, Hy-Vee, Hartig Drug, Food City, and Cardinal\nHealth dba RGH Enterprises Inc., which provides products to FSAStore.com,\nHSAStore.com, and WellDeservedHealth.com. Additional major retailers\nin-store and online are launching soon.\n\n About The Hearing Kiosk:\n\n InnerScope is expanding its distribution retail/wholesale partnership\nnetwork with its innovative in-store sales and delivery system through its\npoint-of-sale, free automated self-check hearing screening kiosk (\"Hearing\nKiosks\"). The Hearing Kiosk is designed to enable the tens of millions of\npeople with undetected or untreated mild to moderate hearing losses to\ntreat themselves with the InnerScope's easy, convenient, and affordable\n(see InnerScope's Hearing Health Flexible Subscription Plans) DTC hearing\naids in-store, off the shelf, and/or by online affordable hearing aid\noptions. For more information, please visit www.innd.com.\n\n For information related to InnerScope Hearing Technologies latest hearing\naids and related hearing products, please visit:\n<a href=\"http://myheariq.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://myheariq.com</a>\n\n <a href=\"http://iheardirect.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://iheardirect.com</a>\n\n <a href=\"http://hearingassist.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://hearingassist.com</a>\n\n For the most up-to-date information about InnerScope Hearing Technologies\n(OTC: INND), please visit and follow our official Twitter account\n@inndstock page:\n<a href=\"https://twitter.com/inndstock\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/inndstock</a>\n\n For the most up-to-date information about InnerScope Hearing Technologies\n(OTC: INND), please visit and follow our official Twitter account\n@inndstock page:\n<a href=\"https://twitter.com/inndstock\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/inndstock</a>\n\n InnerScope Hyperlinks:\n\n automated self-check hearing screening kiosk\n<a href=\"http://gianteagle.myheariq.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://gianteagle.myheariq.com</a>\nAtlazo Inc.\nAcquisition of iHear Medical Inc.\nAcquisition of HearingAssist\n48 million Americans\nDirect-to-Consumer Hearing Products.\n\n InnerScope's Hearing Health Flexible Subscription Plans\n\n About Giant Eagle:\n\n Giant Eagle, Inc., ranked among the Top 40 on Forbes magazine's largest\nprivate corporations list, is one of the nation's largest food retailers\nand distributors, with approximately $9.2 billion in annual sales. Founded\nin 1931, Giant Eagle, Inc. has grown to be a leading food, fuel and\npharmacy retailer in the region, with more than 470 stores throughout\nwestern Pennsylvania, north central Ohio, northern West Virginia, Maryland\nand Indiana. For more information, please visit  www.gianteagle.com.\n\n Safe Harbor\n\n This news release contains \"forward-looking statements\" within the meaning\nof Section 27A of the Securities Act of 1933, as amended, and Section 21E\nof the Securities Exchange Act of 1934, as amended intended to be covered\nby the \"safe harbor\" created by those sections. Any statements that are not\nhistorical facts contained in this press release are also \"forward-looking\nstatements,\" as that term is defined under the Private Securities\nLitigation Reform Act of 1995 (PSLRA). Such statements may be identified by\nwords such as \"expects,\" \"plans,\" \"projects,\" \"will,\" \"may,\" \"anticipates,\"\n\"believes,\" \"should,\" \"intends,\" \"estimates,\" and other words of similar\nmeaning. Such forward-looking statements are based on current expectations,\ninvolve known and unknown risks, reliance on third parties for information,\ntransactions or orders that may be canceled, and other factors that may\ncause our actual results, performance or achievements, or developments in\nour industry, to differ materially from the anticipated results,\nperformance or achievements expressed or implied by such forward-looking\nstatements. Factors that could cause actual results to differ materially\nfrom anticipated results include risks and uncertainties related to the\nfluctuation of global economic conditions, the performance of management\nand our employees, our ability to obtain financing or maintain contractual\nrelationships with vendors and customers, competition, general economic\nconditions and other factors that are detailed in our periodic reports\nfiled with the Securities and Exchange Commission (\"S.E.C.\"). We intend\nthat all forward-looking statements be subject to the safe-harbor\nprovisions of the PSLRA, Securities Act, and Securities Exchange Act.\n\nInnerScope Hearing Technologies, Inc.\nInvestor Relations\nir@innd.com\n833-788-0506\nwww.innd.com\n\nInvestor Relations Agency Contact:\nSkyline Corporate Communications Group, LLC\nLisa Gray, Senior Account Manager\nOne Rockefeller Plaza, 11th Floor\nNew York, NY 10020\nOffice: (646) 893-5835\nEmail: lisa@skylineccg.com\n\nCorporate Communications:\nInvestorBrandNetwork (IBN)\nLos Angeles, California\nwww.InvestorBrandNetwork.com\n310.299.1717 Office\nEditor@InvestorBrandNetwork.com\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133400849.MNPRE2133403152-11340020211201</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}