{"date": "2022-01-07 17:52:17+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3265.08, "close": 3229.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\"><li class=\"tr-summaryitem\">DJI up; S&amp;P 500, Nasdaq red; banks surge, chips plunge</li><li class=\"tr-summaryitem\">Cons disc weakest major S&amp;P sector; energy leads gainers</li><li class=\"tr-summaryitem\">Dollar, crude, bitcoin down; gold rises</li><li class=\"tr-summaryitem\">U.S. 10-Year Treasury yield hit 1.8010%, highest since Jan 2020, now ~1.77%</li></ul><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Jan 7</span><span class=\"tr-dl-sep\"> - </span>Welcome to the home for real-time coverage of markets brought to you by Reuters reporters. You can share your thoughts with us at <a href=\"mailto:markets.research@thomsonreuters.com\" data-type=\"email\" translate=\"no\">markets.research@thomsonreuters.com</a>  </p><p><br/></p><p>DON'T BLAME MEGA CAPS IF RETURNS SUCKED LAST YEAR (1252 EST/1752 GMT)</p><p>Both long-only and long-short active managers underperformed last year, but those pointing to the market's concentration in mega-cap tech stocks isn't the reason, as holdings in non-U.S. and small-cap stocks most likely spoiled their returns. </p><p>While out-of-benchmark positions are a benefit when they outperform, they were significant detractors in 2021, an analysis by Jonathan Golub, chief U.S. equity strategist at Credit Suisse, showed on Friday.</p><p>Under- or out-performance in a given period is due to a portfolio manager's dual objectives of beating their respective benchmarks and peers, while mitigating downside risk, he said.</p><p>To generate alpha, managers often identify opportunities outside of their benchmarks, with about 20% of large-cap fund holdings in non-U.S. and small-cap stocks, Golub said in a note.</p><p>The data supports what active managers often say: they lag when markets are robust and outperform in weak or down markets, he said. Whether a drag from cash holdings or simply lower Beta, periods of above-average returns are difficult for managers, while low interest rates exacerbated last year's performance.</p><p>Mega-cap tech stocks and the S&amp;P 500 equal weight index performed roughly in line with the benchmark S&amp;P 500 <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.SPX\" data-type=\"ric\" data-ric=\".SPX\" translate=\"no\" dir=\"ltr\">.SPX</a> last year, he said. The S&amp;P 500 returned 28.7% last year, while mega cap tech returned 30.0% and the equal weight S&amp;P 500 29.6%.</p><p>The small-cap Russell 2000 index <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.RUT\" data-type=\"ric\" data-ric=\".RUT\" translate=\"no\" dir=\"ltr\">.RUT</a> returned 14.8% last year, while MSCI's World ex-USA Index returned 13.17%. </p><p>The performance of Apple Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a>, Google-parent Alphabet Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a>, Microsoft Corp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MSFT.O\" data-type=\"ric\" data-ric=\"MSFT.O\" translate=\"no\" dir=\"ltr\">MSFT.O</a>, Meta Platforms Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a> and Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> represented mega-cap tech.</p><p><br/></p><p>(Herbert Lash)</p><p>*****</p><p><br/></p><p>WRAPPED UP IN CHAINS: SUPPLY CONSTRAINTS PERSIST, BUT COULD BE EASING (1235 EST/1735 GMT)</p><p>Supply chain woes, which have hindered economic recovery from the global health crisis and driven prices to the stratosphere amid a demand boom, appear to be on the wane.</p><p>But appearances can be deceiving.</p><p>Oxford Economics' (OE) most recent Supply Chain Stress Tracker, which aggregates five metrics - activity, transportation, prices, inventory and labor - suggests the picture modestly improved in the last weeks of 2021.     </p><p>While the easing of supply chain stress was driven by improved surface transportation and inventory readings, \"on the activity, price, and labor fronts, stress rose,\" writes Oren Klachkin, lead U.S. economist at OE.</p><p>Furthermore, the stubborn persistence of the pandemic remains a threat.</p><p>\"The Omicron variant threatens to jam the economy's gears, intensifying already severe supply-chain problems,\" Klachkin adds. </p><p>Regarding prices, \"the inflation rate of raw materials for durables manufacturing likely reached a new high in December, up roughly 60% y/y,\" the note reads. </p><p>Heightened capacity utilization combined with strong shipments and new orders point to growing stress in the activity tracker, while slower jobs creation, near-record openings and rising wages continue to reflect a tough hiring environment.</p><p>Despite improvement in the transportation component, \"the reality is that congestion has not substantially eased,\" Klachkin says.</p><p>And finally, while inventories showed some encouraging growth, they remain lean relative to strong demand.  </p><p>\"Firms are also stocking up to lower the risk of future disruptions,\" according to the note.</p><p>The graphic below, courtesy of OE, shows a 24-month history of the Supply Chain Stress Tracker, broken down by contributors:</p><p>         </p><p><div class=\"tr-resource-ref\" id=\"b7fa08d4-9ae5-4c44-add2-af9f56162c93\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://graphics.reuters.com/USA-STOCKS/dwpkrkzlrvm/supplychainstress.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9ncmFwaGljcy5yZXV0ZXJzLmNvbS9VU0EtU1RPQ0tTL2R3cGtya3pscnZtL3N1cHBseWNoYWluc3RyZXNzLnBuZw==&amp;storyId=urn:newsml:reuters.com:20220107:nL1N2TN1JN:2&amp;key=722919ede93b0eb661df67a820d296b713c2c48f57892588b7726886e9005f45d5a297aa52c0b6414e54b93cb86b9ea520f70ad2b27ab5437497f45e318177d5\" style=\"max-height:362px\"/></div></div></div></p><p>(Stephen Culp)</p><p>*****</p><p><br/></p><p>CME TO ANNOUNCE PROGRESS ON POSSIBLE 20-YEAR BOND FUTURE ON MONDAY (1210 EST/1710 GMT)</p><p>The CME Group <a href=\"reuters://REALTIME/Verb=FullQuote/ric=CME.O\" data-type=\"ric\" data-ric=\"CME.O\" translate=\"no\" dir=\"ltr\">CME.O</a> is planning to make an announcement on Monday that will give market participants more insight into the progress of its possible launch of a 20-year Treasury bond future.</p><p>The 20-year Treasury bond <a href=\"reuters://REALTIME/Verb=FullQuote/ric=US20YT=RR\" data-type=\"ric\" data-ric=\"US20YT=RR\" translate=\"no\" dir=\"ltr\">US20YT=RR</a>, which was reintroduced in 2020 for the first time since 1986, has struggled to generate as much investor interest as other issues.</p><p>A 20-year bond future could boost demand for the maturity by offering investors an easier way to hedge the debt, or to speculate on its future yield moves.</p><p>The CME has designed three prototypes for a potential 20-year Treasury futures contract and consulted with clients about these options. On Monday it will announce a decision based on this process, it has said.</p><p>The U.S. Treasury Department has said that it will reduce auction sizes of seven-year and 20-year bonds more than other maturities to address supply and demand dynamics of the Treasuries, after issuance was ramped up in 2020 to pay for COVID-related spending. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2RU1G1\" data-type=\"storyId\" data-story-id=\"nL1N2RU1G1\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p><br/></p><p>(Karen Brettell)</p><p>***** </p><p><span class=\"tr-strong\">EUROPE: A STELLAR WEEK FOR THE REFLATION TRADE </span>(1152 EST/1652 GMT)</p><p><span class=\"tr-strong\">While the year began with a flurry of record highs and three straight sessions of gains for the pan-European STOXX 600, it ends with an underwhelming 0.3% weekly loss for European equities.</span></p><p><span class=\"tr-strong\">That said, the benchmark doesn't tell much of the big story that brewed all week below the surface. </span></p><p>Truth be said, these five first days of trading of 2022 must have been exhilarating for those investors who decided to place their bets on the reflation trade.</p><p>The banking index is up a handsome 6.7% and has reached its highest level since 2018 as bond yields kept marching up on both sides of the Atlantic to the tune of faster-than-expected Fed rate hike speculation.</p><p>On that note, data showed today that inflation jumped to a historic high of 5% in the euro zone. </p><p>The upward trend in yields has also provided a boost for European insurers which are up 4.4% this week. </p><p>Among the usual suspects which thrive when prices go up, miners and the oil &amp; gas sector jumped 5.5% and 4.4% respectively. </p><p>By the same token, European tech was the big loser as investors are usually reluctant to pay big equity premiums for growth stocks when interest rates and inflation move up. </p><p>The biggest surprise perhaps of early 2022 was the frenzy surrounding auto stocks.</p><p>While much of the credit for the hype for the sector goes to U.S. firms such as Ford or GM, the European index jumped about 6.5% with carmakers such as France's Renault or Germany's Daimler gaining 11% and 9% respectively. </p><p>Finally, the fact that Travel &amp; Leisure stocks pulled off a weekly gain of 1.7% while COVID-19 infections hit record highs across Europe suggests investors are confident that stringent lockdowns are likely to be avoided this winter. </p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"g55a95d9b-e146-459e-86d4-f519945e297b\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://fingfx.thomsonreuters.com/gfx/mkt/dwvkrkzjrpm/Pasted%20image%201641573580715.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9maW5nZngudGhvbXNvbnJldXRlcnMuY29tL2dmeC9ta3QvZHd2a3JrempycG0vUGFzdGVkJTIwaW1hZ2UlMjAxNjQxNTczNTgwNzE1LnBuZw==&amp;storyId=urn:newsml:reuters.com:20220107:nL1N2TN1JN:2&amp;key=1618cfeb90e133139d0d3b6949fa3cec2070b3f8f7609825882ba15a65d5c08f4a52ac5de346e3e8cbd0e732f50eca313d01a79e43a88949e1627d22336b3dd2\"/></div></div></div></p><p><br/></p><p>(Julien Ponthus) </p><p>*****</p><p><br/></p><p><br/></p><p>THIS IS THE WAY 2021 ENDS, NOT WITH A BANG BUT A WHIMPER: A JOBS REPORT DEEP DIVE (1114 EST/1614 GMT)</p><p>The labor market trudged across the finish line of a remarkable year for jobs growth, with the Labor Department's final employment report of 2021 delivering a disappointing headline number and a mixed bag of data.    </p><p>The U.S. economy added 199,000 jobs in the final month of 2021 <a href=\"reuters://REALTIME/Verb=FullQuote/ric=USNFAR=ECI\" data-type=\"ric\" data-ric=\"USNFAR=ECI\" translate=\"no\" dir=\"ltr\">USNFAR=ECI</a>, less than half the 400,000 expected, in a sign that the worker drought remains a persistent weight on the labor market. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2TM2F6\" data-type=\"storyId\" data-story-id=\"nL1N2TM2F6\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> </p><p>\"The topline number is a disappointment, and it looks as though (COVID) has had an impact,\" says Peter Cardillo, chief market economist at Spartan Capital Securities.</p><p>The number represents a 20% drop from November's upwardly revised 249,000, and means the economy has yet to recover 3.6 million jobs from the 22.4 million that evaporated seemingly overnight when COVID struck nearly two years ago.</p><p>Tallied together, nonfarm payrolls grew by 6.5 million last year. \"In percent terms it was the best year for job gains since the late 1970s,\" tweeted Heather Long of the Washington Post. </p><p>The number - the lowest of 2021 - also caps a tumultuous twelve months, the second year of a global pandemic, and marks the fourth month in 2021 where the headline payrolls number fell short of consensus by 200,000 or more.</p><p>Including revisions, had the headline nailed consensus every month last year, nonfarm payrolls would be 257,000 jobs richer.</p><p>The graphic below shows 2021's headline job adds, along with the size of each month's upside/downside surprise:</p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"g10699b4e-b430-4f26-a113-62f634510257\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://graphics.reuters.com/USA-STOCKS/jnvwejajrvw/nfpr.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9ncmFwaGljcy5yZXV0ZXJzLmNvbS9VU0EtU1RPQ0tTL2pudndlamFqcnZ3L25mcHIucG5n&amp;storyId=urn:newsml:reuters.com:20220107:nL1N2TN1JN:2&amp;key=903bdc0e87a5b4b40cfab963207bd47a5aee244d574a899b8c30a767a7170a407f776b263a598d359e74af434c372c6be98a708c62b434a9b653fc4be94dd138\"/></div></div></div></p><p><br/></p><p>\"It's a really disappointing data point given how many fewer jobs were added than expected,\" writes Chris Zaccarelli, chief investment officer at Independent Advisor Alliance. \"But the other headline number (e.g., the unemployment rate) dropped to 3.9% signaling that we are getting a lot closer to full employment.\"</p><p>Indeed, the unemployment rate <a href=\"reuters://REALTIME/Verb=FullQuote/ric=USUNR=ECI\" data-type=\"ric\" data-ric=\"USUNR=ECI\" translate=\"no\" dir=\"ltr\">USUNR=ECI</a> posted a bigger-than-anticipated drop, shedding 30 basis points to 3.9%.</p><p>That would appear to be a signal that 'full employment,' the Federal Reserve's condition for tightening its easy, pandemic-era monetary policy, is close to being met. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2TL22Y\" data-type=\"storyId\" data-story-id=\"nL1N2TL22Y\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>But broken down by duration, the drop appears to have been driven by the longer-term jobless.</p><p>The share of total unemployed workers who have been jobless fewer than five weeks and five to 14 weeks both inched higher, to 31.2% and 24.8%, respectively, while the longer-term slice of the pie grew smaller.</p><p>This could be indicative that even as the impact of the fast-spreading Omicron COVID variant is beginning to felt in the jobs market, that impact is being offset by long-term unemployed workers either landing gigs or running out of benefits.</p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"g0aabdde4-5b2b-4921-9c72-5af733174bd6\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://graphics.reuters.com/USA-STOCKS/gdvzykmkjpw/ueduration.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9ncmFwaGljcy5yZXV0ZXJzLmNvbS9VU0EtU1RPQ0tTL2dkdnp5a21ranB3L3VlZHVyYXRpb24ucG5n&amp;storyId=urn:newsml:reuters.com:20220107:nL1N2TN1JN:2&amp;key=a120c7279a39e63024fe07964b16b5f7bd820bac20bbf202a4cb42053421464080843943e5796f8a17dd9a2d64bd7cad865dbd06cb2aa531ba82421e98857fb3\"/></div></div></div></p><p><br/></p><p>The drop in the unemployment rate is particularly heartening considering the labor market participation rate, which held steady at an upwardly-revised 61.9%.</p><p>When a worker leaves the labor force, whether to due to retirement, stay-at-home parenting or discouragement over job prospects, they are no longer counted in the data.</p><p>So while the participation rate remains well below pre-pandemic levels, its slow upward trend, combined with the downward trend of the unemployment rate, paint a picture of a labor market recovering its equanimity.</p><p>     </p><p><div class=\"tr-resource-ref\" id=\"g1684b04c-02fe-4ae2-8370-7e0b0fb16d02\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://graphics.reuters.com/USA-STOCKS/znpnelxlnvl/participation.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9ncmFwaGljcy5yZXV0ZXJzLmNvbS9VU0EtU1RPQ0tTL3pucG5lbHhsbnZsL3BhcnRpY2lwYXRpb24ucG5n&amp;storyId=urn:newsml:reuters.com:20220107:nL1N2TN1JN:2&amp;key=3d4e2e5ab9e64e87633176dbacf82098dbb5e3ee1a5e501fc3959602faeb62390d7be097158bcf7601b8a9a1d23bd7f342c325c51693e02c1b948e2b42e4c409\" style=\"max-height:369px\"/></div></div></div></p><p><br/></p><p>On the downside, wage growth - perhaps the most closely-watched non-headline number this go-around - was significantly hotter than expected, jumping 0.6% last month and rising 4.7% year-over-year.</p><p>While this was cooler than November's upwardly-revised 5.1% annual growth, the number remains too hot for the Fed to consider tamping down its recent pivot to hawkishness, and if anything increases the likelihood of even more than three interest rate hikes in 2022.</p><p>\"Hourly wages are not coming down, which suggests the Fed is not likely to be derailed by this headline number,\" Cardillo adds.</p><p>The graphic below shows wage growth along with other indicators, all of which continue to soar well above the Fed's average annual 2% inflation target.</p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"g974e5d8c-64fc-4499-8f91-24d54b837fce\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://graphics.reuters.com/USA-STOCKS/zjvqknynjvx/inflation.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9ncmFwaGljcy5yZXV0ZXJzLmNvbS9VU0EtU1RPQ0tTL3pqdnFrbnluanZ4L2luZmxhdGlvbi5wbmc=&amp;storyId=urn:newsml:reuters.com:20220107:nL1N2TN1JN:2&amp;key=5adc6447f1dcb484069b1cd30f1bf40578787b457defe06b510ee3a2d18ad7b4f5bd97864dc8762f4135b3c9debe0ba1644683cb12d57ec02cb0b70315521a60\"/></div></div></div></p><p><br/></p><p>On another sour note: the racial/ethnic unemployment gap widened.</p><p>Joblessness among White, Asian and Latino Americans all inched lower, but Black unemployment actually increased, gaining 0.6 percentage points to 7.1%. </p><p>With White unemployment dipping to 3.2%, the White/Black joblessness gap widened sharply to 3.9 percentage points.</p><p>And it appears that Black women bore the brunt of it.</p><p>\"The increase in Black unemployment appears to be borne by Black women, who experienced a huge jump in their unemployment rate from 4.9% to 6.2% in December, due in part to lower employment levels as well as an increase in labor force participation,\" tweeted Elise Gould, senior economist at the Economic Policy Institute.</p><p>     </p><p><div class=\"tr-resource-ref\" id=\"g3c5ef44f-9544-46d6-90b4-c8e1ae1ea5d6\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://graphics.reuters.com/USA-STOCKS/dwpkrkzkrvm/uerace.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9ncmFwaGljcy5yZXV0ZXJzLmNvbS9VU0EtU1RPQ0tTL2R3cGtya3prcnZtL3VlcmFjZS5wbmc=&amp;storyId=urn:newsml:reuters.com:20220107:nL1N2TN1JN:2&amp;key=9751a77fe44a619c6cca2e9dca7c8db03f85715474c8c6a905d7364e3a6b7b839c5f2f486b742a42a6765ea4dd89511ca2bd2981bca50348cc7cda8cf47f9a47\" style=\"max-height:374px\"/></div></div></div></p><p>     </p><p>Wall Street is lower in late morning trading, after the employment report seemed to confirm the Fed's stated intent to whisk away the punch bowl of near-zero interest rates.</p><p>Tech, which benefited most from that punch bowl, is the biggest albatross around the stock market's neck, with chips <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.SOX\" data-type=\"ric\" data-ric=\".SOX\" translate=\"no\" dir=\"ltr\">.SOX</a> in particular, having a bad day.</p><p><br/></p><p>(Stephen Culp)</p><p>*****</p><p><br/></p><p>BULL, BEAR, AND FENCE-SITTER CAMPS ALL ABOUT EQUAL (1036 EST/1536 GMT)</p><p>The percentages of individual investors expecting stocks to be flat or down over the next six months both rebounded in the latest American Association of Individual Investors Sentiment Survey (AAII). With this, bulls reined in their horns a bit. As a result, around one-third of investors call each of the bullish, bearish, and neutral camps home.</p><p>AAII reported that bearish sentiment, or expectations that stock prices will fall over the next six months, increased 2.8 percentage points to 33.3%. Pessimism extended its streak of being at or above its historical average of 30.5% to seven consecutive weeks. </p><p>Neutral sentiment, or expectations that stock prices will stay essentially unchanged over the next six months, moved up by 2.1 percentage points to 33.9%. Neutral sentiment is above its historical average of 31.5% for the fifth consecutive week.</p><p>Bullish sentiment, or expectations that stock prices will rise over the next six months, fell by 4.9 percentage points to 32.8%. Optimism remains below its historical average of 38.0% for the seventh consecutive week.</p><p>AAII noted that all three indicators are within their typical historical ranges, and that most of the responses to this week’s survey were recorded prior to Wednesday's sharp market decline.</p><p>With these changes, the bull-bear spread fell to -0.5 from +7.2 last week <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2TG0RD\" data-type=\"storyId\" data-story-id=\"nL1N2TG0RD\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span>:</p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"c6f17a7b-1d5f-4ae0-9a2a-9cef15bf3ee6\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://fingfx.thomsonreuters.com/gfx/buzz/klvykqnqevg/AAII01072021.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9maW5nZngudGhvbXNvbnJldXRlcnMuY29tL2dmeC9idXp6L2tsdnlrcW5xZXZnL0FBSUkwMTA3MjAyMS5wbmc=&amp;storyId=urn:newsml:reuters.com:20220107:nL1N2TN1JN:2&amp;key=912fc29d93fd753974becce8764f207c4bc1e7ceda946bee4a9706358e65c030cea8e8b5106877c7bf451215697dac9fd49c82679399c1ecdae5d0e73c867319\"/></div></div></div></p><p><br/></p><p>(Terence Gabriel)</p><p>*****</p><p><br/></p><p><br/></p><p>U.S. STOCKS TRY TO FIND FOOTING (1015 EST/1515 GMT)</p><p>U.S. stocks are churning early Friday after data pointed to weaker-than-expected job growth, while a rise in wages fueled concerns about higher inflation. <a href=\"reuters://REALTIME/verb=Headlines/ric=.N\" data-type=\"newsExpression\" data-expression=\".N\" translate=\"no\" dir=\"ltr\">.N</a></p><p>That said, after moving around the flat line so far, the major indexes have now fallen into the red again.</p><p>Traders remain focused on whether the Nasdaq <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.IXIC\" data-type=\"ric\" data-ric=\".IXIC\" translate=\"no\" dir=\"ltr\">.IXIC</a> can continue to hold its December lows <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2TM0O7\" data-type=\"storyId\" data-story-id=\"nL1N2TM0O7\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span>:</p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"aa1b5181-ebb5-4b2f-adcf-8da806109ebf\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://fingfx.thomsonreuters.com/gfx/buzz/znvnelxxnpl/IXIC01072021.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9maW5nZngudGhvbXNvbnJldXRlcnMuY29tL2dmeC9idXp6L3pudm5lbHh4bnBsL0lYSUMwMTA3MjAyMS5wbmc=&amp;storyId=urn:newsml:reuters.com:20220107:nL1N2TN1JN:2&amp;key=f4d0d5806984199b08885ba5b49146634c7859b32c3e0589cc006a89a70cc28513a1b8b3abadfd6557ad1ce4b8d6d11dcee333e1e6e94d2202dad1e9771f0d69\"/></div></div></div></p><p><br/></p><p>Meanwhile, value <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.IVX\" data-type=\"ric\" data-ric=\".IVX\" translate=\"no\" dir=\"ltr\">.IVX</a> is once again outperforming growth <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.IGX\" data-type=\"ric\" data-ric=\".IGX\" translate=\"no\" dir=\"ltr\">.IGX</a>. However, both FANGs <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.NYFANG\" data-type=\"ric\" data-ric=\".NYFANG\" translate=\"no\" dir=\"ltr\">.NYFANG</a> and banks <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.SPXBK\" data-type=\"ric\" data-ric=\".SPXBK\" translate=\"no\" dir=\"ltr\">.SPXBK</a> are on the plus-side. Chip stocks <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.SOX\" data-type=\"ric\" data-ric=\".SOX\" translate=\"no\" dir=\"ltr\">.SOX</a> are weak.</p><p>Here is where markets stand in early trade:</p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"g6e5ce4dd-ac6c-4540-9399-b63f69d4cc7c\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://fingfx.thomsonreuters.com/gfx/buzz/lbpgnjllavq/earlytrade01072021.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9maW5nZngudGhvbXNvbnJldXRlcnMuY29tL2dmeC9idXp6L2xicGduamxsYXZxL2Vhcmx5dHJhZGUwMTA3MjAyMS5wbmc=&amp;storyId=urn:newsml:reuters.com:20220107:nL1N2TN1JN:2&amp;key=e39275a46b5894484453b6ec5480a8e8fb277b4c2b2b463d7670b73d0a1bff71d000265c450e7ac48db349c845bb58144e82ebd169b6e2ce952b3a47c13ce21e\"/></div></div></div></p><p><br/></p><p>(Terence Gabriel)</p><p>*****</p><p>      </p><p>U.S. STOCKS POISED FOR MODEST OPENING DIP AFTER PAYROLLS (0900 EST/1400 GMT)</p><p>U.S. equity index futures are modestly red in the wake of a softer-than-expected December non-farm payrolls print. The headline jobs number came in at 199k vs a 400k estimate. That said, wage data was hotter than expected: </p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"g16f0ac76-2203-4d98-add7-d9e69936278f\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://fingfx.thomsonreuters.com/gfx/buzz/dwpkrkzervm/NFP01072021.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9maW5nZngudGhvbXNvbnJldXRlcnMuY29tL2dmeC9idXp6L2R3cGtya3plcnZtL05GUDAxMDcyMDIxLnBuZw==&amp;storyId=urn:newsml:reuters.com:20220107:nL1N2TN1JN:2&amp;key=e9a5d46e9d36042b83eebc01daa0c71ca81cb7a48c2993cb40bbe6f44b3329037704d09f9125f56203243a6e89d9cad8fa7eee9e5e9ca7f68cf1fde22f344178\"/></div></div></div></p><p><br/></p><p>Regarding the numbers, Gennadiy Goldberg, interest rate strategist at TD Securities said, “It’s a bit of a mixed bag really. The headline numbers are quite a bit lower than anticipated, but a lot of the measures of labor market tightness, including wages and the unemployment rate, do suggest that we may be closer to full employment than was previously expected.\"</p><p>Goldberg added \"I think overall this shouldn’t really detract the Fed from looking to tighten rates early. I think this should keep them quite hawkish, even though this most likely will be a temporary COVID induced disruption and we’ll probably see more of this in the next few months as well.\"</p><p>U.S. stock futures are red, with the Nasdaq 100 <a href=\"reuters://REALTIME/Verb=FullQuote/ric=NQcv1\" data-type=\"ric\" data-ric=\"NQcv1\" translate=\"no\" dir=\"ltr\">NQcv1</a> off the most at around 0.3%. Financials <a href=\"reuters://REALTIME/Verb=FullQuote/ric=XLF.P\" data-type=\"ric\" data-ric=\"XLF.P\" translate=\"no\" dir=\"ltr\">XLF.P</a>, and energy <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.XLE.P\" data-type=\"ric\" data-ric=\".XLE.P\" translate=\"no\" dir=\"ltr\">.XLE.P</a> are quoted up in premarket, while tech <a href=\"reuters://REALTIME/Verb=FullQuote/ric=XLK.P\" data-type=\"ric\" data-ric=\"XLK.P\" translate=\"no\" dir=\"ltr\">XLK.P</a> is lower.</p><p>The U.S. 10-Year Treasury yield <a href=\"reuters://REALTIME/Verb=FullQuote/ric=US10YT=RR\" data-type=\"ric\" data-ric=\"US10YT=RR\" translate=\"no\" dir=\"ltr\">US10YT=RR</a> is attempting to rise for a sixth-straight day, which is something it hasn't done since January 2021. It's high so far today of 1.7710%, is just shy of its March 2021 peak at 1.7760%.</p><p>Here is your premarket snapshot:</p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"g156d52c4-584b-4b22-ba7e-9bf3c191a1c5\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://fingfx.thomsonreuters.com/gfx/buzz/zdvxoqxnapx/premarket01072021.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9maW5nZngudGhvbXNvbnJldXRlcnMuY29tL2dmeC9idXp6L3pkdnhvcXhuYXB4L3ByZW1hcmtldDAxMDcyMDIxLnBuZw==&amp;storyId=urn:newsml:reuters.com:20220107:nL1N2TN1JN:2&amp;key=3065a7598f97aa9ed4d92f644eb22e6c23d5d84b37a39ebede6f2997c86fc0d88c3d2897f8eb3bf05bd9d6e3d4b75fa1f2eb98bc16fe3d677a2b990c36f47469\"/></div></div></div></p><p><br/></p><p>(Terence Gabriel, Karen Brettell)</p><p>***** </p><p>   </p><p>FOR FRIDAY'S LIVE MARKETS' POSTS PRIOR TO 0900 EST/1400 GMT - CLICK HERE: <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2TN2MJ\" data-type=\"storyId\" data-story-id=\"nL8N2TN2MJ\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Terence Gabriel is a Reuters market analyst. The views expressed are his own)</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: GLOBAL-STOCKS/</p></div>"}