{"date": "2022-02-23 12:49:37+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds details from news conference</p><p class=\"tr-by\">By Foo Yun Chee</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">BRUSSELS, Feb 23 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, Microsoft <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MSFT.O\" data-type=\"ric\" data-ric=\"MSFT.O\" translate=\"no\" dir=\"ltr\">MSFT.O</a> <span class=\"tr-strong\">and</span> other <span class=\"tr-strong\">providers of cloud </span>and data processing services will have to <span class=\"tr-strong\">set up </span>safeguards to prevent non-EU governments gaini<span class=\"tr-strong\">ng</span> illegal access to EU data, <span class=\"tr-strong\">according to draft legislation from the European </span>Commission.</p><p>The Data Act, published on Wednesday, lays out rights and obligations on the use of <span class=\"tr-strong\">EU consumer and corporate </span>data <span class=\"tr-strong\">generated </span>in smart gadgets and machinery as well as consumer goods.</p><p>T<span class=\"tr-strong\">his confirms a Reuters report earlier in February that the Commission </span>a<span class=\"tr-strong\">imed to tighten curbs on data transfers</span>. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2UE1RN\" data-type=\"storyId\" data-story-id=\"nL1N2UE1RN\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p><span class=\"tr-strong\">The draft law is</span> part of a series of rules aimed at curbing the power of U.S. tech giants and <span class=\"tr-strong\">to help </span>the EU achieve its digital and green objectives.</p><p>\"<span class=\"tr-strong\">We want to ensure greater fairness in the allocation of value created by data</span>,\" the Commission's digital chief Margrethe Vestager <span class=\"tr-strong\">told a news conference</span>.</p><p><span class=\"tr-strong\">\"We are buying more and more products that generate data from smartwatches to connected cars and currently it's mainly the manufacturer of these products who holds and uses the data,\" she said.</span></p><p>The EU executive said the new rules will free up a huge volume of data for use and <span class=\"tr-strong\">which is expected </span>to add 270 billion euros of additional gross domestic product by 2028.</p><p>The Data Act also imposes contractual requirements and interoperability standards on cloud and edge services to make it easier for companies to switch to a rival and <span class=\"tr-strong\">for data </span>to be used between sectors. </p><p>Users of connected devices will be able to access data generated by them, which typically is only accessible to the device makers, and share it with other companies providing  aftermarket or other data-driven innovative services.</p><p>Companies will be obliged to provide certain data to governments during public emergencies such as floods or wildfires.</p><p>    EU concerns about data transfers have grown since former U.S. intelligence contractor Edward Snowden in 2013 revealed  mass U.S. surveillance.</p><p>This led Europe's top court to outlaw a transatlantic data transfer pact known as the Privacy Shield which thousands of companies depended on for services ranging from cloud infrastructure to payroll and finance.</p><p>The United States and the EU have since then been struggling to find a new data agreement. </p><p>The Data Act will need to be thrashed out with EU governments and lawmakers before it can become law.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Foo Yun Chee, editing by Ingrid Melander and Jane Merriman)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:foo.yunchee@thomsonreuters.com\" data-type=\"email\" translate=\"no\">foo.yunchee@thomsonreuters.com</a> ; +32 2 287 6844; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://foo.yunchee.thomsonreuters.com@reuters.net\">foo.yunchee.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: EU-TECH/DATAACT (UPDATE 1)</p></div>"}