{"date": "2021-11-02 06:08:41+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n      Together with governments and leading companies around the globe, Amazon is accelerating climate action as part of the LEAF Coalition, an ambitious public-private initiative.\n    </div>\n              <div>\n                <p>\n        Amazon has announced that it helped mobilize $1 billion to protect the world's tropical rainforests. Together with the governments of Norway, the United Kingdom, and the United States, as well as other leading companies, Amazon is accelerating climate action by committing upfront to purchase verified emissions reductions from countries committed to tackling one of the world's most critical issues: reducing tropical deforestation.\n      </p>\n                <p>\n        This effort is made possible through the Lowering Emissions by Accelerating Forest finance (LEAF) Coalition. LEAF is an ambitious public-private initiative designed to help protect tropical forests-which benefit billions of people around the world-and to support sustainable development.\n      </p>\n                <p>\n        Amazon made the announcement during the World Leaders Summit, as part of the <span><a href=\"https://ukcop26.org/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">United Nations Climate Change Conference</a></span>(COP 26). Just six months after it was launched at the Leaders' Summit on Climate, the LEAF Coalition is now one of the largest-ever public-private efforts to protect tropical forests.\n      </p>\n                <p>\n        \"As a co-founder of The Climate Pledge-a commitment by companies and organizations to reach the goals of the Paris Agreement 10 years early-we know that addressing the global crisis of climate change will take a combination of big, bold measures and everyday actions,\" said Andy Jassy, Amazon CEO. \"Emissions from tropical deforestation and degradation make up over 10% of net human-caused greenhouse gas emissions. I am proud of Amazon's work over the past six months with the governments of Norway, the United Kingdom, and the United States, and a growing number of other leading companies, to spearhead this important initiative and mobilize $1 billion to fight tropical deforestation. Together, we can work to create a more beautiful, livable, and breathable planet. We're encouraged by the coalition's impressive progress thus far and look forward to lending our continued support.\"\n      </p>\n                <p>\n        The LEAF Coalition also announced that Costa Rica, Ecuador, Ghana, Nepal, and Vietnam will sign the first letters of intent to supply emission reduction purchases to the LEAF government and corporate participants. To date, 23 jurisdictions (countries, states, or provinces) have submitted eligible proposals to the LEAF Coalition. These proposals collectively amount to several times LEAF's initial goal of 100 million metric tons of emissions reductions, the equivalent to taking 22 million cars off the road for one year.\n      </p>\n                <h4>\n        How does LEAF work?\n      </h4>\n                <p>\n        The LEAF Coalition focuses on three areas to help reduce carbon emissions and protect tropical rainforests. First, it helps buyers of emission reduction credits-companies like Amazon and the governments of Norway, the UK, and the U.S.-commit upfront to purchase verified emissions reductions and mobilize funds.\n      </p>\n                <p>\n        Second, the coalition helps governments in tropical forested regions reduce emissions across their jurisdictions, adhering to a rigorous carbon crediting standard, including safeguards for Indigenous populations and local communities. Lastly, payments are transacted upon delivery of verified credits, also known as results-based payments.\n      </p>\n                <p>\n        \"The UK is proud to be part of this ambitious coalition that is massively scaling up the amount of finance available to support efforts to stop deforestation, cut global greenhouse gas emissions, and put nature on the path to recovery,\" said UK Prime Minister Boris Johnson. \"Time is running out to protect our tropical forests from irreversible loss. Communities, livelihoods and endangered species rely on these vast ecosystems. History will not judge us kindly if some of the world's most precious resources are degraded on our watch, given their crucial role in helping us limit the rise in global temperature.\"\n      </p>\n                <p>\n        \"Since its launch at the White House Leaders Summit on Climate in April, the LEAF Coalition is demonstrating the scale and collaboration needed to fight the climate crisis and make a meaningful contribution to the global effort to achieve net-zero emissions globally by 2050,\" said U.S. Special Presidential Envoy for Climate John Kerry. \"The coalition has already exceeded its target for mobilizing government and private-sector resources to support the sort of large-scale action to halt deforestation and begin to restore tropical and subtropical forests. And importantly, all these contributions are in addition to taking urgent action to cut their own emissions.\"\n      </p>\n                <p>\n        Learn more about the efforts of <span><a href=\"https://leafcoalition.org/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">the LEAF Coalition</a></span>.\n      </p>\n              </div>\n              <div>\n                <div>\n        Related Tags\n      </div>\n                <div>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/sustainability\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Sustainability</a>\n                  </span>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/climate\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Climate</a>\n                  </span>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/the-climate-pledge\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Climate Pledge</a>\n                  </span>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/sustainability/amazon-helps-mobilize-1-billion-to-protect-rainforests-worldwide\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>02 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>02 November 2021 06:08:41 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}