{"date": "2022-02-16 15:41:07.353000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>BLENDER BITES LTD (\"BITE-Z\")\n- Historic Record January 2022 Revenue: a 3,000% Increase\n- Compared to Same Period in 2021\n\n     Blender Bites Ltd. (the \"Company\", \"Blender Bites\" or \"Blender\"), a\nCanadian company that develops and markets a line of premium, organic and\nplant-based pre-portioned frozen functional foods, announces record sales\nrevenues in January of 2022, representing more than a 3000% increase\ncompared to the same period in 2021, as well as the Company's highest\nmonthly revenue on record.\n\n     Founded in 2016, Blender Bites became the first company to produce a\npre-portioned smoothie puck in the Canadian market and its one step\nsmoothie product line can be found in more than 850 retail stores across\nCanada and the US. In January of 2022, the Company saw total revenues of\n$560,654 CAD with related expenses of $416,238. This represents a\nsignificant 3,026% increase in revenue when compared to the same period\nlast year, which generated $17,932 in revenues.\n\n     The Company is also delighted to announce that January 2022 posted the\nhighest revenues for any single month of reporting since inception.\n\n     This increase in revenue reflects Blender Bites' rapid progress and\nsuccess in obtaining a large portion of the Canadian functional beverage\nmarket. Blender's certified organic, non-GMO, plant-based convenient\nsmoothie pucks have proved to be a big hit amongst consumers seeking\norganic, highly nutritious and convenient meals. The Company's rapid\nexpansion and effective strategies in brand awareness, marketing efforts\nwhich includes Canada's largest grocery store, Loblaw's, Eastern Canadian\nregion of the world's leading club store chain, as well as the introduction\nof US distribution channels, have greatly contributed to Blender Bites'\nexponential growth and subsequent historic and consecutive monthly record\nsales revenues.\n\n     \"Blender Bites is on an incredible trajectory of growth and our recent\nJanuary sales is a testament to our hard work and dedication to building\nthis brand. 2022 is going to be a monumental year for the company with\naggressive US expansion and a product very much in demand as consumers turn\nto health forward yet convenient products that they feel good about feeding\ntheir families,\" commented Chelsie Hodge, Blender Bites CEO.\n\n     The Company cautions that the above figures for revenue have not been\naudited and are based upon calculations prepared by management. Actual\nresults may differ from those reported in this release once these figures\nhave been audited.\n\n     ABOUT BLENDER BITES\nBlender Bites is a Canadian company involved in the development and\nmarketing of a line of premium frozen food products with a focus on\nfunctionality. Blender Bites was founded in 2016 and was first to market in\nWestern Canada with a pre-portioned \"easy smoothie\" product that is free of\nany unnecessary inner plastic packaging. Blender Bites products are\ncertified organic, vegan, non-GMO, gluten free, dairy free and soy free.\nThey contain no added sugars and are made in Canada. Blender Bites products\nare distributed internationally across Canada and the US, and are currently\nsold in over 900 stores, including Sobeys, Safeway, Save on Foods, Whole\nFoods Market, Buy-Low/Nesters, IGA and Fresh Street.\n\n     ON BEHALF OF THE BOARD OF DIRECTORS,\nBlender Bites Limited\n\n     Chelsie Hodge, Chief Executive Officer\n\n     For further information, contact Blender IR Team at:\n\n     Email - investors@blenderbites.com\nTelephone - 1-888-997-2055\n\n     CAUTIONARY DISCLAIMER STATEMENT\nThis news release includes certain \"forward-looking statements\" under\napplicable Canadian securities legislation. Forward-looking statements are\nnecessarily based upon several estimates and assumptions that, while\nconsidered reasonable, are subject to known and unknown risks,\nuncertainties, and other factors which may cause the actual results and\nfuture events to differ materially from those expressed or implied by such\nforward looking statements. Such factors include, but are not limited to\ngeneral business, economic, competitive, political, and social\nuncertainties, and uncertain capital markets. Readers are cautioned that\nactual results and future events could differ materially from those\nanticipated in such statements. Accordingly, readers should not place undue\nreliance on forward-looking statements. The Company disclaims any intention\nor obligation to update or revise any forward-looking statements, whether\nas a result of new information, future events or otherwise, except as\nrequired by law.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204600298.MNPRE2204601716-07130620220216</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}