{"date": "2021-12-07 15:16:51.079000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Dec 07, 2021</p></div><div class=\"tr-npp-lead\"><p><span>Amazon</span><a href=\"https://www.zacks.com/stock/quote/AMZN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AMZN</a> continues to ride on its robust cloud computing arm — Amazon Web Services (\"AWS\"). Strengthening AWS offerings, which are constantly driving the company's cloud customer momentum, remain the key catalysts.The latest selection of AWS by<span>Rivian</span><a href=\"https://www.zacks.com/stock/quote/RIVN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">RIVN</a> as the preferred cloud provider is a testament to the aforesaid fact. This highlights the efficiency and reliability of AWS's innovative cloud products and services.Further, the deal has strengthened the existing relationship between AWS and Rivian.In a bid to boost the efficiency and performance of electric vehicles, and accelerate the consumer and commercial shift to these vehicles, Rivian is leveraging AWS's analytics, compute, containers, and machine learning capabilities.More precisely, Rivian is utilizing Amazon Elastic Kubernetes Service to manage and orchestrate software updates. For the deployment of updates, it is using Amazon CloudFront.Additionally, Rivian's software-defined vehicle architecture and over-the-air software updates are powered by AWS.</p></div><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">Amazon.com, Inc. Price and Consensus</p><p> </p><p><a href=\"https://www.zacks.com/stock/chart/AMZN/price-consensus-chart?icid=chart-AMZN-price-consensus-chart\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. price-consensus-chart</a> | <a href=\"https://www.zacks.com/stock/quote/AMZN?icid=chart-AMZN-price-consensus-chart\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. Quote</a> </p><p class=\"tr-npp-section-title\">Portfolio Strength</p><p>The latest move of Rivian has added strength to the customer base of AWS.We believe that AWS's persistent focus on enhancing its offerings will continue driving its customer momentum.AWS recently announced a managed service called AWS IoT FleetWise, which helps collect and transfer data from millions of vehicles to the cloud cost-efficiently in real-time.The company introduced a managed wide area network (WAN) service, namely AWS Cloud WAN, which aids in the seamless development, management, operation and monitoring of a global network with the help of a central dashboard.Furthermore, it announced AWS IoT TwinMaker, which helps in the quick creation of digital twins of devices, equipment and processes.The company also unveiled three Amazon Elastic Compute Cloud (Amazon EC2) instances, namely C7g, Trn1 and Im4gn/Is4gen/I4i.AWS made Amazon Elastic Compute Cloud (Amazon EC2) DL1 instances generally available. DL1 instances, backed by Gaudi accelerators from Habana Labs, assist in training ML models.Additionally, Amazon made a device called AWS Panorama Appliance generally available. The device helps run applications, which require analysis of multiple video streams from the existing on-premise cameras.</p><p class=\"tr-npp-section-title\">Bottom Line</p><p>We believe that the expanding AWS portfolio will continue to aid AWS in winning customers.Aurora has recently chosen AWS as its preferred cloud provider for machine learning training and cloud-based simulation workloads.Nasdaq has signed a multi-year agreement with AWS in a bid to accelerate the development of advanced cloud-enabled infrastructure for the world's capital markets. It is gearing up to transfer its North America markets to AWS.Gilead Sciences picked AWS as the preferred cloud provider to accelerate the development process and delivery of medicines.Discovery expanded its relationship with AWS to drive its transformation in the cloud. Also, the Federal National Mortgage Association — Fannie Mae is shifting IT workloads from on-premise data centers to AWS.We note that Amazon's clientele win will continue to aid its cloud dominance.Per the latest Canalys report, AWS accounted for 32% of the global cloud spending in third-quarter 2021, sustaining its leading position in the booming cloud market.<span>Microsoft</span>'s <a href=\"https://www.zacks.com/stock/quote/MSFT\" data-type=\"url\" class=\"tr-link\" translate=\"no\">MSFT</a> Azure, the second-largest cloud-service provider, accounted for 21% of worldwide cloud spending.<span>Alphabet</span>'s <a href=\"https://www.zacks.com/stock/quote/GOOGL\" data-type=\"url\" class=\"tr-link\" translate=\"no\">GOOGL</a> Google Cloud represented 8% of the cloud spending, marking itself the third-largest cloud provider.However, Amazon, presently carrying a Zacks Rank #5 (Strong Sell), is facing stiff competition from Microsoft and Alphabet as both are targeting a bigger slice of the market on the back of their advancing cloud portfolios. This poses a serious threat to Amazon's dominant position in the cloud market.You can see<span><a href=\"https://www.zacks.com/stocks/buy-list/?ADID=zp_1link_invideas&amp;ICID=zpi_1link_invideas\" data-type=\"url\" class=\"tr-link\" translate=\"no\">the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.</a> </span></p><p><span>5 Stocks Set to Double</span></p><p>Each was handpicked by a Zacks expert as the #1 favorite stock to gain +100% or more in 2021. Previous recommendations have soared +143.0%, +175.9%, +498.3% and +673.0%.</p><p>Most of the stocks in this report are flying under Wall Street radar, which provides a great opportunity to get in on the ground floor.</p><p><a href=\"https://www.zacks.com/registration/ultimatetrader/welcome/eoffer/4e87?add=1726&amp;adid=NEWSTEX_CONTENT_ZU_5S2DREPORT_ANALYSTBLOG_253_12072021&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1836283\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Today, See These 5 Potential Home Runs &gt;&gt;</a></p><p>Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.</p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=RPT_7BST_LP194&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1836283\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Click to get this free report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=AMZN&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1836283\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. (AMZN): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=MSFT&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1836283\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Microsoft Corporation (MSFT): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=GOOGL&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1836283\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Alphabet Inc. (GOOGL): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=shortpg&amp;adid=NEWSTEX_CONTENT_PFP_ARTCAT_ANALYSTBLOG&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1836283\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Rivian Automotive, Inc. (RIVN): Get Free Report</a></p><p><a href=\"http://www.zacks.com/stock/news/1836283/amazon-s-amzn-aws-gets-selected-by-rivian-boosts-clientele?cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1836283\" data-type=\"url\" class=\"tr-link\" translate=\"no\">To read this article on Zacks.com click here.</a></p><p><a href=\"http://www.zacks.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Zacks Investment Research</a></p><p>The views expressed in any and all content distributed by Newstex and its re-distributors (collectively, the \"Newstex Authoritative Content\") are solely those of the respective author(s) and not necessarily the views of Newstex or its re-distributors. Stories from such authors are provided \"AS IS,\" with no warranties, and confer no rights. The material and information provided in Newstex Authoritative Content are for general information only and should not, in any respect, be relied on as professional advice. Newstex Authoritative Content is not \"read and approved\" before it is posted. Accordingly, neither Newstex nor its re-distributors make any claims, promises or guarantees about the accuracy, completeness, or adequacy of the information contained therein or linked to from such content, nor do they take responsibility for any aspect of such content. The Newstex Authoritative Content shall be construed as author-based content and commentary. Accordingly, no warranties or other guarantees are offered as to the quality of the opinions, commentary or anything else appearing in such Newstex Authoritative Content. Newstex and its re-distributors expressly reserve the right to delete stories at its and their sole discretion.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Zacks Investment Research</p></div>"}