{"date": "2021-02-28 05:39:39+00:00", "ticker": "AVV", "mrkt_info": {"open": 3395.0, "close": 3520.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Dubai, UAE:</strong> AVEVA, a global leader in engineering and industrial software, has announced three key senior hires to lead employee experience, Corporate Social Responsibility (CSR), Diversity, Inclusion and Wellbeing (DI&amp;W) and Sustainability. These roles will help accelerate AVEVA’s heightened focus to further its values of integrity, collaboration, innovation, and sustainable business outcomes throughout the organization. </p>\n<p><strong>New Chief People Officer’s Remit is Extended Beyond Human Resources</strong></p>\n<p>Tasked with leading AVEVA’s group-wide CSR initiative, Action for Good, along with driving its people strategy and improving the global employee experience, Caoimhe Keogan joined AVEVA in January 2021 as Chief People Officer (CPO). Prior to AVEVA, Caoimhe held senior roles at Moneysupermarket Group PLC, SoundCloud and Google. She will report directly to AVEVA’s CEO, Craig Hayman, and joins AVEVA’s Executive Leadership Team (ELT).  </p>\n<p>“I am delighted to be joining a leading UK technology organization with ambitious growth plans and a strong focus on social responsibility. These key hires demonstrate that AVEVA is investing in both sustainability and inclusion, in addition to our established Action for Good program, where we aim to have a positive impact on the communities, we operate in. Like many organizations we still have much work to do and so I am delighted to be part of the team driving change for the better,” commented Caoimhe Keogan.</p>\n<p><strong>Fostering a Culture of Inclusivity</strong></p>\n<p>With a determined focus to develop an inclusive culture for all its employees, AVEVA recently hired Lena Milosevic MBE, as Global Director Diversity, Inclusion and Wellbeing. Lena has led diversity and inclusion throughout her career – for local government in the UK, through activism, to her career with the British Council. She was awarded the MBE in 2017 for services to cultural relations.</p>\n<p>“This is a really exciting time to be heading up DI&amp;W at AVEVA because the support, from all levels of the company for accelerating positive change, is so strong. I am thrilled to be working with hugely committed and talented colleagues across the globe to drive forward a coherent and constant program of interventions that are already beginning to make a difference,” commented Lena Milosevic MBE.</p>\n<p><strong>Stepping Up to Build a Sustainable Future</strong></p>\n<p>Following the appointment of Lisa Johnston as Chief Sustainability Officer last year, Lisa Wee, joined AVEVA in August 2020 as Director of Sustainability, leading the development and coordination of the company’s ESG strategy. Lisa has been working to advance corporate impact on sustainable development for her entire professional career, including through multiple roles at Chevron and more recently having built up a sustainability program at Under Armour. She has a successful track record across all major areas of sustainability, including strategy, program design, partnership development, employee engagement and ESG reporting. She is passionate about building relationships across cultures and with a wide range of stakeholders to help solve sustainability challenges.</p>\n<p>“I am very impressed that AVEVA’s software already does a great deal to support sustainability, reducing emissions, boosting circularity, and supporting increased transparency and traceability across supply chains. The foundations are in place to accelerate AVEVA’s sustainability journey and leadership in this important area,” commented Lisa Wee.</p>\n<p><strong>Delivering AVEVA’s Environmental, Social and Governance (ESG) Goals</strong></p>\n<p>Research proves that companies are more likely to succeed and deliver strong returns if they create value for all their stakeholders – employees, customers, suppliers, and the wider society including the environment –not just the leadership teams. Consequently, ESG focuses on how companies serve society and how this impacts on current and future performance. Consideration of future trends is also critically important and should inherently include disruptive change that can have significant implications for a company’s future profitability or its very existence.</p>\n<p>“From addressing climate change to ensuring strong labor practices, talent management, product safety and data security, AVEVA fully recognizes the significance of the ESG aspects of business performance, including their impact on long‑term, sustainable value creation,” commented Craig Hayman, CEO AVEVA. “We continue to aspire to a world where economic growth supports environmental sustainability, with better living standards for the communities in which we and our customers operate. This mindset is shared by our team, and these key hires demonstrate that AVEVA is committed to supporting industrial transformation, through a culture that promotes diversity and inclusion in the workplace,” Hayman, concluded.</p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}