{"date": "2021-12-15 18:15:48.631000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3381.83, "close": 3377.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Dec 15, 2021</p></div><div class=\"tr-npp-lead\"><p><span>Amazon</span><a href=\"https://www.zacks.com/stock/quote/AMZN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AMZN</a> continues to dominate the global cloud computing space on the back of an increasing number of availability zones and regions served by Amazon Web Services (\"AWS\").This is evident from the company's latest opening of a region in Indonesia, located in Jakarta.Notably, the new region comprises three availability zones, which will aid AWS in delivering low latency and offering access to its robust cloud services portfolio to customers in Indonesia.Hence, the latest move is expected to aid the company in gaining traction among various customers, including developers, big companies, start-ups, developers, government organizations and non-profit organizations in the country.</p></div><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">Amazon.com, Inc. Revenue (TTM)</p><p> </p><p><a href=\"https://www.zacks.com/stock/chart/AMZN/fundamental/revenue-ttm?icid=chart-AMZN-fundamental/revenue-ttm\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. revenue-ttm</a> | <a href=\"https://www.zacks.com/stock/quote/AMZN?icid=chart-AMZN-fundamental/revenue-ttm\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. Quote</a> </p><p class=\"tr-npp-section-title\">Expanding Asia Pacific (APAC) Presence</p><p>The launch of AWS Asia Pacific (Jakarta) Region is in sync with Amazon's growing efforts toward expanding AWS in the APAC.Apart from the latest move, the company recently announced its intentions to set up an infrastructure region in Auckland, New Zealand, which will comprise three availability zones.The company is also planning to launch a second AWS region in India's Hyderabad by mid-2022. The region will also comprise three availability zones.The company is planning to set up a second AWS region in Australia's Melbourne, which is expected to be operative in the second half of 2022.AWS is planning to open an infrastructure region in Israel's Tel Aviv. The region is expected to open by 2023.Apart from these, the company's opening of the second region in Japan, located in Osaka, remains noteworthy.</p><p class=\"tr-npp-section-title\">Growth Prospects, Competitive Scenario</p><p>APAC has turned out to be one of the fastest-growing emerging cloud markets.Per a report by GlobalData, the cloud computing market in the APAC is expected to hit $191.8 billion by 2024, witnessing a CAGR of 7.7% between 2019 and 2024.We believe that Amazon is well-poised to capitalize on the immense growth prospects present in the APAC cloud market on the back of its increasing number of cloud regions and availability zones.However, the Zacks Rank #5 (Strong Sell) company is currently facing stiff competition from its peers like<span>Microsoft</span><a href=\"https://www.zacks.com/stock/quote/MSFT\" data-type=\"url\" class=\"tr-link\" translate=\"no\">MSFT</a> ,<span>Alphabet</span><a href=\"https://www.zacks.com/stock/quote/GOOGL\" data-type=\"url\" class=\"tr-link\" translate=\"no\">GOOGL</a> and<span>Alibaba</span><a href=\"https://www.zacks.com/stock/quote/BABA\" data-type=\"url\" class=\"tr-link\" translate=\"no\">BABA</a> , which are also leaving no stone unturned to expand their presence in the APAC region.You can see<span><a href=\"https://www.zacks.com/stocks/buy-list/?ADID=zp_1link&amp;ICID=zpi%20_1link\" data-type=\"url\" class=\"tr-link\" translate=\"no\">the complete list of today's Zacks #1 Rank (Strong Buy) stocks here</a> </span>.Notably, Microsoft is gearing up to open a cloud availability region in China, namely China North 3, which will mark the fifth of its kind in the country and the first comprising multiple availability zones.Further, Microsoft has plans to set up regions in Indonesia (Jakarta), Malaysia (Kuala Lumpur), New Zealand (Auckland) and Taiwan (Taipei). Currently, the company operates 13 Azure regions in the APAC.Alphabet's Google recently opened a cloud region in New Delhi, India. It also opened a region in Melbourne, Australia, in the middle of this year.At present, Google operates cloud regions in India, Australia, Singapore, Indonesia, South Korea, Japan, Taiwan and China.Meanwhile, Alibaba is hugely investing to expand its presence in the cloud market of the underlined region. The launch of Alibaba Cloud's third data center in Indonesia remains noteworthy.</p><p><span>5 Stocks Set to Double</span></p><p>Each was handpicked by a Zacks expert as the #1 favorite stock to gain +100% or more in 2021. Previous recommendations have soared +143.0%, +175.9%, +498.3% and +673.0%.</p><p>Most of the stocks in this report are flying under Wall Street radar, which provides a great opportunity to get in on the ground floor.</p><p><a href=\"https://www.zacks.com/registration/ultimatetrader/welcome/eoffer/4e87?add=1726&amp;adid=NEWSTEX_CONTENT_ZU_5S2DREPORT_ANALYSTBLOG_253_12152021&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1839705\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Today, See These 5 Potential Home Runs &gt;&gt;</a></p><p>Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.</p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=RPT_7BST_LP194&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1839705\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Click to get this free report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=AMZN&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1839705\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. (AMZN): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=MSFT&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1839705\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Microsoft Corporation (MSFT): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=GOOGL&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1839705\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Alphabet Inc. (GOOGL): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=BABA&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_253&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1839705\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Alibaba Group Holding Limited (BABA): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/stock/news/1839705/amazon-amzn-boosts-asia-pacific-reach-with-new-aws-region?cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_tech_sector-1839705\" data-type=\"url\" class=\"tr-link\" translate=\"no\">To read this article on Zacks.com click here.</a></p><p><a href=\"http://www.zacks.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Zacks Investment Research</a></p><p>The views expressed in any and all content distributed by Newstex and its re-distributors (collectively, the \"Newstex Authoritative Content\") are solely those of the respective author(s) and not necessarily the views of Newstex or its re-distributors. Stories from such authors are provided \"AS IS,\" with no warranties, and confer no rights. The material and information provided in Newstex Authoritative Content are for general information only and should not, in any respect, be relied on as professional advice. Newstex Authoritative Content is not \"read and approved\" before it is posted. Accordingly, neither Newstex nor its re-distributors make any claims, promises or guarantees about the accuracy, completeness, or adequacy of the information contained therein or linked to from such content, nor do they take responsibility for any aspect of such content. The Newstex Authoritative Content shall be construed as author-based content and commentary. Accordingly, no warranties or other guarantees are offered as to the quality of the opinions, commentary or anything else appearing in such Newstex Authoritative Content. Newstex and its re-distributors expressly reserve the right to delete stories at its and their sole discretion.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Zacks Investment Research</p></div>"}