{"date": "2022-01-13 19:42:33.785000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3304.14, "close": 3242.76}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>VERIZON SOURCING LLC (\"VZ-N\")\n- Verizon Business Announces BlueJeans Studio to Empower the\n- Creator Economy\n\n   Verizon Business announced BlueJeans Studio, a new all-in-one event\nproduction platform that gives creators the ability to easily and\naffordably create stunning, professional-grade live streams with just a few\nclicks. With easy video feed mixing, custom branding, and endless streaming\ncapabilities, brands can produce TV-quality content that helps drive\naudience engagement and elevates any virtual event experience.\n\n\"Virtual events have become a fundamental part of every business strategy,\nwhether that be for individual creators looking to build brand visibility\nor for enterprise teams working on communication, training or lead\ngeneration initiatives,\" said Chris Lewter, VP and GM, BlueJeans by\nVerizon. \"With the addition of Studio to provide premium production\nservices, combined with our leading event assist support team, BlueJeans\nEvents is the optimal solution to help brands of all sizes transform their\nvirtual events to really wow their audiences.\"\n\nThe COVID-19 pandemic gave a major boost to the creative economy, with more\nthan 50 million people worldwide now considering themselves to be creators,\naccording to SignalFire. But not all creators have the resources and tools\nnecessary to compete in today's crowded marketplace. The all new BlueJeans\nStudio brings powerful production tools to BlueJeans Events, giving\ncorporate and individual users--social influencers, creators, reporters and\nmarketers--the power to produce stunning, professional grade virtual events\nand live streams without any production or technical experience required.\nFrom the Studio producer dashboard, creators can easily create TV\nproduction-level events that engage and wow audiences, while helping to\nelevate their brand and expand their reach.\n\n\"As an industry leader in motorsports, Penske Entertainment (owner of the\nINDYCAR SERIES and the Indianapolis Motor Speedway) and Team Penske are\nalways looking for ways to innovate and drive success throughout our\ncorporate sponsorships,\" said Jonathan Gibson, Penske Corporation,\nExecutive Vice President of Marketing and Business Development. \"BlueJeans\nhas been a critical partner to what we do from a technology perspective,\nallowing us to collaborate cross-functionally and map out a clear virtual\nevents strategy. Using the BlueJeans platform to produce the first-ever\nvirtual drivers meeting the Saturday before the Indy500, and using\nBlueJeans to deliver a successful Partner Summit, allowed us to build\nstronger connections with partners and fans alike. We look forward to\nseeing how the platform further evolves to help us deliver even better\nexperiences and engagement in the years ahead.\"\n\nThose looking to maximize broadcast reach can live stream to Facebook,\nYouTube, Twitter, Twitch, RTMP destinations, and other streaming platforms\nsimultaneously and/or embed the live stream or pre-recorded event into a\nwebsite. For hybrid events, webinars and virtual trainings, on-air\ninterviews, broadcasts, corporate all-hands, influencer events, and more,\nBlueJeans Studio is the premier platform for live audience engagement. Key\nfeatures of BlueJeans Studio include:\n\n   *  No technical integration: BlueJeans Studio is web-based and built\ninto the Events platform to enable anyone to host, manage and create\nstunning events without any technical or AV support.\n   *  Ease of use: No production expertise required. A few simple clicks\ncreate beautiful, engaging video streams.\n   *  Cost Effective: Brands can save thousands compared to hiring\nproduction and AV support to improve the visual appeal of any event. Event\nplans start at $42 per month.\n   *  All-in-one event platform: Send invites, secure the event, get post\nevent analytics, and save unlimited recording hours.\n   *  Highest video quality: 1080p picture quality elevates the event and\nbrand.\n   *  Highlight more presenters: Capacity of up to 150 presenters--more\nthan any other event platform.\n   *  Host unlimited events: Monthly and annual plans allow users to host\nas many events as needed, rather than paying per event.\n\n   With no production or AV expertise required to create professional-grade\nlive streams or videos in 1080p, BlueJeans Studio brings the existing\nBlueJeans Events audience engagement tools and responses on screen to allow\npresenters to easily engage the audience with chat, Q&amp;A, and polls in\nreal-time and highlight audience comments and reactions on screen.\nProducers can also share uploaded videos, images, and screen shares during\nthe broadcast. For private events, producers can leverage BlueJeans Event's\nregistration features.\n\nFurthermore, the ability to add more presenters on screen with one click\nand change the onscreen layout creates a more polished event look meant to\nmimic TV production-grade broadcasting. Users can elevate their brand\nfurther using personalized logos, background and colors, ticker banners,\nname cards, lower third overlays and more to create engaging and buzzworthy\ncontent that can be recorded, edited and shared over and over again.\nLaunching as an included feature of BlueJeans Events, BlueJeans Studio will\nbe available coming soon at no extra cost to an Events subscription.\n\nLive streaming, virtual and hybrid events are here to stay--learn more\nabout how to make them sizzle with BlueJeans Studio and sign up for a\npreview today.\n\n   Verizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30,\n2000 and is one of the world's leading providers of technology and\ncommunications services. Headquartered in New York City and with a presence\naround the world, Verizon generated revenues of $128.3 billion in 2020. The\ncompany offers data, video and voice services and solutions on its\naward-winning networks and platforms, delivering on customers' demand for\nmobility, reliable network connectivity, security and control.\n\n   VERIZON'S ONLINE MEDIA CENTER: News releases, stories, media contacts\nand other resources are available at verizon.com/news. News releases are\nalso available through an RSS feed. To subscribe, visit\nwww.verizon.com/about/rss-feeds/.\n\nErin Cheever\nerin.dowling@verizon.com\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201200945.MNPRE2201202892-11091620220113</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}