{"date": "2021-09-30 20:56:49.520000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3639.0, "close": 3516.0}, "html": "<div class=\"storyContent\" lang=\"fr\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">Groupe Santé Andlauer annonce la clôture de l'acquisition de la totalité des actions d'Unité de Support Logistique (LSU) inc.</p>\n<p>TORONTO, le 1er mars 2022</p>\n<p>\n<span>\n<span>TORONTO</span>\n</span> , <span>le 1er mars 2022</span> /CNW/ - Groupe Santé Andlauer (TSX: AND) (« <span>AHG</span> » ou la « <span>Société</span> ») a annoncé aujourd'hui qu'elle avait complété l'acquisition déjà annoncée (l'« <span>Acquisition</span> ») de la totalité des actions en circulation d'Unité de Support Logistique ( <span>LSU</span> ) inc. (« <span>\n<span>LSU</span>\n</span> »).</p>\n<p>Le prix d'achat pour <span>LSU</span> s'est établi à environ 30 millions de dollars (sous réserve des ajustements de prix d'achat habituels) payable par l'émission de 154 639 actions avec droit de vote subalterne et le versement d'une somme d'environ 22,5 millions de dollars. AHG a financé la tranche en espèces du prix d'achat de l'Acquisition par une combinaison de liquidités disponibles et d'un prélèvement sur les facilités de crédit de la Société.</p>\n<p>Active depuis 2008, <span>LSU</span> est un prestataire tiers de services logistiques qui offre à des sociétés nationales et internationales ainsi qu'à des clients gouvernementaux des services de pharmacie spécialisée, d'entreposage, de distribution et de gestion de commandes à l'échelle du <span>Canada</span> dans les secteurs pharmaceutique, médical et biotechnologique. <span>LSU</span> est également le distributeur exclusif d'agents immunisants pour le système de santé public du Québec.</p>\n<p>« Nous sommes heureux d'accueillir officiellement l'équipe de <span>LSU</span> au sein du Groupe Santé Andlauer », a déclaré <span>Michael Andlauer</span> , chef de la direction d'AHG.</p>\n<p>M <span>me</span> Johanne Bissonnette, présidente de <span>LSU</span> , a déclaré ce qui suit : « Nous sommes fiers de nous joindre à l'équipe de Andlauer. Nous nous réjouissons à l'idée de poursuivre notre croissance à titre de nouveau membre de la très réputée plateforme AHG. »</p>\n<p>\n<span>Conseillers</span>\n</p>\n<p>Goodmans LLP a agi en qualité de conseiller juridique auprès d'AHG, et JGW avocats et conseillers d'affaires inc. a agi en qualité de conseiller juridique auprès de <span>LSU</span> .</p>\n<p>\n<span>À propos de <span>LSU</span>\n</span>\n</p>\n<p>\n<span>LSU</span> est un prestataire tiers de services logistiques (« 3PL ») de premier plan exclusivement engagé dans les secteurs pharmaceutique, médical et biotechnologique et elle est également un distributeur exclusif d'agents immunisants pour le système de santé public du Québec. La mission de <span>LSU</span> est d'intégrer des solutions logistiques optimales en offrant une expertise et des services de qualité dans les secteurs du service à la clientèle, de l'entreposage et de la distribution, qui sont taillés sur mesure pour répondre aux besoins de tous les clients. Pour obtenir de plus amples renseignements sur LSU, veuillez visiter le site Web suivant : <a href=\"https://c212.net/c/link/?t=0&amp;l=fr&amp;o=3459808-1&amp;h=1425594682&amp;u=https%3A%2F%2Fwww.logisticslsu.com%2Ffr%2F&amp;a=http%3A%2F%2Fwww.logisticslsu.com%2Ffr\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.logisticslsu.com/fr</a> .</p>\n<p>\n<span>À propos d'AHG</span>\n</p>\n<p>AHG est une importante société de gestion de la chaîne d'approvisionnement en pleine croissance qui offre au secteur des soins de santé une solide plateforme de prestataires tiers de services logistiques adaptés et de solutions de transport spécialisé (3PL). Les services des prestataires tiers de services logistiques de la Société comprennent des solutions sur mesure en matière de logistique, de distribution et d'emballage à l'intention des fabricants de produits de soins de santé du <span>Canada</span> . Avec ses solutions de transport spécialisé au <span>Canada</span> , AHG offre aux clients du secteur des soins de santé un service de transport à guichet unique avec des services d'expédition de fret aérien, de transport terrestre, de livraison spécialisée et de transport sur le dernier kilomètre. Grâce à ses gammes de services complémentaires, qui sont offerts dans l'ensemble de son réseau de distribution national, AHG peut répondre efficacement et de façon intégrée à l'ensemble des besoins spécialisés en matière de chaîne d'approvisionnement de ses clients. La Société offre également, dans les 48 États continentaux des États-Unis, des services de transport terrestre spécialisé destinés principalement au secteur des soins de santé. Pour obtenir de plus amples renseignements sur AHG, veuillez visiter le site Web suivant : <a href=\"https://c212.net/c/link/?t=0&amp;l=fr&amp;o=3459808-1&amp;h=187005994&amp;u=http%3A%2F%2Fwww.andlauerhealthcare.com%2Ffr%2F&amp;a=www.andlauerhealthcare.com%2Ffr\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.andlauerhealthcare.com/fr</a> .</p>\n<p>\n<span>Information prospective</span>\n</p>\n<p>\n<span>Le présent communiqué renferme de l'« information prospective » et des « énoncés prospectifs » (collectivement, l'« information prospective »), au sens des lois sur les valeurs mobilières applicables, notamment des énoncés relatifs aux avantages prévus de l'Acquisition. Dans certains cas, on reconnaît l'information prospective à l'emploi de verbes ou d'expressions comme «</span>\n<span>planifier</span>\n<span>», «</span>\n<span>cibler</span>\n<span>», «</span>\n<span>croire</span>\n<span>», «</span>\n<span>s'attendre</span>\n<span>à</span>\n<span>», «</span>\n<span>être susceptible</span>\n<span>de</span>\n<span>», «</span>\n<span>occasion</span>\n<span>», «</span>\n<span>se produire</span>\n<span>», à la forme affirmative ou négative, au futur ou au conditionnel, et à l'emploi de termes comme «</span>\n<span>budget</span>\n<span>», «</span>\n<span>estimation</span>\n<span>», «</span>\n<span>perspective</span>\n<span>», «</span>\n<span>prévision</span>\n<span>», «</span>\n<span>projection</span>\n<span>», «</span>\n<span>stratégie</span>\n<span>», «</span>\n<span>avis</span>\n<span>», «</span>\n<span>intention</span>\n<span>», «</span>\n<span>possibilité</span>\n<span>», «</span>\n<span>éventualité</span>\n<span>» ou d'autres termes semblables. En outre, les énoncés faisant état de nos attentes, de nos intentions, de nos prévisions ou d'autres faits ou événements futurs renferment de l'information prospective.</span>\n</p>\n<p>\n<span>Les énoncés qui renferment de l'information prospective ne portent pas sur des faits antérieurs, mais indiquent plutôt les attentes, les estimations et les projections de la direction à l'égard des événements ou des circonstances futurs. La présente information prospective est fondée sur nos opinions, nos estimations et nos hypothèses qui, bien que la Société les considère appropriées et raisonnables à la date du présent communiqué, comportent des risques et des impondérables, connus et inconnus, et est soumise à d'autres facteurs qui pourraient faire en sorte que les résultats, le niveau d'activité, le rendement ou les réalisations réels diffèrent sensiblement de ceux qui sont exprimés ou sous-entendus dans cette information prospective, notamment les éléments suivants : le risque que la société acquise n'offre pas un rendement conforme aux attentes et aux antécédents; le risque que la société acquise ne soit pas intégrée de façon efficace ou que les synergies escomptées ne soient pas réalisées; ainsi que les autres risques qui sont plus amplement détaillés à la rubrique « Facteurs de risque » de notre notice annuelle, qu'il est possible de consulter sous notre profil dans SEDAR, à l'adresse <a href=\"https://c212.net/c/link/?t=0&amp;l=fr&amp;o=3459808-1&amp;h=3364941070&amp;u=http%3A%2F%2Fwww.sedar.com%2F&amp;a=www.sedar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.sedar.com</a> . Si l'un ou l'autre de ces risques ou de ces impondérables se concrétisait, ou si les opinions, les estimations ou les hypothèses qui sous-tendent l'information prospective se révélaient inexactes, les résultats réels ou les événements futurs pourraient différer considérablement de ceux qui sont prévus dans l'information prospective. Bien que nous ayons tenté de repérer les facteurs de risque importants qui pourraient faire en sorte que les résultats réels diffèrent considérablement de ceux qui sont exprimés dans l'information prospective, d'autres facteurs de risque dont nous n'avons actuellement pas connaissance et que nous estimons actuellement être négligeables pourraient également faire en sorte que les résultats réels ou les événements futurs diffèrent considérablement de ceux qui sont exprimés dans cette information prospective.</span>\n</p>\n<p>\n<span>Rien ne garantit que les énoncés prospectifs s'avéreront exacts, étant donné que les issues et les résultats réels pourraient différer considérablement des issues et des résultats mentionnés dans ces énoncés prospectifs. Par conséquent, le lecteur ne doit pas se fier indûment à ces énoncés prospectifs. De plus, ces énoncés prospectifs sont donnés à la date du présent communiqué et, sauf indication contraire expresse dans les lois applicables, AHG ne s'engage pas à les mettre à jour ou à les modifier publiquement, que ce soit en raison de nouveaux renseignements, d'événements futurs ou d'autres éléments.</span>\n</p>\n<p>\n<span>Toute l'information prospective qui figure dans le présent communiqué est présentée expressément sous réserve de la mise en garde qui précède.</span>\n</p>\n<p>SOURCE Andlauer Healthcare Group Inc.</p>\n<p>Consulter le contenu original : <a href=\"http://www.newswire.ca/fr/releases/archive/March2022/01/c1366.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/fr/releases/archive/March2022/01/c1366.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}