{"date": "2021-09-30 11:00:01.161000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3647.0, "close": 3600.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Schlumberger and AVEVA Announce Agreement to Advance Digital Solutions for Oil &amp; Gas Production Operations</b>\n</p><p class=\"bwalignc\">\n<span>Industry leaders to integrate AVEVA PI System with Agora edge technologies and cloud-based production solutions enabled by the DELFI environment from Schlumberger</span>\n</p><p>\nSchlumberger and AVEVA today announced an agreement to integrate edge, AI and cloud digital solutions to help operators optimize oil and gas production. The companies will work together to streamline how energy operators acquire, process and action field data for enhanced wellsite efficiency and performance. Initial focus of the collaboration includes linking edge systems to applications in the DELFI* cognitive E&amp;P environment to better manage equipment health and optimize performance.\n</p><p>\n“This partnership brings together our edge and cloud solutions with the AVEVA PI System™ to seamlessly liberate access to data accelerating insights and action,” said Rajeev Sonthalia, president, Digital &amp; Integration, Schlumberger. “By integrating our domain expertise, secure edge technology and digital applications in the DELFI environment with AVEVA, we will enable customers to increase efficiency and transform their production operations.”\n</p><p>\n“Digital transformation of critical infrastructure requires a strategic vision that transcends technology to drive efficiency, achieve profitable business outcomes and deliver sustainability,” said Andrew McCloskey, Chief Technology Officer, AVEVA. “Recent macroeconomic events have highlighted the need for agility throughout all industries. Our collaboration with Schlumberger will drive operational agility and engineering efficiency, while also enabling swifter delivery of new products and services to make assets and operations run more smoothly.”\n</p><p>\nThe collaboration will bring to market the IoT and cloud capabilities of both companies. This includes the data management platform capabilities of the <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.osisoft.com%2Fpi-system&amp;esheet=52500737&amp;newsitemid=20210930005462&amp;lan=en-US&amp;anchor=AVEVA+PI+System&amp;index=1&amp;md5=b21fa29e99a77ccab6455dd316dfda91\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AVEVA PI System</a> and Schlumberger domain expertise and analytics capabilities provided by <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.agoraiot.com%2F&amp;esheet=52500737&amp;newsitemid=20210930005462&amp;lan=en-US&amp;anchor=Agora*+edge+AI+and+IoT+solutions&amp;index=2&amp;md5=e64a5c7741b18bd5a2f74e67577cd978\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Agora* edge AI and IoT solutions</a> and the <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.software.slb.com%2Fdelfi&amp;esheet=52500737&amp;newsitemid=20210930005462&amp;lan=en-US&amp;anchor=DELFI+environment&amp;index=3&amp;md5=612aabeaff3354842b3a1875a06ae06a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">DELFI environment</a>. The companies also plan joint technology integrations, sales and service support, and go-to-market activity.\n</p><p>\n<b>About Schlumberger</b>\n</p><p>\nSchlumberger (SLB: NYSE) is a technology company that partners with customers to access energy. Our people, representing over 160 nationalities, are providing leading digital solutions, and deploying innovative technologies to enable performance and sustainability for the global energy industry. With expertise in more than 120 countries, we collaborate to create technology that unlocks access to energy for the benefit of all.\n</p><p>\nFind out more at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.slb.com&amp;esheet=52500737&amp;newsitemid=20210930005462&amp;lan=en-US&amp;anchor=www.slb.com&amp;index=4&amp;md5=f74cde5e72b0601056036405567b8845\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.slb.com</a>.\n</p><p>\n<b>About AVEVA</b>\n</p><p>\nAVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence. AVEVA’s comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries. Learn more at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.aveva.com&amp;esheet=52500737&amp;newsitemid=20210930005462&amp;lan=en-US&amp;anchor=www.aveva.com&amp;index=5&amp;md5=fb8e3e04442b2e04bc09962cea8da310\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.aveva.com</a>.\n</p><p>\n<b>Cautionary Statement Regarding Forward-Looking Statements</b>\n</p><p>\nThis press release contains “forward-looking statements” within the meaning of the U.S. federal securities laws — that is, statements about the future, not about past events. Such statements often contain words such as “expect,” “may,” “can,” “estimate,” “intend,” “anticipate,” “will,” “potential,” “projected\" and other similar words. Forward-looking statements address matters that are, to varying degrees, uncertain, such as forecasts or expectations regarding the deployment of, or anticipated benefits of, digital technologies and partnerships. These statements are subject to risks and uncertainties, including, but not limited to, the inability to recognize intended benefits from digital strategies, initiatives or partnerships; and other risks and uncertainties detailed in Schlumberger’s most recent Forms 10-K, 10-Q and 8-K filed with or furnished to the U.S. Securities and Exchange Commission. If one or more of these or other risks or uncertainties materialize (or the consequences of such a development changes), or should underlying assumptions prove incorrect, actual outcomes may vary materially from those reflected in these forward-looking statements. Statements in this press release are made as of the date of this release, and Schlumberger disclaims any intention or obligation to update publicly or revise such statements, whether as a result of new information, future events, or otherwise.\n</p><p>\n*Mark of Schlumberger\n</p><p>\nCopyright © 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20210930005462r1&amp;sid=ucdp4&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjEwOTMwMDA1NDYycjEmc2lkPXVjZHA0JmRpc3Rybz1ueCZsYW5nPWVu&amp;key=85a2bb99d16e9010ad4b9939c01ab75bdf213e93f26f8a89e86e4bd81fd3dd184b8d66324314962229f96d3fe47d7561240ece4f447fca4189d6793c5cc9e8ce\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20210930005462/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20210930005462/en/</a></span></p><p>\n<b>Media \n</b><br/>Giles Powell – Director of Corporate Communication, Schlumberger Limited\n<br/>Tel: +1 (713) 375-3494\n<br/><a href=\"mailto:communication@slb.com\" data-type=\"email\" translate=\"no\">communication@slb.com</a>\n</p><p>\nHilary Cecconi – Head of External Communications, AVEVA\n<br/>Tel: +1 (919) 802-7787\n<br/><a href=\"mailto:external.communications@aveva.com\" data-type=\"email\" translate=\"no\">external.communications@aveva.com</a>\n</p><p>\n<b>Investors \n</b><br/>Ndubuisi Maduemezia – Vice President of Investor Relations, Schlumberger Limited\n<br/>Joy V. Domingo – Director of Investor Relations, Schlumberger Limited\n<br/>Tel: +1 (713) 375-3535\n<br/><a href=\"mailto:investor-relations@slb.com\" data-type=\"email\" translate=\"no\">investor-relations@slb.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SCHLUMBERGER</p></div>"}