{"date": "2021-11-05 19:31:18.301000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3477.0, "close": 3488.98}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Mimi's Rock has signed a new partnership with Teikametrics, a SaaS based company to optimize and better connect with customers across Amazon and Walmart marketplaces.</p><p>Teikametrics' company software utilizes artificial intelligence to set and adjust bids based on individual goals for each product in a brand's catalog. To keep up with the changing dynamics of online marketplaces, the software also finds and targets new high-performing keywords in each marketplace, and layers on competitive intelligence so brands know where they rank versus their competitors on key search pages.\"With three best-selling brands on Amazon and expansion into Walmart online, it's imperative we have the best technology and analytics available to help us reach more consumers with our top products\", said David Kohler, CEO of Mimi's Rock. \"We are excited to work with Teikametrics to get our best sellers in front of more interested people so they can benefit from our health and skincare lines.\"\"The team at Mimi's Rock understands that driving growth and staying ahead of the competition within the health and wellness category is about adjusting dynamically to market trends. Teikametrics technology and services are designed to do just that,\" said Chris Gika, Senior Director of Sales at Teikametrics  \"We're excited to help Mimi's Rock brands reach new heights across Amazon and Walmart.\"Mimi's Rock's mission is to help people be the best version of themselves and this partnership with Teikametrics will support the health and wellness of people everywhere.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}