{"date": "2021-11-10 14:05:10+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><span>\n              <p>NEW YORK, Nov 10 (IFR) - <strong>Amazon</strong>-backed electric vehicle maker <strong>Rivian Automotive</strong> raised a greater-than-expected US$11.9bn from its Nasdaq IPO, the biggest new issue in the US this year and the largest since <strong>Alibaba</strong>’s NYSE debut in 2014.</p>\n              <p>Employing their so-called “portal” or hybrid auction/direct order entry process to execute the offering, a syndicate led by <span>Morgan Stanley</span>, <span>Goldman Sachs</span> and <span>JP Morgan</span> late Tuesday priced the sale of 153m Rivian shares at US$78.00, US$4.00 above the top of the US$72-$74 range.</p>\n              <p>There was little doubt the deal was headed for a strong outcome given Rivian already upped the range from US$57-$62 late last week, though Tuesday's 12% share price slump in the price of EV darling <strong>Tesla </strong>was ill-timed.</p>\n              <p>Not only did the final price come well above range but the syndicate also upped the number of shares by 13% from 135m at launch. The final terms value the 12-year-old company at more than US$60bn in enterprise value terms. </p>\n              <p>Rivian had already secured US$5bn of cornerstone demand at launch from a high-powered group of investors, including existing major shareholders Amazon and<strong> T. Rowe Price</strong>, as well as Coatue Management, Franklin Templeton, Capital Research Global Investors, Dan Loeb’s Third Point, <strong>Blackstone</strong>, Dragoneer and Soros Fund Management.</p>\n              <p>Billed as the next Tesla, Rivian delivered its first all-electric pickup truck in September and expects to begin producing and delivering both its SUV and electric commercial delivery van by the end of the year.</p>\n              <p>The company has 55,400 pre-orders it expects to fill by the end of 2023 from its factory in Normal, Illinois. It also has an order for 100,000 delivery vans, the biggest EV order ever, from Amazon, which is also a 20% shareholder.</p>\n              <p>Rivian shares will begin trading on Nasdaq today under the ticker symbol “RIVN.”</p>\n              <p>(Anthony Hughes; Editing by Stephen Lacey and Jack Doran)</p>\n              <p>((anthony.hughes@refinitiv.com; (646) 552-4852))</p>\n            </span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © Refinitiv 2021. Click For Restrictions - https://www.refinitiv.com/en/policies/copyright-notice</p></div>"}