{"date": "2022-01-17 14:00:30.381000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">DALLAS, Jan. 17, 2022</p></div>\n\n<div class=\"xn-content\">\n\n<p><span>With only 364 Advanced Consulting Partners in US, out of an ecosystem of about 100,000 partners from more than 150 countries, the company now finds itself as part of an elite group of partners.</span></p>\n  <p><span class=\"xn-location\">DALLAS</span>, <span class=\"xn-chron\">Jan. 17, 2022</span> /PRNewswire/ -- <u><a href=\"https://successive.tech/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Successive Technologies</a></u>, a next-gen (CMMI Level-3) technology consulting and services company headquartered in <span class=\"xn-location\">Texas</span>, is delighted to be recognised as an Advanced Consulting Partner in the Amazon Web Service Partner Network. Successive has more than a decade of experience in managing mission-critical applications, and this recognition serves as a testimony to their capabilities in Cloud &amp; DevOps, Kubernetes and other high-end technologies on AWS. </p>\n<div id=\"prni_dvprnejpg31ccleft\" style=\"WIDTH:100%;TEXT-ALIGN:left\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img align=\"middle\" alt=\"Successive_Technologies_Logo\" border=\"0\" id=\"prnejpg31ccleft\" src=\"https://mma.prnewswire.com/media/1312400/Successive_Technologies_Logo.jpg\" title=\"Successive_Technologies_Logo\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMTMxMjQwMC9TdWNjZXNzaXZlX1RlY2hub2xvZ2llc19Mb2dvLmpwZw==&amp;key=86f54ac8285a667625ed8e8b64ed0193b5a3ed27a35452be5133e1fce366ae19f21422c357d315cd67d970997d6630572c2770daaf230e34c7bb891c5673c744\"/></div></div></div><p>The AWS partnership is a direct result of the company's continuous efforts to expand and strengthen capabilities in design, architecture, migration, deployment, and management of complex cloud architectures on the AWS cloud. Some of the key sectors that they have delivered solutions for includes Insurance, Health Care, ISV, Manufacturing, Retail &amp; Commerce, Saas &amp; PaaS Products, Logistics and Financial Services. </p>\n<p>Commenting on the achievement, <span class=\"xn-person\">Sid Pandey</span>, Founder &amp; CEO, Successive Technologies, said, \"We are thrilled that AWS recognizes our technical competencies of cloud and understanding of the multiple domains. We are continually striving to support clients with solutions that are innovative and meet the ever-evolving business needs. This acknowledgment is a testament to our deep experience in working with multiple industries across the world.\"</p>\n<p>Successive Technologies has a strong team of specialists and experts in Cloud Platform, Application Modernization, Cloud Native, DevOps, Cloud Security, Data Engineering, and SRE catered over 30+ cloud solutions implementations. </p>\n<p>AWS runs several competency programs to identify consulting and technology partners across the world with deep industry experience and expertise. The bar set to be recognised as an Advanced Consulting Partner is very high and requires applicants to go through a meticulous process of examination of technical capabilities, certifications, accreditations, and an overall comprehensive evaluation of all aspects of the business. This recognition will act like a booster shot to demonstrate its strong experience and the company is already preparing to achieve more milestones to strengthen its ties further with AWS.</p>\n<p>Leveraging our strong experience on AWS Cloud, we are helping clients from public and other growing sectors with the most advanced enterprise cloud solutions. I hope this will further deepen our relationship with AWS and open new doors for us,\" added Sid.</p>\n<p><b>About </b><b>Successive Technologies</b></p>\n<p>Founded in 2012, Successive Technologies specializes in digital transformation. With an innovative approach, a unique perspective to problem solving, and a digital native mindset, they empower clients to build a strong future-proof foundation. It also helps them provide enhanced customer experiences with speed and cost efficiencies. </p>\n<p>Successive has been recognized by Deloitte as one of the Top 50 fastest growing technology companies for three years in a row. They have a global 800+ strong workforce that caters to the customers across the globe.</p>\n<p>For more information, please write to <u><a href=\"mailto:Marketing@successive.tech\" data-type=\"email\" translate=\"no\">Marketing@successive.tech</a></u> or visit <a href=\"http://www.successive.tech/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.successive.tech</a> </p>\n<p>Logo: <a href=\"https://mma.prnewswire.com/media/1312400/Successive_Technologies_Logo.jpg\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://mma.prnewswire.com/media/1312400/Successive_Technologies_Logo.jpg</a> </p>\n</div>\n<div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 PR Newswire Association,LLC. All Rights Reserved.</p></div>"}