{"date": "2021-04-05 14:59:02.774000+00:00", "ticker": "AAF", "mrkt_info": {"open": 82.25, "close": 84.7}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Lagos [Nigeria], April 2 (ANI): Airtel Africa has announced the signing of an agreement under which Mastercard will invest 100 million dollars in Airtel Mobile Commerce BV.</p><p>Lagos [Nigeria], April 2 (ANI): Airtel Africa has announced the signing of an agreement under which Mastercard will invest 100 million dollars in Airtel Mobile Commerce BV.</p></div><div class=\"tr-npp-body\"><p>AMC BV is currently the holding company for several Airtel Africa's mobile money operations and is intended to own and operate the mobile money businesses across all of Airtel Africa's 14 operating countries.</p><p>The transaction values Airtel Africa's mobile money business at 2.65 billion dollars on a cash and debt free basis. Mastercard will hold a minority stake in AMC BV upon completion of the transaction with Airtel Africa continuing to hold the majority stake.</p><p>Alongside the investment, the Group and Mastercard have extended commercial agreements and signed a new commercial framework which will deepen their partnerships across several geographies and areas including card issuance, payment gateway, payment processing, merchant acceptance and remittance solutions.</p><p>Following the announcement on March 18 of 200 million dollars investment in AMC BV by TPG's The Rise Fund and the sale of Group's telecommunication towers companies in Madagascar and Malawi on March 23, the transaction is a continuation of the Group's pursuit of strategic asset monetisation and investment opportunities.</p><p>Airtel Africa aims to continue to monetise its mobile money business with minority investments up to a total of 25 per cent of the issued share capital of AMC BV, and to explore the potential listing of the mobile money business within four years.</p><p>The proceeds from the transaction will be used to reduce Group debt and invest in network and sales infrastructure in the respective operating countries.</p><p>\"We have a clear strategy to continue to drive sustainable long-term growth in Airtel Money with a focus on assured float availability, distribution expansion and increased usage cases for our customers,\" the company said in a statement. (ANI)</p><p>Copyright © 2021 aninews.in All rights reserved. Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SyndiGate. All Rights Reserved.</p></div>"}