{"date": "2021-11-06 22:06:29.950000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3518.99, "close": 3576.23}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>Hit play on the player above to hear the podcast and follow along with the transcript below.</span><span>This transcript was automatically generated, and then edited for clarity in its current form. There may be some differences between the audio and the text.</span> </p><p><span><span>More:</span> Daily news, true crime, and more USA TODAY podcasts</span> </p></div><div class=\"tr-npp-body\"><p>Hey there, listeners, it's Brett Molina. Welcome back to Talking Tech. So as you all know, with smartphones and tablets, we're packing what is essentially a digital Swiss army knife. It is a device that does everything. We read our emails, we check our social media accounts, we browse on the web. We stream video, TV shows, movies, what have you. We take pictures, we play games. We do a lot. So it's really fascinating when you come across a device like the Kindle Paperwhite, which is the latest e-reader from Amazon, and it really only does one thing. And that is, allows you to read books. And it seems strange to want to buy a device just for one thing. But in the case of the Paperwhite, I feel like it proves that it's okay if you own a device that does one thing, as long as it does that one thing really well.</p><p>I write about this on tech.usatoday.com. I got the chance to try out the Signature Edition of the Kindle Paperwhite for about a week or so now. I really enjoy it. I was honestly skeptical about it at first because, again, I just felt like, \"I have a phone, I can read on my phone.\" But I feel like the way the Paperwhite is built, it just feels like such a nicer reading experience. So much so, I just feel so much better reading books on a Paperwhite, than reading on my phone. And I'll explain why in a little bit, but let's talk about the Paperwhite and what it brings.</p><p>There's two versions of it. There's a standard version, and then there's the Signature version of the Paperwhite, which was the model that I got to check out. It has a larger display, it's 6.8 inches. It's brighter too, according to Amazon, and it's glare free, which is great if, say, you're outside, you're on the beach, and you're reading. You don't have to worry about the sun interfering with you trying to read your book. It's also really light. That was the thing that really shocked me. It's a very light device. It's light, and the screen is a really good size, but it doesn't feel really big. I was able to fit it in my pants pocket, which I was really shocked by for an e-reader. You can carry an entire library on this device and I got it to fit in my pocket. It was really impressive.</p><p>The setup is straightforward. If you have a smartphone, you can download the Kindle app and you can set it up there. So you go through the process of basically putting in your account information, setting that up, and then you go back to the Paperwhite, and you have one or two more steps maybe, and then you're ready to go.</p><p>Like previous versions of the Paperwhite, and also a lot of Kindle e-readers going years and years back, it features an E Ink display. The content is black and white. The display also works a little bit differently than a smartphone screen. We're used to that really smooth scroll when you go up and down a smartphone screen. If you've never owned a Kindle or a Paperwhite or any device with an E Ink display, it doesn't really move like that. It almost feels like you're flipping a page when you scroll, as opposed to how you just very smoothly move your finger up and down to move up and down the screen.</p><p>The big change with the Paperwhite though, is they've upgraded the reading experience. They have a menu now. They have a system now where it's much easier to jump into certain settings, or if you want to jump back to your library, as you're reading a book. What you can do is you can swipe down from the top of the screen and it'll pull up a menu. And so you can pull up modes like dark mode. This was great for me, if I was reading before bed, I could flip to dark mode very quickly, and just get right back to my book. There's also a warm light function too, where you can have the screen display warmer colors, which you probably have on your iPhone and other smartphones, where during certain hours of the night, it takes away a lot more of the blues and it has just a lot of warmer colors. So you can get to all that just from that swipe. It's really nice.</p><p>You can also tap on the screen as well, near the top, and it'll pull up a main menu type place. And you can get to a lot of the other features of a Paperwhite, like the X-Ray where you can look up certain details about a book. You can look up specific words to learn their meaning. Or if you want to just head back to your library, say, you have gotten to a certain place in your book and you want to jump in and read something else. You can just tap on the top of that screen and head right back.:</p><p>The Signature Edition costs about $50 more. The standard starts at $139.99 and the Signature Edition is $189.99. The Signature Edition has wireless charging. It also has a sensor that'll automatically adjust brightness, which is really nice. So if you go from different lighting backgrounds, as you're reading, it'll adjust accordingly. The Signature Edition also has 32GB of storage. The standard has 8GB of storage. One thing that both of these devices have, and I think this is another big selling point as well, Amazon says these Paperwhites pack up to 10 weeks of battery life. That is not a misspoken anything, 10 weeks. That is a really long time. I had this fully charged when I started, I was reading a bunch of books. I think I was at about 85% after the week. So you get a ton of battery life out of this. You can also charge the Paperwhite from zero to full in about two and a half hours.</p><p>So again, I wasn't too sure about it because you can just read off this, that's all you really do with it. But the fact that it has made it so pleasant and so much more fun. I like the fact that I can just read and I don't have to worry about notifications popping up on my phone, or someone's texting me, or there are all these different little distractions. It just is so much more pleasant. I think the size of it feels perfect. The screen size is just ideal for reading a book. It feels more comfortable. It feels more enjoyable. If you're someone that really loves to read books, I would highly recommend getting this just for this experience. You can carry so many books on it and it saves your battery on your phone. And again, you get a really great device for reading.</p><p>Listeners, let's hear from you. Do you have any comments, questions, or show ideas? Do you own a Kindle Paperwhite or any Kindle? Let me know what you think. I'm curious to what your thoughts are. Also, do you have any tech problems you want us to try to address? You can find me on Twitter @brettmolina23. Please don't forget to subscribe and rate us, or leave a review on Apple Podcast, Spotify, Stitcher, anywhere you get your podcasts. And don't forget, if you want tech news delivered straight to your inbox, subscribe to the Talking Tech newsletter. You can do that at newsletters.usatoday.com.</p><p>You've been listening to Talking Tech. We'll be back tomorrow with another quick hit from the world of tech.</p><p><span>This article originally appeared on USA TODAY: Amazon launches a new Kindle Paperwhite: Talking Tech podcast</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}