{"date": "2022-02-26 09:03:17+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3027.16, "close": 3071.26}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Corrects spelling of stores in paragraph 5, adds dropped letter in headline</p><p class=\"tr-by\">By Aditya Kalra</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW DELHI, Feb 26 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>India's top retailer, Reliance, will take the operation of at least 200 stores of Future Retail <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FRTL.NS\" data-type=\"ric\" data-ric=\"FRTL.NS\" translate=\"no\" dir=\"ltr\">FRTL.NS</a>, which failed to make lease payments due to Reliance, two people with direct knowledge of the matter told Reuters on Saturday.</p><p>Since 2020, Reliance has failed to close a $3.4 billion deal to acquire the retail assets of Future, whose warring partner Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> has successfully blocked the transaction legally by citing violation of some contracts. Future denies any wrongdoing.</p><p>Future, Reliance and Amazon did not immediately respond to requests for comment. </p><p>The takeover of stores by Reliance signals Future's worsening financial situation as its retail assets sale remains blocked due to legal battles. Future in January challenged its lenders in India's Supreme Court to avoid facing insolvency proceedings over missing bank payments, citing its dispute with Amazon. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2U50C9\" data-type=\"storyId\" data-story-id=\"nL1N2U50C9\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Future - which has more than 1,700 outlets, including the popular Big Bazaar stores - has been unable to make lease payments for some of its outlets. As a result, Reliance transferred the leases of some stores to its name and sublet them to Future to operate the stores, the sources said.</p><p>As Future failed to make the payments, Reliance has decided to run and rebrand about 200 outlets that would otherwise be closed, they said.</p><p>\"Over 200 stores will transition to Reliance stores,\" said one source, who asked not to be named as the details of the plan are not public.</p><p>In a letter seen by Reuters, Reliance offered Future employees at these stores new jobs on the same terms. \"We welcome you to join our organization,\" it reads.</p><p>Amazon has argued that Future violated the terms of a 2019 deal the companies signed when the U.S. giant invested $200 million in a Future unit. Amazon's position has been backed by a Singapore arbitrator and Indian courts.</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Aditya Kalra in New Delhi; Editing by William Mallard)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:aditya.kalra@tr.com\" data-type=\"email\" translate=\"no\">aditya.kalra@tr.com</a> ; +91-11-49548021; Twitter <a href=\"https://twitter.com/adityakalra\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/adityakalra</a>; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-INDIA/FUTURE-RELIANCE (CORRECTED, PIX)</p></div>"}