{"date": "2021-10-28 11:53:23+00:00", "ticker": "AAF", "mrkt_info": {"open": 99.0, "close": 110.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Duncan Miriri</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NAIROBI, Oct 28 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Airtel Africa <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAF.L\" data-type=\"ric\" data-ric=\"AAF.L\" translate=\"no\" dir=\"ltr\">AAF.L</a> expects a boost from growing demand for mobile broadband and phone-based financial services, its chief executive said on Thursday, after posting rapid growth in first-half earnings.</p><p>The telecoms firm, which operates in 14 African markets including Nigeria and Kenya, said revenue grew 27.6% on a constant currency basis in the six months to the end of September. </p><p>Earnings before interest, taxation and depreciation, a key earnings measure for telecom operators, jumped 38.5% in the same period.</p><p>The growth trajectory will continue, CEO Segun Ogunsanya told Reuters after the results were released, driven by demand from a fifth of Africa's population that still has no access to mobile broadband.</p><p>\"Most of these folks are mobile first, mobile only generation. They require mobile broadband to participate fully in the digital world,\" he said, referring to the continent's generally youthful population.</p><p>The provision of fourth generation (4G) internet network in its markets has been a key driver of revenue growth, Ogunsanya said.</p><p>Mobile financial services, including cash transfers and payments, has also been fuelling growth.</p><p>\"More than half of adults in Africa don't have bank accounts. That shows the scope available in driving the mobile money business,\" he said.</p><p>In Nigeria, which is Airtel's biggest market, the firm has applied for a licence to offer financial services, from the central bank.</p><p>\"It is one of our key objectives, so it is especially important for us,\" Ogunsanya said, adding said that they were in \"constant dialogue\" with the regulator.</p><p>Nigeria has been leaning towards a bank-led model for introducing mobile financial services, as opposed to countries like Kenya, where telecom operators like Safaricom lead the way, African telecom executives say.</p><p>Airtel plans to cut its net greenhouse gas emissions to zero before 2050, Ogunsanya said, and they will be requiring their suppliers, including cellular towers, to comply with the plan.</p><p>\"We are convinced it is the right thing to do. It is the best thing to do for the environment,\" he said. </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Duncan Miriri; Editing by Kirsten Donovan)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:duncan.miriri@thomsonreuters.com\" data-type=\"email\" translate=\"no\">duncan.miriri@thomsonreuters.com</a> ; Tel: +254 20 4991239; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://duncan.miriri.thomsonreuters.com@reuters.net\">duncan.miriri.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AFRICA-AIRTEL/ (TV, PIX)</p></div>"}