{"date": "2021-11-07 20:43:29.235000+00:00", "ticker": "AAF", "mrkt_info": {"open": 122.5, "close": 131.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Airtel Africa and UNICEF announced a five-year pan-African partnership to help accelerate the roll-out of digital learning through connecting schools to the internet and ensuring free access to learning platforms across 13 countries. By providing equal access to quality digital learning, particularly for the most vulnerable children, the partnership will help to ensure that every child reaches their full potential.</p><p>Airtel Africa, a leading provider of telecommunications and mobile money services in Africa, is the first African private sector partner to make a multimillion-dollar commitment to ?Reimagine Education?, a global initiative launched by UNICEF in 2020 calling for public and private sector investment in digital learning as an essential service for every child and young person across the globe. This initiative aims to give children a chance to catch up on their learning needs amid the ongoing global pandemic.</p></div><div class=\"tr-npp-body\"><p>?Hundreds of millions of children in Africa have seen their education disrupted or put on hold because of the COVID-19 pandemic,? said UNICEF Executive Director Henrietta Fore.</p><p>?By championing digital education for children in Africa, this partnership with Airtel Africa will help put children?s learning back on track.?</p><p>Airtel Africa?s financial and in-kind contribution for this partnership is $57 million over five years to 2027. The program will call on technology and expertise, in addition to direct financial support to connect schools and communities to the internet, enable free access to online educational content for learners. It will also provide vital data insights to inform UNICEF?s work to scale-up digital learning and help ensure it is sustainable and meets students? needs across Africa.</p><p>?As a business, we have focused on education as a key area of our corporate social responsibility, and we are delighted that this partnership with UNICEF will enable us to accelerate results. It also coincides with the launch of our new sustainability strategy, which lays out our commitment to education,? said Olusegun Ogunsanya, CEO of Airtel Africa.</p><p>?We are excited to be working with UNICEF to advance the education agenda on the continent through facilitating connectivity and online access to play a role in driving change,? he added.</p><p>The Airtel Africa and UNICEF pan-African partnership will benefit learners in Chad, Congo, Democratic Republic of the Congo, Gabon, Kenya, Madagascar, Malawi, Niger, Nigeria, Rwanda, Tanzania, Uganda, and Zambia.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}