{"date": "2022-02-24 15:38:32.005000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon has introduced its first true wireless earbuds in the Indian market: the Echo Buds 2nd Gen. These come with support for Amazon's Alexa voice-assistant and ANC.</p><p>Amazon has introduced its first true wireless earbuds in the Indian market: the Echo Buds 2nd Gen. These come with support for Amazon's Alexa voice-assistant, along with Google Assistant and Apple's Siri. The earbuds also have Active Noise Cancellation (ANC) and will be compatible with both Android and iOS device. Here are the details on price, specifications.</p></div><div class=\"tr-npp-body\"><p>Amazon Echo Buds 2nd Gen: Price</p><p>The all-new Echo Buds can be purchased from Amazon India website. The Echo Buds are available at Rs 11,999 for the USB-C wired charging option, and Rs 13,999 for wireless charging case option. Customers can avail a limited-period discount of Rs 1,000 on both options.</p><p>Amazon Echo Buds 2nd Gen: Features</p><p>Amazon says the earbuds come with extended dynamic range and 3 mics in each bud ensure to clear voice recognition. The earbuds are \"optimised for increased fidelity in bass and treble,\" claims Amazon, and users can also control the bass and treble from the equaliser in the Alexa app.</p><p>The Echo Buds come with IPX4-rating to withstand splashes, sweat, or light rain. Amazon says these are designed for maximum comfort and long periods of usage. The earbuds come with four ear tip sizes and two wing tip sizes in the box to help users find the right fit. Also while setting up the earbuds, users can take the Ear Tip Fit Test in Alexa app to help get an optimal fit.</p><p>The earbuds also include Amazon's own Active Noise Cancellation technology, which the company claims is powered by an advanced chipset. The Echo Buds will cancel all ambient noise, and in order to turn on the feature, a user can simply press and hold either earbud and say, \"Alexa, turn on noise cancellation\". Or they can do the same via the settings from the Alexa app.</p><p>For those who want the ambient sound to be turned on, users can simply ask Alexa to enable Passthrough Mode with a press and hold on either earbud or by saying, \"Alexa, turn on Passthrough.\" With Passthrough Mode on, users can also adjust the amount of ambient sound they hear through the device settings in the Alexa app.</p><p>The buds will deliver up to five hours of music playback on a single charge with Active Noise Cancellation and Alexa wake word turned on.  The compact case provides two additional charges for a total of up to 15 hours of music playback. Users can also check the battery status on the Echo Buds by asking Alexa as well. They can also open the case while the Echo Buds are inside and the LED lights in front of each earbud will show the battery status.</p><p>These can be charged via a USB-C cable, which comes with the box) and the wireless option is also compatible with Qi-certified wireless charging pads.</p><p>Echo Buds will let also support the seamless move music feature between Alexa devices. So say you are listening to music on an Alexa-enabled speaker, and you ask it to move the music to the Echo Buds, it will do so. You can then pick up listening to the music on the buds.</p><p>Echo Buds use a combination of three microphones to detect your speech and securely process it for the cloud. Amazon claims \"they are built with multiple layers of privacy protections and controls, including the ability to mute the mics with the Alexa app or through the customisable on-bud tap controls.\"</p><p>Copyright 2022 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}