{"date": "2021-12-13 01:14:50.917000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\"><p>A newly renovated Cafe Amazon outlet on Phahon Yothin Road in Ayutthaya, where OR's food production and goods distribution complex is located. PTT Oil and Retail Business Plc (OR), Thailand's largest oil trader by volume, aims to increase its non-oil business revenue through a 6-billon-baht food production and goods distribution complex in Ayutthaya.</p><p>Spanning 200 rai of land in Wang Noi district, the complex consists of a coffee roasting plant, a bakery production facility, a non-coffee business unit and a goods distribution centre. The coffee roasting plant has a capacity of 4,500 tonnes a year, while the non-coffee unit focuses on tea, juice and dairy products.</p><p>OR plans to develop new ready-to-drink cocoa and tea for sale and expects to debut these products next year. The complex, which started its operations earlier this year, will benefit OR non-oil businesses over the long term as it helps manage food and drink sales the company wants to emphasise, said Jiraphon Kawswat, president and chief executive of OR.</p><p>It is also designed to use modern technologies, including artificial intelligence and a robotics system that facilitates goods management. The complex is expected to help OR increase earnings before interest, tax, depreciation and amortisation (Ebitda) to a rate of 45%, up from 25%.</p><p>Construction of the complex required part of OR's investment in non-oil and overseas businesses, which comprises 65% of the company's 74.6-billion-baht capital expenditure allocated for 2021 to 2025. Ms Jiraphon said OR will increase its Amazon coffeehouse chain by 500 branches next year, up from 3,700 shops at present. The total number, including stand-alone cafes and coffee shops at PTT petrol stations, will continue to increase, reaching 5,000 within 2023, she said.</p><p>Building new Amazon coffee shops led to the company's plan to expand capacity for its coffee roasting facility, increasing it to 10,000 tonnes a year with a budget of 850 million baht. The new production capacity is expected to be ready in 2024. OR is also developing Cafe Amazon services as well as giving a new shady look to its coffeehouses, hoping to catch the eye of coffee lovers.</p><p>The company plans to offer new menus from Ohkajhu -- an organic salad restaurant -- after it acquired a 20% share in Pluk Phak Praw Rak Mae Co, the operator of Ohkajhu. In the oil retail business, OR plans to increase the number of PTT stations by 110-120 next year, up from 2,000 branches, said Ms Jiraphon.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Bangkok Post</p></div>"}