{"date": "2021-11-02 04:04:39.903000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon Singapore is set to create 200 more jobs by the end of next year, as the e-commerce giant scales up its presence through a new office spanning three floors at Asia Square Tower 1.</p><p>Country manager Henry Low said the new positions will be in both technology and non-tech roles, from the junior to mid-management levels.</p></div><div class=\"tr-npp-body\"><p>These will include vendor management and account health specialist roles, which involve helping to bring sellers onto Amazon's platforms and enabling them to grow their presence.</p><p>There will also be programme management roles to introduce new products and features across Amazon's services, as well as corporate jobs in areas like human resources and finance, said Mr Low.</p><p>Amazon has approximately 2,000 full-time and part-time employees here, most of whom are Singapore citizens and permanent residents. The company said it has directly created more than 1,000 jobs in the country since 2019.</p><p>The 200 new roles announced yesterday are in addition to more than 110 current job openings in the consumer business and corporate functions.</p><p>Mr Low was speaking to The Straits Times on the sidelines of the opening of Amazon's new office, which spans three floors, or 100,000 sq ft, at Asia Square Tower 1, where it is the anchor tenant.</p><p>The space, dubbed SIN16, is twice the size of Amazon's office at One George Street and will accommodate up to 700 employees from Amazon's consumer business and corporate functions.</p><p>It will house more than 30 teams, including employees supporting Amazon.sg and Amazon Fresh, Amazon Advertising, Prime Video and seller enablement, as well as those in other regional corporate functions.</p><p>Mr Low told ST that the Asia Square premises will complement its existing offices in Singapore, including the space at One George Street.</p><p>Staff will be given the flexibility to work from home and out of the office, or have hybrid arrangements, depending on the nature of their work.</p><p>\"We never make it such that everybody has to come into a single space in order to have one particular event. But the flexibility doesn't mean we are 100 per cent remote,\" said Mr Low.</p><p>\"We recognise that there are certain activities where you are able to feed off one another's energy, and also that not everyone has a conducive home environment to work at length. The idea is to create a safe, conducive work environment for them.\"</p><p>He added that the Covid-19 pandemic has not changed the company's business outlook and need for office space.</p><p>SAFE WORK ENVIRONMENT  AMAZON SINGAPORE COUNTRY MANAGER HENRY LOW, on whether staff will be given flexibility to work from home and out of the office, or have hybrid arrangements, depending on the nature of their work.</p><p><q>We never make it such that everybody has to come into a single space in order to have one particular event. But the flexibility doesn't mean we are 100 per cent remote... We recognise that there are certain activities where you are able to feed off one another's energy, and also that not everyone has a conducive home environment to work at length. The idea is to create a safe, conducive work environment for them.</q> </p><p>\"We continue to have confidence in growth in the region and Singapore, and we need to make sure we continue to provide for employees.\"</p><p>The Asia Square Tower 1 office includes meeting rooms and breakout areas for informal discussions, as well as height-adjustable hot desks and individual lockers. Soundproof phone booths, recreational areas and training rooms, which can double up as event spaces, are also spread out across the premises.</p><p>Trade and Industry Minister Gan Kim Yong was the guest of honour at the office's opening yesterday. He noted that Amazon has invested in Singapore since 2010, and that the Republic was the e-commerce giant's first presence in South-east Asia.</p><p>\"Singapore is home to many multinational companies, which have set up their regional bases here to expand their business, develop new products and access the growing markets of South-east Asia,\" said Mr Gan.</p><p>He added that more global technology companies are recognising the growing demand for both consumer and corporate digital services in the region, and are setting up their regional headquarters here.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SPH</p></div>"}