{"date": "2022-01-25 12:57:17.140000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon Go is moving to the suburbs.</p><p>The tech giant said it plans to open a new type of store aimed at serving customers in suburban-area locations.</p></div><div class=\"tr-npp-body\"><p>The first one will open in Mill Creek, Washington, in the coming months. Amazon also plans to open a second Go store in the Los Angeles area.</p><p>Like other Go stores, the location will leverage technology allowing customers to make purchases without ever interacting with a cashier. Using the Amazon app, you scan to enter, then pick your items. When customers walk out, they are charged for the items purchased through the app. </p><p><span><span>►Amazon Style::</span> Amazon to open its first in-person clothing store. Here's what we know.</span> </p><p><span><span>►Neuralink:</span> Company plans to implant chips in human brains to treat neural disorders</span> </p><p><span><span>►Tech security:</span> 5 easy ways to keep your devices and data safe</span> </p><p>\"We think local residents and commuters will enjoy the ease of our Just Walk Out Shopping to quickly and conveniently shop from an expanded selection of tasty, ready-to-eat food items and grab-and-go beverages and snacks in their own neighborhood,\" said Amazon in a statement.</p><p>The company has Amazon Go stores in four states, mostly in downtown metropolitan areas including New York City, Chicago and San Francisco.</p><p>Amazon said the new suburban Go stores will offer snacks, everyday essentials, beverages and grab-and-go food items.</p><p>Last November, Amazon introduced a new concept store with Starbucks, combining the retailer's Go shopping tech with Starbucks Pickup to let consumers shop cashier-free.</p><p>The store also features a modern lounge with individual workspaces as well as larger tables with power outlets and USB ports.</p><p><span><span>Follow Brett Molina on Twitter: @brettmolina23.</span> </span> </p><p><span>This article originally appeared on USA TODAY: Amazon opening new Amazon Go store 'closer to home' for shoppers</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}