{"date": "2021-11-20 09:36:48.804000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3696.06, "close": 3572.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Earlier this year Dave Eggers announced that the US hardback of his latest novel, The Every <span>,</span> would not be distributed via Amazon, presumably recognising that it would be absurd to boost the fortunes of the omnipotent online retailer while at the same time setting out to satirise it mercilessly. \"I don't like bullies,\" he told the New York Times. \"Amazon has been kicking sand in the face of independent bookstores for decades now.\" But no novelist who actually wants their book to sell can avoid Amazon for long, and Eggers's boycott contained some fine print: unlike the hardback, the US paperback and ebook versions of The Every will be available on the US website, and there will be no restrictions on selling the UK editions. The Every <span>'</span> s thesis is that big tech represents a 21st-century form of totalitarianism to which resistance can only ever be symbolic, and therefore futile. One might well wonder whether this half-hearted boycott was designed to prove that point.</p><p>The novel is a follow-up to Eggers's 2013 dystopian satire, <a href=\"https://www.theguardian.com/books/2013/oct/09/circle-dave-eggers-review\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Circle</a><span>,</span> in which Mae Holland joined the eponymous social media company, a mashup of Facebook and Google, and rose through its ranks. It opens after the Circle has acquired \"an e-commerce behemoth named after a South American jungle\" and rebranded itself as the Every – \"hinting as it did at ubiquity and equality\". This time, our heroine is Delaney Wells, who joins the company with the goal of finishing its \"malignant reign on earth\". She plans to destroy it from the inside by seeding ideas so repellent that rational people will surely turn away in droves. \"Humanity,\" she reasons, \"will finally turn away from the endless violations of decency, privacy, monopoly, the consolidation of wealth and power and control.\"</p></div><div class=\"tr-npp-body\"><p>One of Delaney's most diabolical suggestions is Friendy, an app that measures the trustworthiness of one's friends by analysing facial expressions, eye contact and vocal intonations, assigning a numerical value to the quality of the friendship: \"Think of how much more genuine and authentic our friendships could be if we just apply the right metrics to them.\" But other ideas begin to proliferate, among them the introduction of a \"beauty metric\" for \"paintings, music, poetry or any art form\" and an app called HappyNow <span>?</span> designed to \"answer, in real time, whether the user was happy\". Not even the development of sinister surveillance technology, HereMe (a Big Brother version of Alexa), designed to pre-empt abusive behaviour in the home by eavesdropping for key words, is considered a step too far.</p><p>Eggers sets out an Orwellian vision of a near future in which big tech has \"transformed proud and free animals – humans – and made them into endlessly acquiescent dots on screens\". The Every is housed on a California campus with \"the look of a hastily assembled film set\". The wholesale adoption of Lycra (\"every curve and bulge articulated\") is a running gag that symbolises the abandonment of individuality. Large screens propagate \"Every\" ideology: <span>\"</span> Sharing Is Caring <span>\"; \"</span> Secrets Are Lies <span>\";</span> \"The World Wants to Be Watched\". Employees, known as Everyones, are burned out from unrelenting surveillance in the guise of self-improvement apps that monitor everything from physical activity to political correctness. Consumers sacrifice privacy on the altar of an endless accumulation of apps.</p><p>All of this should paint a terrifying picture, but it doesn't (though I will concede that the possibility of eye-tracking technology that prevents you skimming War and Peace is genuinely scary). The problem is that none of the characters is given anything resembling a personality, let alone an arc – except for the purpose of tracking when they start to give in to the Every's ethos. There seem to be no inner lives. Not only are the characters subordinated to the plot, but they are subsumed entirely by the novel's polemic, so there's nothing at stake <span>.</span> The Every <span>'</span> s other problem is that in the wake of big tech's own self-parodying behaviour – Amazon's anti-union scandals, the Elon Musk-Jeff Bezos space race, Facebook's rebranding as Meta and launch of the Metaverse – satire begins to feel redundant. (Meta surely proved this with those October launch videos that launched a thousand memes.)</p><p>Eggers is a gifted writer who couldn't write a bad novel; even if this isn't a great one, it contains several funny sequences threaded together with skewer-sharp sentences: \"Everything God offered – answers, clarity, miracles, baby names – the internet does better … The one question that could not be answered, until now, is <span>Am I good?\"</span> And it does administer a sharp Juvenalian lampooning of big-tech venality, though this would be far more successful were it not also so lengthy. During Delaney's probation period, an Everyone says: \"No book should be over 500 pages, and if it is over 500 pages, we found the absolute limit to anyone's tolerance is 577.\" This kind of self-conscious metafictional wink is an Eggers hallmark, but here it had the distracting effect of reminding me that there were still 370 pages to go to reach his self-allotted 577, which made the novel feel 370 pages too long <span>.</span> </p><p>The result of all this is that The Every is often entertaining, but not effective. It issues an urgent injunction to save humanity without ever really evoking the kind of humanity that you'd remember after turning the final page – the kind that may be the only weapon we have in the fight against big-tech totalitarianism. Early on, when Delaney ponders possible ways to destroy the Every from the outside, her friend Wes deadpans: \"Maybe one of us writes a novel.\" What a shame, then, that this novel feels like a damp squib.</p><p>• <span>The Every is published by Hamish Hamilton (£12.99). To support the Guardian and the Observer, order your copy at</span><span><a href=\"https://guardianbookshop.com/the-every-9780241535493?utm_source=editoriallink&amp;utm_medium=merch&amp;utm_campaign=article\" data-type=\"url\" class=\"tr-link\" translate=\"no\">guardianbookshop.com</a> </span><span>. Delivery charges may apply.</span><br/> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 theguardian.com-NonSyndicated</p></div>"}