{"date": "2021-12-10 00:21:00.153000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.16, "close": 3444.24}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwlistdisc{list-style-type:disc;}</style><p style=\"font-weight:normal\">\n<b>Alexa.com Customers Affected by Amazon Sunset Decision to Benefit from New Similarweb Free Offering</b>\n</p><p style=\"font-weight:normal\">\n<b>Launch of Website-Ranking API One of Several Similarweb Initiatives Designed to Help Alexa.com Customers</b>\n</p><p>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.similarweb.com%2F&amp;esheet=52548524&amp;newsitemid=20211209006132&amp;lan=en-US&amp;anchor=Similarweb&amp;index=1&amp;md5=65c4c05a2ebe5bb28189aa3eb57dfb4c\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Similarweb</a> (NYSE: SMWB), a leading digital intelligence platform, today announced the availability of a free website-ranking API. The new free service is one of several steps Similarweb is taking to help Alexa.com customers affected by Amazon’s decision to sunset that service in May 2022. Companies interested in using the new API can <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.similarweb.com%2Fcorp%2Flearn-about-our-api%2F&amp;esheet=52548524&amp;newsitemid=20211209006132&amp;lan=en-US&amp;anchor=register+here&amp;index=2&amp;md5=defc4e44b18174aa0a95bb56979932ff\" data-type=\"url\" class=\"tr-link\" translate=\"no\">register here</a> for more information and access.\n</p><p>\nAlexa.com customers can also instantly view Similarweb site ranking for free <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.similarweb.com%2Ftop-websites%2F&amp;esheet=52548524&amp;newsitemid=20211209006132&amp;lan=en-US&amp;anchor=on+the+web&amp;index=3&amp;md5=f299e1fa57858b0c006f0d413a942f25\" data-type=\"url\" class=\"tr-link\" translate=\"no\">on the web</a>. And for the first time, Similarweb is launching a self-service offering, based on its premier digital intelligence platform, that will address Alexa.com users’ needs and use cases. This new offering will be available in all markets globally through a simple credit card transaction.\n</p><p>\nA free trial of Similarweb is <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.similarweb.com%2Fcorp%2Fmarketing%2Ffrom-alexa-to-similarweb-the-new-era-of-ranking%2F%3F%3D5&amp;esheet=52548524&amp;newsitemid=20211209006132&amp;lan=en-US&amp;anchor=available+here&amp;index=4&amp;md5=59104970d00f4d8ccc05fc37e0eeabe6\" data-type=\"url\" class=\"tr-link\" translate=\"no\">available here</a>. Free trial users will have unlimited access to Similarweb DigitalRank(TM), a market-leading ranking of website performance, in addition to Similarweb Digital Marketing and Research Intelligence premium solutions, which help users go beyond simple ranking, enabling them to uncover actionable insights that impact website traffic performance. With these solutions, users can:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\n<b>Make strategic decisions </b>based on the most comprehensive, real-time view of competitive activity across all digital marketing channels, not just website ranking scores.\n</li>\n<li>\n<b>Spot new opportunities</b> from traffic and engagement trends as they are happening, and understand which audiences are engaging with your competitors' websites and their industries over time.\n</li>\n<li>\n<b>Utilize real-time traffic share data </b>to adapt to market changes as they happen\n</li>\n<li>\n<b>Benchmark</b> engagement metrics and website performance cross-industry to expose competitor’s digital strategies\n</li>\n<li>\n<b>Analyze any marketing channel’s performance</b> over time to make data-backed decisions on where to allocate resources and ad spend for maximum ROI\n</li>\n<li>\n<b>Get critical audience demographic and behavioral information</b>, a metric missing from Alexa.com, to improve targeting and user retention\n</li>\n<li>\n<b>Discover and prioritize keyword opportunities</b> based on search volume, optimize traffic share per keyword, and monitor the search traffic trends\n</li>\n</ul><p>\nSimilarweb is a recognized leader in web traffic analytics and ranking, and these services are backed by the company’s comprehensive, granular, and timely data platform.\n</p><p>\n“Similarweb has always been a leader in terms of the data our users get and the quality and accuracy our insights provide,” said Or Offer, CEO and Founder of Similarweb. “Although it’s a bittersweet moment with the closing of Alexa.com, I’m excited for the opportunity it presents to expand our reach even further as we become the standard for digital rankings and global website intelligence.”\n</p><p>\n<b>About Similarweb:</b>\n</p><p>\nAs the most trusted platform for understanding online behavior, millions of people use Similarweb’s insights daily to strengthen their knowledge of the digital world. We empower anyone — from the curious individual to the enterprise business leader — to make smarter decisions by understanding why things happen across the digital ecosystem. Learn more here: <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.similarweb.com%2Fcorp%2Fabout%2F&amp;esheet=52548524&amp;newsitemid=20211209006132&amp;lan=en-US&amp;anchor=https%3A%2F%2Fwww.similarweb.com%2Fcorp%2Fabout%2F&amp;index=5&amp;md5=be2e76d3ad909c7186d9feb5a3516d05\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.similarweb.com/corp/about/</a>\n</p><p>\nAll data, reports and related materials (“Materials”) provided or made available by Similarweb Ltd. or any of its affiliates (collectively, \"Similarweb\"), are intended for informational purposes only. The Materials are based on data obtained from third parties, including estimations and extrapolations based on such data, and are not intended to be predictive of the movement of the market prices of the securities of the company(ies) referred to therein. Under no circumstances are the Materials to be considered or relied upon in any manner as legal, tax or investment advice. Similarweb shall not be responsible for the accuracy of the Materials and shall have no liability for any decision by any third party based in whole or in part on the Materials. Title and full exclusive ownership rights in the Materials, the underlying data, and any and all other Similarweb intellectual property (including the Similarweb name, logo and other marks) remain solely with Similarweb (except for third party trademarks and logos, which remain the property of their respective owners). All rights not expressly granted herein are reserved.\n</p><p>\nThis Press release may contain certain \"forward-looking statements\" as defined in Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These forward-looking statements reflect our current views regarding our intentions, products, services, plans, expectations, strategies and prospects, which are based on information currently available to us and assumptions we have made. Actual results may differ materially from those described in such forward-looking statements and are subject to a variety of assumptions, uncertainties, risks and factors that are beyond our control, including those described in our Securities and Exchange Commission filings and reports including the final prospectus for our initial public offering filed with the Securities and Exchange Commission on May 11, 2021, as well as future filings and reports by us. Except as required by law, we undertake no duty to update any forward-looking statements contained in this release as a result of new information, future events, changes in expectations or otherwise.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211209006132r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMjA5MDA2MTMycjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=a0c25c2da4a051803aabf23e3e33b8946a3bcb9d8090af75d5dc684af646a0ea8f12c76a815a3f89b17ec33643ef32ddec18fb7410f5c180277179c33cb2729b\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211209006132/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211209006132/en/</a></span></p><p>\nMaayan Weiss\n<br/>Similarweb\n<br/><a href=\"mailto:press@similarweb.com\" data-type=\"email\" translate=\"no\">press@similarweb.com</a>\n</p><p>\n<b>Investor: \n</b><br/>Alex Wellins\n<br/>The Blueshirt Group, for Similarweb\n<br/><a href=\"mailto:ir@similarweb.com\" data-type=\"email\" translate=\"no\">ir@similarweb.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SIMILARWEB</p></div>"}