{"date": "2021-12-20 13:11:50.492000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>BLENDER BITES LTD (\"BITE-Z\")\n- 990% Increase in Total Value of Purchase Orders Received in\n- December 2021\n\n     Blender Bites Ltd. (the \"Company\", \"Blender Bites\" or \"Blender\"), a\nCanadian company involved in the development and marketing of a line of\npremium, organic and plant-based pre-portioned frozen functional foods,\nannounces record number of purchase orders received in December 2021.\n\n     Blender Bites is pleased to announce that during the month of December\n2021, the Company has received purchase orders totalling CA$495,000. This\nis an historic record for the number of purchase orders received by the\nCompany in any given month and represents an increase of over 900% in total\nvalue of purchase orders compared to the same month in 2020.\n\n     The total number of purchase orders received in December 2021 alone,\nalso represents a 75% increase over the highest number of purchase orders\nreceived in any single month in the Company's history, close to doubles the\nnumber of purchase orders received in the previous month of November 2021\nand is equivalent to 70% of the combined total of all orders received in\nthe previous three month period of September, October, and November 2021.\n\n     The significant and historic increase that Blender Bites has witnessed\nin December can be attributed to initial orders received from US club\nstores distributors, increased demand in the 850+ Canadian retail grocery\nstores, including the launch of the Blender Bites brand within new Canadian\nretail chains, and increased orders received from the37 Canadian club\nstores that the Blender Bites currently has freezer space in. The increase\ndoes not reflect any orders the Company anticipates receiving once its\naggressive US expansion and consumer marketing campaign strategies are\nexecuted.\n\n     Management feels that the upward trend for the number of purchase\norders received, and subsequently sales revenue, will continue the positive\ntrajectory, as there is great potential still to be realized once the\nCompany's US strategies are implemented. The Company's US market roll out\nand expansion plans, will also include direct-to-consumer e-commerce\ncapabilities, finalizing food service market relationships and\nrepresentation in some of the largest retail chains across the country.\nThese future events could witness even greater increases in purchase orders\nreceived.\n\n     \"The fact that we are seeing such significant increases in orders\nprior to full roll out of our strategy is very positive and can only\nsuggest that we will see numbers continue to increase with each new step\nand each brick laid along our roll out path. Blender Bites is still in its\ninfancy stages, and I truly believe that the aggressive US market roll out,\nand our consumer marketing campaigns will further add to increased value\nfor the Company and for our shareholders, alike,\" stated Chelsie Hodge, the\nCompany's CEO and Founder.\n\n     The Company cautions that the above figures for revenue have not been\naudited and are based upon calculations prepared by management. Actual\nresults may differ from those reported in this release once these figures\nhave been audited.\n\n     About Blender Bites\n\n     Blender Bites is a Canadian company involved in the development and\nmarketing of a line of premium frozen food products with a focus on\nfunctionality. Blender Bites was founded in 2016 and was first to market in\nWestern Canada with a pre-portioned \"easy smoothie\" product that is free of\nany unnecessary inner plastic packaging. Blender Bites products are\ncertified organic, vegan, non-GMO, gluten free, dairy free and soy free.\nThey contain no added sugars and are made in Canada. Blender Bites products\nare distributed internationally across Canada and the US, and are currently\nsold in over 850 stores, including Sobeys, Safeway, Save on Foods, Whole\nFoods Market, Buy-Low/Nesters, IGA and Fresh Street.\n\n     On behalf of the Board of Directors,\n\n     Blender Bites Limited\n\n     Chelsie Hodge, Chief Executive Officer\n\n     For further information, contact Blender IR Team at:\n\n     Email - investors@blenderbites.com\n     Telephone - 1-888-997-2055\n\n     CAUTIONARY DISCLAIMER STATEMENT\n\n     This news release includes certain \"forward-looking statements\" under\napplicable Canadian securities legislation. Forward-looking statements are\nnecessarily based upon several estimates and assumptions that, while\nconsidered reasonable, are subject to known and unknown risks,\nuncertainties, and other factors which may cause the actual results and\nfuture events to differ materially from those expressed or implied by such\nforward looking statements. Such factors include, but are not limited to\ngeneral business, economic, competitive, political, and social\nuncertainties, and uncertain capital markets. Readers are cautioned that\nactual results and future events could differ materially from those\nanticipated in such statements. Accordingly, readers should not place undue\nreliance on forward-looking statements. The Company disclaims any intention\nor obligation to update or revise any forward-looking statements, whether\nas a result of new information, future events or otherwise, except as\nrequired by law.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2135200012.MNPRE2135200035-11454420211219</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}