{"date": "2021-11-30 14:00:03.424000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>AWS Named United Airlines’ Preferred Cloud Provider</b>\n</p><p class=\"bwalignc\">\n<span>Airline teams up with AWS to introduce new innovative digital services that personalize travel experiences for customers</span>\n</p><p>\nToday, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), announced that United Airlines (NASDAQ: UAL) has selected AWS as its preferred cloud provider. AWS will support United’s digital innovation, providing machine learning, Internet of Things (IoT), analytics, databases, computing, storage, and security capabilities to advance United’s industry-leading efforts to transform the travel journey for customers through digital technology.\n</p><p>\n“AWS’s superior portfolio of products and services, and its focus on continuous innovation for its customers, is a complement to United’s approach to technology,” said Linda Jojo, Executive Vice President, Technology and Chief Digital Officer at United Airlines. “United has an established track record of developing new ways to use technology to improve the customer experience. Naming AWS as our preferred cloud provider helps us to even further accelerate how we innovate and deliver even more personalized and scalable services for our customers and employees.”\n</p><p>\nThe airline is using a wide range of AWS capabilities as it leverages technology to transform the way their customers interact with the airline. Working with AWS, United has already introduced a number of industry-first enhancements for travelers, at an incredible pace, including new features in United’s app and digital channels to help customers understand and easily navigate COVID-19 travel restrictions.\n</p><p>\nThrough United’s <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.united.com%2Fen%2Fus%2Ftravelreadycenter&amp;esheet=52541775&amp;newsitemid=20211130005253&amp;lan=en-US&amp;anchor=Travel-Ready+Center&amp;index=1&amp;md5=3fda1d622af7321ed2b04901db5ae23f\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Travel-Ready Center</a>, travelers can now easily access testing or vaccine requirements needed for their specific destination, upload testing and vaccination records, schedule a COVID-19 test and complete country-specific required forms in United’s app and on United.com. Using machine learning technology from AWS and Amazon Elastic Kubernetes Service (Amazon EKS), a managed container service to run and scale Kubernetes applications, United customers can have critical travel documents reviewed in near real-time before they arrive at the airport, making the journey easier. United was the first airline to offer its customers these services as part of an integrated experience in its app and website.\n</p><p>\nUnited is also applying AWS technology, including analytics, IoT, and machine learning, to optimize airport operations and help airport employees drive nimble and scalable operations. Central to this effort is United’s companywide analytics and machine learning program, which uses AWS to innovate new services, drive efficiencies, and respond faster to potential delays, allowing United to scale to meet demand. For instance, United uses Amazon SageMaker (AWS’s service that helps data scientists build, train, and deploy machine learning models quickly) to predict irregular operations and uncover insights to optimize customer service, baggage routing, and flight scheduling.\n</p><p>\n“United Airlines operates one of the world’s largest airline networks with more than 4,900 daily flights moving people and goods across six continents, and it uses technology to reinvent the customer experience. AWS provides proven reliability, breadth and depth of services, and travel-industry expertise to United Airlines as it delivers outstanding experiences across its business,” said Matt Garman, Senior Vice President of Sales and Marketing at Amazon Web Services, Inc. “Together, we are working to support United’s vision of making air travel more seamless through digital solutions to help improve the way people travel the world.”\n</p><p>\n<strong>About Amazon Web Services</strong>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com&amp;esheet=52541775&amp;newsitemid=20211130005253&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=2&amp;md5=e94aa8d0d48ac08f0da4a835928a184a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<strong>About Amazon</strong>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Famazon.com%2Fabout&amp;esheet=52541775&amp;newsitemid=20211130005253&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=3&amp;md5=a97da644e0d6b84dff9c61c2bb49e98b\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p>\n<b>About United Airlines</b>\n</p><p>\nUnited’s shared purpose is “Connecting People. Uniting the World.” In 2019, United and United Express® carriers operated more than 1.7 million flights carrying more than 162 million customers. United has the most comprehensive route network among North American carriers, including U.S. mainland hubs in Chicago, Denver, Houston, Los Angeles, New York/Newark, San Francisco and Washington, D.C. For more about how to join the United team, please visit united.com/careers and more information about the company is at united.com. United Airlines Holdings, Inc. is traded on the Nasdaq under the symbol \"UAL”.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211130005253r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTMwMDA1MjUzcjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=7c85f994df23b5eead59bc41a0abf566665fbafabe2ac90bc303f7fa485257385f53290b82f643f760e3b7590ea181e1b9416d685647fcfec07c9332f405544c\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211130005253/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211130005253/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52541775&amp;newsitemid=20211130005253&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=4&amp;md5=9a3e1913e22db3c95658474353b86c96\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON-WEB-SERVICES</p></div>"}