{"date": "2022-01-25 07:58:52+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds details from filing, context</p><p class=\"tr-by\">By Aditya Kalra</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW DELHI, Jan 25 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Indian retailer Future Group on Tuesday challenged its own lenders in the Supreme Court to avoid facing insolvency proceedings over missing payments, citing its dispute with partner Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, according to a legal filing reviewed by Reuters.</p><p>Future, the country's second-largest retailer, has since 2020 <a href=\"https://reut.rs/3nHvlsU\" data-type=\"url\" class=\"tr-link\" translate=\"no\">failed to complete</a> its $3.4 billion retail asset sale to a rival due to a row with Amazon, which argues the Indian group violated certain non-compete contractual terms the two sides had. Future denies any wrongdoing.</p><p>Future told Indian exchanges this month it was unable to pay 35 billion rupees ($470 million) it owed to its lenders on Dec. 31 as it could not sell certain small stores due to the dispute with Amazon. It had hoped to use a 30-day grace period to resolve the situation.</p><p>After failing to do so, Future in a new court filing at the Supreme Court on Tuesday asked judges to order its lenders and the country's central bank to grant more time to execute the sale, and not be classified as a defaulter.  </p><p>The company's 1,700 outlets include roughly 900 small-sized stores, with the rest being large-format hypermarkets and fashion outlets.</p><p>The latest legal challenge by Future signals growing distress at the retail group, which has said it fears liquidation and more than 27,000 job losses at its retail arm if its plan to sell assets to rival Reliance Industries <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RELI.NS\" data-type=\"ric\" data-ric=\"RELI.NS\" translate=\"no\" dir=\"ltr\">RELI.NS</a> fails.</p><p>Future's filing also contained a letter from the State Bank of India <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SBI.NS\" data-type=\"ric\" data-ric=\"SBI.NS\" translate=\"no\" dir=\"ltr\">SBI.NS</a> to the company on Jan. 15, warning the company that if it doesn't pay the amount due to lenders, it could face legal action.</p><p>This, SBI warned in its letter, could include \"initiating insolvency proceedings\" against Future, in line with Indian laws. </p><p>Future's main retail arm, Future Retail, asked judges to quash such default notices from its lenders, its filing showed<span class=\"tr-strong\">.</span></p><p>Future \"finds itself in a peculiar position where it wishes to comply\" with its obligations to lenders, but \"the litigation with Amazon is effectively preventing it from doing so,\" Future's counsel Yugandhara Pawar Jha said in the filing.</p><p>The court petition, which is not public, was first reported by Reuters.</p><p>Amazon has argued that Future violated the terms of a 2019 deal the pair signed when the U.S. firm invested $200 million in a Future unit. The U.S. company's position has so far been backed by a Singapore arbitrator and Indian courts.</p><p>    </p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Aditya Kalra in New Delhi; Editing by Sanjeev Miglani and Kenneth Maxwell)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:aditya.kalra@tr.com\" data-type=\"email\" translate=\"no\">aditya.kalra@tr.com</a> ; +91-11-49548021; Twitter <a href=\"https://twitter.com/adityakalra\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/adityakalra</a>; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-INDIA/FUTURE-RELIANCE (UPDATE 1, PIX)</p></div>"}