{"date": "2022-01-06 17:28:35.886000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3287.14, "close": 3251.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Experts: HC stay on Amazon-Future arbitration creates conflict of laws Defeats sole crux of contractual pact, may dissuade foreign firms from entering India, they say</p><p>A division Bench also stayed the order of the single judge who had refused to intervene in the matter, dismissing the pleas filed by the two subsidiaries of Future Group on Tuesday. The single judge of the HC had denied interfering in the ongoing arbitration proceedings before the Singapore International Arbitration Centre (SIAC).</p></div><div class=\"tr-npp-abstract\"><p>The Delhi High Court (HC) on Wednesday stayed the arbitration proceedings in relation to Future Group\u0092s 2019 deal with e-commerce giant Amazon before the Singapore tribunal. This is a major relief to Kishore Biyani and his retail group. However, legal experts said the order has created a 'conflict of laws' situation, defeats the sole crux of the contractual arrangement, and may dissuade foreign companies from entering the Indian market.</p></div><div class=\"tr-npp-body\"><p>Looking at the facts and circumstances of the case, as well as the order passed by the Competition Commission of India (CCI), the division Bench said there was prima facie a case in favour of Future Group and an irreparable loss would be caused to it if the proceedings were not stayed, according to the law platform Bar &amp; Bench.</p><p>The court has also issued notice to Amazon, saying the stay on arbitration proceedings, as well as the single judge's order, will remain in force till the next date of hearing, scheduled for February 1. \u0093The order has created a 'conflict of laws' situation. The Singapore arbitration tribunal is not under the jurisdiction of Delhi HC,\u0094 said Salman Waris, managing partner at technology law firm TechLegis Advocates &amp; Solicitors, adding, \u0093Effectively, the Singapore arbitral tribunal authority is being challenged by staying the process. The only way to effectively implement the order of the Delhi HC will be for Future Group to get it confirmed by the Singapore HC.\u0094</p><p>Ankita Singh, partner, A&amp;P Partners, said the stay order of the division Bench of the Delhi HC was passed in view of the recent order by CCI against Amazon. \u0093The court has analysed the facts and circumstances in the matter and passed the stay order to avoid irreparable loss to Future Group,\u0094 she said.</p><p>\u0093This defeats the sole crux of the contractual arrangement between the parties and agreement on a resolution method under the agreement. From a macro view, this will dissuade foreign companies from entering the Indian market,\u0094 she added.</p><p>A P Singh, partner, MVKini, said the stay of arbitration proceedings at Singapore by a division Bench of Delhi HC is definitely a drastic order and is in favour of Future Group. He said the order takes into cognisance the fact that CCI order dated December 17, 2021, has held its approval to the main agreement, which also contains the arbitration clause between the parties in abeyance on prima facie view of suppression of facts by Amazon Group.</p><p>\u0093The division Bench has interfered on the premise of the likelihood of the main agreement itself being vitiated by misrepresentation,\u0094 he said, adding, \u0093If such a view is ultimately proved and accepted, this would break the entire deal, as well as arbitration. Thus the interim order is definitely a shot in the arm for Future Group. However, there\u0092s a likelihood of renewal of perennial criticism of Indian courts interfering in the arbitration proceedings.\u0094</p><p>Nitish Sharma, counsel at law firm AnantLaw, said the order passed by the division Bench appears to be far-fetched on various facets of the law, especially when no intra-court appeal lies against an order passed under Section 227 of the Constitution of India.</p><p>\u0093The decision of the single Bench to not interfere in the arbitration proceedings appeared to be in the right direction, considering the delay and inconvenience it would have caused to the stakeholders,\u0094 said Sharma, adding, \u0093It would be interesting to see how the Supreme Court deals with the present issue, which has been on the boil since the past year.\u0094</p><p>Future Group declined to comment on the development, while a query sent to Amazon remained unanswered till the time of going to press. However, a source familiar with the case said Amazon is likely to challenge the Delhi HC decision.</p><p>An arbitration tribunal in Singapore has been hearing Amazon's case against Future Group related to the deal between the two companies. This issue goes back to August 2019, when Amazon acquired 49 per cent stake in Future Coupons, the promoter entity of Future Retail (FRL), for around ~1,500 crore. One year later, in August 2020, Future Group struck a $3.4-billion asset-sale deal with Reliance Industries (RIL).</p><p>In October 2020, Amazon had sent a legal notice to Future for striking a deal with RIL. It alleged that Future\u0092s $3.4-billion asset sale deal with RIL breached an agreement with Amazon. It cited its non-compete agreement with the Biyani-led chain. The deal specified any disputes would be arbitrated under the SIAC rules. The same month, Amazon got a favourable ruling for its plea in SIAC against the deal. In November 2020, Future moved Delhi HC against Amazon, alleging interference by the US firm in the deal with RIL. Since then, Amazon has been fighting a legal battle with FRL to stop Future\u0092s $3.4-billion deal with RIL.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Business Standard Ltd.</p></div>"}