{"date": "2021-07-26 07:43:37.503000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3970.0, "close": 3936.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 4217GAVEVA Group PLC26 July 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>AVEVA Group plc</p>\n<p>Director Appointment</p>\n<p>\n<span>AVEVA Group plc (\"AVEVA\" or the \"Company\") announces that Schneider Electric has nominated Hilary Maxson to replace Peter Herweck as a Non-Executive Director of AVEVA and as a member of the Nomination Committee, with effect from 1 August 2021.</span>\n</p>\n<p>\n<span>Hilary is Executive Vice President, Group Chief Financial Officer at Schneider Electric. Prior to joining Schneider Electric in 2017, Hilary held a variety of finance and business development positions across the globe, primarily in the power and utilities industry. She started her career at Bank of America and Citigroup, in New York, and then joined the AES Corporation where she served as CFO of Asia, CFO of Africa, Managing Director of M&amp;A and other senior positions.</span>\n</p>\n<p>\n<span>The Company confirms that, pursuant to paragraph 9.6.13(1) of the Listing Rules, Hilary Maxson is currently serving as a non-executive director and member of the Audit Committee of Anglo American plc.</span>\n</p>\n<p>\n<span>Commenting on the appointment, Chairman Philip Aiken said: \"The Board is delighted to welcome Hilary to the Board and the Nomination Committee. Hilary brings a significant range of corporate and strategic knowledge and perspective to the Board which will be of great value to the Company as it enters a new growth phase.\"</span>\n</p>\n<p>\n<span>There are no details to disclosure in respect of Listing Rule paragraphs 9.6.13 (2) to (6).</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>Enquiries:</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>AVEVA Group plc</p>\n</td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>Matt Springett, Head of Investor Relations</p>\n</td>\n<td>\n<p>+44 (0)7789 818 684</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n</p></td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>FTI Consulting LLP</p>\n</td>\n<td>\n<p>\n</p></td>\n</tr>\n<tr>\n<td>\n<p>Edward Bridges/Dwight Burden</p>\n</td>\n<td>\n<p>+44 (0) 20 3727 1000</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>BOADQLBLFDLLBBV</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}