{"date": "2022-02-10 15:41:03.290000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3228.27, "close": 3180.07}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SUPERNOVA PARTNERS ACQUISITION CO II LTD (\"SNII-N\")\n- Rigetti and Zapata Collaborate to Build First Commercial Hybrid\n- Quantum-Classical Compilation Stack for Application Development\n\n     Rigetti Holdings, Inc. (\"Rigetti\"), a pioneer in hybrid\nquantum-classical computing, and Zapata Computing (\"Zapata\"), a leading\nenterprise software company for quantum-classical applications, today\nannounced a new phase in their long-standing partnership: the companies are\ndeveloping an industry-first compilation toolchain explicitly designed for\nhybrid quantum-classical algorithms.\n\n     As part of the work, Zapata will integrate Orquestra, its unified\nplatform for building and deploying quantum-ready applications(TM) at\nenterprise scale, directly with Rigetti's Quantum Cloud Services (QCS). The\nintegration provides access to Rigetti QPUs, including the company's\nrecently announced 80Q Aspen-M system. This new, full-stack combination is\ndesigned to optimize access to the new device and speed up execution of\nhybrid applications.\n\n     Specifically, this new collaborative effort aims to build a compiler\nstack that optimizes code for the feature sets of both the quantum and\nclassical hardware within a hybrid loop. Based on modern LLVM compiler\ntechnology, the toolchain will enable users to run end-to-end hybrid\nquantum workflows that incorporate a variety of classical hardware. The\ncompanies expect the integrated workflows to help speed up computations on\nthe Orquestra platform.\n\n     \"Zapata, with its Orquestra platform for quantum-classical data and\ncompute, is an industry leader in building quantum-ready applications for\nreal world use cases,\" said David Rivas, SVP Systems and Services at\nRigetti. \"We are thrilled to be working with them on state-of-the-art\nhybrid solutions and integrating our QPUs directly into Orquestra with\nRigetti Quantum Cloud Services.\"\n\n     \"This first-of-its-kind integration is great news for enterprises that\nare focused on getting to production with quantum computing,\" commented\nYudong Cao, Zapata's CTO. \"We've partnered with Rigetti for years and\nintegrated previous generations of quantum processors--but this latest\ncompilation toolchain we are building in collaboration with Rigetti could\nsubstantially enhance early adopters' capability to develop quantum-enabled\nworkflows(R) for production. Another reason to be excited about this\nproject is that it will drive development of state-of-the-art compilation\ntechnologies for quantum computing.\"\n\n     Hybrid infrastructure that leverages quantum computers operating in\ntandem with classical computers over the cloud has become the predominant\nquantum computing framework for developing and running practical\napplication workflows. However, many popular quantum software tools address\nonly the quantum portion of a hybrid algorithm and are often optimized for\na specific hardware backend. The Orquestra/QCS integration targets this\ncommon issue so enterprises can benefit from an end-to-end compilation\npipeline that is optimized for quantum sampling and quantum machine\nlearning applications.The companies expect the compilation toolchain to be\navailable to Zapata customers and Rigetti Quantum Cloud Services users in\nQ2 2022.\n\n     About Rigetti Computing\n\n     Rigetti Computing is a pioneer in full-stack quantum computing.\nRigetti has operated quantum computers over the cloud since 2017 and serves\nglobal enterprise, government and research clients through its Rigetti\nQuantum Cloud Services platform. Rigetti's proprietary quantum-classical\ninfrastructure provides ultra-low latency integration with public and\nprivate clouds for high-performance practical quantum computing. Rigetti\nhas developed the industry's first multi-chip quantum processor for\nscalable quantum computing systems. Rigetti designs and manufactures its\nchips in-house at Fab-1, the industry's first dedicated and integrated\nquantum device manufacturing facility. Rigetti was founded in 2013 by Chad\nRigetti and today employs more than 140 people with offices in the United\nStates, U.K. and Australia. Learn more at www.rigetti.com.\n\n     Rigetti announced in October it has entered into a definitive merger\nagreement with Supernova Partners Acquisition Company II, Ltd.\n(\"Supernova\") (NYSE:SNII), a publicly traded special purpose acquisition\ncompany. When the transaction closes, the publicly traded company will be\nnamed Rigetti Computing, Inc. and its common stock is expected to be listed\nunder the ticker \"RGTI.\" Learn more at www.rigetti.com.\n\n     About Zapata Computing\n\n     Zapata Computing, Inc. builds quantum-ready applications(TM) for\nenterprise on Orquestra(R), the  computational workflow platform for\nquantum computing. Orquestra integrates best-in-class classical and quantum\ntechnology, including Zapata's leading-edge algorithms, open-source\nlibraries in Python, and more. Zapata has pioneered new quantum-classical\nmethods in ML, optimization and simulation to maximize value from near-term\nquantum devices, and partners closely with hardware providers across the\nquantum ecosystem such as Amazon, D-Wave, Google, IBM, IonQ, Quantinuum and\nRigetti. Learn more at ZapataComputing.com.\n\n     About Supernova\n\n     Supernova is led by Michael Clifton, who was most recently a\ntechnology investor at The Carlyle Group; Robert Reid, a long-time senior\npartner at Blackstone; Spencer Rascoff, a serial entrepreneur who\nco-founded Hotwire, Zillow, dot.LA and Pacaso and who led Zillow as CEO for\nnearly a decade; and Alexander Klabin, founder and CEO of Ancient and\nformer managing partner, co-CIO and co-founder of Senator Investment Group.\n\n     Additional Information and Where to Find It\n\n     Supernova has filed a registration statement on Form S-4 (as amended,\nthe \"Form S-4\") with the SEC, which includes a proxy statement/prospectus,\nthat is both the proxy statement to be distributed to holders of\nSupernova's ordinary shares in connection with its solicitation of proxies\nfor the vote by Supernova's shareholders with respect to the proposed\nbusiness combination and other matters as may be described in the\nregistration statement, as well as the prospectus relating to the offer and\nsale of the securities to be issued in the business combination. Supernova\nwill mail a definitive proxy statement/prospectus and other relevant\ndocuments to its shareholders. This communication does not contain all the\ninformation that should be considered concerning the proposed business\ncombination and is not intended to form the basis of any investment\ndecision or any other decision in respect of the business combination.\nSupernova's shareholders and other interested persons are advised to read\nthe definitive proxy statement/prospectus and other documents filed in\nconnection with the proposed business combination, as these materials will\ncontain important information about Rigetti, Supernova and the business\ncombination. The Registration Statement was declared effective by the SEC\non February 9, 2022 and the definitive proxy statement/prospectus and other\nrelevant documents will be mailed to shareholders of Supernova as of the\nrecord date established for voting on the proposed Business Combination and\nthe other proposals regarding the Business Combination. Shareholders will\nalso be able to obtain copies of the definitive proxy statement and other\ndocuments filed with the SEC, without charge, once available, at the SEC's\nwebsite at www.sec.gov, or by directing a request to Supernova's secretary\nat 4301 50th Street NW, Suite 300 PMB 1044, Washington, D.C. 20016, (202)\n918-7050.\n\n     Participants in the Solicitation\n\n     Supernova and its directors and executive officers may be deemed\nparticipants in the solicitation of proxies from Supernova's shareholders\nwith respect to the proposed business combination. A list of the names of\nthose directors and executive officers and a description of their interests\nin Supernova is contained in Supernova's definitive proxy\nstatement/prospectus, which was filed with the SEC and is available free of\ncharge at the SEC's website at www.sec.gov. To the extent such holdings of\nSupernova's securities may have changed since that time, such changes have\nbeen or will be reflected on Statements of Change in Ownership on Form 4\nfiled with the SEC.\n\n     Rigetti and its directors and executive officers may also be deemed to\nbe participants in the solicitation of proxies from the shareholders of\nSupernova in connection with the proposed business combination. A list of\nthe names of such directors and executive officers and information\nregarding their interests in the proposed business combination is included\nin the proxy statement/prospectus for the proposed business combination.\n\n     No Offer or Solicitation\n\n     This communication does not constitute (i) a solicitation of a proxy,\nconsent or authorization with respect to any securities or in respect of\nthe proposed business combination or (ii) an offer to sell, a solicitation\nof an offer to buy, or a recommendation to purchase any security of\nSupernova, Rigetti, or any of their respective affiliates.\n\n     Forward-Looking Statements\n\n     Certain statements in this communication may be considered\nforward-looking statements. Forward-looking statements generally relate to\nfuture events and can be identified by terminology such as \"pro forma\",\n\"may\", \"should\", \"could\", \"might\", \"plan\", \"possible\", \"project\", \"strive\",\n\"budget\", \"forecast\", \"expect\", \"intend\", \"will\", \"estimate\", \"anticipate\",\n\"believe\", \"predict\", \"potential\" or \"continue\", or the negatives of these\nterms or variations of them or similar terminology. Such forward-looking\nstatements are subject to risks, uncertainties, and other factors which\ncould cause actual results to differ materially from those expressed or\nimplied by such forward looking statements. These forward-looking\nstatements are based upon estimates and assumptions that, while considered\nreasonable by Supernova and its management, and Rigetti and its management,\nas the case may be, are inherently uncertain. Factors that may cause actual\nresults to differ materially from current expectations include, but are not\nlimited to: the outcome of any legal proceedings that may be instituted\nagainst Supernova, Rigetti, the combined company or others following the\nannouncement of the business combination and any definitive agreements with\nrespect thereto; the inability to complete the proposed business\ncombination due to the failure to obtain approval of the shareholders of\nSupernova or to satisfy other conditions to closing; changes to the\nproposed structure of the business combination that may be required or\nappropriate as a result of applicable laws or regulations or as a condition\nto obtaining regulatory approval of the business combination; the ability\nto meet stock exchange listing standards following the consummation of the\nbusiness combination; the risk that the proposed business combination\ndisrupts current plans and operations of Rigetti as a result of the\nannouncement and consummation of the proposed business combination; the\nability to recognize the anticipated benefits of the business combination,\nwhich may be affected by, among other things, competition, the ability of\nthe combined company to grow and manage growth profitably, maintain\nrelationships with customers and suppliers and retain its management and\nkey employees; costs related to the business combination; changes in\napplicable laws or regulations; the possibility that Rigetti or the\ncombined company may be adversely affected by other economic, business, or\ncompetitive factors; Rigetti's estimates of expenses and profitability; the\nevolution of the markets in which Rigetti competes; the ability of Rigetti\nto execute on its technology roadmap; the ability of Rigetti to implement\nits strategic initiatives, expansion plans and continue to innovate its\nexisting services; the impact of the COVID-19 pandemic on Rigetti's\nbusiness; and other risks and uncertainties set forth in the sections\nentitled \"Risk Factors\" and \"Cautionary Note Regarding Forward-Looking\nStatements\" in the registration statement on Form S-4 and proxy\nstatement/prospectus discussed above and other documents filed by Supernova\nfrom time to time with the SEC.\n\n     Nothing in this communication should be regarded as a representation\nby any person that the forward-looking statements set forth herein will be\nachieved or that any of the contemplated results of such forward-looking\nstatements will be achieved. You should not place undue reliance on\nforward-looking statements, which speak only as of the date they are made.\nNeither Supernova nor Rigetti undertakes any duty to update these\nforward-looking statements.\n\n    Attachment\n\n\n\n                 *\n        Rigetti Computing\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204000562.MNPRE2204002107-07265520220210</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}