{"date": "2021-11-29 13:07:13+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><h4>\n      Qualys Cloud Agent Achieves AWS Graviton Ready Designation\n    </h4>\n              <p>\n      Integrated solution delivers savings from ARM Architecture and Qualys single IT, security, and compliance platform\n    </p>\n              <div>\n                <p>\n                  <strong>FOSTER CITY, Calif. November 29, 2021 -</strong>\n                  <a href=\"https://qualys.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Qualys, Inc.</a> (NASDAQ: <a href=\"https://investor.qualys.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">QLYS</a>), a pioneer and leading provider of disruptive cloud-based IT, security, and compliance solutions, today announced it achieved the AWS Graviton Ready designation, part of the Amazon Web Services, Inc. (AWS) Service Ready Program. This designation recognizes the successful integration of the Qualys Cloud Agent with AWS Graviton Service.\n      </p>\n                <p>\n        The new integration allows joint customers to take advantage of the cost savings of AWS Graviton2 ARM architecture while leveraging Qualys' innovative Cloud Platform to secure their critical assets with a single IT, security, and compliance platform. Using the Qualys Cloud Agent, customers can easily activate multiple Qualys applications such as our game-changing VMDR (Vulnerability Management, Detection and Response) app to build a streamlined workflow on AWS.\n      </p>\n                <p>\n        \"Qualys is proud to build on its history of innovation and to work with AWS on its next-generation Graviton2 processor,\" said Sumedh Thakar, president and CEO of Qualys. \"Our customers leverage the Qualys Cloud Platform to prevent, detect, and remediate cyber threats across their enterprise. Now they can achieve their security and compliance goals while benefitting from the cost efficiency and performance of modern infrastructure like AWS Graviton\".\n      </p>\n                <p>\n        Achieving the AWS Graviton Ready designation differentiates Qualys as an AWS Partner Network (APN) member with a product integrating with AWS Graviton and is generally available and fully supported for AWS customers. AWS Service Ready Partners have demonstrated success building products integrated with AWS services, helping AWS customers evaluate and use their technology productively, at scale, and with varying levels of complexity.\n      </p>\n                <p>\n        To support the seamless integration and deployment of these solutions, AWS established the <a href=\"https://aws.amazon.com/partners/service-ready/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Service Ready Program</a> to help customers identify solutions integrated with AWS services and spend less time evaluating new tools and more time scaling their use of solutions that are integrated with AWS Services.\n      </p>\n                <p>\n                  <strong>About Qualys</strong>\n                  <br/>\n                  <a href=\"https://www.qualys.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Qualys, Inc.</a> (NASDAQ: <a href=\"https://investor.qualys.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">QLYS</a>) is a pioneer and leading provider of disruptive cloud-based IT, security, and compliance solutions with over 19,000 active customers in more than 130 countries, including a majority of each of the Forbes Global 100 and Fortune 100. Qualys helps organizations streamline and consolidate their security and compliance solutions in a single platform and build security into digital transformation initiatives for greater agility, better business outcomes, and substantial cost savings.\n      </p>\n                <p>\n        The Qualys Cloud Platform and its integrated Cloud Apps deliver businesses critical security intelligence continuously, enabling them to automate the full spectrum of auditing, compliance, and protection for IT systems and web applications across on premises, endpoints, cloud, containers, and mobile environments. Founded in 1999 as one of the first SaaS security companies, Qualys has established strategic partnerships with leading cloud providers like Amazon Web Services, Microsoft Azure and the Google Cloud Platform, and managed service providers and consulting organizations including Accenture, BT, Cognizant Technology Solutions, Deutsche Telekom, DXC Technology, Fujitsu, HCL Technologies, IBM, Infosys, NTT, Optiv, SecureWorks, Tata Communications, Verizon and Wipro. The company is also a founding member of the Cloud Security Alliance. For more information, please visit <a href=\"https://www.qualys.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.qualys.com</a>.\n      </p>\n                <p>\n        *Qualys and the Qualys logo are proprietary trademarks of Qualys, Inc. All other products or names may be trademarks of their respective companies. *\n      </p>\n                <p>\n                  <strong>Media Contact:</strong>\n                  <br/>\n         Jackie Dutton<br/>\n         Qualys<br/><a href=\"mailto:media@qualys.com\" data-type=\"email\" translate=\"no\">media@qualys.com</a></p>\n                <p>\n                  <strong>Media Contact:</strong>\n                  <br/>\n         Jackie Dutton<br/>\n         Qualys<br/><a href=\"mailto:media@qualys.com\" data-type=\"email\" translate=\"no\">media@qualys.com</a></p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.qualys.com/company/newsroom/news-releases/usa/qualys-cloud-agent-achieves-aws-graviton-ready-designation/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Qualys Inc.</strong> published this content on <strong>29 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>29 November 2021 13:07:13 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Qualys Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Qualys-Inc.</p></div>"}