{"date": "2021-12-22 19:20:55+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.34, "close": 3421.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-story-p1\"><span class=\"tr-dateline\">WASHINGTON, Dec 22 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Critics of tech giants like Alphabet's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a> Google pressed Commerce Secretary Gina Raimondo for a January meeting after she expressed concern about proposed legislation in Europe aimed at reining in the U.S. platforms.</p><p>Yelp <a href=\"reuters://REALTIME/Verb=FullQuote/ric=YELP.N\" data-type=\"ric\" data-ric=\"YELP.N\" translate=\"no\" dir=\"ltr\">YELP.N</a>, the News Media Alliance, REX and others signed a letter dated Tuesday which asked for a meeting the week of January 10-14 after Raimondo said in early December that the administration was closely watching the Digital Services Act and the Digital Markets Act being considered by Europe.</p><p>\"We have serious concerns that these proposals will disproportionately impact U.S.-based tech firms and their ability to adequately serve EU customers and uphold security and privacy standards,\" she said.</p><p>    The DSA would force Google, Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, Apple <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a> and Facebook owner Meta <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a> to do more to tackle illegal content on their platforms or risk fines up to 6% of global turnover. The DMA sets out a list of dos and don'ts for U.S. tech giants designated as online gatekeepers with fines up to 10% of global turnover for violations, a global first.</p><p>In the letter, the eight companies said that many U.S. companies supported the rules. </p><p>\"US companies have repeatedly raised concerns about the anti-competitive conduct of those dominant internet platforms and have provided evidence to European policy makers in the drafting of the EU legislative proposals,\" they wrote.</p><p>\"We hope that, moving forward, you work to advance the interests of all US companies and of US consumers when interacting with our transatlantic partners,\" they wrote.</p><p>The Commerce Department said in a statement that Raimondo supports the goals of the legislation and would continue speaking to European partners about it. \"In the video, Secretary Raimondo clearly referred to the long-standing practice of the U.S. government to consult with partners to ensure that their laws don't discriminatorily target US firms,\" the department said.</p><p>The letter was signed by Yelp, Felt, Genius, REX</p><p>News Media Alliance, Patreon, OfferFit and Beeper.</p><p><br/></p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Diane Bartz<br/>Editing by Chizu Nomiyama)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Diane.Bartz@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Diane.Bartz@thomsonreuters.com</a> ; 1 202 898 8313; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-TECH/RAIMONDO</p></div>"}