{"date": "2021-12-12 02:35:42+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3444.24, "close": 3381.83}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Updates with comment from Amazon founder Bezos</p><p class=\"tr-by\">By Richa Naidu</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">EDWARDSVILLE, Ill., Dec 11 (Reuters)</span><span class=\"tr-dl-sep\"> - </span><span class=\"tr-strong\">Six </span>Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> workers were <span class=\"tr-strong\">confirmed dead on Saturday after a </span>series of tornadoes roared through a <span class=\"tr-strong\">warehouse near St. Louis</span>, ripping off <span class=\"tr-strong\">its roof </span>and <span class=\"tr-strong\">causing 11-inch thick concrete walls longer than football fields to collapse on themselves</span>. </p><p><span class=\"tr-strong\">At least 45 Amazon employees made it out safely from the rubble of the 500,000-square-foot Edwardsville, Illinois, facility, fire chief James Whiteford said. Authorities had given up hope of finding more survivors as they shifted from rescue to recovery efforts that were expected to last days.  </span></p><p>    <a href=\"https://www.reuters.com/world/us/fifty-people-likely-killed-tornadoes-kentucky-governor-2021-12-11\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Tornadoes</a> ripped through six U.S. states Friday night, leaving a trail of death and destruction at homes and businesses  stretchi<span class=\"tr-strong\">ng</span> more than 200 miles.</p><p><span class=\"tr-strong\">The Amazon facility was hit about 8:38 p.m. central time, Whiteford said. The force of the winds was so severe the roof was ripped off and the building collapsed on itself.     </span></p><p><span class=\"tr-strong\">Witnesses said workers were caught by surprise and forced to take shelter anywhere they could find.</span></p><p><span class=\"tr-strong\">\"I had a coworker that was sending me pictures when they were taking shelter in the bathroom, basically anywhere they could hide,\" said Alexander Bird, who works at a warehouse across the street. </span></p><p><span class=\"tr-strong\">\"People had to think on their feet quick.\"</span></p><p><span class=\"tr-strong\">Amazon said all employees were normally notified and directed to move to a designated, marked shelter-in-place location when a site was made aware of a tornado warning in the area.</span></p><p><span class=\"tr-strong\">Emergency response training is provided to new employees and reinforced throughout the year, the company said.</span></p><p><span class=\"tr-strong\">It was unclear how many workers were still missing, as Amazon did not have an exact count of people working in the sorting and delivery center at the time the tornadoes hit, Whiteford said. </span></p><p>    Colleagues and family members desperate for news about loved ones gathered outside the mess of concrete and steel. </p><p>Amazon truck driver Emily Epperson, 23, said she was anxiously waiting for information on the whereabouts of her workmate Austin McEwan late Saturday afternoon to relay to his girlfriend and parents. </p><p>\"We're so worried because we believe that, you know, he would have been found by now,\" she told Reuters. </p><p>One mother told a St Louis news station that her son Clayton Cope, a 29-year-old maintenance worker, was dead. Police were yet to officially release the names of the dead.</p><p>    \"Everyone assumes they will be safe at work,\" said Illinois Governor J.B. Pritzker. \"We don't think that they will never come home.\" </p><p>Pritzker said he had been in contact with Amazon executives, who pledged financial support for the community.</p><p>Earlier, Amazon CEO Andy Jassy <a href=\"https://twitter.com/ajassy/status/1469735669442711552?s=20\" data-type=\"url\" class=\"tr-link\" translate=\"no\">posted on Twitter</a> that the company was \"heartbroken over the loss\" of its staff members and would continue to work closely with local authorities on the rescue efforts.</p><p><span class=\"tr-strong\">Amazon founder Jeff Bezos echoed Jassy in a statement shared on Twitter later on Saturday, in which he pledged the company's support to the community.  </span></p><p><span class=\"tr-strong\">\"All of Edwardsville should know that the Amazon team is committed to supporting them and will be by their side through this crisis,\" Bezos wrote. </span></p><p><span class=\"tr-strong\">The billionaire had been in Texas earlier in the day to </span><a href=\"https://www.reuters.com/lifestyle/science/daughter-pioneering-astronaut-alan-shepard-soars-space-aboard-blue-origin-rocket-2021-12-11\" data-type=\"url\" class=\"tr-link\" translate=\"no\">greet astronauts</a><span class=\"tr-strong\">, including the daughter of pioneering astronaut Alan Shepard and former NFL star Michael Strahan, as they returned from a space trip aboard his Blue Origin rocket. </span></p><p>\"It gives me shivers,\" <span class=\"tr-strong\">said Kathie </span>Burnett, 67, <span class=\"tr-strong\">who</span> <span class=\"tr-strong\">worked as </span>an <span class=\"tr-strong\">Amazon </span>delivery driver until two weeks ago, when she quit because of health reasons.</p><p>\"I would have been standing right in the middle of that track,\" she said, pointing to what remained of the facility. \"There would have been 100 trucks in there last night and you didn't see one this morning, did you?\"</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Richa Naidu in Edwardsville, Illinois, Nathan Layne in New York and Anirudh Saligrama in Bengalaru; Writing by Leela de Kretser; Editing by Caroline Stauffer, Diane Craft, Daniel Wallis, Chris Reese and Dan Grebler)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Radhika.Anilkumar@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Radhika.Anilkumar@thomsonreuters.com</a> ; +91 8067490824; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-WEATHER/TORNADOES-AMAZON.COM (UPDATE 10, PIX, TV)</p></div>"}