{"date": "2021-11-10 22:58:36.784000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3576.23, "close": 3472.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_w43nlfdo&amp;referenceId=1_w43nlfdo&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_w43nlfdo&amp;referenceId=1_w43nlfdo&amp;pageId=RefinitivNewscasts</a></pre>Source: Stocktube<br/><br/>Description: Bloom Health Partners CEO Andrew Morton and Chief Marketing Officer Abbas Khan joined Steve Darling from Proactive to share news, Maitri will now be known as Bloom Health Partners. Morton talks about the change and where he looks to take the company. &amp;#xD;&amp;#xD;Morton also shares with Proactive about their verticals and where he sees as the biggest growth opportunities. &amp;#xD;&amp;#xD;&amp;#xD;Abbas talks about the increase in capacity the company has announced in Dallas. Texas facility and the opportunities the company feels they are ready for.<br/>Short Link: <a href=\"https://refini.tv/3wvQbPi\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3wvQbPi</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; Welcome back inside our Proactive newsroom. Joining me now is Andrew Martin. He's the CEO of Bloom Health Partners. Andrew, is nice to see you. &gt;&gt; Thanks to you. Great to see you as well. &gt;&gt; Also joining us is their chief marketing officer Abbas Khan. Abbas, great to have you along as well. &gt;&gt; Steve pleasure being here. Thank you. &gt;&gt; Yeah, exciting to learn obviously about some significant changes that have been made in the company over the last little while. Andrew, why don't we begin with you. As I mentioned, Bloom Health Partners, the new name, the new brand, the new direction. Just put it all into perspective for us. &gt;&gt; Absolutely. As we merge our business together, there was an acquisition that we announced back in July. I think last time I was on your program, we've talked a bit about this. Bloom Health Partner is doing business as Bloom Health. We like the brand because we are really combining the assets of what was major health technologies at one time, which is a technical platform for health tech, really designed for occupational health and then data management. What Bloom and the Abbas team represented which was a series of labs and clinical expertise. We're bringing the two together now in a single platform for occupational health tech is what we call it. Having a single brand strategy certainly makes sense. Clients certainly respond well to it. There's some consistency in that as we go forward of clients and investors. &gt;&gt; Andrew, you mentioned that you're putting everything collaborative, but there are different divisions within that bloom, is that correct? &gt;&gt; Well, there's different components to what we now call a single platform. We're very much merged operations and merged our strategy where you have a technical component. That does everything from tracking health conditions in the worksite and at the same time, on the other side of that platform is definitely a clinical component to this. The clinical component is a series of good labs and an evolution to occupational health, which is really clinics onsite at the workplace. Now employers are able to offer on-site health care, which is frankly a perk of the next decade and this has been repeated several times by Fortune 500 CEOs. At the same time, they need a data view of what the overall risk assessment is going to be at the workplace. &gt;&gt; Yeah, Abbas I want to talk to you a little bit about a news release out yesterday, increasing the operations in Dallas, Texas just because demand is so much there. Can you talk a little bit about that and the demand that you're seeing? &gt;&gt; Yeah, absolutely. Dallas was actually originally it is where we keep our offices. What we've expanded to is actually built actual high complexity laboratories in Dallas as well. Dallas as you probably know Steve, is a hub to many businesses and also a category that we work particularly extensively which is actually Hollywood and studios are end-to-end. As Andrew mentioned, this is one platform. One of the things that separates us compared to other occupational health companies are laboratories, is when we say end-to-end, we really mean that we control the total parts of this. We always had a great network of health care professionals that were deployed on-site to these companies. But now we have matched it with the backend laboratory as well. Typically what you see is that in this industry these is very much fragmented. You either have lab companies or you have the front-end healthcare companies. By expanding to Dallas is one example where we've been able to merge and truly control the end-to-end process there. &gt;&gt; As we come out of this pandemic and anything else that may crop up in the world in the next few years to come, obviously, we don't know yet, but no doubt there will be something more coming. The ability for companies to have these types of facilities available to them is key in order to keep them working. We saw what could happen with the pandemic. Things shut down right away. But also the fact that the government is putting a lot of money behind programs as well. Is that where you see the biggest opportunity coming from as a combination of both about the government money and also private companies making sure they can sustain their workforces? &gt;&gt; Well, absolutely. I would say if you look at what's happened the last couple of weeks , it's highly controversial. However, there are government mandates now for vaccinations in the workplace, in United States. There's going to be a requirement from government for corporations of all sizes up to, well, at a minimum, excuse me, about 100 people or more which really mixed up for the majority of the companies across America. We are going to have to either vaccinate or test their workforce or both. Which means really frankly at Bloom in requirements for testing. Everybody hope pandemic would fade away by now and we would be on to other things. It seems to be a fact of life going forward. I don't think this necessarily goes away. I think it becomes something we manage as endemic some point. That's there. At the same time, there's definitely public money available and you'll hear more about this in the next little while. There's been a lot of talk about the CARES Act and things like that. In the US, we're heavily involved in what I would call public sector health testing. You're going to hear a bit more about what we're doing there in the coming weeks. What's exciting there is that there's a lot of federal money available for those testing programs. We have actually beyond Dallas, opened some other facilities which we'll be announcing here shortly as we view our official opening of these facilities that will cover other states, other regions, other public sector organizations and that's all federal money. &gt;&gt; Yeah. Abbas, it sounds like the operations that you have is almost like you can pick it up and take this type of situation in testing anywhere you want to with what you set up as the supply chain. Is that accurate? &gt;&gt; That is. That's actually Steve, how we innovated. I mentioned the movie industry originally. This came out necessity from our customers. At Bloom, there's a tagline behind Andrew there that says unstoppable is possible. Really the meaning of that is that we allow organizations to keep going. The film industry specifically, for example, required 1.3 PCR tests on site. If you can imagine a already tight lean operation and also having to add this component on top of it. How we innovated was actually by creating modular labs and we actually put high complexity labs in modular units and actually parked them on the set of the studios. That was one a type of innovation that Bloom came in and said, \"Look, this infrastructure doesn't exist today, but this is what we can help you innovate to keep going.\" &gt;&gt; Yeah makes a lot of sense. Wow, last question, Andrew, that is just for investors who are watching this, just talk a little bit to them about what you see as the benefits for this company moving forward. &gt;&gt; Great question. If you look at the business acquisition report with sexual violence CDART, we actually included this in our announcement yesterday about our expansion of the Dallas facilities. This is a business in the USAID that delivered 11.8 Million unaudited financials in the first half of the calendar year. That's a good backdrop for a really solid business here. We're now getting to the second half of the year where vaccine mandates. Public money is out there. Because of the growth potential is incredible. That's why our expansion of Dallas and that's why we can continue to expand operations in other places. The upside of this is a couple of pieces to this. There's obviously the mandates which we're now very actively worked with a number of large companies around and public sector organizations. But then the same customers that initially come to us for testing for COVID have come back and said to us, hey, we recognize you have clinical expertise, how can you help us just keep our workplace healthy in general? Occupational health is absolutely the direction we're moving in, but we're adding a huge technology component to it and taking that expertise. The upside is long-term of the decade. What we're being told is what the requirement is just to get workers to stick around and just to attract workers. They're going to have to offer new kinds of perks. Healthcare seems to be the thing that they want to have. If we give them a data component, now they can have risk assessment long-term of what the healthy organization looks like. I was told flat out by one employer that his biggest concern, he has 50,000 employees across the United States is that, for his seasonal or non-seasonal labor he has to hire. His problem is he's competing with the likes of Amazon for talent. In that regard, health care alone give that casual worker another reason to work for this individual versus one of his competitors. &gt;&gt; That makes a lot of sense. Gentlemen, thank you so much. Great update. I appreciated it. I know we're going to talk again soon. Abbas, nice to meet you. Thank you very much. &gt;&gt; Great to meet you Stephen. Thank you. &gt;&gt; [inaudible 00:08:16] the Chief Marketing Officer. Andrew, of course, always great to see you as well. &gt;&gt; Thank you. &gt;&gt; Andrew Martin, the CEO of Bloom Health Partners.<br/></span></div></div></div></div>"}