{"date": "2021-12-14 07:14:39.554000+00:00", "ticker": "ABDN", "mrkt_info": {"open": 235.0, "close": 234.9}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 4965VAberdeen Standard Eur Lgstc Inc PLC14 December 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>14 December 2021</p>\n<p>Aberdeen Standard European Logistics Income PLC</p>\n<p>ASLI acquires 122,000 sqm Madrid last-mile warehouse portfolio for €227 million</p>\n<p>-Deploys all of proceeds from recent equity raise into newly constructed, highly sustainable portfolio in fast growing e-commerce market-</p>\n<p>Aberdeen Standard European Logistics Income PLC (the \" <span>Company</span> \" or \" <span>ASLI</span> \") announces the acquisition of a portfolio of newly constructed last-mile logistics warehouses with excellent sustainability credentials, located in the first ring of Madrid, Spain, for an acquisition price of €227 million.</p>\n<p>Key Highlights:</p>\n<p>\n<span>·</span>\n<span>Prime Last-mile Logistics Portfolio:</span> the portfolio consists of four phases (\"Phases\") with Phases I-III comprising seven newly constructed logistics warehouses and Phase IV comprising one in-development, logistics warehouse with accompanying multi-level delivery van parking station (together the \"Portfolio\"). Phases I-III were acquired on 10 December 2021 with Phase IV due for completion in Q2 2022</p>\n<p>\n<span>·</span>\n<span>Tenant Base:</span> the Portfolio is let to five tenants, with Amazon Europe (\"Amazon\") accounting for 43% of the total Portfolio rental income. Global food retailer Carrefour, UK electric delivery vehicle maker Arrival and Spanish companies Talentum and MCR comprise the remaining Portfolio tenants. On completion of Phase IV, Amazon is expected to become ASLI's largest tenant by rental income</p>\n<p>\n<span>·</span>\n<span>Key Last-mile Location:</span> the Portfolio is located in the first ring of Madrid, in Gavilanes, one of the leading last-mile logistics hubs in Madrid and the wider Spanish market. Almost 6 million people are accessible within a 30-minute drive time</p>\n<p>\n<span>·</span>\n<span>Acquisition Price:</span> the Portfolio has been acquired for €227 million, representing a net initial yield of 3.4%. All leases are upward only, annual inflation linked, with strong rental growth potential. Attractive unexpired lease term of 14.8 years to expiry and 8.7 years to break</p>\n<p>\n<span>·</span>\n<span>Sustainability:</span> Phases I and II are certified LEED Silver, Phase III is certified LEED Gold and a certification of BREEAM Very Good is expected for Phase IV, further enhancing the Company's sector leading sustainability credentials</p>\n<p>\n<span>Tony Roper, Chairman of ASLI, commented:</span> \"Raising equity in September was a significant milestone for the Company and reflected our strong conviction in the Continental European logistics proposition. Having stated an ambition to scale the Company, this substantial acquisition enables us to invest the equity proceeds within three months and provide shareholders with further exposure to high-quality, well-located logistics assets with inflation protected income. The Investment Manager's scale and local presence continues to provide the Company with a strong source of investment opportunities and we are excited for the future prospects of the Company.\"</p>\n<p>\n<span>Evert Castelein, Investment Manager for ASLI,</span>\n<span>added:</span> \"This is an extremely rare opportunity to acquire a portfolio of truly last-mile warehouses, leased to investment grade counterparties, in one of Europe's nascent but fastest growing e-commerce markets. Furthermore, the scale, specification and market leading environmental credentials increase its uniqueness as an investment proposition.</p>\n<p>This acquisition further increases the weighting of the Company's assets to last-mile logistics, where a number of drivers are forecast to provide strong future rental income growth. Despite recent growth, Continental Europe remains materially behind the UK in terms of e-commerce sales penetration and we believe this provides a compelling backdrop for further strong performance.</p>\n<p>\"Our Madrid-based transaction team played a crucial role in securing this transaction and completing the required due diligence over a short timescale. This acquisition has once again highlighted the importance of having local teams with strong relationships and a deep understanding of the key local market drivers. The abrdn European logistics platform continues to grow and we are confident this will provide further near-term attractive investment opportunities.\"</p>\n<p>The Portfolio</p>\n<p>Totalling 122,000 sqm of space across the four Phases, the Portfolio comprises seven last-mile logistics facilities constructed between 2019 &amp; 2021, alongside one state-of-the-art logistics warehouse, which is under construction, with accompanying multi-level delivery van parking station, optimised for last-mile parcel delivery. Annual rental income across the Portfolio will be approximately €7.7 million with upward only, index linked leases. The four Phases consist of the following:</p>\n<p>\n<span>·</span>\n<span>Phase I:</span> two fully occupied single let warehouses constructed in 2019, with a total gross lettable area (\"GLA\") of 33,000 sqm. Talentum occupies one warehouse of 22,000 sqm GLA, representing approximately 17% of the gross Portfolio rental income. Talentum is a Spanish marketing and distribution company with 130 employees across Spain and Asia and the property serves as its key distribution hub for the Iberian Peninsula. The second warehouse, of 11,000 sqm GLA, is let to Amazon, utilised as a fully functional last-mile parcel delivery station servicing the Madrid market, representing 9% of the annual Portfolio rental income. The weighted average lease term across Phase I is 8.3 years, with 5.8 years to break</p>\n<p>\n<span>·</span>\n<span>Phase II:</span> consists of three warehouses constructed in 2020, with a total GLA of 24,600 sqm. Carrefour, the global food retailer, occupies one warehouse of 9,500 sqm GLA, representing approximately 7% of the annual Portfolio rental income. This is Carrefour's first last-mile e-commerce delivery warehouse in Spain and the company has invested materially into the asset to meet its operational requirements. The second warehouse, of 7,700 sqm GLA, is let to MCR, representing approximately 6% of the annual Portfolio rental income. MCR is a market leading Spanish electronics and IT hardware distributor. MCR services several electronics retailers such as Amazon and MediaMarkt from the asset. A third warehouse totalling 7,400 sqm is currently vacant. This asset is subject to a one year vendor rental guarantee representing approximately 6% of the annual Portfolio rental income. Excluding the rental guarantee, the weighted average lease term across Phase II is 10.2 years, with 3.7 years to break</p>\n<p>\n<span>·</span>\n<span>Phase III:</span> comprises two warehouses constructed in 2021 with a total GLA of 27,200 sqm. Phase III is single let to Arrival, the UK headquartered and Nasdaq listed electric vehicle manufacturer, representing approximately 21% of the annual Portfolio rental income. Arrival will utilise the warehouses for the production and distribution of its electric delivery vans, for a variety of clients including global 3PL specialist UPS. Arrival is committed to undertaking a significant fit out program to meet its highly automated operational requirements. The two warehouses have been developed to offer the possibility of a flexible leasing strategy, potentially catering for up to five separate occupiers. The weighted average lease term across Phase III is 9.4 years, with 5.4 years to break</p>\n<p>\n<span>·</span>\n<span>Phase IV:</span> is a state-of-the-art logistics hub, optimised for last-mile delivery, comprising a 16,500 sqm warehouse and 20,700 sqm multi-level delivery van parking station, on a long-term lease to Amazon. Phase IV is currently under development with completion expected in Q2 2022. Phase IV has been configured for a high volume of inventory turnover with the asset's low site cover, multi-level parking and large canopy with numerous van loading areas maximising the number of parcels which can be loaded and distributed. The multi-level parking station will offer over 530 parking spaces and electric charging for last-mile delivery vans, significantly increasing the operational efficiency of the asset. The Phase IV lease represents 33% of the annual Portfolio rental income and is for a term of 25 years, with 15 years to break</p>\n<p>A Key Last-mile Logistics Location</p>\n<p>The Portfolio is located in the first ring of Madrid, in the established Gavilanes submarket, 17 kilometres south of Madrid city centre. With 2.7 million people accessible within a 20-minute drive time and almost 6 million people accessible within a 30-minute drive time (87% of Madrid's population), it is considered one of the most sought after last-mile logistics hubs in both Madrid and the wider Spanish market.</p>\n<p>The Portfolio occupies a strategic micro location, at the intersection of Madrid's ring road, the M-50 motorway, and A-4 motorway, Spain's main north-south motorway, with occupiers benefiting from direct access via a newly constructed dual carriageway. The Portfolio is in close proximity to Madrid-Barajas International Airport and the Abroñigal intermodal freight terminal, providing good connectivity with the rest of Europe.</p>\n<p>Reflecting the increasing shift amongst occupiers from just-in-time to just-in-case supply chain strategies, take up of warehouse space in Madrid in H1 2021 reached a six year high, increasing by 120% on the same period in 2020. With land constraints and supply chain issues putting pressure on new development, vacancy rates have fallen to just 2% in Gavilanes and 4% in the Madrid Central area, which is supporting year on year yield compression and rental growth. Occupier demand is forecast to continue growing: whilst the first lockdown in 2020 led to a 50% increase in online sales in Spain, pre-pandemic e-commerce penetration of approximately 5% lagged other major European countries including Germany, France, Poland and Italy <span>1</span> .</p>\n<p>Sustainability</p>\n<p>In line with ASLI's approach to best-in-class sustainability, the Portfolio boasts excellent sustainability credentials. Phases I and II are certified LEED Silver and Phase III is certified LEED Gold. A certification of BREEAM Very Good is expected for Phase IV and the multi-level parking station in Phase IV includes electric charging facilities for Amazon's fleet of electric last-mile delivery vans.</p>\n<p>The Portfolio currently only benefits from a small number of rooftop solar panels installed on Phase III. In line with the Company's sustainability strategy, the Investment Manager will explore options for additional solar panel installation.</p>\n<p>Following the Company's sector leading GRESB rating awarded in October 2021, the Investment Manager believes the acquisition of the Portfolio will further enhance its sustainability position.</p>\n<p>ASLI Portfolio and Pipeline</p>\n<p>Following the acquisition of the Portfolio, the Company's asset base is expected to consist of the following <span>2</span> :</p>\n<p>\n<span>·</span>\n<span>Assets:</span> gross assets of approximately €730 million diversified across 24 last-mile logistics and mid-box warehouses located in key logistics hubs across five European countries. Assets located in Spain will account for 38% of gross assets by value, with assets located in the Netherlands accounting for 31%, with the remaining assets located across France, Germany and Poland</p>\n<p>\n<span>·</span>\n<span>Last-mile Logistics Focus:</span> last-mile logistics warehouses will account for 53% of the portfolio by value, underlining the Investment Manager's strong conviction in this sub-sector of European logistics real estate. Strong rental growth is forecast across last-mile logistics assets as e-commerce penetration in Continental Europe continues to grow significantly. The remainder of the portfolio comprises well-located, flexible mid-box logistics assets</p>\n<p>\n<span>·</span>\n<span>Modern:</span> all buildings have specifications in line with tenants' requirements providing flexibility for future tenant occupation. 18 of the Company's 24 assets were constructed after 2018, representing 77% by portfolio value</p>\n<p>\n<span>·</span>\n<span>Tenant base:</span> the Company's tenant base will be diversified across 50 tenants, consisting predominantly of 3PLs, e-commerce and grocery-focused vendors. On completion of Phase IV, Amazon will become the Company's largest tenant by rental income (10%)</p>\n<p>\n<span>·</span>\n<span>Sustainability:</span> building on the Company's sector leading GRESB rating from October 2021, the addition of this modern, sustainable Portfolio is expected to be materially accretive to the Company's sustainability position</p>\n<p>Following the acquisition of the Portfolio, all of the September equity issue proceeds will have been fully deployed. The Investment Manager currently has two additional acquisitions under offer on assets in the Netherlands and France (totalling four logistics warehouses) and a strong near-term pipeline of further acquisition opportunities, predominantly sourced by abrdn's local transaction teams. The Company hopes to provide investors with a further update in early 2022.</p>\n<p>The Investment Manager will host a conference call for analysts and institutional investors at 12.00 pm on 15 December 2021. Please contact abrdn's Head of Business Development for Closed End Funds, Luke Mason, for participation details at: luke.mason@abrdn.com or call 0207 463 5971.</p>\n<p>For further information please contact:</p>\n<p>Aberdeen Asset Management PLC +44 (0) 20 7463 6000</p>\n<p>Luke Mason</p>\n<p>Gary Jones</p>\n<p>Investec Bank plc +44 (0) 20 7597 4000</p>\n<p>David Yovichic</p>\n<p>Denis Flanagan</p>\n<p>FTI Consulting +44 (0) 20 3727 1000</p>\n<p>Dido Laurimore</p>\n<p>\n<span>Richard Gotla</span>\n</p>\n<p>\n<span>James McEwan</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>1</span>\n<span>Source: CBRE</span>\n</p>\n<p>\n<span>2</span> Using the aggregate of the Company's 30 September 2021 portfolio valuation and the total Portfolio acquisition cost</p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>ACQTJBRTMTBBBIB</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}