{"date": "2021-11-30 18:08:55+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds comment from Adobe, details on online shoppers</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Nov 30 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>U.S. shoppers headed to stores over the Thanksgiving weekend fell 3.5%, the National Retail Federation (NRF) said on Tuesday, as fewer holiday promotions and tight supplies took the shine off some of the biggest shopping days of the year.</p><p>Retailers have been advertising holiday deals as early as September and are offering smaller discounts, as they look to minimize product shortages ahead of Christmas due to supply chain bottlenecks and cushion the hit to profits from surging costs.</p><p>However, those efforts have led to a more spread out holiday shopping season and fewer people concentrating their spending on days like Black Friday and Cyber Monday.</p><p>A total of 179.8 million shoppers made purchases in stores and online over the shopping period from Thanksgiving Day through Cyber Monday, compared with 186.4 million shoppers in 2020, NRF's survey showed.</p><p>The total number of online shoppers fell 12.1% to 127.8 million, while in-store foot traffic rose 13.7% from a year ago when the pandemic kept shoppers away from stores. </p><p>\"With early deals in October, consumers were not waiting around for discounts on big shopping days like Cyber Monday and Black Friday,\" said Taylor Schreiner, director, Adobe Digital Insights.    </p><p>Data from Adobe Analytics showed online spending on both Cyber Monday and Black Friday declined for the first time ever this year. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2SH2D7\" data-type=\"storyId\" data-story-id=\"nL1N2SH2D7\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2SK31T\" data-type=\"storyId\" data-story-id=\"nL4N2SK31T\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>NRF's survey of 5,759 consumers also showed shoppers spent an average of $301.27 on holiday purchases such as gifts, toys and apparel, down from $311.75 last year.</p><p>The holiday season kicks off just as the new Omicron coronavirus variant triggers uncertainty over the economic reopening, but NRF CEO Matthew Shay warned against a return to lockdowns.   </p><p>\"We've got to continue to keep the economy open and moving forward. We want to work with the administration and President (Biden) to get that done,\" Shay said. </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Deborah Sophia in Bengaluru; Editing by Shounak Dasgupta and Shailesh Kuber)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:DeborahMary.Sophia@thomsonreuters.com\" data-type=\"email\" translate=\"no\">DeborahMary.Sophia@thomsonreuters.com</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: RETAIL-HOLIDAYSHOPPING/ (UPDATE 1, PIX)</p></div>"}