{"date": "2021-12-15 23:38:09+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3381.83, "close": 3377.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n                  <span>16 December 2021</span>\n                </div>\n                <div>\n                  <p>\n          The ACCC will not oppose the proposed acquisition of MGM by Amazon, after an investigation that concluded the transaction was unlikely to substantially lessen competition in any market in Australia.\n        </p>\n                  <p>\n          Amazon operates a range of businesses in Australia including online retail, entertainment and technology services. Amazon owns and operates the streaming platform, Prime Video which is included as part of its subscription-based Amazon Prime membership. Through Amazon Studios, Amazon is also active in the production of audio-visual content (AV content), which it licenses exclusively to Prime Video.\n        </p>\n                  <p>\n          MGM produces AV content which it distributes and licenses to exhibitors, including cinemas for theatrical release and streaming platforms. MGM has a significant library, and notable recent titles include the <span>James Bond</span> and <span>Rocky/Creed</span> film franchises, and the <span>Vikings</span> and <span>The Handmaid's Tale</span> television series.\n        </p>\n                  <p>\n          The ACCC's investigation focussed on whether Amazon would be likely to withhold or worsen the terms for other exhibitors to access MGM's content to favour Prime Video, and the impact this would have on competition if it occurred.\n        </p>\n                  <p>\n          The ACCC also closely considered the significance of MGM's titles to exhibitors such as cinemas and streaming platforms and the likely impact any reduction of access may have on the downstream markets.\n        </p>\n                  <p>\n          \"While some market participants raised concerns about Amazon's acquisition of a large AV content producer, such as MGM, our investigation found that exhibitors do not rely heavily on MGM content to attract customers,\" ACCC Commissioner Stephen Ridgeway said.\n        </p>\n                  <p>\n          \"Despite its back catalogue, MGM has only had a small number of theatrical releases in Australia in recent years. With the exception of the <span>James Bond</span> franchise, these titles have accounted for less than 6 per cent of total box office revenues in Australia in any given year since 2016.\n        </p>\n                  <p>\n          \"A number of streaming platforms have also been successful in Australia, despite not licensing any MGM content, or licensing only a small number of titles,\" Mr Ridgeway said.\n        </p>\n                  <p>\n          The ACCC concluded that MGM content is unlikely to be a key input to exhibitors of AV content. Even if Amazon were to restrict or reduce licensing to third parties, this would not result in a substantial lessening of competition in any downstream Australian market.\n        </p>\n                  <p>\n          Several suppliers of high-quality AV content will remain available to exhibitors such as cinemas and streaming platforms post-acquisition. Streaming platforms will also continue to be able to produce or fund their own content.\n        </p>\n                  <p>\n          The ACCC notes that MGM does not have exclusive control of some of its most valuable titles, including the <span>James Bond</span> franchise, which may limit Amazon's ability to exclusively license these titles to Prime Video. EON Productions, which co-owns the <span>James Bond</span> franchise has stated publicly that it is committed to continue making <span>James Bond</span> films for theatrical audiences.\n        </p>\n                  <p>\n          The competitive effects of acquisitions by large digital platforms, with a presence in multiple markets continue to be of concern to the ACCC. Although the ACCC does not consider Amazon's acquisition of MGM will likely substantially lessen competition, it will continue to closely review similar acquisitions.\n        </p>\n                  <p>\n          The ACCC notes that the proposed acquisition is subject to reviews by regulators in other jurisdictions, including the US and the EU.\n        </p>\n                  <p>\n          Further information is available at: <a href=\"https://www.accc.gov.au/public-registers/mergers-registers/public-informal-merger-reviews/amazoncom-inc-proposed-acquisition-of-mgm-holdings-inc\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. proposed acquisition of MGM Holdings Inc</a></p>\n                  <p>\n                    <strong>Background</strong>\n                  </p>\n                  <p>\n          Amazon.com, Inc. (Amazon) is a US-based digital platform which operates a range of businesses including retail, entertainment, consumer electronics and technology services globally. Most relevantly, Amazon is active in the production of audio-visual content through Amazon Studios, which is available alongside third party content on its streaming platform Prime Video, part of its subscription-based Amazon Prime offering.\n        </p>\n                  <p>\n          MGM Holdings Inc. (MGM) is a Hollywood studio active in the production and global distribution of films for theatrical release in cinemas, as well as the production and licensing of film and TV content for distribution via all forms of digital home entertainment, including streaming platforms (also known as subscription-video-on-demand). Some of MGM's most well-known titles include the <span>James Bond</span> franchise, the <span>Rocky</span>/Creed franchise, <span>The Silence of the Lambs,</span><span>Legally Blonde</span>, <span>The Pink Panther</span>, <span>Tomb Raider</span>, <span>The</span><span>Handmaid's Tale</span>, <span>Fargo</span>, <span>Vikings</span>, <span>Survivor, The Real Housewives, Shark Tank</span> and <span>Teen Wolf</span>.\n        </p>\n                  <p>\n          'Exhibitors' of AV Content include cinemas, free to air television, pay television, streaming platforms and distributors of DVDs/Blu ray discs.\n        </p>\n                </div>\n                <div>\n                  <div>\n          Release number:\n        </div>\n                  <div>\n          216/21\n        </div>\n                </div>\n                <div>\n                  <div>\n          ACCC Infocentre:\n        </div>\n                  <div>\n                    <p>\n            Use this form to <a href=\"https://www.accc.gov.au/contact-us/contact-the-accc/make-an-enquiry\" data-type=\"url\" class=\"tr-link\" translate=\"no\">make a general enquiry</a>.\n          </p>\n                  </div>\n                </div>\n                <div>\n                  <div>\n          Media enquiries:\n        </div>\n                  <div>\n          Media Team - 1300 138 917, media@accc.gov.au\n        </div>\n                </div>\n                <div>\n                  <h4>\n          Tags\n        </h4>\n                  <div>\n                    <div>\n            Topics\n          </div>\n                    <ul class=\"bulleted-list arrowlist\">\n                      <li>\n                        <a href=\"https://www.accc.gov.au/taxonomy/term/147\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Mergers</a>\n                      </li>\n                    </ul>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.accc.gov.au/media-release/amazons-proposed-acquisition-of-mgm-not-opposed\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Australian Competition and Consumer Commission</strong> published this content on <strong>16 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>15 December 2021 23:38:09 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Australian Competition and Consumer Commission</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Australian-Competition-and-Consumer-Commission</p></div>"}