{"date": "2021-11-04 04:37:23.713000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Amazon Australia executives have gone on the defensive after being questioned over whether the company is underpaying drivers by a third of the recommended minimum rate in Victoria.</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>During a fiery exchange at a Senate hearing on Thursday, committee chair and Labor senator Tony Sheldon pressed the executives on why they paid Amazon Flex drivers a minimum rate of $27 an hour when the recommended minimum hourly rate for owner-drivers in Victoria is $40 an hour.</p>\n<p>Amazon's Michael Cooley rejected the assertion the company was underpaying drivers and said it complied with all relevant laws in all the states in which it operates.</p>\n<p>Mr Cooley said the average a Flex driver is paid is more than $125 for a four-hour block. This equates to $31.25 an hour.</p>\n<p>But Mr Cooley refused to answer questions specifically related to the document that spells out the recommended minimum rate in Victoria, saying he received the document two hours before the hearing and should have been given it weeks ago if its contents was to become a line of questioning.</p>\n<p>Senator Sheldon accused the executives of contradicting themselves by insisting Amazon Australia complied with all relevant minimum rates while simultaneously saying they could not answer questions about the Victorian rate.</p>\n<p>\"You are flagrantly lying to me,\" he said.</p>\n<p>The Victorian rates and costs schedule Senator Sheldon referred to explicitly states it does not set minimum rates that must be paid.</p>\n<p>It instead outlines a recommended minimum rate for an owner-driver to be able to \"operate a business on a sustainable basis\".</p>\n<p>The executives did not bring a copy of the document to the hearing, drawing the ire of Senator Sheldon.</p>\n<p>\"Can they send it to your iPhone?\" he asked.</p>\n<p>\"Our office is almost empty,\" Mr Cooley replied. \"Very few people have returned to the office because of COVID, people are being encouraged to work from home.</p>\n<p>\"(We are) appearing before this committee at relatively short notice and are doing the best with what we have.\"</p>\n<p>Mr Cooley rejected claims the company was distorting the market and risking the job security of other drivers by forcing transport companies like FedEx and StarTrack to compete with the lower wages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Australian Associated Press</p></div>"}