{"date": "2021-12-09 01:07:11.966000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.29, "close": 3483.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>IBEX LTD (\"IBEX-Q\")\n- Board of Directors Approves Share Repurchase Plan\n\n     IBEX Limited (the \"Company\") announces that its board of directors has\nauthorized the repurchase of up to US$20 million of the Company's common\nstock.\n\n     \"This announcement demonstrates our confidence in IBEX's business and\nunderlying intrinsic value,\" said Bob Dechant, Chief Executive Officer at\nIBEX. \"While we continue to focus on IBEX's reinvestment opportunities and\nrunway for growth, we believe that recent changes in the trading values of\nour shares have provided us with an opportunity to enhance our long-term\nvalue per share. We will continue to purchase our shares opportunistically\nat times when we believe our stock price does not reflect the intrinsic\nvalue of our company.\"\n\n     The Company's proposed repurchases may be made from time to time\nthrough open market transactions at prevailing market prices, in privately\nnegotiated transactions, in block trades and/or through other legally\npermissible means, depending on the market conditions and in accordance\nwith applicable rules and regulations. The actual timing, number, and\ndollar amount of repurchase transactions will be determined by management\nat its discretion and will depend on a number of factors including, but not\nlimited to, the market price of the Company's common shares, general market\nand economic conditions, and compliance with Rule 10b-18 and/or Rule 10b5-1\nunder the Securities Exchange Act of 1934, as amended.\n\n     The Company's board of directors (\"Board\") will review the repurchase\nprogram periodically and may authorize adjustment of its terms and size or\nsuspend or discontinue the program. The Company expects to fund the\nrepurchases under this program with its existing cash balance. The\nrepurchase program will be executed consistent with the Company's capital\nallocation strategy, which will continue to prioritize aggressive\ninvestments to grow the business.\n\n     The repurchase program does not obligate the Company to acquire any\nparticular amount of common shares, and the repurchase program may be\nsuspended or discontinued at any time at the Company's discretion.\n     About ibex\nibex helps the world's preeminent brands more effectively engage their\ncustomers with services ranging from customer support, technical support,\ninbound/outbound sales, business intelligence and analytics, digital demand\ngeneration, and CX surveys and feedback analytics.\n\n     Forward Looking Statements\nIn addition to historical information, this release contains\n\"forward-looking statements\" within the meaning of the Private Securities\nLitigation Reform Act of 1995. In some cases, you can identify\nforward-looking statements by terminology such as \"believe,\" \"may,\" \"will,\"\n\"estimate,\" \"continue,\" \"anticipate,\" \"intend,\" \"should,\" \"plan,\" \"expect,\"\n\"predict,\" \"potential,\" or the negative of these terms or other similar\nexpressions. These statements include, but are not limited to, statements\nregarding our future financial and operating performance, including our\noutlook and guidance, and our strategies, priorities and business plans.\nThese statements include, but are not limited to, statements by our\nmanagement or the Board regarding expectations for the repurchase of our\ncommon shares, including the aggregate amount, timing, and manner of such\nrepurchases, and statements of plans, objectives, and expectations of us,\nour management or the Board. Our expectations and beliefs regarding these\nmatters may not materialize, and actual results in future periods are\nsubject to risks and uncertainties that could cause actual results to\ndiffer materially from those projected. Factors that could impact our\nactual results include: developments relating to COVID-19; our ability to\nattract new business and retain key clients; our ability to enter into\nmulti-year contracts with our clients at appropriate rates; the potential\nfor our clients or potential clients to consolidate; our clients deciding\nto enter into or further expand their insourcing activities; our ability to\noperate as an integrated company under the ibex brand; our ability to\nmanage portions of our business that have long sales cycles and long\nimplementation cycles that require significant resources and working\ncapital; our ability to manage our international operations, particularly\nin Pakistan and the Philippines and increasingly in Jamaica and Nicaragua;\nour ability to comply with applicable laws and regulations, including those\nregarding privacy, data protection and information security; our ability to\nmanage the inelasticity of our labor costs relative to short-term movements\nin client demand; our ability to realize the anticipated strategic and\nfinancial benefits of our relationship with Amazon; our ability to recruit,\nengage, motivate, manage and retain our global workforce; our ability to\nanticipate, develop and implement information technology solutions that\nkeep pace with evolving industry standards and changing client demands; our\nability to maintain and enhance our reputation and brand; and other factors\ndiscussed under the heading \"Risk Factors\" in our annual report on Form\n20-F filed with the U.S. Securities and Exchange Commission on October 14,\n2021 and any other risk factors we include in subsequent reports on Form\n6-K. Because of these uncertainties, you should not make any investment\ndecisions based on our estimates and forward-looking statements. Except as\nrequired by law, we undertake no obligation to publicly update any\nforward-looking statements for any reason after the date of this press\nrelease whether as a result of new information, future events or otherwise.\n\n\n     IR Contact: Daniel Bellehsen, Executive Vice President, Investor\nRelations &amp; Corporate Development, ibex, Dan.Bellehsen@ibex.co\n\nTel   : 441-295-6500    IBEX LTD\nWWW   : <a href=\"https://www.ibex.co\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.ibex.co</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134101157.MNPRE2134103619-17031120211208</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}