{"date": "2021-12-07 15:24:27.601000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>TREND MICRO INC (\"TMICF,TMICY-0;TMI-F\")\n- Prediction Report Forecasts Cyber Fightback in 2022\n\n     Trend Micro Incorporated (TYO: 4704; TSE: 4704), a global\ncybersecurity leader, today predicted global organizations will emerge more\nalert and better prepared in 2022 thanks to a comprehensive, proactive,\ncloud-first approach to mitigating cyber risk.\n\n     Research, foresight, and automation are critical for organizations to\nmanage risk and secure their workforce. Trend Micro blocked 40.9 billion\nemail threats, malicious files and malicious URLs for customers in the\nfirst half of 2021 alone - a 47% year-over-year increase.\n\n     \"We have more cybersecurity researchers embedded across the globe than\nany competitor, and those insights and discoveries are used widely within\nthe industry and power our own product offerings,\" said Kevin Simzer, chief\noperating officer at Trend Micro. \"These teams power much of the threat\nintelligence for which we are renowned.\"\n\n     Trend Micro researchers predict that threat actors in 2022 will focus\nransomware attacks on cloud and datacenter workloads and exposed services\nto take advantage of the large number of employees continuing to work from\nhome. Vulnerabilities will be weaponized in record time and chained with\nprivilege escalation bugs to drive successful campaigns, according to the\nreport.\n\n     \"It's been a tough couple of years for cybersecurity teams, disrupted\nby work-from-home mandates and challenged as corporate attack surfaces have\nexploded in size,\" said Jon Clay, vice president of threat intelligence for\nTrend Micro. \"However, as hybrid work emerges and more certainty returns\nday-to-day, security leaders will be able to plot a robust strategy to plug\ngaps and make the bad guys work much harder.\"\n\n     IoT systems, global supply chains, cloud environments, and DevOps\nfunctions will be in the crosshairs. More sophisticated commodity malware\nstrains will be aimed at SMBs.\n\n     However, Trend Micro predicts that many organizations will be ready\nfor the challenge as they build out and implement a strategy to proactively\nmitigate these emerging risks via:\n\n//st\n\n  * Stringent server hardening and application control policies to tackle\n    ransomware\n  * Risk-based patching and a high-alert focus on spotting security gaps\n  * Enhanced baseline protection among cloud-centric SMBs\n  * Network monitoring for greater visibility into IoT environments\n  * Zero Trust principles to secure international supply chains\n  * Cloud security focused on DevOps risk and industry best practices\n  * Extended detection and response (XDR) to identify attacks across entire\n    networks\n\n//et\n\n  To read a full copy of Trend Micro's 2022 predictions report, please\nvisit:\n<a href=\"https://documents.trendmicro.com/assets/rpt/rpt-toward-a-new-momentum-trend\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://documents.trendmicro.com/assets/rpt/rpt-toward-a-new-momentum-trend</a>\n-micro-security-predictions-for-2022.pdf\n\n     About Trend Micro\n     Trend Micro, a global cybersecurity leader, helps make the world safe\nfor exchanging digital information. Fueled by decades of security\nexpertise, global threat research, and continuous innovation, Trend Micro's\ncybersecurity platform protects hundreds of thousands of organizations and\nmillions of individuals across clouds, networks, devices, and endpoints. As\na leader in cloud and enterprise cybersecurity, the platform delivers a\npowerful range of advanced threat defense techniques optimized for\nenvironments like AWS, Microsoft, and Google, and central visibility for\nbetter, faster detection and response. With 7,000 employees across 65\ncountries, Trend Micro enables organizations to simplify and secure their\nconnected world. www.TrendMicro.com.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134000259.MNPRE2134002097-07232020211207</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}