{"date": "2022-01-19 15:11:04.984000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>LOWES COMPANIES INC (\"LOW-N\")\n- To Receive $2 Million in Donated Appliances from Lowe's to Support\n- Families Recovering from Tornadoes in Kentucky and Five Other States\n\n     Good360, the global leader in product philanthropy and purposeful\ngiving, announced that Lowe's has committed $2 million in appliances to\nsupport up to 2,000 families recovering from the series of deadly tornadoes\nthat ripped through the South and the Midwest on Dec. 10-11.\n\n     \"When dealing with a natural disaster of this magnitude, Good360 works\nwith corporate donors like Lowe's and local nonprofits on the ground to get\nthe right goods to the right people at the right time throughout all stages\nof the recovery process,\" said Matt Connelly, CEO of Good360. \"We are\nthankful to Lowe's for this donation that is sure to have a massive impact\non the recovery process and will provide peace of mind as the rebuilding\nprocess begins.\"\n\n     \"Our hearts and prayers are with our associates and communities\naffected by these devastating tornadoes, and we recognize this will be a\nlong recovery for many families,\" said Lowe's Chairman and CEO Marvin\nEllison. \"Along with our initial pledge of $1 million, and the 14,000 meals\ndistributed to families before Christmas, we hope these products will help\nlighten the burden for our neighbors as they continue to recover and\nrebuild.\"\n\n     Areas impacted by natural disasters have complex needs for many\nmonths, and even years, after the disaster has occurred.  Good360's aim is\nto advance collaboration and engagement between the private, public and\nnonprofit sectors in a way that anticipates the current and the future\nstate of natural disasters to collectively build proactive models for\nresponse and recovery.  With 80 percent of giving occurring within the\nfirst six weeks after a disaster, Good360 stresses the importance of\nthinking long-term.\n\n     \"The needs of communities impacted by natural disasters don't go away\nonce the news cameras are gone,\" said Connelly.  \"Good360 is fortunate to\npartner with companies and organizations that provide support during all\nphases of a disaster.\"\n\n     As communities continue to assess the damage, Lowe's is working with\nGood360 to help those with critical needs in their homes. Installation of\nthe donated appliances will begin as early rebuilds and repairs are\ncompleted, starting with Graves and Hopkins Counties.\n\n     About Good360\n\n     Good360's mission is to close the need gap by partnering with socially\nresponsible companies to source highly needed donated goods and distribute\nthem through its diverse network of more than 100,000 vetted nonprofits. In\ndoing so, Good360 opens opportunity for those in need, for the nonprofits\nthat support them, and for companies that donate the goods, all while\nkeeping usable items out of landfills. Good360 has distributed more than\n$11 billion in donated goods thanks to corporate donors such as Advance\nAuto Parts, Amazon, American Eagle Outfitters, CVS Health, Gap, Inc., Levi\nStrauss &amp; Company, Mattel, Tempur Sealy International, and UPS.  Good360 is\na registered 501(c)(3) organization. Learn more at <a href=\"https://www.good360.org\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.good360.org</a>.\n\n     About Lowe's\nLowe's Companies, Inc. (NYSE: LOW) is a FORTUNE(R) 50 home improvement\ncompany serving approximately 20 million customers a week in the United\nStates and Canada. With fiscal year 2020 sales of nearly $90 billion,\nLowe's and its related businesses operate or service more than 2,200 home\nimprovement and hardware stores and employ over 300,000 associates. Based\nin Mooresville, N.C., Lowe's supports the communities it serves through\nprograms focused on creating safe, affordable housing and helping to\ndevelop the next generation of skilled trade experts. For more information,\nvisit Lowes.com.\n\nTel   : 1-704-758-1000    LOWES COMPANIES INC\nEmail : investorrelations@lowes.com\nWWW   : <a href=\"https://www.lowes.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.lowes.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201800306.MNPRE2201801758-07081720220119</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}