{"date": "2022-01-11 14:11:34.950000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENTHUSIAST GAMING INC (\"EGLX-TQ\")\n- And e.l.f. Cosmetics Announce \"Rising Stars: Collegiate Edition\"\n- Talent Competition To Find The Next Gaming Superstar\n\n     Enthusiast Gaming Holdings Inc. (\"Enthusiast Gaming\" or the\n\"Company\"), a media and content platform for video game and esports fans to\nconnect and engage, announced the new season of \"Rising Stars,\" a\ncompetition series that searches for the next great content creators. This\nseason, e.l.f. Cosmetics (NYSE: ELF) will co-create the series with\nEnthusiast Gaming, to discover the next gaming superstars from colleges\nacross the U.S. and Canada.\n\n     \"We are thrilled to welcome e.l.f. Cosmetics as our first Rising Stars\nco-creators, building on the success of properties including Gamers'\nGreatest Talent and Luminosity Academy, which connect top brands with\ngaming and esports fans,\" said Adrian Montgomery, CEO of Enthusiast Gaming.\n\"We are looking for a diverse mix of up-and-coming creators from colleges\nacross the U.S. and Canada, who will have a chance to learn from top gamers\nand mentors as they compete for a spot on our Luminosity Gaming roster.\"\n\n     Rising Stars: Collegiate Edition contestants will submit an audition\nclip demonstrating their content creator skills, while speaking to their\nmotivation for seeking to join Luminosity Gaming. The winner will be\nawarded a $100,000 contract and join the Luminosity Gaming roster,\nalongside gaming stars such as @xQc and @NickEh30. The two runners-up will\nwin a US$2,500 college grant, courtesy of e.l.f. All finalists will receive\na limited-edition collection of e.l.f.'s OG products.\n\n     The series will feature top gaming stars including Luminosity Gaming's\n@xChocoBars and @TheSommerset, who will serve as mentors to each of the\ncompetitors.\n\n     \"We are excited to co-create with Enthusiast Gaming to empower the\nnext generation of rising stars in gaming,\" said Kory Marchisotto, CMO of\ne.l.f. Beauty. \"We look forward to inspiring confidence and unleashing the\ncreativity and self-expression of up-and-coming creators.\"\n\n     e.l.f. ventured into gaming in the fall of 2020 when it teamed up with\nLoserfruit, also known as Lufu, one of the world's top gamers. In May 2021,\ne.l.f. joined forces with Enthusiast Gaming and TikTok to launch Gamers'\nGreatest Talent, a series that searched for the TikTok gaming community's\nhidden talents. e.l.f. was then one of the first major beauty brands to\nlaunch a branded channel on Twitch titled \"e.l.f. You\", which champions\nempowerment in gaming and features new streams every week.\n\n     The four-week live competition series will premiere on February 26th\non Luminosity Gaming's Twitch channel, www.twitch.tv/lgloyal, and on\nwww.twitch.tv/elfyou.\n\n     Applications are open from January 17th through February 14th. To\nregister and for a detailed schedule of events and activations, visit the\nRising Stars website, <a href=\"https://www.risingstars.gg\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.risingstars.gg</a>/\n\n     About Enthusiast Gaming\n\n     Enthusiast Gaming is building the largest media and content platform\nfor video game and esports fans to connect and engage worldwide. Combining\nthe elements of its four core pillars; Media, Talent, Esports and\nExperiences, Enthusiast Gaming provides a unique opportunity and integrated\napproach to reach and connect with its coveted GenZ and Millennial\naudience. Through its proprietary mix of digital media and entertainment\nassets, Enthusiast Gaming has built a vast network of like-minded\ncommunities to deliver the ultimate fan experience.\n\n     About e.l.f. Cosmetics\n\n     Since 2004, e.l.f. Cosmetics has made the best of beauty accessible to\nevery eye, lip and face. We make high-quality, prestige-inspired cosmetics\nand skin care products at an extraordinary value and are proud to be 100%\nvegan, clean and cruelty-free. As one of the first online beauty brands,\ne.l.f. continues to attract a highly engaged audience and set benchmarks\nwith new digital platforms. Our brand is widely available at leading\nretailers such as Target, Walmart and ULTA Beauty, and has a growing\ninternational presence including at Boots, Superdrug, and Douglas. Learn\nmore by visiting www.elfcosmetics.com.\n\nContact:\n\nEnthusiast Gaming\n\nEric Bernofsky, Chief Corporate Officer, Enthusiast Gaming\ninvestor@enthusiastgaming.com\n\nMedia Relations:\nAshley Stanhope, Provident Communications\nashley@providentcomms.com\n416-303-1498\n\ne.l.f. Cosmetics Media Relations:\nMelinda Fried, Head of Corporate Communications\nmfried@elfbeauty.com\n\n     Neither the TSX Exchange nor its Regulation Services Provider (as that\nterm is defined in the policies of the TSX Exchange) accept responsibility\nfor the adequacy or accuracy of this release.\n\n     This news release contains certain statements that may constitute\nforward-looking information under applicable securities laws. All\nstatements, other than those of historical fact, which address activities,\nevents, outcomes, results, developments, performance or achievements that\nEnthusiast Gaming anticipates or expects may or will occur in the future\n(in whole or in part) should be considered forward-looking information.\nOften, but not always, forward-looking information can be identified by the\nuse of words such as \"plans\", \"expects\", \"is expected\", \"budget\",\n\"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\", or\n\"believes\" or variations (including negative variations) of such words and\nphrases, or statements formed in the future tense or indicating that\ncertain actions, events or results \"may\", \"could\", \"would\", \"might\" or\n\"will\" (or other variations of the forgoing) be taken, occur, be achieved,\nor come to pass. Forward-looking statements in this news release include,\nbut are not limited to, statements regarding planned media activations and\npartnership activities related to brand activations, and the production and\nbroadcasting of live content.\n\n     Forward-looking statements are based on assumptions and analyses made\nby the Company in light of its experience and its perception of historical\ntrends, current conditions and expected future developments, including, but\nnot limited to, expectations and assumptions concerning: interest and\nforeign exchange rates; capital efficiencies, cost saving and synergies;\ngrowth and growth rates; the success in the esports and media industry; and\nthe Company's growth plan. While Enthusiast Gaming considers these\nassumptions to be reasonable, based on information currently available,\nthey may prove to be incorrect. Readers are cautioned not to place undue\nreliance on forward-looking statements. In addition, forward-looking\nstatements necessarily involve known and unknown risks, including, without\nlimitation, risks associated with general economic conditions; the timing\nand filing of the final base shelf prospectus and corresponding\nRegistration Statement; the potential offering of any Securities by the\nCompany; uncertainty with respect to the completion of any future offering;\nthe ability to obtain applicable regulatory approvals for any contemplated\nofferings; the ability of the Company to negotiate and complete future\nfunding transactions; adverse industry events; and future legislative, tax\nand regulatory developments. Readers are cautioned that the foregoing list\nis not exhaustive. For more information on the risk, uncertainties and\nassumptions that could cause anticipated opportunities and actual results\nto differ materially, please refer to the public filings of Enthusiast\nGaming which are available on SEDAR at www.sedar.com. Readers are further\ncautioned not to place undue reliance on forward-looking statements as\nthere can be no assurance that the plans, intentions or expectations upon\nwhich they are placed will occur. Such information, although considered\nreasonable by management at the time of preparation, may prove to be\nincorrect and actual results may differ materially from those anticipated.\nForward-looking statements contained in this news release are expressly\nqualified by this cautionary statement and reflect our expectations as of\nthe date hereof, and thus are subject to change thereafter. Enthusiast\nGaming disclaims any intention or obligation to update or revise any\nforward-looking statements, whether as a result of new information, future\nevents or otherwise, except as required by applicable law.\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201000090.MNPRE2201001068-05403820220111</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}