{"date": "2021-12-09 13:53:12.662000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.29, "close": 3483.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Rebel Foods, the world's largest internet restaurant company, has onboarded former Amazon Vice President India Operations \u0096 Prakash Dutta as its Global COO in December 2021. The company said the appointment echoes its commitment to creating an extraordinary customer-first experience through seamless operations globally. Dutta with his expertise will oversee operations across Rebel\u0092s 10 countries while building customer love through customer touchpoints for sustainable growth. Dutta\u0092s appointment comes at a critical time where the company aims to be present across 100 Indian cities and 20 countries in the next few quarters.</p><p>\u0093As we are hitting a global scale, our thinking and ambition now have reached a grander proportion. Prakash (Dutta) with his decades of experience in building and scaling businesses 10X will bring the requisite know-how to help Rebel reach and operate at that scale,\u0094 said Jaydeep Barman, co-founder at Rebel Foods. \u0093Prakash (Dutta) is also known for his inspiring people leadership, humility and innovation mindset, and as a result, he is a great culture fit to Rebel. As the Global COO for Rebel, he will oversee our entire operations including India and International. The team and I are looking forward to working with him and learning from him.\u0094</p></div><div class=\"tr-npp-body\"><p>Prakash Dutta, an alumnus of Birla Institute of Technology, was formerly the vice president customer fulfilment operations and supply chain for Amazon India. There he built, scaled and headed the company\u0092s operations for over 6 years. Prior to that he was at ITC for 15 years. With over 20 years of experience in w-commerce and FMCG, Dutta will be helping the global operations team for Rebel Foods. In his previous leadership roles, he was instrumental in creating a lasting customer experience and led many network-wide transformational initiatives to create a real impact on speed, fulfillment cost and network flexibility. Dutta at Rebel Foods will work directly with country heads and operations teams while expanding to new geographies and serving more customers.</p><p>\u0093I'm humbled and excited to join Rebel Foods to scale and accelerate the growth of the world's largest internet restaurant company,\u0094 said Prakash Dutta, Global COO at Rebel Foods. \u0093The Indian food services industry is poised for rapid growth and Rebel Foods, being the frontrunner with its customer-first ideology, is well-positioned to leverage this opportunity.\u0094</p><p>In October this year, Rebel Foods became the country\u0092s 31st unicorn after it raised $175 million in a Series F round led by Qatar Investment Authority (QIA), sovereign wealth fund of the State of Qatar with participation from existing investors Coatue and Evolvence. This round catapulted the company to a unicorn status with a valuation of $1.4 billion, up from about $800 million last year.</p><p>Rebel Foods operates over 450 kitchens globally across 60 cities in over 10 countries. The company has successfully built multiple $20 million (Rs 150 crore) restaurant brands over the past few years with multiple category-leading brands such as Faasos, Behrouz Biryani and Ovenstory Pizza.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}