{"date": "2021-12-08 16:06:11.399000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.29, "close": 3483.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>GOOD GAMING INC (\"GMER-0\")\n- To Immediately Initiate A Nano Factory Token Holder Vote To\n- Determine The MicroBuddies(TM) Mainnet Launch Readiness For\n- December 2021\n\n     Good Gaming, Inc. (the \"Company\") is pleased to announce the\ninitiation of a special vote with its Nano Factory Tokens holders in order\nto determine its mainnet launch readiness for its imminent December launch\ndate.\n\n     On December 08, 2021, at 7 pm EST, Nano Factory Token holders will be\nentitled to vote on the game's launch readiness via Snapshot's off-chain\ngasless multi-governance client. The voting process is simple: each Nano\nFactory Token will be equal to one vote. The more Nano Factory Tokens a\nholder has, the more voting power they will possess in determining the\nreadiness of the game's mainnet launch slated for December.\n\n     The voting period will end Friday, December 10th at 7 AM EST. If the\nvote passes, MicroBuddies(TM) will announce its official December 2021\nlaunch date within three business days of the vote close, along with its\nrequired 8K filing with the SEC. The Company plans to utilize its vast\ninfluencer and marketing network to increase awareness of the game launch.\n\n     If the vote does not pass, The Company will announce its next series\nof updates and the subsequent vote date within three business days of the\nvote close.\n\n     The vote will take place at:\n\n<a href=\"https://snapshot.org\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://snapshot.org</a>/#/mbm.eth/proposal/QmXPXnUSBJHLajd5ji9HoBZW2WESvs3NVrw\nQ1okqvGftrR\n\n     Nano Factory Token holders are encouraged to monitor Discord for more\nofficial announcements from the MicroBuddies team as the voting process\nbegins.\n\n     To celebrate the launch of MicroBuddies and encourage strategic play,\nwe are excited to announce that we will be holding a \"Divine Hunt\"\ncompetition with a prize pool of 5 ETH (Over $20,000 at the time of\nwriting.) The first player to create a Divine rarity buddy for each of the\n10 MicroBuddies species will be awarded a share of the 5 Ethereum prize\npool.\n\n     Divine Buddies are the rarest replicable MicroBuddies in the game.\nThey are created by acquiring the rarest traits possible for a species in\nall six dominant slots.\n\n     In additional news, our legal team has completed and finalized terms\nand conditions, and they will be posted to the microbuddies.io site on\nFriday, December 10, 2021.\n\n     About NFTs\n\n     The NFT market has created tremendous new opportunities in the art and\ngaming industry. As of September 01, 2021, more than $5.5 billion was spent\non NFTs, representing an increase of 50 times the trading of Q4 2020.\n\n     NFT breeding games such as CryptoKitties operate by allowing players\nto collect virtual cats and \"breed\" them together to make new, unique cats.\nThe NFTs can then be sold to others on third-party marketplaces such as\nOpenSea and typically pay a royalty of 2.5%-10% to the organization that\ncreated the project. With a recent valuation exceeding $7.6 billion dollars\nfor its parent company Dapper Labs and NFT games like Axie Infinity, which\nrecently posted over $2 billion in sales YTD, the Company feels its\nfirst-to-market NFT game MicroBuddies(TM) is poised to obtain market share\nin the NFT gaming space.\n\n<a href=\"https://blockworks.co/nft-market-is-far-from-over-as-sales-hit-12-month-hig\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://blockworks.co/nft-market-is-far-from-over-as-sales-hit-12-month-hig</a>\nh/\n\n<a href=\"https://cointelegraph.com/news/opensea-trading-volume-explodes-76-240-ytd-a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://cointelegraph.com/news/opensea-trading-volume-explodes-76-240-ytd-a</a>\nmid-nft-boom\n\n<a href=\"https://venturebeat.com/2021/09/16/sky-mavis-hits-2b-in-sales-for-its-nft-g\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://venturebeat.com/2021/09/16/sky-mavis-hits-2b-in-sales-for-its-nft-g</a>\name-axie-infinity/\n\n<a href=\"https://news.bitcoin.com/end-of-augusts-nft-sales-tapped-all-time-high-at-1\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://news.bitcoin.com/end-of-augusts-nft-sales-tapped-all-time-high-at-1</a>\n-billion-last-weeks-nft-sales-hit-821-million/\n\n     About MicroBuddies(TM)\n\n     Good Gaming, Inc. is in the final stages of preparation for the\nmainnet launch of its first-to-market collectible NFT game,\nMicroBuddies(TM), where players will be able to collect lovable,\nself-replicating microbes that passively produce their own in-game currency\nGOO(TM).\n\n     GOO(TM) can be used to replicate new MicroBuddies(TM) from existing\nones and customize their genome using a strategic artificial selection\nprocess. Well-bred MicroBuddies(TM) will have a high rate of GOO(TM)\nproduction, so players who develop their skills will be able to create\ngreater opportunities for themselves.\n\n     At the Polygon Mainnet launch of MicroBuddies(TM), a player will use\ntheir special Nano Factory Tokens to synthesize Generation 0\nMicroBuddies(TM) and begin the game. The first 2,500 MicroBuddies(TM),\ncollectively known as Generation 0, are expected to be the rarest and most\nscarce set of MicroBuddies(TM) and what the rest of the game will propagate\nfrom. If the Nano Factory Tokens sell out, or a player fails to purchase a\nNano Factory Token prior to the launch of the game, the only way to acquire\na MicroBuddy and play will be to first purchase one from another player on\nthe secondary market at the fair market value.\n\n     To purchase MicroBuddies(TM) limited edition Nano Factory Tokens, go\nto:\n\n     <a href=\"https://microbuddies.io\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://microbuddies.io</a>\n\n     We invite everyone to join our corporate-supported social media\nplatforms to engage with one another, receive reliable, up-to-date,\naccurate information, and communicate in our Good Gaming, Inc. and\nMicroBuddies(TM) communities.\n\n     Visit us on our social media platforms:\n     Discord\n     <a href=\"https://discord.com/invite/MicroBuddies\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://discord.com/invite/MicroBuddies</a>\n     Telegram Group\n     <a href=\"https://t.me/microbuddiesio\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://t.me/microbuddiesio</a>\n     Telegram Channel\n     <a href=\"https://t.me/MicroBuddies\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://t.me/MicroBuddies</a>\n     Twitter\n     <a href=\"https://twitter.com/microbuddies\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/microbuddies</a>\n     <a href=\"https://twitter.com/GOODGMER\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/GOODGMER</a>\n     Reddit\n     <a href=\"https://www.reddit.com/r/MicroBuddies\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.reddit.com/r/MicroBuddies</a>/\n     Instagram\n     <a href=\"https://www.instagram.com/goodgmer\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.instagram.com/goodgmer</a>/\n     Facebook\n     <a href=\"https://www.facebook.com/GoodGMER\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.facebook.com/GoodGMER</a>\n     <a href=\"https://www.facebook.com/GoodGamingMC\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.facebook.com/GoodGamingMC</a>\n     Twitch\n     <a href=\"https://www.twitch.tv/goodgaminginc\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.twitch.tv/goodgaminginc</a>\n     YouTube Channel\n     <a href=\"https://www.youtube.com/channel/UC3YyoK_Xdo7sfPmse898Nog\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.youtube.com/channel/UC3YyoK_Xdo7sfPmse898Nog</a>/\n\n     About Good Gaming:\n\n     Good Gaming is an innovative brand leading the gaming industry across\nmultiple segments in the space since 2008. Beginning with our roots as a\ncollaborative space for gamers to share their knowledge, we went on to\nestablish ourselves as one of the leaders in hosting Hearthstone\ntournaments. In 2016, we expanded our reach to include establishing\nmultiple Minecraft servers with some of the most popular versions of Prison\nand SkyBlock, then developing our completely custom-developed NFT\nblockchain game, MicroBuddies(TM), in 2021. The Good Gaming advantage comes\nfrom our development team's close relationship with the player communities\nof all of our games. The constant communication and resulting feedback\nfurther expand our proprietary content, and we continue to be influencers\nin the realm. Good Gaming continues to find exciting and innovative ways to\nbranch across the gaming industry. As a staff and community, our goal is to\ncement our place as a fun and collaborative place for ALL gamers to enjoy.\n\n     For more information about Good Gaming, please visit our website:\n\n     <a href=\"https://www.good-gaming.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.good-gaming.com</a>\n\n     Safe Harbor: This release contains statements that constitute\nforward-looking statements within the meaning of Section 27A of the\nSecurities Act of 1933, as amended, and Section 21E of the Securities\nExchange Act of 1934, as amended. These statements appear in a number of\nplaces in this release and include all statements that are not statements\nof historical fact regarding the intent, belief or current expectations of\nGood Gaming Inc., its directors or its officers with respect to, among\nother things: (i) financing plans; (ii) trends affecting its financial\ncondition or results of operations; (iii) growth strategy and operating\nstrategy. The words \"may,\" \"would,\" \"will,\" \"expect,\" \"estimate,\" \"can,\"\n\"believe,\" \"potential,\" and similar expressions and variations thereof are\nintended to identify forward-looking statements. Investors are cautioned\nthat any such forward-looking statements are not guarantees of future\nperformance and involve risks and uncertainties, many of which are beyond\nGood Gaming Inc.'s ability to control, and that actual results may differ\nmaterially from those projected in the forward-looking statements as a\nresult of various factors. More information about the potential factors\nthat could affect the business and financial results is and will be\nincluded in Good Gaming, Inc.'s filings with the Securities and Exchange\nCommission , including those set forth as \"Risk Factors\" in such filings.\n\nMEDIA\n\nCONTACT:\n\n     Public Relations and Shareholder Information:\n     Joseph M. Vazquez III\n     Phone: (888) 245-3005\n     Email: infinityglobalconsulting@gmail.com\n\nTel   : 888-295-7279    GOOD GAMING INC\nWWW   : <a href=\"https://www.good-gaming.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.good-gaming.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134100879.MNPRE2134102517-08055320211208</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}