{"date": "2021-12-21 07:00:07.779000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>Pagero AB</div>\n<p><span><span style=\"font-size:10pt\"><span><span>This announcement and the information contained is not considered to have significant impact on Pagero Group's performance</span></span></span></span></p>\n<p style=\"margin-top:12px\"><span>Pagero and Amazon Business partners to support its e-document exchange program for Amazon Business customers. </span><br/>\n<br/>\n<span>Amazon Business customers will have access to Pagero’s global network for e-document exchange and automation. The service will help customers to receive invoices digitally and automatically in a preferred format while ensuring compliance with local regulatory demands for e-invoicing, saving time and reducing errors.</span><br/>\n<br/>\n<span>“We are thrilled to welcome Amazon Business as a partner. As we are both working for a future where buying and selling is easy, digital and seamless, I am very excited to see what we can achieve together,” says Bengt Nilsson, CEO at Pagero.</span><br/>\n<br/>\n<span>Nabil De Marco, Director for Amazon Business Europe says: “We work hard every day to make the Amazon Business customer experience easier and more efficient. I am excited about how the partnership with Pagero will create a smoother invoicing experience for customers who are looking to receive and process compliant invoices from us electronically.”</span><br/>\n<br/>\n<span>The joint offering will initially be made available to direct customers of Amazon Business in Europe but with plans to extend to other geographies in line with customer needs. </span><br/>\n<br/>\n<span><strong>About Pagero</strong><br/>\nPagero provides a Smart Business Network that connects buyers and sellers for automated, compliant, and secure exchange of orders, invoices, payment instructions and other business documents. With an open network and a wide range of value-added apps, Pagero helps businesses streamline their order-to-cash and purchase-to-pay processes while unlocking the full potential of accurate and reliable business data. All of this, regardless of location, industry, size or systems. Find out more on pagero.com</span></p>\n<p><span><strong>About Amazon Business</strong><br/>\nAmazon Business helps millions of customers worldwide—from small businesses, schools, hospitals, non-profit organizations, and government agencies, to large enterprises with global operations—reshape their procurement with cost and time savings, greater productivity, and insightful purchasing analytics. Procurement and business leaders enjoy convenient shipping options on hundreds of millions of supplies across categories like office, IT, janitorial, food service, and professional medical supplies. Customers also have access to a variety of business-tailored features and benefits, including a curated site experience, Business Prime, business-only pricing and selection, single or multi user business accounts, approvals workflow, purchasing system integrations, payment solutions, VAT invoicing tools, dedicated customer support, and more. Amazon Business is currently available in the United States, Canada, United Kingdom, Germany, France, Italy, Spain, Japan, and India. For more information, visit www.business.amazon.com, www.amazonbusinessblog.com, and @AmazonBusiness. </span><br/>\n </p>\n<p><a href=\"https://news.cision.com/pagero-ab/r/pagero-selected-by-amazon-business-to-support-automated-document-processing-for-business-customers%2Cc3475404\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://news.cision.com/pagero-ab/r/pagero-selected-by-amazon-business-to-support-automated-document-processing-for-business-customers%2Cc3475404</a></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Waymaker BIT News - Cision 2021</p></div>"}