{"date": "2022-02-08 01:46:30+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n        Learn how to access music, movies, and other content for the whole family with Amazon Fire TV.\n      </div>\n                <div>\n                  <h4>\n          What is Fire TV, and how much does it cost?\n        </h4>\n                  <p>\n          Amazon Fire TV is a media player that streams video, music, and games to your TV. It plugs into the HDMI port of your television and turns any modern TV into a smart TV. There are several models, including the Fire TV Stick-which is like the Roku Streaming Stick-and Fire TV Cube.\n        </p>\n                  <p>\n          Amazon Fire TV devices start at under $30 with no monthly fees, though in addition to free content there are subscription fees for some content.\n        </p>\n                  <h4>\n          Why parents may want to consider Fire TV\n        </h4>\n                  <p>\n          Parents can give their children access to kid-friendly content from Amazon Prime and other streaming apps including Netflix, HBO Max, and many more. Parents can also choose to subscribe to Amazon Kids+, which offers a great deal of additional commercial-free, kid-friendly content. Fire TV supports the free Amazon Parent Dashboard, which gives parents the ability to manage what, when, and how long their kids watch Fire TV.\n        </p>\n                  <h4>\n          Amazon Parent Dashboard\n        </h4>\n                  <p>\n          We live in a golden age of media with an incredible array of choices between what we can watch on regular TV, via cable and satellite, and on the internet. But despite-or perhaps because of-all that content, it's sometimes hard to pick appropriate content for each family member.\n        </p>\n                  <p>\n          And while we recommend parents co-watch or at least be around young children when they're consuming media, it's not always possible for parents to be in the room. As children get older, it's healthy for them to be able to choose what they want to watch from a wide range of appropriate choices without having to ask their parents each time they want to watch a show.\n        </p>\n                  <p>\n          Amazon Parent Dashboard, which is accessible on mobile, tablets, and the web, allows parents to set limits on what content their kids watch and when they watch it, among other tools. Parent Dashboard works with Fire TV and other Amazon Kids products, including Fire Tablets, browsers, and Alexa-enabled smart speakers and displays. (Not all settings work with all devices.)\n        </p>\n                  <p>\n          Parents can manage device-specific controls on Fire TV directly and can manage their child's experience across all devices via the Parent Dashboard.\n        </p>\n                  <h4>\n          Amazon Kids and Amazon Kids+\n        </h4>\n                  <p>\n          Amazon Kids comes with a Parent Dashboard that parents use to manage their child's experience across Fire TV, Amazon's Fire Tablets, Echo devices, or Alexa-enabled devices. Both Amazon Kids and Amazon Kids+, the paid subscription, have the same parental control tools. Parental management tools vary by device, so some settings may not apply to Fire TV.\n        </p>\n                  <p>\n          Amazon Kids+, which starts at $2.99 a month, includes the Parent Dashboard and offers an all-in-one subscription with access to over 20,000 books; videos; Audible books; educational apps; games; and Alexa skills.\n        </p>\n                  <h4>\n          Adding Content to Fire TV\n        </h4>\n                  <p>\n          Parents can add content from Amazon Prime and numerous other providers via thousands of apps including PBS Kids, Nick Jr., Sesame Street, LEGO, Netflix, YouTube, Prime Video, Disney+, Hulu, Apple TV, SHOWTIME, and HBO Max. While some of this content is free, many services require a paid subscription. Parents have the option to add any app to their child's experience, but Amazon can only age-filter content within Amazon Kids+.\n        </p>\n                  <p>\n          ConnectSafely recommends using the Amazon Kids+ app, as it has features and controls that are not available on the browser-based Parent Dashboard. You do not need a Kids+ subscription to use the parental controls on the Kids+ mobile app.\n        </p>\n                  <p>\n          By default, only kid-friendly Prime Video content will be added to a child's library. Parents have the option of adding any Prime Video content to their child's library.\n        </p>\n                  <h4>\n          Third-party apps may have their own controls-or no controls\n        </h4>\n                  <p>\n          As mentioned, the Fire TV supports apps from Amazon and other companies. By default, a Fire TV kids profile does not allow children to access apps from other services, but parents can add third-party services for each child.\n        </p>\n                  <p>\n          Amazon Kids parental management tools apply only to Amazon Kids+ content; so if you've added other apps such Netflix, Hulu, HBO Max, Disney, and others, you should check to see if those apps have their own parental controls. Visit <span><a href=\"https://www.connectsafely.org/videocontrols/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">connectsafely.org/videocontrols</a></span>for links to controls on popular video services. You also have the option to import kid-friendly content from your own Amazon Prime Video account.\n        </p>\n                  <p>\n          There may be some apps that don't offer controls, so it's important to research what content and content controls are available with each app your child has access to. If you have enabled an app and later decide it's not appropriate for your child, you can remove it from your child's profile so that he or she will not be able to access it.\n        </p>\n                  <h4>\n          Sharing Fire TV with other family members\n        </h4>\n                  <p>\n          Fire TV allows you to create up to six profiles to personalize TV settings for each household member. (Note: Four of these can be Amazon Kids profiles.) When you add a member, you're asked, \"Is this a kid profile?\" (The default is \"No.\") If not, the person may have access to content that may not be suitable for children.\n        </p>\n                  <p>\n          When you create a kid's profile, Fire TV will ask if you want to add Prime Video. If you're a Prime Video member, you have the option to select \"Kid-friendly content you own\" or \"All videos you own.\" If you select All Videos, be aware of any content that might be inappropriate (or just not interesting) for your children.\n        </p>\n                  <h4>\n          Setting up Amazon Kids Profiles\n        </h4>\n                  <p>\n          If you don't already have an Amazon account, select New Customer at the Hello sign-in link at Amazon.com or via the Amazon app.\n        </p>\n                  <p>\n          Add each of your children to your Amazon household at <span><a href=\"https://www.amazon.com/myh/households\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/myh/households</a></span>. Scroll down to \"Start Sharing,\" where you can add children, teens, and adults to your account. You can also add a child directly from Amazon Fire TV or the Amazon Kids+ mobile app.\n        </p>\n                  <h4>\n          If you're new to Amazon\n        </h4>\n                  <p>\n          You need an Amazon account to use Fire TV, but you do not need to pay for an Amazon Prime account. Any adult with an email address can create a free Amazon account. Once you have an Amazon account, you can use it to log into Fire TV.\n        </p>\n                  <h4>\n          PINs for parents and children\n        </h4>\n                  <p>\n          Fire TV allows parents to set a parental control PIN, which prevents children from adding apps, launching content that parents haven't approved, and making purchases. In addition, Amazon Kids allows parents to set a Child PIN, which blocks their child from exiting their Amazon Kids experience.\n        </p>\n                  <h4>\n          Configuring your child's profile\n        </h4>\n                  <p>\n          You can configure children's settings, including adding or deleting a child's profile from the web, the Amazon Kids+ app, and the TV itself. Each of these is slightly different. Some settings are not available from the web interface and Fire TV, so we recommend configuring the smartphone app.\n        </p>\n                  <p>\n          In the app or on the website Parent Dashboard, select the gear icon next to each child's name to display the settings for that child. On the TV, first display your own (adult) profile, click on the gear icon, and select Accounts and Profile Settings. Click on Kids Settings and then the name of the child whose account you want to configure.\n        </p>\n                  <h4>\n          Adding content\n        </h4>\n                  <p>\n          By default, the only content available to your child is Amazon Kids or Amazon Kids+ hand-curated content, based on your child's age. But as you can see from the options, you can add content and adjust the age filter based on your perception of your child's maturity rather than strictly their chronological age.\n        </p>\n                  <p>\n          This option allows you to give your child access to apps and content from your own Amazon video library. While there are plenty of reasons you might want to add content, use this feature carefully to be sure you're only approving age-appropriate content for your child.\n        </p>\n                  <h4>\n          Managing time limits\n        </h4>\n                  <p>\n          Parents can control the hours their child can use Fire TV, which can be different on weekdays and weekends, and the total amount of daily screen time.\n        </p>\n                  <h4>\n          Age Filter\n        </h4>\n                  <p>\n          One of the first things you should do is set the Age Filter, which controls the type of content by age range that Amazon Kids+ will display to your child. The age filter doesn't necessarily correlate to the child's age, as maturity can vary. You can also use the Age Filter to set a theme for either younger or older children.\n        </p>\n                  <h4>\n          Closing thoughts for parents\n        </h4>\n                  <p>\n          Fire TV and Amazon Kids+ provide a great deal of child-friendly content and tools to help parents manage that content. Yes, content from Amazon Kids has been vetted by experts. But when it comes to your children, you are the expert. Regardless of where your children get their content and how it is vetted, it is important for parents to understand what their kids are watching and how it is impacting them. You know your child and can best determine what is and isn't right for them.\n        </p>\n                  <p>\n          The same goes for screen time. One size doesn't fit all. And while it's great to take advantage of the content and tools available from Amazon Kids+, remember that they are no substitute for parental involvement.<br/></p>\n                </div>\n                <div>\n                  <div>\n          Related Tags\n        </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/family-digital-wellness-hub\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Family Digital Well-Being</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/devices\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Devices</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/fire-tv\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Fire TV</a>\n                    </span>\n                  </div>\n                </div>\n                <div>\n                  <div>\n                    <span>About the Author</span>\n                  </div>\n                  <div>\n                    <div>\n                      <span>ConnectSafely</span>\n                    </div>\n                    <div>\n                      <span>\n                        <a href=\"http://connectsafely.org/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">ConnectSafely</a>\n                      </span>is a Silicon Valley, California-based nonprofit organization dedicated to educating users of connected technology about safety, privacy and security. They publish research-based safety tips, parents' guidebooks, advice, news, and commentary on all aspects of tech use and policy.\n          </div>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/devices/connectsafely-offers-parents-a-guide-to-using-fire-tv-with-the-family\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>07 February 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>08 February 2022 01:46:30 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}