{"date": "2022-01-05 17:48:39.666000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3350.44, "close": 3265.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_0g06x8cy&amp;referenceId=tag:reuters.com,2022:newsml_OVFSYR9U3_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_0g06x8cy&amp;referenceId=tag:reuters.com,2022:newsml_OVFSYR9U3_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: Amazon and carmaker Stellantis say they will collaborate to develop electric delivery vans and smarter in-car technology. Julian Satterthwaite reports.<br/>Short Link: <a href=\"https://refini.tv/3pWbaZN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3pWbaZN</a><br/><br/>Video Transcript:<br/><br/>Amazon wants to find a cleaner way to get its parcels to customers. Now it may have found an ally with shared interests. The online giant said Wednesday that it would tie up with carmaker Stellantis - owner of 14 brands including Fiat, Jeep, Chrysler and many more. It will get access to Amazon technology for in-car infotainment systems. The firm's new \"digital cockpit\" will use Alexa voice control technology for navigation, e-commerce, payments and other functions. Amazon will also provide its cloud technology, and help Stellantis speed up development of new digital products to match Tesla. Meanwhile, Amazon will be the first customer for Stellantis' new line of electric delivery vans. They're due to launch next year, and the two firms say they'll soon have thousands on the roads. Amazon has a previous agreement to buy up to 100,000 vans from electric vehicle startup Rivian. Stellantis shares were up around 3% in Milan trade on Wednesday following news of the tie-up.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}