{"date": "2021-11-30 20:00:34.394000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"story-table-container\"><table border=\"0\">\n<tr>\n<td>\n<p>EQS Group-News: u-blox AG / Key word(s): Product Launch<br/>\nu-blox AG: New u-blox AWS IoT ExpressLink Modules Offer Out-of-the-Box Secure Connectivity to the AWS Cloud<br/>\n<br/>\n30.11.2021 / 21:00<br/>\n<br/></p>\n<hr/>\n<div>\n<p>Press Release</p>\n<p><b>New u-blox AWS IoT ExpressLink Modules Offer Out-of-the-Box Secure Connectivity to the AWS Cloud</b></p>\n<p><b>Pre-provisioned modules enable out-of-the-box secure communication with AWS via Wi-Fi and cellular IoT</b></p>\n<p><b>Thalwil, Switzerland - November 30, 2021 -</b> u-blox (SIX:UBXN,OTC:UBLXF), a leading global provider of positioning and wireless communication technologies and services, has announced <a href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=3630fa63208b709e57ab4a2f6ac3c0dd&amp;application_id=1252936&amp;site_id=reuters8&amp;application_name=news\" data-type=\"url\" class=\"tr-link\" translate=\"no\">two modules</a> designed to enable Amazon Web Services (AWS) cloud services for device and fleet management out of the box: the NORA-W2 AWS IoT ExpressLink Wi-Fi module and the SARA-R5 AWS IoT ExpressLink cellular module for internet of things (IoT) connectivity. The AWS IoT ExpressLink modules will significantly accelerate design-in and time to market.</p>\n<p>For many businesses, connecting devices to the cloud remains challenging. Existing solutions involve installing and maintaining dedicated software to manage connectivity on the devices. In addition, many legacy devices are too resource-constrained to accommodate the additional code required to enable cloud connectivity. To solve these challenges, these two modules were selected by EDN, Inc. for their gardening products:</p>\n<p>\"We were looking for a quick and effective way to enable robust cloud capabilities for our indoor growing platform. From past experience we knew that doing so adds significant risk in terms of time, money, and overall go-to-market execution,\" stated Ryan Woltz, CEO at EDN, Inc. \"IoT device connectivity is complex, forcing our team to either outsource the development to a costly third party or allocate internal engineering resources, both of which can delay innovative features and increase our time to market. With u-blox's NORA-W2 and SARA-R5 AWS IoT ExpressLink modules, we can go from prototype to production in days, with secure and reliable cloud connectivity that scales. The u-blox platform has become our strategic advantage, enabling us to focus on what we do best-creating innovative products that make nature accessible indoors.\"</p>\n<p>The u-blox AWS IoT ExpressLink modules are all about speed and simplicity. Paving the way for rapid design-ins with no complex software to run and maintain on the device side, the modules are ideal for small to medium-sized businesses targeting consumer and industrial markets.</p>\n<p>Featuring a simplified and highly abstracted command set, the modules can be configured without requiring specialized competencies in IoT product development, networking, and cryptography. Pre-provisioned to communicate with AWS IoT Core, they can connect to AWS securely, out of the box, with a few commands only and integrate with services in the AWS ecosystem.</p>\n<p><b>Support for Wi-Fi and cellular communication</b></p>\n<p>The two modules are the first Wi-Fi and cellular AWS IoT ExpressLink modules on the market.</p>\n<p>The NORA-W2 AWS ExpressLink module is a new u-blox module delivering Wi-Fi 4 connectivity as well as Bluetooth low energy 5 connectivity (including Bluetooth long range). The compact module (10.4 by 14.3 millimeters) features a powerful dual-core central processing unit (CPU) for advanced customer applications. It is available with an antenna pin or featuring a printed circuit board (PCB) antenna.</p>\n<p>The SARA-R510 AWS IoT ExpressLink module is a variant of the SARA-R510S LTE-M and NB-IoT module. The power optimized low-power wide-area (LPWA) module consumes less than 1 μA of current in power save mode (PSM), making it ideal for battery-powered applications. The module is certified for multi-regional use.</p>\n<p><b>Easy access for new entrants in the IoT space</b></p>\n<p>\"With the NORA-W2 and SARA-R5 IoT ExpressLink modules, wireless devices can be connected to the cloud in a snap,\" said Andreas Thiel, Executive Director Product Centers and Co-Founder at u-blox. \"By simplifying access to cloud services, AWS IoT ExpressLink knocks down one of the key barriers standing in the way of newcomers to the IoT space: complexity.\"</p>\n<p>\"The decision to work with u-blox was a clear choice for us at AWS, as we knew that their high quality modules targeting industrial and professional applications would complement our wide range of software and cloud services for IoT. Covering both Wi-Fi and LTE-M, the NORA-W2 and the SARA-R5 modules will address the critical need for IoT connectivity, and accelerate our customers' time to market,\" said Shyam Krishnamoorthy, General Manager, Consumer IoT and Connectivity at AWS.</p>\n<p>First samples of the u-blox AWS IoT ExpressLink modules and EVKs will be available by Q1 2022.</p>\n<p><br/>\n<b>About u-blox</b><br/>\nu-blox (SIX:UBXN) is a global technology leader in positioning and wireless communication in automotive, industrial, and consumer markets. Their smart and reliable solutions, services and products let people, vehicles, and machines determine their precise position and communicate wirelessly over cellular and short range networks. With a broad portfolio of chips, modules, and secure data services and connectivity, u-blox is uniquely positioned to empower its customers to develop innovative and reliable solutions for the Internet of Things, quickly and cost-effectively. With headquarters in Thalwil, Switzerland, the company is globally present with offices in Europe, Asia, and the USA. (<a href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=3269a4a9d550ad3101ca61d6fb1c807c&amp;application_id=1252936&amp;site_id=reuters8&amp;application_name=news\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.u-blox.com</a>) Find us on <a href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=99a4054bbe8b8f79fe108c7fb69c46c3&amp;application_id=1252936&amp;site_id=reuters8&amp;application_name=news\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Facebook</a>, <a href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=c5371f4ad8d82f61c776d77f48ce07b0&amp;application_id=1252936&amp;site_id=reuters8&amp;application_name=news\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LinkedIn</a>, Twitter <a href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=038d74f8156865bcb765057e289aaee2&amp;application_id=1252936&amp;site_id=reuters8&amp;application_name=news\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@ublox</a> and <a href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=60b9c5e734211f8da674a8446391f2e3&amp;application_id=1252936&amp;site_id=reuters8&amp;application_name=news\" data-type=\"url\" class=\"tr-link\" translate=\"no\">YouTube</a><br/>\n<br/>\n<b>u‑blox media contact:</b><br/>\nNatacha Seitz<br/>\nSenior Manager PR and Content Marketing<br/>\nMobile +41 76 436 0788<br/>\n<a href=\"mailto:natacha.seitz@u-blox.com\" data-type=\"email\" translate=\"no\">natacha.seitz@u-blox.com</a></p>\n</div>\n<br/>\n<hr/>\n<p>End of Media Release<br/></p>\n<hr/></td>\n</tr>\n</table></div>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tr>\n<td align=\"left\">Language:</td>\n<td align=\"left\">English</td>\n</tr>\n<tr>\n<td align=\"left\">Company:</td>\n<td align=\"left\">u-blox AG</td>\n</tr>\n<tr>\n<td align=\"left\">\n</td><td align=\"left\">Zürcherstrasse 68</td>\n</tr>\n<tr>\n<td align=\"left\">\n</td><td align=\"left\">8800 Thalwil</td>\n</tr>\n<tr>\n<td align=\"left\">\n</td><td align=\"left\">Switzerland</td>\n</tr>\n<tr>\n<td align=\"left\">Phone:</td>\n<td align=\"left\">+41 44 722 74 44</td>\n</tr>\n<tr>\n<td align=\"left\">Fax:</td>\n<td align=\"left\">+41 44 722 74 47</td>\n</tr>\n<tr>\n<td align=\"left\">E-mail:</td>\n<td align=\"left\">info@u-blox.com</td>\n</tr>\n<tr>\n<td align=\"left\">Internet:</td>\n<td align=\"left\">www.u-blox.com</td>\n</tr>\n<tr>\n<td align=\"left\">ISIN:</td>\n<td align=\"left\">CH0033361673</td>\n</tr>\n<tr>\n<td align=\"left\">Listed:</td>\n<td align=\"left\">SIX Swiss Exchange</td>\n</tr>\n<tr>\n<td align=\"left\">EQS News ID:</td>\n<td align=\"left\">1252936</td>\n</tr>\n</table></div>\n<br/>\n<div class=\"story-table-container\"><table border=\"0\">\n<tr>\n<td align=\"left\" colspan=\"2\">\n</td></tr>\n</table></div>\n<div class=\"story-table-container\"><table border=\"0\">\n<tr>\n<td align=\"left\" colspan=\"2\"> </td>\n</tr>\n<tr>\n<td align=\"left\">End of News</td>\n<td align=\"left\">EQS Group News Service</td>\n</tr>\n</table></div>\n<div class=\"story-table-container\"><table border=\"0\">\n<tr>\n<td>\n<hr/></td>\n</tr>\n</table></div>\n<p>1252936  30.11.2021 </p>\n<div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"fncls.ssp?fn=show_t_gif&amp;application_id=1252936&amp;application_name=news&amp;site_id=reuters8\" border=\"0\" height=\"0\" src=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=show_t_gif&amp;application_id=1252936&amp;application_name=news&amp;site_id=reuters8\" width=\"0\"/></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright EQS Group 2021</p></div>"}