{"date": "2022-01-11 13:41:22.598000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">RiverMeadow Announces New Multi-Cloud Disaster Recovery Platform Capability</p>\n<p>LOS GATOS, Calif., Jan. 11, 2022</p>\n<p>\n<span>\n<span>LOS GATOS, Calif.</span>\n</span> , <span>\n<span>Jan. 11, 2022</span>\n</span> /CNW/ -- <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3408408-1&amp;h=3154281054&amp;u=http%3A%2F%2Frivermeadow.com%2F&amp;a=RiverMeadow+Software+Inc\" data-type=\"url\" class=\"tr-link\" translate=\"no\">RiverMeadow Software Inc</a> ., a leading provider of Multi-Cloud Migration Software and Services, announced today that it is expanding its product portfolio to include <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3408408-1&amp;h=3293355041&amp;u=https%3A%2F%2Fwww.rivermeadow.com%2Fdisaster-recovery&amp;a=Disaster+Recovery+(DR)+Platform+capability\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Disaster Recovery (DR) Platform capability</a> .</p>\n<p>\n\n</p>\n<p>The new DR Platform capability offers a highly cost-effective way for customers to protect their VMware vSphere workloads that run on-premise or in VMware on <span>\n<span>ANY</span>\n</span> Public Cloud, including AVS (Azure VMware Solution), GCVE (Google Cloud VMware Engine), VMC (VMware Cloud on AWS), OCVS (Oracle Cloud VMware Solution) and IBM Cloud for VMware Solutions, <span>with the use of Object Storage for highly cost-effective DR</span> .</p>\n<p>According to <span>Jim Jordan</span> , President and CEO of RiverMeadow, <span>\"our new DR Platform capability has been developed in response to extensive demand from our customers and partners for an integrated cloud migration and DR solution. This new capability enables them to <span>lift, optimize and protect</span> their workloads with all the flexibility and scale they require through one single pane of glass</span>\n<span>.\"</span>\n</p>\n<p>Backup and recovery operations are set up and managed through an easy-to-use, self-service dashboard – <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3408408-1&amp;h=2872980767&amp;u=https%3A%2F%2Fwww.rivermeadow.com%2Fhubfs%2FDR-to-Azure-Blob-Demo.mp4&amp;a=click+here+to+watch+the+DR+Platform+Demo%3A\" data-type=\"url\" class=\"tr-link\" translate=\"no\">click here to watch the DR Platform Demo:</a>\n</span>\n</p>\n<p>\n<span>Key benefits include:</span>\n</p>\n<ul class=\"bulleted-list arrowlist\">\n<li>\n<span>Recover one or many VMs</span> based within a Recovery Policy according to the specified date and time of the Recovery Point (customer chooses RPO and number of Recovery Points to retain)</li>\n<li>\n<span>Recover one or many VMs</span> where the original VM is overwritten (helpful in cases of ransomware or corruption) or recovery can be re-directed to a new VM (customer chooses new VM name and placement options) to recover beside an existing VM, based on desired/available Recovery Point</li>\n<li>\n<span>Recover one or many VMs</span> to different vSphere environments (helpful in cases where the primary vSphere site is no longer available/accessible)</li>\n</ul>\n<ul class=\"bulleted-list arrowlist\">\n<li>\n<span>Quick and Easy Deployment:</span> Setup and deployment are simple and fast, with no need for a dedicated Disaster Recovery site</li>\n<li>\n<span>Optimal Business Continuity:</span> The Platform is designed for asynchronous replication with orchestration workflows that are optimized to achieve predetermined Recovery Point Objectives (RPOs) and Recovery Time Objectives (RTOs)</li>\n<li>\n<span>Low-cost Storage Option:</span> Azure Blob, Amazon S3 or Google Cloud Storage provide a low-cost Object Storage option as the target for replication data</li>\n<li>\n<span>Recovery Flexibility:</span> RiverMeadow offers customers ultimate flexibility during recovery to address various use case needs. Workloads can be recovered to the Source or Target vSphere environment based on the selected Recovery Point:</li>\n</ul>\n<p>\n<span>Common Use Cases:</span>\n</p>\n<p>\n<span>\"RiverMeadow makes DR more affordable by allowing customers the ability to protect not only mission critical workloads but also any workload by leveraging low-cost storage options,\"</span> explains <span>Greg Dennis</span> , CTO at RiverMeadow. <span>\"Customers are now able to protect themselves against ransomware and other malicious attacks by being able to recover workloads in minutes to a last known good configuration\"</span>\n</p>\n<p>\n<span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3408408-1&amp;h=1211515169&amp;u=http%3A%2F%2Fwww.rivermeadow.com%2F&amp;a=About+RiverMeadow%3A\" data-type=\"url\" class=\"tr-link\" translate=\"no\">About RiverMeadow:</a>\n</span> RiverMeadow is a Multi-Cloud Migration Services and DR Company with Product capability that will Lift, Optimize and Protect workloads faster, better and more cost-effectively. Press Contact: email: <a href=\"mailto:emma@rivermeadow.com\" data-type=\"email\" translate=\"no\">emma@rivermeadow.com</a> ; phone: +44 (0)7949 278 497</p>\n<p>\n\n</p>\n<p>\n\n</p>\n<p>View original content to download multimedia: <a href=\"https://www.prnewswire.com/news-releases/rivermeadow-announces-new-multi-cloud-disaster-recovery-platform-capability-301457821.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/rivermeadow-announces-new-multi-cloud-disaster-recovery-platform-capability-301457821.html</a>\n</p>\n<p>SOURCE RiverMeadow Software Inc.</p>\n<p>View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/January2022/11/c0380.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/January2022/11/c0380.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}