{"date": "2022-01-06 20:41:35.158000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3287.14, "close": 3251.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>FLORA GROWTH CORP (\"FLGC-Q\")\n- Appoints Industry Authority Tim Leslie as Chairman of Its Newly\n- Formed Advisory Board\n\n    Flora Growth Corp. (\"Flora\" or the \"Company\"), a leading all-outdoor\ncultivator and manufacturer of global cannabis products and brands,\nannounced the appointment of accomplished business leader and cannabis\nindustry expert Tim Leslie as the Chairman of its newly formed Advisory\nBoard.\n\n    The establishment of the Advisory Board comes as Flora continues to\ndevelop its corporate structure to include a robust roster of human\ncapital. The appointment of Leslie aligns with Flora's goal of working with\nthe best leaders in the industry who will provide strategic counsel to the\nCompany on matters that will fuel its growth. A Yale law graduate, Leslie\nhas a strong pedigree of success, working with scaling companies including\nhis two decades at Amazon, where he served as Vice President and Associate\nGeneral Counsel responsible for building and managing Amazon's\ninternational legal team before changing roles to oversee the international\nlaunch of Amazon Prime Video. Following his successful tenure at Amazon,\nLeslie made the leap to the burgeoning cannabis industry where he served as\nCEO of one of the world's most authoritative digital cannabis data sources,\nLeafly. Since his time there, Leslie has served on the board of renowned\ncannabis companies before his appointment as Chairman of the Board of\nAdvisors at Flora.\n\n    \"The synergies could not be better aligned,\" Leslie said. \"I have\nwatched how Flora, in a short time, has emerged as a leader in building a\ndiversified global cannabis company, from its low-cost manufacturing to the\nclinical studies from its Flora Pharma division to its premium brand\nportfolio. I am excited by the prospect that Flora's current clinical\ntrials at the University of Manchester and in the US can lead to the\ndevelopment of new, safe, plant-based medications to treat universal health\nissues like fibromyalgia, brain health, and pain in an accelerated time\nframe. Navigating that type of international growth is difficult, and\nsomething I have deep experience with. I hope to leverage that knowledge to\nassist the Flora team in making sound strategic decisions that will fuel\nFlora's growth on an international scale. I truly believe in the potential\nof the cannabis industry to improve the health, welfare and longevity of\npeople around the globe. I feel that I have found the right fit in\nsupporting this organization.\"\n\n    Currently an Executive in Residence at Beloit College, Leslie also sits\non the Board of Advisors of Endocanna Health, a start-up focused on\nleveraging DNA research to understand how cannabis interacts with the body\nand is a Member of the Board of New Frontier Data, the industry's leading\nauthority in statistical analysis of markets and behavior, as well as\nVessel, Flora's most recently acquired luxury cannabis consumer technology\ncompany.\n\n    \"We are pleased and honored to have Tim join us as the first Chairman\nof our Advisory Board,\" said Luis Merchan, President and CEO of Flora\nGrowth. \"Tim's extensive resume of leading the growth of prominent\ncompanies and projects and his deep understanding of the cannabis industry\nmake Tim the ideal candidate for this role. We will look to our newly\nestablished Advisory Board for counsel on how to amplify our growth\nopportunities both domestically and internationally. Tim will play a key\nrole in advising on how best to navigate the regulatory framework of\nbuilding a truly global company, something he specifically worked on in his\ntime at Amazon. All in all, we could not have asked for a more qualified\nperson to fill the role of Chairman and we truly thank Tim for his\ncommitment to Flora and his belief in our mission and success.\"\n\n    About Flora Growth Corp.\n\n    Flora is building a connected, design-led collective of plant-based\nwellness and lifestyle brands that deliver the most compelling customer\nexperiences in the world, one community at a time. As the operator of one\nof the largest outdoor cannabis cultivation facilities, Flora leverages\nnatural, cost-effective cultivation practices to supply cannabis\nderivatives to its diverse business divisions of cosmetics, hemp textiles,\nand food and beverage. Visit www.floragrowth.com or follow @floragrowthcorp\non social for more information.\n\n    Cautionary Statement Concerning Forward-Looking Statements\n\n    This document contains forward-looking statements. In addition, from\ntime to time, we or our representatives may make forward-looking statements\norally or in writing. We base these forward-looking statements on our\nexpectations and projections about future events, which we derive from the\ninformation currently available to us. Such forward-looking statements\nrelate to future events or our future performance, including: the size of\nmarkets for cannabis and cannabis products; the collaboration with third\nparties; and our business prospects and opportunities. You can identify\nforward-looking statements by those that are not historical in nature,\nparticularly those that use terminology such as \"may,\" \"should,\" \"expects,\"\n\"anticipates,\" \"contemplates,\" \"estimates,\" \"believes,\" \"plans,\"\n\"projected,\" \"predicts,\" \"potential,\" or \"hopes\" or the negative of these\nor similar terms. In evaluating these forward-looking statements, you\nshould consider various factors, including: our ability to change the\ndirection of the Company; our ability to keep pace with new technology and\nchanging market needs; and the competitive environment of our business.\nThese and other factors may cause our actual results to differ materially\nfrom any forward-looking statement. Forward-looking statements are only\npredictions. The forward-looking events discussed in this document and\nother statements made from time to time by us or our representatives may\nnot occur, and actual events and results may differ materially and are\nsubject to risks, uncertainties and assumptions about us. We undertake no\nobligation to publicly update or revise any forward-looking statement,\nwhether as a result of uncertainties and assumptions, or the\nforward-looking events discussed in this document and other statements made\nfrom time to time by us or our representatives not occurring, except as may\nbe required by applicable law.\n\n Contact Information:\n\nInvestor Relations Contact:\nEvan Veryard\nevan.veryard@floragrowth.com\n\nPublic Relations Contact:\nCassandra Dowell\n+1 (858) 264-6600\nflora@cmwmedia.com\n\nTel   : 416-861-2267    FLORA GROWTH CORP\nWWW   : <a href=\"https://www.floragrowth.ca\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.floragrowth.ca</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200500526.MNPRE2200501334-05480620220106</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}