{"date": "2021-11-26 14:41:20.717000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3580.41, "close": 3561.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MIMI'S ROCK CORP (\"MIMI-V\")\n- Q3 2021 results\n\n     Mimi's Rock Corp. (the \"Company\"), an online dietary supplement and\nwellness company, announced its third quarter financial results for the\nperiod ending September 30, 2021.\n\n     \"Our 2021 third quarter saw top line revenues coming in lower than\nexpected due to continued foreign exchange headwinds and some supply chain\nchallenges.\" commented CEO, David Kohler. \"Fortunately, our unit volumes\ncontinue to remain strong and we are seeing good returns so far from our\nnew advertising partnership with Teikametrics. We have solved the supply\nchain challenges and are anticipating a stronger Q4 as a result.\"\n\n     Third Quarter Highlights\n\n     Revenues in Q3 2021 were $8.6 million, compared to $9.8 million in the\nsame period last year.\n\n     Third quarter 2021 revenues were impacted by product availability\nissues as well as a comparatively lower US dollar relative to the same\nperiod a year ago. While in-market revenues were softer, the impact to\nreported revenue of the lower US dollar in Q3 2021 was approximately $0.4\nmillion compared to the same period in Q3 2020. Over the nine months this\nyear, the lower US dollar has impacted revenue by almost $1.9 million\ncompared to 2020.\n\n     The Company's skin care businesses continued to perform well in the\nthird quarter of 2021. Though gross revenues were not as high as in the\nfirst two quarters of 2021, total margins remained consistent as lower\ndiscounting was applied, resulting in overall higher average selling\nprices.\n\n     Margins remain above 70% for the year and are expected to improve\nslightly due to modest price increases on key products. Volumes have\nremained constant or improved in most products compared to the same period\na year ago.\n\n     Gross margin for Q3 2021 was $5.9 million, compared to $6.9 million,\nin the same period a year ago.\n\n     Advertising spend in Q3 2021 included spend on both legacy campaigns\nas well as new initiatives in connection with the Company's new advertising\npartner. Early indications are positive and sales performance has begun to\nimprove as the various campaigns roll out.\n\n     EBITDA for the three months ended September 30, 2021 was $0.1 million,\ncompared to $1.3 million for the three months ended September 30, 2020.\n\n     Similarly, Adjusted EBITDA, which adds back non-cash stock-based\ncompensation and foreign exchange losses was $0.2 million for Q3 2021,\ncompared to Adjusted EBITDA of $1.2 million for Q3 2020.\n\n     Net loss for Q3 2021 was $0.3 million, compared to net income of $0.5\nmillion for Q3 2020.\n\n     Summary of Quarterly Results\n\n//st\n\n(in      Q3     Q2     Q1     Q4     Q3     Q2      Q1      Q4\n000's)   2021   2021   2021   2020   2020   2020    2020    2019\nRevenue  8,614  9,744  9,758  9,134  9,774  10,943  10,435  7,717\n\nEBITDA1  59     1,101  149    756    1,243  1,584   1,099   (1,356)\n\nAdjusted 218    1,126  212    603    1,166  1,573   1,228   (1,220)\nEBITDA\n\nNet      (259)  502    (233)  523    546    928     282     (2,460)\nIncome\n\n//et\n\n     Conference Call\n\n     Management will host a conference call tomorrow to discuss these\nresults and take questions from investors. Details are as follows:\n\n//st\n\n                    Date:      Tuesday, November 30, 2021\n\n                    Time:      2:00pm Eastern Time\n\n                    Dial-in:   1-800 319 4610 or\n\n                               1-604 638 5357\n\n//et\n\n     Neither the TSX Venture Exchange nor its Regulation Services Provider\n(as that term is defined in the policies of the TSX Venture Exchange)\naccepts responsibility for the adequacy or accuracy of this news release.\n\n     About Mimi's Rock Corp.:\n\n     Mimi's Rock Corp. is an online dietary supplement and wellness company\nwhich market and sells its products under the Dr. Tobias, All Natural\nAdvice and Maritime Naturals brand names. The Dr. Tobias brand features\nover 30 products, including the top-selling Colon 14-Day Cleanse and the #1\nselling Omega 3 Fish Oil on Amazon.com. All Natural Advice and Maritime\nNaturals products focus on skin and beauty care. Products sold under the\nAll Natural and Maritime Naturals brand names are made in Canada and\nregistered with Health Canada and under the EU Cosmetics Act. All Natural\nAdvice has been featured on BNN as a top selling skincare brand in Canada,\nand has been rated the #1 Beauty Brand on Amazon Canada for the past four\nyears.\n\n     Forward-Looking Information\n\n     This news release contains forward-looking statements and forward\nlooking information within the meaning of applicable securities laws.\nOften, but not always, forward-looking statements can be identified by the\nuse of words such as \"plans\", \"expects\", or \"does not expect\", \"is\nexpected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\",\n\"anticipates\" or \"does not anticipate\", or \"believes\", or describes a\n\"goal\", or variation of such words and phrases or state that certain\nactions, events or results \"may\", \"could\", \"would\", \"might\" or \"will\" be\ntaken, occur or be achieved. Please refer to the 2020 Annual Financial\nStatements for more details on the Company's calculation of EBITDA and\nadjusted EBITDA.\n\n     All forward-looking statements reflect the Company's beliefs and\nassumptions based on information available at the time the statements were\nmade. Actual results or events may differ from those predicted in these\nforward-looking statements. All of the Company's forward-looking statements\nare qualified by the assumptions that are stated or inherent in such\nforward-looking statements, including the assumptions listed below.\nAlthough the Company believes that these assumptions are reasonable, this\nlist is not exhaustive of factors that may affect any of the\nforward-looking statements.\n\n     Although the Company has attempted to identify important factors that\ncould cause actual actions, events or results to differ materially from\nthose described in forward-looking statements, there may be other factors\nthat cause actions, events or results not to be as anticipated, estimated\nor intended. There can be no assurance that forward-looking statements will\nprove to be accurate, as actual results and future events could differ\nmaterially from those anticipated in such statements. Accordingly, readers\nshould not place undue reliance on forward-looking statements. All\nforward-looking information contained in this press release is given as of\nthe date hereof and is based upon the opinions and estimates of management\nand information available to management as at the date hereof. The Company\ndisclaims any intention or obligation to update or revise any\nforward-looking statements whether as a result of new information, future\nevents, or otherwise, except in accordance with applicable securities laws.\n\n     Please visit www.mimisrock.com or www.sedar.com for the Company's\nrecent filings.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132900091.MNPRE2132900523-05404320211126</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}