{"date": "2021-11-29 22:12:02.567000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NOMAD ROYALTY COMPANY LTD (\"NSR-TN\")\n- Satellite Big Data Value Chain Sees Opportunity Driven by EO and\n- M2M/IoT Applications\n\n     NSR's newly released Big Data Analytics via Satellite, 5th Edition\n(BDvS5) report sees EO and M2M/IoT Satcom Big Data applications driving Big\nData market revenues to over $22.1B through next decade. As value chain\nevolution ramps up opportunity across the Big Data Market, nascent markets\nrapidly adapting to new standards propel Big Data adoption across multiple\nregions.\n\n     Primarily driven by Earth Observation based Geospatial Analytics\nsolutions, satellite Big Data Analytics annual revenue opportunity will\nreach $3.7B by 2030. \"In the wake of COP26, the recent UN conference\ncalling for increased gathering of actionable data towards climate change\nmitigation, satellite-based Geospatial Analytics players are rising to meet\nupcoming regulatory requirements,\" states report author Shivaprakash\nMuruganandham.\n\n     \"These companies are providing Big Data solutions across various\nmarkets, from oil and gas pipeline monitoring to carbon stocks assessment\nin forestry applications. With an already established ecosystem for M2M/IoT\napps, there is high growth potential for EO Big Data applications,\" adds\nMuruganandham.\n\n     As incumbents and startups alike, roll out newer applications, the Big\nData market will consolidate further. The line between EO and M2M/IoT data\napplications is expected to blur, with increasing crossover in applications\nbetween these two legacy industries. Boosted by the growing virtualization\nof satellite networks, as software-defined systems become more prevalent,\nthe applications crossover drives interoperability and smoother data\npipelines development.\n\n     Muruganandham concludes, \"With market evolution well underway, the\nopportunity profile for Big Data is broadening rapidly. Moving forward,\nadopting big data services across the value chain will not be a \"nice to\nhave\" but rather a necessity for most players in the satellite sector.\"\n\n     About the Report\n\n     NSR's Big Data Analytics via Satellite, 5th Edition report provides a\ncomprehensive analysis into the current state of market, technology, and\nbusiness trends in the world of satellite Big Data. The report offers\nindustry-leading forecasting into near and long-term prospects for the\nsatellite industry to leverage Big Data, both in satellite communications\nand satellite Earth Observation markets. The only report analyzing\nopportunity for the Network Management/Utilization market, across sectors\nand regions, BDvS5 details next generation insights, keeping readers ahead\nof the Curve.\n\n     For additional information on this report, including a full table of\ncontents, list of exhibits and executive summary, please visit www.nsr.com\nor call NSR at +1-617-674-7743.\n\n     Companies and Organizations?Mentioned in?NSR's BDvS5:\n\n     20Tree.ai, Aeris, Airbus, Atlantic Bridge, Amazon Web Services, Ball\nAerospace, BlackSky, Bosch, Cisco, Civic Connect, CloudEO, Cloudera,\nDescartes Labs, e-Geos, Earth-I, Ecometrica, ESRI, exactEarth, ESA,\nFarmbot, GE, GHGSat, Globalstar, Google, Greenspin, HawkEye 360, Hedron,\nHoneywell, IBM, iDirect, Inmarsat, Insight Terra, Integrasys, Iridium,\nKayrros, Kleos Space, LaserLight Communications, Maxar, MDA, Microsoft,\nNational Geospatial Intelligence Agency (NGA), National Oceanographic &amp;\nAtmospheric Administration (NOAA), National Reconnaissance Office (NRO),\nOmnitracs, OQ Technology, Orbcomm, Orbital Eye, Orbital Insight, Palantir,\nPlanet, Radiant Solutions, Ramon.Space, Rezatec, RigNet, RSMetrics,\nSatellogic, SatSure, SAP, SkyBitz, Skyloom, SpaceKnow, SpaceLink,\nSpaceUnion, Spire, TellusLabs, Thuraya, Tomorrow.io, Toyota, Unseen Labs,\nUP42, Ursa Space, U.S. Army, U.S. Air Force, U.S. Air Force Research Lab,\nVMWare, WarpSpace and Yxney Maritime\n\n     About NSR\n\n     NSR is the leading global market research and consulting firm focused\non the satellite and space sectors, NSR's global team, unparalleled\ncoverage and anticipation of trends with a high degree of confidence and\nprecision than the competition is the cornerstone of all NSR offerings.\nFirst to market coverage and a transparent, dependable approach sets NSR\napart as the key provider of critical insight to the satellite and space\nindustries.\n\n     Contact us at info@nsr.com to discuss how we can assist your business.\n\nPress Contact:\nKristen Kloster-Grady\nNSR Marketing Director\nKKloster@NSR.com\n\nTel   : 438-538-7555    NOMAD RTY CO LTD\nWWW   : <a href=\"https://www.nomadroyalty.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.nomadroyalty.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133200203.MNPRE2133201287-06270720211129</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}