{"date": "2022-02-20 17:42:52.177000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Amazon Presidents' Day deals are officially here with incredible markdowns on tons of top-rated tech, home goods and kitchen essentials. We scoured Amazon to help you find the absolute best discounts available today. Whether it's something for your kitchen or top-rated tech to give your smart home an upgrade, the online shopping giant is offering some of the best prices on a  <span>very</span> wide range of items. Whatever you need, Amazon has you covered.</p></div><div class=\"tr-npp-body\"><p><span><span>Get deals and shopping advice delivered straight to your phone.</span> Sign up for text message alerts from the experts at Reviewed.</span> </p><p>Below, you'll find our top Amazon deals today, including a top-rated Dutch oven, our favorite air fryer and some cozy and budget-friendly bed pillows, all of which have been vetted by our team of deals experts to make sure they're \"best of web\" prices. If you're looking for N95 and KN95 masks right now, Amazon also has plenty of choices on sale today, too.</p><p>► <span>Baby formula recall: </span> FDA warns consumers not to use select Similac, Alimentum and EleCare</p><p>► <span>Allbirds sale: </span> Get 20% off these popular sneakers right now</p><p>If you're not already an Amazon Prime subscriber, you can sign up for a 30-day membership for free. An Amazon Prime subscription gets you free two-day shipping and tons of other benefits for $14.99 a month ($7.49 for students and $6.99 for those receiving qualifying government assistance).</p><p>Better still, right now, shoppers can receive a $5 discount on their first $10-or-more Amazon app purchase. </p><p class=\"tr-npp-section-title\">The best Amazon Presidents' Day deals of the day</p><p><big>1. Under $100: This top-rated cast iron Dutch oven</big>  </p><p>If you're looking for some reliable cookware to add to your kitchen, consider the Staub cast iron cocotte. Normally listed for $130.89, this 4-quart round Dutch oven with a glass lid can be yours for as low as $99.95 in cherry red, black and white. We named the larger Staub cast iron 5.5-quart round cocotte (from $319) the best Dutch oven we've ever tested, so this smaller model is sure to impress with the tempered glass lid for optimal heat control and a multi-coat enamel—which the brand claims is resistant to chips, scratches and discoloration. The pot is designed for searing, boiling, deep-frying, braising and more in the oven, and works on both induction and traditional stovetops.</p><p><span>Get the Staub Cast Iron 4-Quart Round Cocotte from $99.95 (Save $5.62 to $107.65)</span> </p><p><big>2. 32% off: Our favorite affordable pillows </big> </p><p>Sleep soundly with a new set of Beckham Hotel Collection bed pillows, the best affordable pillows we've ever tested. Usually selling for $49.99 for the queen size, this set of two plush pillows can be yours for just $33.99 today, one of the lowest prices we've ever seen. In testing, we found these cushions felt similar to down and offered optimal support for side sleepers. We especially loved that they were washable and didn't smell after opening (like other synthetic-fill pillows we tested). </p><p><span>Get the Beckham Hotel Collection Bed Pillows from $33.99 (Save $16 to $24)</span> </p><p><big>3. Up to 37% down: These top-rated computer monitors </big> </p><p>Get the best visuals possible from your next PC gaming session by checking out these Samsung monitors on sale today at Amazon for as much as 37% off. For instance, there's the 27-inch Samsung Odyssey G5 gaming monitor, down from $449.99 to $379.99 thanks to a $70 price cut. According to the brand, this customer-favorite screen promises extra clarity, smooth transitions and an ultra wide view. If your budget is a bit tighter, there's the Samsung 23.5-Inch CF396 curved monitor available for $20 off at $169.99. Samsung says the monitor itself measures less than half an inch thick for a sleek design while still offering vibrant and vivid picture output thanks to Samsung's Active Crystal Color technology.</p><p><span>Save up to 37% on Samsung Monitors</span> </p><p><big>4. Save $150: Our favorite air fryer </big> </p><p>Air fryers make cooking a whole lot easier, but some of the best models can be pretty pricey. Fortunately, our favorite air fryer, the Philips Premium Airfryer XXL, is currently selling at as much as 43% off at Amazon. Typically listed for $349.95, you can get the 4-quart fryer in black for just $199.95. In testing, we were impressed with this model's large capacity and loved that it made crispy foods (including family-size portions) without preheating. Although this air fryer doesn't have digital controls, making it harder to precisely set the temperature and cooking time, we still found it to be the most user-friendly air fryer we tested. </p><p><span>Get the Philips Premium Airfryer XXL for $199.95 (Save $136 to $150)</span> </p><p><big>5. A 30% markdown: These excellent earbuds </big> </p><p>We think the Apple AirPods Pro are some of the best headphones available right now, and you can get the updated version for under $180 right now. We love the Pros for the Active Noise Cancelation that dampened environmental noise and the customizable fit of the buds. This new version adds MagSafe, which means you can hold it near a MagSafe charger and it will snap firmly into place and start charging. Get them now for $174.99—a $74.01 price cut from the $249 list price.</p><p><span>Get the Apple AirPods Pro for $174.99 (Save $74.01)</span> </p><p class=\"tr-npp-section-title\">The best Amazon Presidents' Day deals from this week</p><p><big>1. Fenun Indoor Insect Catcher</big> </p><p>With spring just around the corner, it's time to start thinking about keeping flies, mosquitoes and moths outside of your home when temperatures start to rise. Luckily, the Fenun fly trap can help keep your home bug free. Right now, you can pick up the black model at Amazon for just $27.19—$19.61 off the full $46.80 list price. The compact bug catcher simulates human body heat and catches flies, mosquitos, gnats and moths on an internal sticky glue board. Happy Amazon customers said the machine helped minimize mosquito bites and rid their homes of flying pests. </p><p><span>Get the Fenun Indoor Insect Catcher from $27.19 (Save $14.30 to $19.61)</span> </p><p><big>2. Nixplay Digital Picture Frame</big> </p><p>Relive priceless family memories with the Nixplay 10.1-inch digital picture frame, down from $209.99 to as little as $145.40 for the black version. Ranking as the best electronic frame we've ever tested, this digital display impressed us with its crisp, clean images and intuitive interface. Outfitted with impressive design features, like a motion sensor and compact remote, we found this model quickly loaded our images and seamlessly connected with the Nixplay app. \"The Nixplay digital picture frame is a dream to use,\" our tester said. </p><p><span>Get the Nixplay 10.1-Inch Digital Picture Frame from $145.40 (Save $64.59)</span> </p><p><big>3. Yosuda Indoor Cycling Bike</big> </p><p>Accomplish your fitness goals without leaving your home with the Yosuda indoor cycling bike. This stationary bike features an adjustable handlebar, a padded seat and a variety of resistance levels to give you a great workout at home. Better still, this model also includes an LCD monitor to track your time, speed, distance and calories burned and has a convenient iPad holder. Usually ringing up for $299.99, you can take home this exercise machine for just $254.99 right now—a savings of $45. </p><p><span>Get the Yosuda Indoor Cycling Bike For $254.99 (Save $45) </span> </p><p><big>4. Cloud Massage Shiatsu Foot Massager Machine</big> </p><p>Ease your soles anytime with Amazon's best-selling electric foot massager, the Cloud Massage Shiatsu foot massager. Currently listed for $299.99, this adjustable leg and foot massager can be yours for $174.99 when you check off the $125 on-page coupon. The Cloud Massage device is our favorite upgrade pick for foot massagers for its adjustable design that can be applied to your feet, ankles, thighs or calves. We also appreciated how easy it was to change between the massager's various modes, including vibration, heat, rolling, compression and a swaying motion.</p><p><span>Get the Cloud Massage Shiatsu Foot Massager Machine for $174.99 with on-page coupon (Save $125)</span> </p><p><big>5. Amazon Music Unlimited</big> </p><p>You can get access to tens of millions of songs with Amazon's premium music service. New subscribers to Amazon Music Unlimited can get a three-month trial run on the service totally free before paying the typical $9.99 monthly fee ($7.99 for Prime members). AMU is one of the best music streaming services we've ever tested for its expansive library of 90 million songs accessible on-demand without ad interruption—you can even download songs to your device for offline playback. Another feather in its cap is its Dolby Atmos Music feature, which expands a song's mix selection for heightened surround and speaker height elements.</p><p><span>Get a Three-Month Trial of Amazon Music Unlimited for free (Save $29.97)</span> </p><p class=\"tr-npp-section-title\">Other noteworthy Amazon Presidents' Day deals we found </p><ul class=\"bulleted-list arrowlist\"><li>Save up to 36% on select Blink smart home security devices</li><li>Hertzko Self-Cleaning Slicker Brush for Dogs and Cats for $14.99 (Save $15.29)</li><li>Bella 17288 Double Cooker from $16.98 with coupon (Save $3.49 to $5)</li><li>Lement KN95 Face Mask 50-Pack for $19.99 (Save $40)</li><li>Errbic Solar Charger for $20.39 (Save $9.60) </li><li>Kasa Smart Plug Power Strip for $24.99 (Save $5)</li><li>H&amp;R Block Tax Software Deluxe + State 2021 PC Download for $25.83 (Save $19.16)</li><li>Hilife HL7 Steamer for $29.99 (Save $6)</li><li>JALL Wake Up Light Sunrise Alarm Clock for $39.08 (Save $6.90)</li><li>MySmile Powerful Cordless Water Dental Flosser from $47.59 (Save $33 to $36.40)</li><li>Logitech C920x Pro HD Webcam for $59.99 (Save $10)</li><li>Logitech G Pro Wireless Gaming Mouse for $77.82 (Save $52.17)</li><li>Levoit Core 200S Air Purifier for $79.98 (Save $10.01)</li><li>Bissell Power Fresh Steam Mop for $82.69 (Save $10)</li><li>Keurig K-Slim Coffee Maker from $89.99 (Save $20 to $40)</li><li>Bose SoundLink Micro for $99 (Save $20)</li><li>Ninja BL660 Professional Countertop Blender for $99.99 (Save $20)</li><li>Amazon Fire HD 10 from $109.99 (Save $40)</li><li>Fitbit Charge 5 from $119.25 (Save $60 to $60.70)</li><li>Fitbit Versa 2 Health and Fitness Smartwatch for $129.95 (Save $46)</li><li>Vybe Premium Deep Tissue Muscle Massage Gun for $149.99 with coupon (Save $20)</li><li>Apple AirPods Pro for $174.99 (Save $74.01)</li><li>Eufy RoboVac G30 for $229.99 (Save $90)</li><li>Tineco iFLOOR3 Cordless Wet Dry Vacuum from $249.99 with coupon (Save $50 to $60)</li><li>Amazon Fire TV Omni Series 4K UHD Smart TV from $299.99 (Save $110 to $350)</li> </ul><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Updated daily: Here are the 10 best Amazon Presidents' Day deals today</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}