{"date": "2021-11-05 18:06:38.544000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3477.0, "close": 3488.98}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Inside Jeff Bezos' US$78 million Hawaiian mansion - the Amazon billionaire's new beachfront property comes with an outdoor kitchen with ocean views and massive pool</p><p>If you're<a href=\"https://www.scmp.com/magazines/style/celebrity/article/3140703/jeff-bezos-retired-not-slowing-down-heading-space-these\" data-type=\"url\" class=\"tr-link\" translate=\"no\">the wealthiest person in the world</a>, splurging on a gigantic home in a remote Hawaiian getaway would hardly put a dent in your fortune. And that's just what Jeff Bezos did, along<a href=\"https://www.scmp.com/magazines/style/celebrity/article/3116417/jeff-bezos-and-lauren-sanchezs-roller-coaster-romance\" data-type=\"url\" class=\"tr-link\" translate=\"no\">with his girlfriend, Lauren Sánchez.</a>The duo have reportedly bought a tropical estate in the La Perouse Bay on the island of Maui for an estimated US$78 million.</p></div><div class=\"tr-npp-body\"><ul class=\"bulleted-list arrowlist\"><li>The former Amazon CEO splurged on a secluded 4,500 sq ft mega mansion with girlfriend Lauren Sánchez in the La Perouse Bay on the island of Maui</li><li>In February 2020, Bezos also bought the Warner estate in Beverly Hills for US$165 million, and has been spotted on holidays to London, St. Tropez and Spain with his new flame</li></ul><p>The isolated property spans across four hectares (14 acres) of land. And while there's little word on the grounds, the sprawling main house is said to be about 4,500 sq ft and includes an outdoor kitchen with ocean views.</p><p>It is accompanied by a 1,700 sq ft guest house, several other smaller buildings and a perfectly circular, 700 sq ft swimming pool. The house is also surrounded by lush lawns and dozens of palm trees.</p><p>Do you have questions about the biggest topics and trends from around the world? Get the answers with<a href=\"https://www.scmp.com/knowledge\" data-type=\"url\" class=\"tr-link\" translate=\"no\">SCMP Knowledge</a>, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team.</p><p>The oceanfront estate is situated on the sparsely populated southwestern side of Maui, far away from Kahului, the largest city on the island. The house is about 19km (12 miles) south of Kihei, the nearest major city, and is flanked by state parkland and rocky lava fields.</p><p>As per media reports, the property originally belonged to Colorado-based energy businessman Doug Schatz, who acquired it in 1996 with his business partners for US$4.2 million, according to Dirt.com. Later in 1999, Schatz and his wife bought out the entire estate and spent several thousands more to renovate it according to their liking.</p><p><span>Bezos and Sánchez's bittersweet romance</span></p><p>After<a href=\"https://www.scmp.com/magazines/style/celebrity/article/3137516/jeff-bezos-ex-mackenzie-scott-just-gave-away-another-us27\" data-type=\"url\" class=\"tr-link\" translate=\"no\">divorcing his ex-wife MacKenzie Scott</a>, Bezos found a friend and lover in news anchor Sánchez in 2019.</p><p>But the couple has had its fair share of controversies over the years involving leaked texts, blackmail – and that billion-dollar divorce, of course. In 2019, the Amazon founder accused the owner of <span>The National Enquirer</span> of \"extortion and blackmail\" after the tabloid newspaper allegedly threatened to publish intimate photos and text messages between Bezos and Sánchez, according to <span>The Guardian.</span> </p><p>The tabloid owner's connection with<a href=\"https://www.scmp.com/magazines/style/celebrity/article/3134927/5-stars-who-turned-down-donald-trump-princess-diana-was\" data-type=\"url\" class=\"tr-link\" translate=\"no\">former US president Donald Trump,</a>the involvement of Lauren's brother Michael Sánchez, and several other factors also became the talk of the town at around the same time.</p><p>However, the celebrity couple appears to have moved past it all. Bezos and Sánchez are often spotted cruising around the world. They made their first public appearance as a couple at a Wimbledon tennis tournament in London, right after the billionaire's divorce in July 2019, according to <span>The Daily Mail.</span> </p><p>In August 2019, Bezos and Sánchez were also seen strolling through St. Tropez and cruising off the coast of Spain, in the Balearic Islands, aboard media mogul David Geffen's superyacht. The duo has made several public appearances since then, including one in India.</p><p><span>The Maui holiday home</span></p><p>But now all eyes are on the couple's visit to their new, posh residence in Maui. The news of Bezos and Sánchez's new purchase was first reported by <span>Pacific Business News</span> . A source close to the couple said the following: \"Jeff and Lauren love Maui, have a home on the island, visit frequently and want to be a part of supporting the local community.\"</p><p>In February 2020, Bezos also reportedly bought the Warner estate in Beverly Hills for US$165 million, according to Insider. <br/><br/><span>Want more stories like this? Sign up here. Follow STYLE on</span><a href=\"https://www.facebook.com/scmpstyle\"><span><span>Facebook</span></span> </a><span>,</span><a href=\"https://www.instagram.com/scmp_style/?hl=en\"><span><span>Instagram</span></span> </a><span>,</span><a href=\"https://www.youtube.com/channel/UCtYYXR3QV_1mKdJNksfCRtQ?view_as=subscriber\"><span><span>YouTube</span></span> </a><span>and</span><a href=\"https://twitter.com/scmp_style\"><span><span>Twitter</span></span> </a><span>.</span><span><br/> </span><span><br/> </span><span>This article originally appeared on</span><a href=\"https://luxurylaunches.com/real_estate/jeff-bezos-hawaii-home.php\"><span>Luxurylaunches</span> </a></p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 South China Morning Post Publishers Ltd. All rights reserved.</p></div>"}