{"date": "2022-02-10 01:07:16.318000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3228.27, "close": 3180.07}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>A dedicated storefront for yurveda products on Amazon.in marketplace was launched by Union Minister for YUSH, Shri Sarbananda Sonowal, at a virtual event today. This event was also attended by MoS for Ayush Shri Munjpara Mahendrabhai and other dignitaries. The event started with a short video film on Ayurveda and its advantages.</p><p>This Ayurveda product storefront will enhance visibility of unique Ayurveda products such as various kinds of juices, skin-care supplements, immunity boosters, oils and more from small businesses and startup brands. It will make shopping easier as product selection has been organized according to focus areas and health benefits such as pain management, immunity boosters, blood purifiers, women?s health, weight management, mental wellness etc.</p></div><div class=\"tr-npp-body\"><p>Speaking at the virtual launch event, Shri Sarbananda Sonowal said, ?It is important to scientifically develop Ayurveda, Siddha, Homeopathy medicines for COVID-19, it is equally important to establish a robust marketing network of these products to reach to the masses. I am happy that Amazon through its e-commerce platform has been instrumental in strengthening the supply chain by ensuring the delivery of the products, whether it may be Chyvanprash, Ayush Kadha, or Ayush -64. As a nation, we need to take the necessary steps to encourage small and big companies as well as startups to focus on making Ayush a part of our daily lives which will be a step forward towards fulfilling Prime Minister of India?s vision of Atmanirbhar Bharat.?</p><p>The minister further said that Ministry is also promoting the Ayu-Raksha kit, Bala-Raksha kit and Swasthya Raksha kit developed by All India Institute of Ayurveda for protecting the people from COVID. These kits are a combo-pack of 3-4 Ayurveda medicines e.g. Samshamani vati, Anu Taila, Ayush kwath and Chyanprash. He said, these kits can be made available to the public by Amazon through an e-commerce platform.</p><p>Shri Sonowal also informed that various initiatives taken by the Ministry of AYUSH has increased the Ayush market size from USD 3 billion in the year 2014 to USD 18 Billion and Ayush manufacturing sector as well as Service sector should take the maximum advantage of various promotional schemes launched by the Government to further scale-up the Ayush market.</p><p>On this occasion, Manish Tiwary, Country Manager, India Consumer Business, Amazon India said that Ayurveda has always been a part of the Indian way of life and we are happy to launch this dedicated storefront. He further said that the Government of India is putting a special focus on creating awareness about Ayurveda and this storefront is a part of our efforts to contribute to this vision and make Ayurvedic products more accessible to customers.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Euclid Infotech Pvt Ltd.</p></div>"}