{"date": "2021-12-01 19:39:19.142000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>ElectrifAi has announced the launch of both Machine Learning as a Service (MLaaS) and SpendAi on Amazon Web Services.</p><p>ElectrifAi made the announcement at AWS re:Invent 2021 in Las Vegas.With MLaaS, now all companies in many verticals can quickly harness the power of machine learning and turn their data into a strategic advantage to drive revenue as well as to reduce cost and risk. Clients can easily get started with machine learning and pre-built models without the expense and time-consuming efforts of installing and purchasing platforms, assembling teams, or providing their own servers. With MLaaS available through AWS, the client's data operates directly on AWS cloud servers and MLaaS increases the efficiency and convenience of machine learning on the cloud.By using MLaaS, clients can quickly achieve many benefits to improve their operations and capabilities. Some of those benefits include:lower costs, as provisioning one pre-structured model can be cheaper than the annual cost of a single data scientist;faster time-to-deployment and lower project risk, as the average deployment of a pre-built model is between 8-12 weeks for MLaaS versus 8-12 months to build new machine learning models; andfaster time-to-value with a high return on investment (ROI).One of ElectrifAi's highly successful MLaaS offerings is SpendAi, a deep spend analytics product. Now available on AWS, SpendAi can help procurement professionals quickly solve business problems with more accurate data to help eliminate cost and risk. Some of the benefits of SpendAi include:superior visibility across multiple sources of data,higher quality sources of spend data,better degrees of classification, categorization and grouping,greater flexibility, andelimination of maverick spend.SpendAi has been proven to reduce indirect spend by 2-4% in 6-8 weeks generating substantial savings and ROI for clients.Other pre-built models offered by ElectrifAi as MLaaS include customer segmentation, product cross sell and up sell, demand forecasting, dynamic pricing, credit decisioning, computer vision and many others.\"We're pleased to introduce our MLaaS and SpendAi offerings on AWS. Today, more than ever, executives are seeking to use data to optimize their businesses. Data is the last untapped asset and companies are demanding time-to-value and high ROI to drive revenue and cost reduction. With MLaaS and SpendAi, all companies (large and small) can now easily and quickly achieve the benefits of machine learning and pre-built models. ElectrifAi is helping companies across the globe grow and become more competitive through data-driven business decisions and we are taking the friction and complexity out of machine learning and computer vision.\" - Edward Scott, CEO, ElectrifAi</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}