{"date": "2022-02-08 15:30:47+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\"><li class=\"tr-summaryitem\">To compete with models including BMW X1, Mercedes GLA</li><li class=\"tr-summaryitem\">Tonale has built-in Amazon Alexa voice assistant</li><li class=\"tr-summaryitem\">Orders open in April</li><li class=\"tr-summaryitem\">Offer starts with mild-hybrid, plug-in later this year</li></ul><p class=\"tr-advisory\">Adds details</p><p class=\"tr-by\">By Giulio Piovaccari</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">MILAN, Feb 8 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Stellantis <a href=\"reuters://REALTIME/Verb=FullQuote/ric=STLA.MI\" data-type=\"ric\" data-ric=\"STLA.MI\" translate=\"no\" dir=\"ltr\">STLA.MI</a> on Tuesday unveiled its new Alfa Romeo Tonale compact sport utility vehicle (SUV) as it aims to expand in the premium market and add electrified and interconnected vehicles to its range.</p><p>The new model, named after an Alpine pass in northern Italy,  will compete in a segment populated by some of Europe's most popular premium cars such as BMW's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=BMWG.DE\" data-type=\"ric\" data-ric=\"BMWG.DE\" translate=\"no\" dir=\"ltr\">BMWG.DE</a> X1, the Mercedes GLA and Volkswagen's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=VOWG_p.DE\" data-type=\"ric\" data-ric=\"VOWG_p.DE\" translate=\"no\" dir=\"ltr\">VOWG_p.DE</a> Audi Q3.</p><p>The world's fourth largest carmaker plans to spend over 30 billion euros ($34.2 billion) through 2025 to electrify its vehicle lineup and boost its software content to catch up with rivals, including Tesla <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TSLA.O\" data-type=\"ric\" data-ric=\"TSLA.O\" translate=\"no\" dir=\"ltr\">TSLA.O</a>. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2SS1A7\" data-type=\"storyId\" data-story-id=\"nL8N2SS1A7\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>The Tonale includes built-in Amazon Alexa voice assistant features. Owners will be able to choose their car as a delivery spot, allowing couriers to unlock the doors safely and leave a parcel inside the vehicle.</p><p>\"It marks a step in the direction of our group becoming a technology company,\" the brand's head Jean-Philippe Imparato said during a web presentation.</p><p>The new Tonale, to be built at Italy's Pomigliano plant near Naples, is Alfa Romeo's first electrified vehicle and is initially offered in mild hybrid as well as a diesel engine models. <span class=\"tr-strong\">A plug-in hybrid version</span>, with an all electric range of up to 80 kilometres, will arrive later this year.</p><p>Imparato did not provide details about when an all electric version could be released. Sales prices are expected to be announced before orders open in April.    </p><p>Some analysts say the Alfa Romeo brand could be part of Stellantis' strategy in China, the world's biggest auto market, where it has been lagging behind most competitors.</p><p>Imparato has promised a new model release for Alfa Romeo every year to 2026, starting with 2022's Tonale. This should include a smaller-sized SUV, expected to be built in Poland. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2QV5N8\" data-type=\"storyId\" data-story-id=\"nL8N2QV5N8\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Starting from 2027, all Alfa Romeo new vehicles will be <span class=\"tr-strong\">all electric</span>, he has said. </p><p>Stellantis was formed last year through the merger of Fiat Chrysler and Peugeot maker PSA, and is home to 14 brands, including bestseller Jeep, DS and Lancia in the premium segment and Maserati in the luxury end.    </p><p>The new Alfa Romeo Tonale is based on a former Fiat Chrysler architecture, while the first Stellantis models built on a new shared platform are expected from next year. <br/> ($1 = 0.8767 euros)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Giulio Piovaccari<br/>Editing by Keith Weir)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:giulio.piovaccari@thomsonreuters.com\" data-type=\"email\" translate=\"no\">giulio.piovaccari@thomsonreuters.com</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: STELLANTIS-ALFA ROMEO/ (UPDATE 1, PIX)</p></div>"}