{"date": "2021-12-19 18:04:40.142000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-abstract\"><p>Amazon may take legal action against Competition Commission of India\u0092s (CCI's) suspension of the US e-commerce giant\u0092s 2019 deal with Future Retail (FRL). The legal teams of Amazon are planning to file an appeal in the National Company Law Appellate Tribunal (NCLAT), Delhi High Court (HC) or later approach the Supreme Court (SC) against CCI decision, said people familiar with the legal strategy of Amazon.</p></div><div class=\"tr-npp-lead\"><p>CCI on Friday suspended Amazon\u0092s 2019 deal with FRL for its deliberate design to suppress information about the scope and purpose of the deal. The antitrust regulator has imposed a penalty of ~200 crore on Amazon to be paid within 60 days of receipt of order.</p><p>\u0093The Amazon-Future deal was like a marriage where the janam kundalis (birth charts) of the boy and girl were exchanged. The records clearly showed the boy to be a Manglik. A few years into the marriage, the other family says 'the information about the boy being Manglik was not given verbally, so the marriage has to end',\u0094 said a person in the know.</p></div><div class=\"tr-npp-body\"><p>\u0093Similarly when Amazon submitted the document to CCI, it clearly mentioned the company\u0092s investment in Future Coupons (FCL) as a strategic one since the government at some point in time would have allowed investment in the multi-brand retail sector. Amazon\u0092s legal team is expected to make the argument that there was no misrepresentation of facts,\u0094 he added.</p><p>A spokesperson for Amazon on Friday had said the firm was reviewing the order passed by CCI.</p><p>This issue dates back to August 2019, when Amazon acquired 49 per cent in FCL, the promoter entity of FRL, for ~1,500 crore. A year later, in August 2020, Future Group struck a $3.4-billion asset-sale deal with Reliance Industries (RIL).</p><p>In October 2020, Amazon had sent a legal notice to Future for striking a deal with RIL. It alleged Future\u0092s $3.4-billion asset sale deal with RIL breached an agreement with Amazon. It cited its non-compete agreement with the Kishore Biyani-led chain. The deal specified any disputes would be arbitrated under the Singapore International Arbitration Centre (SIAC) rules. The same month, Amazon got a favourable ruling for its plea in SIAC.</p><p>In November 2020, Future moved the Delhi HC against Amazon, alleging interference by the US firm in the deal with RIL. Since then, Amazon has been fighting a legal battle with FRL to stop Future\u0092s $3.4-billion deal with RIL.</p><p>Legal experts said the CCI order against Amazon is unprecedented. It is for the first time that such an order has been passed by the CCI. \u0093It reiterates established jurisprudence that all the transactions, which may in any manner be interconnected or related or known in advance, are to be disclosed to CCI,\u0094 said Rahul Goel, partner, AnantLaw.\u0094 The CCI order is novel in many ways. One, it is the first case since the introduction of the merger control regime in June 2011 the CCI has suspended its approval. \u0093Whether CCI has the power to do that under the scheme of the Competition Act will be tested before the appellate court,\u0094 said Vaibhav Choukse, partner, JSA.</p><p>CCI has also directed Amazon to notify the deal afresh in Form II, which will enable it to conduct the competition assessment with all material information.</p><p>\u0093Two, it\u0092s the highest penalty ever imposed by CCI relating to combinations. There are two sets of penalties levied by CCI: (i) for suppression/omission of material facts, and (ii) for failure to notify combination i.e., gun-jumping,\u0094 said Choukse.</p><p>Legal experts also said Amazon is likely to appeal against the CCI order before the appellate tribunal. \u0093Given the track record of NCLAT, it is likely to stay the CCI order with a condition to deposit 10 per cent of the penalty amount. With respect to suspending the 2019 CCI approval, it won\u0092t hurt Amazon,\u0094 said Choukse.</p><p>Legal experts said with CCI flexing its muscle, the firms involved in the merger and acquisition activities will be on their toes while undertaking the merger-control analysis. Amazon has the option to reapply for antitrust clearance. However, Salman Waris, managing partner at technology law firm TechLegis Advocates &amp; Solicitors, said after CCI's decision, Future Group is unlikely to cooperate.</p><p>\u0093Future Group is likely going to take CCI's decision before various legal fora. The suspension of approval is unprecedented,\u0094 said Waris, adding, \u0093The order seems to have found new power for CCI to keep the combination approval in abeyance. This could dent Amazon\u0092s legal position and retail ambitions, making it easier for Reliance to acquire Future Group.\u0094</p><p>This is crucial since 7 per cent of India\u0092s $1.2-trillion retail market is online, and Amazon and its rivals, including Reliance\u0092s JioMart and Walmart-owned Flipkart, are aggressively eyeing the remaining 93 per cent. Also, the Indian e-commerce market is expected to grow to $200 billion by 2026, from $38.5 billion in 2017.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}