{"date": "2022-01-17 08:38:24+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <h4>\n        Posted: 17/01/2022\n      </h4>\n                <div>\n        Share article\n      </div>\n                <p>\n                  <strong>17 January 2022, London</strong> - Blackbird plc (AIM:BIRD, OTCQX: BBRDF), the technology licensor, developer and seller of the market-leading cloud native video editing platform, Blackbird, announced today that Blackbird has achieved Amazon Web Services (AWS) Technology Partner status and completed the Foundational Technical Review (FTR) of Blackbird Edge to accelerate AWS engagement.\n      </p>\n                <p>\n        The AWS FTR enables AWS Partners to identify and remediate risks in their products or solutions. The FTR is led by an AWS Partner Solutions Architect (PSA) who reviews AWS Partner products and solutions against a specific set of requirements based around security, reliability and operational excellence as defined by the AWS Well-Architected Framework. Adhering to FTR guidelines, Blackbird can review projects against FTR requirements to select best practices to follow ensuring the best possible client experience.\n      </p>\n                <p>\n        As an AWS Technology Partner, Blackbird offers any company creating video at scale, access to rapid, efficient cloud content production. Browser based Blackbird is a fast, powerful browser-based professional cloud native video editing platform that provides instant access to video content for the easy creation of clips, highlights and long form content for rapid publishing to multiple channels.\n      </p>\n                <p>\n        Blackbird enables remote production, removing the need to travel to a facility or event and also eliminates the need to transit material to and from multiple local storage environments. Proven to reduce carbon emissions by up to 91% compared to traditional video editing workflows, Blackbird also reduces infrastructure costs by up to 75% due to its cloud native architecture.\n      </p>\n                <p>\n                  <strong>Blackbird plc CEO, Ian McDonough, said</strong>: \"We are very happy to have achieved the AWS Foundational Technical Review. Replicating and enhancing the genre-defining Blackbird cloud video experience in a public cloud has been a stated ambition of ours for some time. AWS have been very supportive and enabled us to get to this first significant step. This milestone is significant as fast-tracked progress through the AWS Partner Network will allow us to scale much more flexibly for our customers which is key, whilst opening up the addressable market for Blackbird significantly.\"\n      </p>\n                <div>\n        Share article\n      </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.blackbird.video/news-articles/blackbird-achieves-aws-technology-partner-status-and-completes-foundational-technical-review-to-accelerate-aws-engagement/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Blackbird plc</strong> published this content on <strong>17 January 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>17 January 2022 08:38:24 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - Blackbird plc</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Blackbird-plc</p></div>"}