{"date": "2021-12-11 21:34:14+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3444.24, "close": 3381.83}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds record for number of humans simultaneously in space; Churchley comment</p><p class=\"tr-by\">By Joe Skipper and Steve Gorman</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">VAN HORN, Texas, Dec 11 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>The eldest daughter of pioneering U.S. astronaut Alan Shepard took a joyride to the edge of space aboard Jeff Bezos' Blue Origin rocketship on Saturday, 60 years after her late father's famed suborbital NASA flight at the dawn of the Space Age.</p><p>Laura Shepard Churchley, 74, who was a schoolgirl when her father first streaked into space, was one of six passengers buckled into the cabin of Blue Origin's fully autonomous New Shepard spacecraft as it lifted off from a launch site outside the west Texas town of Van Horn.</p><p>The crew capsule separated from the top of six-story-tall rocket as it soared to an altitude of at least 62 miles (100 km) before falling back to Earth to descend under a canopy of three parachutes to the desert floor for a safe landing.</p><p>The entire flight, from liftoff to touchdown, lasted just over 10 minutes, with the crew experiencing a few minutes of weightlessness at the apex of the suborbital flight. </p><p>New Shepard's reusable rocket booster flew itself back to Earth and touched down a short distance from where the capsule landed moments later.</p><p>Bezos arrived with members of Blue Origin's recovery team to greet and embrace the newly minted citizen astronauts as they emerged from the capsule, all smiles, in their blue flight suits. He then pinned astronaut wings to each of their collars amid a flurry of applause and cheers.</p><p>As she chatted with Bezos, Churchley briefly recounted her wonder at seeing the blackness of space from inside the capsule.</p><p>Voices of Churchley and her crewmates exclaiming excitement at the ride could be heard in audio transmissions from the capsule played during a live launch webcast by Blue Origin as the vehicle neared the climax of its flight.</p><p>The spacecraft itself is named for Alan Shepard, who in 1961 made history as the second person, and first American, to travel into space - a 15-minute suborbital flight as one of NASA's original \"Mercury Seven\" astronauts. A decade later, Shepard walked on the moon as commander of the Apollo 14 mission, famously hitting two golf galls on the lunar surface.</p><p>\"I kind of feel a little bit like I'm following in my father's footsteps,\" Churchley said in pre-recorded remarks before the flight. \"I feel like he's right here with me.\"</p><p><br/></p><p>CITIZEN ASTRONAUTS</p><p>Churchley was one of two honorary, non-paying guest passengers chosen by Blue Origin for Saturday's flight. The other was Michael Strahan, 50, a retired National Football League star and co-anchor of ABC television's \"Good Morning America\" show. </p><p>They were joined by four wealthy customers who paid undisclosed but presumably hefty sums for their New Shepard seats - space industry executive Dylan Taylor, engineer-investor Evan Dick, venture capitalist Lane Bess and his 23-year-old son, Cameron Bess. The Besses made history as the first parent-child pair to fly in space together, according to Blue Origin.</p><p>The flight briefly set a record for the number of humans in space at any one time - 19 total - including seven crew members and three visitors aboard the International Space Station and three Chinese taikonauts aboard their own newly build space station, according to Harvard-Smithsonian astrophysicist Jonathan McDowell. </p><p>The launch was the third space tourism flight for Blue Origin, the company formed two decades ago by Bezos - founder and executive chairman of Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>. It was the company's first with a crew of six passengers.</p><p>No mention was made during the Blue Origin launch webcast of <a href=\"https://www.reuters.com/world/us/injuries-reported-after-roof-collapse-amazon-warehouse-illinois-ap-2021-12-11\" data-type=\"url\" class=\"tr-link\" translate=\"no\">the deadly partial roof collapse</a> at an Amazon.com warehouse struck by a tornado late on Friday in the town of Edwardsville, Illinois, or the search for people trapped in the rubble. </p><p>Bezos himself tagged along on Blue Origin's <a href=\"https://www.reuters.com/technology/jeff-bezos-worlds-richest-man-set-inaugural-space-voyage-2021-07-20\" data-type=\"url\" class=\"tr-link\" translate=\"no\">inaugural flight</a> in July, joining his brother, Mark Bezos, trailblazing octogenarian female aviator Wally Funk, and 18-year-old Oliver Daeman, a Dutch high school graduate and beneficiary of a $28 million auction sweepstake.</p><p>Actor William Shatner, who embodied the promise of space travel in his role as Captain James T. Kirk of the starship Enterprise on the 1960s TV series \"Star Trek,\" <a href=\"https://www.reuters.com/lifestyle/science/star-trek-actor-shatner-poised-blue-origin-space-jaunt-2021-10-13\" data-type=\"url\" class=\"tr-link\" translate=\"no\">joined</a> the second New Shepard crew in October to become the oldest person in space at age 90.</p><p>British billionaire Richard Branson beat Bezos to the punch by nine days when <a href=\"https://www.reuters.com/lifestyle/science/virgin-galactics-branson-ready-space-launch-aboard-rocket-plane-2021-07-11\" data-type=\"url\" class=\"tr-link\" translate=\"no\">he rode along</a> on the first fully crewed voyage of his own space tourism venture Virgin Galactic Holding Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SPCE.N\" data-type=\"ric\" data-ric=\"SPCE.N\" translate=\"no\" dir=\"ltr\">SPCE.N</a>, soaring to the edge of space over New Mexico in a rocket plane released at high altitude from a carrier jet.</p><p>A third player in the burgeoning space tourism sector, fellow billionaire entrepreneur Elon Musk, inaugurated his SpaceX citizen-astronaut service in September with the launch of the first <a href=\"https://www.reuters.com/lifestyle/science/spacex-capsule-with-worlds-first-all-civilian-orbital-crew-set-splashdown-2021-09-18\" data-type=\"url\" class=\"tr-link\" translate=\"no\">all-civilian crew</a> ever to reach Earth orbit.</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Repotring by Joe Skipper in Van Horn, Texas and Steve Gorman in Los Angeles; Editing by Daniel Wallis and Bill Berkrot)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:steve.gorman@thomsonreuters.com\" data-type=\"email\" translate=\"no\">steve.gorman@thomsonreuters.com</a> ; 310-491-7256; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://steve.gorman.thomsonreuters.com@reuters.net\">steve.gorman.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SPACE-EXPLORATION/BLUEORIGIN (UPDATE 4, PIX, TV)</p></div>"}