{"date": "2022-01-13 11:11:00.161000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3307.24, "close": 3224.28}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwblockalignl{margin-left:0px;margin-right:auto;}.storyContent .bwcellpmargin{margin-bottom:0px;margin-top:0px;}.storyContent .bwlistdecimal{list-style-type:decimal;}.storyContent .bwlistdisc{list-style-type:disc;}.storyContent .bwnowrap{white-space:nowrap;}.storyContent .bwpadl0{padding-left:0px;}.storyContent .bwtablemarginb{margin-bottom:10px;}.storyContent .bwuline{text-decoration:underline;text-decoration-color:inherit;}.storyContent .bwvertalignt{vertical-align:top;}</style><p class=\"bwalignc\">\n<b><span>FranklinCovey and Mango Publishing Release New Book, Strikingly Different Selling: 6 Vital Skills to Stand Out and Sell More</span></b>\n</p><p class=\"bwalignc\">\n<b><span>FranklinCovey Sales Performance Experts Reveal Secrets for Standing Out From Competitors for Consistent, Predictable Sales Success in Their Amazon #1 New Release in Sales and Selling</span></b>\n</p><p>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.franklincovey.com%2F&amp;esheet=52562286&amp;newsitemid=20220113005291&amp;lan=en-US&amp;anchor=Franklin+Covey+Co.&amp;index=1&amp;md5=041707f212e04966e43eb01632e84ac3\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Franklin Covey Co.</a> (NYSE: FC), one of the largest leadership companies in the world, and <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fmango.bz%2F&amp;esheet=52562286&amp;newsitemid=20220113005291&amp;lan=en-US&amp;anchor=Mango+Publishing&amp;index=2&amp;md5=c5a447b53352b8712bfb20eb21ed0f8f\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Mango Publishing</a> today announced the release of <span><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.franklincovey.com%2Fstrikingly-different-book%2F%3Fcatargetid%3D330001490000116320%26CAPCID%3D511706021237%26CATCI%3Daud-623733580487%3Adsa-19959388920%26CAAGID%3D95309469023%26CADevice%3Dc%26gclid%3DEAIaIQobChMI352ErvX39AIV6RXUAR1YQwQFEAAYASAAEgLfNvD_BwE&amp;esheet=52562286&amp;newsitemid=20220113005291&amp;lan=en-US&amp;anchor=Strikingly+Different+Selling%3A+6+Vital+Skills+to+Stand+Out+and+Sell+More&amp;index=3&amp;md5=ea771de3095079e7df8178e16047b67e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Strikingly Different Selling: 6 Vital Skills to Stand Out and Sell More</a>, </span>which launches on January 18. In their book, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.franklincovey.com%2Fsolutions%2Fsales-performance%2F&amp;esheet=52562286&amp;newsitemid=20220113005291&amp;lan=en-US&amp;anchor=FranklinCovey+Sales+Performance+Experts&amp;index=4&amp;md5=1eddcd3d6fd377140fc1ecf839b8f783\" data-type=\"url\" class=\"tr-link\" translate=\"no\">FranklinCovey Sales Performance Experts</a>, co-authors <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.franklincovey.com%2Fwp-content%2Fuploads%2F2021%2F09%2FDale-Merrill_FinalBio.pdf&amp;esheet=52562286&amp;newsitemid=20220113005291&amp;lan=en-US&amp;anchor=Dale+Merrill&amp;index=5&amp;md5=10293d4bd317a0ed5ba17e18fc792427\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Dale Merrill</a>, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.franklincovey.com%2Fwp-content%2Fuploads%2F2021%2F03%2FScott-Savage-bio-2020-v2.pdf&amp;esheet=52562286&amp;newsitemid=20220113005291&amp;lan=en-US&amp;anchor=Scott+Savage&amp;index=6&amp;md5=5f4d7f9d41225a7c6446fdb8a0324e7f\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Scott Savage</a>, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.franklincovey.com%2Fabout%2Fexecutive-team%2Fjen-colosimo%2F&amp;esheet=52562286&amp;newsitemid=20220113005291&amp;lan=en-US&amp;anchor=Jennifer+Colosimo&amp;index=7&amp;md5=db1fb514cd3b1bba763b9336a478171e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Jennifer Colosimo</a>, and <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fresources.franklincovey.com%2Fauthors%2Frandy-illig%3Fcatargetid%3D330001490000116320%26CAPCID%3D511706021237%26CATCI%3Daud-623733580487%253Adsa-19959388920%26CAAGID%3D95309469023%26CADevice%3Dc%26gclid%3DEAIaIQobChMIn6ih3fT39AIVtxTUAR3ESQtkEAMYASAAEgIbzfD_BwE&amp;esheet=52562286&amp;newsitemid=20220113005291&amp;lan=en-US&amp;anchor=Randy+Illig&amp;index=8&amp;md5=f924e260abb24cb64d594b4e412143f6\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Randy Illig</a> reveal the secrets for standing out from competitors for consistent, predictable sales success in their Amazon #1 New Release in Sales and Selling. The book was written for sales professionals just starting their career, those who are seasoned, and for sales executives and managers who lead teams and are responsible for sales success.\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: <a href=\"https://www.businesswire.com/news/home/20220113005291/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220113005291/en/</a></p><div id=\"bwbodyimg\" style=\"width:316px;float:left;padding-left:0px;padding-right:20px;padding-top:0px;padding-bottom:0px\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"FranklinCovey and Mango Publishing Release New Book, Strikingly Different Selling: 6 Vital Skills to Stand Out and Sell More. In it, FranklinCovey Sales Performance Experts, co-authors Dale Merrill, Scott Savage, Jennifer Colosimo, and Randy Illig reveal the secrets for standing out from competitors for consistent, predictable sales success in their Amazon #1 New Release in Sales and Selling. The book was written for sales professionals just starting their career, those who are seasoned, and for sales executives and managers who lead teams and are responsible for sales success. (Photo: Business Wire)\" src=\"https://mms.businesswire.com/media/20220113005291/en/1327125/4/BNA2192900_StrDifSelling_Book_MockUp_v1.0.0_rgb_72dpi.jpg\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbXMuYnVzaW5lc3N3aXJlLmNvbS9tZWRpYS8yMDIyMDExMzAwNTI5MS9lbi8xMzI3MTI1LzQvQk5BMjE5MjkwMF9TdHJEaWZTZWxsaW5nX0Jvb2tfTW9ja1VwX3YxLjAuMF9yZ2JfNzJkcGkuanBn&amp;key=7462aaaf42662e24d9866c42a95ca2e98117702df7546e66bda72d65d851c34a6332621d3b37d3e185b19318815c9aeb5c18a7cbd6cb667e9c64015a5624183f\"/></div></div><p style=\"font-size:85%\">FranklinCovey and Mango Publishing Release New Book, Strikingly Different Selling: 6 Vital Skills to Stand Out and Sell More. In it, FranklinCovey Sales Performance Experts, co-authors Dale Merrill, Scott Savage, Jennifer Colosimo, and Randy Illig reveal the secrets for standing out from competitors for consistent, predictable sales success in their Amazon #1 New Release in Sales and Selling. The book was written for sales professionals just starting their career, those who are seasoned, and for sales executives and managers who lead teams and are responsible for sales success. (Photo: Business Wire)</p></div><p>\nDale Merrill, FranklinCovey Global Managing Director, Sales Performance, said, “What is it that works for salespeople to stand out from their competitors and sell more? Every day, they’re competing with top salespeople in their industry for the same customers. And, for each sales opportunity there’s only one winner. This book highlights how to go from being just one of the crowd to the superior choice.”\n</p><p>\nThe author team spent six years of intensely focused research which included live sales simulations with more than 2,800 sales professionals from global companies in 135 countries. They discovered that most sales professionals and consultants believed they were doing a great job in their client interactions. Yet, 70 percent of the time, client executives felt those meetings were a waste of time.\n</p><p>\nOverwhelming evidence shows that the inability of salespeople to stand out is a pervasive issue with costly consequences. In working with sales research firm, Primary Intelligence, the author team also analyzed the results of surveys/interviews with more than 5,000 B2B decision makers on deals. They found that average win rates were a dismal 17 percent for deals above $100,000 across multiple industries globally (win/loss analysis). And, in a second set of surveys/interviews, which included more than 14,500 B2B decision makers, buyers saw no difference between vendors 42 percent of the time (differentiation analysis).\n</p><p>\nAnd the sales environment has only intensified. COVID-19 massively accelerated the tectonic shift from live to virtual (i.e., live-online) selling, which is here to stay. A recent Bain survey that found that 80 percent of buyers and sellers believe there will be a sustained increase in virtual interactions.\n</p><p>\nScott Savage, FranklinCovey Managing Director, said, “In the new, hybrid live-online and in-person world, the classic techniques of selling are much less effective, sales pipelines are languishing, and buyer-seller interactions look and feel very different. Buyers can’t tell the differences between one salesperson’s offerings and another’s because everyone looks and sounds the same and competition is intense. Many salespeople aren’t getting first meetings or they’re conducting plenty of additional meetings that go nowhere, and they aren’t winning enough business.”\n</p><p>\nAs sales thought leaders and practitioners, the authors and their colleagues at the FranklinCovey Sales Performance Practice advise salespeople representing many of the top technology, consulting, and professional services organizations across the globe. They’ve defined the three most frustrating struggles most salespeople have in common, as it relates to standing out.\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\nHow can I come up with differentiated messages for my clients?\n</li>\n<li>\nHow do I pull the messages together into a cohesive set of stories?\n</li>\n<li>\nHow will I share these stories with clients in a compelling way?\n</li>\n</ul><p>\nJennifer Colosimo, FranklinCovey President, Enterprise Division, said, “We’ve helped thousands of salespeople overcome these struggles and gain confidence in their ability to craft, shape, and deliver compelling messages that enable them to stand out from the start to the finish of their sales cycles. We’ve spent hundreds of hours with client executives discussing, debating, testing and learning together how salespeople could become ‘Strikingly Different.’ We discovered a simple formula for achieving compelling contrast that thousands of highly successful sales professionals are practicing in client interactions to close business.”\n</p><p>\n<b><span><span class=\"bwuline\">The Strikingly Different Selling Formula</span></span></b>\n</p><ol class=\"bwlistdecimal\">\n<li>\nRelevant: Focus on what matters most to the client.\n</li>\n<li>\nDistinct: Show something different and better than the competition or status quo.\n</li>\n<li>\nMemorable: Make sales messaging “sticky”: easy to share and hard to forget.\n</li>\n</ol><p>\nThe authors bring this formula to life through six vital skills top sales performers use to stand out from competitors to win the sale much more often, whether in a live environment or in online sales interactions on video conference platforms.\n</p><p>\n<b><span><span class=\"bwuline\">The 6 Vital Skills Top Sales Performers Use to Stand Out and Sell More</span></span></b>\n</p><p>\n<b><span class=\"bwuline\">Skill 1: Capture Attention with a Verbal Billboard</span></b> – Use a verbal billboard. It’s the core message for the client. Think and speak in headlines, link to the client’s goals and issues, and show ‘From-To’ client outcomes. Ensure your billboard tells an easy-to-follow story that is compelling, easy to share and hard to forget.\n</p><p>\n<b><span class=\"bwuline\">Skill 2: Create Excitement with Movie Trailers</span></b> – Use movie trailers (brief verbal/written communication) to excite the client or prospect to want to meet with you; intrigue them at the start of the meeting or proposal, so they actively engage in a peer-to-peer dialogue with you; and end the meeting with increasing momentum, earning you an invitation for another meeting.\n</p><p>\n<b><span class=\"bwuline\">Skill 3: Build Confidence with Flashbacks and Flashforwards</span></b> – Use flashbacks (success stories) on how you’ve helped other clients by vividly and succinctly sharing how a similar client’s outcomes were different and better than what they were previously doing, thanks to your experience in partnering on a solution. Use flashforwards to paint an exciting vision of future events and critical milestones to get to a successful outcome.\n</p><p>\n<b><span class=\"bwuline\">Skill 4: Become Essential with “Why Us!” Differentiators</span> </b>–<b> </b>Use differentiators to highlight unique differences to help the client see why those differences matter. Include a point of comparison for each difference; briefly describe a unique aspect of what you do that will make a real difference to the client; and explain why each difference will help the client achieve different and better outcomes.\n</p><p>\n<b><span class=\"bwuline\">Skill 5: Get Curious and Find the Gaps</span> </b>– Discover gaps in the sales process by structuring a conversation to deepen your understanding. Conduct a critical discovery dialogue that identifies the client’s real needs, issues, and motivators. Find messaging gaps by shifting conversations from you talking about your solution to mutual exploration of business problems or results the client is trying to solve or achieve.\n</p><p>\n<b><span class=\"bwuline\">Skill 6: Navigate Traffic Lights and Close the Gaps</span></b> – Navigate through client questions, pushbacks, challenges, objections and concerns and resolve them with empathy. Engage in real human-to-human dialogue to close gaps and complete the sales process.\n</p><p>\nThese skills will help any sales professional overcome the challenges of standing out in any environment, including the live-online world and in-person interactions. The author team knows how difficult it is to stand out in both worlds.\n</p><p>\nRandy Illig, FranklinCovey Global Sales Performance Practice Leader, said, “We’ve all tried, failed, and succeeded in both settings. We’ve hit and missed sales targets, mastered the online sales environment, and led teams in the pursuit of greatness. This book will change everything you know about sales, how you think, and what you say and do, resulting in shorter sales cycles, better opportunities, stronger client relationships, and bigger sales results.”\n</p><p>\n<b><span><span class=\"bwuline\">Implementing Strikingly Different Selling in An Organization</span></span></b>\n</p><p>\nFranklinCovey’s <span>Strikingly Different Selling </span>system (SDS) is complimentary to and integrates easily with all sales methodologies and approaches. SDS helps people engage with clients differently and better to achieve breakthrough outcomes. The SDS system has two interdependent parts: a capabilities engine that instills Strikingly Different mindsets and skills into the DNA of client organizations through focused training and a unique 50-minute weekly process (The Weekly 50) that combines deliberate practice of key skills with feedback and coaching. And a results engine powered by the mobile 4DXOS® app (4 Disciplines of Execution® Operating System), that drives consistent, predictable, measurable results quarter after quarter, year after year. Learn how FranklinCovey’s Strikingly Different Selling system can support a team and organization at 1-888-868-1776.\n</p><div class=\"story-table-container\"><table cellspacing=\"0\" class=\"bwtablemarginb bwblockalignl\">\n<tr>\n<td class=\"bwvertalignt bwpadl0\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin\">\n<b>TITLE:</b>\n</p>\n</td>\n<td colspan=\"1\" rowspan=\"1\">\n</td><td class=\"bwvertalignt bwpadl0\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin\">\n<b>STRIKINGLY DIFFERENT SELLING: 6 Vital Skills to Stand Out and Sell More</b>\n</p>\n</td>\n</tr>\n<tr>\n<td class=\"bwvertalignt bwpadl0\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin\">\n<b>AUTHORS:</b>\n</p>\n</td>\n<td colspan=\"1\" rowspan=\"1\">\n</td><td class=\"bwvertalignt bwpadl0\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin\">\n<b>Dale Merrill, Scott Savage, Jennifer Colosimo and Randy Illig</b>\n</p>\n</td>\n</tr>\n<tr>\n<td class=\"bwvertalignt bwpadl0\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin\">\n<b>IMPRINT:</b>\n</p>\n</td>\n<td colspan=\"1\" rowspan=\"1\">\n</td><td class=\"bwvertalignt bwpadl0\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin\">\nMango Publishing\n</p>\n</td>\n</tr>\n<tr>\n<td class=\"bwvertalignt bwpadl0 bwnowrap\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin\">\n<b>PUB DATE:</b>\n</p>\n</td>\n<td colspan=\"1\" rowspan=\"1\">\n</td><td class=\"bwvertalignt bwpadl0\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin\">\nJanuary 18, 2022\n</p>\n</td>\n</tr>\n<tr>\n<td class=\"bwvertalignt bwpadl0\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin\">\n<b>ISBN:</b>\n</p>\n</td>\n<td colspan=\"1\" rowspan=\"1\">\n</td><td class=\"bwvertalignt bwpadl0 bwnowrap\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin\">\n(print/paperback) 978-1-64250-486-6 (eBook) 978-1-64250-487-3 • $19.95 • 206 pages • SIZE 5.47 x 8.39\n</p>\n</td>\n</tr>\n</table></div><p>\n<b><span class=\"bwuline\">About FranklinCovey</span></b>\n</p><p>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.franklincovey.com%2F&amp;esheet=52562286&amp;newsitemid=20220113005291&amp;lan=en-US&amp;anchor=FranklinCovey&amp;index=9&amp;md5=c7f2011635141cf6b74b34e40b02a697\" data-type=\"url\" class=\"tr-link\" translate=\"no\">FranklinCovey</a> is one of the largest leadership companies in the world with operations in over 160 countries. We transform organizations by partnering with our clients to build leaders, teams and cultures that get breakthrough results through collective action, which leads to a more engaging work experience for their people. Available through <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.franklincovey.com%2Fengage-with-us%2Fall-access-pass%2F&amp;esheet=52562286&amp;newsitemid=20220113005291&amp;lan=en-US&amp;anchor=FranklinCovey+All+Access+Pass&amp;index=10&amp;md5=c1334b719fdd2fd3c15ccf8fb80e3ee0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">FranklinCovey All Access Pass</a>®, our best-in-class content and solutions, experts, and technology and metrics seamlessly integrate together to ensure lasting behavior change at scale. This approach to leadership and organizational change has been tested and refined by working with tens of thousands of teams and organizations in the past 30 years.\n</p><p>\nTo learn more, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.FranklinCovey.com&amp;esheet=52562286&amp;newsitemid=20220113005291&amp;lan=en-US&amp;anchor=www.FranklinCovey.com&amp;index=11&amp;md5=339afa22b37cb0be72e5b46705182064\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.FranklinCovey.com</a> and enjoy exclusive content across FranklinCovey’s social media channels: <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Ffranklincovey%2F&amp;esheet=52562286&amp;newsitemid=20220113005291&amp;lan=en-US&amp;anchor=LinkedIn&amp;index=12&amp;md5=7c2319bafc2fdb104a7eabde8135e2f4\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LinkedIn</a>, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.facebook.com%2FFranklinCovey%2F&amp;esheet=52562286&amp;newsitemid=20220113005291&amp;lan=en-US&amp;anchor=Facebook&amp;index=13&amp;md5=62a458134e42d31e5f2fb48d05196cdd\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Facebook</a>, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Ftwitter.com%2Ffranklincovey&amp;esheet=52562286&amp;newsitemid=20220113005291&amp;lan=en-US&amp;anchor=Twitter&amp;index=14&amp;md5=c7dac5ca2b59ce5385a3bbe29872be14\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Twitter</a>, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.instagram.com%2Ffranklincovey%2F&amp;esheet=52562286&amp;newsitemid=20220113005291&amp;lan=en-US&amp;anchor=Instagram&amp;index=15&amp;md5=5aa46c1c4b70a9b0510906dd7edd5910\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Instagram</a>, and <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.youtube.com%2Fuser%2FFranklinCoveyVideos&amp;esheet=52562286&amp;newsitemid=20220113005291&amp;lan=en-US&amp;anchor=YouTube&amp;index=16&amp;md5=8c58f4e627fa3f2a9bdab35c564426d2\" data-type=\"url\" class=\"tr-link\" translate=\"no\">YouTube</a>.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20220113005291r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjIwMTEzMDA1MjkxcjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=1548c4de8fd4a8092840713195cd10ff6d9039575537c18cf80c3877512c88c4f8c1570ec1234201cba4d4719e6483e1fa0b7be9723f1042c5d332a126272550\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20220113005291/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220113005291/en/</a></span></p><p>\nDebra Lund\n<br/>Email: <a href=\"mailto:Debra.Lund@FranklinCovey.com\" data-type=\"email\" translate=\"no\">Debra.Lund@FranklinCovey.com</a><br/>Cell: 801-244-4474\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2022</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: UT-FRANKLINCOVEY</p></div>"}