{"date": "2022-02-21 13:06:03.449000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_l9qhs1ev&amp;referenceId=1_l9qhs1ev&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_l9qhs1ev&amp;referenceId=1_l9qhs1ev&amp;pageId=RefinitivNewscasts</a></pre>Source: Stocktube<br/><br/>Description: Since the appointment of Anna Chokina as Chief Executive on 6 December 2021, Cellular Goods has conducted a comprehensive review of its strategy and go-to-market plans. &amp;#xD;&amp;#xD;With more than 20 years’ leadership experience in the global consumer goods sector, Chokina talks through the main points as the firm continues to have a significant market opportunity to establish a differentiated and premium British wellness brand focused on lab-based cannabinoids with scientifically proven efficacy, legally compliant provenance and environmentally sustainable ingredients.&amp;#xD;&amp;#xD;Cellular Goods’ skincare products will go on sale for the first time on Amazon Marketplace as part of a pilot programme that enables selected cannabinoid products to be purchased through the platform in the UK. The Company is also in talks with Amazon to expand the pilot to its Feel Better (ingestibles) range.<br/>Short Link: <a href=\"https://refini.tv/3H5s5yv\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3H5s5yv</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; Hello there. A very good morning. You're watching Proactive London and joining us just now is Anna Chokina from Cellular Goods because we're talking about your strategy and the trading update that you've just published as well as a product launch as well on Amazon marketplace and board change too, so plenty to go through. Good morning, so you were appointed CEO in early December last year. Can you maybe tell us more about the review of Cellular strategy that you've conducted in that time and what it means for the future of the company exactly and maybe how your experience has perhaps helped shape this strategy Anna. &gt;&gt; Thank you very much and hello. Indeed, two and a half months since I joined I've been using this time to review the strategy for Cellular Goods, building on my 20-some years of experience in FMCG companies but also in the beauty sector in particular. Pleased to say that based on this review I can confirm that there is a substantial space for Cellular Goods to be seen as the go-to brand in the premium wellness products based purely on lab-made noise and what sets us aside is still very much relevant now as it was when the company started and when the company went through the IPO a year ago. If we look at the marketplace right now, wellness is one of the areas that's very much trending coming out of the pandemic as consumers look at their well-being in a more holistic way, not just on beauty care specifically or healthcare specifically but the more holistic way of approaching both. I think Cellular is very well placed to become this authoritative wellness brand that can deliver verifications, premium products that are able to deliver just that for the consumers. &gt;&gt; Today's announcement, it signposted an exclusive focus on wellness products for Cellular. Is this may be a change in direction would you say for the brand? &gt;&gt; I would say it's an evolution of our strategy. The way that it's evolved is that we can now be very clear that we're not just a beauty brand. We're not just a consumer goods brand. Our space is wellness and wellness is on the crossroads of mental health, of health care but also the beauty camp because like I said, the trend right now is much more holistic with how consumers have used these two areas for themselves. As a result, I think by us focusing on wellness but on a sign substantiated wellness, that provides a very strong background for the company to grow upon and to realize substantial sales. &gt;&gt; Can you tell us more about the significance of the look better, feel better, and function better product verticals? &gt;&gt; Indeed. As part of the strategy review we have also took a look at how we bring the products to the markets. We concluded that we could be slightly more consumer centric than we perhaps have been and as a result, we strategize and we focused our team and our company and the product pipeline against three benefit spaces. When I say benefit spaces, that's a very important phrase to use. It signifies that consumers don't shop by product form. They don't just want to buy say serum or they don't want to buy a supplement but they want to buy a benefit the product brings by us focusing on the benefit spaces we're starting to speak the same language our customer speak and we're making sure that we have what it takes for the customers to buy our products. Those three benefit spaces are: feel better; these essentially they are products that are led by our supplement range that help with anxiety and sleep issues. Then we also have look better benefit space and product range and that's led by face stamp products helping you to look your best. And finally we're going to have the function better range. This is the range that is provided by the recovery products working on the health of muscles and joints, providing the freedom of movement. &gt;&gt; Where can consumers buy the products? Do you recognize the future of Cellular's go-to-market strategy here? &gt;&gt; Of course we launched in December in our own e-com platform. So that's Cellular-goods.com, and you can still buy our products in this platform. It remains our main channel of sales at this point. However, I'm very pleased to say that today we're also opening sales in the biggest online platform in the UK and that's Amazon. We're opening it for our look better range and we're also in discussions with Amazon to expand it to the full lineup that we have to offer. &gt;&gt; We know Cellular is an early adopter and a champion of CBG in skincare. So your inaugural skincare product range is the first in the UK to be formulated with the novel minor cannabinoid, CBG. Why do you think this will matter to consumers? And can you maybe tell us more about this USP of the upcoming serum and when customers, when they can get hold of it? &gt;&gt; In this case the customers don't necessarily want to buy a novel cannabinoid. But like I said, what they shop for is the consumer benefit. This is why it was very, very important for us when we published our research two weeks ago that suggested that this novel cannabigerol, CBG which we're going to be the first in the UK to bring to the market is now proven to have the same if not better anti-aging properties that's very well-known ingredients such as retinol or vitamin C. What I can tell you just speaking from my personal experience, I have a sensitive skin and I've been long beauty junkie. There's hardly a product I haven't tried on my face. Unfortunately I wasn't able to take full benefits to enjoy full benefits of retinol or vitamin C myself just because every time I used a product with them I will get a rash and then I would look too red to feel comfortable to go out. As a result, I stopped using those products, I was using less active ingredients on my skin. But now with the cannabinoidirol products and with the serum that we're about to launch in a couple of days, I think that's going to be a matter of the past. And for me certainly I'm very excited about this product because I can now get the same benefits if not better than vitamin C but without any redness or skin irritation. Its hugely exciting for people like me I'm sure there are other people with sensitive skin out there. But even if you don't have sensitive skin and I think we are not asking people to switch, to drop everything and just use our serum but I think what we're saying is that if you're like me, we're not able to get access to the full benefits of the very well-known anti-aging ingredients, I think with this particular product and with Cannabinoidioral there is now a way for you to start using it in addition to retinol because it will stop the inflammation of your skin, it will stop the irritation and you can enjoy basically the best of both worlds ; cannabinoids and retinol. So that's why it's hugely exciting. So I think from the consumer standpoint , it's very new, we're the only ones with it and it opens up market for customers who were not able to get this benefits before. &gt;&gt; How Cellular Goods target market here about the launch of the serum? What marketing activity will surround this product and the rest of the range would you say? &gt;&gt; Indeed. I think the latest stats say that there is 1.3 million people already in the UK who have tried and are using CBD based products, so cannabinoid base products. It's not small. Having said that, that's still a drop in the sea. There are so many more who don't know what cannabinoids are, what the benefits of them are, and so on and so forth. The first job for us and the way we see our job is to make sure that consumers are aware. As a result, we're starting a very big campaign for a small brand like ours. I'm pleased to say that come March, April, there will be hardly a person in London who doesn't see our advertising outdoor. There will be also strong digital push. Of course it's worth mentioning that we've been quite disappointed back in December when we started our digital activity and we discovered that Amazon and Google, sorry, not Amazon, Google and Meta, so that's Facebook and Instagram had such policies that prohibited our brands from being advertised on their platforms. Of course as being a fully compliant brand that doesn't have any illegal substances such as THC we were very surprised that we were treated basically as a recreational drug. But now that we have understood that and we continue to lobby by the way with Google and with Meta to change their policy, we had to change our campaign to include the other mediums such as outdoor, such as other digital activities, And we also have some very strong partnerships with the publishing houses and influences that are going to go live in March, April. So stay tuned, I hope next time we'll speak you would have seen some of this activity and I'm hoping you also would have bought already our amazing serum or some other products to enjoy the benefits I just talked about. &gt;&gt; Well, thank you very much indeed. From a Cellular Goods here on Proactive London today, its Anna Chokina. Thank you for your time.<br/></span></div></div></div></div>"}