{"date": "2021-12-17 15:42:02.809000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3466.3, "close": 3400.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>KALTURA INC (\"KLTR-Q\")\n- Watch Brazil Expands Reach with Kaltura Powering Its Next-Gen\n- Streaming TV Service, Hosted on AWS\n\n     Highlights:\n\n     *  After launching its next-generation streaming TV service, Watch,\npowered by Kaltura and hosted on AWS, Watch Brazil has grown its user base\nby over 25% in the six months since launch\n     *  Watch benefits from flexible, scalable, and resilient Kaltura\ntechnology to deliver top entertainment to users via web, iOS, and Android\nmobile devices and connected TVs\n\n     Kaltura, the video experience cloud, announces that internet services\nand technology provider Watch Brazil launched its next-generation streaming\nTV service, Watch, powered by Kaltura hosted on Amazon Web Services (AWS).\nDemonstrating the appeal of the new service, in its first six months of\noperation, Watch's user base has grown by over 25%.\n\n     Watch went live in Spring 2021 with 90 linear channels delivered by\nKaltura on AWS transmitting the service's wide array of engaging content.\nWatch offers premium international and national sports, general\nentertainment, TV series, comedy, drama, and news for subscribers to enjoy\non the web, Android, and iOS mobile devices and connected TVs.\n\n     Watch Brazil is among the first internet providers in the country to\ntake advantage of a new licensing regime, established in 2020, which opened\nup the digital entertainment market to internet service providers.\n\n     \"We are extremely excited that Kaltura is our technology partner as we\nembark onto the dynamic Brazilian entertainment marketplace,\" commented\nMauricio Almeida, Founding Partner at Watch Brazil. \"We are confident that\nwith Kaltura's high-quality video channels, flexibility, and scalability,\nwe're delivering a world-class streaming TV service which will continue to\ngrow in popularity.\"\n\n     \"We are very proud that our technology is helping Watch Brazil to\ndeliver this exciting new TV offering,\" said Anil Hinduja, Global Head of\nEdge Compute, Content Delivery Network, Elemental Media &amp; Security at AWS.\n\"It's exciting to see how Watch Brazil can now benefit from the speed,\nagility and reliability of operating streaming services from the Cloud.\"\n\n     \"We heartily congratulate Watch Brazil for its enterprising spirit,\nembodied in the launch of Watch,\" said Nuno Sanches, General Manager, Media\nand Telecom at Kaltura. \"We're delighted to join them on their video\nentertainment journey, and the team at Watch Brazil can be assured that\nwe'll be there to support, with our technology, experience, and expertise,\nall along the way as they continue to grow.\"\n\n     About Watch Brazil\nEstablished in October 2018, with headquarters in Curitiba, Brazil, Watch\nBrazil is a video-on-demand platform that gives internet service providers\nthe opportunity to deliver video services. Watch offers top TV series and\nfilms including Hollywood movies. The next-generation Watch platform is a\ncontent aggregating marketplace, and offers a range of applications\nincluding HBO Max and UOL Leia+ Banca. The start-up offers 8,000 hours of\ncontent from Paramount+, MTV, Comedy Central, Noggin, Universal and Warner,\namong others. <a href=\"https://watchbr.com.br\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://watchbr.com.br</a>/\n\n     About Kaltura\nKaltura's mission is to power any video experience for any organization.\nOur Video Experience Cloud offers live, real-time, and on-demand video\nproducts for enterprises of all industries, as well as specialized industry\nsolutions, currently for educational institutions and for media and telecom\ncompanies. Underlying our products and solutions is a broad set of Media\nServices that are also used by other cloud platforms and companies to power\nvideo experiences and workflows for their own products. Kaltura's Video\nExperience Cloud is used by leading brands reaching millions of users, at\nhome, at school and at work, for communication, collaboration, training,\nmarketing, sales, customer care, teaching, learning, and entertainment\nexperiences. www.kaltura.com.\n\nCynthia Ritchie\n+44 20 3514 2525\ncynthia@whitetigercommunications.net\n\nTel   : 646-290-5445    KALTURA INC\nWWW   : <a href=\"https://www.kaltura.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.kaltura.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2135000242.MNPRE2135001087-07255520211217</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}