{"date": "2021-02-11 12:27:27+00:00", "ticker": "AVV", "mrkt_info": {"open": 3750.0, "close": 3819.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds CEO, CFO, analyst comments, share move, detail</p><p class=\"tr-by\">By Juliette Portala and Sarah Morland</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Feb 11 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Encouraging trends in data centres and connected living should help Schneider Electric <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SCHN.PA\" data-type=\"ric\" data-ric=\"SCHN.PA\" translate=\"no\" dir=\"ltr\">SCHN.PA</a> to boost its core profit margin and sales this year, the French company said on Thursday.</p><p>Shares in the Paris-based conglomerate, which sells products ranging from electrical car chargers to industrial robotics, <span class=\"tr-strong\">rose around 2.3% on the back of its upbeat guidance and strong fourth-quarter.</span></p><p><span class=\"tr-strong\">Societe Generale analyst Alasdair Leslie said it was probably the 2021 outlook which had impressed the most, pointing to management's confidence driven by new opportunities in digitalisation and delayed projects coming back this year.</span></p><p>Schneider said it planned to focus on integrating and squeezing synergies from recent acquisitions, notably from SoftBank-backed <a href=\"reuters://REALTIME/Verb=FullQuote/ric=9984.T\" data-type=\"ric\" data-ric=\"9984.T\" translate=\"no\" dir=\"ltr\">9984.T</a> OSIsoft, which Schneider's UK subsidiary Aveva <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AVV.L\" data-type=\"ric\" data-ric=\"AVV.L\" translate=\"no\" dir=\"ltr\">AVV.L</a> aims to close in the first quarter.<span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2FR1Q2\" data-type=\"storyId\" data-story-id=\"nL4N2FR1Q2\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p><span class=\"tr-strong\">Schneider </span>plans to restart a 1.5-2 billion euros ($1.82-2.43 billion) asset disposal plan - which it put on hold in 2020 - in the first half of the year.</p><p><span class=\"tr-strong\">\"What we look for is businesses that are less core to our strategy and, on a whole, tend to be dilutive,\" finance chief Hilary Maxson told Reuters, flagging more news in coming quarters.</span></p><p><span class=\"tr-strong\">CEO Jean-Pascal Tricoire told analysts Schneider was continuing to adjust its portfolio, with more investments in software amid strong trends in smart homes and data centres.</span></p><p><span class=\"tr-strong\">Greater connectivity has driven demand for data centre usage, which accounted for around 1% of the world's electricity use in 2019, the International Energy Agency said in a report last June.</span></p><p>Both Schneider's full year revenues and core profit beat market expectations, while its 16.1%-16.2% core profit margin guidance edged closer to the around 17% targeted by 2022.</p><p>The group expects its 2021 adjusted core profit to rise 9% to 15% organically, on the back of revenues up 5% to 8%.</p><p>Schneider proposed a dividend of 2.60 euros per share for 2020.</p><p><br/></p><p>($1 = 0.8246 euros)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Juliette Portala and Sarah Morland in Gdansk ; Editing by Amy Caren Daniel, Jason Neely and Jane Merriman)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:sarah.morland@thomsonreuters.com\" data-type=\"email\" translate=\"no\">sarah.morland@thomsonreuters.com</a> ; <a href=\"mailto:juliette.portala@thomsonreuters.com\" data-type=\"email\" translate=\"no\">juliette.portala@thomsonreuters.com</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SCHNEIDER ELECTRIC-RESULTS/ (UPDATE 2)</p></div>"}