{"date": "2021-12-20 17:11:22.158000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"fr\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">Le passage à niveau Ogilvy officiellement ouvert</p>\n<p>MONTRÉAL, le 23 déc. 2021</p>\n<p>MONTRÉAL, le 23 déc. 2021 /CNW Telbec/ - La Ville de Montréal, exo et CP ont franchi les dernières étapes qui mènent à l'ouverture officielle du passage à niveau permanent entre les rues Ogilvy et De Castelnau. Les travaux d'aménagement sont désormais complétés et une entente avec la compagnie de chemin de fer du Canadien Pacifique (CP) a été conclue afin d'appliquer le retrait du sifflet de train à l'approche de la gare Parc.</p>\n<p>\n\n</p>\n<p>Afin de permettre l'ouverture du passage à niveau sans nuisance sonore pour le voisinage, la Ville devait s'assurer que les trains ne sifflent pas à l'approche du passage à niveau. Pour y arriver, la Ville de Montréal a suivi la procédure établie par Transports Canada, en plus de conclure une entente additionnelle avec le CP en ce qui concerne la mise en application de cette mesure.</p>\n<p>« Nous sommes heureux que tout soit finalement en place pour l'ouverture officielle du passage à niveau. Ce lien permettra non seulement de désenclaver le secteur, mais il s'avère aussi d'une grande importance pour accéder aux commerces et aux services locaux. Cette solution sécuritaire et universellement accessible était fort attendue par la population du secteur et je suis certaine qu'elle sera bénéfique pour toutes et tous », a déclaré la mairesse de l'arrondissement de Villeray-Saint-Michel-Parc-Extension, <span>Laurence Lavigne Lalonde</span> .</p>\n<p>« Exo est heureux d'avoir collaboré avec la Ville de Montréal et le Canadien Pacifique pour la réalisation de ce projet. L'ouverture du passage à niveau Ogilvy est une excellente nouvelle pour nos usagers du train de banlieue et les citoyens du secteur, qui pourront traverser les voies ferrées en toute sécurité », a souligné <span>Marc Rousseau</span> , directeur exécutif - Exploitation d'exo.</p>\n<p>SOURCE Ville de Montréal - Cabinet de la mairesse et du comité exécutif</p>\n<p>Consulter le contenu original pour télécharger le multimédia : <a href=\"http://www.newswire.ca/fr/releases/archive/December2021/23/c8686.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/fr/releases/archive/December2021/23/c8686.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 CNW Group Ltd.</p></div>"}