{"date": "2021-09-07 05:41:56+00:00", "ticker": "AVV", "mrkt_info": {"open": 4220.0, "close": 4146.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Dubai, UAE</strong> – AVEVA, a global leader in industrial software, driving digital transformation and sustainability, has announced the launch of AVEVA™ Unified Learning as part of AVEVA’s portfolio  available on AVEVA Connect, common cloud platform. The new cloud-based employee development solution helps AVEVA customers advance industrial workers from novice to expert by using blended custom and generic experiential training modules, including AVEVA’s Process Competency Training, Pipeline Competency Training, and The Operations Excellence Group’s OEG Knowledge Library*.</p>\n<p>Harpreet Gulati, Senior Vice President, Planning, Simulation and Optimization Business, AVEVA commented, “Effective training programs are essential to help prevent industrial accidents and ensure safety, especially when the workforce is inexperienced or unaccustomed to new plant technologies. As the name suggests, AVEVA Unified Learning combines a set of development elements within one cloud-based platform so training managers can customize learning development to each member of their workforce wherever they are. Experiential learning can now be delivered in safe, simulation-based environments while workforce competence and operational excellence can be tracked at the same time.”</p>\n<p>AVEVA Unified Learning drives competency and consistency through experiential learning on a single platform, serving as a unique offering at a time when companies are focused on improving skills to contend with radically altered business environments and an influx of new staff. Without AVEVA Unified Learning, training leaders face major challenges in managing learning programs across a diverse and dispersed workforce with varying skill levels. By eliminating deployment hurdles and simplifying program management, AVEVA empowers customers to improve the learning experience and extract greater value from their training investments.</p>\n<p>AVEVA Unified Learning closes the competency gap between a retiring workforce and the new generation of connected workers. Overall, employees are empowered to perform better in a shorter time, thanks to targeted eLearning, video content, and simulation-based learning programs.</p>\n<p>Since AVEVA Unified Learning simulators are entirely cloud-based and offered as Software-as-a-Service, organizations benefit from global accessibility and scalability. With training delivered directly to each worker’s device, cost, time and energy outlays are reduced alongside the organization’s carbon footprint.</p>\n<p>AVEVA Unified Learning provides access to AVEVA’s vast portfolio of training and simulation applications in a single hub on AVEVA Connect. It is licensed via AVEVA FLEX, a flexible subscription program designed to simplify license purchase, usage and management. The product leverages AVEVA’s digital twin technology for ongoing operational excellence including operator training simulators and 3D virtual reality environments, delivering these on the Cloud.</p>\n<p>The launch of AVEVA Unified Learning responds to a growing demand for learning solutions aimed at a digitally native workforce. By 2030, the bulk of the workforce will be made up of Generations Y and Z, most of whom are only familiar with a digital-first, mobile-first world. For these digital natives, workplace technology is now a factor in the choice of job. Over 90% of Generation Z – people born after 1996 – say technology offered by an employer influences their job choice.</p>\n<p>For more, please visit the AVEVA Unified Learning page.</p>\n<p>* The Operations Excellence Group is an AVEVA partner that creates learning content for process operator training and is the developer of the Knowledge Library, a component of AVEVA Unified Learning.</p>\n<p><strong>About AVEVA</strong></p>\n<p>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence.  AVEVA’s comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries. Learn more at www.aveva.com.</p>\n<p>Copyright © 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}