{"date": "2021-11-16 19:36:19.118000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Use of facial-recognition software in UK police trials has boosted the profile of one of its suppliers, the NEC Corporation, but substantial threats to the technology's long-term sales growth remain.</p><p>Police forces are lucrative customers of facial-recognition technologyThe software used by the UK police is called NeoFace and is owned by NEC Corporation. The technology matches live camera footage against a database of photographs of the British population.There are privacy worries regarding where the technology itself hails from. NEC Corporation is based in Japan and it is unknown whether the company itself has access to the images that are being captured and stored by the UK police.Images can be stored of anyone, whether they have committed a crime or not. The database of photos used by the police is thought to be made up of over 10 million images.Despite the police force being keen on the technology, there are threats to its use which may undermine the investments high-tech firms have made in facial-recognition technology.Large corporations have been using the technology for many yearsOne of the largest technology companies in the world, Amazon, has called on the US federal government to design laws governing the proper use of the technology, to be made effective immediately.In 2018, Amazon employees in the US were outraged when the company sold its facial-recognition technology, Rekognition, to law enforcement agencies. Disgruntled employees also expressed concerns about the company's relationship with the data mining service Palantir, used by Amazon's cloud computing service.It seems technology companies have become less keen to supply facial-recognition software outside the business.Microsoft President Brad Smith has said the company has turned down contracts where governments have wanted to license their technology.The reason Smith gave for this was that the company was \"not comfortable\" with how the technology would be used and was worried about its implications for human rights.Human rights groups pose a threat to tech firms working in facial recognitionA danger for companies, such as the NEC, is that use of the technology by the police is being challenged by activist groups in the courts or via pressure exerted on politicians.In recent times, Liberty, a human rights group, has filed a case against South Wales Police, while Big Brother Watch, another civil liberties group, has filed a similar case against the Metropolitan Police.These challenges are the first of their kind in the UK and give the legal system an opportunity to decide on whether the application of the technology is lawful or not.If they succeed then the sale of facial recognition technology to police forces across the UK would likely be stopped.In the US, legal action against facial recognition technology has already been successful, raising doubts as to how long companies specialising in this field will continue to sell products to police departments across the country. Earlier this year, San Francisco became the first city in the US to ban its government from using facial-recognition technology.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}