{"date": "2022-02-04 11:08:37+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3012.25, "close": 3152.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n        We invests billions of dollars to support Amazon teams and serve our customers, which also helps grow the economy and create jobs in many different sectors.\n      </div>\n                <div>\n                  <p>\n          Amazon launched in a garage in 1994. We've grown a lot since then. We now serve hundreds of millions of customers around the world, including consumers, inventors, creators, and small businesses that use Amazon tools and services to grow their own businesses. We've also become the second-largest private employer in the U.S., with more than 1 million employees across more than 45 states, and created more jobs than any other U.S. company over the last decade.\n        </p>\n                  <p>\n          We know that this success and scale comes with broad responsibility, and we're constantly investing in ways to better serve our customers, partners, and employees. For example, we were one of the first companies to raise our starting wage to $15 an hour (more than double the federal minimum wage) several years ago, and our regular full-time employees now receive an average starting wage of more than $18 an hour. These employees also receive comprehensive benefits such as health care, a 401(k) plan with company match, and up to 20 weeks of paid parental leave.\n        </p>\n                  <p>\n          The billions of dollars we invest in supporting our teams and in serving our customers also helps grow the economy and create jobs in many different sectors. We're proud to now support more than <span><a href=\"https://www.aboutamazon.com/investing-in-the-u-s\" data-type=\"url\" class=\"tr-link\" translate=\"no\">1.6 million indirect jobs</a></span>in construction, professional services, health care, and other industries that help communities nationwide thrive.\n        </p>\n                  <p>\n          Our investments have contributed to economic growth, helping to <span><a href=\"https://www.aboutamazon.com/investing-in-the-u-s\" data-type=\"url\" class=\"tr-link\" translate=\"no\">grow the U.S. economy by nearly half a trillion dollars</a></span>since 2010. And in 2020, the Progressive Policy Institute <span><a href=\"https://www.aboutamazon.com/news/job-creation-and-investment/amazon-ranked-no-1-investor-in-america\" data-type=\"url\" class=\"tr-link\" translate=\"no\">ranked Amazon as the No. 1 U.S. company investing in America</a></span>. We spent even more in 2021 and expect to continue to expand.\n        </p>\n                  <p>\n          Our role as a corporate citizen has allowed us to contribute to public projects like improving local infrastructure or funding social services. We do this through the taxes we pay and the taxes we collect and remit on behalf of our customers, employees, and third-party sellers.\n        </p>\n                  <h4>\n          Amazon's 2021 tax contributions include:\n        </h4>\n                  <ul class=\"bulleted-list arrowlist\">\n                    <li>\n            $2.3 billion in federal income tax expense.\n          </li>\n                    <li>\n            $5.2 billion in federal taxes that include employer payroll taxes, customs duties, and other taxes and fees.\n          </li>\n                    <li>\n            More than $4 billion in state and local taxes of all types.\n          </li>\n                    <li>\n            $22 billion in sales taxes we collected and remitted on behalf of states and localities throughout the U.S.\n          </li>\n                  </ul>\n                  <p>\n          Additionally, in 2021, we made the decision to consolidate intellectual property (IP) rights, and we now hold our IP domestically. Policymakers continue to reiterate their strong, bipartisan desire for companies to develop and retain their IP in the U.S., and we're doing just that as we continue to support a multilateral global tax framework.\n        </p>\n                  <p>\n          We're also expanding our investments in important U.S. technology like electric vehicles. In 2019, we announced that we would <span><a href=\"https://www.aboutamazon.com/news/transportation/amazons-custom-electric-delivery-vehicles-are-starting-to-hit-the-road\" data-type=\"url\" class=\"tr-link\" translate=\"no\">purchase 100,000 electric delivery vans from Rivian</a></span>to help us meet <span><a href=\"https://sustainability.aboutamazon.com/about/the-climate-pledge\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Climate Pledge</a></span>, our commitment to be carbon neutral by 2040. We became one of Rivian's largest investors, and that investment is paying off. The value of our investment dramatically increased in 2021 due to Rivian's initial public offering (IPO), and that increase in value is included as income in our financial statements. In addition, Rivian delivery vans started hitting the road in 2021-drivers love them, and we plan to have all 100,000 vehicles deployed by 2030 to help further reduce our carbon footprint.\n        </p>\n                  <p>\n          We're pleased to play a role in creating opportunity and driving prosperity across the U.S. And we're excited to continue to invest, invent, create jobs, and work to enhance communities nationwide in 2022.\n        </p>\n                </div>\n                <div>\n                  <div>\n          Related Tags\n        </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/company-news\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Company news</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/job-creation-and-investment\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Job creation and investment</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/sustainability\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Sustainability</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/small-business\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Small business</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/operations\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Operations</a>\n                    </span>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/policy-news-views/amazon-is-investing-in-american-jobs-workers-and-communities\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>04 February 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>04 February 2022 11:08:37 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}