{"date": "2022-01-13 14:11:40.348000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3307.24, "close": 3224.28}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">Treasury Board Secretariat on behalf of Ontario Ministry of Finance Awards Key Mission-Critical</p>\n<p>TAMPA, Fla., Jan. 13, 2022</p>\n<p>    Fairfax Software is pleased to announce that it has been recently awarded a contract by the Ontario Government!                        </p>\n<p>\n<span>TAMPA, Fla.</span> , <span>Jan. 13, 2022</span> /CNW/ -- Fairfax Software is pleased to announce that it has been recently awarded a contract by the Ontario Government to provide: comprehensive software solution for payment processing (electronic and paper-based), image processing of paper for non-remittance forms, and full-service data entry. This contract was awarded to Fairfax Software following rigorous competitive procurement undertaken by the Treasury Board Secretariat on behalf of Ministry of Finance (MOF). Fairfax Software will implement and integrate the latest version of its Quick Modules 5.0 software suite, which provides a single platform designed to process all of MOF's 5.9 million annual inbound mail and electronic transactions for payment processing and data capture.</p>\n<p>\n\n</p>\n<p>This comprehensive solution will support all 126 business programs across 16 client ministries and will include technical and operational training. Fairfax Software's extensive solution will also cover and support approximately 90 new and existing interface files with 15 separate systems. The contract calls for design and implementation over eighteen-month period, a phased rollout of twenty-four months, and a full operation period of three and half years but has the potential for a 15-year term.</p>\n<p>Fairfax Software's solution is unique by providing an efficient approach with a streamlined single platform of imaging, remittance processing, data capture, monitoring, and reporting for all payment types while balancing, reconciling, and depositing the daily fund receipts. Many technical features and business benefits associated with the implementation of the Quick Modules 5.0 system have solidified Fairfax Software as an industry leader.</p>\n<p>The Fairfax Software award-winning solution Quick Modules 5.0 was built from the ground up to process real-life payment data and electronic transactions, along with all its associated attachments, with or without remittance, all in one single workflow under one common Microsoft (NASDAQ: MSFT) SQL Server database. This paradigm, which was invented and commercialized by Fairfax Software, has become a staple in U.S.-based state and commercial payment front-end processing for the last decade or more. More U.S. state tax and revenue agencies have adopted this paradigm than not.</p>\n<p>\n<span>Steve Chahal</span> , President and Chief Executive Officer of Fairfax Software said: \"We are delighted to have earned this contract and honored to serve the Ontario Government. Our single platform solution will streamline the Ministry's workflow in the most efficient way possible and in an enterprise-wide capacity.\" <span>Michael Minter</span> , Vice President of Sales and Marketing stated: \"Our award-winning Quick Modules solution has met and exceeded the competitive scrutiny of the Ontario Government's procurement process. Once again, we have proven that our solution is the best on the market for processing incoming mission-critical data.\"</p>\n<p>Fairfax Software has been providing state-of-the-art data capture and remittance processing solutions to state government clients, and more specifically state revenue clients since 1994 and with this award extends its solution footprint abroad. Fairfax Software's solutions, based on the signature product Quick Modules, are now the de-facto engine powering the payment and data capture processes in thirty-three (33) different U.S. states and forty-three (43) state agencies. Fairfax Software is capitalizing on its success in <span>the United States'</span> marketplace and expanding its award-winning software into the Canadian market.</p>\n<p>Fairfax Software has recently announced that it is henceforth offering to host its mission-critical state government solutions in its secure and encrypted cloud on Amazon (NASDAQ: AMZN) Web Services (AWS) and Microsoft Azure with several state governments having adopted it.</p>\n<p>For more information visit our website at <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3411660-1&amp;h=1754372184&amp;u=http%3A%2F%2Fwww.fairfaxsoftware.com%2F&amp;a=www.fairfaxsoftware.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.fairfaxsoftware.com</a> ,</p>\n<p>For more information, please contact: <span>Michael Minter</span> Vice President, Sales, and Marketing Fairfax Software Office: 703-802-1220 x103 Mobile: 214-384-3174 Email: <a href=\"mailto:mminter@fairfaxsoftware.com\" data-type=\"email\" translate=\"no\">mminter@fairfaxsoftware.com</a>\n</p>\n<p>View original content to download multimedia: <a href=\"https://www.prnewswire.com/news-releases/treasury-board-secretariat-on-behalf-of-ontario-ministry-of-finance-awards-key-mission-critical-301460463.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/treasury-board-secretariat-on-behalf-of-ontario-ministry-of-finance-awards-key-mission-critical-301460463.html</a>\n</p>\n<p>SOURCE Fairfax Software</p>\n<p>View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/January2022/13/c5611.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/January2022/13/c5611.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}