{"date": "2021-12-11 10:34:14.274000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3483.42, "close": 3391.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">Three people died in severe weather in Tennessee, one person was killed when an apparent tornado ripped through an Arkansas nursing home, and emergency crews in southern Illinois are responding to reports of injuries at an Amazon warehouse after a roof collapsed</p><p class=\"tr-npp-section-title\">A new government report showing inflation rising at the fastest rate in nearly four decades is raising fresh questions about the fate of President Joe Biden's social and environment legislation</p><p class=\"tr-npp-section-title\">Health experts still don't know if the omicron variant is causing milder COVID-19, but more indicators are emerging from South Africa</p><p class=\"tr-npp-section-title\">Simply counting up the human cost of the horrifying truck crash that killed 55 migrants and injured over 100 is chilling, even for those who survived the disaster on a highway in southern Mexico</p><p class=\"tr-npp-section-title\">More U.S. states desperate to defend against COVID-19 are calling on the National Guard and other military personnel to assist</p><p class=\"tr-npp-section-title\">President Joe Biden will award the Medal of Honor next week to three U.S. soldiers who fought in the wars in Afghanistan and Iraq</p><p class=\"tr-npp-section-title\">Bob Dole has returned to Kansas for memorials in his hometown and at the Statehouse</p><p class=\"tr-npp-section-title\">A Cuban couple and their daughter have resettled in a small Serbian town after fleeing Cuba five years ago</p><p class=\"tr-npp-section-title\">Voters in the South Pacific archipelago of New Caledonia are set to decide Sunday whether to break away from France</p><p class=\"tr-npp-section-title\">Tens of thousands of Indian farmers are clearing protest sites along the capital's fringes and returning home, marking an end to year-long demonstrations against controversial farm laws</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 The Associated Press.  All rights reserved. This material may not be published, broadcast, rewritten or redistributed.</p></div>"}