{"date": "2021-12-12 18:02:13.396000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">Kentucky's governor is warning warned the state's death toll from an outbreak of tornadoes could top 100</p><p class=\"tr-npp-section-title\">Iran appears to be preparing for a space launch as negotiations continue in Vienna over its tattered nuclear deal with world powers</p><p class=\"tr-npp-section-title\">Veteran anchor Chris Wallace announced on his Sunday show that he's signing off from Fox News after 18 years, and not longer afterward CNN said Wallace was joining its new streaming service, which is expected to debut in early 2022</p><p class=\"tr-npp-section-title\">A coalition of California restaurants and grocery stores has filed a lawsuit to block implementation of a new farm animal welfare law</p><p class=\"tr-npp-section-title\">The British government has raised the country's official coronavirus threat level and warned the rapid spread of the omicron variant has pushed the U.K. into risky territory</p><p class=\"tr-npp-section-title\">South Dakota lawmakers are preparing to hear from a former state employee at the center of questions over whether Gov. Kristi Noem interfered in an agency that was evaluating her daughter's application for a real estate appraiser license</p><p class=\"tr-npp-section-title\">Gothic novelist Anne Rice has died due to complications from a stroke</p><p class=\"tr-npp-section-title\">Search efforts at an Amazon facility in Illinois where at least six people were killed in a tornado are expected to take several days</p><p class=\"tr-npp-section-title\">Unusually warm temperatures and a storm system moving east linked to the La Nina weather pattern helped create the conditions necessary for the monstrous tornadoes and severe weather that tore through parts of the the Midwest and South</p><p class=\"tr-npp-section-title\">Max Verstappen has won his first Formula One championship by passing Lewis Hamilton on the final lap of the Abu Dhabi Grand Prix</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 The Associated Press.  All rights reserved. This material may not be published, broadcast, rewritten or redistributed.</p></div>"}