{"date": "2021-12-01 08:01:27+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div class=\"story-table-container\"><table class=\"story-basic-table\">\n                  <tbody>\n                    <tr>\n                      <td>\n                        <div class=\"story-table-container\"><table class=\"story-basic-table\">\n                          <tbody>\n                            <tr>\n                              <td>\n                      Published: 2021-12-01 09:01:00 CET\n                    </td>\n                            </tr>\n                            <tr>\n                              <td>\n                                <div class=\"story-table-container\"><table class=\"story-basic-table\">\n                                  <tbody>\n                                    <tr>\n                                      <td>\n                                      </td>\n                                    </tr>\n                                    <tr>\n                                      <td>\n                                        <h4>\n                                Ørsted A/S<br/>\n                                 Investor News\n                              </h4>\n                                      </td>\n                                    </tr>\n                                    <tr>\n                                      <td>\n                                        <h4>\n                                Ørsted and Amazon expand cooperation with additional corporate power purchase agreements\n                              </h4>\n                                        <p>\n                                1.12.2021 09:01:00 CET | Ørsted A/S | Investor News\n                              </p>\n                                        <p>\n                                Amazon, the multinational technology, e-commerce, cloud computing, and digital streaming company based in Seattle, Washington, and Ørsted are today announcing two new corporate power purchase agreements totalling 116 MW of capacity across onshore and offshore wind.\n                              </p>\n                                        <p>\n                                Specifically, Amazon will offtake the output of 100 MW from Ørsted's 900 MW Borkum Riffgrund 3 Offshore Wind Farm in Germany. This CPPA is in addition to the 250 MW CPPA <a href=\"https://orsted.com/en/company-announcement-list/2020/12/2142884\" data-type=\"url\" class=\"tr-link\" translate=\"no\">signed in December 2020,</a> meaning that Amazon will offtake a total of 350 MW from Borkum Riffgrund 3, once the offshore wind farm enters commercial operation, expected in 2025.\n                              </p>\n                                        <p>\n                                Amazon and Ørsted have also agreed that Amazon will offtake the output of the 16 MW Ballykeel Onshore Wind Farm in Northern Ireland, which Ørsted expects to take final investment decision on later this year.\n                              </p>\n                                        <p>\n                                Amazon is a corporate leader in the fight against climate change and is the world's largest corporate purchaser of renewable energy. The company has set the ambitious target of reaching net-zero carbon emissions by 2040. The two CPPAs with Ørsted will contribute to this target and to Amazon's commitment to match their energy demand completely with renewable energy, while also helping Ørsted stabilise revenues from Borkum Riffgrund 3 and Ballykeel, contributing to the realisation of both projects.\n                              </p>\n                                        <p>\n                                Rasmus Errboe, Head of Region Continental Europe at Ørsted, said:\n                              </p>\n                                        <p>\n                                \"We're very pleased to once again partner with Amazon on securing additional renewable energy for the green transformation. The CPPAs on Borkum Riffgrund 3 and Ballykeel once again show Ørsted's position as a green energy major that can help large corporations deliver on their climate ambitions across geographies and technologies.\"\n                              </p>\n                                        <p>\n                                \"We're moving quickly on our path to power operations with 100 % renewable energy by 2025 - five years earlier than our original target. The new agreements with Ørsted are an important step on this journey.\" said Ralf Kleber, Country Manager of Amazon in Germany.\n                              </p>\n                                        <p>\n                                With this latest agreement with Amazon, Ørsted has over the past two years signed offshore wind CPPAs for an accumulated capacity of 1,764 MW across its global portfolio, which makes Ørsted the global leader in offshore wind CPPAs. Within its Onshore business, Ørsted has signed CPPAs for a total capacity of 1,350 MW since May 2020.\n                              </p>\n                                        <p>\n                                Across technologies, Ørsted and Amazon have signed three CPPAs. Besides the updated CPPA on Borkum Riffgrund 3 and the CPPA on Ballykeel, Amazon is also offtaking the full capacity of the 253 MW Amazon Onshore Wind Farm Texas in Scurry County, Texas.\n                              </p>\n                                        <p>\n                                Ørsted is the world leader in offshore wind and has been ranked the world's most sustainable energy company for three consecutive years. Ørsted has the target and plan of becoming carbon-neutral in its energy generation by 2025 and of reaching full value chain decarbonisation by 2040, which was recently validated by the Science Based Targets initiative (SBTi) as being consistent with limiting the global temperature rise to 1.5 °C. Ørsted is the world's first energy company to receive this validation.\n                              </p>\n                                        <p>\n                                For further information please contact:<br/><br/>\n                                 Ørsted Group Media Relations<br/>\n                                 Michael Korsgaard<br/>\n                                 +45 99 55 94 25<br/><a href=\"mailto:mikon@orsted.com\" data-type=\"email\" translate=\"no\">mikon@orsted.com</a></p>\n                                        <p>\n                                Ørsted Germany Media Relations<br/>\n                                 Steffen Kück<br/>\n                                 +47 (0) 40 181 310 829<br/><a href=\"mailto:presse@orsted.de\" data-type=\"email\" translate=\"no\">presse@orsted.de</a></p>\n                                        <p>\n                                Ørsted Investor Relations<br/>\n                                 Allan Bødskov Andersen<br/>\n                                 +45 99 55 79 96<br/><a href=\"mailto:IR@orsted.com\" data-type=\"email\" translate=\"no\">IR@orsted.com</a></p>\n                                        <p>\n                                          <strong>About Ørsted</strong>\n                                          <br/>\n                                 The Ørsted vision is a world that runs entirely on green energy. Ørsted develops, constructs, and operates offshore and onshore wind farms, solar farms, energy storage facilities, and bioenergy plants, and provides energy products to its customers. Ørsted ranks as the world's most sustainable energy company in Corporate Knights' 2021 index of the Global 100 most sustainable corporations in the world and is recognised on the CDP Climate Change A List as a global leader on climate action. Headquartered in Denmark, Ørsted employs 6,672 people. Ørsted's shares are listed on Nasdaq Copenhagen (Orsted). In 2020, the group's revenue was DKK 52.6 billion (EUR 7.1 billion). Visit <a href=\"http://orsted.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">orsted.com</a> or follow us on Facebook, LinkedIn, Instagram, and Twitter.\n                              </p>\n                                      </td>\n                                    </tr>\n                                    <tr>\n                                      <td>\n                                        <p>\n                                Attachments:<br/><a href=\"https://attachment.news.eu.nasdaq.com/a64c6344a7f279c067a2d7193e00b8b25\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon CPPA BKR3 and Ballykeel_FINAL.pdf</a><br/><a href=\"https://attachment.news.eu.nasdaq.com/ac31e4c65eef3c5ed15d457ea17375084\" data-type=\"url\" class=\"tr-link\" translate=\"no\">BRK2-1200px.jpg</a><br/><br/></p>\n                                      </td>\n                                    </tr>\n                                  </tbody>\n                                </table></div>\n                              </td>\n                            </tr>\n                            <tr>\n                              <td>\n                                <span>This news release was distributed by Company News System, <a href=\"https://www.nasdaqomxnordic.com/news\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.nasdaqomxnordic.com/news</a></span>\n                              </td>\n                            </tr>\n                          </tbody>\n                        </table></div>\n                      </td>\n                    </tr>\n                  </tbody>\n                </table></div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://view.news.eu.nasdaq.com/view?id=bf7202a88836b6a3fa189614bbd73bc4d&amp;lang=en\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Ørsted A/S</strong> published this content on <strong>01 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>01 December 2021 08:01:27 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Ørsted A/S</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Ørsted-A/S</p></div>"}