{"date": "2021-11-02 15:03:05.358000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Ecobee Inc. has had a complicated relationship with Amazon  over the years. The smart thermostat pioneer counted the internet giant as a key e-commerce channel provider, a partner, an investor and a suitor. Now, weeks after Amazon revealed plans to become a competitor, Toronto-based ecobee is selling out.</p><p>On Monday, Generac Holdings Inc.  of Waukesha, Wisc., said it would buy the 14-year-old Canadian company for up to US$770-million. NYSE-listed Generac is paying US$200-million in cash and issuing US$450-million of stock to ecobee investors. Generac will pay up to US$120-million more in stock if ecobee meets performance targets by mid-2023.</p></div><div class=\"tr-npp-body\"><p>It's one of the largest takeovers of a Canadian technology company in 2021 and continues an unprecedented year for cross-border transactions, featuring a record number of acquisitions of Canadian technology companies by foreign buyers – but also a record number of foreign acquisitions by Canadian companies, according to Refinitiv.</p><p>Generac chief executive officer Aaron Jagdfeld said his company was paying 4.5 times ecobee's last 12 months revenue. \"Strategically we think we're getting a great deal,\" he said. \"It really fits well with where we're going, powering a smarter world … with a focus on energy conservation and the grid of the future.\"</p><p>Ecobee, led by serial entrepreneur Stuart Lombard, emerged as one of Canada's most promising startups of the early 2010s, selling thermostats that could be controlled from room to room by smartphones and smartwatches, as well as voice-activated services. Investors include Amazon's Alexa Fund, the Caisse de dépôt et placement du Québec, AGL Energy Ltd., BDC Capital, Energy Impact Partners, Relay Ventures, Thomvest and Export Development Canada.</p><p>The company has also received takeover entreaties over the years from several players, including Amazon, said Relay managing partner and ecobee director John Albright.</p><p>Generac started out as a manufacturer of backup power generators, but in recent years it has branched into energy management and monitoring and solar power. The goal of his company, Mr. Jagdfeld said, is to become a key provider of products that turn buildings into \"microgrids\" that not only consume energy but store and produce it.</p><p>The U.S. company is buying a Canadian company that was challenged because it was a small stand-alone player in a field of internet giants that saw thermostats as a channel for collecting data and selling more digital services. While ecobee is generally considered the top manufacturer in terms of quality and features, it was surpassed years ago in sales by Nest, which was bought in 2014 by Google for US$3.2-billion. Ecobee still commands a 25-per-cent market share in North America.</p><p>Mr. Lombard said ecobee tried to compete \"not trying to out-Google Google or out-Amazon Amazon, but trying to win in our way,\" by competing on the merits of its products. But Mr. Albright said even though ecobee increased sales by nearly 50 per cent in its past fiscal year, it was tough for the money-losing private company that couldn't cross-subsidize its products from internet revenues to compete. \"Can a company win by being the best product only? No. Can it finish in the Top 3? Ecobee clearly did.\"</p><p>Ecobee's relationship with Amazon also evolved. Early on, the e-commerce giant was a key sales channel, and in 2014, ecobee tied its growth to making its products compatible with voice-activated platforms from Amazon and others.</p><p>But in 2020, Amazon asked ecobee to hand over data from its voice-activated machines, even when they weren't in use, The Wall Street Journal reported in April. When ecobee refused over privacy concerns, Amazon replied that ecobee's stand could affect its ability to sell on Amazon.com, The Journal reported.</p><p>\"It's true,\" Mr. Albright said. \"Stuart stood up to them and said, 'We will not give it to you' because his conscience wouldn't let him. He said, 'If you don't want to carry our product that's fine.'\"</p><p>Mr. Lombard said, \"We think of ourselves as invited guests in our customers' homes, so when it comes to customer data, security and privacy, we're not going to compromise. Amazon is still a great partner, we don't necessarily agree on everything.\" Mr. Jagdfeld added: \"We'll continue to resist those requests.\"</p><p>Then, in late September, Amazon unveiled a suite of products – including its own smart thermostat, which will sell for US$60, far less than an ecobee product. At the time, Generac and ecobee were in takeover discussions after ecobee had turned down a string of offers to go public by combining with special-purpose acquisition corporations.</p><p>Mr. Jagdfeld said he wasn't concerned about competition from Amazon, which he said is focused on selling more products and services over its \"home shopping ecosystem\" while, \"I see us doing something different, going after the home energy ecosystem ... with a more feature-rich product.\"</p><p>Mr. Lombard said selling to Generac was \"a much better outcome\" than going public as it gives his company a new deep-pocketed owner that can finance its expansion. \"There are huge opportunities for us to grow the business and do it at a much bigger scale, much faster.\"</p><p>\"Everybody won in this transaction,\" Mr. Albright said. \"There's no one walking away that didn't benefit financially or professionally.\"</p><p><span>Your time is valuable. Have the Top Business Headlines newsletter conveniently delivered to your inbox in the morning or evening.</span><a href=\"https://www.theglobeandmail.com/newsletters/?utm_source=Arcnewsletter&amp;utm_medium=onsite&amp;utm_campaign=fixed_positions&amp;utm_term=signuppage&amp;utm_content=topbusiness_promo#newsletter-group-2\"><span>Sign up today</span> </a><span>.</span> </p><p>Follow this link to view this story on globeandmail.com: <a href=\"https://www.theglobeandmail.com/business/article-smart-thermostat-pioneer-ecobee-facing-growing-threats-from-amazon/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Smart thermostat pioneer ecobee, facing growing threats from Amazon, sells to U.S. generator maker for up to $770-million</a> The viewing of this article is only available to Globe Unlimited subscribers.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 The Globe and Mail Inc. and its licensors. All rights reserved.</p></div>"}