{"date": "2021-12-05 09:37:58+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3389.79, "close": 3523.29}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>DUBAI, UAE– Aruba, a Hewlett Packard Enterprise company (NYSE: HPE), today announced Aruba SD-WAN support and integration with Amazon Web Services’s (AWS) new AWS Cloud WAN, an innovative cloud networking service introduced at AWS re:Invent. This new solution will enable Aruba customers to use the policy-based framework of AWS Cloud WAN to create advanced WAN topologies with integrated network segmentation that aligns seamlessly with the Aruba SD-WAN fabric. Now, all the advantages of network segmentation at the edge – in the LAN and WAN – can be extended from headquarters and branches across the AWS cloud.<strong> </strong></p>\n<p>As organizations increasingly utilize the cloud to host their business applications, they want the most flexible and modern SD-WAN solution that lets them achieve the highest return on cloud investments through better economics, control, reliability, and performance. Of equal importance, these organizations want to leverage cloud infrastructures like the AWS global network to build more flexible and secure enterprise WANs.</p>\n<p>With this latest development, Aruba now supports the widest range of integrations with AWS, making Aruba SD-WAN the cloud onramp of choice for cloud-first enterprises. This year’s re:Invent marks the third year in a row that Aruba has been a launch affiliate for new AWS network services. In 2020, Aruba announced support for AWS Transit Gateway Connect and in 2019, Aruba launched API-based automation with AWS Transit Gateway Network Manager.</p>\n<p>Aruba’s SD-WAN solutions, an integral part of Aruba ESP (Edge Services Platform), provide enterprises with a sophisticated, flexible on-ramp to AWS network services, allowing users to easily integrate their SD-WAN with a wide range of hybrid and multi-cloud services. Aruba’s integration with AWS Cloud WAN provides complete support for cloud connectivity use cases which extend LAN/WAN network segmentation and traffic isolation from the edge to and through the AWS global backbone network.</p>\n<p>The benefits of LAN/WAN segmentation with AWS Cloud WAN include:</p>\n<ul class=\"bulleted-list arrowlist\">\n<li><strong>Improved network security from edge to cloud:</strong> Easily segmenting users, devices, applications, and WAN services into secure end-to-end zones in compliance with predefined security policies, regulatory mandates, and business intent provides consistent security policies and automated enforcement across the enterprise. Fine-grained LAN segmentation is translated to course-grained, VRF-like private network segments that extend across the AWS Cloud WAN.</li>\n</ul>\n<ul class=\"bulleted-list arrowlist\">\n<li><strong>Faster spin-up of new branch sites and Cloud VPCs:</strong> The integrated solution, combined with the new “one-click” EdgeConnect VPC instantiation, automates network deployments, removing the complexity associated with manual, step-by-step configuration of the SD-WAN (IPSec tunnels, segmentation, route tables, and VRFs) with the common AWS Core Network Policy, which can be time-consuming and error-prone.</li>\n</ul>\n<p>Organizations can now extend policy-based network segmentation from the branch edge – which spans the campus, branch, microbranch, and remote worker solutions – into the AWS global network. Aruba SD-WAN integration with AWS Cloud WAN is enabled through Aruba Orchestrator and Aruba Central, making it easy to deploy, manage, and operate sophisticated WAN networks over AWS. Aruba Orchestrator now also supports automated “one-click” deployment of EdgeConnect SD-WAN instances directly into AWS VPC’s. This new automation capability is seamlessly integrated with EdgeConnect’s zero-touch provisioning workflow, and further simplifies the deployment and commissioning process for solutions using Cloud WAN.</p>\n<p>“This latest integration with AWS Cloud WAN changes the game for enterprises looking to maximize flexibility and reduce operational complexity while strengthening security posture within their cloud-centric WAN deployments,” said David Hughes, chief product and technology officer at Aruba, a Hewlett Packard Enterprise company. “Integrations like these play an important role within Aruba ESP by enabling edge-to-cloud security for organizations as they adopt a Zero Trust SASE approach, while maximizing choice and flexibility as they implement their cloud strategy.”</p>\n<p>The new Aruba SD-WAN solution with AWS Cloud WAN will be previewed at AWS re:Invent, with general availability anticipated in 2022. For more information, please visit <a href=\"https://www.arubanetworks.com/partners/technology-partners/aws-solutions/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.arubanetworks.com/partners/technology-partners/aws-solutions/</a> </p>\n<p>-Ends-</p>\n<p><strong>About Aruba, a Hewlett Packard Enterprise company</strong></p>\n<p><span>Aruba, a Hewlett Packard Enterprise company, is the global leader in secure, intelligent edge-to-cloud networking solutions that use AI to automate the network, while harnessing data to drive powerful business outcomes. With Aruba ESP (Edge Services Platform) and as-a-service options, Aruba takes a cloud-native approach to helping customers meet their connectivity, security, and financial requirements across campus, branch, data center, and remote worker environments, covering all aspects of wired, wireless LAN, and wide area networking (WAN).</span></p>\n<p><span>To learn more, visit Aruba at <a href=\"http://www.arubanetworks.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.arubanetworks.com</a> . For real-time news updates, follow Aruba on Twitter and Facebook, and for the latest technical discussions on mobility and Aruba products, visit the Airheads Community at <a href=\"http://www.community.arubanetworks.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.community.arubanetworks.com</a> </span></p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}