{"date": "2021-09-30 19:46:32.595000+00:00", "ticker": "ABDN", "mrkt_info": {"open": 255.0, "close": 252.9}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>IDT CORP (\"IDT-N\")\n- NRS Subsidiary Sells 2.5% Minority Stake to Alta Fox Capital\n- Management for $10 million\n\n     IDT Corporation, a global provider of fintech, cloud communications\nand traditional communications services, announced that its National Retail\nSolutions (NRS) subsidiary has concluded the sale of a two and one-half\npercent stake (calculated on a fully diluted basis, including equity\nincentive grants) for $10 million to Alta Fox Capital Management, a private\ninvestment fund based in Fort Worth, Texas.\n\n     NRS operates a point-of-sale (POS)-based platform that enables\nindependent retailers to operate and process transactions more effectively,\nwhile providing advertisers and consumer marketers with unprecedented reach\ninto underserved consumer markets. NRS generated revenue of $21.2 million\nin the twelve months ended April 30, 2021, and increased quarterly revenue\nby 123% year over year. IDT holds an approximately 81% equity interest in\nNRS (on a fully-diluted basis) following the sale.\n\n     \"NRS is a market-leading point of sale provider to bodegas and other\nindependent convenience retailers, and we have only just begun to tap its\npotential,\" said Elie Y. Katz, President of NRS.\n     \"Given IDT's strong balance sheet and ample cash flows from our mature\nbusinesses, we have been reluctant to accept outside investments in NRS,\"\nsaid Marcelo Fischer, IDT's Chief Financial Officer. \"However, Alta Fox has\ndemonstrated a deep understanding of our markets and growth opportunities,\nincluding expansion into adjacent markets. We are excited to have their\nsupport.\"\n\n     \"We are impressed by the quality of the NRS business and leadership\nteam,\" said Connor Haley, Alta Fox's Founder and Managing Partner. \"NRS has\nmany of the characteristics we seek in our portfolio companies including\nmarket leadership, multiple high-margin revenue streams, and a significant\nrevenue growth rate. We believe that NRS has the potential to be worth many\nmultiples of the over $400 million implied enterprise value from our\ninvestment as management continues to execute on its strategic roadmap.\"\n\n     About IDT Corporation:\n\n     IDT Corporation (NYSE: IDT) is a global provider of fintech, cloud\ncommunications and traditional communications services. We make it easier\nfor families to connect, support and share across international borders. We\nalso enable businesses to transact and communicate with their customers\nwith enhanced intelligence and insight.\n\n     Our BOSS Revolution branded money transfer, mobile top-up and\ninternational calling services make sending money and speaking with friends\nand family around the world convenient and reliable. National Retail\nSolutions' (NRS) point-of-sale retail network enables independent retailers\nto operate and process transactions more effectively while providing\nadvertisers and consumer marketers with unprecedented reach into\nunderserved consumer markets. net2phone's unified communications as a\nservice solution provides businesses with intelligently integrated cloud\ncommunications and collaboration solutions across channels and devices. Our\nIDT Carrier Services and IDT Express wholesale offerings enable\ncommunications companies to provision and manage international voice and\nSMS services.\n\n     All statements above that are not purely about historical facts,\nincluding, but not limited to, those in which we use the words \"believe,\"\n\"anticipate,\" \"expect,\" \"plan,\" \"intend,\" \"estimate,\" \"target\" and similar\nexpressions, are forward-looking statements within the meaning of the\nPrivate Securities Litigation Reform Act of 1995. While these\nforward-looking statements represent our current judgment of what may\nhappen in the future, actual results may differ materially from the results\nexpressed or implied by these statements due to numerous important factors.\nOur filings with the SEC provide detailed information on such statements\nand risks, and should be consulted along with this release. To the extent\npermitted under applicable law, IDT assumes no obligation to update any\nforward-looking statements.\n\nContact:\nBill Ulrey\nIDT Investor Relations\nPhone: (973) 438-3838\nE-mail: invest@idt.net\n\n     # # #\n\nTel   : 1-973-438-1000    IDT CORP\nEmail : invest@idt.net\nWWW   : <a href=\"https://www.idt.net\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.idt.net</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2127200367.MNPRE2127201170-05450020210930</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}