{"date": "2022-02-03 09:00:00.206000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3023.87, "close": 2776.91}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwlistdisc{list-style-type:disc;}</style><p class=\"bwalignc\">\n<b>Exasol’s High-Performance Database Now Available as SaaS Model</b>\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\n<span>Exasol launches two versions of its SaaS model on Amazon Web Services (AWS)</span>\n</li>\n<li>\n<span>The launch strengthens Exasol’s position as the performance bridge to the cloud for businesses with a cloud-first strategy</span>\n</li>\n</ul><p>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.exasol.com%2F&amp;esheet=52573258&amp;newsitemid=20220203005141&amp;lan=en-US&amp;anchor=Exasol&amp;index=1&amp;md5=a246f5c3992302a18bcccf2eb8ac1fa7\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Exasol</a> has today announced that its high-performance analytics database is now available through a software-as-a-service (SaaS) model on Amazon Web Services (AWS). <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.exasol.com%2Fexasol-cloud%2F&amp;esheet=52573258&amp;newsitemid=20220203005141&amp;lan=en-US&amp;anchor=Exasol%26%238217%3Bs+SaaS+offering&amp;index=2&amp;md5=284e9de57071b04dfaba88415296a42f\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Exasol’s SaaS offering</a>, initially available in two versions, provides businesses the high performance and ease of use that Exasol is known for without them having to manage their own hardware infrastructure. Exasol, named Technology Partner of the Year 2021 in DACH by AWS, worked extensively with AWS SaaS Factory to deliver its SaaS model.\n</p><p>\n“As a company focused completely on superior analytics performance, we want to be able to provide businesses the same impressive experience wherever their data goes. It’s exactly for this reason that we are building a bridge for organizations to be able to move analytics processes to the cloud without risk, without friction, and without taking performance hits - something that Exasol is uniquely placed to offer,” said Mathias Golombek, CTO of Exasol. “As part of this, AWS gives us the ideal platform to build out our SaaS solution. It allows us to separate the compute from the storage, meaning we can elastically scale up and down compute power to optimize the costs and workloads for our customers.”\n</p><p>\nExasol’s deep technical partnership with AWS has been key to ensure it can deliver the best-in-class performance via its SaaS offering. For Exasol, as an in-memory database, the ability to seamlessly increase or decrease its memory footprint is important. The AWS cloud platform provides Exasol with the ability to scale both vertically and horizontally to meet its needs. Furthermore, as Exasol seamlessly manages hot and cold data between the object store, local SSDs and main memory, AWS provides Exasol with the infrastructure to do that without compromising performance.\n</p><p>\n“We understand the immense challenges facing companies in terms of extracting value from data to drive their business. We believe that companies who master this discipline will be better equipped for long-term success. Performance and cost are key drivers of any successful data strategy, and we are extremely proud to now offer our world-class performance technology through a consumption-based SaaS model on AWS for customers looking to move away from slow and costly systems without disruption to their business,” said Aaron Auld, CEO of Exasol. “Our technology is perfectly suited to solving the challenges that come with implementing cloud-first strategies while minimizing risk. Exasol’s SaaS offering is a key step towards delivering best-in-class performance combined with immediate budget relief to our customers.”\n</p><p>\nWith Exasol’s SaaS offering, customers can be up and running in a matter of minutes, in a fully managed system, while still benefiting from the best-in-class high-performance database technology that Exasol is known for without compromising security. When deployed in a public cloud, Exasol leverages native security measures such as AWS IAM or Active Directory services, as well as built-in security features. For customers who prefer to manage their own cloud solution, Exasol can also run on their cloud of choice, and for those looking for the ultimate control over their data, customers can continue to run Exasol on-premises. A hybrid solution is also possible for those customers who have needs that span several environments. Exasol is working to deliver a model which allows customers to select the appropriate deployment for different workloads, depending on regulatory considerations and their business needs. The launch of the SaaS model is the next step in this direction.\n</p><p>\nAndy Hayler, CEO of the Information Difference commented on the announcement: “Whilst cloud computing is a foundation for many businesses, especially digital ones, most organizations are yet to move fully to the cloud. Exasol is providing customers the best of both worlds with its SaaS offering, offering them freedom to undertake a hybrid cloud strategy and migrate at their own pace. By not focusing on a 'cloud-only' approach to its solutions Exasol enables customers to derive business value from their data quickly, easily and cost effectively, no matter where they choose to store their data, based on a high performance, flexible and scalable platform.”\n</p><p>\n<b>About Exasol</b>\n</p><p>\nExasol was founded in 2000 with the vision to transform how organizations use data. Today, Exasol’s analytics database – the fastest in the world – is trusted by the world’s most ambitious organizations. With offices in several locations across the US and Europe, Exasol is committed to delivering flexible, scalable and powerful analytics solutions to customers wherever they are, in the cloud – public or private - or on-premises.\n</p><p>\n<span>Exasol – accelerating insights from the world’s data.</span>\n</p><p>\nLearn more at: <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.exasol.com%2F&amp;esheet=52573258&amp;newsitemid=20220203005141&amp;lan=en-US&amp;anchor=www.exasol.com&amp;index=3&amp;md5=5bea1518645d1587f28e86002b9850d1\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.exasol.com</a> and follow us on social media: <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fexasol-ag&amp;esheet=52573258&amp;newsitemid=20220203005141&amp;lan=en-US&amp;anchor=LinkedIn&amp;index=4&amp;md5=630607e44684c35b63071190477db7d9\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LinkedIn</a> and <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Ftwitter.com%2FExasolAG&amp;esheet=52573258&amp;newsitemid=20220203005141&amp;lan=en-US&amp;anchor=Twitter&amp;index=5&amp;md5=3ae40cb8386a5d10d3022572d3262646\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Twitter</a>.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20220203005141r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjIwMjAzMDA1MTQxcjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=4abfbe54a59cde648b21cec00f2c4423fac9680acc2e8b8f926b09426bd6f822174effc4b08fa631cf16a2e3d4124efe339b5651fc05c867f588ef269b93c044\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20220203005141/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220203005141/en/</a></span></p><p>\n<b>PR: \n</b><br/>Isabella Alder, EMEA Communications Manager at Exasol\n<br/><b>Email:</b> <a href=\"mailto:isabella.alder@exasol.com\" data-type=\"email\" translate=\"no\">isabella.alder@exasol.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2022</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: EXASOL</p></div>"}