{"date": "2021-12-14 10:05:52.976000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"story-table-container\"><table border=\"0\">\n<tr>\n<td>\n<p>DGAP-News: GK Software SE / Key word(s): Alliance<br/>\nGK Software Announces Availability on AWS<br/>\n<br/>\n14.12.2021 / 11:05<br/>\nThe issuer is solely responsible for the content of this announcement.<br/>\n<br/></p>\n<hr/>\n<div>\n<p>GK solutions running on AWS give retailers additional cloud-based hosting options that accelerate digital transformation</p>\n<p>GK Software today announced that its CLOUD4RETAIL OmniPOS 5.19 and T+ Enterprise and Central EJ, Returns and Loyalty solutions are now available on Amazon Web Services, Inc. (AWS), running on cloud native services that include Amazon Elastic Kuberntes Service (Amazon EKS) and Amazon Relational Database Service (Amazon RDS). By providing support on the native AWS infrastructure, GK's omnichannel commerce and payment solutions give retailers purpose-built offerings that provide value across the entire spectrum of retail IT operations.</p>\n<p>Retailers are seeking cloud solutions that accelerate innovation, optimize operations and delight customers. The availability of GK's cloud solutions on AWS empowers retailers to create exceptional experiences with an agile, high-performance infrastructure. This collaboration makes it easy and seamless for retailers running on the cloud to take advantage of AWS solutions, which are containerized and delivered using AWS native services.</p>\n<p>GK CLOUD4RETAIL OmniPOS 5.19 is an enhanced POS solution that provides an enterprise-class, unified platform for every retail format. Its flexible, open commerce platform powers the modern retail experience, from touchless mobile payments to table-service support, as well as integrated payment processing. T+ Enterprise and Central EJ, Returns and Loyalty solutions allow retailers to analyze and process transactions from any source across the enterprise, including all software and data, in real time. GK's solution is currently being used at almost 500,000 retail and payment installations across approximately 100,000 stores in more than 60 countries.</p>\n<p>With this collaboration, GK customers can now create and configure shared file systems simply and quickly. The solutions can also be used with Amazon RDS, which makes it easy to set up, operate, and scale a relational database in the cloud. It provides cost-efficient and resizable capacity while automating time-consuming administration tasks such as hardware provisioning, database setup, patching and backups.</p>\n<p>\"It's become increasingly important for retailers to transform their digital operations by enhancing their cloud capabilities,\" said Michael Jaszczyk, chief executive officer at GK America. \"Our AWS offerings allow retailers to easily leverage cloud computing and accelerate their innovation journey. We're excited to bring this solution to the table for our customers and make it easier than ever to improve efficiency and productivity in all areas of a retailer's business.\"</p>\n<p><b>About GK Software SE</b><br/>\nGK Software SE is a leading developer and provider of standard software for the retail sector, and currently counts 22 percent of the world's 50 largest retailers among its customer base. According to a study published by RBR 2021, the Company is one of the leading international providers of POS software and is the fastest growing business in the industry in terms of the number of installations worldwide (without Hospitality and Petrol). The company offers an extensive range of solutions for stores and enterprise headquarters as well as for the implementation of contemporary omni-channel retail concepts. Thanks to its open and platform-independent software solutions in the GK/Retail Suite, the company has established itself as one of the market's leading providers of technology and innovations. Its solutions enable retail chains with numerous stores to optimize their business processes and to benefit from significant potential for saving costs and implementing customer loyalty programs in order to improve their competitiveness. In addition to its own software solutions, GK Software SE also offers customers a comprehensive range of implementation and maintenance services. Having been acquired in 2012, AWEK GmbH and in 2015, the retail segment of DBS Data Business Systems Inc. In 2017, the company acquired a majority shareholding in prudsys AG, a company focused on artificial intelligence. In 2018, the valuephone GmbH was acquired, which develops leading solutions for mobile consumers. retail7 GmbH, specializing in cloud solutions for smaller retailers, was founded in 2020.</p>\n<p>The company employs 1,071 members of staff (figures for 31 September 2021) across its headquarters in Schöneck (Germany) and other business locations in Germany, Czech Republic, Switzerland, South Africa, Russia, Ukraine and the USA. GK Software SE's customers include many well-known retailers, including Adidas, Edeka, Lidl, Aldi, Coop (Switzerland), Netto Marken-Discount, Hornbach, Migros, Grupo Kuo and Walmart. The software is currently being used at almost 500,000 retail and payment installations across approximately 100,000 stores in more than 60 countries. The company has grown rapidly in recent years and its sales revenues totaled EUR 117.6 million in 2020. Since launching the company in 1990, the two founders Rainer Gläß (CEO) and Stephan Kronmüller (deputy board member), together with the experienced management team, have shaped GK Software into a profitable company exhibiting strong growth.</p>\n<p>Further information about the company: <a href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=6dcfa2429db0de962b4378abb76954fc&amp;application_id=1257674&amp;site_id=reuters8&amp;application_name=news\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.gk-software.com</a></p>\n<p>Contact:</p>\n<p><b>Communications &amp; Investor Relations</b></p>\n<p><b>GK Software SE</b><br/>\nDr. René Schiller<br/>\nPhone: +49 (0)37464-84-264<br/>\nFax: +49 (0)37464-84-15<br/>\nE-mail: <a href=\"mailto:rschiller@gk-software.com\" data-type=\"email\" translate=\"no\">rschiller@gk-software.com</a></p>\n</div>\n<br/>\n<hr/>\n<p>14.12.2021 Dissemination of a Corporate News, transmitted by DGAP - a service of EQS Group AG.<br/>\nThe issuer is solely responsible for the content of this announcement.<br/>\n<br/>\nThe DGAP Distribution Services include Regulatory Announcements, Financial/Corporate News and Press Releases.<br/>\nArchive at www.dgap.de<br/></p>\n<hr/></td>\n</tr>\n</table></div>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tr>\n<td align=\"left\">Language:</td>\n<td align=\"left\">English</td>\n</tr>\n<tr>\n<td align=\"left\">Company:</td>\n<td align=\"left\">GK Software SE</td>\n</tr>\n<tr>\n<td align=\"left\">\n</td><td align=\"left\">Waldstraße 7</td>\n</tr>\n<tr>\n<td align=\"left\">\n</td><td align=\"left\">08261 Schöneck</td>\n</tr>\n<tr>\n<td align=\"left\">\n</td><td align=\"left\">Germany</td>\n</tr>\n<tr>\n<td align=\"left\">Phone:</td>\n<td align=\"left\">+49 (0)3 74 64 84 - 0</td>\n</tr>\n<tr>\n<td align=\"left\">Fax:</td>\n<td align=\"left\">+49 (0)3 74 64 84 - 15</td>\n</tr>\n<tr>\n<td align=\"left\">E-mail:</td>\n<td align=\"left\">info@gk-software.com</td>\n</tr>\n<tr>\n<td align=\"left\">Internet:</td>\n<td align=\"left\">www.gk-software.com</td>\n</tr>\n<tr>\n<td align=\"left\">ISIN:</td>\n<td align=\"left\">DE0007571424</td>\n</tr>\n<tr>\n<td align=\"left\">WKN:</td>\n<td align=\"left\">757142</td>\n</tr>\n<tr>\n<td align=\"left\">Listed:</td>\n<td align=\"left\">Regulated Market in Frankfurt (Prime Standard); Regulated Unofficial Market in Berlin, Munich, Stuttgart, Tradegate Exchange</td>\n</tr>\n<tr>\n<td align=\"left\">EQS News ID:</td>\n<td align=\"left\">1257674</td>\n</tr>\n</table></div>\n<br/>\n<div class=\"story-table-container\"><table border=\"0\">\n<tr>\n<td align=\"left\" colspan=\"2\">\n</td></tr>\n</table></div>\n<div class=\"story-table-container\"><table border=\"0\">\n<tr>\n<td align=\"left\" colspan=\"2\"> </td>\n</tr>\n<tr>\n<td align=\"left\">End of News</td>\n<td align=\"left\">DGAP News Service</td>\n</tr>\n</table></div>\n<div class=\"story-table-container\"><table border=\"0\">\n<tr>\n<td>\n<hr/></td>\n</tr>\n</table></div>\n<p>1257674  14.12.2021 </p>\n<div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"fncls.ssp?fn=show_t_gif&amp;application_id=1257674&amp;application_name=news&amp;site_id=reuters8\" border=\"0\" height=\"0\" src=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=show_t_gif&amp;application_id=1257674&amp;application_name=news&amp;site_id=reuters8\" width=\"0\"/></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright EQS Group 2021</p></div>"}