{"date": "2021-12-07 18:27:33+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\"><li class=\"tr-summaryitem\">Amazon proposed delivery fee of about 2 euros: lawmakers</li><li class=\"tr-summaryitem\">Proposal made during Aug. 25 meeting in Paris</li><li class=\"tr-summaryitem\">Amazon says raised minimum fee will hurt consumers</li><li class=\"tr-summaryitem\">Parliament expected to approve bill in final vote on Dec. 19</li></ul><p class=\"tr-by\">By Elizabeth Pineau</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">PARIS, Dec 7 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon proposed raising book delivery charges in France to around 2 euros from almost <span class=\"tr-strong\">nothing</span> if parliament withdrew a bill that would make it more difficult for the e-commerce group to undercut local bookshops, a French senator told Reuters.</p><p>Senator Laure Darcos said Amazon had made the proposal for a minimum delivery charge of 1.80-2.00 euros ($2.03-$2.25) when its vice president for Books and Kindle content, David Naggar, met Culture Minister Roselyne Bachelot on Aug. 25 in Paris.</p><p>\"They were ready to increase shipping costs to 1.80-2.00 euros outside of premium subscription costs to align more closely with the delivery charges of other goods on one condition: that we withdraw our bill so that it did not benefit bookstores,\" Darcos told Reuters.</p><p>The proposal, details of which have not previously been reported, was part of a months-long lobbying push by Amazon to kill the bill, Darcos and five other lawmakers said.</p><p>     <span class=\"tr-strong\">Amazon declined to confirm the meeting took place. When asked what was said at the Aug. 25 meeting Amazon did not comment.</span></p><p>     <span class=\"tr-strong\">Independent bookshops are held with special affection in France, the land of Victor Hugo and Simone de Beauvoir. </span>But they are under pressure from online retailers like Amazon, Fnac <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FNAC.PA\" data-type=\"ric\" data-ric=\"FNAC.PA\" translate=\"no\" dir=\"ltr\">FNAC.PA</a> and Leclerc, which have eroded their market share. Of 435 million books sold in France in 2019, more than 20% were bought online.</p><p>The bill would fix its own minimum price for shipping books in France with the aim of going someway to levelling the playing field for independent book stores.</p><p>Free delivery of books is currently banned in France. Amazon currently charges a single centime (cent) compared with 5-7 euros ($5.82-8.15) for local bookstores.     </p><p>Darcos, <span class=\"tr-strong\">who drafted the bill,</span> was not present at the Aug. 25 meeting but was briefed by an official in the room. </p><p>A second lawmaker briefed by a person with first-hand knowledge of the meeting confirmed a proposal in the region of 2 euros had been made. A third lawmaker informed of the meeting said the figure \"sounded right\".</p><p>Bachelot's office confirmed the meeting with Seattle-based Naggar had taken place but declined to comment on the exchange.</p><p>    </p><p><span class=\"tr-strong\">HIGHER PRICES</span></p><p>Darcos said the proposal was repeated to her at a separate meeting by Yohann Benard, Amazon's public affairs director for southern Europe.</p><p>She said the company was concerned that the French legislation - which does not name Amazon - might set a precedent. <span class=\"tr-strong\">Amazon did not comment.</span></p><p>President Emmanuel Macron's government refused to budge, and parliament is expected to pass the bill on Dec. 19, after which a minimum shipping price for books must be agreed with the regulator before it becomes law. </p><p>Amazon says the legislation would make books more expensive for French consumers, especially those in rural areas far from any bookstore.</p><p><span class=\"tr-strong\">An Amazon spokesperson told Reuters more than 40% of its book deliveries in France went to postal codes without a bookstore. A raised minimum shipping fee would cost French consumers an estimated 250 million euros a year, the Amazon spokesperson added.</span></p><p>The law would only increase Amazon's margins, company officials told the second lawmaker aware of the Aug. 25 meeting, who requested anonymity because Amazon's operations are a sensitive matter in her constituency.</p><p>The same lawmaker said Amazon had proposed the price floor for the period until April 2022, when France elects its next president.</p><p><span class=\"tr-strong\">Amazon did not comment.</span></p><p>The Ministry of Culture previously told Reuters that Amazon's pricing strategy had resulted in a single operator taking a growing market share. </p><p>French bookstore owners widely attribute their survival to a 1981 law that prohibits price discounting of new books. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2RJ0HJ\" data-type=\"storyId\" data-story-id=\"nL8N2RJ0HJ\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p><br/></p><p>($1 = 0.8882 euros)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Elizabeth Pineau; Additional reporting by Mathieu Rosemain; Writing by Richard Lough; Editing by Catherine Evans and Jane Merriman)</p><p class=\"tr-contactinfo\">((Email: <a href=\"mailto:richard.lough@thomsonreuters.com\" data-type=\"email\" translate=\"no\">richard.lough@thomsonreuters.com</a> ; Tel: +33 1 80 98 12 45 ; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON-FRANCE/BOOKS (EXCLUSIVE, PIX)</p></div>"}