{"date": "2022-02-12 13:20:02.980000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3180.07, "close": 3103.34}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Apartment complex near Amazon's new site is at the center of the dispute</p><p>Just a few blocks away from the Northern Virginia site where Amazon is building its second headquarters, the corporate giant's new neighbors are duking it out over plans for development.</p></div><div class=\"tr-npp-body\"><p>Except this fight isn't over the company's new offices - it's over an apartment complex.</p><p>Prompted by the company's arrival, Arlington County has worked to update its planning documents for the nearby Pentagon City neighborhood, a sprawling mass of apartment buildings, parking lots and low-slung shopping centers.</p><p>But one piece of that revamped vision has inflamed some locals: It could pave the way for JBG Smith, the dominant landowner in the area and the developer for Amazon's headquarters, to triple the number of units per acre at a massive set of apartments down the street. (Amazon founder Jeff Bezos owns The Washington Post.)</p><p>As the Arlington County Board prepares to consider the updated plan Saturday, the prospect of greater density at RiverHouse - at 1,676 units, already one of the three largest complexes in the D.C. region - has residents coming out in full force on both sides.</p><p>The plan \"is totally excessive and regressive,\" said Alla Kamins, 47, a federal employee who brought together a group of neighbors in December to oppose the new units. \"This just seemed to be, 'How can we build it out as much as we can?' \"</p><p>Kamins, who bought a condo in nearby Arlington Ridge almost two decades ago, said she fears the sector plan would allow for more buildings at the RiverHouse property that would block sunlight, wipe out greenways and ultimately leave her neighborhood, a more suburban stretch to the south, with no voice to counter JBG Smith's proposals.</p><p>Others, like business consultant Luca Gattoni-Celli, 31, have rallied around the Pentagon City sector plan - specifically because it could bring more housing options to a region strapped for affordable units. Like Kamins, he also recently started a group to organize around density issues, though his makes the opposite argument.</p><p>\"This is not a farmer's field in the middle of nowhere,\" said Gattoni-Celli, a former Arlington resident who now lives in Alexandria. \"It's next to the world's largest office building. It's a stone's throw away from what will be the second headquarters of one of the world's largest corporations. We're going to need a lot more housing there, but this area is really well set up to absorb it all.\"</p><p>Matt Mattauszek, a development planner for the county, emphasized that the Pentagon City sector plan is merely a road map for the neighborhood, not a guarantee of more construction. Individual proposals to build or develop at specific sites, including at RiverHouse, still must be approved by Arlington officials.</p><p>\"This is a long-term vision for where we want to see that area heading,\" Mattauszek said. \"It may take decades. It is up to the property owner themselves. We're not dictating exactly when that happens.\"</p><p>A JBG Smith spokeswoman did not say whether the real estate developer had any firm plans on any additions to the complex. \"We are grateful for the opportunity to participate in these important discussions and look forward to engaging with the local community further once we have plans to share,\" she wrote in a statement.</p><p class=\"tr-npp-section-title\">NIMBYs and more</p><p>At its core, the debate brewing in Arlington over RiverHouse mirrors similar fights taking place in any number of increasingly expensive metro areas across the country, such as Boston, Los Angeles or Minneapolis. Down the road in Alexandria, residents also are clashing over whether to expand another large apartment complex.</p><p>The issue, some say, is one of basic supply and demand. Officials in these booming metros, faced with a limited housing stock, soaring rents and steady population growth, are trying to spur higher-density development as a way to accommodate new residents.</p><p>But those efforts have sometimes angered longtime residents and single-family homeowners, who say more buildings will only lead to noisy construction, increased traffic, and greater strain on schools and roads. Increasingly, some other neighbors have started to speak up in favor of more development.</p><p>The debate over RiverHouse, though, has played out as it only could on the capital's doorstep. An alphabet soup of civic groups have submitted petitions and letters and organized sophisticated messaging campaigns as a way to push the county in one direction or another.</p><p>There are the YIMBYs of Northern Virginia, founded by Gattoni-Celli, whose group's acronym stands for \"Yes in My Backyard.\" They support adding more density - including at RiverHouse - to increase housing stock, especially near public transit, and to fix a regional shortage of units.</p><p>Also in the mix are some current renters and single-family homeowners who reject most any growth in Pentagon City, largely because of concerns over the environment and crowding. Their detractors might call them \"NIMBYs,\" short for \"Not in My Backyard.\"</p><p>Then there are the \"SIMBYs,\" a label adopted by Kamins and others who say they are in favor of growth, but only if it is \"sensible\" development. Her group, which calls itself RiverHouse Neighbors for Sensible Density, has hosted small rallies outside RiverHouse against the plan - and also drawn accusations it is merely a collection of NIMBYs in thinly veiled disguise.</p><p>All those involved have relied on the policy knowledge and media savvy of their members, many of whom are lawyers, lobbyists or federal bureaucrats. The SIMBY group, for instance, has published its news release on a professional public-relations newswire.</p><p>The neighborhood's civic associations, a more traditional channel for activism in Arlington, have drafted and redrafted their positions on the Pentagon City sector plan in successive letters to county board members. Lawyers for a nearby condo building have sent last-minute letters to county board members arguing that RiverHouse was rammed into the plan without \"statutorily required notice.\"</p><p class=\"tr-npp-section-title\">'A new vision'</p><p>If this density debate in Pentagon City has taken on a particularly Arlington flavor, it is also happening in a neighborhood that has in many ways sat at the vanguard of planning in this Northern Virginia suburb.</p><p>RiverHouse was built around 1960, as once-empty fields were developed into a \"mini-city\" anchored by a Western Electric telephone factory. The complex's design across 36 acres resembles many other suburban apartments from that era, with giant parking lots and three towers set off from the street by large lawns.</p><p>As development boomed in the 1970s - largely spurred by the arrival of a nearby Metro stop - officials put together what many say is the first master land-use plan in the region. That shaped what was built down the street: A shopping mall. Hotels. Offices for multiple federal agencies.</p><p>In more recent years, developers have made several failed attempts to expand the complex. Vornado Realty Trust, RiverHouse's previous owner, shelved a proposal to add nearly 1,000 units to the property in 2017. JBG Smith, the current developer, followed suit with a similar proposal after it bought the complex.</p><p>But with Amazon moving in nearby, county leaders say the calculus is looking very different. (The county has promised the tech company $23 million in local incentives, on top of as much as $750 million from state officials.)</p><p>\"Pentagon City, as it's been evolving over the last several decades, has continued to rely on a vision that was established in the 1970s,\" said Mattauszek, the Arlington planner. \"But we are at a point where that vision is basically going to be built out with Amazon's arrival … and a new vision needs to be established.\"</p><p>Arlington County Board Chair Katie Cristol (D) pointed out that the sector plan goes far beyond RiverHouse, or questions of housing in general. It was conceived in part drawing some recommendations from a civic group called Livability 22202 that formed after the Amazon announcement.</p><p>\"It's an important opportunity to update the plan for this area that's historic and really consequential,\" she said. On matters like expanding tree canopy and increasing green space, she said the plan for Pentagon City has already pushed the envelope for what is possible.</p><p>The plan - if approved - would set broad parameters for the kind of development that could occur on RiverHouse. For instance, 10 percent of units in new development must be reserved for affordable housing. At least one-fifth of the property would need to be saved for tree canopy, with additional rules for vegetation. Once that's satisfied, the area taken up by the lowest five stories of new buildings cannot exceed 55 percent of the property.</p><p>Kamins said there is no reason that her neighborhood should receive more of that density simply because of its geography - particularly in an effort that is bound to benefit developers.</p><p>Others, like retired administrator Jeff Williams, 68, say it is worth staying hopeful. In 60 years living in Arlington, Williams said he has seen changes both good and bad, and as a renter at RiverHouse, he has grown increasingly worried about his ability to stay in the neighborhood.</p><p>\"Change is coming, and it's coming whether we like it or not,\" Williams said. \"People are used to what they have, and they don't want to lose it. But it's better to be engaged in trying to shape that change and introducing the results you want to see.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 The Washington Post</p></div>"}