{"date": "2022-01-04 14:58:28.634000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Jan. 4 -- The Delhi high court on Tuesday dismissed Future Group's petition seeking to quash the arbitration proceedings initiated by Amazon in Singapore.</p><p>In its petition, Future Coupons asked the high court to quash the proceedings on the grounds that the Indian competition watchdog has already suspended the Amazon-Future deal.</p></div><div class=\"tr-npp-body\"><p>The Delhi high court has heard the matter and reserved its order yesterday. Ahead of the verdict, Future Retail shares rose 3.6% to close at Rs.51.80 on NSE.</p><p>Currently, a dispute between Future Group and Amazon is underway at the Singapore arbitration panel, but both sides have been fighting parallel cases in various courts to enforce or overrule certain decisions taken by the arbitrator.</p><p>On December 18, the CCI in its order had suspended its approval of Amazon's deal with Future Coupons Ltd and asked the US-major to furnish additional documents.</p><p>CCI had imposed a fine of Rs.200 crores on the US giant for allegedly making \"false and incorrect statements\" while seeking an approval for the deal between itself and Future Coupons.</p><p>Mukul Rohatgi, senior counsel representing Future Coupons informed the court that as per law an arbitrator must terminate the proceeding if it has become unnecessary.</p><p>Adding that the company had approached the tribunal for termination of proceedings after the anti-trust watchdog's December order.</p><p>Rohatgi argued that the international arbitral tribunal was acting in a 'perverse' manner and that it has yet not passed any order in the matter.</p><p>On the other hand, senior counsel Harish Salve on behalf of Future Retail Ltd said that Future Retail had been unnecessarily dragged in the matter even as the company was reeling under the pressure of bankruptcy. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}