{"date": "2021-11-02 19:31:32.530000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Ecommerce retailer Amazon has revealed plans to hire nearly 50,000 seasonal associates for roles across its fulfilment and delivery network in India.</p><p>The recruitment comes in response to increasing demand from people relying on Amazon's service.The range of seasonal roles will also include part-time flexible work prospects such as independent contractors with Amazon Flex.The associates will help the retailer's current associates across the country in picking, packing, shipping and delivering customers' orders.Amazon customer fulfilment operations, APAC, MENA &amp; LATAM VP Akhil Saxena said: \"One thing we've learned from the Covid-19 pandemic is how important a role Amazon and e-commerce can play for our customers as much as for small businesses &amp; the economy. We take this responsibility seriously, and we're proud of the work our teams are doing to help small and other businesses deliver to our customers through this difficult time.\"We want to continue helping customers all over India get everything they need so they can continue to practice social distancing.\"To enable this, we are creating work opportunities for close to 50,000 seasonal associates across our fulfilment and delivery network.\"This will also keep as many people as possible working during this pandemic while providing a safe work environment for them.\"In March, Amazon announced plans to hire 100,000 additional workers in its fulfilment centres and delivery network across the US to meet the surge in online orders.Meanwhile, the retailer has implemented a number of safety measures to protect health and ensure the well-being of its associates, partners, employees and customers.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}