{"date": "2022-01-27 14:33:52+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2799.72, "close": 2792.75}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The author is a Reuters Breakingviews columnist.  The opinions expressed are his own.</p><p class=\"tr-by\">By Robert Cyran</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW YORK, Jan 27 (Reuters Breakingviews)</span><span class=\"tr-dl-sep\"> - </span>Apple <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a> boss Tim Cook would prefer not to have supply-chain challenges. Yet it's becoming one of the better kinds of problem to have. Technology investors are worried the pandemic brought forward years of future revenue, especially for cloud-based companies, and that growth will now slow. The $2.6 trillion Apple instead may be poised for a rebound as it satiates pent-up demand for iPhones. </p><p>It's early, but 2022 has been a rough year for tech investors. Apple’s stock is down about 10%. Peers Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, Microsoft <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MSFT.O\" data-type=\"ric\" data-ric=\"MSFT.O\" translate=\"no\" dir=\"ltr\">MSFT.O</a> and Facebook owner Meta Platforms <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a> have done worse. And Apple has performed far better than highly valued upstarts, such as e-commerce outfit Shopify <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SHOP.TO\" data-type=\"ric\" data-ric=\"SHOP.TO\" translate=\"no\" dir=\"ltr\">SHOP.TO</a>, which has lost a third of its market capitalization in less than a month.</p><p>Apple shares trade at 27 times estimated earnings over the next 12 months, using Refinitiv data. That’s higher <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2T13UF\" data-type=\"storyId\" data-story-id=\"nL4N2T13UF\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> than its recent average, but still lower than its giant tech peers. And it is far lower than multiples attached to fast-growing stocks: Shopify still trades at over 100 times estimated earnings. So there’s less froth to be flattened at Apple.</p><p>Furthermore, while most internet-based tech firms have seen rapid top-line expansion during the pandemic, it has been more of a mixed bag for Apple. Sure, if people spend more time on phones in lockdown, that is good for the company’s services business, which accounted for 22% of its total revenue of $83 billion in the quarter to September. But iPhone sales brought in over twice as much revenue that quarter. The company estimates silicon shortages and manufacturing disruptions reduced revenue by $6 billion in the period.</p><p>As the pandemic recedes, tech firms that have capitalized on virtual living should indeed see growth rates slow. In contrast, time will iron out Apple’s supply-chain difficulties, as chip production expands and factory employees get back to work. </p><p>Cook will have new numbers for the last calendar quarter of 2021 to talk about on Thursday after market’s close. Perhaps impatient customers might switch to a different phone, but Apple’s users tend to be hard to dislodge. Apple had a 15% share of the global smartphone market last quarter according to researcher IDC, up from 12.5% five years ago. Besides, other handset makers have chip troubles too. The missing iPhone sales are probably just delayed.</p><p>Follow <a href=\"https://twitter.com/rob_cyran\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@rob_cyran</a> on Twitter</p><p><br/></p><p>CONTEXT NEWS </p><p>-  Apple is set to report earnings for its second fiscal quarter to December on Jan. 27 after U.S. markets close.</p><p>- On Oct. 28, Chief Executive Tim Cook said in a call with investors that supply constraints reduced revenue by about $6 billion in the quarter ending Sept. 25. He blamed industry-wide silicon shortages and Covid-19 manufacturing disruption.</p><p><br/></p><p class=\"tr-signoff\"> (Editing by Richard Beales and Sharon Lam)</p><p class=\"tr-contactinfo\">((For previous columns by the author, Reuters customers can click on <a href=\"reuters://REALTIME/verb=Headlines/ric=CYRAN/\" data-type=\"newsExpression\" data-expression=\"CYRAN/\" translate=\"no\" dir=\"ltr\">CYRAN/</a> <br/> SIGN UP FOR BREAKINGVIEWS EMAIL ALERTS <a href=\"https://bit.ly/BVsubscribe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://bit.ly/BVsubscribe</a> | <a href=\"mailto:robert.cyran@thomsonreuters.com\" data-type=\"email\" translate=\"no\">robert.cyran@thomsonreuters.com</a> ; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://robert.cyran.thomsonreuters.com@reuters.net\">robert.cyran.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: APPLE-RESULTS/BREAKINGVIEWS</p></div>"}