{"date": "2021-11-22 18:11:35.284000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">Taylor Swift Releases New Version of \"Christmas Tree Farm,\" Streaming Only on Amazon Music</p>\n<p>SEATTLE, Nov. 22, 2021</p>\n<p>\n<span>The global superstar has recorded her instant classic Christmas song at the famed Abbey Road Studios in <span>London</span> as an Amazon Original, available for all Amazon Music listeners to stream around the world</span>\n</p>\n<p>\n<span>For a limited time, customers who haven't yet tried Amazon Music Unlimited can get three months free—with unlimited access to millions of podcast episodes and songs, ad-free, in the highest-quality streaming audio</span>\n</p>\n<p>\n<span>Download track artwork</span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3367725-1&amp;h=927468200&amp;u=https%3A%2F%2Fpress.aboutamazon.com%2F2021-amazon-music-holiday-originals&amp;a=HERE\" data-type=\"url\" class=\"tr-link\" translate=\"no\">HERE</a> and <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3367725-1&amp;h=2866878426&amp;u=https%3A%2F%2Famznstudios.box.com%2Fs%2Fxsfc145kclh5hjl5u7lp9gmqg6i0iohq&amp;a=HERE\" data-type=\"url\" class=\"tr-link\" translate=\"no\">HERE</a>\n<span>(Credit: Amazon Music)</span>\n<span>Stream</span>\n<span>\"Christmas Tree Farm (Old Timey Version) (Amazon Original)\"</span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3367725-1&amp;h=2046304199&amp;u=https%3A%2F%2Famzn.to%2FAmazonOriginal&amp;a=HERE\" data-type=\"url\" class=\"tr-link\" translate=\"no\">HERE</a>\n<span>Watch the behind-the-scenes video of the recording</span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3367725-1&amp;h=1801275281&amp;u=https%3A%2F%2Fyoutu.be%2FwgN81KxRNdY&amp;a=HERE\" data-type=\"url\" class=\"tr-link\" translate=\"no\">HERE</a> and <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3367725-1&amp;h=105179908&amp;u=https%3A%2F%2Famzn.to%2FAmazonOriginalMusicVideo&amp;a=HERE\" data-type=\"url\" class=\"tr-link\" translate=\"no\">HERE</a>\n</p>\n<p>\n<span>SEATTLE</span> , <span>Nov. 22, 2021</span> /CNW/ - Amazon Music announced today an exclusive new version of \"Christmas Tree Farm\" from 11-time Grammy winner, and only woman to ever win Album of the Year <span> three times, <span>Taylor Swift</span> . \"Christmas Tree Farm (Old Timey Version)\" arrives just in time for the holidays and fresh off of her #1 record-breaking release of <span>Red (Taylor's Version).</span> Swift's reimagined version of her beloved holiday hit was recorded at Abbey Road Studios in <span>London</span> and features a beautiful new arrangement backed by a 70-piece orchestra. Swift's \"Christmas Tree Farm (Old Timey Version) (Amazon Original)\" is now available exclusively for all Amazon Music listeners globally, including in spatial audio with Dolby Atmos <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3367725-1&amp;h=2400101424&amp;u=https%3A%2F%2Famzn.to%2FAmazonOriginal&amp;a=here\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a> .</span></p>\n<p>\" <span>Taylor Swift</span> is an icon who has shattered streaming records on Amazon Music over the years, and this season, we're thrilled to bring this new, timeless version of 'Christmas Tree Farm' to her fans as they gather with friends and family for the holidays,\" said <span>Ryan Redington</span> , VP of music industry at Amazon Music.</p>\n<p>Inspired by her youth growing up on a Christmas tree farm in <span>Pennsylvania</span> , Swift wrote \"Christmas Tree Farm\" while celebrating with family over the holidays in 2019. While fans know and love the booming, upbeat version of \"Christmas Tree Farm,\" Swift wanted to capture the cozy and calming holiday atmosphere for her Amazon Original song. Joined by a 70-piece orchestra at Abbey Road Studios, Swift's new recording features strings, horns, and sleigh bells, reminiscent of classic, big band Christmas songs by the greats before her.</p>\n<p>Earlier this month, Amazon Music announced its biggest season of holiday programming yet, with a variety of new Amazon Original songs, including <span>Camila Cabello's</span> cover of \"I'll Be Home for Christmas,\" a fresh original song from Dan + Shay called \"Pick Out a Christmas Tree,\" <span>Leon Bridges'</span> reimagined version of <span>Marvin Gaye's</span> \"Purple Snowflakes,\" Sech's new original song, \"Carta Navideña,\" <span>George Ezra's</span> \"Come on Home for Christmas,\" and much more. Today, Swift's \"Christmas Tree Farm (Old Timey Version) (Amazon Original)\" arrives on the global playlist \" <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3367725-1&amp;h=3289850653&amp;u=https%3A%2F%2Famzn.to%2FMerryMix&amp;a=Merry+Mix\">\n<span>Merry Mix</span>\n</a> ,\" which features all new Amazon Original songs for the season, in addition to iconic holiday classics. For a limited time, customers who haven't yet tried Amazon Music Unlimited can get three months free—with unlimited access to millions of songs, ad-free, in the highest-quality streaming audio and millions of podcast episodes.</p>\n<p>\n<span>About Amazon Music</span> Amazon Music reimagines music listening by enabling customers to unlock millions of songs and thousands of curated playlists and stations with their voice. Amazon Music provides unlimited access to new releases and classic hits across iOS and Android mobile devices, PC, Mac, Echo, and Alexa-enabled devices including Fire TV and more. With Amazon Music, Prime members have access to ad-free listening of 2 million songs at no additional cost to their membership. Listeners can also enjoy the premium subscription service, Amazon Music Unlimited, which provides access to millions of songs and the latest new releases. Amazon Music Unlimited customers also now have access to the highest-quality listening experience available, with millions of songs available in High Definition (HD), more than 7 million songs in Ultra HD, and a growing catalog of spatial audio. Customers also have free access to an ad-supported selection of top playlists and stations on Amazon Music. All Amazon Music tiers now offer a wide selection of podcasts at no additional cost, and live streaming in partnership with Twitch. Engaging with music and culture has never been more natural, simple, and fun. For more information, visit <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3367725-1&amp;h=1959540376&amp;u=https%3A%2F%2Fwww.amazonmusic.com%2F&amp;a=amazonmusic.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazonmusic.com</a> or download the Amazon Music app.</p>\n<p>\n<span>About Amazon</span> Amazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth's Most Customer-Centric Company, Earth's Best Employer, and Earth's Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3367725-1&amp;h=674282250&amp;u=https%3A%2F%2Fcts.businesswire.com%2Fct%2FCT%3Fid%3Dsmartlink%26url%3Dhttp%253A%252F%252Famazon.com%252Fabout%26esheet%3D52502691%26newsitemid%3D20211004005290%26lan%3Den-US%26anchor%3Damazon.com%252Fabout%26index%3D38%26md5%3D74882eba96f06b14403e34cb081c5f88&amp;a=amazon.com%2Fabout\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.</p>\n<p>SOURCE Amazon Canada</p>\n<p>View original content: <a href=\"http://www.newswire.ca/en/releases/archive/November2021/22/c0416.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/November2021/22/c0416.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 CNW Group Ltd.</p></div>"}