{"date": "2021-12-13 13:41:05.766000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ELSE NUTRITION HOLDINGS INC (\"BABY-V;BABYF-0\")\n- Awarded Prestigious World Plant Based Award for 2021\n- in Best Dairy Product Alternative Category\n\n     ELSE NUTRITION HOLDINGS INC. (\"Else\" or the \"Company\") the Plant-Based\nbaby, toddler and children nutrition company, announced that is has\nreceived the World Plant Based 2021 Award for its Plant-Based Complete\nNutrition for Toddlers, as Best Dairy Product Alternative. The Award was\nannounced this week at Plant Based World Expo in New York city.\n\n     The World Plant-Based Awards, in association with Plant Based World\nExpo and FoodBev Media, are a celebration of innovation and excellence\nacross the Plant-Based food and drink industry, honoring top innovative\nbrands in the sector. Else was amongst dozens of candidates in the dairy\nproduct alternative category.\n\n     \"We're thrilled and humbled by this honor by Plant Based World Expo,\"\nsaid Hamutal Yitzhak, CEO &amp; Co-Founder of Else Nutrition. \"We continue to\nreceive an outpour of very touching stories from parents, expressing what a\ndifference our products are making in their families, and especially for\ntheir little ones. This makes it all worthwhile,\" she added.\n     Since launching its Plant-Based Complete Nutrition for Toddlers, which\nwon the Good Housekeeping Parenting Award for 2021, the brand has received\nover whelming powerful testimonials and reviews from moms. It has gained\nnational retailer support through Sprouts Farmers Market, becoming the #1\nBest Seller on Amazon in Fall of 2020 in the New Baby &amp; Toddler Formula\nproducts Category.\n\n     About Else Nutrition Holdings Inc.\n\n     Else Nutrition GH Ltd. is an Israel-based food and nutrition company\nfocused on developing innovative, clean and plant-based food and nutrition\nproducts for infants, toddlers, children, and adults. Its revolutionary,\nplant-based, non-soy, formula is a clean-ingredient alternative to\ndairy-based formula. Else Nutrition (formerly INDI) won the \"2017 Best\nHealth and Diet Solutions\" award at the Global Food Innovation Summit in\nMilan. Else Plant-Based Complete Nutrition for Toddlers was recently ranked\nas the #1 Top seller in the baby and toddler formula category on Amazon.\nThe holding company, Else Nutrition Holdings Inc., is a publicly traded\ncompany, listed as TSX Venture Exchange under the trading symbol BABY and\nis quoted on the US OTC Markets QX board under the trading symbol BABYF and\non the Frankfurt Exchange under the symbol 0YL. Else's Executives includes\nleaders hailing from leading infant nutrition companies. Many of Else\nadvisory board members had past executive roles in companies such as Mead\nJohnson, Abbott Nutrition, Plum Organics and leading infant nutrition\nSocieties, and some of them currently serve in different roles in leading\nmedical centers and academic institutes such as Boston Children's Hospital,\nPediatrics at Harvard Medical School, USA, Tel Aviv University, Schneider\nChildren's Medical Center of Israel, Rambam Medical Center and Technion,\nIsrael and University Hospital Brussels, Belgium.\n\n     For more information, visit: elsenutrition.com or @elsenutrition on\nFacebook and Instagram.\n\nContact:\nCallie Rapp\nBrilliant PR\ncallier@brilliantprm.com\n\nContact:\nMrs. Hamutal Yitzhak, CEO, Co-Founder &amp; Director\nELSE Nutrition Holdings Inc.\nE: hamutaly@elsenutrition.com\nP: +972(0)3-6445095\n\nMr. Sokhie Puar, Lead Director of Else Nutrition\nEmail: sokhiep@elsenutrition.com\nP : 604-603-7787\n\nUS Investor Relations Contact:\n\nLytham Partners, LLC\nMr. Ben Shamsian\nNew York | Phoenix\nE: shamsian@lythampartners.com\nP: 646-829-9701\n\n     TSX Venture Exchange\n\n     Neither the TSX Venture Exchange nor its regulation services provider\n(as that term is defined in the policies of the TSX Venture Exchange)\naccepts responsibility for the adequacy or accuracy of this release.\n\n     Caution Regarding Forward-Looking Statements\n\n     This press release contains statements that may constitute\n\"forward-looking statements\" within the meaning of applicable securities\nlegislation. Forward-looking statements are typically identified by words\nsuch as \"will\" or similar expressions. Forward-looking statements in this\npress release include statements with respect to the anticipated dates for\nfiling the Company's financial disclosure documents. Such forward-looking\nstatements reflect current estimates, beliefs and assumptions, which are\nbased on management's perception of current conditions and expected future\ndevelopments, as well as other factors management believes are appropriate\nin the circumstances. No assurance can be given that the foregoing will\nprove to be correct. Forward-looking statements made in this press release\nassume, among others, the expectation that there will be no interruptions\nor supply chain failures as a result of COVID 19 and that the\nmanufacturing, broker and supply logistic agreement with the Company do not\nterminate. Actual results may differ from the estimates, beliefs and\nassumptions expressed or implied in the forward-looking statements. Readers\nare cautioned not to place undue reliance on any forward-looking\nstatements, which reflect management's expectations only as of the date of\nthis press release. The Company disclaims any obligation to update or\nrevise any forward-looking statements, whether as a result of new\ninformation, future events or otherwise, except as required by law.\n\nWebsite: <a href=\"https://www.elsenutrition.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.elsenutrition.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134600066.MNPRE2134600811-05212120211213</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}