{"date": "2022-02-13 05:06:36.848000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3065.87, "close": 3130.21}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The manager of Social Development of the Regional Government of Ucayali made an unexpected visit to the Yarinacocha Amazon Hospital; in order to identify the problems they present in medical equipment and infrastructure to contribute to their solution and provide better care to patients.</p><p>In this sense, he met with the director of the Hospital, Deputy Manager of Human Development and health personnel; taking a tour of the social security and intensive care unit areas, where each head in charge showed the conditions in which the medical equipment, protection for health personnel, surgical tables, automatic ventilators and patient beds are found.</p></div><div class=\"tr-npp-body\"><p>The Director of the Amazon Hospital, Medical Surgeon Ronald Rodr?guez Panduro, requested the Social Development Manager, the improvement and incorporation of 5 ventilators for adults, 4 pediatric ventilators, ICU beds to deal with COVID19 in the face of the third wave of contagion, also the requirement of anesthesia machines and the request for an agreement with the National University of Ucayali for the opening of specialization courses in surgery, neurosurgery, cardiovascular surgery, among others in the professional career of Human Medicine.</p><p>The Amazon Hospital, also called the Hospital Amigos, announced that, thanks to the campaigns carried out in November 2021, 38 children with cleft lips were intervened and that in January and April of this year the traumatology campaign; Finally, the director of the Amazon Hospital thanked the Regional Government of Ucayali for visiting and prioritizing the health sector in favor of the population.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Euclid Infotech Pvt Ltd.</p></div>"}