{"date": "2021-10-25 14:42:19+00:00", "ticker": "ABDN", "mrkt_info": {"open": 256.9, "close": 258.9}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Tatiana Bautzer</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">SAO PAULO, Oct 25 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Brazilian private equity firm Tarpon Capital will try to sell its private renewable energy company Omega Desenvolvimento if a proposed merger with listed Omega Geracao SA <a href=\"reuters://REALTIME/Verb=FullQuote/ric=OMGE3.SA\" data-type=\"ric\" data-ric=\"OMGE3.SA\" translate=\"no\" dir=\"ltr\">OMGE3.SA</a> fails, two sources with knowledge of the matter said.</p><p>A shareholder meeting is scheduled for Thursday to vote on the proposed terms for a merger between Omega Geracao, which operates renewable energy generation assets, and Omega Desenvolvimento, which has renewable energy projects under construction.</p><p>Tarpon, a controlling shareholder in both the private and the listed firms, is not going to vote in the assembly. Minority shareholders have questioned the deal saying the valuation of Omega Desenvolvimento was too high.</p><p>In discussions with minority shareholders, Tarpon has agreed to reduce the initial proposed value of 2.7 billion reais ($479 million) to 2 billion reais. But now some minority shareholders led by asset managers Squadra and IP Capital want an additional price cut and Tarpon does not agree with it, the sources said, asking for anonymity to disclose private discussions.</p><p>If the deal is rejected, Tarpon is expected to look for a buyer to the company, the sources said. Banco BTG Pactual, which was hired by Tarpon to negotiate the deal terms with minority shareholders in Omega Geracao, will get a sale mandate if the merger does not pass through the assembly.</p><p>Omega Geracao, Tarpon and BTG Pactual did not immediately comment on the matter.</p><p>     </p><p>($1 = 5.6404 reais)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Tatiana Bautzer; editing by David Evans)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:tatiana.bautzer@tr.com\" data-type=\"email\" translate=\"no\">tatiana.bautzer@tr.com</a> ; Tel: +55-11-5644-7756; Mob: +55-119-4210-4173; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://tatiana.bautzer.thomsonreuters.com@reuters.net\">tatiana.bautzer.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: OMEGA DESENVOLVIMENTO-M&amp;A/</p></div>"}