{"date": "2022-02-02 06:20:49.228000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Feb. 2 -- Supreme Court on Wednesday agreed to hear on 8 February Amazon's plea challenging the Delhi High Court's division bench order that stopped the arbitration proceedings between Future Retail and Amazon.</p><p>The Delhi high court last month stayed the Amazon-Future arbitration which is going on before a three-member arbitral tribunal over the latter's Rs.24,500-crore deal with Reliance.</p></div><div class=\"tr-npp-body\"><p>The high court also stayed a single judge's January 4 order that had dismissed the Future Group's two pleas seeking a direction to the arbitration tribunal, adjudicating Amazon's objections against the former's deal with Reliance, to take a decision on its application for terminating the arbitration proceedings before moving further.</p><p>A bench of Chief Justice D.N. Patel and Justice Jyoti Singh said there is a prima facie case in favour of appellants Future Retail Ltd (FRL) and Future Coupons Pvt Ltd (FCPL) and if a stay is not granted, it will cause an irreparable loss to them.</p><p>Amazon and the Future Group have been locked in a bitter legal tussle after the US e-commerce giant dragged the latter to arbitration at the Singapore International Arbitration Centre (SIAC) in October 2020. Amazon argued that FRL violated their contract by entering into a deal for the sale of its assets to billionaire Mukesh Ambani's Reliance Retail on a slump sale basis for Rs.24,500 crore. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}