{"date": "2021-11-29 22:06:30+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds details of decision, background on Amazon</p><p class=\"tr-by\">By Julia Love and Jeffrey Dastin</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">SAN FRANCISCO, Nov 29 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>A regional director for the U.S. National Labor Relations Board on Monday called for a rerun of a union election at an Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> facility in Alabama, setting the stage for another high-profile organizing battle at the world's largest online retailer.</p><p>Workers at the warehouse in Bessemer, Alabama, rejected forming a union by a more than 2-to-1 margin in April after an organizing drive that garnered support from U.S. lawmakers and President Joe Biden. In August, an NLRB hearing officer said the company's conduct around the previous vote had interfered with the election.</p><p>The decision for a redo adds pressure on Amazon, which has recently faced union campaigns in New York and Canada. Worker groups view organizing the company as a landmark goal that would invigorate the U.S. labor movement.</p><p>“Today’s decision confirms what we were saying all along – that Amazon’s intimidation and interference prevented workers from having a fair say in whether they wanted a union in their workplace,\" Stuart Appelbaum, president of the Retail, Wholesale and Department Store Union (RWDSU), said in a statement.</p><p>Amazon spokesperson Kelly Nantel said in a statement that the company's employees overwhelmingly voted against joining the RWDSU this year. \"It’s disappointing that the NLRB has now decided that those votes shouldn’t count.\"</p><p>Amazon and the RWDSU have already restarted their campaigns in anticipation of a second election. The company <a href=\"https://www.reuters.com/business/retail-consumer/amazon-takes-another-swipe-union-alabama-rematch-looms-2021-11-04\" data-type=\"url\" class=\"tr-link\" translate=\"no\">has forced thousands of employees</a> to attend meetings about unions and posted signs critical of unions in bathrooms.</p><p>In Monday's decision, the NLRB regional director said that Amazon \"engaged in objectionable conduct that warrants setting aside the election.\"</p><p>The decision pointed to moves by the company encouraging staff to vote via a mailbox it had the Postal Service install at its warehouse, surrounding the mailbox with its campaign slogan and locating it where workers may have thought Amazon was surveilling them.</p><p>The NLRB decision did not specify the second election's date or whether the vote will take place by mail or in person.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Julia Love and Jeffrey Dastin in San Francisco<br/>Editing by Peter Henderson and Matthew Lewis)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:peter.henderson@thomsonreuters.com\" data-type=\"email\" translate=\"no\">peter.henderson@thomsonreuters.com</a> ; 323 251 4827; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-LABOR/ (UPDATE 2, PIX)</p></div>"}