{"date": "2021-12-07 19:12:19.540000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>APHEX BIOCLEANSE SYSTEMS INC (\"SNST-0\")\n- Engages Milestone Management Services\n\n     Aphex BioCleanse Systems, Inc. a forward-thinking, publicly traded\ncompany, announced it has reached an agreement to engage Milestone\nManagement Services to join their Corporate Communications and Investor\nAwareness team.\n\n     Aphex is working systematically to finalize the auditing process in\norder to file their S1 Registration with the SEC over the next few weeks,\nwhich will result in the company being fully audited.\n\n     Milestone will assist with Aphex's communications efforts to educate\nthe public about their proven, validated, non-toxic, alcohol-free Hy-IQ(R)\ncleaning water and the sustainable bioFOAM(TM) Open-cell Foam Technology:\nHy-IQ / bioFOAM.\n\n     Two revolutionary technologies combined to provide Sustainability\nwithout Compromise(TM), which means the best available technology to\npreserve and protect human health from harmful pathogens/germs while\npreserving and protecting the environment from single-use plastics and\npaper towels that are deactivating disinfectants leading to the spread of\ndangerous pathogens and needlessly filling landfills and contaminating the\nenvironment.  For recent media coverage, see this link:  bioFOAM Media\nInterviews.\n\n     bioFOAM(TM) was originally developed in 2002 for the U.S. military as\na lotion-infused high surface area applicator for neutralizing chemicals on\nhuman skin. In 2010, this technology was used by BP America in the cleanup\nof the BP oil spill in the Gulf of Mexico. Additionally, bioFOAM(TM) was\nvalidated by Center for Disease Control's (CDC) Environmental Legionella\nIsolation Techniques Evaluation (ELITE) Labs in 2018 for water sampling for\npathogens.\n\n     The product line includes bioFOAM(TM) face masks (bioSHIELD(TM)),\nWipes, Mitts, and Sponges and the non-toxic, chemical-free Green Earth Pet\nproduct line: Hy-IQ Green Earth Pet. These offerings are reusable,\nbiodegradable, and water-immersible with antimicrobial properties\n\n     \"I'm very impressed with the proprietary, patented, and patent-pending\ntechnology Aphex BioCleanse Systems developed and owns. The value of their\nnon-toxic, chemical-free, sustainable, and proven green product lines,\nwhich are much safer for people and the environment are a game changer. The\ncompany is currently in the process of rebranding to better reflect their\nposition as a biotech company. The rebrand will also include a proposed\nname and ticker symbol change. Aphex has just started to scratch the\nsurface in their revenue upside regarding E-commerce sales with platforms\nlike Amazon, consumer, and business to business while simultaneously\nexploring licensing opportunities,\" said Jon Olson, CEO with Milestone\nManagement Services.\n\n      About Milestone Management Services (MMS):\n\n     Milestone provides Micro-Cap and Small-Cap companies with Strategic\nAdvisory, Financial Public Relations, Investor Relations and Media\nServices. MMS helps companies add and maintain value in the market.\nMilestone directs efficient and effective conversations that drive business\nobjectives, enhance reputations, and build meaningful relationships with\nentrepreneurs, venture capitalists, along with institutional and high-level\nretail investors.\n\n     <a href=\"https://milestonemanagementservices.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://milestonemanagementservices.com</a>/\n\n     About Aphex BioCleanse Systems, Inc.:\n\n     Aphex BioCleanse Systems, Inc. is the developer of the world's first\nproprietary non-alcohol, non-toxic, hydrogen-based cleaning technology, and\nhas been producing germ killing solutions for over 10 years. The\ntechnology, called Hy-IQ(R) Water, has a unique method of sanitizing that\nuses hydrogen ions traveling nearly at the speed of light to breach the\ncell walls of exoskeleton germs. \"We Kill Germs with Physics, Not\nChemistry\" is a tagline that expresses their commitment to the environment\nby providing non-Chemical solutions to the spread of dangerous pathogens.\nKilling the most dangerous germs on the planet, while meeting the EPA's\ndefinition of \"Water\" is revolutionary. With world leading teams and\ntechnology, Aphex is doing its part to make the world a safer place. To\nfind out more about Aphex and their technologies, visit: Aphex BioCleanse\nSystems, Inc. - Superior Sanitization (aphexus.com).\n\n     Forward Looking Statements:\n\n     This current press release contains \"forward-looking statements,\" as\nthat term is defined in Section 27A of the United States Securities Act of\n1933 and Section 21E of the Securities Exchange Act of 1934. Statements in\nthis press release which are not purely historical are forward-looking\nstatements and include any statements regarding beliefs, plans,\nexpectations, or intentions regarding the future, including but not limited\nto, any products sold or cash flow from operations. Actual results could\ndiffer from those projected in any forward-looking statements due to\nnumerous factors. Such factors include, among others, the inherent\nuncertainties associated with distribution and difficulties associated with\nobtaining financing on acceptable terms. These forward-looking statements\nare made as of the date of this news release, and we assume no obligation\nto update the forward-looking statements, or to update the reasons why\nactual results could differ from those projected in the forward-looking\nstatements. Although we believe that the beliefs, plans, expectations, and\nintentions contained in this press release are reasonable, there can be no\nassurance that such beliefs, plans, expectations, or intentions will prove\nto be accurate. Investors should consult all the information set forth\nherein and should also refer to our most recent annual report for our last\nfiscal year, our quarterly reports, and other periodic reports filed from\ntime-to-time with the Securities and Exchange Commission.\n\n Contact Information:\n\nContact:\n\n     Jon Olson, CEO\n\n     Milestone Management Services\n\n     Jon@milestonemanagementservicesllc.com\n\n     702-217-9518\n\n     <a href=\"https://aphexus.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://aphexus.com</a>/\n\nTel   : 585-798-7775    SUNSET CAPITAL ASSETS INC\nFax   : 888-772-8228\nWWW   : <a href=\"https://www.aphexus.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.aphexus.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134000473.MNPRE2134002792-10444720211207</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}