{"date": "2021-11-05 00:06:11.385000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3384.0, "close": 3518.99}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_1efs53i0&amp;referenceId=1_1efs53i0&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_1efs53i0&amp;referenceId=1_1efs53i0&amp;pageId=RefinitivNewscasts</a></pre>Source: Stocktube<br/><br/>Description: GreenBank Capital Inc CEO Terry Pulled tells Proactive that its portfolio company CodiKoat has beaten a very strong field to win a nationwide competition in the UK designed to find the best solutions to provide clean air in residential environments.&amp;#xD;&amp;#xD;Pullen says CodiKoat was one of 49 companies that took part in a competition by Innovate UK, a non-departmental public body seeking to help solve the serious problem of nitrous oxide and sulphur dioxide gases as well as particulate matter.  What's more, CodiKoat has appointed Philip Green as its CFO. Green is the former Amazon CFO for the Europe, Middle East, and Africa regions.<br/>Short Link: <a href=\"https://refini.tv/3wgJ1OI\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3wgJ1OI</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; Hello and welcome back to Proactive New York. With me this afternoon is Terry Pullen, CEO at Greenbank Capital. Terry, good to see you again. How are you? &gt;&gt; I'm really good Christine. Thank you for inviting me. Your time is always a pleasure. &gt;&gt; Always good to see you, Terry. Terry, the last time we spoke was quite recently on Cody Codes recent achievements regarding its pilot tests. We're now seeing that it has gone on to win an innovation grant from the UK government. Tell me a bit about the competition that it was involved in. &gt;&gt; Yeah. Thank you. Yes, we're very excited. We really are. Frankly, if you don't mind we truly like to congratulate the team. It's been a thank you task over the pandemic and the team of scientists [inaudible 00:00:52] have done a phenomenal job. Part of that job is to continue to develop the biotech company but to continue to develop it in ways that can lead to truly world-leading technology. Then can be commercialized at some point. What's that well they actually applied to be a part of, was a competition by Innovate UK. Innovate UK is actually backed by the UK government and there were 49 parties that were invited to be a part of this application for effect of one million pounds grant to provide technology solutions. We were pleased to say, I got a great call from Raj the CEO on Monday morning to say they got down to the six, which we knew last week. Then from Monday, they'll be given the actual green light that they was the number one choice for Innovate UK for the grant to provide technology solutions to this particular space that the government require. &gt;&gt; That must have been such an exciting call. What do you think Innovate UK liked best about Cody Code. &gt;&gt; I think the clarity with which Cody Codes come to market with and come to the biotech space with ideas that are then deliverable. There's a **** of a lot of tech out there. It's very clever but ultimately, it may not ever come to fruition. It may not be delivered. We believe that the pitch and the extensive competition rules provided lots of different questions, lots of different areas that are specific, measurable and is this is tech achievable and compatible to the market space. Clearly, no man says so, no Cody Code says so. Innovate UK effectively and manages its government, they believed that they were the number one to deliver on those objectives. &gt;&gt; Now that Cody Code does have this grant money from Innovate UK, what are the next steps here? What does commercialization look like? &gt;&gt; Well, if I may Christine, I'd like to add another huge piece of news in now that we were very fortunate enough to support and be able to provide. Which is the recruitment of a globally successful, well-known CFO, which is Philip Green. Phillip Green's recruitment is another huge feather in the cap. Not just a credibility for Cody Codes and Raj and his team, but a huge another layer of experience. What that experience will enable the company to do is to scale up with the benefit of frankly, an amazing contact book of people that are used to dealing with the ex CFO of Amazon, the ex CFO of Deliveroo. These are brands and companies that only hire the best and Philip Green is certainly one of the best and as a testament to his desire and his impression of how Cody Code can come to market. I just wanted to add that piece of news because companies and the success of companies is obviously all about people as well. Once you've got the tech that Cody Code have got and they've now got somebody else on their board that is able to truly give them a broad range of experience and talent to help that commercialization. &gt;&gt; Yeah, definitely a big name there. What would be the next step? What is the go to market strategy? &gt;&gt; Well, the commercialization strategy going with Cody Code is something that's quite broad. I believe that's something that again is that's what interested Greenbank Capital to supporting and investing into Cody Code. We loved the range of commercial applications that they have available and if one was to take one of their products, for example, Cody touch. Cody touch has the applications, if we think about the pandemic that we've been through and the way that people after seeing viruses and antiviruses going forward, we have the ability with Cody Touch, to think about touch screens, to think about smart phones, to think about surgical gloves, to think about catering and health care. The health care market alone in respect to the responsibilities and accountabilities to stop the spread of viruses. It gives that one product of Cody Codes which can touch huge, huge market opportunities and that's one product. We then have a situation whereby there's the air filtration. Clean air. Now, clearly we all need it. It's pretty important to a lot us. But in today's world, the ability to effectively achieve clean air opens up opportunities in the airline industry, offices, leisure facilities, and as such anywhere where we want to breath clean and fresh air and that was one of the big ticks in the box for Innovate UK, to develop that form of product and there are other products. Hopefully that will give you a flavor to see that the opportunities are so broad. Which again is why Greenbank Capital are pleased to be a part of it. &gt;&gt; Yeah. Again, congrats on this grant money. We're looking forward to seeing how it progresses. Terry, thanks a lot. &gt;&gt; Thank you.<br/></span></div></div></div></div>"}