{"date": "2021-11-22 20:07:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        Over the past several decades, we have seen the rise of superstar firms such as Google, Amazon, and Apple. In my <a href=\"https://drive.google.com/file/d/1kKUsUej8cTfEbAQuGG_UsvZD04j1aRQ8/view\" data-type=\"url\" class=\"tr-link\" translate=\"no\">job market paper</a>, I investigate how these superstars affect the macroeconomy. Some existing works focus on the impact of these firms on labor share (for example, Autor et al. 2020) or business dynamism (for example, de Ridder 2019). In this paper, I investigate their impact on misallocation through a new endogenous firm-market boundary perspective.\n      </p>\n              </div>\n              <div>\n      Image\n    </div>\n              <div>\n                <p>\n        The idea is based on Coase's (1937) seminal work on the theory of the firm. Coase argues that firms and the market are two different allocation systems in the economy. The goal of the market system is to allocate resources to the most productive users through the price mechanism. Nevertheless, it is not the goal of firms. Suppose we follow his interpretation and observe the increasing importance of firms. In that case, the relative importance of the market system must have been declining. Due to the different natures of these two systems, we should observe changes in the degree of misallocation in the economy during this process. More specifically, in my job market paper, the firm-market boundary is on the financing side. The corporate behavior on which I focus is the increasing corporate cash holdings. If we simply look at this phenomenon from an individual firm's perspective, then it is possible that changes in some economic environments make firms optimally choose to save more internally. However, from a macro perspective, when firms are replacing internal financing with external financing, it means that firms are replacing the market system for allocating resources.\n      </p>\n                <p>\n        The paper has four parts: motivating facts, theory, reduced-form evidence, and quantitative analysis. I start by showing that since the 1980s, the efficiency of capital allocation has been deteriorating in the United States. There are three main findings. First, the dispersion of the marginal product of capital increased sharply among US public firms. Second, the correlation between firm-level total factor productivity and external financing dependence has changed from positive to negative, implying that less external financing is associated with productive firms. Third, the positive gap between the marginal product of capital and the real interest rate has increased over time. These facts suggest that <span><a href=\"https://twitter.com/intent/tweet?text=capital+markets%27+allocational+inefficiency+has+increased+over+time&amp;url=https://blogs.worldbank.org/allaboutfinance/rise-superstar-firms-and-fall-price-mechanism/?cid=SHR_BlogSiteTweetable_EN_EXT&amp;via=worldbank\" data-type=\"url\" class=\"tr-link\" translate=\"no\">capital markets' allocational inefficiency has increased over time</a></span> , as an efficient financial market should imply zero dispersion in the marginal product of capital, more resource allocation to productive users, and equality between the marginal return of investment and its marginal cost.\n      </p>\n                <p>\n        Then I put forward a theoretical model to rationalize these facts. I incorporate product market competition and corporate risk management into a standard heterogeneous agent model with incomplete markets. The model has several important implications. First, the incomplete market assumption and monopolistic competition generate a \"winners-take-most\" phenomenon but also make current winners bear more volatile income fluctuations in the future. The mechanism comes from the fact that some fundamental economic changes can lead to both income and risk redistributions in a superstar economy. Compared with the low-concentration traditional economy, what is special about the superstar economy is that a relatively small number of firms can obtain enormous earnings. At the same time, superstars are inherently risky because a small variation in their ability can translate into considerable earnings fluctuations. Second, this risk-redistribution nature of economic fundamental changes makes firms optimally rely more on internal financing, especially for superstars, as their expected future earnings are riskier. Third, the expansion of the self-financing region increases capital misallocation in this economy, as the marginal cost of financing is not equalized when companies save resources internally. Thus, different from the conventional wisdom that self-financing can undo misallocation (for example, Moll 2014), in my paper, an expansion of the internal financing region lowers the aggregate capital allocation efficiency.\n      </p>\n                <p>\n        Furthermore, I test some of the key model predictions in the data. Consistent with the model, I find that (i) superstar firms are indeed riskier as they have higher markup volatilities, (ii) superstar firms have higher degrees of capital misallocation and have faced a rapid increase in misallocation since the 1980s, and (iii) there is a positive and significant relationship between firms' cash-to-asset ratio and markup. These results lend support to the model mechanism.\n      </p>\n                <p>\n        Finally, I investigate the quantitative implications of the model. By estimating the model using the simulated method of moments, I show that the model can quantitatively match the declining efficiency of capital allocation in the data. More importantly, it shows that the effectiveness of the market system, computed as the wealth-weighted ratio of firms using external financing, has declined by about 11% over the past 40 years. These quantitative results provide a different view on the origins of misallocation. The marginal product of capital dispersion could come from distortion within the market system (for example, Hsieh and Klenow 2009) or an endogenously moving firm-market boundary. In addition, the paper extends Piketty's (2013) R-g framework on inequality to allow for the existence of two types of capital returns (two R's). One is the capital return of entrepreneurs who are still relying on the external financial market to finance their investment, and the other is that of entrepreneurs who are not.\n      </p>\n                <p>\n        To conclude, my job market paper shows that <span><a href=\"https://twitter.com/intent/tweet?text=changes+in+economic+fundamentals+have+brought+the+rise+of+superstar+firms+and+impaired+the+price+mechanism&amp;url=https://blogs.worldbank.org/allaboutfinance/rise-superstar-firms-and-fall-price-mechanism/?cid=SHR_BlogSiteTweetable_EN_EXT&amp;via=worldbank\" data-type=\"url\" class=\"tr-link\" translate=\"no\">changes in economic fundamentals have brought the rise of superstar firms and impaired the price mechanism</a></span> . In terms of the policy implications, this paper points out two types of market failures in the superstar economy. First, the boundary of the price mechanism is shrinking. Increasing internal financing of companies also makes them less disciplined by the market. The massive corporate cash savings prevent firms from being disciplined by the market system. Second, as both risk and profits are redistributed to productive firms, these superstar firms have less incentive to invest, leading to a secular decline in business dynamism. The government's role as the visible hand in the new economy and other normative works exploring the optimal policies are left for future research.\n      </p>\n                <p>\n                  <strong>References</strong>\n                </p>\n                <p>\n        Autor, David, David Dorn, Lawrence F. Katz, Christina Patterson, and John Van Reenen. 2020. \"The Fall of the Labor Share and the Rise of Superstar Firms.\" <span>Quarterly Journal of Economics</span>, 135(2): 645-709.\n      </p>\n                <p>\n        Coase, Ronald. 1937. \"The Nature of the Firm.\" <span>Economica</span>, 4(16): 386-405.\n      </p>\n                <p>\n        De Ridder, Maarten. 2019. \"Market Power and Innovation in the Intangible Economy.\"\n      </p>\n                <p>\n        Hsieh, Chang-Tai, and Peter J. Klenow. 2009. \"Misallocation and Manufacturing TFP in China and India.\" <span>Quarterly Journal of Economics</span>, 124(4): 1403-1448.\n      </p>\n                <p>\n        Moll, Benjamin. 2014. \"Productivity Losses from Financial Frictions: Can Self-Financing Undo Capital Misallocation?\" <span>American Economic Review</span>, 104(10): 3186-3221.\n      </p>\n                <p>\n        Piketty, Thomas. 2013. Capital in the Twenty-First Century. Harvard University Press.\n      </p>\n                <h4>\n                  <span>Dan Su is a PhD candidate in Finance at Carlson School of Management, the University of Minnesota. More about his research can be found <a href=\"https://stanleydansu.github.io/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a>.</span>\n                </h4>\n              </div>\n              <div>\n                <div>\n        Topics\n      </div>\n                <div>\n                  <a href=\"https://blogs.worldbank.org/search?f[0%5D=topic:293&amp;f[1%5D=language:en\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Financial Sector</a>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://blogs.worldbank.org/allaboutfinance/rise-superstar-firms-and-fall-price-mechanism\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>World Bank Group</strong> published this content on <strong>22 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>22 November 2021 20:07:00 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - World Bank Group</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: World-Bank-Group</p></div>"}