{"date": "2021-12-14 13:58:57.033000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_imxptzrd&amp;referenceId=tag:reuters.com,2021:newsml_OVF80LN63_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_imxptzrd&amp;referenceId=tag:reuters.com,2021:newsml_OVF80LN63_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: The U.S. workplace safety watchdog is investigating the circumstances around the collapse during Friday night's storm of an Amazon.com Inc building in Illinois in which six workers died, an official at the U.S. Department of Labor said on Monday. Gloria Tso reports.<br/>Short Link: <a href=\"https://refini.tv/3EV5jsU\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3EV5jsU</a><br/><br/>Video Transcript:<br/><br/>Amazon is being investigated for a deadly warehouse collapse after tornadoes tore through the American Midwest last weekend. The U.S. workplace safety watchdog has six months to look into whether workplace safety and/or health regulations were violated. Six workers were killed after a tornado struck the building in Edwardsville, Illinois on Friday evening, with peak winds at an estimated 150 miles per hour. Several employees told Reuters over the weekend that Amazon managers had directed workers to shelter in bathrooms after receiving emergency alerts on their mobile phones. At least one worker died there, according to his co-worker. Meanwhile, some of the workers said they had their mobile phones despite what they believed to be a company policy preventing them from having them at work. Amazon says there was no such policy, and that employees were told to shelter in place at a designated assembly area near a restroom at the front of the building. At least 45 Amazon employees made it out safely. Amazon has pledged to cooperate with the investigation and officers are already on site at the destroyed warehouse.<br/></span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}