{"date": "2021-06-01 09:55:38+00:00", "ticker": "III", "mrkt_info": {"open": 1261.0, "close": 1244.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><h4>\n      George Best Belfast City Airport announces incoming CEO\n    </h4><p><strong>George Best Belfast City Airport is pleased to announce the appointment of Matthew Hall as Chief Executive, effective from 1 August 2021. He will take over from longstanding CEO Brian Ambrose, who announced in February this year that he will be retiring this summer.</strong></p><p>\n      Matthew will bring a wealth of experience to the airport from his time as Commercial Director at David Lloyd and as Chief Commercial Officer of London City Airport.\n    </p><p>\n      His previous experience also includes executive roles at American Airlines, where he was Managing Director, Sales &amp; Marketing, EMEA, and Vice President at Travelport.\n    </p><p>\n      Declan Collier, Chairman, Belfast City Airport commented:\n    </p><p>\n      'We are delighted that Matthew will come to Belfast City Airport to lead the post COVID-19 restart and recovery and to enhance the airport's position within the UK market. Matthew's extensive experience within the aviation sector and, in particular, his knowledge of developing and commercialising a similar city centre airport, will be hugely valuable to Belfast City Airport.\n    </p><p>\n      'I would also like to thank Brian for his leadership and achievements over the past 16 years during which time he developed Belfast City Airport into Northern Ireland's airport of choice.\n    </p><p>\n      'His strategic guidance has been exceptional, and he will leave having ensured the airport is well-placed to support economic recovery in Northern Ireland and ready to meet an increasing demand for travel later this year and into the future.'\n    </p><p>\n      Matthew Hall added,\n    </p><p>\n      'I very much look forward to joining the highly experienced management team at Belfast City Airport. It is a crucial time in the aviation industry as travel resumes post-pandemic, and the airport has a pivotal role to play in supporting the Northern Ireland economy at this time.'\n    </p><p>\n      In recent months the airport has attracted new airlines and routes, and will fly to 26 destinations across the UK and Europe this summer with airline partners Aer Lingus, British Airways, Eastern Airways, Loganair, KLM, Ryanair and Vueling.\n    </p><p>\n      Brian Ambrose, Chief Executive, Belfast City Airport said,\n    </p><p>\n      'It has been a privilege to serve Belfast City Airport as Chief Executive, and I'd like to thank our committed and talented team who have built a best-in-class product and service.\n    </p><p>\n      'I wish Matthew all the best in his new role as he navigates the post-pandemic recovery and the exciting opportunities that brings.'\n    </p><p><strong>-ENDS-</strong></p><p><strong>Notes to Editors</strong></p><p><strong>About Belfast City Airport</strong></p><p>\n      Belfast City Airport is situated three miles from the city centre of Belfast and is a key driver of Northern Ireland's economy. The airport has been named the UK and Ireland's Most Convenient Airport.\n    </p><p>\n      Belfast City Airport is owned by a fund managed by 3i Investments plc.\n    </p><p>\n      The airport served 2.5m passengers in 2019.\n    </p><p>\n      Airline partners include Aer Lingus, Aer Lingus Regional, British Airways, Eastern Airways, KLM, Loganair, Ryanair, and Vueling.\n    </p><p>\n      Belfast City Airport will fly to 26 destinations across the UK and Europe this summer:\n    </p><ul class=\"bulleted-list arrowlist\"><li>\n        Aberdeen\n      </li><li>\n        Alicante\n      </li><li>\n        Amsterdam\n      </li><li>\n        Barcelona\n      </li><li>\n        Birmingham\n      </li><li>\n        Cardiff\n      </li><li>\n        Dundee\n      </li><li>\n        East Midlands\n      </li><li>\n        Edinburgh\n      </li><li>\n        Exeter\n      </li><li>\n        Faro\n      </li><li>\n        Glasgow\n      </li><li>\n        Ibiza\n      </li><li>\n        Inverness\n      </li><li>\n        Isle of Man\n      </li><li>\n        Leeds Bradford\n      </li><li>\n        London City\n      </li><li>\n        London Heathrow\n      </li><li>\n        Malaga\n      </li><li>\n        Mallorca\n      </li><li>\n        Manchester\n      </li><li>\n        Milan Bergamo\n      </li><li>\n        Newquay\n      </li><li>\n        Southampton\n      </li><li>\n        Teesside International\n      </li><li>\n        Valencia\n      </li></ul><div id=\"public_attachments\"><p><strong>Attachments</strong></p><ul class=\"bulleted-list arrowlist\"><li><a href=\"https://www.3i.com/media-centre/corporate-and-portfolio-news/2021/george-best-belfast-city-airport-announces-incoming-ceo/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a></li></ul></div><div id=\"public_disclaimer\"><p><strong>Disclaimer</strong></p><p><strong>3i Group plc</strong> published this content on <strong>31 May 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>01 June 2021 09:55:38 UTC</strong></p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - 3i Group plc</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: 3i-Group-plc</p></div>"}