{"date": "2021-11-09 00:40:15.777000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>RRITUAL SUPERFOODS INC (\"RSF-Z;RRSFF-0\")\n- Expands Marketing to Fuel Growth with Amazon, Rritual.com &amp; and\n- National Retail\n\n     Expanded Marketing Strategy Deploying Robust Content Strategy,\nSocial and Paid Media to Drive Awareness and Educate Consumers\n\n     Rritual Superfoods Inc. (\"Rritual\" or the \"Company\") is pleased\nto share highlights from the Company's expanded marketing program,\n\n     \"This phase of Rritual's growth requires a highly coordinated and\npurposeful marketing campaign to further establish the brand, build\nknowledge with consumers regarding superfoods and their applications,\nbuilding customer loyalty and driving sales,\" said Mr. Greg McCauley,\nRritual Chief Operating Officer. \"The new strategy is designed to\nsupport existing and new retailer launches, growing direct to consumer\nbusiness through Rritual.com and Amazon.com, and the upcoming Canadian\nlaunch.\"\n\n     Rritual Marketing Program Highlights\n\n     Content Strategy and SEO\n\n     Rritual has made significant strides in editorial content found\non the Journal of rritual.com focusing on key topics such as Usage,\nEducation, and health Rritual has been able to rank #1 and on the\nfirst page of Google for numerous key topics, such as but not limited\nto:\n\n//st\n\n  * How much lion's mane should I take?\n  * How to use Chaga mushroom powders?\n  * What is the best time to take lion's mane mushroom?\n  * Top mushroom mycelium health benefits\n  * Reishi mushroom benefits for skin\n  * Chaga mushroom powder uses and benefits\n\n//et\n\n     Creating engaging content that ranks highly on search engines is\nan important tactic the Company is deploying to engage direct to\nconsumer customers and retail businesses educating potential customers\nwho are interested in functional mushroom users. The content is\ndesigned to further connect with our customers on best uses of our\nproducts and to answer product questions, and as importantly to have\nexisting users of competing brands to understand Rritual's key\nbenefits and points of differentiation.\n\n     Social Media\n\n     Rritual is continuing to create engaging content on Instagram,\nFacebook, Twitter, Tik Tok and Pinterest. Rritual is staying top of\nmind with awareness campaigns on paid social, while deploying new\ntactics to engage new audiences such as Tik Tok and Instagram Reels.\nRritual will continue to foster their social media content pillars\nwhich focus on Q&amp;A about the functional food space, recipes,\neducation, mindfulness, motivation, and product explanation. Rritual's\ncommunity is increasing daily, and the steady stream of content is\nperforming well with its followers.\n\n     Rritual has had success with its macro influencer campaigns and\nlooks to partner with MediaVine again in the future with a campaign\ndedicated to the Company's Amazon store. Rritual's micro-influencer\nand affiliate strategy is growing steadily each week with over 70\nmicro influencers signed up to post regular content as an affiliate.\nRritual should grow this to over 100 before 2022. Rritual has seen\npositive engagement through social media contesting and partnerships\nwith complimentary CPG goods such as Ethical Bean coffee and Sproud\nplant Based milk. In addition, the Company has identified multiple\ncontest opportunities and social media partnerships, which are being\nlined up for 2022.\n\n     Paid Media\n\n     Rritual is continuing its efforts to use keyword-specific\nresearch and geo-targeting to target media as efficiently as possible.\nRritual's paid media strategy is targeting high-interest areas to\nsupport retail and direct to consumers sales. Rritual is continuing to\ncreate new campaigns communicating its key benefits and targeting its\ncore consumer.\n\n     Amazon\n\n     Rritual began its paid advertising campaigns on Amazon in Early\nSeptember. Rritual has continued to see steady growth in sales and new\ncustomer acquisition. Rritual's Amazon store is evolving with its\nBrand store and A+ content launching in the immediate future. Rritual\ncontinues to see strong customer reviews on its products. Rritual is\nalso seeing continued positive growth to its Amazon Return on Ad Spend\n(ROAS) making it a great opportunity for future customer growth.\n\n     The Company is also pleased to announce it has granted a number\nof equity incentive awards (the \"Securities\") to certain directors,\nofficers, and consultants of the Company. In particular, an aggregate\nof 1,000,000 restricted share units (each, a \"RSU\") were granted to\ncertain directors of the Company pursuant to the Company's Omnibus\nEquity Incentive Plan (the \"Plan\"). Each RSU represents the right to\nreceive, once vested, one common share in the capital of the Company\n(each, a \"Share\").  The RSUs will vest as to the first 25% on the date\nwhich is six months from the date of grant and 25% every six months\nthereafter until fully vested. In addition, the Company granted\n2,000,000 performance share units (each, a \"PSU\") to officers of the\nCompany pursuant to the Plan. Each PSU represents the right to\nreceive, once vested, one Share. The PSUs will vest in accordance with\ncertain milestones based on the revenues of the Company. Finally, the\nCompany granted an aggregate of 4,200,000 stock options (each an\n\"Option\") to certain directors, officers, and consultants of the\nCompany. Each Option is each exercisable for the purchase of one Share\nat an exercise price of $0.35 per Share until the date which is five\nyears from the date of issuance. An aggregate of 200,000 of the\nOptions issued to certain officers of the Company shall vest\nimmediately on the date of the issuance. An aggregate of 4,000,000 of\nthe Options granted to certain directors and consultants of the\nCompany shall vest as to the first 25% on the date which is six months\nfrom the date of grant and 25% every six months thereafter until fully\nvested.\n\n     In accordance with the policies of the Canadian Securities\nExchange, the Securities issued to the directors and officers of\nRritual are subject to a hold period of four months from the date of\nthe distribution.\n\n     About Rritual\n\n     Rritual is a functional superfood company that creates\nplant-based elixirs, which support immunity, focus and relaxation. The\ncompany is poised to dominate a segment where demand and sales are\ngrowing exponentially. Under the executive leadership with over 100\nyears of CPG pedigree, Rritual is positioned as a leader in the\nfunctional health and wellness industry. Rritual's superfood elixirs\ncan be found online at www.rritual.com.\n\n     Follow Rritual on Twitter, LinkedIn, Facebook, and Instagram.\n\n     For further information please contact:\n\n     Warren Spence - Chief Executive Officer and Director\nInvestor Relations:\nE-mail: investors@wearerritual.com\n\n     Telephone: (778) 400-1242\n\n     Functional Foods Market\n\n     According to Grandview Research*, it is estimated that the global\nfunctional food market is projected to reach $275 billion by 2025,\ngrowing at 7.9% each year with consumers putting more emphasis on\nhealth and wellness.\n\n*https://www.grandviewresearch.com/press-release/global-functional-foo\nds-market\n\n     Neither the Canadian Securities Exchange nor its Regulation\nServices Provider (as that term is defined in the policies of the\nCanadian Securities Exchange) accepts responsibility for the adequacy\nor accuracy of this release.\n\n     Forward-Looking Information\n\n     This news release contains forward-looking statements and\nforward-looking information within the meaning of Canadian securities\nlegislation (collectively, \"forward-looking statements\") that relate\nto Rritual's current expectations and views of future events. Any\nstatements that express, or involve discussions as to, expectations,\nbeliefs, plans, objectives, assumptions or future events or\nperformance (often, but not always, through the use of words or\nphrases such as \"will likely result\", \"are expected to\", \"expects\",\n\"will continue\", \"is anticipated\", \"anticipates\", \"believes\",\n\"estimated\", \"intends\", \"plans\", \"forecast\", \"projection\", \"strategy\",\n\"objective\" and \"outlook\") are not historical facts and may be\nforward-looking statements and may involve estimates, assumptions and\nuncertainties which could cause actual results or outcomes to differ\nmaterially from those expressed in such forward-looking statements. No\nassurance can be given that these expectations will prove to be\ncorrect and such forward-looking statements included in this news\nrelease should not be unduly relied upon. These statements speak only\nas of the date of this news release. In particular and without\nlimitation, this news release contains forward-looking statements\nrelating to the Company's plans to leverage third party manufacturing\nand logistics, the Company's broader retail distribution plans and the\nCompany's other plans, focus and objectives.\n\n     Forward-looking statements are based on a number of assumptions\nand are subject to a number of risks and uncertainties, many of which\nare beyond Rritual's control, which could cause actual results and\nevents to differ materially from those that are disclosed in or\nimplied by such forward-looking statements. Such risks and\nuncertainties include, but are not limited to, the impact and\nprogression of the COVID-19 pandemic and other factors set forth under\n\"Forward-Looking Statements\" and \"Risk Factors\" in the final long form\nprospectus of the Company dated February 26, 2021 and available under\nthe Company's profile on SEDAR at www.sedar.com. Rritual undertakes no\nobligation to update or revise any forward-looking statements, whether\nas a result of new information, future events or otherwise, except as\nmay be required by law. New factors emerge from time to time, and it\nis not possible for Rritual to predict all of them or assess the\nimpact of each such factor or the extent to which any factor, or\ncombination of factors, may cause results to differ materially from\nthose contained in any forward-looking statement. Any forward-looking\nstatements contained in this news release are expressly qualified in\ntheir entirety by this cautionary statement.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2131101040.MNPRE2131103898-16283120211108</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}