{"date": "2021-12-09 19:03:24.992000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.16, "close": 3444.24}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon's Internet Famous gift guide 2021 includes the best gifts from TikTok, including viral products like Mighty Patch, Dash mini waffle maker, Orolay coat and more.</p><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p></div><div class=\"tr-npp-body\"><p>No matter who you're shopping for, if you're looking for the perfect gift, social media might be a good place to start. TikTok and Instagram are full of trendy products that are influencer-approved and that make for great presents. </p><p>To help you shop the best of the best, Amazon has curated an \"Internet Famous\" gift guide, featuring the most popular things that have gone viral online in 2021. Below are 13 of our top picks from the list, including the Amazon Coat, the mini waffle maker thousands of people love and the volcanic face roller that beauty TikTokers can't stop using.</p><p><span><span>Tackle your holiday shopping</span> with deals and expert advice delivered straight to your phone. Sign up for text message alerts from the deal-hunting team at Reviewed.</span> </p><p class=\"tr-npp-section-title\">1. Orolay Thickened Down Jacket</p><p>More commonly known as the Amazon Coat, this parka has been everywhere over the last year. Influencers and celebrities like Lucy Hale and Emma Roberts are big fans of the Orolay down jacket, which our shopping editor loves for its hefty warmth, stylish design and multitude of convenient pockets. Available in 13 colors and prints, it comes in women's sizes XXS to 5X.</p><p><span>Get the Orolay Women's Thickened Down Jacket from Amazon for $159.99</span> </p><p class=\"tr-npp-section-title\">2. Mighty Patch</p><p>If anyone on your list is obsessed with their skincare routine, they'll love getting a pack of Mighty Patch pimple stickers. Recommended by many TikTokers, the tiny hydrocolloid patches spot treat your breakouts — all you do is put a sticker over your zit before bed and, in six to eight hours, it will be cleared up. They blend easily into your skin and don't irritate or chafe when you remove them.</p><p><span>Get the Original Mighty Patch from Amazon for $12.99</span> </p><p class=\"tr-npp-section-title\">3. Dash Mini Waffle Maker</p><p>This Dash mini waffle maker may be the trendiest kitchen appliance of 2021, raking in more than 184,000 reviews on Amazon. The pint-sized press yields a 4-inch waffle in minutes with almost zero mess and is as easy to clean as it is to use. Plus, it comes in a variety of pretty colors and patterns.</p><p><span>Get the Dash Mini Waffle Maker from Amazon for $15.99</span> </p><p class=\"tr-npp-section-title\">4. Olaplex Hair Perfector No 3 Repairing Treatment</p><p>Give the gift of better hair with this Olaplex repairing and strengthening treatment, which has received almost 100,000 rave reviews from Amazon shoppers. Free of parabens and sulfates, the concentrated at-home product works on all hair types, from straight to natural. It heals damage caused by heat and chemicals and prevents future breakage, so your mane will feel soft and lush.</p><p><span>Get the Olaplex Hair Perfector No 3 Repairing Treatment from Amazon for $28</span> </p><p class=\"tr-npp-section-title\">5. Halluci Cross Band Slippers</p><p>Ugg slippers are all the rage this year. If you want the comfort without the cost, snag a pair of these popular dupes, which have more than 32,000 glowing reviews on Amazon. Available in eight colors and in women's sizes S to XL, the open-toe slippers have a cushioned memory foam sole and are lined with super soft fleece.</p><p><span>Get the Halluci Cross Band Slippers from Amazon from $17.99</span> </p><p class=\"tr-npp-section-title\">6. The Pink Stuff Miracle Cleaning Paste</p><p>The name of this cleaner says it all: According to TikTokers, the paste is a true miracle. Coming in a highly recognizable hot pink tub, the Pink Stuff claims to remove dirt, stains and grease from almost any place in your house, from countertops to bathroom floors to door handles. More than 100,000 Amazon shoppers are obsessed with it, saying it's as effective as it claims to be, and is a game-changer when it comes to cleaning your home.</p><p><span>Get the Stardrops The Pink Stuff Miracle Cleaning Paste from Amazon for $8.99</span> </p><p class=\"tr-npp-section-title\">7. Bagel Guillotine Slicer</p><p>If you've ever tried to slice a bagel with a plain old butter knife, you know how difficult it is. Enter the bagel guillotine slicer. Coming in four colors, the device has a stainless steel blade that cuts bagels cleanly in half quickly and safely (thanks to the safety shield). Breakfast just got a <span>lot</span> easier. </p><p><span>Get the Hoan Bagel Guillotine Slicer from Amazon for $19.99</span> </p><p class=\"tr-npp-section-title\">8. Tronco Glass Tumbler</p><p>For anyone whose New Year's resolutions include getting healthier, they might appreciate a pretty water bottle to encourage them to drink more water. This glass tumbler had a moment on TikTok thanks to its gorgeous, minimalist design and affordable $16 price tag. Made of sturdy Borosilicate glass, it comes with a protective silicone sleeve—in 14 stunning colors—and a bamboo lid. </p><p><span>Get the Tronco Glass Tumbler from Amazon for $15.99</span> </p><p class=\"tr-npp-section-title\">9. Pavoi 14K Gold Chunky Hoops</p><p>You don't have to spend a lot to get a pretty piece of jewelry. These crazy popular hoops from Amazon cost less than $14 and are made of high quality 14-karat gold. More than 31,000 people have given them a thumbs up, saying the earrings have an on-trend chunky silhouette but are lightweight enough to wear for hours on end. The hoops come in rose, white and yellow gold.</p><p><span>Get the Pavoi 14K Gold Chunky Hoops from Amazon for $13.95</span> </p><p class=\"tr-npp-section-title\">10. Mirror LED Alarm Clock</p><p>An alarm clock that doubles as a mirror is one of those things you never knew you needed—until now. This one has been popping up all over TikTok and social media in 2021. It features an LED display that has three levels of brightness and that can be turned all the way down, converting the screen into a makeup mirror. It can also charge multiple devices, so it's as versatile as it is unique.</p><p><span>Get the Szelam LED Electric Alarm Clock from Amazon for $22.95</span> </p><p class=\"tr-npp-section-title\">11. ProsourceFit Acupressure Mat and Pillow Set</p><p>An acupressure mat makes for a great self-care gift. This one comes highly rated from thousands of Amazon reviewers, who say it's very effective at relieving stress and releasing tension from tight muscles. Available in 14 colors, it uses tiny needles to stimulate nerves, produce endorphins and improve circulation. Think of 30 minutes on your pat (and included pillow!) like an at-home acupressure appointment.</p><p><span>Get the ProsourceFit Acupressure Mat and Pillow Set from Amazon for $24.99</span> </p><p class=\"tr-npp-section-title\">12. Revlon Oil-Absorbing Volcanic Face Roller</p><p>Over the last few months, social media has become obsessed with this unique Revlon face roller. Made with volcanic stone, the skincare tool absorbs oil as you roll it over your face, leaving your skin shine-free in seconds. It's portable enough to carry around on the go and even doubles as a facial massager. Win-win!</p><p><span>Get the Revlon Oil-Absorbing Volcanic Face Roller from Amazon for $9.98</span> </p><p class=\"tr-npp-section-title\">13. Scalp Massage Shampoo Brush</p><p>The best part about getting your hair done at a salon is the massage you often get while they're shampooing your hair. Fortunately, you don't have to book an expensive appointment to get that scalp-tingling experience. This TikTok-approved shampoo brush costs less than $8 and gently massages your scalp in the shower. It has more than 100,000 great reviews from people who rave about its relaxing effects.</p><p><span>Get the Heeta Scalp Massage Shampoo Brush from Amazon for $7.48</span> </p><p><span><span>Don't get thwarted by shipping delays or sold-out favorites this holiday season.</span>  Sign up for our free weekly newsletter and get the product reviews, deals and holiday gift guides you need to start shopping now.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: These are the most popular gifts from TikTok and Instagram, according to Amazon</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}