{"date": "2022-02-24 14:41:53.300000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">Sol Cuisine's Hot &amp; Spicy Chik'n Wings and Cauliflower Burger named Winners of the 2022 Product of the Year Canada™</p>\n<p>MISSISSAUGA, ON, Feb. 25, 2022</p>\n<p>\n<span>\n<span>MISSISSAUGA, ON</span>\n</span> , <span>\n<span>Feb. 25, 2022</span>\n</span> /CNW/ - Sol Cuisine is proud to dish up two Product of the Year Canada™ award wins this year, taking top spots in the Plant-Based Chicken and Gluten-Free categories. Sol Cuisine's <span>Hot &amp; Spicy Chik'n Wings</span> and <span>Cauliflower Burger</span> delighted the palettes of 4,000 Canadian shoppers, who were a part of the largest consumer survey on product innovation performed by global research firm Kantar.</p>\n<p>\n\n</p>\n<p>\n<span>Hot &amp; Spicy Chik'n Wings: Product of the Year™ in the Plant-Based Chicken category</span>\n</p>\n<p>With a kick of heat and crispy breading, Sol Cuisine's \n<span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3453093-1&amp;h=2477618372&amp;u=https%3A%2F%2Fsolcuisine.com%2Fproduct%2Fhot-spicy-chikn-wings%2F&amp;a=Hot+%26+Spicy+Chik%27n+Wings\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Hot &amp; Spicy Chik'n Wings</a>\n</span> rival the taste and texture of traditional chicken wings – even taking inspiration from the 'drums and flats' shapes for those looking for a plant-based, hot wing experience. Perfect for sharing with vegans, vegetarians and plant-curious eaters, the Hot &amp; Spicy Chik'n Wings are 100% vegan, kosher, and made with non-GMO ingredients.</p>\n<p>\n\n</p>\n<p>\n<span>Cauliflower Burgers: Product of the Year™ in the Gluten-Free category</span>\n</p>\n<p>Meatless and delicious, Sol Cuisine's \n<span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3453093-1&amp;h=2123739487&amp;u=https%3A%2F%2Fsolcuisine.com%2Fproduct%2Fcauliflower-burger%2F&amp;a=Cauliflower+Burgers\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Cauliflower Burgers</a>\n</span> are the latest addition to Sol Cuisine's market-leading line of plant-based burgers. Carefully crafted with flavourful ingredients – cauliflower, sweet potato and chickpeas – these burgers pack a nutritional punch. Each of Sol Cuisine's burgers are all vegan, gluten free and non-gmo verified.</p>\n<p>\"Our vision for Sol Cuisine is the same as it was when I founded the company in 1980: be the leading provider of plant-based foods by winning in taste, convenience and variety,\" said <span>Dror Balshine</span> , president and founder of Sol Cuisine. \"We are delighted to be among the winners of the 2022 Product of the Year Canada™, and hope this 'seal of approval' from Canadians coast-to-coast will encourage those interested in trying plant-based for the first time.\"</p>\n<p>Sol Cuisine's thoughtfully curated portfolio of over 30 products includes burgers, appetizers and entrees for plant-based eaters and meat lovers alike. Building off the overwhelming success of the Hot &amp; Spicy Chik'n Wings, recent additions to the Sol Cuisine line include Cauliflower Wings in <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3453093-1&amp;h=119746082&amp;u=https%3A%2F%2Fsolcuisine.com%2Fproduct%2Fsweet-chilli-cauliflower-wings%2F&amp;a=Sweet+Chili\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Sweet Chili</a>\n</span> and <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3453093-1&amp;h=4161645937&amp;u=https%3A%2F%2Fsolcuisine.com%2Fproduct%2Fbuffalo-cauliflower-wings%2F&amp;a=Buffalo\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Buffalo</a>\n</span> -Style flavours. Canadians can find the award-winning products and more at major grocery retailers and natural food stores across the country.</p>\n<p>\n<span>About Sol Cuisine</span> Sol Cuisine is a fast-growing producer of branded and private label, consumer-preferred plant-based protein offerings across key center-of-plate and appetizer categories. The Company's products are offered through an established omni-channel distribution platform in <span>Canada</span> , the U.S. and <span>Mexico</span> , and are available in over 11,000 stores and more than 41,000 unique points of distribution across four primary channels: Canada Retail Sales &amp; Club; U.S. Retail Sales &amp; Club; Food Service &amp; Industrial; and Private Label. Over a history of 20+ years, Sol Cuisine has consistently demonstrated an ability to innovate and delight consumers in <span>Canada</span> and the U.S., while remaining true to its commitment to producing great tasting, nutritionally superior products. This commitment has resulted in several Canadian product wins, including the #1 frozen plant-based burger in <span>Canada</span> , the #1 consumer-preferred chicken alternative and the #1 quality roast product as determined by Whole Foods Market. The Company's taste and nutritional superiority has also resulted in private label contracts with some of the most recognized natural brands in <span>North America</span> . These products are all produced at Sol Cuisine's two state of the art facilities, totaling 35,000 square foot facility in <span>Mississauga, Ontario</span> , capable of supporting up to 10 million kilograms of volume per annum.</p>\n<p>For more details on Sol Cuisine's consumer brands:</p>\n<p>Website: <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3453093-1&amp;h=1268012296&amp;u=http%3A%2F%2Fwww.solcuisine.com%2F&amp;a=www.solcuisine.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.solcuisine.com</a>\n</span> Instagram: <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3453093-1&amp;h=4292882637&amp;u=https%3A%2F%2Fwww.instagram.com%2Fsolcuisine%2F&amp;a=%40solcuisine\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@solcuisine</a>\n</span> Facebook: <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3453093-1&amp;h=1282412860&amp;u=https%3A%2F%2Fwww.facebook.com%2Fsolcuisine&amp;a=%40solcuisine\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@solcuisine</a>\n</span> Twitter: <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3453093-1&amp;h=4260162549&amp;u=https%3A%2F%2Ftwitter.com%2Fsolcuisine&amp;a=%40solcuisine\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@solcuisine</a>\n</span> LinkedIn: <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3453093-1&amp;h=612178904&amp;u=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fsol-cuisine&amp;a=%40solcuisine\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@solcuisine</a>\n</span>\n</p>\n<p>\n<span>About Product of the Year</span>\n</p>\n<p>\n<span>Product of the Year</span> is the world's largest consumer-voted award for product innovation. Established over 31 years ago in <span>France</span> , POY currently operates in over 40 countries with the same purpose: Guide consumers to the best products in their market and reward manufacturers for quality and innovation. In <span>Canada</span> , the <span>Product of the Year</span> seal is backed by votes of thousands of Canadian consumers, serving as a shortcut for shoppers to save time and money. For entrants of the winning products, the award is a powerful marketing message proven to increase product awareness, trial and quality. <span>Product of the Year Canada</span> accepts entries from consumer products that demonstrate innovation in design, function, packaging or ingredients, and were launched within the previous year ( <span>January 2020</span> ). A jury compromised of industry experts select the finalists that meet the <span>Product of the Year</span> standards of value and innovation. Those selected finalists are then categorized and judged through an online survey of Canadian consumers, conducted by Kantar on behalf of Ensemble IQ. Consumers vote and the distinct internationally renowned red seal. Winning products are announced annually and receive the right to use the <span>Product of the Year Canada</span> seal in their marketing and communications for two years. For more information, visit \n<span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3453093-1&amp;h=2774229852&amp;u=http%3A%2F%2Fwww.productoftheyear.ca%2F&amp;a=productoftheyear.ca\" data-type=\"url\" class=\"tr-link\" translate=\"no\">productoftheyear.ca</a>\n</span> .</p>\n<p>SOURCE Sol Cuisine Ltd.</p>\n<p>View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/February2022/25/c6409.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/February2022/25/c6409.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}