{"date": "2021-10-04 06:10:46.476000+00:00", "ticker": "AAF", "mrkt_info": {"open": 97.05, "close": 94.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 8262NAirtel Africa PLC04 October 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>Airtel Africa plc</span>\n</p>\n<p>\n<span>(\"Airtel Africa\", or \"Company\")</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>Segun Ogunsanya begins new role as</span>\n</span>\n<span>\n<span>CEO</span>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n<span>London and Lagos, 4 October 2021:</span>\n</span>\n<span>Airtel Africa plc, a leading provider of telecommunications and mobile money services, with a presence in 14 countries across Africa, announces that further to the Company's appointment of Olusegun \"Segun\" Ogunsanya, as Managing Director and Chief Executive Officer, Segun has begun his new role as at 1 October 2021 and joined the Board of Airtel Africa plc.</span>\n</p>\n<p>\n<span>Segun was previously Managing Director and CEO of Airtel Nigeria and was responsible for the overall management of the operations in the Company's largest market. He has more than 25 years business management experience in banking, consumer goods and telecoms. Before joining Airtel in 2012, Segun held leadership roles at Coca-Cola in Ghana, Nigeria, and Kenya (as MD and CEO). He has also been the Managing Director of Nigerian Bottling Company Ltd (Coca-Cola Hellenic owned) and Group head of retail banking operations at Ecobank Transnational Inc, covering 28 countries in Africa. He is an electronics engineer and also a chartered accountant.</span>\n</p>\n<p>\n<span>Segun Ogunsanya, CEO, Airtel Africa, said:</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\"I am looking forward to building on the solid foundations the Group has established for future sustainable growth across Africa. Moving forward, we will invest even more in our network and distribution channels to serve</span>\n<span>the communities where we operate. By doing this, we will continue to sustainably bridge the digital divide, expand financial inclusion and meet the evolving needs of our customers.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>-ENDS-</span>\n</p>\n<p>\n<span>\n<span>Enquiries</span>\n</span>\n<span>:</span>\n</p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>Airtel Africa - Investor Relations</span>\n</p>\n<p>\n<span>Pier Falcione</span>\n</p>\n<p>\n<span>Morten Singleton</span>\n</p>\n<p>\n<span>\n<a href=\"mailto:Investor.relations@africa.airtel.com\" data-type=\"email\" translate=\"no\">Investor.relations@africa.airtel.com</a>\n</span>\n</p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n<p>\n<span>+44 7446 858 280</span>\n</p>\n<p>\n<span>+44 7464 830 011</span>\n</p>\n<p>\n<span>+44 207 493 9315</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Hudson Sandler</span>\n</p>\n<p>\n<span>Nick Lyon</span>\n</p>\n<p>\n<span>Bertie Berger</span>\n</p>\n<p>\n<span>\n<a href=\"mailto:airtelafrica@hudsonsandler.com\" data-type=\"email\" translate=\"no\">airtelafrica@hudsonsandler.com</a>\n</span>\n</p>\n</td>\n<td>\n<p>\n<span>+44 207 796 4133</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<p>\n<span>About Airtel Africa</span>\n</p>\n<p>\n<span>Airtel Africa is a leading provider of telecommunications and mobile money services, with a presence in 14 countries in Africa, primarily in East Africa and Central and West Africa.</span>\n</p>\n<p>\n<span>Airtel Africa offers an integrated suite of telecommunications solutions to its subscribers, including mobile voice and data services as well as mobile money services both nationally and internationally.</span>\n</p>\n<p>\n<span>The Group aims to continue providing a simple and intuitive customer experience through streamlined customer journeys.</span>\n</p>\n<p>\n<span>\n<a href=\"http://www.airtel.africa\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.airtel.africa</a>\n</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>This information is provided by Reach, the non-regulatory press release distribution service of RNS, part of the London Stock Exchange. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .Reach is a non-regulatory news service. By using this service an issuer is confirming that the information contained within this announcement is of a non-regulatory nature. Reach announcements are identified with an orange label and the word \"Reach\" in the source column of the News Explorer pages of London Stock Exchange's website so that they are distinguished from the RNS UK regulatory service. Other vendors subscribing for Reach press releases may use a different method to distinguish Reach announcements from UK regulatory news.RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>NRAVXLFBFBLFFBD</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}