{"date": "2022-02-10 19:17:23.033000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3223.79, "close": 3065.87}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">GFI Announces the Acquisition of YoFiit, a Premium Plant-Based Milk and Snack Food Consumer Brand</p>\n<p>TORONTO, Feb. 10, 2022</p>\n<p>\n<span>TORONTO</span> , <span>Feb. 10, 2022</span> /CNW/ - Global Food and Ingredients Inc. (\"GFI\" or the \"Company\") announced today that it has completed the acquisition of Your Fitness Dish Inc., a premium plant-based milk and snack food company operating under the brand \"YoFiit\".</p>\n<p>\n\n</p>\n<p>YoFiit's products include a high protein plant-based milk made with chickpeas, pea protein and flax oil to provide 10 grams of protein per serving and 1,000 mg of omega 3, while free of gums and sugars, giving it a unique health profile in the marketplace. YoFiit also sells an array of high protein low sugar snack bars and granola products made from plants. YoFiit's products are sold through health foods and major grocery chains across <span>Canada</span> and available online through Amazon in <span>the United States</span> and <span>Canada</span> and the Company's website <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3440791-1&amp;h=1472509237&amp;u=http%3A%2F%2Fwww.yofiit.com%2F&amp;a=www.yofiit.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.yofiit.com</a> . YoFiit's founder, <span>Marie Amazan</span> , will continue as President of YoFiit and manage the brand's products and business development within the GFI group.</p>\n<p>\"We are very pleased to accelerate our plans to expand into the high growth plant-based milk and snack food segments through this acquisition. YoFiit has developed a loyal and engaged customer group in <span>Canada</span> due to the unique health proposition of its product offering and we look forward to implementing a US market launch in the next few months,\" said <span>David Hanna</span> , GFI's CEO.</p>\n<p>In addition to its current product line up, YoFiit is engaged in a major research and development project. With the support of its consortium members, including Protein Industries Canada, the project is underway to develop additional plant-based milk SKUs, plant-based yogurts and plant-based egg replacements. The company has secured <span>$1.2 million</span> in government grants to support the project.</p>\n<p>\"YoFiit has major expansion plans into the US market and across <span>Canada</span> , while also developing new plant-based products that will fill the nutrition and taste gaps in the marketplace. We are excited to join GFI to accelerate these plans and use GFI's platform to connect our plant-based ingredients needs right to the farm level,\" commented <span>Marie Amazan</span> , YoFiit's founder.</p>\n<p>According to The Good Food Institute, the US plant-based milk segment had annual sales of <span>US$2.5 billion</span> in 2020, a 20% increase from the prior year, with approximately 50 million American households having purchased plant-based milks in the year. Plant-based yogurt represented a <span>US$343 million</span> market in 2020, having grown 20% from the prior year and 68% over two years. In addition, the emerging market for plant-based eggs had <span>US$27 million</span> of sales in 2020, up 168% from the prior year.</p>\n<p>\n<span>About Global Food and Ingredients Inc.</span>\n</p>\n<p>GFI is a fast-growing Canadian owned and operated plant-based food and ingredients company, connecting the local farm to the global market for peas, beans, lentils, chickpeas and other high protein specialty crop ingredients. GFI is organized into four primary business lines: Pea Protein Inputs, Plant-Based Ingredients, Plant-Based Pet Food Ingredients and Plant-Based Consumer Packaged Goods. Headquartered in <span>Toronto</span> , GFI buys directly from its extensive network of farmers, processes its products locally at its four wholly-owned processing facilities in <span>Saskatchewan</span> and <span>Alberta</span> and ships to 37 countries across the world.</p>\n<p>SOURCE Global Food and Ingredients</p>\n<p>View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/February2022/10/c6651.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/February2022/10/c6651.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}