{"date": "2021-11-08 18:10:48.032000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>CHECK POINT SOFTWARE TECHNOLOGIES LTD (\"CHKP-Q\")\n- Named a Leader in the Gartner(r) Magic Quadrant(TM) for Network\n- Firewalls\n\n     Check Point(R) Software Technologies Ltd., a leading provider of cyber\nsecurity solutions globally, today announced that it has been recognized as\na Leader in the Gartner(R) Magic Quadrant(TM) for Enterprise Network\nFirewalls. Check Point Software has been listed as a Leader yet again,\nwhich we believe further validates Check Point's track record and tradition\nof innovation.\n\n     \"Security threats have become more sophisticated requiring Check Point\nSoftware to continuously improve threat intelligence, automate policy\nmanagement and deliver security architecture innovations like Maestro\nHyperscale. We believe, being recognized as a Leader in Gartner(R) Magic\nQuadrant(TM) for Enterprise Network Firewalls is a testament to our vision\nof providing best-in-class security for rapidly changing environments,\"\nsaid Itai Greenberg, VP of Product Management at Check Point. \"This year's\nrecognition solidifies our position as a leader in delivering a hybrid data\ncenter security architecture that enables enterprises to scale threat\nprevention on demand on premises and in the cloud with a unified management\nsystem.\"\n\nCheck Point Software's Infinity Architecture is the industry's first\nconsolidated security architecture spanning networks, cloud, endpoint,\nmobile and IoT, providing the highest level of threat prevention against\nboth known and unknown cyber threats. At the heart of Check Point's threat\nprevention capabilities lies ThreatCloud, the world's most powerful threat\nintelligence network.\n\n     The continuous recognition for Check Point Software's Network Firewall\nproducts is driven by:\n\n     *  Advanced security architecture and innovative roadmap: To name a\nfew, these include Check Point's Maestro Hyperscale security solution that\nprovides fast, on-demand cloud-like scaling of organizations' on-premises\nsecurity gateways, intelligently orchestrating existing resources and\nproviding redundancy, as well as autonomous threat prevention, which offers\nadministrators set-and-forget policies and security settings that are\ncontinually optimized in the background.\n\n     *  Complete portfolio for securing evolving IT environments: Check\nPoint Software has a clear prevention-first security strategy with products\nthat span on-prem, hybrid and IaaS security needs. Its comprehensive\nsecurity architecture swiftly manages entire IT infrastructures: Quantum\nfor on-prem networks, Check Point CloudGuard for public clouds (Azure, AWS,\nGCP etc.) and Harmony Connect, Check Point's Secure Access Service Edge\n(SASE) solution, to secure the remote workforce\n\n           *  Unparalleled customer satisfaction: This year Check Point\nSoftware customer satisfaction was commended in Gartner Peer Insights\nreviews for Network Firewalls. This is a reflection of Check Point's\nuncompromised commitment to high quality products, service and support.\nCheck Point secures over 100,000 organizations in over 80 countries around\nthe globe, including 90% of the global Fortune 500.\n\n     Many enterprises are adopting the hybrid work model permanently, so\nthe adoption of Secure Access Service Edge (SASE) security solutions is on\nthe rise. The Secure Access Service Edge (SASE) model addresses the\nlimitations of traditional network architectures, by converging networking\nand security in the cloud enabling enterprises to prioritize security and\nthreat prevention. Check Point Harmony Connect SASE offers the only\nprevention-focused SASE solution with a 100% catch rate for malware\nthreats, enabling enterprises to prevent and block even the most advanced\nattacks, before they can disrupt business. Some of the key features include\nFirewall-as-a-service, Zero Trust Network Access (ZTNA) and a\ncloud-delivered Secure Web Gateway (SWG).\n\n     Read more about today's announcement and receive Gartner(R) Magic\nQuadrant(TM) for Network Firewalls.\n\n     *Gartner(R) Magic Quadrant(TM) for Network Firewalls, Rajpreet Kaur,\nAdam Hils, Jeremy D'Hoinne, Nat Smith 1 November 2021.\n\n     Follow Check Point via:\nTwitter: <a href=\"https://www.twitter.com/checkpointsw\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.twitter.com/checkpointsw</a>\nFacebook: <a href=\"https://www.facebook.com/checkpointsoftware\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.facebook.com/checkpointsoftware</a>\nBlog: <a href=\"https://blog.checkpoint.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://blog.checkpoint.com</a>\nYouTube: <a href=\"https://www.youtube.com/user/CPGlobal\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.youtube.com/user/CPGlobal</a>\nLinkedIn:\n<a href=\"https://www.linkedin.com/company/check-point-software-technologies\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.linkedin.com/company/check-point-software-technologies</a>\n\n     Gartner Disclaimer\n\n     Gartner does not endorse any vendor, product or service depicted in\nits research publications, and does not advise technology users to select\nonly those vendors with the highest ratings or other designation. Gartner\nresearch publications consist of the opinions of Gartner's research\norganization and should not be construed as statements of fact. Gartner\ndisclaims all warranties, expressed or implied, with respect to this\nresearch, including any warranties of merchantability or fitness for a\nparticular purpose.\n\n     Gartner and Magic Quadrant are registered trademarks of Gartner, Inc.\nand/or its affiliates in the U.S. and internationally and are used herein\nwith permission. All rights reserved.\n\n     About Check Point Software Technologies Ltd.\n\n     Check Point Software Technologies Ltd. (www.checkpoint.com) is a\nleading provider of cyber security solutions to corporate enterprises and\ngovernments globally. Check Point Infinitys portfolio of solutions\nprotects enterprises and public organizations from 5th generation\ncyber-attacks with an industry leading catch rate of malware, ransomware\nand other threats. Infinity comprises three core pillars delivering\nuncompromised security and generation V threat prevention across enterprise\nenvironments: Check Point Harmony, for remote users; Check Point\nCloudGuard, to automatically secure clouds; and Check Point Quantum, to\nprotect network perimeters and datacenters, all controlled by the\nindustry's most comprehensive, intuitive unified security management. Check\nPoint protects over 100,000 organizations of all sizes.\n\n     MEDIA\n\n Contact Information:\n\nCONTACT:\nEkram Ahmed\nCheck Point Software Technologies\n+1 415.299.7767\npress@us.checkpoint.com\n\n     Contact:\nKip E. Meintzer\nCheck Point Software Technologies\n+1 650.628.2040\nir@us.checkpoint.com\n\nEmail : kip@checkpoint.com    CHECK POINT SOFTWARE TECHNOLOGIES LTD\nWWW   : <a href=\"https://www.checkpoint.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.checkpoint.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2131100771.MNPRE2131102913-10043720211108</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}