{"date": "2021-11-13 07:30:28.965000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3472.5, "close": 3545.68}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon Prime will now allow users to share a snippet of up to 30 seconds from some of its Prime Video content. To start off, the feature will only be available for a few shows. Also, keep in mind that the video-sharing feature will only be available on iOS devices. As of now, it is not clear whether the company plans to introduce the feature for Android devices in the future.</p><p>While watching a series on the streaming service, the Share Clip tool will be visible alongside the rest of your controls. Tapping on the same will create a 30-second video clip, which users will be able to fine-tune to ensure it contains the part of the show they wish to share.</p></div><div class=\"tr-npp-body\"><p>From there on out, users will be able to share the same using Apple's built-in sharing feature. Users will be able to send the video to others via iMessage or post it on social media.</p><p>While Amazon's new feature suggests that the company is open to users sharing video clips from Prime Video, streaming services like Netflix have a different approach.</p><p>While taking a screenshot while watching content on Netflix, the video content gets blacked out, leaving you with just the subtitles if you have them turned on.</p><p>Amazon has stated that for now, users will only be able to share clips from shows including The Wilds, Invincible, Fairfax, and season one of The Boys to start, but it will add more movies and shows later. As of now, it is unclear whether the company intends to introduce the feature for any non-Amazon original content on Prime Video in the future.</p><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}