{"date": "2021-12-16 14:45:41.690000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3381.83, "close": 3377.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SUPER LEAGUE GAMING INC (\"SLGG-Q\")\n- Secures Patent Allowance to Provide for Individual\n- Streaming Customization\n\n   Super League Gaming, a global leader in video game experiences and\nentertainment at the intersection of the creator economy, gameplay content,\nand the metaverse, announced today the extension of its intellectual\nproperty portfolio, having received a notice of allowance from the United\nStates Patent and Trademark Office (USPTO) for an additional patent\napplication associated with the cloud-based live streaming of gaming\ncontent experiences. Specifically, the company's newest patent allowance\npertains to a single live broadcast serving multiple content streams from\ndevices displaying the content, thereby enabling individual perspectives\nwhile meeting locality requirements.\n\n   This patent application grows the Super League Gaming patent portfolio,\nwhich encompasses content customization on request by a user resulting in a\nunique stream with location-specific content, data, graphics, player or\nhost recommendations, specific camera views, and targeted advertising\nserved immediately to that viewer based on profile metadata.\n\n   \"It is exciting to be extending our patent portfolio with this patent\nallowance as it demonstrates the ongoing value of our earliest technology\ninitiatives. We remain fully committed to continued innovation and our\nstated mission to provide best in class streaming content experiences in\nthe gaming and live broadcasting space,\" says David Steigelfest, Super\nLeague co-founder and Chief Platform Officer.\n\n   This proprietary technology will allow for multiple one-to-many\nbroadcasts, each with custom results based on target audience preferences,\nensuring a robust personal experience tailored specifically by the user.\n\n   About Super League Gaming\nSuper League Gaming (Nasdaq: SLGG) is a leading metaverse and creator\neconomy platform at the intersection of gaming and pop culture focused on\ntools and offerings that empower creators, energize players, and entertain\nfans. The company's solutions provide incomparable access to an audience\nconsisting of players in the largest global metaverse environments, fans of\nhundreds of thousands of gaming influencers, and viewers of gameplay\ncontent across major social media and digital video platforms. Fueled by\nproprietary and patented technology systems, the company's creator-centric\nofferings include content tools that power live stream multicasting, a\nleading metaverse advertising platform, a social media banner monetization\nplatform, and a virtual cloud-based video production division, Virtualis\nStudios. Combined with vibrant in-game Minecraft communities, a network of\nhighly viewed channels and original shows on Instagram, TikTok, Snap,\nYouTube, and Twitch, and an award-winning esports invitational tournament\nseries, Super League's properties deliver powerful opportunities for brands\nand advertisers to achieve impactful marketing outcomes with gamers of all\nages. For more, go to superleague.com.\n\n Contact Information:\n\nContact:Gillian Sheldon\nSuper League Gaming\ngillian.sheldon@superleague.com\n\n   Super League Contact:\nSophie Pearson and Cody Slach\nGateway Investor Relations\nSLG@gatewayir.com\n\n   Forward-Looking Statements\nSafe Harbor Statement under the Private Securities Litigation Reform Act of\n1995. Statements in this press release that are not strictly historical are\n\"forward-looking\" statements within the meaning of Section 27A of the\nSecurities Act of 1933, as amended, and Section 21E of the Securities\nExchange Act of 1934, as amended. These statements involve substantial\nrisks, uncertainties and assumptions that could cause actual results to\ndiffer materially from those expressed or implied by such statements.\nForward-looking statements in this communication include, among other\nthings, statements about our possible or assumed business strategies,\npotential growth opportunities, new products and potential market\nopportunities. Risks and uncertainties include, among other things, our\nability to implement our plans, forecasts and other expectations with\nrespect our business; our ability to realize the anticipated benefits of\nevents that took place during and subsequent to the quarter ended March 31,\n2020, including the possibility that the expected benefits will not be\nrealized or will not be realized within the expected time period; unknown\nliabilities that may or may not be within our control; attracting new\ncustomers and maintaining and expanding our existing customer base; our\nability to scale and update our platform to respond to customers' needs and\nrapid technological change; increased competition on our market and our\nability to compete effectively, and expansion of our operations and\nincreased adoption of our platform internationally. Additional risks and\nuncertainties that could affect our financial results are included in the\nsection titled \"Risk Factors\" and \"Management's Discussion and Analysis of\nFinancial Condition and Results of Operations\" in our Annual Report on Form\n10-K for the year ended December 31, 2019 and other filings that we make\nfrom time to time with the Securities and Exchange Commission which, once\nfiled, are available on the SEC's website at www.sec.gov. In addition, any\nforward-looking statements contained in this communication are based on\nassumptions that we believe to be reasonable as of this date. Except as\nrequired by law, we assume no obligation to update these forward-looking\nstatements, or to update the reasons if actual results differ materially\nfrom those anticipated in the forward-looking statements.\n\nEmail : SLG@gatewayir.com    SUPER LEAGUE GAMING INC\nWWW   : <a href=\"https://www.superleague.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.superleague.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134800599.MNPRE2134802320-07384320211215</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}