{"date": "2022-01-31 13:48:08.521000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>HOME BISTRO INC (\"HBIS-0\")\n- Celebrity Chef Priyanka Naik to its Prepared Meal Delivery\n- Platform\n\n   Home Bistro, Inc. (\"Home Bistro\" or the \"Company\") a leading online\nplatform that offers celebrity chef-inspired, gourmet ready-made and\nlifestyle meals, today announced Chef Priyanka Naik, a vegan + sustainable\ncelebrity chef, Food Network champion, TV host and author, has joined the\nHome Bistro prepared meal delivery platform.\n\n   Zalmi Duchman, Home Bistro CEO stated, \"We are excited to add Chef\nPriyanka to our meal delivery platform. Her passion for vegan,\nsustainability and zero-waste cooking, adds a new and unique dimension to\nour current meal offerings. We are scheduled to have Chef Priyanka's meals\nlaunched by the spring.\"\n\n   Chef Priyanka commented, \"I am excited to be partnering with Home Bistro\nso that food lovers everywhere can bring my prepared meals into their\nhomes! And you don't have to be vegan to try it - just have to love good\nfood. I'm looking forward to working with Zalmi and the Home Bistro team\nand getting launched soon!\"\n\n   About Chef Priyanka Naik\n\n   Priyanka Naik is a self-taught Indian vegan chef, Food Network champion,\nQuibi Dishmantled Winner, TV Host, and Author. She is a Food and TV\npersonality, who hosts \"Dish it Healthy\" with Priyanka Naik, a Tastemade\noriginal clean-eating food show on Food Network Kitchen and is the author\nof THE MODERN TIFFIN out now! Over the past 11 years, her blog has evolved\ninto a food and lifestyle brand that shares content across social media\nsites, including Instagram, YouTube, TikTok and Facebook. Naik has also\nmoved on to cooking and eating completely vegan for more than four years.\n\n   An avid traveler who's been to nearly 40 countries, her globally\ninspired original recipes, with a focus on sustainability, have been\nfeatured on her blog \"Chef Priyanka\", IGTV, hosting her own digital series\n\"Cook With Chef Pri at 3,\" and are incorporated into her regular speaking\nappearances.\n\n   She has garnered attention from and having been featured on The Kelly\nClarkson Show,Forbes, GLAMOUR, 2X TODAY Show featured chef: (1) The TODAY\nShow, and (2) The TODAY Show, Bon Appetit Mini Series, CNN, GQ, The Beet,\nWell + Good, Medium, and more. She has partnered with several brands,\nincluding Coca-Cola, Amazon, and Uniqlo for brand campaigns. Priyanka is\nfirst-generation, Indian American, raised on Staten Island, New York, and\nhas two elder sisters. Her Indian heritage is very important to her cooking\nstyle and lifestyle, so much so that she even learned her native language\nof Kannada before English and weaves in Indian elements throughout all of\nher original vegan cooking. She attributes her devotion to her Indian roots\nand passion for Indian food to her loving and supportive parents.\n\n   For more information about Chef Priyanka, please visit\nwww.chefpriyanka.com\n\n   About Home Bistro, Inc.\n\n   Home Bistro is a leading online platform, www.homebistro.com, that\nprovides for the creation, production, and distribution of\ndirect-to-consumer, heat-to-eat, celebrity chef inspired gourmet meals,\nwhich currently include inspirations developed by \"Iron Chef\" Cat Cora,\n\"Hungry Fan\" Chef Daina Falk, \"Master Chef\" Claudia Sandoval, \"Top-Chef\nAll-Star\" Richard Blais and soon to launch celebrity chefs Ayesha Curry and\nRoble Ali.\n\n   Home Bistro's Model Meals lifestyle brand www.modelmeals.com is a\nWhole30 and Paleo approved, ready-to-eat, meal prep service, offering a\nweekly rotating menu that is prepared by professional chefs, using only the\nhighest quality ingredients available, sourced responsibly and locally, and\ndelivered in sustainable, eco-friendly packaging.\n\n   Forward-Looking Information\n\n   This news release contains forward-looking statements and\nforward-looking information within the meaning of applicable securities\nlaws. These statements relate to future events or future performance. All\nstatements other than statements of historical fact may be forward-looking\nstatements or information. Generally, forward-looking statements and\ninformation may be identified by the use of forward-looking terminology\nsuch as \"plans\", \"expects\" or \"does not expect\", \"proposed\", \"is expected\",\n\"budgets\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\"\nor \"does not anticipate\", or \"believes\", or variations of such words and\nphrases, or by the use of words or phrases which state that certain\nactions, events or results may, could, would, or might occur or be\nachieved. More particularly and without limitation, this news release\ncontains forward-looking statements and information concerning the\nCompany's growth objectives and industry outlook (as described herein).\nForward-looking statements consist of statements that are not purely\nhistorical, including any statements regarding beliefs, plans, expectations\nor intentions regarding the future. These forward-looking statements\ninclude, among others, statements about the Company's future financial\nperformance, the impact of management changes, any organizational\nrestructuring and the sufficiency of capital resources to fund its ongoing\noperating requirements; statements about the Company's expectations\nregarding the capitalization, resources and ownership structure; and any\nother statements other than statements of historical fact. Actual results\nor events could differ materially from the plans, intentions and\nexpectations disclosed in the forward-looking statements that the Company\nmakes due to a number of important factors, including (i) risks related to\nthe combined entity's access to existing capital and fundraising prospects\nto fund its ongoing operations, and (ii) other business effects, including\nthe effects of industry, market, economic, political or regulatory\nconditions, future exchange and interest rates, and changes in tax and\nother laws, regulations, rates and policies, including the impact of\nCOVID-19 on the broader market. Readers are cautioned not to place undue\nreliance on forward-looking statements, as there can be no assurance that\nthe plans, intentions or expectations upon which they are based will occur.\nBy their nature, forward-looking statements involve numerous assumptions,\nknown and unknown risks and uncertainties, both general and specific that\ncontribute to the possibility that the predictions, estimates, forecasts,\nprojections and other forward-looking statements will not occur.\n\n   The forward-looking statements contained in this press release are made\nas of the date of this press release. Except as required by law, the\nCompany disclaims any intention and assumes no obligation to update or\nrevise any forward-looking statements, whether as a result of new\ninformation, future events or otherwise. Detailed information regarding\nfactors that may cause actual results to differ materially from the results\nexpressed or implied by statements in this press release relating to the\nCompany may be found in the Company's periodic filings with the Securities\nand Exchange Commission, including the factors described in the sections\nentitled \"Risk Factors\", copies of which may be obtained from the SEC's\nwebsite at www.sec.gov. Additionally, the Company undertakes no obligation\nto comment on the expectations of, or statements made by, third parties in\nrespect of the matters discussed above.\n\nZalmi Duchman, CEO\nzalmi@homebistro.com\nPh: 631.694.1111\n\nTel   : 561-227-2727    HOME BISTRO INC\nWWW   : <a href=\"https://www.homebistro.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.homebistro.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203000338.MNPRE2203001158-05465220220131</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}