{"date": "2022-01-05 17:00:49+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3350.44, "close": 3265.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By David Randall</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW YORK, Jan 5 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Apple's rally to a $3 trillion market valuation <a href=\"https://www.reuters.com/markets/europe/apple-gets-closer-3-trillion-market-value-2022-01-03\" data-type=\"url\" class=\"tr-link\" translate=\"no\">earlier this week</a> has re-focused investors’ attention on the mammoth growth stocks that accounted for a large chunk of the S&amp;P 500’s gain in 2021, and whether they can continue pushing the index higher in the new year. </p><p>     Microsoft <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MSFT.O\" data-type=\"ric\" data-ric=\"MSFT.O\" translate=\"no\" dir=\"ltr\">MSFT.O</a>, Apple <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a>, Nvidia <a href=\"reuters://REALTIME/Verb=FullQuote/ric=NVDA.O\" data-type=\"ric\" data-ric=\"NVDA.O\" translate=\"no\" dir=\"ltr\">NVDA.O</a>, Alphabet <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a>, and Tesla <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TSLA.O\" data-type=\"ric\" data-ric=\"TSLA.O\" translate=\"no\" dir=\"ltr\">TSLA.O</a> accounted for nearly a third of the S&amp;P 500’s total return last year, according to data from UBS Global Wealth Management. That’s more than double the average contributed by the index's <span class=\"tr-strong\">five largest gainers </span>since 1985, the bank said. The S&amp;P 500 returned 28.7% last year, including dividends. </p><p>The explosive growth delivered by giant, tech-focused names has helped fuel the S&amp;P’s meteoric rise over the past decade. Yet some investors worry big tech stocks may have a tougher time delivering big gains this year, in the face of stretched valuations, expectations of higher Treasury yields and a more hawkish Federal Reserve. </p><p>At 27.9, the forward price-to-earnings ratio of the S&amp;P 500 tech sector is near its highest level since 2004, and well above the 21.3 of the broad market, according to Yardeni Research. Nvidia trades at 56 times forward earnings, while Tesla, part of the consumer discretionary sector, trades at 119 times forward earnings. </p><p>Rich valuations could make those stocks more vulnerable to higher yields, with the Fed expected to raise rates several times this year, said Saira Malik, chief investment officer of global equities at Nuveen.</p><p>\"The broad returns in tech that we've seen in the past year have been based in part on supportive monetary policy that we won't see in 2022<span class=\"tr-strong\">,\"</span> she said.</p><p>The sometimes fraught relationship between higher yields <span class=\"tr-strong\">- which threaten to erode companies' future earnings - </span>and technology stocks was on display Tuesday, when bets on U.S. economic strength fueled a rise in Treasury yields and boosted shares of energy companies, banks and industrials while weighing on tech stocks. </p><p>Tech stocks were having another rough day on Wednesday, with the Nasdaq Composite Index <a href=\"reuters://REALTIME/Verb=FullQuote/ric=IXIC\" data-type=\"ric\" data-ric=\"IXIC\" translate=\"no\" dir=\"ltr\">IXIC</a> recently off 0.7%. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2TK24F\" data-type=\"storyId\" data-story-id=\"nL1N2TK24F\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2TL290\" data-type=\"storyId\" data-story-id=\"nL4N2TL290\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>While Malik is maintaining positions in giant tech stocks that have lagged the broad market, including Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, she is also focusing on energy companies like Pioneer Natural Resources Co <a href=\"reuters://REALTIME/Verb=FullQuote/ric=PXD.N\" data-type=\"ric\" data-ric=\"PXD.N\" translate=\"no\" dir=\"ltr\">PXD.N</a>, <span class=\"tr-strong\">which she expects to </span>benefit from rising demand for jet fuel as business and leisure travel bounces back. </p><p>\"We're expecting to see more dispersion in the market as returns become broader and Covid variants have less impact on mobility,\" Malik said. </p><p><span class=\"tr-strong\">Easing worries over the </span><a href=\"https://www.reuters.com/business/healthcare-pharmaceuticals/who-sees-more-evidence-that-omicron-affects-upper-respiratory-tract-2022-01-04\" data-type=\"url\" class=\"tr-link\" translate=\"no\">severity</a><span class=\"tr-strong\"> of the Omicron wave could also sap some demand for tech stocks, said Scott Wren, senior global market strategist at Wells Fargo Investment Institute.</span></p><p><span class=\"tr-strong\">Because their earnings are less sensitive to economic fluctuations, tech stocks have often acted as a haven for investors amid COVID-19 worries, while many companies in the sector also benefited from the stay-at-home trend of the last two years. </span></p><p>Though he expects technology stocks to keep pace with the market, Wren is also overweight industrial stocks that should benefit from infrastructure spending in the United States. </p><p>UBS, meanwhile, wrote on Tuesday that big technology companies no longer look as attractive as smaller companies that do not focus on consumers. </p><p>\"We no longer see [mega-caps] as the best place to look for outsized returns in the tech sector. We expect more value to come from artificial intelligence, big data, and cybersecurity,\" their report noted. </p><p><span class=\"tr-strong\">Earnings for the S&amp;P 500 information technology sector <a href=\"reuters://REALTIME/Verb=FullQuote/ric=.SPLRCT\" data-type=\"ric\" data-ric=\".SPLRCT\" translate=\"no\" dir=\"ltr\">.SPLRCT</a> are expected to have climbed 15.9% for the fourth quarter versus a 22.3% rise for the S&amp;P 500 overall, according to Refinitiv IBES.</span></p><p>Recent declines in high-valuation technology stocks suggests investors are increasingly focusing on companies that have the ability to pass on <a href=\"https://www.reuters.com/business/nov-cpi-heats-up-highest-year-on-year-rate-since-1982-2021-12-10\" data-type=\"url\" class=\"tr-link\" translate=\"no\">rising prices</a> to consumers as the economy continues to fully rebound from the coronavirus pandemic, said Jack Janasiewicz, a portfolio manager at Natixis Investment Managers. </p><p>He recently increased his overweights in cyclical sectors such as financials and homebuilders.</p><p>\"We think we're past the peak of the risk cycle where people were willing to bet on technology names just because they were tech,\" he said.</p><p><br/></p><p><br/></p><p class=\"tr-signoff\"> (Reporting by David Randall; Additional reporting by Lewis Krauskopf; Editing by Ira Iosebashvili and Nick Zieminski)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:David.Randall@thomsonreuters.com\" data-type=\"email\" translate=\"no\">David.Randall@thomsonreuters.com</a> ; 646-223-6607; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://david.randall.thomsonreuters.com@reuters.net\">david.randall.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-FUNDS/TECH-STOCKS (ANALYSIS, PIX)</p></div>"}