{"date": "2021-11-29 13:00:01.063000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>The collaboration will establish a dedicated Virtusa AWS Business Group with an added focus on strategic global accounts, ISV modernization and a solution enhanced Professional Services relationship</strong></p><p>SOUTHBOROUGH, Mass., Nov.  29, 2021  (GLOBE NEWSWIRE) --  <a href=\"https://www.globenewswire.com/Tracker?data=OWV2458a0qKxQzDIHL23Q4ibgAuva0DoSFoJTFHpiubmvj7-nwQUrxH35jYirbdvNx0YM-M8e6Y2ZZUJHMmS2q2UdV3bdpiPKlqDDp5GDIQ=\"><u>Virtusa Corporation</u></a> today announced that they are extending their Strategic Collaboration Agreement (SCA) with Amazon Web Services, Inc. (AWS) to empower global organizations to unlock more value, efficiency and profitability via cloud-based services.</p>    <p>Virtusa has been a participant of the AWS Partner Network (APN) for more than ten years and today’s announcement builds upon that success. The AWS Partner Network (APN) is the global community of partners using AWS to build solutions and services for customers. AWS has millions of active customers and a dynamic community of over 100,000 partners from more than 150 countries.</p>    <p>Underlying this agreement will be the creation of a joint business group to help clients more quickly move their processes, applications, and data to the cloud. The Virtusa AWS Business Group (VABG) brings together dedicated professionals from each company with expertise in cloud solutions architecture, development and managed cloud operations coupled with industry consulting and domain expertise.</p>    <p>The two companies will focus on three additional growth initiatives under the SCA. These three initiatives will accelerate cloud adoption for global and multi-national enterprises, expedite ISV (High-Tech software companies) cloud modernization and growth and broaden Virtusa’s long-standing partnership with AWS’s ProServe organization with a focus on vertical solutions.</p>    <p><strong>Accelerate cloud adoption: </strong>Global and multi-national enterprises typically have operations in multiple countries, complex buying requirements, and significant growth potential. Many of them are challenged by technology buying decisions which usually occur in a regional or federated operating model. Those factors make it challenging to balance global efficiencies and economies of scale while also leveraging the innovations happening across their organization. </p>    <p>Virtusa has been working with AWS to help businesses overcome these challenges and accelerate transformation efforts globally. The two companies are currently working across multiple global accounts in targeted industries. As part of this agreement, Virtusa and AWS will create a dedicated team focused on expanding named Global Fortune 500 accounts with an initial focus in the industries where Virtusa has deep expertise: Financial Services, Healthcare, Life Sciences, Media &amp; Entertainment, and Telecommunications.</p>    <p>Virtusa and AWS will provide customers with several significant benefits:</p>    <ul type=\"disc\" class=\"bulleted-list arrowlist\"><li>A dedicated global account team</li><li>Access to an AWS Cloud Center of Excellence (CCoE)</li><li>Cloud foundation migration assets</li><li>Industry frameworks for Cloud Native application development</li></ul>    <p>“We are seeing worldwide enterprises face a skills shortage at a time when they need to move faster than ever before to capture new and emerging opportunities for growth,” said Cam McNaught, Director, AWS Partner Core at AWS. “As a global organization with over 30,000 engineers, Virtusa has the scale, industry expertise, cutting edge engineering skills, and customer intimacy to accelerate the cloud journey of our customers. We are confident that this collaboration extension will help deliver significant differentiated value and strategic innovations for our mutual customers.”</p>    <p><strong>Expedite ISV modernization and growth</strong>: As businesses embrace SaaS-based operating models, leading ISVs require extensive support and expert product builders to create next-generation platforms. Legacy systems are holding many ISVs back from capitalizing on new business initiatives – with many turning to application modernization to remove these obstacles. Virtusa and AWS provide comprehensive cloud modernization services and commercial incentives to help ISVs quickly remove these barriers to growth.</p>    <p>Virtusa specializes in AWS migrations and implementing custom modifications that ensure smooth integration with a customers' existing infrastructure. As a result, ISVs can accelerate product innovation and rollouts while also improving overall operations. Under the agreement, the two companies will provide end-to-end Cloud modernization services to help ISVs create, adopt, accelerate, and optimize SaaS based solutions using AWS.</p>    <p>As part of this effort, both companies will provide a comprehensive set of consulting and technology services to support ISVs in migrating the client base to AWS public and hybrid cloud-based services. This program will operate globally and be initially targeted at ISVs within select industries, including Banking &amp; Insurance, Healthcare &amp; Life Sciences, Telecommunications, Media &amp; Technology.</p>    <p>“Virtusa is our global technology partner who has helped us design, build and now manages technology operations for our IoT &amp; Data Analytics platform, which operates across multiple AWS public cloud services,” said Eric Martinez, CEO of Modjoul, an ISV focused on worker safety automation. “Both Virtusa and AWS are deeply trusted partners who we rely heavily on to both run and scale our business.”</p>    <p><strong>Enhanced ProServe agreement with a vertical solution focus: </strong>Virtusa and AWS are expanding their existing Professional Services to put an emphasis on driving greater business outcomes in specific industries and accounts from co-sell through delivery. The companies will provide vertical industry solutions created by Virtusa and running on AWS, including Virtusa’s Open Innovation Platforms for Banking and Financial Services, Healthcare and Life Sciences, and Telecom and Media industries.</p>    <p>As part of this agreement, Virtusa has committed to the establishment of a dedicated AWS focused co-sell and co-delivery function exclusively to support the end customers looking to partner with Virtusa and AWS ProServe. Virtusa brings deep industry expertise to AWS customers across primary industries.</p>    <p>“Virtusa and AWS are helping businesses by providing the skills, expertise, tools, and accelerators to build strategic cloud platforms as well as to more systematically close the skills gap and remove that as a barrier to growth,” said Santosh Thomas, CEO of Virtusa. “The work builds on the tremendous success over the past ten years and is designed to enable companies to innovate faster, operate more efficiently, establish new markets, and grow revenue.”</p>    <p>The journey to the cloud comes with many challenges. Legacy applications, getting consensus, and technical debt are only some of the roadblocks enterprises face with modernization. Virtusa helps enterprises overcome complex cloud adoption challenges, at any stage of their journey.</p>    <p>By migrating on-premises applications to AWS, enterprises are accelerating the speed of innovation and managing scale, agility and significantly lowering the cost of operations. Virtusa’s AWS Migration competency, award-winning migration framework, and unique AWS Migration Workbench, coupled with experience in large-scale migration programs, enables more than 30% productivity gains.</p>    <p><strong>A foundation for growth</strong></p>    <p>Today’s announcement builds upon a decade of successful collaboration between Virtusa and AWS. Together, the two companies have established a robust set of solutions and services to help companies realize the total value of the cloud.</p>    <p>Virtusa is a Premier Global Consulting partner with relevant competencies in Migration, DevOps, Data &amp; Analytics, SaaS, Digital Workplace, Financial Services, Life Sciences and Healthcare. Over the past ten years, Virtusa has worked with AWS to build an award-winning platform for migrating application and data workloads to AWS services. Virtusa has taken these services and customized them to include the support for ISVs in migrating their platforms and reengineering them in the process.  </p>    <p>To learn more about Virtusa’s AWS partnership and services visit: <a href=\"https://www.globenewswire.com/Tracker?data=LreBOcTUUiFK-xeZMNr-o9BdjZJ26MKNoNh9Tp2Q27VQs3dz7ASfWvGs06rrH8GHQrW-w4Pl3AFkuHtDsNWYHq9pL8TVXddfO0_Kk7d8FwBa_GEV6seYtfn5knJWDQbT\"><u>https://www.virtusa.com/partners/aws</u></a></p>    <p>To learn more about Virtusa’s Open Innovation Industry Platforms running on AWS cloud visit:<br/>Banking &amp; Financial Services: <a href=\"https://www.globenewswire.com/Tracker?data=LreBOcTUUiFK-xeZMNr-o9BdjZJ26MKNoNh9Tp2Q27VYWR8pxOr0Pyj1FvyzQKvd_BrqnKY8slMEAOpsQlumdhu8TjaIAC3uQF_f4VqLX0uol3NzCu5J3hlB5rbZ-AYhAJ3gx2KZofnTkZqtXtKGQy7hb5QsyxjEhxekPclyDhQ=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.virtusa.com/solutions/open-banking</a><br/>Healthcare &amp; Life Sciences: <a href=\"https://www.globenewswire.com/Tracker?data=LreBOcTUUiFK-xeZMNr-o9BdjZJ26MKNoNh9Tp2Q27WIhFTExeuUZQgI13D9bDrYiwyqMkGB6GpRlpRxmfrgvMlyBK3y-yXeUsN2j3fujd3nrec-p6CdCQivvokeKoS8iGgNcoOJjm0j2G0D9lnTOA==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.virtusa.com/solutions/vlife</a><br/>Telecommunications &amp; Media: <a href=\"https://www.globenewswire.com/Tracker?data=LreBOcTUUiFK-xeZMNr-o9BdjZJ26MKNoNh9Tp2Q27UzqDd9lcRTAQBpgKc1D5y7cahC_9CULppJYDvFRezmfQ9me4VpObmouxUBIorRvGZWEMyJuSHlaEmy02Rg8W73__uZ40KTE6C4cWdJ5lxZXA==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.virtusa.com/solutions/icomms</a></p>    <p><strong>About Virtusa</strong><br/>Virtusa Corporation is a global provider of digital business strategy, digital engineering, and information technology (IT) services and solutions that help clients change, disrupt, and unlock new value through innovation engineering. Virtusa serves Global 2000 companies in Banking, Financial Services, Insurance, Healthcare, Communications, Media, Entertainment, Travel, Manufacturing, and Technology industries.</p>    <p>Virtusa helps clients grow their business with innovative products and services that create operational efficiency using digital labor, future-proof operational and IT platforms, and rationalization and modernization of IT applications infrastructure. This is achieved through a unique approach blending deep contextual expertise, empowered agile teams, and measurably better engineering to create holistic solutions that drive business forward at unparalleled velocity enabled by a culture of cooperative disruption.</p>    <p>Virtusa is a registered trademark of Virtusa Corporation.  All other company and brand names may be trademarks or service marks of their respective holders.</p> <div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODQwMjAyNCM0NTg2MDc1IzUwMDA2NjIxNg==\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RRd01qQXlOQ00wTlRnMk1EYzFJelV3TURBMk5qSXhOZz09&amp;key=30b30aaf53b48469b4ac6c4a2e396df6ba25e0fc72b6153401eebda84aa95784b105a6f959029987a47404d89ebacc7cde684f2365549d3b28833e666b9c900c\"/></div></div> <br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/NGM3NDE5MjAtNjE5YS00ODJjLThiYWUtZGM5MWVkNzNmZjU4LTUwMDA2NjIxNg==/tiny/Virtusa-Corporation.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9OR00zTkRFNU1qQXROakU1WVMwME9ESmpMVGhpWVdVdFpHTTVNV1ZrTnpObVpqVTRMVFV3TURBMk5qSXhOZz09L3RpbnkvVmlydHVzYS1Db3Jwb3JhdGlvbi5wbmc=&amp;key=de1c6c231a9c8976eb640db62e8f3b3896d3c90d1d114e9aebb9bd2575716e4fb2f510e9b4ab6c426d5b2133ed9ae43719331a6cbf17afff272ff50012881222\"/></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright GlobeNewswire, Inc. 2021</p></div>"}