{"date": "2021-12-09 20:38:25.260000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.16, "close": 3444.24}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Robotic vacuum cleaners halted in their tracks. Doorbell cameras stopped watching for package thieves, though some of those deliveries were canceled anyway. <a href=\"https://www.independent.co.uk/topic/netflix\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Netflix</a> and Disney movies got interrupted and The Associated Press had trouble publishing the news.</p><p>A major outage in Amazon's cloud computing network Tuesday severely disrupted services at a wide range of U.S. companies for hours, raising questions about the vulnerability of the internet and its concentration in the hands of a few firms.</p></div><div class=\"tr-npp-body\"><p>HOW DID IT HAPPEN?</p><p><a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> has still said nothing about what, exactly, went wrong. The company limited its communications Tuesday to terse technical explanations on an <a href=\"https://www.independent.co.uk/topic/amazon-web-services\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Web Services</a> dashboard and a brief statement delivered via spokesperson Richard Rocha that acknowledged the outage had affected Amazon's own warehouse and delivery operations but said the company was \"working to resolve the issue as quickly as possible.\" It didn't immediately respond to further questions Wednesday.</p><p>The incident at Amazon Web Services mostly affected the eastern U.S., but still impacted everything from airline reservations and auto dealerships to payment apps and video streaming services to Amazon's own massive e-commerce operation.</p><p>WHAT IS AWS?</p><p>Amazon Web Services is a cloud-service operation — it stores its customers' data, runs their online activities and more — and a huge profit center for Amazon. It holds roughly a third of the $152 billion market for cloud services, according to a report by Synergy Research Group — a larger share than its closest rivals, <a href=\"https://www.independent.co.uk/topic/microsoft\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Microsoft</a> and Google, combined.</p><p>It was formerly run by Amazon CEO Andy Jassy, who succeeded founder <a href=\"https://www.independent.co.uk/topic/jeff-bezos\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Jeff Bezos</a> in July.</p><p>TOO MANY EGGS IN ONE BASKET?</p><p>Some cybersecurity experts have warned for years about the potentially ugly consequences of allowing a handful of big tech companies to dominate key internet operations.</p><p>\"The latest AWS outage is a prime example of the danger of centralized network infrastructure,\" said Sean O'Brien, a visiting lecturer in cybersecurity at Yale Law School. \"Though most people browsing the internet or using an app don't know it, Amazon is baked into most of the apps and websites they use each day.\" O'Brien said it's important to build a new network model that resembles the peer-to-peer roots of the early internet. Big outages have already knocked huge swaths of the world offline, as happened during an October Facebook incident.</p><p>Even under the current model, companies do have some options to split their services between different cloud providers, although it can be complicated, or to at least make sure they can move their services to a different region run by the same provider. Tuesday's outage mostly affected Amazon's \"US East 1\" region.</p><p>\"Which means if you had critical systems only available in that region, you were in trouble,\" said Servaas Verbiest, lead cloud evangelist at Sungard Availability Services. \"If you heavily embraced the AWS ecosystem and are locked into using solely their services and functions, you must ensure you balance your workloads between regions.\"</p><p>HASN'T THIS HAPPENED BEFORE?</p><p>Yes. The last major AWS outage was in November 2020. There have been been numerous other disruptive and lengthy internet outages involving other providers. In June, the behind-the-scenes content distributor Fastly suffered a failure that briefly took down dozens of major internet sites including CNN, The New York Times and Britain's government home page. Another that month affected provider Akamai during peak business hours in Asia in June.</p><p>In the October outage, Facebook — now known as Meta Platforms — blamed a \"faulty configuration change\" for an hours-long worldwide outage that took down Instagram and WhatsApp in addition to its titular platform.</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/news/world/americas/amazon-amazon-web-services-jeff-bezos-microsoft-southwest-airlines-b1971777.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Major outage at Amazon disrupts businesses across the US</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/amazon-southwest-airlines-amazon-web-services-delta-air-lines-dallas-b1971724.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Major outage hits Amazon Web Services; many sites affected</a> </p><p><a href=\"https://www.independent.co.uk/news/kshama-sawant-seattle-ed-murray-amazon-indian-b1971060.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Socialist Kshama Sawant faces recall vote in Seattle</a> </p><p><a href=\"https://www.independent.co.uk/news/kshama-sawant-seattle-ed-murray-amazon-republican-b1970798.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Socialist Kshama Sawant faces recall vote in Seattle</a> </p><p><a href=\"https://www.independent.co.uk/news/business/amazon-visa-credit-card-ban-uk-b1970623.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon faces losing up to £1.4 billion from UK shoppers over Visa ban</a> </p><p><a href=\"https://www.independent.co.uk/news/world/americas/amazon-game-board-warehouse-workers-tiktok-b1970534.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon worker shares dystopian gameboard which monitors how hard staff are working</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Independent, The (UK) (Online). All rights reserved.</p></div>"}