{"date": "2021-12-16 18:24:21.160000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3466.3, "close": 3400.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Streaming services have greatly expanded in over the last year and there are more choices for Canadians to binge on their favourite TV shows and movies over the winter months</p><p><span>Plan your screen time with the weekly What to Watch newsletter.</span><a href=\"https://www.theglobeandmail.com/newsletters/#newsletter-group-5\"><span>Sign up</span> </a><span>today.</span> </p></div><div class=\"tr-npp-body\"><p>So, another winter has come and you're still not feeling comfortable about stepping inside a multiplex? Luckily for you, the streaming landscape has only become even more diversified since this time last year – no longer are you simply limited to whatever Netflix's algorithm wants you to see.</p><p>To help expand your options – to an almost dizzying degree – we present an up-to-the-minute breakdown of the current Canadian streaming landscape. Prepare to drown in content over the next few chilly months – for a price.</p><p class=\"tr-npp-section-title\">Netflix</p><p class=\"tr-npp-section-title\">Who is it for?</p><p>Everyone, still. <a href=\"https://www.netflix.com/ca/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Netflix's</a> executives have said time and again that they want to appeal to as vast an audience as possible. The streamer's only competition, its CEO once famously remarked, is sleep. Which means that you have loads of children's entertainment, documentaries on serial killers, low-brow comedies, Mexican narco thrillers, high-prestige dramas, big-screen-ready action spectacles, controversial stand-up specials, and on and on and on. The streamer also remains the leader in producing original material, rather than relying on other studios' back catalogues. But the results have been mixed.</p><p class=\"tr-npp-section-title\">How much does it cost?</p><p>Plans for Canadian subscribers start at $9.99 per month and go up to $18.99 per month (the latter including Ultra HD, and the ability to watch four different programs on four different screens at the same time).</p><p class=\"tr-npp-section-title\">Crave</p><p class=\"tr-npp-section-title\">Who is it for?</p><p>Anyone who tried to find something on Netflix, and failed. Typically, the newer-release Hollywood movies will end up either on Netflix or <a href=\"https://www.crave.ca/en\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Crave</a> , though the latter seems to have a slight edge on bigger-blockbuster fare lately thanks to an output deal with Warner Bros. The Canadian-owned Crave also offers packages with access to HBO programming and its back catalogue of shows, including most (but not all) of HBO Max originals. Crave has also gone out of its way to highlight Canadian content, which is admirable … though also probably due to regulation, given that the service is owned by Bell.</p><p class=\"tr-npp-section-title\">How much does it cost?</p><p>The mobile plan is $9.99 and the \"total\" plan is $19.99; $5.99 extra if you want the Starz add-on.</p><p class=\"tr-npp-section-title\">Amazon Prime Video</p><p class=\"tr-npp-section-title\">Who is it for?</p><p>Anyone who wants free shipping with <a href=\"https://www.primevideo.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> , and might have time to watch some movies, too. The streaming service is mostly intended to drive customers to shop through Amazon – it's just basically a neat little treat for e-commerce. But there are also some solid movies to be found on the app, and some decent original programming, like the trashy-but-good superhero series <span>The Boys</span> . And the service has acquired a hefty number of Hollywood projects that were offloaded by Paramount over the past year, including Tom Clancy's <span>Without Remorse</span> and <span>Coming 2 America</span> .</p><p class=\"tr-npp-section-title\">How much does it cost?</p><p>It's free with an annual $79 Prime membership. Think of all the free shipping you can access while binging episodes of <span>The Good Fight</span> (just not the latest season, because those are only available to rent, for some maddening reason!).</p><p class=\"tr-npp-section-title\">Apple TV+</p><p class=\"tr-npp-section-title\">Who is it for?</p><p>The house that <a href=\"https://www.theglobeandmail.com/arts/television/article-ted-lasso-is-the-tv-series-we-totally-need-now-and-heres-why/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Ted Lasso</a> built is for anyone with an <a href=\"https://www.apple.com/ca/apple-tv-plus/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Apple product</a> who does not mind throwing a few bucks away each month for the promise of very expensive but not yet zeitgeist-capturing television shows (Mr. Lasso excepted). There's also the odd Tom Hanks movie now and then (the latest is <span>Finch</span> , after last year's <span>Greyhound</span> ). Most importantly: don't expect a big catalogue of back titles. Because … there aren't any. It's all Apple originals, all the time.</p><p class=\"tr-npp-section-title\">How much <span> does it cost?</span></p><p>$5.99 a month gets you everything on offer, but if you just got a new Apple product, you'll likely get a free year's subscription, too.</p><p class=\"tr-npp-section-title\">Disney+</p><p class=\"tr-npp-section-title\">Who is it for?</p><p>Families. <a href=\"https://www.disneyplus.com/en-ca\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Disney+</a> is like an ultra-reliable babysitter – there's guaranteed to be nothing on the service that might be objectionable viewing. Just keep the younger kids away from some of the more intense Marvel and Star Wars movies.</p><p class=\"tr-npp-section-title\">How much does it cost?</p><p>Disney this year hiked its price to $11.99 per month, or $119.99 per year.</p><p class=\"tr-npp-section-title\">Discovery+</p><p class=\"tr-npp-section-title\">Who is it for?</p><p>High-brow reality-TV junkies who don't really consider themselves into \"reality TV.\" Launched in Canada this past October, <a href=\"https://www.discoveryplus.com/ca\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Discovery+</a> is your one-stop shop for 60,000 episodes of programs from HGTV, Food Network, TLC, OWN, Travel Channel, Animal Planet and, naturally, Discovery Channel.</p><p class=\"tr-npp-section-title\">How much does it cost?</p><p>If you really want to replicate the home-viewing reality-TV experience, Discovery+ with ads is $4.99 per month. But $2 more will get you the ad-free version, with up to four concurrent streams available.</p><p class=\"tr-npp-section-title\">Paramount+</p><p class=\"tr-npp-section-title\">Who is it for?</p><p>Rebranded from CBS All Access, <a href=\"https://www.paramountplus.com/ca/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Paramount+</a> is one of the more … interesting … streamers in Canada. Mostly because a good deal of the bigger programs available from the U.S. version simply don't make it our way at the same time. (It took months for that Mark Wahlberg immortal warrior movie  <span>Infinite</span> to make it here. Ditto  <span>The Paw Patrol Movie</span> .) But if you really love CBS procedurals like the umpteenth versions of <span>NCIS</span> currently on the air, then Paramount+ might just be for you.</p><p class=\"tr-npp-section-title\">How much does it cost?</p><p>It will be $5.99 per month for all the <span>Hawaii Five-O</span> you could possibly stomach.</p><p class=\"tr-npp-section-title\">Criterion Channel</p><p class=\"tr-npp-section-title\">Who is it for?</p><p>Devoted cinephiles who have already stocked their shelves with those beautiful <a href=\"https://www.criterionchannel.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Criterion</a> DVDs and Blu-rays. And basically anyone who wants to stream a film made before 1983.</p><p class=\"tr-npp-section-title\">How much does it cost?</p><p>Less than a Criterion DVD, that's for sure: Just more than $14 a month for Canadians, or $133 for year-long access.</p><p class=\"tr-npp-section-title\">Kanopy</p><p class=\"tr-npp-section-title\">Who is it for?</p><p>Aiming for a slightly more upper-tier audience than mass-market streamers like Netflix, <a href=\"https://www.kanopy.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Kanopy</a> offers what it calls \"thoughtful entertainment\" that includes \"enriching films.\" Which translates to more art-house hits and undiscovered indie gems, plus a lot of documentaries.</p><p class=\"tr-npp-section-title\">How much does it cost?</p><p>Ah, that's the best part – it's free. So long as you have a membership to a library that's partnered with Kanopy – such as the Toronto Public Library system – you get free access to a half-dozen films each month. Free access is also granted to university students and faculty.</p><p class=\"tr-npp-section-title\">Hoopla</p><p class=\"tr-npp-section-title\">Who is it for?</p><p>Anyone who runs through all of Kanopy's catalogue, and is more inclined to seek out fresher art-house and genre offerings. Currently, options on <a href=\"https://www.hoopladigital.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Hoopla</a> range from Quentin Tarantino's <span>Jackie Brown</span> to this year's excellent under-the-radar Mads Mikkelsen film <span>Riders of Justice</span> to the decidedly low-rent Bruce Willis shlock <span>Midnight in the Switchgrass</span> . A true buffet of randomness.</p><p class=\"tr-npp-section-title\">How much does it cost?</p><p>Get ready for more great news: this one is also free! Same deal as Kanopy: it pays to get a library card.</p><p class=\"tr-npp-section-title\">CBC Gem</p><p class=\"tr-npp-section-title\">Who is it for?</p><p>Any fan of the national public broadcaster. Or those who usually avoid television but wouldn't mind watching a Canadian series, documentary, or movie now and then. Often, there are titles on <a href=\"https://gem.cbc.ca/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">CBC Gem</a> licensed from abroad, too, which creates an odd sensation of international confusion when scrolling through the app. Curation has become a little more spotty over the past year, though – here's hoping someone at the Ceeb takes tighter control of the catalogue soon. And some serious marketing dollars would help raise awareness, too.</p><p class=\"tr-npp-section-title\">How much does it cost?</p><p>If you don't mind watching a whole lot of annoying ads, then CBC Gem is free. But for a premium viewing experience, it will be $4.99 a month – that also gets you live access to CBC News Network.</p><p class=\"tr-npp-section-title\">BritBox</p><p class=\"tr-npp-section-title\">Who is it for?</p><p>Jointly owned by BBC Studios and ITV, the New York-based <a href=\"https://www.britbox.com/ca/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">BritBox</a> targets superfans of the comedies ( <span>Fawlty Towers</span> , <span>Gavin and Stacey</span> , <span>Are You Being Served?</span> ), police procedurals ( <span>Line of Duty</span> , <span>Dark Heart</span> ), and so very many mystery series ( <span>Midsomer Murders</span> , <span>Vera</span> , <span>Poirot</span> , <span>Miss Marple</span> ) that the British broadcast giants are renowned for. The Canadian version of the service – catalogue rights vary between regions, just as with Netflix et al. – currently boasts almost 400 titles.</p><p class=\"tr-npp-section-title\">How much does it cost?</p><p>For $8.99 per month, all of the Commonwealth empire is yours. Well, almost (see below) …</p><p class=\"tr-npp-section-title\">Acorn</p><p class=\"tr-npp-section-title\">Who is it for?</p><p><a href=\"https://acorn.tv/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Acorn</a> maintains its own hold on the streaming market targeted by Britbox by not being quite as, well, British. Operated by RLJ Entertainment, which is in turn owned by U.S. cable giant AMC Networks, Acorn started its life by selling British television series on VHS and DVD to North American audiences, before entering the SVOD market in 2013. But instead of focusing exclusively on British imports, Acorn zeroes in on what general manager Matthew Graham calls \"a certain sensibility.\" That translates to such titles as <span>Queens of Mystery</span> , <span>Doc Martin</span> , <span>Blood</span> ; Canadian hits such as <span>Slings &amp; Arrows</span> and the first three seasons of <span>Murdoch Mysteries</span> ; and properties both new and old from the BBC ( <span>Line of Duty</span> , <span>Lovejoy</span> ) and ITV ( <span>Manhunt</span> ) that, due to rights issues, don't automatically get funnelled into BritBox. Acorn has also expanded into producing original content as well.</p><p class=\"tr-npp-section-title\">How much does it cost?</p><p>Add $7.49 to your monthly expenses and you'll have all the British content you could possibly desire.</p><p class=\"tr-npp-section-title\">Highball TV</p><p class=\"tr-npp-section-title\">Who is it for?</p><p>A Canadian idea, the upstart streaming service <a href=\"https://www.highballtv.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Highball TV</a> specializes in finding underappreciated titles from the film-festival circuit and cradling them with loving, polite care. That means a lot of projects that look completely unfamiliar, but also cult-favourites such as <span>What We Do in the Shadows</span> and well-crafted original acquisitions such as the Canadian drama <span>Luba</span> .</p><p class=\"tr-npp-section-title\">How much does it cost?</p><p>It's cheaper than a film festival, at $7 a month or $70 a year.</p><p class=\"tr-npp-section-title\">Shudder</p><p class=\"tr-npp-section-title\">Who is it for?</p><p>Anyone who likes being scared out of their wits. <a href=\"https://www.shudder.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Shudder</a> specializes mostly in horror-centric entertainment, with frequent dips into less-frightening but equally icky genre exercises.</p><p class=\"tr-npp-section-title\">How much does it cost?</p><p>Ready to scream – out of joy? Plans start at $4.75 a month.</p><p class=\"tr-npp-section-title\">ZEE5</p><p class=\"tr-npp-section-title\">Who is it for?</p><p>Audiences exhausted by Western programming should start looking abroad, with their first stop being the international expansion of this India-based streamer. Offering more than 1,600 series from India, Pakistan and Bangladesh, plus 4,500-plus Bollywood and Indian-language films, <a href=\"https://www.zee5.com/global\" data-type=\"url\" class=\"tr-link\" translate=\"no\">ZEE5</a> aims to be the premiere streaming home for both the South Asian diaspora and global audiences. Not to be missed: <span>RRR</span> , the new film from Indian action legend S.S. Rajamouli ( <span>Baahubali</span> ) and Akshaye Khanna's <span>Stage of Siege: Temple Attack</span> .</p><p class=\"tr-npp-section-title\">How much does it cost?</p><p>While it will eventually be $84 a year, there's a special launch price of $49.99 (or $9.99 per month).</p><p>Follow this link to view this story on globeandmail.com: <a href=\"https://www.theglobeandmail.com/arts/television/article-best-streaming-service-canada-netflix-amazon-apple/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">What are the best streaming services in Canada? Comparing Netflix, Amazon Prime Video, Apple TV+ and more</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 The Globe and Mail Inc. and its licensors. All rights reserved.</p></div>"}