{"date": "2022-01-27 14:00:32.921000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2799.72, "close": 2792.75}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">Twitch to Collaborate with UMG on Original Content for the Live Streaming Service</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">SANTA MONICA, Calif. and SEATTLE, Jan. 27, 2022</p></div>\n\n<div class=\"xn-content\">\n\n<p>SANTA MONICA, Calif. and <span class=\"xn-location\">SEATTLE</span>, <span class=\"xn-chron\">Jan. 27, 2022</span> /PRNewswire/ -- Universal Music Group (UMG), the world leader in music-based entertainment, Twitch, and Amazon Music, today announced an expansion of the companies' agreements.</p>\n\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/512308/UMG.html\">\n                    <div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"(PRNewsfoto/Universal Music Group)\" src=\"https://mma.prnewswire.com/media/512308/UMG.jpg\" title=\"(PRNewsfoto/Universal Music Group)\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvNTEyMzA4L1VNRy5qcGc=&amp;key=d2d318ce016c4b66ee465256178149b931336fedd16594c547fae599b343a6c95c46168cc6ca534eaf50574a915446e4870ca9638a72588069d58857cd3a4311\"/></div></div>\n                        </a>\n                </p>\n\n    </div>\n<p>The expanded agreements will provide customers with enhanced access to some of the world's most popular music content on Amazon, including live streams, high quality and spatial audio, artist merchandise, and exclusive experiences with UMG's industry leading roster of artists from around the world.</p>\n<p>Additionally, Twitch and UMG will work together to foster new innovative opportunities for artists and labels to creatively and commercially engage with their fans and new audiences.</p>\n<p><span class=\"xn-person\">Michael Nash</span>, EVP, Digital Strategy, Universal Music Group said, \"With the breadth of their music services and products, and their dedicated focus on customers and creators, Amazon Music and Twitch are excellent strategic collaborators, committed to creating the best and most diverse experiences for fans across streaming music, live streaming, artist collaborations, and physical merchandise. With these agreements, we are proud to build on our track record of success in working closely with Amazon, and we're looking forward to delivering even more incredible experiences for our artists and music fans everywhere.\"</p>\n<p>\"Twitch embodies a creator-first culture, including empowering musicians,\" said <span class=\"xn-person\">Tracy Chan</span>, Head of Music at Twitch. \"Now, more than ever, we're excited to work with UMG in an effort to further broaden the scope of tools available for their artists to engage with fans, while also providing new avenues for their artists to earn meaningful income while streaming on Twitch.\"</p>\n<p>\"UMG has been a strategic collaborator for us, as we continue to evolve our service and bring our customers even more ways to engage with their favorite artists, and discover new music,\" said <span class=\"xn-person\">Steve Boom</span>, VP of Amazon Music. \"With these agreements, we're strengthening and expanding how we can continue to work together to provide unique and exclusive experiences and create even more content for listeners.\"</p>\n<p>Under the agreements, subscribers to Amazon Music Unlimited will have access to stream even more music in HD, Ultra HD, and spatial audio from UMG's expansive catalog. Amazon Music and UMG will also continue to work together to enhance the fan experience when discovering and purchasing authentic merchandise from their favorite artists directly from the Amazon Music app, including apparel from UMG's Bravado, the industry's leading merchandise company. This will make it even easier for UMG artists to develop premium campaigns for their most important moments. Just in the last year, Amazon Music and UMG collaborated with artists including Billie Eilish (Interscope), <span class=\"xn-person\">Selena Gomez</span> (Interscope), and The Weeknd (Republic) to create exclusive merchandise collections tied to their new album campaigns. And most notably, Amazon Music worked with Ye (Def Jam) to launch limited-edition apparel engineered by Demna for the #FreeLarryHoover Benefit Concert, sold exclusively in the Amazon Fashion store and in the Amazon Music app for a limited time.</p>\n<p>Twitch has also agreed to provide commercial opportunities for UMG and its artists to engage directly with fans through its suite of products. UMG will foster the creation of artist and label channels on Twitch and work closely with Twitch to produce an exclusive series of artist features and experiences, in addition to other music-based content, specifically for the service. This will enable UMG to provide unique opportunities for brands to communicate with passionate and engaged audiences.</p>\n<p><b>About Universal Music Group</b></p>\n<p>At Universal Music Group, we exist to shape culture through the power of artistry. UMG is the world leader in music-based entertainment, with a broad array of businesses engaged in recorded music, music publishing, merchandising and audiovisual content. Featuring the most comprehensive catalogue of recordings and songs across every musical genre, UMG identifies and develops artists and produces and distributes the most critically acclaimed and commercially successful music in the world. Committed to artistry, innovation and entrepreneurship, UMG fosters the development of services, platforms and business models in order to broaden artistic and commercial opportunities for our artists and create new experiences for fans. For more information, visit <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3426092-1&amp;h=2186957235&amp;u=http%3A%2F%2Fwww.universalmusic.com%2F&amp;a=www.universalmusic.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.universalmusic.com</a></u>.</p>\n<p><b>About Amazon Music</b> </p>\n<p>Amazon Music reimagines music listening by enabling customers to unlock millions of songs and thousands of curated playlists and stations with their voice. Amazon Music provides unlimited access to new releases and classic hits across iOS and Android mobile devices, PC, Mac, Echo, and Alexa-enabled devices including Fire TV and more. With Amazon Music, Prime members have access to ad-free listening of 2 million songs at no additional cost to their membership. Listeners can also enjoy the premium subscription service, Amazon Music Unlimited, which provides access to more than 75 million songs and the latest new releases. Amazon Music Unlimited customers also now have access to the highest-quality listening experience available, with more than 75 million songs available in High Definition (HD), more than 7 million songs in Ultra HD, and a growing catalog of spatial audio. Customers also have free access to an ad-supported selection of top playlists and stations on Amazon Music. All Amazon Music tiers now offer a wide selection of podcasts at no additional cost, and live streaming in partnership with Twitch. Engaging with music and culture has never been more natural, simple, and fun. For more information, visit <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3426092-1&amp;h=2966644339&amp;u=https%3A%2F%2Fcts.businesswire.com%2Fct%2FCT%3Fid%3Dsmartlink%26url%3Dhttp%253A%252F%252Famazonmusic.com%252F%26esheet%3D52550046%26newsitemid%3D20211214005409%26lan%3Den-US%26anchor%3Damazonmusic.com%26index%3D7%26md5%3D12bdae76f4b80cd3cfa26c8340198abb&amp;a=amazonmusic.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazonmusic.com</a> or download the Amazon Music app. </p>\n<p><b>About Twitch</b></p>\n<p>Launched in 2011, Twitch is an interactive livestreaming service and global community that comes together every day to create unique, live, and unpredictable experiences from the interactions of millions. It brings the joy of co-op to everything, from casual gaming and world-class esports to anime marathons, music, and art streams. Twitch also hosts <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3426092-1&amp;h=712190273&amp;u=https%3A%2F%2Fwww.twitchcon.com%2F&amp;a=TwitchCon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">TwitchCon</a></u>, the biggest community event of the year, where tens of thousands of people come together to celebrate and connect with others who share their interests and passions. We're always live at <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3426092-1&amp;h=2286034938&amp;u=https%3A%2F%2Fwww.twitch.tv%2F&amp;a=Twitch\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Twitch</a></u>. Stay up to date on all things Twitch on <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3426092-1&amp;h=2800106079&amp;u=https%3A%2F%2Ftwitter.com%2FTwitch&amp;a=Twitter\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Twitter</a></u> and on our <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3426092-1&amp;h=2222376899&amp;u=https%3A%2F%2Fblog.twitch.tv%2Fen%2F&amp;a=Blog\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Blog</a></u>.</p>\n<p> </p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n</div>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=LA44252&amp;sd=2022-01-27\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1MQTQ0MjUyJnNkPTIwMjItMDEtMjc=&amp;key=25a38c7cf422d359b131e8f505b8068003fc2b04e77a8af30592a85e4f30ed3b61f63f0c7eca3ad1f9cdb5f750b1efd232c17831b6e3ddde952af152ff825247\"/></div></div> View original content to download multimedia:<a href=\"https://www.prnewswire.com/news-releases/universal-music-group-expands-relationship-across-amazon-music-and-twitch-301469648.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/universal-music-group-expands-relationship-across-amazon-music-and-twitch-301469648.html</a><p></p>\n<p>SOURCE  Universal Music Group</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: UNIVERSAL-MUSIC</p></div>"}