{"date": "2022-02-25 22:28:10.224000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3027.16, "close": 3071.26}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>As the Russian offensive in Ukraine continued, Kira Rudik, a former chief operating officer of the local branch of Amazon's Ring, said she was armed to resist an invasion in the country's capital.</p><p>The 36-year-old Ukrainian is currently a leader of a political party called Voice and has been a member of the country's parliament since 2019.</p></div><div class=\"tr-npp-body\"><p>On Friday, Rudik told CNN that she was in the Ukrainian capital city of Kyiv. \"We have been given Kalashnikovs and we will be able to resist if Russian forces come to Kyiv. I don't know if you can hear but there are strikes happening behind me and I can feel the glass trembling a little bit.\"</p><p>\"It is my duty to be here. I am armed and my crew is armed,\" she added.</p><p>According to her LinkedIn profile, Rudik was the COO of Ring, a smart security company that Amazon acquired in 2018, from September 2016 to September 2019. She holds a bachelor's degree in computer science and a master's degree in information technology from the National University of Kyiv.</p><p>Posing with a gun, the Ukrainian MP later tweeted: \"I learn to use #Kalashnikov and prepare to bear arms. It sounds surreal as just a few days ago it would never come to my mind. Our #women will protect our soil the same way as our #men. Go #Ukraine!\"</p><p>Tens of thousands of Ukrainians, mostly women and children, crossed into Poland, Romania, Hungary and Slovakia on Friday as Russian missiles pounded the capital Kyiv and men of fighting age were told to remain, according to media reports.</p><p>Ukrainian rules restrict men aged 18-60, who could be conscripted, from crossing the borders.</p><p>Many waited for hours in freezing conditions to leave Ukraine after Russian President Vladimir Putin launched the invasion, with lines of cars snaking for several kilometres towards some border crossings.</p><p>Explosions sounded before dawn in Kyiv as Western leaders scheduled an emergency meeting and Ukraine's president pleaded for international help. The nature of the explosions was not immediately clear, but the blasts came amid signs that the capital and largest Ukrainian city was increasingly threatened following a day of fighting that left more than 100 Ukrainians dead.</p><p>Ukraine President Volodymyr Zelenskyy said the government had information that subversive groups were encroaching on the city, and US Secretary of State Antony Blinken said Kyiv could well be under siege\" in what US officials believe is a brazen attempt by Russian President Vladimir Putin to dismantle the government and replace it with his own regime.</p><p>US Defence Secretary Lloyd Austin told lawmakers on a phone call that Russian mechanized forces that entered from Belarus were about 20 miles from Kyiv, according to a person familiar with the call.</p><p>The assault, anticipated for weeks by the US and Western allies and undertaken by Putin in the face of international condemnation and cascading sanctions, amounts to the largest ground war in Europe since World War II.</p><p>As Russian missiles bombarded cities and military bases, government leaders pleaded for help and for powerful sanctions against Russia. Civilians piled into trains and cars to flee and patrons of a hotel were directed into a shelter as explosions sounded in Kyiv.</p><p>Already, Ukraine officials said they had lost control of the decommissioned Chernobyl nuclear power plant, scene of the world's worst nuclear disaster.</p><p>Russia has embarked on a path of evil, but Ukraine is defending itself and won't give up its freedom, Zelenskyy tweeted. His grasp on power increasingly tenuous, he pleaded Thursday for even more severe sanctions than the ones imposed by Western allies and ordered a full military mobilisation that would last 90 days.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Business Standard Ltd.</p></div>"}