{"date": "2021-09-10 22:42:27.470000+00:00", "ticker": "ABDN", "mrkt_info": {"open": 257.5, "close": 261.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ABERDEEN EMERGING MARKETS EQUITY INCOME FUND (\"AEF-N\")\n- Distribution Payment Details\n\n     The following Aberdeen Standard Investments U.S. Closed-End Funds\nannounced today that the closed end funds in the chart directly below will\npay the distributions indicated on a per share basis on September 30, 2021\nto all shareholders of record as of September 20, 2021 (ex-dividend date\nSeptember 17, 2021).\n\n//st\n\n  Ticker   Exchange        Fund                                     Amount\n\n  ACP      NYSE            Aberdeen Income Credit Strategies Fund   $ 0.10\n\n  AEF      NYSE American   Aberdeen Emerging Markets Equity         $ 0.16\n                           Income Fund, Inc.\n\n  AGD      NYSE            Aberdeen Global Dynamic Dividend Fund    $ 0.065\n\n  AOD      NYSE            Aberdeen Total Dynamic Dividend Fund     $ 0.0575\n\n  ASGI     NYSE            Aberdeen Standard Global                 $ 0.1083\n                           Infrastructure Income Fund\n\n  AWP      NYSE            Aberdeen Global Premier Properties       $ 0.04\n                           Fund\n\n  FAX      NYSE American   Aberdeen Asia-Pacific Income Fund,       $ 0.0275\n                           Inc.\n\n  FCO      NYSE American   Aberdeen Global Income Fund, Inc.        $ 0.07\n\n  IFN      NYSE            The India Fund, Inc.                     $ 0.61\n\n//et\n\n     At the end of each calendar year, a Form 1099-DIV will be sent to\nshareholders, which will state the amount and composition of each fund's\ndistributions and provide information with respect to their appropriate tax\ntreatment for the prior calendar year. You should not draw any conclusions\nabout any of these fund's investment performance from the amount of the\ndistributions.\n\n     MANAGED DISTRIBUTION POLICY FUNDS\n\n     ANNOUNCE DISTRIBUTION PAYMENT DETAILS\n\n     Aberdeen Standard Global Infrastructure Income Fund (\"ASGI\")\n\n     Aberdeen Asia-Pacific Income Fund, Inc. (\"FAX\")\n\n     The India Fund, Inc. (\"IFN\")\n\n     The above-noted Aberdeen Standard Investments U.S. Closed-End Funds\n(the \"Funds\" or individually the \"Fund\"), today announced that the Funds\nwill pay the distributions noted in the chart above on September 30, 2021,\non a per share basis to all shareholders of record as of September 20, 2021\n(ex-dividend date September 17, 2021).\n\n     Each Fund has adopted a distribution policy to provide investors with\na stable distribution out of current income, supplemented by realized\ncapital gains and, to the extent necessary, paid-in capital in reliance on\nan exemptive order granted by the Securities and Exchange Commission.\n\n     Under applicable U.S. tax rules, the amount and character of\ndistributable income for each Fund's fiscal\n\n     year can be finally determined only as of the end of the Fund's fiscal\nyear. However, under Section 19 of\n\n     the Investment Company Act of 1940, as amended (the \"1940 Act\") and\nrelated rules, the Funds may be required to indicate to shareholders the\nestimated source of certain distributions to shareholders.\n\n     The following tables set forth the estimated amounts of the sources of\nthe distributions for purposes of Section 19 of the 1940 Act and the rules\nadopted thereunder. The tables have been computed based on generally\naccepted accounting principles. The tables include estimated amounts and\npercentages for the current distributions to be paid as well as for the\ncumulative distributions paid relating to fiscal year to date, from the\nfollowing sources: net investment income; net realized short-term capital\ngains; net realized long-term capital gains; and return of capital. The\nestimated compositions of the distributions may vary because the estimated\ncomposition may be impacted by future income, expenses and realized gains\nand losses on securities and currencies.\n\n     Each Fund's estimated sources of the current distributions to be paid\nand for its current fiscal year to date are as follows:\n\n//st\n\n  Estimated Amounts of Current Distribution per Share\n\nFund   Distri-  Net          Net         Net            Return of\n       bution   Investment   Realized    Realized       Capital\n       Amount   Income       Short-Term  Long-Term\n                             Gains**     Gains**\n\nASGI   $0.1083  $0.0260  24% $0.0704 65% $0.0032  3%    $0.0087   8%\n\nFAX    $0.0275  $0.0146  53% -       -   -        -     $0.0129  47%\n\nIFN    $0.6100  -        -   $0.0488 8%  $0.5612  92%   -        -\n\n//et\n\n//st\n\n  Estimated Amounts of Fiscal Year to Date Cumulative Distributions per\nShare\n\nFund  Fiscal    Net Investment  Net Realized   Net Realized  Return\n      Year*     Income          Short-Term     Long-Term     of\n      to Date                   Gains**        Gains Income  Capital\n      Distri-\n      bution\n      Amount\n\nASGI  $1.2996   $0.3120   24%   $0.8446  65%   $0.0390  3%   $0.1040   8%\n\nFAX   $0.3025   $0.1603   53%   -        -     -        -    $0.1422  47%\n\nIFN   $1.7700   -         -     $0.1416  8%    $1.6284  92%  -        -\n\n//et\n\n    *ASGI has a 9/30 fiscal year end; FAX has a 10/31 fiscal year end; IFN\nhas a 12/31 fiscal year end.\n\n     **includes currency gains\n\n     Where the estimated amounts above show a portion of the distribution\nto be a \"Return of Capital,\" it means that Fund estimates that it has\ndistributed more than its income and capital gains; therefore, a portion of\nyour distribution may be a return of capital. A return of capital may occur\nfor example, when some or all of the money that you invested in a Fund is\npaid back to you. A return of capital distribution does not necessarily\nreflect the Fund's investment performance and should not be confused with\n\"yield\" or \"income.\"\n     The amounts and sources of distributions reported in this notice are\nonly estimates and are not being provided for tax reporting purposes. The\nfinal determination of the source of all distributions for the current year\nwill only be made after year-end. The actual amounts and sources of the\namounts for tax reporting purposes will depend upon the Fund's investment\nexperience during the remainder of the fiscal year and may be subject to\nchange based on tax regulations. After the end of each calendar year, a\nForm 1099-DIV will be sent to shareholders for the prior calendar year that\nwill tell you how to report these distributions for federal income tax\npurposes.\n\n     The following table provides the Funds' total return performance based\non net asset value (NAV) over various time periods compared to the Funds'\nannualized and cumulative distribution rates.\n\n//st\n\n  Fund Performance and Distribution Rate Information\n\n  Fund             Average       Current         Cumulative    Cumulative\n                   Annual        Fiscal          Total         Distribution\n                   Total         Period's        Return on     Rate on NAV\n                   Return on     Annualized      NAV\n                   NAV for       Distribution\n                   the 5 Year    Rate on NAV\n                   Period\n                   Ending\n                   08/31/2021\n\n  ASGI             22.27%3       5.54%           28.24%        5.08%\n\n  FAX              4.05%         7.13%           6.08%         5.94%\n\n  IFN              11.52%        8.88%           19.71%        4.44%\n\n//et\n\n    1 Return data is net of all Fund expenses and fees and assumes the\nreinvestment of all distributions reinvested at prices obtained under the\nFund's dividend reinvestment plan.\n\n     2 Based on the Fund's NAV as of August 31, 2021.\n\n     3 The Fund launched within the past 5 years; the performance and\ndistribution rate information presented reflects data from inception (July\n29, 2020) through August 31, 2021.\n\n     Shareholders should not draw any conclusions about a Fund's investment\nperformance from the amount of the Fund's current distributions or from the\nterms of the distribution policy (the \"Distribution Policy\").\n\n     While NAV performance may be indicative of the Fund's investment\nperformance, it does not measure the value of a shareholder's investment in\nthe Fund. The value of a shareholder's investment in the Fund is determined\nby the Fund's market price, which is based on the supply and demand for the\nFund's shares in the open market.\n\n     Pursuant to an exemptive order granted by the Securities and Exchange\nCommission, the Funds may distribute any long-term capital gains more\nfrequently than the limits provided in Section 19(b) under the 1940 Act and\nRule 19b-1 thereunder. Therefore, distributions paid by the Funds during\nthe year may include net income, short-term capital gains, long-term\ncapital gains and/or a return of capital. Net income dividends and\nshort-term capital gain dividends, while generally taxable at ordinary\nincome rates, may be eligible, to the extent of qualified dividend income\nearned by the Funds, to be taxed at a lower rate not to exceed the maximum\nrate applicable to your long-term capital gains. Distributions made in any\ncalendar year in excess of investment company taxable income and net\ncapital gain are treated as taxable ordinary dividends to the extent of\nundistributed earnings and profits, and then as a return of capital that\nreduces the adjusted basis in the shares held. To the extent return of\ncapital distributions exceed the adjusted basis in the shares held,\n\n     capital gain is recognized with a holding period based on the period\nthe shares have been held at the date such amount is received.\n\n     The payment of distributions in accordance with the Distribution\nPolicy may result in a decrease in the Fund's net assets. A decrease in the\nFund's net assets may cause an increase in the Fund's annual operating\nexpense ratio and a decrease in the Fund's market price per share to the\nextent the market price correlates closely to the Fund's net asset value\nper share. The Distribution Policy may also negatively affect the Fund's\ninvestment activities to the extent that the Fund is required to hold\nlarger cash positions than it typically would hold or to the extent that\nthe Fund must liquidate securities that it would not have sold, for the\npurpose of paying the distribution. Each Fund's Board has the right to\namend, suspend or terminate the Distribution Policy at any time. The\namendment, suspension or termination of the Distribution Policy may affect\nthe Fund's market price per share. Investors should consult their tax\nadvisor regarding federal, state and local tax considerations that may be\napplicable in their particular circumstances.\n\n     Circular 230 disclosure: To ensure compliance with requirements\nimposed by the U.S. Treasury, we inform you that any U.S. tax advice\ncontained in this communication (including any attachments) is not intended\nor written to be used, and cannot be used, for the purpose of (i) avoiding\npenalties under the Internal Revenue Code or (ii) promoting, marketing or\nrecommending to another party any transaction or matter addressed herein.\n\n     In the United States, Aberdeen Standard Investments is the marketing\nname for the following affiliated, registered investment advisers: Aberdeen\nStandard Investments Inc., Aberdeen Asset Managers Ltd., Aberdeen Standard\nInvestments Australia Ltd., Aberdeen Standard Investments (Asia) Ltd.,\nAberdeen Capital Management, LLC, Aberdeen Standard Investments ETFs\nAdvisors LLC and Aberdeen Standard Alternative Funds Limited.\n\n     Closed-end funds are traded on the secondary market through one of the\nstock exchanges. A Fund's investment return and principal value will\nfluctuate so that an investor's shares may be worth more or less than the\noriginal cost. Shares of closed-end funds may trade above (a premium) or\nbelow (a discount)\n\n     the net asset value (NAV) of the fund's portfolio. There is no\nassurance that a Fund will achieve its investment objective. Past\nperformance does not guarantee future results.\n\n     If you If you wish to receive this information electronically, please\ncontact Investor.Relations@aberdeenstandard.com\n\n<a href=\"https://www.aberdeenstandard.com/en-us/cefinvestorcenter/fund-centre/closed\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.aberdeenstandard.com/en-us/cefinvestorcenter/fund-centre/closed</a>\n-end-funds\n\nContact:\nAberdeen Standard Investments Inc.\nInvestor Relations\n1-800-522-5465\nInvestor.Relations@aberdeenstandard.com\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2125200519.MNPRE2125201706-15105620210910</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}