{"date": "2021-12-03 15:11:46.274000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3443.72, "close": 3389.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>WONDERFI TECHNOLOGIES INC (\"WNDR-Z\")\n- Strategic Investment in Bitbuy, First Approved Crypto\n- Marketplace in Canada\n\n     WonderFi Technologies Inc. (the \"Company\" or \"WonderFi\") announced\nthat it has made a strategic investment into First Ledger Corp., the parent\ncompany of Bitbuy Technologies Inc. (\"Bitbuy\"), Canada's first approved\ncrypto marketplace.\n\n     \"WonderFi's strategic investment in Bitbuy, one of the first regulated\ncrypto marketplaces globally, is a significant step as we continue on our\nmission of democratizing finance through easy and secure access to\ndecentralized finance and crypto,\" said Ben Samaroo, CEO of WonderFi. \"Our\nalignment with Bitbuy opens up significant opportunities to create an\nend-to-end, unified customer experience. We are actively exploring\nintegration of our product suites which will expand the reach and scope\nthat WonderFi can offer to the market, and will drive long-term growth and\nvalue for the Company.\"\n\n     \"Whether Canadians are buying Bitcoin, Ethereum or altcoins, Bitbuy\nknows that price and best-execution matter,\" said Dean Skurka, President of\nBitbuy. \"We are proud to be a leader in providing transparency to the\nCanadian market, and pleased to have WonderFi as an investor and strategic\npartner.\"\n\n     Additional Information\n\n     For additional information, please contact:\n\n     WonderFi Technologies Inc.\n     Ben Samaroo, CEO\n     ben@wonder.fi\n     (778) 843-9637\n\n     Investor Relations Contact: invest@wonder.fi\n     Media Contact: press@wonder.fi\n\n     Bitbuy Technologies Inc.\n     Dean Skurka, President\n     dean@bitbuy.ca\n\n     Media Contact: binu.koshy@bitbuy.ca\n\n     ABOUT WONDERFI\n\n     WonderFi is a leading technology company with the mission of creating\nbetter access to DeFi through the core principles of simplicity and\neducation. WonderFi has a multi-pronged business strategy which includes a\nhigh-growth consumer finance app which will serve as a trusted gateway to\nthe new financial system, and a digital asset portfolio which consists of\nleading crypto and DeFi assets. WonderFi's executive team and Board of\nDirectors have an established track record in finance and crypto, with\nprevious experience at Amazon, Shopify, PayPal, Galaxy Digital, Hut 8 and\nBIGG Digital. WonderFi's core team of engineers and technologists believe\nthat everyone should have equal access to finance, and are aligned in the\nmission to empower people around the world to access DeFi in a simple,\nsmart and secure way. For more information, visit www.wonder.fi.\n\n     ABOUT BITBUY\n\n     Bitbuy is proudly Canadian owned and operates a crypto trading\nplatform regulated as a marketplace and licensed as a restricted dealer in\nCanada.  Our mission is to provide our clients the best global prices, the\ndeepest liquidity, and the most crypto asset products in Canada with a\nconvenient, dependable, and secure platform. Bitbuy's head office is in\ndowntown Toronto, with over 85 employees. Bitbuy is also registered with\nFINTRAC as a Money Services Business in the Virtual Asset Service Provider\ncategory. Bitbuy was founded in 2016 and is currently one of Canada's\nlargest crypto trading platforms by trading volume. Bitbuy offers crypto\ntrading services to beginners, advanced traders, and corporations, making\nit The crypto destination of investors.\n\n     Forward-Looking Information and Statements\n\n     This press release contains certain \"forward-looking information\"\nwithin the meaning of applicable Canadian securities legislation and may\nalso contain statements that may constitute \"forward-looking statements\"\nwithin the meaning of the safe harbor provisions of the United States\nPrivate Securities Litigation Reform Act of 1995. Such forward-looking\ninformation and forward-looking statements are not representative of\nhistorical facts or information or current condition, but instead represent\nonly the Company's beliefs regarding future events, plans or objectives,\nmany of which, by their nature, are inherently uncertain and outside of the\nCompany's control. Generally, such forward-looking information or\nforward-looking statements can be identified by the use of forward-looking\nterminology such \"could\", \"intend\", \"expect\", \"believe\", \"will\",\n\"projected\", \"estimated\", or variations of such words. The forward-looking\ninformation and forward-looking statements contained herein may include,\nbut are not limited to, information concerning: opportunities to create an\nend-to-end, unified customer experience, integration of product suites,\nexpansion of the reach and scope that WonderFi can offer to the market,\ncreation of long-term value.\n\n     By identifying such information and statements in this manner, the\nCompany is alerting the reader that such information and statements are\nsubject to known and unknown risks, uncertainties and other factors that\nmay cause the actual results, level of activity, performance or\nachievements of the Company to be materially different from those expressed\nor implied by such information and statements. In addition, in connection\nwith the forward-looking information and forward-looking statements\ncontained in this press release, the Company has made certain assumptions.\nAmong the key factors that could cause actual results to differ materially\nfrom those projected in the forward-looking information and statements are\nthe following: the ability of the Company to work effectively with\nstrategic investors; and changes in general economic, business and\npolitical conditions, including changes in the financial markets, changes\nin applicable laws, and compliance with extensive government regulation.\nShould one or more of these risks, uncertainties or other factors\nmaterialize, or should assumptions underlying the forward-looking\ninformation or statements prove incorrect, actual results may vary\nmaterially from those described herein.\n\n     Although the Company believes that the assumptions and factors used in\npreparing, and the expectations contained in, the forward-looking\ninformation and statements are reasonable, undue reliance should not be\nplaced on such information and statements, and no assurance or guarantee\ncan be given that such forward-looking information and statements will\nprove to be accurate, as actual results and future events could differ\nmaterially from those anticipated in such information and statements. The\nforward-looking information and forward-looking statements contained in\nthis press release are made as of the date of this press release, and the\nCompany does not undertake to update any forward-looking information and/or\nforward-looking statements that are contained or referenced herein, except\nin accordance with applicable securities laws. All subsequent written and\noral forward- looking information and statements attributable to the\nCompany or persons acting on its behalf is expressly qualified in its\nentirety by this notice.\n\n     Neither NEO Exchange nor its Regulation Services Provider (as that\nterm is defined in policies of the NEO Exchange) accepts responsibility for\nthe adequacy or accuracy of this news release.\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133600199.MNPRE2133600811-06532420211203</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}