{"date": "2022-02-14 12:18:04.797000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>India</p></div><div class=\"tr-npp-lead\"><p>India, Feb. 14 -- Denim shirts are a safe option during mild winter days. While north India and the Himalayan belt shiver in the months of December and January, rest of India experiences mild winter during the same period. Though heavy woolens are unnecessary, a mildly warm clothing is required. Denim is a preferred fabric in such a scenario and a full sleeve shirt is an ideal style of clothing.</p><p>Katrina Kaif was on Monday spotted at the Mumbai airport, looking fabulous in a full-sleeves denim shirt with collar paired with jeans and sneakers. She was accompanied by her husband and actor Vicky Kaushal.</p></div><div class=\"tr-npp-body\"><p>Denim shirts give an overall relaxed feel; they are a casual wear and sexy as well. The fabric is thick and gives protection against chill. However, this shirt can also be an all-weather as it is usually a loose fit garment.</p><p>If you are convinced that this is good option to consider, then Amazon does have a decent collection of them. Take a look.1) Saira Fashion Denim Full Sleeve Regular Shirt for Women's</p><p>This dull grey-blue regular fit denim full sleeves shirt is available from sizes small to extra large. This is a versatile shirt and can be worn on casual, festive as well as party occasions. It has two pockets and comes embellished with buttons. You can be as creative as you want and pair it with suit, jacket, sweater, chino pants, jeans, and cargo pants. This can be hand washed.2) RC Fashion Denim Plain Shirt for Women &amp; Girls</p><p>This shirt is available in a number of different shades of blue, namely dark money shirt pocket, light plain shirt, dark plain Chinese collar shirt to name a few. There are available in two styles on Amazon - plain shirt and Chinese collar. It comes in two fits - slim and regular. The sizes range from small to extra large.</p><p>3) Miss Chase Women's Blue Full Sleeve Spiked Denim Shirt</p><p>This regular fit Denim full sleeves shirt comes with an embellished collar neck and hav a woven fabric. The shirt is available from the sizes extra small to extra large. This garment can be machine washed.</p><p>4) WARDAH Denim Regular Fit Full Sleeves Shirt for Women</p><p>This regular fit full sleeve shirt has a button front neck style. It is best suited as casual wear and can be worn to festival celebrations like Diwali and Christmas, birthdays, on special days like Mother's Day, Valentine's Day and on anniversaries. It is available from small to extra large size.</p><p>At Hindustan Times, we help you stay up-to-date with latest trends and products. Hindustan Times has affiliate partnership, so we may get a part of the revenue when you make a purchase. Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}