{"date": "2022-02-07 23:12:54.592000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon is more than doubling its maximum base pay cap for technology and corporate employees in the USA to $350,000 from $160,000.  </p><p>\"This past year has seen a particularly competitive labor market, and in doing a thorough analysis of various options, weighing the economics of our business and the need to remain competitive for attracting and retaining top talent, we decided to make meaningfully bigger increases to our compensation levels than we do in a typical year,\" Amazon said in an internal blog post for employees obtained by USA TODAY.  </p></div><div class=\"tr-npp-body\"><p>Amazon is \"increasing overall compensation ranges for most jobs globally, and the increases are much more considerable than we've done in the past,\" according to the blog post.  </p><p>The company declined to provide additional information to USA TODAY.  </p><p><span><span>Money:</span> Amazon raising price of Prime membership for new and current members</span> </p><p><span><span>Tech:</span> Ready to leave Amazon? This is how you delete your account permanently</span> </p><p>Amazon has favored a combination of stock compensation and salaries in employee pay, The New York Times reported. It was not immediately clear how many employees will benefit from the change or whether stock awards will be modified.  </p><p>Amazon employed 1.6 million people worldwide as of the end of 2021. That number includes warehouse workers, who are paid at least $15 an hour and earn an average of approximately $18 an hour. </p><p>The company increased its workforce by more than 300,000 employees in the past year, according to the Times.  </p><p>Job openings have neared all-time highs. In December, employers advertised 10.9 million job openings, up from 10.8 million the previous month. The rise was driven by restaurants and hotels, the industries hit hardest by the pandemic. </p><p><span><span>What's everyone talking about? </span> Sign up for our trending newsletter to get the latest news of the day</span> </p><p><span>This article originally appeared on USA TODAY: Amazon more than doubles some employee salary caps, citing 'competitive labor market'</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}