{"date": "2021-11-12 04:04:06.262000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3482.05, "close": 3525.15}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>E-commerce firms such as Amazon, Flipkart, and others witnessed blockbuster festive season sales of about $9.2 billion this year surpassing the pre-pandemic sales of $5 billion witnessed during the festive month in 2019. The Coronavirus (Covid-19) pandemic has accelerated the shift to e-commerce, with an increasing number of consumers shopping online at a higher frequency than last year, according to analysts.</p><p>The year 2021 saw India witness its biggest ever Festive Sales with brands clocking a gross merchandise value (GMV) of $9.2 billion through online channels over this period, according to consulting firm RedSeer\u0092s e-commerce festive season report. RedSeer came close in predicting this figure with its forecast of $9.6 billion for this year\u0092s GMV falling within just a 5 per cent range of the actual figure ($9.2 billion).</p></div><div class=\"tr-npp-body\"><p>As has been the case for the last five years or so, online festive sales in India continued to grow at a blistering pace and saw a 23 per cent year-over-year growth in GMV.</p><p>\u0093A slew of new launches and easy financing options meant that mobiles continued to remain the most widely-sold product category during this time, accounting for more than a third of the total GMV,\u0094 said the RedSeer report.</p><p>Last year (2020), India\u0092s online festive sale for a month \u0097 during October-November \u0097 raked in $8.3 billion in gross sales, including for brands and sellers, according to analysts.</p><p>With people finally getting to leave their homes after months of lockdown, the fashion category witnessed a resurgence like never before. Driven by consumers\u0092 desire to refresh their wardrobes and new innovative business models catering to shoppers in tier-2 cities, the sales of fashion items via online channels doubled this year.</p><p>On the other hand, the categories that witnessed subdued growth this year included the likes of home furnishings, home décor, furnishings and other electronics.</p><p>The overall online shopper base grew by nearly 25 per cent compared to last year with 57 per cent of the total shoppers coming from tier-2+ cities. This meant that this year\u0092s festive sales were dictated by affordability schemes.</p><p>While the overall online GMV and absolute number of shoppers both increased, the GMV per user declined from Rs 6,570 to Rs 6,490 as relatively less expensive items such as fashion products saw an increase in their share of the overall GMV.</p><p>RedSeer claimed that the Flipkart Group emerged as the leader during the festive sales with an impressive 62 per cent market share.</p><p>The first week of online festival sales in October this year, where various e-commerce firms participated, saw 23 per cent year-on-year sales growth in 2021. This means goods worth $4.6 billion (Rs 32,000 crore) were sold online, according to analysts.</p><p>Snapdeal, a leading value e-commerce company, had said its \u0091Toofani Sale\u0092 season kicked off at the beginning of October and concluded on October 31. The firm said its daily order volumes on sale days were more than double of last year. The growth was led by strong performance across multiple categories. The fashion category witnessed 254 per cent growth in volumes while home and kitchen grew 101 per cent over last year. Other gainers this year included beauty, sports and fitness which saw 93 per cent and 53 per cent volume growth respectively. Products from the religious and spirituality category grew 33 per cent over last year\u0092s sale. Bharat continued to sparkle in Snapdeal\u0092s festive season performance. The demand from Tier 3 cities grew by 91 per cent over last year. Bharat\u0092s fast-paced adoption of online commerce was also visible in how the festive season orders stacked up. 58 per cent of the orders came from Tier 3 cities, while Tier 2 and Tier 1 accounted for 15 per cent and 27 per cent of the order volumes respectively.</p><p>Meesho, a fast-growing internet commerce platform also hosted its flagship sale event - The Maha Indian Shopping League from October 6 to 9, 2021. The SoftBank-backed firm recorded 750 per cent growth in users over last year during its flagship festive sale event - Maha Indian Shopping League. Nearly 60 per cent of the total demand was driven by tier-4+ markets, including faraway locations like Khawzawl in Mizoram and Sopore in Jammu and Kashmir. Recording over 10X growth in sales over last year, the company also saw seller participation rise by 314 per cent during Maha Indian Shopping League. Ahead of the sale event, Meesho onboarded over 100,000 sellers with many new initiatives including - free ad credits and zero return shipping charges on the first 30 orders.</p><p>Amazon\u0092s month-long Great Indian Festival 2021 and Flipkart\u0092s The Big Billion Days also started early in October. Amazon recently said its month-long sales event has seen the biggest-ever shopping activity for its sellers and brand partners, bringing services to millions of customers. The sale, which started at midnight of October 2 for Prime members and went live for all customers on October 3, saw participation from 99.7 per cent pin codes. Local shops on Amazon clocked a 2x spike and sold over 10 products every minute. As Bharat gets ready for 5G, more than 84 per cent of mid-range segment of smartphones bought on Amazon were 5G-ready. More than one million customers purchased a smartphone on Amazon for the first time.</p><p>Amazon also said that close to 30,000 sellers became 'lakhpatis'. Nearly 70 per cent of the sellers that made a sale were from non-metros. Over 330 Local Shop owners became 'lakhpatis'. Also, start-ups sold a unique product every 2.5 seconds.</p><p>Flipkart\u0092s The Big Billion Days (TBBD) brought lakhs of sellers, micro, small and medium enterprises (MSMEs) and kiranas closer to consumers this festive season. There was over 55 per cent growth in new sellers this TBBD, compared to 2020. About 57 per cent of these sellers hailed from Tier-2, Tier-3, and smaller cities and towns such as Jaipur, Surat, Howrah, Tirupur and Panipat. 1 in every 3 deliveries were made by a kirana partner this festive month. Top artisans and weaver partners from the Flipkart Samarth programme witnessed a growth of 6X this TBBD compared to 2020.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}