{"date": "2022-02-08 01:46:32+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n        Learn more about how parents and guardians can use Alexa devices with their children.\n      </div>\n                <div>\n                  <p>\n          Amazon's Alexa is the cloud service behind voice-enabled devices from Amazon and other companies. Some devices, like the Amazon Echo smart speakers, are voice-only. You talk to them and they respond in kind. Others, like the Amazon Echo Show and Fire tablets, have screens that are able to display answers including text, graphics, and videos. One of the most popular features of Alexa is to play music, but it can do much more.\n        </p>\n                  <p>\n          Amazon makes Echo devices with Alexa, but there are other companies that license Alexa technology. This guide is based primarily on Amazon Echo devices but generally applies to other Alexa-enabled devices.\n        </p>\n                  <p>\n          Alexa devices can be used to play music or videos; control lights, cameras, and other home appliances; and to tell stories and jokes. In addition to its built-in features from Amazon, Alexa enables third parties to create \"skills,\" which are like apps that run within Alexa.\n        </p>\n                  <p>\n          Echo devices are programmed not to stream any sounds from your home to Amazon's cloud servers or to record anything until they hear their wake word (typically, \"Alexa\"). Once they hear that word, they listen for your request or question. It's similar to smartphones that respond to \"SIRI\" or \"Hey Google.\"\n        </p>\n                  <p>\n          Although \"Alexa\" is the default wake word, it can be changed to \"Amazon,\" \"Echo,\" or \"Computer\" in the Alexa app. This is especially helpful if you have more than one Echo device in a room or nearby room … or a family member named Alexa.\n        </p>\n                  <p>\n          Amazon sells versions of its Echo Dot and Fire tablet made specifically for children. The hardware is the same as regular Echo Dots or Fire tablets, but the tablets are surrounded by a ruggedized case that is designed to appeal to kids. Devices made for children are ad-free, except for possibly in third-party apps or web pages. While Amazon Kids-edition devices are pre-configured to be child-friendly, any Echo device, Fire tablet, or Kindle can be made child-friendly through its settings.\n        </p>\n                  <h4>\n          Alexa's role in family life\n        </h4>\n                  <p>\n          As we've said, unless you've disabled its microphone, an Echo device is always ready to respond when it hears its wake word. So, if you or your children are anywhere near a device with Alexa, they can simply wake it up with the designated word and then ask it a question or ask it to do something without having to get up and touch the device.\n        </p>\n                  <p>\n          Alexa can assist in a seemingly endless number of ways, from trivial to practical to fun. You could be watching TV and wondering the age of an actor. Your child might want to know today's weather as they're getting ready for school or play. If it's connected to your smart devices, you can use it to turn off the bedroom light or make sure you closed the garage door. You or your children might want to hear a story, listen to a song or-if it's a device with a screen-watch a video.\n        </p>\n                  <p>\n          Make sure your kids understand what Alexa is and does and-especially with very young children-how it differs from talking to a person. For more on this, see \"Must kids be polite to Alexa?\"\n        </p>\n                  <p>\n          Alexa is constantly evolving, adding new features all the time. The software (including security and privacy features), and its vast amount of encrypted data, live \"in the cloud\" on Amazon's servers, and its software, including security features, update automatically so you don't have to worry about them being out of date. How and how often family members use Alexa is up to you, and, as a parent, you have the ability to control your child's Alexa experience from the Parent Dashboard or by simply unplugging devices or turning off their microphones.\n        </p>\n                  <h4>\n          Setting up and configuring Alexa\n        </h4>\n                  <p>\n          You can download the free Alexa app from the Apple App Store or Google Play Store. The Alexa app is used to set up, configure, and control Alexa-enabled devices, including Amazon Echo products. Once a device is set up, you only have to use the app when you wish to make a change, like renaming it or adding a skill. It's not uncommon for households and individuals to have multiple Alexa-enabled devices, all of which can be configured and controlled from the Alexa app.\n        </p>\n                  <h4>\n          Adding family members\n        </h4>\n                  <p>\n          Up to two adults and four children under 13 can have their own unique Amazon profile, enabling parents to customize the Alexa experience for each of their children. You can add or remove family members from Manage Your Household. When you add a child or teen, you are required to enter their date of birth, which is used to determine what content the child may access and what parental controls are available.\n        </p>\n                  <h4>\n          Parent Dashboard\n        </h4>\n                  <p>\n          Once you have an Echo or other Alexa device, you can configure settings in the Alexa app or theParent Dashboard on the web. The web-based dashboard has additional settings that are not on the smartphone app, so we recommend you explore both the web-based dashboard and the app, and use the web dashboard for settings that are not available in the app.\n        </p>\n                  <p>\n          Only you know what's right for your child, but as a general practice, we recommend that-especially with young children-you start with more restrictive settings and relax them over time as children become familiar with Alexa.\n        </p>\n                  <p>\n          From the web-based dashboard, parents can add content to their child's library, limit web activity on Fire tablet devices, adjust the child's age filter so Amazon Kids+ recommends age-appropriate content-based not necessarily on the child's actual age, but what you know about their maturity level. Age filters only affect Amazon Kids+ and Amazon-curated web browser content. You can add content to your child's library, regardless of their recommended age.\n        </p>\n                  <p>\n          You can also control in-app purchasing for Fire tablets (off by default) and manage music, communications tools, and other settings for each device your child uses.\n        </p>\n                  <h4>\n          How kids interact with Alexa\n        </h4>\n                  <p>\n          Amazon currently allows parents to dedicate Echo devices to children and has announced plans to allow parents to set up a children's voice profile so that any Echo device in the home can recognize that child's voice and instantly switch to child-appropriate settings and content. That feature, however, has not yet been implemented. For now, you can configure any Echo device as a child's device, which determines the content children can access through that particular device. It's always possible to use the Alexa app to turn off the child-specific features or assign the device to a different child.\n        </p>\n                  <p>\n          With these child profiles and the Parent Dashboard, a parent can monitor and limit what their child can do with Alexa. This includes filtering out songs with explicit lyrics, blocking access to unapproved videos, and providing curated content targeted to your child's age group.\n        </p>\n                  <p>\n          Parents can also set time limits, including total time per day, and specific hours when a child can or cannot use Alexa. You can even block entertainment content until a child has met all of his or her other daily goals. Parents can set different goals and time limits for weekends and weekdays and can modify them or quickly pause a child's ability to use Alexa at any time, either from the Alexa app or the web Parent Dashboard.\n        </p>\n                  <h4>\n          Not a parent substitute\n        </h4>\n                  <p>\n          Alexa can do things that parents also do, like reading stories to children or answering basic questions, but it's NOT designed to replace parents. It's still important-especially for young children-for parents to spend time reading to their children, ideally from printed books, and to be there to answer questions, make suggestions, and deepen the parent-child relationship.\n        </p>\n                  <p>\n          Families can have fun with Alexa by asking Alexa questions together about the day's weather or how far it is to a vacation destination or a relative's house. You can laugh together at Alexa's jokes, learn or practice a skill together, listen to a story together, or ask Alexa for a recipe so you can prepare a meal or a treat together.\n        </p>\n                  <h4>\n          Privacy concerns\n        </h4>\n                  <p>\n          By design, Echo devices are always on and always listening for their wake word, which is typically \"Alexa.\" Echo devices do have a switch that turns off the microphone; and when the microphone is disabled (on most Echo devices), the blue ring will turn red so you can visually confirm it's off. Echo Devices with cameras, like the Echo Show, have the ability to turn off the camera. You can, of course, also unplug them, with the exception of those that are battery-operated.\n        </p>\n                  <p>\n          Since voice is the way people interact with most Alexa-enabled devices, it's common to leave the microphone on most of the time. When it's on, it won't pay attention to or record anything that isn't preceded by the wake word (though there could be times when it accidentally thinks it heard the wake word), but anything following the wake word will be recorded.\n        </p>\n                  <p>\n          Also think about the type of device and where it's placed. Some Echo devices, such as the Echo Show, have cameras, so you might not want to place these in bedrooms or bathrooms. Most Echo devices have the option to disable the camera, either with a physical shutter on top of the device or in settings.\n        </p>\n                  <p>\n          Alexa also runs on mobile devices like Fire tablets and smartphones, so be aware of how and where your children are using these portable devices and whether their cameras can be disabled or covered with masking tape.\n        </p>\n                  <p>\n          We highly recommend that parents read <span><a href=\"https://www.amazon.com/gp/help/customer/display.html?nodeId=202185560\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon's Children's Privacy Disclosure</a></span>, which explains, in plain English, what information Amazon collects and how it uses it. Amazon's privacy policy does not necessarily apply to third-party skills, apps, and websites, so check those out before you install them. As with any privacy policy, it can't protect you or your children from information shared publicly or with others, so it's very important to talk with your children about the types of information they should avoid sharing online. You'll find general advice about privacy for children and adults at ConnectSafely.org/privacy.\n        </p>\n                  <h4>\n          Optional Kids+ premium service\n        </h4>\n                  <p>\n          Amazon offers an optional paid service called Amazon Kids+ (formerly FreeTime Unlimited) that offers kid-friendly books, movies, TV shows, educational apps, Audible books, and games on compatible Echo, Fire, Fire TV, Android, iOS, and Kindle devices. The service also includes kids ad-free radio stations and playlists, as well as Audible books and premium kids skills. For Amazon Prime customers, the service costs $2.99 a month for one child or $6.99 a month for up to four children. Prices are higher for non-Prime customers.\n        </p>\n                  <p>\n          Amazon has divided its recommended content based on age ranges (3 to 5, 6 to 8, and 9 to 12) but parents should exercise discretion based not just on their child's age but also on maturity and sensitivity to different types of material, including material they might find a bit scary. Amazon has partnered with content providers including Disney, Nickelodeon, Sesame Street, and Cartoon Network.\n        </p>\n                  <h4>\n          Monitoring use of Alexa\n        </h4>\n                  <p>\n          You can see a history of any use of Alexa associated with your account (including both adults and children) from the Alexa app by clicking on \"More\" (lower right from the Home screen of the Alexa app). From there, select \"Activity.\" You can also remove any listing by selecting \"remove card\" next to each activity. The web-based Parent Dashboard provides a convenient link to this activity when you select \"See Alexa History.\"\n        </p>\n                  <p>\n          At <strong>Alexa Privacy Settings</strong> or in the Alexa app, you can view, hear, and delete your voice recordings or choose not to have your voice recordings saved. To delete by voice just say, \"Alexa, delete what I just said\" to delete the voice recording of your last request, or \"Alexa, delete everything I've said today\" to delete your voice recordings for that day. Amazon has a page with more information about <strong>Alexa privacy</strong>.\n        </p>\n                  <h4>\n          Talk with your kids about Alexa and privacy\n        </h4>\n                  <p>\n          As with any connected technology, it's important for parents and kids to talk about how to use Alexa, what it does and doesn't do, what information it collects, and to set some guidelines.\n        </p>\n                  <p>\n          If your child is old enough to understand privacy issues, explain when Alexa does and doesn't listen to what is being said, what information it's recording, where that information goes, and who has access to it.\n        </p>\n                  <p>\n          As with any technology that allows you to monitor your child's activities, it's up to you whether or not to look at what your child or other family members say to Alexa, but parents should consider telling their children that they have access to what a child says to Alexa; so if you ever find them asking Alexa for something you consider inappropriate, they won't be surprised if you ask them about it.\n        </p>\n                  <p>\n          The privacy conversation shouldn't be limited to just Alexa. It's a good time to continue-or start-the conversation that almost everything on the internet might possibly be seen by someone else or recorded. For more on this, see ConnectSafely.org/privacy.\n        </p>\n                  <h4>\n          Getting started talking to Alexa\n        </h4>\n                  <p>\n          Alexa herself has suggestions on things she can do for you and your family. Say, \"Alexa, what can I do?\" and she'll give you some suggestions, which will be different for kids and adults. There are an almost unlimited number of things you can ask her. Here are just a few examples; but if you think of something, just try it. Chances are pretty good she can help or let you install a skill that can help you.<br/></p>\n                  <ul class=\"bulleted-list arrowlist\">\n                    <li>\n            How do I bake bread?\n          </li>\n                    <li>\n            What's the weather today?\n          </li>\n                    <li>\n            What time is it (or what time is it in Tokyo)?\n          </li>\n                    <li>\n            How old is Taylor Swift?\n          </li>\n                    <li>\n            What is the most popular K-pop song?\n          </li>\n                    <li>\n            How many inches in a yard?\n          </li>\n                  </ul>\n                  <p>\n          You can also ask her to do things for you, such as:<br/></p>\n                  <ul class=\"bulleted-list arrowlist\">\n                    <li>\n            Set an alarm or reminder\n          </li>\n                    <li>\n            Turn off the light (if you have smart devices that are linked to Alexa)\n          </li>\n                    <li>\n            Call Mom (if you've configured it to call contacts)\n          </li>\n                  </ul>\n                  <h4>\n          Must kids be polite to Alexa?\n        </h4>\n                  <p>\n          There is a controversy brewing over whether it's OK to be bossy to Alexa or whether you should be polite by saying \"please\" and \"thank you.\" Some parents worry that kids will get into bad habits by ordering Alexa around. While it's true that none of us should treat people that way, it's also true that Alexa is software and a cloud service, not a person.\n        </p>\n                  <p>\n          Alexa is smart (though her intelligence is decidedly artificial), but we think it's pretty safe to say that she doesn't suffer from any emotional insecurities, though when we asked her, \"Do you have feelings?\" she said she's \"happy when I'm helping you.\" If you say something negative to her, she's likely to respond, \"I'd like to know what went wrong.\" Perhaps we humans should follow her lead.\n        </p>\n                  <p>\n          \"Polite mode\" is on by default in Amazon Kids mode on an Echo device. For example, if your child uses \"please\" when asking a question, Alexa may say, \"Thanks for asking so nicely.\"\n        </p>\n                  <p>\n          As for how to treat Alexa, it's up to you. There's really no right or wrong answer.\n        </p>\n                  <h4>\n          Closing thoughts for parents\n        </h4>\n                  <p>\n          As we said, Alexa uses \"artificial intelligence\" or \"AI,\" which can be a scary term, conjuring up images of machines that control humans. But it's the other way around. Humans should always be in control of machines, and Alexa is totally under your control. Some families choose not to use technology like Alexa, and that's their choice, but there are other choices besides using or not using the technology.\n        </p>\n                  <p>\n          You can set family rules about when and how to use it or use parental controls, the microphone switch, or even the power plug to control how it's used by your children. You can also set examples through your own use of Alexa and other interactive technologies, like refraining from or limiting their use during dinner or other times set aside for the family. How you act around technology has an even bigger impact on your children than how you tell them to act.\n        </p>\n                  <p>\n          What we do know is that smart speakers and far more sophisticated future technologies will almost certainly be a big part of your child's life as they grow up and reach adulthood. So what better time to introduce your child (and yourself) to this type of technology? You can guide them not so much in the technical ways to use it, but in the proper and safe ways that empower your family while protecting your safety, security, and privacy.\n        </p>\n                </div>\n                <div>\n                  <div>\n          Related Tags\n        </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/family-digital-wellness-hub\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Family Digital Well-Being</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/devices\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Devices</a>\n                    </span>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/news/tag/alexa\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Alexa</a>\n                    </span>\n                  </div>\n                </div>\n                <div>\n                  <div>\n                    <span>About the Author</span>\n                  </div>\n                  <div>\n                    <div>\n                      <span>ConnectSafely</span>\n                    </div>\n                    <div>\n                      <span>\n                        <a href=\"http://connectsafely.org/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">ConnectSafely</a>\n                      </span>is a Silicon Valley, California-based nonprofit organization dedicated to educating users of connected technology about safety, privacy and security. They publish research-based safety tips, parents' guidebooks, advice, news, and commentary on all aspects of tech use and policy.\n          </div>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/devices/how-parents-can-use-alexa-devices-with-their-kids\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>07 February 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>08 February 2022 01:46:32 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}