{"date": "2022-01-26 14:35:12.277000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MOTORSPORT GAMES INC (\"MSGM-Q\")\n- Official KartKraft Launch\n\n     Motorsport Games Inc. (\"Motorsport Games\"), a leading racing game\ndeveloper, publisher and esports ecosystem provider of official motorsport\nracing series throughout the world, announces today the official launch of\nKartKraft, available to play on PC through the Steam store. Previously in\n'Early Access' mode since November of 2018, this marks the full release of\nthe leading kart racing simulator, bringing a bevy of new features for fans\nto enjoy. The trailer can be viewed here.\n\n     KartKraft is developed and published by Motorsport Games, having\nacquired the game IP, assets and code from original developer Black Delta\nin March of 2021. Key members from Black Delta, including Founder Zach\nGriffin, joined Motorsport Games to form its new Australia-based studio,\nwhich has continued to work on KartKraft. Since last year's acquisition,\nMotorsport Games Australia has carried on developing the game to get it\nready for its full launch.\n\n     \"The Motorsport Games team is excited to finally launch KartKraft in\nfull, bringing more top-tier features than ever to the most\nhighly-acclaimed karting simulator on the market,\" said Dmitry Kozko, CEO\nof Motorsport Games. \"Acquiring KartKraft last year signaled our aggressive\nplans for growth and expansion as a leading developer of racing games, and\nour amazing team in Australia has delivered a stunning title for fans\nacross the world. We look forward to hearing from our players about\nKartKraft and will continue to build upon this release as we'll keep\nevolving the game in future.\"\n\n     The full release of KartKraft for PC introduces a number of fresh\nadditions to improve the overall gaming experience. Players can now\nparticipate in scheduled multiplayer sessions with a bespoke matchmaking\nsystem, something previously unavailable in the Early Access version.\nAdditionally, the full version of KartKraft allows players to customize\ntheir own karts with 8 officially licensed manufacturers and 5 different\nclasses. Players can also race on 7 officially licensed, laser-scanned\ncircuits , including the newly added Whilton Mill circuit. Additionally,\nKartKraft supports virtual reality and triple screen play, as well as full\nmotion support.\n\n     \"Since joining the Motorsport Games team last year, we've been\nprovided with more resources and tools than ever before to make KartKraft\nthe remarkable game that it is today,\" said Zach Griffin, Director of\nTechnology at Motorsport Games. \"With our full launch out of Early Access,\nwe couldn't be more pleased to finally bring a list of features that have\nbeen asked for by our community for some time, including online\nmultiplayer, user interface updates and more tracks. More importantly, this\ndoes not signal the end of KartKraft's development, but the start of the\nnext chapter. I'm confident that players will love this game just as much\nas we have enjoyed making it.\"\n\n     KartKraft is available to play today on Steam for PC. It can be\npurchased for $39.99. The game developers will continue to work on and\nimprove KartKraft after initial release continuously iterating upon the\nfoundation in place.\n\n     To keep up with the latest Motorsport Game news, please visit\nwww.motorsportgames.com and follow on Twitter, Instagram, Facebook and\nLinkedIn.\n\n     About Motorsport Games:\nMotorsport Games, a Motorsport Network company, combines innovative and\nengaging video games with exciting esports competitions and content for\nracing fans and gamers around the globe. The Company is the officially\nlicensed video game developer and publisher for iconic motorsport racing\nseries, including NASCAR, INDYCAR, 24 Hours of Le Mans and the British\nTouring Car Championship (\"BTCC\"), across PC, PlayStation, Xbox, Nintendo\nSwitch and mobile. Motorsport Games is an award-winning esports partner of\nchoice for 24 Hours of Le Mans, Formula E, BTCC, the FIA World Rallycross\nChampionship and the eNASCAR Heat Pro League, among others. For more\ninformation about Motorsport Games, visit www.motorsportgames.com.\n\n     Forward-Looking Statements\nCertain statements in this press release which are not historical facts are\nforward-looking statements within the meaning of Section 27A of the\nSecurities Act of 1933, as amended, and Section 21E of the Securities\nExchange Act of 1934, as amended, and are provided pursuant to the safe\nharbor provisions of the Private Securities Litigation Reform Act of 1995.\nAny statements in this press release that are not statements of historical\nfact may be deemed forward-looking statements. Words such as \"continue,\"\n\"will,\" \"may,\" \"could,\" \"should,\" \"expect,\" \"expected,\" \"plans,\" \"intend,\"\n\"anticipate,\" \"believe,\" \"estimate,\" \"predict,\" \"potential,\" and similar\nexpressions are intended to identify such forward-looking statements. These\nforward-looking statements include, but are not limited to, statements\nconcerning: (i) the Company's expectation to pursue aggressive plans for\ngrowth and expansion as a leading developer of racing games; and (iii) the\nexpected future impact of new or planned products, features, offerings or\nevents, and the timing of launching such products, features, offerings or\nevents, including, without limitation, the Company's belief that with the\nrelease of KartKraft, its amazing team in Australia has delivered a\nstunning title and a remarkable game for fans across the world, the\nCompany's plans to continue to build upon this release and to keep evolving\nthe game in future and that players will love this game. All\nforward-looking statements involve significant risks and uncertainties that\ncould cause actual results to differ materially from those expressed or\nimplied in the forward-looking statements, many of which are generally\noutside the control of Motorsport Games and are difficult to predict.\nExamples of such risks and uncertainties include, but are not limited to:\n(i) difficulties, delays or less than expected results in achieving the\nCompany's growth plans, objectives and expectations, such as due to a\nslower than anticipated economic recovery and/or the Company's inability,\nin whole or in part, to continue to execute its business strategies and\nplans, such as due to unforeseen difficulties in maintaining existing\nlicenses, and securing additional licenses with various racing series\nand/or difficulties in attracting and retaining qualified employees and key\npersonnel; and/or (ii) Motorsport Games experiencing difficulties and/or\ndelays in enhancing the quality of its product offerings that could\nnegatively impact its future development plans, such as due to difficulties\nor delays in launching new products, higher than anticipated costs incurred\nin developing, launching and continuining to enhance and improve such\nproducts and/or less than anticipated consumer acceptance of the Company's\nproduct offerings and/or difficulties, delays in or unanticipated events\nthat may impact the timing and scope of new product launches, such as due\nto delays and higher than anticipated expenses related to the ongoing and\nprolonged COVID-19 pandemic and related economic lockdowns and government\nmandates; unanticipated operating costs, transaction costs and actual or\ncontingent liabilities; adverse effects of increased competition; and\nunanticipated changes in consumer behavior, including as a result of\ngeneral economic factors, such as increased inflation. Factors other than\nthose referred to above could also cause Motorsport Games' results to\ndiffer materially from expected results. All forward-looking statements\ninvolve significant risks and uncertainties that could cause actual results\nto differ materially from those expressed or implied in the forward-looking\nstatements, many of which are generally outside the control of Motorsport\nGames and are difficult to predict. Factors other than those referred to\nabove could also cause Motorsport Games' results to differ materially from\nexpected results. Additional factors that could cause actual results to\ndiffer materially from those expressed or implied in the forward-looking\nstatements can be found in Motorsport Games' filings with the SEC, which\nmay be found at www.sec.gov and at ir.motorsportgames.com, including its\nAnnual Report on Form 10-K for the fiscal year ended December 31, 2020, its\nQuarterly Reports on Form 10-Q filed with the SEC during 2021, as well as\nin its subsequent filings with the SEC. Motorsport Games anticipates that\nsubsequent events and developments may cause its plans, intentions and\nexpectations to change. Motorsport Games assumes no obligation, and it\nspecifically disclaims any intention or obligation, to update any\nforward-looking statements, whether as a result of new information, future\nevents or otherwise, except as expressly required by law. Forward-looking\nstatements speak only as of the date they are made and should not be relied\nupon as representing Motorsport Games' plans and expectations as of any\nsubsequent date. Additionally, the business and financial materials and any\nother statement or disclosure on, or made available through, Motorsport\nGames' website or other websites referenced or linked to this press release\nshall not be incorporated by reference into this press release.\n\n     Website and Social Media Disclosure:\nInvestors and others should note that we announce material financial\ninformation to our investors using our investor relations website\n(ir.motorsportgames.com), SEC filings, press releases, public conference\ncalls and webcasts. We use these channels, as well as social media and\nblogs, to communicate with our investors and the public about our company\nand our products. It is possible that the information we post on our\nwebsites, social media and blogs could be deemed to be material\ninformation. Therefore, we encourage investors, the media and others\ninterested in our company to review the information we post on these\nwebsites, social media channels and blogs, including the following (which\nlist we will update from time to time on our investor relations website):\n\n//st\n\n         Websites              Social Media\n\n         motorsportgames.com   Twitter: @msportgames &amp; @traxiongg\n\n         traxion.gg            Instagram: msportgames &amp; traxiongg\n\n         motorsport.com        Facebook: Motorsport Games &amp; traxiongg\n\n                               LinkedIn: Motorsport Games\n\n                               Twitch: traxiongg\n\n                               Reddit: traxiongg\n\n//et\n\n     The contents of these websites and social media channels are not part\nof, nor will they be incorporated by reference into, this press release.\n\n     Investors:\nAshley DeSimone\nAshley.Desimone@icrinc.com\n\n     Press:\nASTRSK PR\nmotorsportgames@astrskpr.com\n\n     A photo accompanying this announcement is available at\n<a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/8a350c55-4b67-4caa-bf5c\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.globenewswire.com/NewsRoom/AttachmentNg/8a350c55-4b67-4caa-bf5c</a>\n-cf3588f5100e\n\nTel   : 305-507-8799    MOTORSPORT GAMES INC\nEmail : investors@motorsportgames.com\nWWW   : <a href=\"https://www.motorsportgames.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.motorsportgames.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2202500219.MNPRE2202501408-06331220220126</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}