{"date": "2022-02-12 15:07:37.729000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3180.07, "close": 3103.34}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The platform has changed the way city residents search for housing – often to the chagrin of brokersTell us the compromises you've made to get an apartment</p><p>When Madeline Heckman decided to move from the Upper West Side to Brooklyn last year, she knew exactly where to start her search: with StreetEasy. \"I honestly didn't bother looking at other alternative apps,\" she said. The interface was user-friendly, the entire city's listings were there, and her previous website of choice, Naked Apartments, had shuttered in 2020. She ultimately found the place of her dreams, a two-bedroom with a walk-in closet in the Prospect Heights neighborhood of Brooklyn.</p></div><div class=\"tr-npp-body\"><p>Heckman is in good company. Ask anyone in New York City how they found their apartment, and the answer is a no-brainer: in 2022, StreetEasy might as well be the city's entire real estate business.</p><p>This wasn't always so. For the entirety of 2006, the first year of StreetEasy's reign, the real estate giant did not hire a single employee from the industry. The two founders <a href=\"https://www.nysun.com/real-estate/a-real-estate-site-stirs-up-the-industry/86103/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">didn't want</a> to operate under the assumptions associated with the business. They wanted a fresh start.</p><p>They got that and more: the company was acquired by Zillow in 2013 for $50m, and the pair's real estate brands now boast a 70% market share. Today, StreetEasy not only hosts a list of all available rentals and homes in New York City, it also allows users to secure agents and schedule viewings.</p><p>From the moment would-be renters or buyers start their hunt to the moment they walk into their new homes, keys in hand, StreetEasy facilitates it all.</p><p>\"It's almost like saying you buy your stuff on Amazon,\" one agent said during a phone call (like others quoted in this piece, the agent requested anonymity due to their ongoing relationship with the company). \"Like, OK, you could buy it from Target or somewhere else, but Amazon is still Amazon.\"</p><p>But as StreetEasy has revolutionized the city's real estate, its success hasn't gone unchallenged. As is the case when a company disrupts a market, winners and losers abound – and sometimes trade places in the process.</p><p class=\"tr-npp-section-title\"> Total dominance (and total disruption) </p><p>In its infancy, StreetEasy's real estate Rolodex was accumulated by scraping listings from the internet and pairing them with specific information – such as the number of days a property had been on the market or fluctuations in price.</p><p>Things changed in 2017, when the platform began charging a \"per listing, per day\" fee for rental properties. Starting at $3, it jumped to $4.50 in 2018, landing on $6 a year later. (Sale property listings remain free for agents to post.)</p><p>These fees directly affect agents. An anonymous broker said that the 30 apartments they currently have listed on the platform are costing them about $6,000 a month to maintain. They estimate that the listing fees have cost them a total of half a million dollars since their introduction.</p><p>In 2015, StreetEasy introduced <a href=\"https://therealdeal.com/2015/04/10/theres-experts-and-then-theres-experts/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">the first iteration</a> of its other primary revenue stream: StreetEasy Experts. Today, real estate agents who go through a formal joining process are promoted in listings with ties to their previous work – for instance, in buildings or neighborhoods where they've made deals. These \"Experts\" – who pay StreetEasy when they close a deal – are advertised ahead of the listing agent.</p><p>When a user attempts to schedule a showing for a listing, they have to scroll past the promoted Expert for the option to contact the listing agent. That can benefit new agents looking to grow their client lists, but established agents told the Guardian it was frustrating to lose their leads to Experts.</p><p>\"It takes away from the exclusive agent's ability to collect the larger commission,\" one said. He also claims that the program eliminates some of the flexibility that's allowed if a buyer or seller was working with the original broker: \"If the person came directly to one broker collecting the whole commission, they could probably lower their commission to make the deal work.\"</p><p class=\"tr-npp-section-title\"> The brokers' rebellion </p><p>Before StreetEasy, many brokers put their listings in a public database, so renters and buyers had to approach brokers if they wanted to learn more about a property.</p><p>Now StreetEasy allows customers to become thoroughly informed before ever speaking with an agent. For instance, the site offers a home valuation tool to give sellers a free estimate of their home's current market value. From there, sellers can receive emails to keep them up to date on when it's the right time to sell, alongside records of recently listed and in-contract homes in their neighborhood.</p><p>We have to have a good relationship with StreetEasy because that's our only option</p><p>Kaptan Unugur, Sotheby's</p><p>Even though Anna P (who asked to withhold her last name) bought her home in Brooklyn over six years ago, she keeps the same search filters on to keep an eye on the market.</p><p>\"I watch the available places in our price range getting smaller and smaller over the years and it sort of helps with buyers' remorse,\" she said over direct message. \"We couldn't have done any better! And our property value is going up!\"</p><p>Many brokers, feeling the system is rigged against them, have repeatedly called for boycotts. Following the introduction of listing fees in 2017, the agencies Brown Harris Stevens, Town Residential, Compass, Stribling &amp; Associates, Warburg Realty and more <a href=\"https://rew-online.com/real-estate-brokers-defy-their-firms-boycott-of-streeteasy/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">stopped updating</a> their StreetEasy feeds.</p><p>But StreetEasy bypassed the issue by allowing individual agents to manually update listings themselves, and in early 2020 StreetEasy stopped accepting automatic listings feeds from brokerage firms altogether. Listings from agents at Brown Harris Stevens, Compass and Warburg Realty ultimately appear on StreetEasy, although companies such as Compass have attempted to get an edge on the website with the introduction of their own <a href=\"https://www.compass.com/private-exclusives/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">exclusive listings</a> .</p><p>A June 2021 survey of New York residents conducted by YouGov found that more renters described StreetEasy as trustworthy than any other real estate platform.</p><p>\"Why fix something that's not broken? I think that's the way customers see it,\" Kaptan Unugur, senior global real estate adviser and licensed salesperson at Sotheby's, said. He added: \"We have to have a good relationship [with StreetEasy] because that's our only option.\"</p><p class=\"tr-npp-section-title\"> If you can't beat them, find your niche </p><p>Emily Bergmann is one of the few NYC renters who found all of her previous apartments using platforms such as Twitter and Craigslist.</p><p>\"[StreetEasy is] useless if you are one person who doesn't have roommates they're looking with already,\" she said over direct message. (If an apartment hunter wanted to find a place before securing roommates, they'd need to put down a full deposit up front, something Bergmann said had been financially prohibitive for her in the past.)</p><p>Everything on StreetEasy was out of my price range</p><p>Emily Bergmann</p><p>For her first solo apartment in Prospect Heights, which she moved into this past month, she went with Listings Project.</p><p>\"Everything on StreetEasy was out of my price range,\" she said. \"My place on Listings Project was a lease takeover in a rent-stabilized building that was easily $200 below the cheapest studio in my neighborhood [on StreetEasy].\"</p><p>Unugur, of Sotheby's, believes there are better sites out there, but hardly any competitors match StreetEasy in revenue. While Zillow reported $1.7bn in the third quarter of 2021, Redfin <a href=\"https://investors.redfin.com/news-releases/news-release-details/redfin-reports-third-quarter-2021-financial-results\" data-type=\"url\" class=\"tr-link\" translate=\"no\">reported $540m</a> and CoStar, owner of Apartments.com , reported <a href=\"https://www.costargroup.com/costar-news/details/costar-group-third-quarter-2021-revenue-increased-17-year-over-year-costar-accelerated-to-double-digit-revenue-growth-with-net-sales-reaching-all-time-high\" data-type=\"url\" class=\"tr-link\" translate=\"no\">$499m</a> .</p><p>So rather than compete on scale, real estate alternatives in New York tend to focus on a niche.</p><p><a href=\"https://www.listingsproject.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Listings Project</a> began 20 years ago as a personal email list run by Stephanie Diamond, when she was looking for an apartment. The service now spans over 200 countries, with the highest percentage of listings in New York. Listings Project remains community-based; searchers can only access listings after they subscribe to the newsletter or sign up to the site. Diamond said each post received a \"direct human touch\", vetting for inclusion and editing for gentrifying language.</p><p><a href=\"https://www.realtor.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Realtor.com</a> , owned by NewsCorp, boasts features to give buyers information about the environment around their potential property, including a noise indicator – with a map to show where and what the source of the noise is – and flood risk data.</p><p>Lee Lin, the CEO of <a href=\"https://www.renthop.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">RentHop</a> , said its unique strength lies in its efforts to weed out bad-faith brokers, claiming to have a much stricter verification process than other sites. It also tracks conversations between clients, agents, and landlords to ensure prompt and consistent replies while respecting privacy.</p><p>\"We have suspended or banned many cases where agents have not kept their listings up-to-date, including banning our largest advertiser last year after a few repeated violations and warnings,\" Lin wrote in an email.</p><p>But StreetEasy isn't slowing down. The service received 180m visits in 2021, up almost 40% from 2019, according to a spokesperson. Plus, luxury homes sold nearly two months faster this past year than the year before, with the overall median Manhattan asking price jumping more than 10%, according to a <a href=\"https://streeteasy.com/blog/luxury-manhattan-home-sales-november-2021-market-reports/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">recent StreetEasy market report</a> . On the rental side, there's been a <a href=\"https://streeteasy.com/blog/nyc-rental-inventory-down-october-2021-market-reports/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">significant drop in inventory</a> as <a href=\"https://www.theguardian.com/lifeandstyle/ng-interactive/2022/feb/08/new-york-rent-housing-market-pandemic-trends\" data-type=\"url\" class=\"tr-link\" translate=\"no\">apartment-hunting picked back up</a> following the initial effects of the pandemic, making the landscape even more competitive.</p><p>\"Every day, our teams are thinking about what is still inconvenient or difficult about finding a home in NYC,\" Caroline Burton, StreetEasy vice-president and general manager, wrote over email. \"What technology can help improve the process?\"</p><p>In 2022, she said, the site aims to focus on smarter and more efficient ways to match buyers, sellers, and renters with agents.</p><p>In that sense, StreetEasy's only competition is itself.</p><ul class=\"bulleted-list arrowlist\"><li> </li></ul><p>This piece was amended on 9 February 2022 to clarify the function of the Experts program.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 theguardian.com-NonSyndicated</p></div>"}