{"date": "2021-12-28 11:00:00.089000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3393.39, "close": 3384.02}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>MAHWAH, N.J., Dec.  28, 2021  (GLOBE NEWSWIRE) -- <a href=\"https://www.globenewswire.com/Tracker?data=N60tPAHdwgnSokSqpXVUAjlCN9HT9CTCkiqMPtWI7XW4fnTzjfmzsngka4kUV-QWxTNP9FnfOGitgzQifZmGzA==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Radware</a><sup>®</sup> (NASDAQ: RDWR), a leading provider of cyber security and application delivery solutions, today announced that Armis, a leading unified asset visibility and security platform provider, chose <a href=\"https://www.globenewswire.com/Tracker?data=N60tPAHdwgnSokSqpXVUAmxc8iayxGzU7HbiZgkFVcnL2bnUBxxwwviDPERmFakJ0Ivtx1irSY_Vk6lnmnvrBupqQNncdDNhZJOwoHWBHR4=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Radware’s Cloud Native Protector</a> to safeguard its Amazon Web Services (AWS) environment. This born-in-the-cloud business adopted Radware’s solution to fortify its cloud security posture and identify potential vulnerabilities before they evolved into threats.</p><p>Armis’ security platform enables companies to safely use and control IoT and other unmanaged devices without fear of compromise by cyberattacks. Armis was looking for a solution that would give its DevOps team full visibility and control of its public cloud environment. The company turned to Radware to make it easier for its team to remotely track assets, supervise access to sensitive resources, and detect suspicious activity. <br/><br/>“The Radware team understands that we are a dynamic company with requirements that are constantly changing,” said Roi Amitay, head of DevInfra at Armis. “Radware’s Cloud Native Protector plays an essential role in securing our cloud environment. It helps us see our full cloud picture and focus on what matters most. Radware provides trusted products and support, making this the best solution for our company.”<br/><br/>Radware’s solution enhances the visibility and control Armis has over its public cloud environment. It automates manual analysis and notifies Armis about any publicly exposed assets and potential cyberattacks to help the company prioritize its work. <br/><br/>“Cloud-native companies like Armis have unique and constantly shifting security requirements that need specialized solutions,” said Gilad Barzilay, director of public cloud sales at Radware. “Our Cloud Native Protector not only secures Armis’ cloud workloads but also is continually assessing risks and improving visibility and governance of their cloud.”<br/><br/><a href=\"https://www.globenewswire.com/Tracker?data=N60tPAHdwgnSokSqpXVUAmxc8iayxGzU7HbiZgkFVcmClDhpDumfj-jC2VZITOTbQduQqO8z8gV7_snhBIETZLeD9idH_5OT9n9vl1Je1rE=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Radware’s Cloud Native Protector</a> is an agentless solution that provides centralized visibility and reporting for workloads and accounts on AWS and Microsoft Azure. Its intuitive 360-degree centralized dashboard shows alerts across accounts and clouds with risk-prioritized alerting so that security teams know which alert to focus on first. Using a multi-layered approach that covers a wide security posture of the cloud and threats to individual workloads, the solution also identifies and prevents public exposure of public facing assets, cloud security misconfigurations, excessive permissions, and malicious activity in the cloud.</p><p><strong>About Radware</strong></p><p><a href=\"https://www.globenewswire.com/Tracker?data=N60tPAHdwgnSokSqpXVUAnmtpfw4VaeXbLX5cwD5TKXWewyujf_gCuJlNmcC7Dsjj85rYFjjtqTP1w1WDhk2dw==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Radware</a><sup>®</sup> (NASDAQ: RDWR) is a global leader of cyber security and application delivery solutions for physical, cloud, and software defined data centers. Its award-winning solutions portfolio secures the digital experience by providing infrastructure, application, and corporate IT protection, and availability services to enterprises globally. Radware’s solutions empower enterprise and carrier customers worldwide to adapt to market challenges quickly, maintain business continuity, and achieve maximum productivity while keeping costs down. For more information, please visit the <a href=\"https://www.globenewswire.com/Tracker?data=N60tPAHdwgnSokSqpXVUAjeuomKraS5crvBzMRmznoQNMSoFC7_m-UV5CaApKSClNYunbIHO8I3duS8Z1fvDsQ==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Radware</a> website.</p><p>Radware encourages you to join our community and follow us on: <a href=\"https://www.globenewswire.com/Tracker?data=fuXXGuz1YT62_7lyKgG1ZFAUW0P7FqtC5W8p73gSSE9BD_zlel1LvLjPKcjtwv_jcvqzzWkICwwWL4mwbd0f4w==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Facebook</a>, <a href=\"https://www.globenewswire.com/Tracker?data=NnnPSqUIHkQ05DL5F2SdH67TXRPpa1DXHrAyjfcnyGSiZbnpMwUqGObWN4Jbe_KueY20zUvnqbC4F5Fg4HZpYMeHoCy30HzUTWDS9GghkZE=\" data-type=\"url\" class=\"tr-link\" translate=\"no\">LinkedIn</a>, <a href=\"https://www.globenewswire.com/Tracker?data=N60tPAHdwgnSokSqpXVUAt1StRUaKjX3ceqWx1zUIB6cjyhPY35Mbo5jt7rSDf5jQAqUgQD-3GKnx31a3W3BMA==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Radware Blog</a>, <a href=\"https://www.globenewswire.com/Tracker?data=xuWr7pe3tm4gfi26dPi-SXvTOuNSRyxkTx5tcAFBMPrhpBENR67UhH30Rravjhp3DgwBw9rAZ5NXLKDXvbyr1A==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Twitter</a>, <a href=\"https://www.globenewswire.com/Tracker?data=vzjvGB84V_EItdNFp2gzkW4jkwm0nGwD0Q022HQTlcQwSKwBpEcCXlWtFqXgUj62TWu0RMg2Gkis7vaElFrtWg==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">YouTube</a>, and Radware Mobile for <a href=\"https://www.globenewswire.com/Tracker?data=QZlq3L0sfRnEoa4yonlVRjmfrKaLrnJtqx5ka4Ol78Fj_X1DxFdjhSlRB6VfzMJtFllrMyk2HkYzC1-tdtgLl985NjzGcgXATZEf_d5tH3RYNgL1-E1bCxM3MlN15eYc\" data-type=\"url\" class=\"tr-link\" translate=\"no\">iOS</a> and <a href=\"https://www.globenewswire.com/Tracker?data=OaTgbE7OfuJJ3MvS3bIegBaUzcrxpAkWySkH2QFA3iotRxOTcN2wmw3Rd-S2yDYNMEFomZRRNBWiX4wwnl78UscG6hq9jACofFQ2gbKT8PLVShrP4EWisKJtYijSnrZm\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Android</a>.</p><p>©2021 Radware Ltd. All rights reserved. Any Radware products and solutions mentioned in this press release are protected by trademarks, patents, and pending patent applications of Radware in the U.S. and other countries. For more details, please see: <a href=\"https://www.globenewswire.com/Tracker?data=XQzziRrUGTyaYgXYPEd2Nvyw6_183i4ErveUK-5Lo0FK-cEAf5htMwIP-SnmiU3OXVn9vmZk52s_MLzT1J2t7JcR48h_DqbaAhJ6DmqDjT_YMOSCgardOgOTLs3NNdx8\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.radware.com/LegalNotice/</a>. All other trademarks and names are property of their respective owners.</p><p>Radware believes the information in this document is accurate in all material respects as of its publication date. However, the information is provided without any express, statutory, or implied warranties and is subject to change without notice.</p><p>The contents of any website or hyperlinks mentioned in this press release are for informational purposes and the contents thereof are not part of this press release.</p><p><strong>Safe Harbor Statement </strong></p><p><span>This press release includes “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Any statements made herein that are not statements of historical fact, including statements about Radware’s plans, outlook, beliefs, or opinions, are forward-looking statements. Generally, forward-looking statements may be identified by words such as “believes,” “expects,” “anticipates,” “intends,” “estimates,” “plans,” and similar expressions or future or conditional verbs such as “will,” “should,” “would,” “may,” and “could.” For example, when we say that </span><span>our Cloud Native Protector solution is continually assessing risks while improving visibility and governance of the cloud</span><span>, we are using a forward-looking statement. Because such statements deal with future events, they are subject to various risks and uncertainties, and actual results, expressed or implied by such forward-looking statements, could differ materially from Radware’s current forecasts and estimates. Factors that could cause or contribute to such differences include, but are not limited to: the impact of global economic conditions and volatility of the market for our products; natural disasters and public health crises, such as the coronavirus disease 2019 (COVID-19) pandemic; our ability to expand our operations effectively; timely availability and customer acceptance of our new and existing solutions; risks and uncertainties relating to acquisitions or other investments; the impact of economic and political uncertainties and weaknesses in various regions of the world, including the commencement or escalation of hostilities or acts of terrorism; intense competition in the market for cyber security and application delivery solutions and in our industry in general, and changes in the competitive landscape; changes in government regulation; outages, interruptions, or delays in hosting services or our internal network system; compliance with open source and third-party licenses; the risk that our intangible assets or goodwill may become impaired; our dependence on independent distributors to sell our products; long sales cycles for our solutions; changes in foreign currency exchange rates; undetected defects or errors in our products or a failure of our products to protect against malicious attacks; the availability of components and manufacturing capacity; the ability of vendors to provide our hardware platforms and components for our main accessories; our ability to protect our proprietary technology; intellectual property infringement claims made by third parties; changes in tax laws; our ability to realize our investment objectives for our cash and liquid investments; our ability to attract, train, and retain highly qualified personnel; and other factors and risks over which we may have little or no control. This list is intended to identify only certain of the principal factors that could cause actual results to differ. For a more detailed description of the risks and uncertainties affecting Radware, refer to Radware’s Annual Report on Form 20-F, filed with the Securities and Exchange Commission (SEC) and the other risk factors discussed from time to time by Radware in reports filed with, or furnished to, the SEC. Forward-looking statements speak only as of the date on which they are made and, except as required by applicable law, Radware undertakes no commitment to revise or update any forward-looking statement in order to reflect events or circumstances after the date any such statement is made. Radware’s public filings are available from the SEC’s website at www.sec.gov or may be obtained on Radware’s website at </span><a href=\"https://www.globenewswire.com/Tracker?data=kysCdmnCAIK2Xct2nuhFZeGjQaxEU_-pdxEkm71Z6mhbPBgxvlIeSSz0MNFBOYkC2-FzCDev4JsCJyd_O8beLw==\"><span>www.radware.com</span></a><span>.</span></p><p> </p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODQxNzk4OSM0NjMwOTc3IzIwMTg5Mjc=\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RReE56azRPU00wTmpNd09UYzNJekl3TVRnNU1qYz0=&amp;key=86696e2fb69a086006858a36ed663d2354e8c7e0cef9ebbba71d3bdd80dcee2d31f4f1ab64ef779edf6eb52d73d3ac3f87b7112ee086fcfe80503444b8201745\"/></div></div><br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/NGEwODEwM2UtMzA4Ny00NWVlLTg4ZTctZmMxODFhYTFmYzNkLTEwMzA1MDA=/tiny/Radware-Ltd-.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9OR0V3T0RFd00yVXRNekE0TnkwME5XVmxMVGc0WlRjdFptTXhPREZoWVRGbVl6TmtMVEV3TXpBMU1EQT0vdGlueS9SYWR3YXJlLUx0ZC0ucG5n&amp;key=30139fca103eae0d3ab4ae1f109bacd3be91ef55caf0cb7ae4a63de2a5944f8008525c3127b3a9da00d8d0b87039cbe2f459bbfcb29f19ec0cc2dc22973e6aaf\"/></div></div><p><a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/651773cc-1089-4fbc-a964-892c3bc5a551\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Primary Logo\" border=\"0\" src=\"https://ml.globenewswire.com/media/651773cc-1089-4fbc-a964-892c3bc5a551/small/radware-logo.jpg\" style=\"max-height:25px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS82NTE3NzNjYy0xMDg5LTRmYmMtYTk2NC04OTJjM2JjNWE1NTEvc21hbGwvcmFkd2FyZS1sb2dvLmpwZw==&amp;key=60fc1b8b30abf7bcf70071575cc2686432832b65b319607b187ac1375eda2c4ef7888c7c82a1e98ceed0804a144f7352a04fc7017a7f1fcdd8da4953066ddd69\"/></div></div></a></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">GlobeNewswire, Inc. 2021</p></div>"}