{"date": "2022-02-24 14:08:26.247000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The Supreme Court (SC) has directed Amazon and Future Group to approach National Company Law Appellate Tribunal (NCLAT) for speedy disposal of the US ecommerce firm's case challenging Competition Commission of India\u0092s (CCI's) order which cancelled its 2019 deal with Future Coupons. The SC has listed the case to be heard next on March 9.</p><p>Amazon approached SC after Delhi High Court (HC) ordered a stay on the Amazon-Future arbitration going on before a three-member arbitral tribunal.</p></div><div class=\"tr-npp-body\"><p>\u0093The present SLP (special leave petition) is in one way connected to the outcome of the order challenged before the NCLAT. We direct parties to request the NCLAT to decide the case,\" SC said in its order.</p><p>The SC case was heard by a bench comprised of Chief Justice of India, NV Ramana, Justice A S Bopana and Justice Hima Kohli.</p><p>The NCLAT on February 25 will hear Amazon\u0092s plea seeking an interim stay on the order passed by the CCI, which suspended the more than two-year-old approval of its deal with Future Coupons (FCPL).</p><p>On February 9, the SC had issued notices to Future Group to respond to Amazon\u0092s SLP which challenged Delhi High Court\u0092s divisional bench order last month staying the Singapore International Arbitration Centre (SIAC) arbitration proceedings in the Amazon-Future case.</p><p>Amazon approached the SIAC in October 2020 after Future Group\u0092s deal with Reliance Industries citing its non-compete agreement with the Kishore Biyani-led chain. Amazon's 2019 deal with Future Group (stake purchase in Future Coupons) specified any disputes would be arbitrated under the SIAC rules. The same month, Amazon got a favourable ruling for its plea in the SIAC against the Future-Reliance deal.</p><p>In November 2020, Future Group then challenged the SIAC\u0092s interim order at the Delhi High Court and in February 2021, a single-judge Bench order upheld the SIAC\u0092s interim order. Future Group then filed an appeal at the HC before a divisional bench, challenging the single-judge Bench order. The Divisional Bench stayed the single-judge Bench\u0092s order.</p><p>In February 2021, Amazon moved the SC challenging the divisional bench order, and Future Group moved the NCLT Mumbai to seek approvals to go ahead with its deal with Reliance Industries' arm, Reliance Retail.</p><p>In March 2021, the HC passed an order to attach Future Group\u0092s assets. A Divisional Bench stayed it.</p><p>In August 2021, the apex court had ruled in favour of Amazon, holding the SIAC\u0092s arbitration award. In September 2021, in a major relief to Future Group, SC stayed proceedings before HC, ordering no coercive action against the Kishore Biyani-led group. The court also directed the NCLT, CCI, and Securities and Exchange Board of India not to pass any final order in relation to the dispute for four weeks.</p><p>In October 2021, the SIAC tribunal upheld the emergency arbitration interim order, thereby injuncting Future Retail from taking any steps to merge itself with Reliance Retail. Future Group then approached the HC but a single-judge Bench refused to stay the arbitral tribunal order.</p><p>In December 2021, the CCI suspended Amazon\u0092s 2019 deal with Future Coupons and imposed a penalty of Rs 202 crore on the US ecommerce firm.</p><p>In January this year, a single-judge bench of HC passed an order dismissing Future Group\u0092s plea to stop arbitration proceedings initiated by Amazon in Singapore. But a divisional bench of the court ordered a stay on the Amazon-Future arbitration going on before a three-member arbitral tribunal.</p><p>In February, the Supreme Court set aside verdicts of a single-judge bench of the Delhi High Court which ordered strong steps against Future Group and also the order which refused to stay the Singapore tribunal\u0092s refusal to vacate the emergency award. The Supreme Court sent the matter to HC.</p><p>HC has listed the hearing of four cases in the legal battle between Future Group and e-commerce major Amazon on February 24 (Thursday). The court will hear Future Retail\u0092s plea, along with four other cases.</p><p>The four are the SIAC\u0092s emergency award, which stalled Future Group\u0092s deal with Reliance Retail, and the SIAC tribunal order, which upheld the emergency award.</p><p>There is also Amazon\u0092s case of the Enforcement Directorate (ED) issuing summons to it on violating the Foreign Exchange Management Act while investing in Future Coupons in 2019. Also Amazon had challenged the High Court\u0092s observations in its order in December 2020.</p><p>The legal battle between Future Group and Amazon started in October 2020 after the former decided to sell its retail, logistics, and warehousing businesses to Reliance Retail, a subsidiary of Reliance Industries.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Business Standard Ltd.</p></div>"}