{"date": "2021-12-16 14:45:21.683000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3381.83, "close": 3377.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NEXTECH AR SOLUTIONS CORP (\"NTAR-Z;NEXCF-0\")\n- Launches Stripe Integration For Its 3D Mapping &amp;\n- Events Platform\n\n  Nextech AR Solutions Corp. (\"Nextech\" or the \"Company\"), a Metaverse\nCompany and leading provider of augmented reality (\"AR\") experience\ntechnologies and services is pleased to announce it has integrated Stripe\nwith its events platform Map Dynamics. This integration will provide an\nadditional, no-touch projected $760,000 annual revenue stream for Nextech\nthrough a 2% platform percentage fee when Stripe is used for booth sales\nfor virtual or hybrid events. The new Stripe integration provides a\nsubstantial increased revenue capability for both Nextech and its clients.\n\n  The Company has integrated this new service into the existing vendor\nmanagement tool for its events platform. With this integration the company\nhas added a 5% platform fee on top of all transactions with 3% collected by\nStripe and 2% collected by Nextech. In 2021 Nextech transacted\napproximately $38 Million in booth sales through hundreds of events hosted\non its platform. To date these sales have 100% gone to the events hosts,\nhowever with today's Stripe integration announcement, on a going forward\nbasis, the company will participate in the revenue, representing an\nestimated $760,000 to Nextech annually. Although the company anticipates\nthat in 2022 its booth sales software platform will meet or exceed $38\nMillion in booth sales, it cannot guarantee it.\n\n  Booth sales are a critical part of in-person, hybrid, and even virtual\nevents, allowing event hosts to generate revenue through exhibitors and\nsponsorships. Nextech's events platform provides a variety of tools for\nevent hosts, making the process of selling exhibitor booths seamless and\neffortless. For tradeshows, festivals, conferences, and any event with a\nvendor marketplace, event hosts can use Nextech's interactive floorplan\nsoftware to sell booth space, promote vendors, and assist attendees in\nplanning and navigating.\n\n  Nextech AR CEO Evan Gappelberg commented, \"In 2021 alone our events\nplatforms have created a tremendous amount of value for our customers with\nover $38 Million in booth sales through hundreds of events hosted on our\nplatform. Through this important new integration with Stripe, we have\nincreased our cash flow generating power while also providing a\nfrictionless experience for event hosts who use our Stripe platform for\nbooth sales. This is truly a win-win situation and we're excited to roll\nthis out to end 2021 and see the benefits into 2022 and beyond.\"\n\n  About Stripe\n\n  Stripe is a technology company that builds economic infrastructure for\nthe internet. Businesses of every size--from new startups to public\ncompanies--use their software to accept payments and manage their\nbusinesses online. Stripe provides economic infrastructure for the\ninternet, allowing companies like Nextech to use their software to create\npayment acceptance options for its clients.\n\n  To learn more, please follow us on Twitter, YouTube, Instagram, LinkedIn,\nand Facebook, or visit our website: <a href=\"https://www.Nextechar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.Nextechar.com</a>.\n\n  About Nextech AR\n\n  Nextech AR Solutions is a Metaverse company that develops and operates\naugmented reality (\"AR\") platforms, transporting three-dimensional (\"3D\")\nproduct visualizations, human holograms and 360 portals to its audiences\naltering e-commerce, digital advertising, hybrid virtual events (events\nheld in a digital format blended with in-person attendance) and learning\nand training experiences.\n\n  Nextech focuses on developing AR solutions for the Metaverse, however\nmost of the Company's revenues are derived from three e-Commerce platforms:\nvacuumcleanermarket.com (\"VCM\"), infinitepetlife.com (\"IPL\") and\nTrulyfesupplements.com (\"TruLyfe\"). VCM and product sales of residential\nvacuums, supplies and parts, and small home appliances sold on Amazon.\n\n  Forward-looking Statements\n\n  The CSE and the NEO have not reviewed and do not accept responsibility\nfor the adequacy or accuracy of this release.\n\n  Certain information contained herein may constitute \"forward-looking\ninformation\" under Canadian securities legislation. Generally,\nforward-looking information can be identified by the use of forward-looking\nterminology such as, \"will be\" or variations of such words and phrases or\nstatements that certain actions, events or results \"will\" occur.\nForward-looking statements regarding the completion of the transaction are\nsubject to known and unknown risks, uncertainties and other factors. There\ncan be no assurance that such statements will prove to be accurate, as\nfuture events could differ materially from those anticipated in such\nstatements. Accordingly, readers should not place undue reliance on\nforward-looking statements and forward-looking information. Nextech will\nnot update any forward-looking statements or forward-looking information\nthat are incorporated by reference herein, except as required by applicable\nsecurities laws.\n\nInvestor Relations\nLindsay Betts\ninvestor.relations@Nextechar.com\n866-ARITIZE (274-8493) Ext 7201\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134800590.MNPRE2134802308-07370620211215</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}