{"date": "2021-11-23 14:10:54.272000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>GREENRISE GLOBAL BRANDS INC (\"XCX-Z\")\n- Launches Herbify CBD Wellness Brand in Germany\n\n     Greenrise Global Brands Inc.'s (formerly AMP Alternative Medical\nProducts Inc.) (\"Greenrise Global\"), announces the launch of its Herbify\nwellness brand of high-quality, cruelty-free and vegan CBD products\ndesigned to build on the power of the individual's daily self-care routine.\n\n     Herbify CDB oils are designed to be used orally on a daily basis and\ncontain organic hemp seed oil and CBD extract, essential fatty acids,\nvitamins, and minerals, as well as herbs, to form an important component of\nan individual's self-care routine for physical and mental wellbeing.\n\n     The Herbify CBD line includes:\n\n//st\n\n  * Herbify Boost Me contains organic turmeric, black pepper, peppermint,\nand ginger oil and is designed to detoxify and help the immune system and\nfocus. Available in 10 ml bottles for C34.90.\n  * Herbify Hold Me contains organic valerian, lavender which can help with\nrelaxation. Available in 10 ml bottles for C34.90.\n  * Herbify Empower Me contains organic licorice root, cinnamon and is\ndesigned to influence intestine and blood circulation. Available in 10 ml\nbottles for C34.90.\n  * Herbify Pure 5% (C29.90) and Herbify Pure 10% (C54.90) contain pure\norganic hemp seed oil and CBD extracts. Available in 10 ml bottles.\n\n//et\n\n     Herbify's CBD oils are made in Germany. All CBD products contain\norganically grown hemp CBD extract and are 100% natural, GMO-free and\nvegan. All Herbify products are laboratory-tested to ensure the highest\nquality and purity.\n\n     For further information, or to purchase Herbify's products, visit:\n<a href=\"https://herbify.de/pages/cbd-oel-kaufen\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://herbify.de/pages/cbd-oel-kaufen</a>\n\n     Management commentary\n\n     Mr. Hendrik Knopp, Director of Greenrise Global, \"We paid close\nattention to how Germans are thinking about and consuming CBD. Our Herbify\nwellness brand is suited for the CBD enthusiast or someone experiencing CBD\nfor the first time. Greenrise Global will be launching additional products\nto the German market which is anticipated to reach C1.6 billion by 20251\"\n\n     Mr. Alex Hintz, Chief Product Officer of Greenrise Global, \"The launch\nof the Herbify brand is just the first step on our exciting journey. We\ndesign products to help people to go about their day at greater ease and\nre-activate their natural potential. In the months ahead, we will be\nextending our product portfolio and are working on the next evolution in\nour product formulation to optimize bioavailability and efficacy.\"\n\n     About Herbify Brand\n\n     Medicinal plants are heroes. Herbify is firmly convinced of this and\nwants to make the power of plants fully accessible to customers based on\nscience. Me time is Herbify time. Herbify plant products are designed to\nmeet an individual's lifestyle and health needs. You are not the same every\nday, your care products are just as versatile. You can use Herbify\nindividually and flexibly according to your needs.  Herbify products are\nmade in Germany and are sustainably obtained, organic and vegan and are\nlaboratory-tests to ensure the highest quality and purity.\n\n     For our information, please visit: <a href=\"https://herbify.de\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://herbify.de</a>/\n\n     Visit Herbify's social media:\n\n     Facebook: <a href=\"https://www.facebook.com/Herbify-106058705133602\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.facebook.com/Herbify-106058705133602</a> Instagram:\n<a href=\"https://www.instagram.com/herbify.de\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.instagram.com/herbify.de</a>/ TikTok:\n<a href=\"https://www.tiktok.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.tiktok.com</a>/@herbify.de? YouTube:\n<a href=\"https://www.youtube.com/channel/UCffKM2fyXXjZ7nGpGUtliYA\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.youtube.com/channel/UCffKM2fyXXjZ7nGpGUtliYA</a> Twitch:\n<a href=\"https://www.twitch.tv/herbify\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.twitch.tv/herbify</a>\n\n     About Greenrise Global Brands Inc.\n\n     Greenrise Global helps people realize the beneficial properties of\ncannabis. Greenrise Global is a Canadian publicly traded corporation with\ntwo German operating subsidiaries: Greenrise GmbH (\"Greenrise Wellbeing\")\nand AMP Alternative Medical Products GmbH (\"AMP\").  Greenrise Wellbeing is\na CBD wellness firm based in Hamburg, with brands including Herbify and\nCANAVEX(R) in its portfolio. AMP is based in Erfurt and supplies medical\ncannabis products to pharmacies across Germany, including medical cannabis\nbrands from Aphria, Bedrocan, Little Green Pharma and AMP's branded line of\nproducts and sold through its nationwide sale team. AMP complies with the\nGerman Narcotic Drug Act (BtMG) and the Free State of Thuringia's\nregulatory requirements, ensuring that products imported from around the\nworld and sold in Germany meet the European Union's Good Manufacturing\nPractice (EU-GMP) standard.\n\n     For more information about Greenrise Global, please visit\nwww.greenriseglobal.com\n\n//st\n\n  * Source: Brightfield Group, European CBD, April 2020 Report\n\n//et\n\n     Neither the CSE nor its Regulation Services Provider (as that term is\ndefined in the policies of the CSE) accept responsibility for the adequacy\nor accuracy of this release.\n\n     This news release contains forward-looking statements that are based\non the Company's expectations, estimates and projections regarding its\nbusiness and the economic environment in which it operates, including with\nrespect to its business plans and milestones and the timing thereof.\nAlthough the Company believes the expectations expressed in such\nforward-looking statements are based on reasonable assumptions, such\nstatements do not guarantee future performance and involve risks and\nuncertainties that are difficult to control or predict. Therefore, actual\noutcomes and results may differ materially from those expressed in these\nforward-looking statements and readers should not place undue reliance on\nsuch statements. These forward-looking statements speak only as of the date\non which they are made, and the Company undertakes no obligation to update\nthem publicly to reflect new information or the occurrence of future events\nor circumstances unless otherwise required to do so by law.\n\n Contact Information:\n\nFor further information: GREENRISE'S CONTACT: Investor Relations: [email\nprotected], +1 236-833-1602; Media Inquiries: Valeria Bravo, Corporate and\nMedia Communications, [email protected], +1 604-689-7533\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132600123.MNPRE2132601087-05580620211123</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}