{"date": "2021-11-16 17:00:04.772000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">Founder &amp; CEO Miranda Kerr collaborates with Amazon and The Drop to launch a Holiday Gift Guide and her award-winning certified organic skincare brand, KORA Organics at amazon.com/koraorganics.</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">LOS ANGELES, Nov. 16, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">LOS ANGELES</span>, <span class=\"xn-chron\">Nov. 16, 2021</span> /PRNewswire/ -- Supermodel turned CEO <span class=\"xn-person\">Miranda Kerr</span> is collaborating with Amazon for the official launch of her award-winning, and certified organic skincare range, KORA Organics, available now in the Amazon store. </p>\n\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/1689173/MKxAMAZON_THEDROP_1_A_KORA.html\">\n                    <div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Miranda Kerr/KORA Organics x Amazon\" src=\"https://mma.prnewswire.com/media/1689173/MKxAMAZON_THEDROP_1_A_KORA.jpg\" title=\"Miranda Kerr/KORA Organics x Amazon\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMTY4OTE3My9NS3hBTUFaT05fVEhFRFJPUF8xX0FfS09SQS5qcGc=&amp;key=317632f51e7e722a1eb5676f8e87ad36d77e318ee3fef578813c31bb683a52df1635b0f60f9df8be8a32ad2335c8ae718273d4f8eac42080859b12577e89cded\"/></div></div>\n                        </a>\n                </p>\n\n    </div>\n<p>KORA Organics products are cruelty-free and formulated with clinically active certified organic ingredients that deliver powerful results, leaving your skin healthy, glowing and radiant. Amazon Premium Beauty will carry a curated selection of KORA Organic's product assortment, including best-selling cult favorites: Turmeric Brightening &amp; Exfoliating Mask and Noni Glow Face Oil. </p>\n<p>On <span class=\"xn-chron\">November 22</span>, in conjunction with the launch, Miranda will release her Holiday Gift Guide via Amazon's <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3360098-1&amp;h=525643047&amp;u=https%3A%2F%2Fwww.amazon.com%2Fthedrop%3Ftag%3Dgooghydr-20%26hvadid%3D350642877520%26hvpos%3D%26hvexid%3D%26hvnetw%3Dg%26hvrand%3D4425545553200409036%26hvpone%3D%26hvptwo%3D%26hvqmt%3Db%26hvdev%3Dc%26hvdvcmdl%3D%26hvlocint%3D%26hvlocphy%3D9060351%26hvtargid%3Dkwd-939579523660%26ref%3Dpd_sl_4raid9ktmu_b&amp;a=The+Drop\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Drop</a>, an engaging shopping experience that gives customers access to limited-edition collections and collaborations. Miranda's gift guide will feature items across fashion, home, beauty, and her favorite trend-forward styles from Staples by The Drop. Tune in to amazon.com/live with Miranda at <span class=\"xn-chron\">9am PST</span> on <span class=\"xn-chron\">November 22nd</span> as she chats live with customers and shares her favorite holiday looks and giftable beauty items from KORA Organics!</p>\n<p>Founder and CEO <span class=\"xn-person\">Miranda Kerr</span> said,<span> \"Being a busy Mom of three boys, I know how convenient it is to shop in the Amazon store.  I've been a customer for years and so am thrilled to be collaborating with them for my Holiday Gift Guide, available via The Drop. I'm even more excited for KORA Organics to be available in the Amazon Premium Beauty store. I founded KORA Organics on the values of providing people with healthy, clinically active and affordable products that deliver powerful results. This is an opportunity to bring our certified organic skincare to even more customers around the world.\"</span></p>\n<p>Miranda's 360-degree approach to health and wellness is the driving force behind the development, innovation, and success of KORA Organics - \"<span>It's important to nourish your mind, body and skin as they're all connected</span>,\" says Miranda. KORA Organics products are not only healthy and deliver powerful results – they also aim to inspire and uplift customers. Each product features a positive word of affirmation on the back and the formulas are filtered through Rose Quartz crystals during the manufacturing process to infuse the product with the energy of love. \"<span>It's my hope that people will feel that positive, loving, nurturing energy when using the products</span>.\"</p>\n<p>Stay tuned for more exciting news, sales, and events with KORA Organics and Amazon in the coming months!</p>\n<p><b>ABOUT KORA ORGANICS:<br/></b>KORA Organics was founded in 2009 by <span class=\"xn-person\">Miranda Kerr</span> in her home country of <span class=\"xn-location\">Australia</span>. KORA began to expand globally in 2017 and is now stocked across 30 countries, and ship globally via koraorganics.com. KORA Organics products are Certified Organic and their special ingredient \"Noni\" is a superfruit derived from the Noni Fruit. Every KORA Organics product is free of Sulfates, Parabens, Synthetic Fragrance, Synthetic Colors, T. E. A., D. E. A., Glycols, Silicones, PEGS, Ethoxylate and Formaldehyde. The range is cruelty free, not tested on animals.</p>\n<p><b>Certified Organic &amp; Climate Neutral <br/></b>KORA Organics products are certified organic by Ecocert/COSMOS, which is an independent global certification body that audits everything from the ingredients to the manufacturing facilities to the packaging materials, to guarantee they meet certified organic regulations. Ecocert/COSMOS Organic guarantees: responsible use of natural resources, respecting biodiversity, no GMOs, no petrochemicals, no artificial colors or artificial fragrances, recyclable packaging and cruelty free. </p>\n<p>KORA Organics has committed to become Climate Neutral Certified from 2021 and beyond. They are partnering with Climate Neutral, a non-profit organization, to help work toward carbon neutrality by measuring and offsetting KORA's carbon footprint annually, while working to reduce future emissions. </p>\n<p><b>Active Ingredients<br/></b>The efficacy in KORA Organics products comes from the organic nature of the ingredients. Studies have shown that organically grown fruits and vegetables may produce up to *60% more antioxidants than non-organic fruits and vegetables. Some of the ingredients used in KORA's formulations include Noni Fruit, Kakadu Plum, Silver Ear Mushroom, Green Tea, Aloe Vera, Rosehip Oil, Turmeric, <span class=\"xn-person\">Aspen Bark</span>, Kahai Oil, Tomato Fruit, Macadamia Nut, Papaya and Sea Buckthorn, along with many other rejuvenating and replenishing ingredients, that are also rich in antioxidants and essential fatty acids to feed your skin with the nutrients it needs to function at its best.</p>\n<p>*British Journal of Nutrition Volume 112, Issue 514 September 2014, pp. 794-811</p>\n<p><b>Noni Extract<br/></b>All products contain Noni Extract, which is a superfruit Miranda has been using since her grandmother introduced it to her when she was 13 years old. Noni Fruit is super rich in antioxidants, vitamins and minerals and is revered for its healing and rejuvenating properties. The <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3360098-1&amp;h=3089338748&amp;u=https%3A%2F%2Fkoraorganics.com%2Fpages%2Fabout-antioxidants&amp;a=powerful+antioxidant\" data-type=\"url\" class=\"tr-link\" translate=\"no\">powerful antioxidant</a></u> qualities in the Noni Fruit protect skin from environmental damage caused by free radicals, which are constantly stressing our skin and can lead to the signs of premature ageing and skin sensitivity.</p>\n<p><b>Rose Quartz<br/></b>KORA Organics has created a unique process in which the formulations are filtered through Rose Quartz crystals during the manufacturing process. Rose Quartz is a soft pink crystal believed to carry a very gentle, soothing energy to encourage love of ourselves and others. By filtering the products through Rose Quartz, we hope to infuse a vibration of love into the products and on to our customers.</p>\n<p>CONTACT: <a href=\"mailto:kora@factorypr.com\" data-type=\"email\" translate=\"no\">kora@factorypr.com</a></p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n</div>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=NY77002&amp;sd=2021-11-16\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1OWTc3MDAyJnNkPTIwMjEtMTEtMTY=&amp;key=5e2ec4a9e62189d1eb35ba8fbabf0579060164f35da1c7c7c8c37a0fb68375e2cfd0de2db856972ceb31e813cc1ab91bac030846bac7ffe9b4ec3f5bf8dce806\"/></div></div> View original content to download multimedia:<a href=\"https://www.prnewswire.com/news-releases/kora-organics-continues-global-expansion-with-amazon-301425766.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/kora-organics-continues-global-expansion-with-amazon-301425766.html</a><p></p>\n<p>SOURCE  KORA Organics</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: KORA-Organics-Amazon</p></div>"}