{"date": "2021-11-22 11:00:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Chris Kirkham and Jeffrey Dastin</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Nov 22 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Five members of Congress called for federal consumer-privacy legislation after a <a href=\"https://www.reuters.com/investigates/special-report/amazon-privacy-lobbying\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Reuters report</a> published Friday revealed how Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> has led an under-the-radar campaign to gut privacy protections in 25 states while amassing a valuable trove of personal data on American consumers.</p><p>\"Amazon shamefully launched a campaign to squash privacy legislation while its devices listen to and watch our lives,\" U.S. Senator Richard Blumenthal, a Connecticut Democrat who has been involved in bipartisan negotiations on privacy legislation, wrote Friday on Twitter. \"This is now the classic Big Tech move: deploy money and armies of lobbyists to fight meaningful reforms in the shadows but claim to support them publicly.\"</p><p>The revelations underscored the need for bipartisan action on stronger privacy protections, he wrote. No major federal privacy legislation has passed Congress in years because members have been deadlocked on the issue.</p><p>U.S. Senator Ron Wyden, an Oregon Democrat who has introduced several privacy bills in recent years, said in a statement that the Reuters story showed how companies including Amazon are \"spending millions to weaken state laws,\" and hoping Congress will also water down federal legislation \"until it's worthless.\"</p><p>\"Congress needs to prove Amazon wrong, and pass legislation that finally stops massive corporations from abusing and exploiting our personal data,\" Wyden said.</p><p>Asked for comment, Amazon did not directly address the lawmaker criticisms of its lobbying campaign against privacy protections. The company reiterated its statement for the previous Reuters report, saying it prefers federal privacy legislation to a \"patchwork\" of state regulations. The company said it wants one federal privacy law that \"requires transparency about data practices, prohibits the sale of personal data without consent, and ensures that consumers have the right to request access to and deletion of their personal information.\"</p><p>U.S. Representative Jan Schakowsky, an Illinois Democrat who chairs a key House consumer protection subcommittee that deals with privacy issues, said the Reuters revelations show how Amazon is working to block consumer privacy legislation while \"claiming to support\" such regulations. </p><p>\"What they mean is that they support privacy legislation that protects their profits and their right to mine consumers' data, including voice recordings and facial scans,\" she said in a statement. \"Congress is not convinced nor are we intimidated.\"</p><p>Two other lawmakers who represent areas with a significant Amazon presence - U.S. Senator Marsha Blackburn, a Tennessee Republican, and U.S. Representative Suzan DelBene, a Washington state Democrat - also said Reuters' findings showed the need for federal action to protect consumers.</p><p>\"Congress will protect consumers' privacy to stop big tech companies from stealing Americans' personal information, whether these companies like it or not,\" Blackburn said in a statement.</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Chris Kirkham and Jeffrey Dastin)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Chris.Kirkham@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Chris.Kirkham@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-AMAZON.COM/PRIVACY-CONGRESS (PIX)</p></div>"}