{"date": "2022-02-21 07:11:20.874000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 2039CImmotion Group PLC21 February 2022</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>Immotion Group plc</p>\n<p>(\"Immotion\", the \"Company\" or the \"Group\")</p>\n<p>Shark Reef Aquarium Expansion and Contract Extension, and Trading Update</p>\n<p>Shark Reef Aquarium Expansion and Contract Extension</p>\n<p>Immotion, the UK-based immersive entertainment group, is pleased to announce an expansion of capacity and a contract extension at Shark Reef Aquarium, inside Mandalay Bay Resort &amp; Casino, Las Vegas, currently the Group's largest installation.</p>\n<p>This will see the theatre capacity increase to 48 seats from its current 36 seats, allowing greater customer throughput, especially at peak times. The current contract, which will also include the expanded capacity, will also be extended by a further 12 month period through to 31 January 2024. We envisage that the expanded theatre will be fully operational in March 2022, in time for USA Spring Break.</p>\n<p>Capacity Expansion at Other Partner Sites</p>\n<p>In addition to the expansion at Shark Reef Aquarium, capacity at another two of our strongest performing sites has been significantly expanded. Our installation at Sea Life London has been increased from 8 to 14 seats and we have also doubled the capacity of our installation at Odysea Aquarium (Scottsdale, Arizona) from 6 to 12 seats.</p>\n<p>These expansions demonstrate the potential to make our installations a material generator of revenue for both the Group and its partners and to establish our installations as core integrated attractions in partners' venues.</p>\n<p>Trading Update</p>\n<p>Summary</p>\n<p>Further to the trading update on 16 December 2021, the Company is pleased to confirm that unaudited H2 revenue was circa £6.6m, a 135% increase compared to unaudited revenue of £2.8m in H1 (H2 2020: £2.0m).</p>\n<p>H2 operating cash inflow was strong, with year-end cash on hand of £1.1m, almost double the £0.6m at the half year.</p>\n<p>Location Based Entertainment (\"LBE\")</p>\n<p>Trading in our core LBE division in the second half of 2021 has been very encouraging with unaudited revenue of £4.0m, a 74% increase compared to £2.3m in H1, and a 207% increase compared to £1.3m H2 2020.</p>\n<p>We opened two new sites in H2 and now have a total of 49 sites (373 headsets), with 57 per cent. of headsets now located in the USA. We continue to see new interest in our 'Undersea Explorer' theatre style offering for aquariums and are now in advanced discussions with a number of major zoos regarding the first installations of our new 'Gorilla Trek' VR Theatre and we expect our first signings in the coming weeks.</p>\n<p>Home Based Entertainment (\"HBE\")</p>\n<p>We sold circa 35,000 units of our Let's Explore Oceans product in 2021, generating unaudited revenue of £2.5m, a three-fold increase compared to £0.7m in 2020.</p>\n<p>Whilst the sales growth was very encouraging, with the product selling out in the UK, both direct and via Amazon, and on Amazon in the USA, we were hit in the final six weeks of 2021 by very challenging logistics, which had a significant adverse impact on landed product costs. We also suffered with some stock not reaching its destination in time resulting in lost sales. The delayed stock, 5,000 units in total, will be sold throughout 2022.</p>\n<p>The soft 'beta' launch of our Vodiac offering began late-December with invitations sent to the Let's Explore Oceans users. We have seen over 4,350 downloads of the iOS and Android apps and over 1,250 premium VR video purchases so far. These data points have been used to further hone the headset offering which will go on sale this coming week. The product will be available online via Vodiac.com and Amazon, and through a number of new retail partners. The blend of direct to consumer, Amazon and retail should allow us to gather sufficient data as to how to best scale this business.</p>\n<p>Uvisan</p>\n<p>Uvisan's total unaudited revenue for H2 was £0.4m (up from £0.1m in H1), demonstrating the value of our growing distributor and reseller network. We now have 12 resellers and 3 distributors, located in the UK, Europe and the USA. We are seeing growing demand for our UV sanitising cabinets.</p>\n<p>As well as demand for our UV cabinets for sanitising a wide range of \"touched\" products, we see real opportunity in the enterprise, education and training XR headset and device market (virtual reality, augmented reality and mixed reality) which is set for huge growth in coming years. Accordingly, we will focus on building a network of partners with deep roots into that sector.</p>\n<p>Despite a number of early enquiries, we chose to delay the launch of Cleanroom in order to refine its proprietary safety and control features and we continue to believe that it has significant potential in healthcare, office and other sectors, in both new build and refurbishment projects. We are now ready to work with our growing partner network to commercialise this product.</p>\n<p>Uvisan now has an order book of circa £0.3m and we are looking forward to a year which should see substantial growth versus 2021.</p>\n<p>Martin Higginson, CEO, Immotion Group plc said:</p>\n<p>\n<span>\"To see our core LBE business bounce back so quickly clearly demonstrates its robustness and growth potential.</span>\n<span>\n<span>\n</span>\n<span>We are absolutely delighted to be expanding capacity at a number of key sites, especially our largest installation at Shark Reef Aquarium, Mandalay Bay Resort &amp; Casino which will now run through to at least January 2024.</span>\n</span></p>\n<p>\"The launch of our new 'Gorilla Trek' VR theatre experience has been extremely well received and we look forward to signing up our first zoo partner in the coming weeks. This sector offers huge global roll out potential with many USA zoos boasting footfall well in excess of a million visitors per annum.</p>\n<p>\"Despite the logistical challenges, we sold circa 35,000 units of our Let's Explore Oceans product, as well as gaining a new distribution partner in Australia. Vodiac will carry forward the key learning so far in order to provide a broader product offering to a wider audience. We believe there is a real opportunity to democratise the home VR video market. Our offering of a VR headset, combined with original and curated VR content at a sub £30 price tag will, we believe, allow us to build an audience of scale.</p>\n<p>\"Our Uvisan products continued to sell well, with a growing roster of distribution partners, including in Australia and the USA.</p>\n<p>\"Overall, we feel we have made good progress across the company and are looking forward with renewed confidence.\"</p>\n<p>Enquiries:</p>\n<p>For further information please visit <a href=\"http://www.immotion.co.uk\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.immotion.co.uk</a> , or contact:</p>\n<p>\n<span>\n</span></p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>Immotion Group plc</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>Martin Higginson</span>\n</p>\n<p>\n<span>David Marks</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>investors@immotion.co.uk</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>WH Ireland Limited</span>\n</p>\n<p>\n<span>(Nomad and Joint Broker)</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>Adrian Hadden</span>\n</p>\n<p>\n<span>Jessica Cave</span>\n</p>\n<p>\n<span>Darshan Patel</span>\n</p>\n<p>\n<span>Ben Good</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>Tel + 44 (0) 207 220 1666</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Alvarium Capital Partners</span>\n</p>\n<p>\n<span>(Joint Broker)</span>\n</p>\n</td>\n<td>\n<p>\n<span>Alex Davies</span>\n</p>\n</td>\n<td>\n<p>\n<span>Tel: +44 (0) 207 195 1458</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>Shard Capital Partners LLP</span>\n</p>\n<p>\n<span>(Co-Broker)</span>\n</p>\n</td>\n<td>\n<p>\n<span>Damon Heath</span>\n</p>\n<p>\n<span>Erik Woolgar</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>Tel: +44 (0) 20 7186 9900</span>\n</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>The information contained within this announcement is deemed by the Company to constitute inside information as stipulated under the Market Abuse Regulaon (EU) No. 596/2014 as amended by The Market Abuse (Amendment) (EU Exit) Regulations 2019. Upon the publication of this announcement via Regulatory Information Service this inside information is now considered to be in the public domain.</span>\n</p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>TSTQBLFLLLLXBBQ</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}