{"date": "2021-11-16 14:47:13.768000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>AMAZON.COM INC (\"AMZN-Q\")\n- Books Editors Announce 2021's Best Books of the Year\n\n    Today, the Amazon Books Editors announced their selections for the Best\nBooks of 2021, naming Amor Towles' The Lincoln Highway as the Best Book of\nthe Year; Towles' New York Times bestseller A Gentleman in Moscow was also\nincluded in the Best Books selection in 2016. The annual list is\nhand-picked by a team of editors who read thousands of books each year.\nThey share their recommendations with customers to help make holiday\nshopping easier. Featuring the top 100 books published this year, the\neditors' selections also break out the top 20 books in numerous categories,\nincluding mysteries, memoirs, children's books, and cookbooks. To explore\nthe full list of the Best Books of 2021, visit amazon.com/bestbooks2021.\n\n    \"This year, fiction reigned, with emerging and established authors\ntelling stories of struggle, daring, and redemption,\" said Sarah Gelman,\nEditorial Director of Amazon Books. \"We all had our personal favorites this\nyear, but the one book the team unanimously agreed on was Amor Towles' The\nLincoln Highway--we just couldn't stop talking about it. The four main\ncharacters' sense of innocence felt like the hope we needed as we end this\nyear.\"\n\n    The Lincoln Highway resonates with readers, too. The quote most often\nhighlighted by Kindle readers is, \"For what is kindness but the performance\nof an act that is both beneficial to another and unrequired?\"\n\n    \"It's a real honor to have The Lincoln Highway singled out by the team\nat Amazon,\" said Towles. \"I can only hope that their confidence in the book\nis matched by the enjoyment of readers who join Emmett, Billy, Duchess, and\nWoolly on their fateful journey.\"\n\n    The Amazon Books Editors Top 10 picks of 2021, as described by the\neditors, are:\n\n//st\n\n* The Lincoln Highway by Amor Towles: Towles (A Gentleman in Moscow) might\n  just have written one of the best novels of this decade, delivering one\n  of the greatest gifts of fiction: hope. Filled with 1950s nostalgia and\n  the gentle naivete and hijinks of those who are young, optimistic, and on\n  a mission, The Lincoln Highway follows four kids whose paths collide as\n  they search for their mother and a stashed wad of cash. -Al Woodworth\n* Crying in H Mart: A Memoir by Michelle Zauner: You will laugh, you will\n  cry, your stomach will rumble with hunger, and you'll tap your toe to the\n  beat of this powerful mother-daughter and Korean American story that\n  shows just how important it is to accept someone fully for who they\n  are--and love them just the same. -Al Woodworth\n* The Plot by Jean Hanff Korelitz: A story within a story that is a Rubik's\n  Cube of twists, The Plot follows an uninspired author fading into\n  obscurity until his new book rockets him to fame. Only the plot isn't\n  his, and someone knows it. Korelitz keeps us guessing--even when all\n  seems clear--right up to the knockout ending. -Seira Wilson\n* How the Word Is Passed: A Reckoning with the History of Slavery Across\n  America by Clint Smith: Smith's tour of places and landmarks linked to\n  slavery is the type of book that can change your perspective, even if you\n  have known of the places (or thought you did) your entire life. -Chris\n  Schluep\n* The Four Winds by Kristin Hannah: Set during the Great Depression and\n  featuring an unlikely heroine who will lodge herself in your heart, The\n  Four Winds is a reminder, when we so urgently need it, of the resiliency\n  not only of the human spirit, but of this country as well. Hannah's\n  latest story reads like a classic. -Erin Kodicek\n* Empire of Pain: The Secret History of the Sackler Dynasty by Patrick\n  Radden Keefe: From the author of Say Nothing comes an addictive account\n  of the Sackler family--the founders and masterminds behind OxyContin.\n  From their rise by marketing pharmaceuticals, to the backdoor dealings of\n  FDA approvals, to the front door dealings of museum philanthropy, this is\n  an impossible-to-put-down true story of ambition, power, deception, and\n  greed. -Vannessa Cronin\n* Harlem Shuffle by Colson Whitehead: The two-time Pulitzer Prize winner of\n  The Nickel Boys and The Underground Railroad tells a blisteringly\n  entertaining tale of schemers and dreamers, mobsters and crooks,\n  elaborate heists and furniture fronts, and the thrilling mischief of\n  those who are up to no good and others who are just trying to make a\n  living. -Al Woodworth\n* Great Circle by Maggie Shipstead: Shipstead has accomplished the\n  impossible--an epic novel that is ambitious, literary, and utterly\n  accessible. Great Circle follows two women who yearn for adventure and\n  freedom--aviator Marian Graves and starlet Hadley Baxter--and like\n  flying, it's the thrill of the century. -Sarah Gelman\n* Project Hail Mary by Andy Weir: As in The Martian, Weir makes science and\n  problem solving not only cool but absolutely essential to survival. In\n  Project Hail Mary, Weir delivers an electrifying space adventure sure to\n  wrench your gut and pull at your heart strings. -Adrian Liang\n* Klara and the Sun by Kazuo Ishiguro: Ishiguro's quiet, emotional, and\n  moving novel about a robot girl with artificial intelligence, who is\n  designed as a playmate for real children, is a story that will captivate\n  and haunt readers. -Chris Schluep\n\n//et\n\n  The Amazon Books Editors Top Children's pick of 2021 is:\n\n//st\n\n* The Beatryce Prophecy by Kate DiCamillo: An extraordinary tale of courage\n  and found family, this book has all the hallmarks of an instant\n  classic--a beautifully layered story with unforgettable characters who\n  take root in your heart. -Seira Wilson\n\n//et\n\n    Authors of the top three books--Amor Towles, Michelle Zauner, and Jean\nHanff Korelitz--will participate in an Amazon Live Author Series\nconversation in celebration of the Best Books of the Year selection on\nNovember 16, 2021, at 9 a.m. PST. To tune in, visit Amazon Live.\n\n    For more information about the books featured on the Best Books of the\nYear list, as well as insightful reviews of new books, author interviews,\nand hand-curated roundups in popular categories, visit the Amazon Book\nReview at www.amazon.com/amazonbookreview. You can also follow the Amazon\nBooks Editors recommendations and conversations @amazonbooks on Facebook,\nTwitter, and Instagram.\n\n    About Amazon\n\n    Amazon is guided by four principles: customer obsession rather than\ncompetitor focus, passion for invention, commitment to operational\nexcellence, and long-term thinking. Amazon strives to be Earth's Most\nCustomer-Centric Company, Earth's Best Employer, and Earth's Safest Place\nto Work. Customer reviews, 1-Click shopping, personalized recommendations,\nPrime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career\nChoice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out\ntechnology, Amazon Studios, and The Climate Pledge are some of the things\npioneered by Amazon. For more information, visit amazon.com/about and\nfollow @AmazonNews.\n\n     Contact Information:\n\n     Amazon.com, Inc.\n     Media Hotline\n     Amazon-pr@amazon.com\n     www.amazon.com/pr\n\n                            ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2131900666.MNPRE2131902504-06464320211116</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}