{"date": "2021-11-07 21:27:33.814000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Those who order from Amazon expect the delivery to arrive as quickly as possible. But what price the Amazon parcel deliverers pay for it and under what exploitative conditions they have to work is probably not clear to the consumers.</p><p>The study by the Vienna University of Economics and Business (WU) funded by the Vienna University of Economics and Business Administration \"Systemically relevant, but invisible: working conditions of migrant and refugee Amazon deliverers during the COVID-19 pandemic\" closes a research and knowledge gap about the employment relationships of deliverers, who work for chains of subcontractors commissioned by Amazon.</p></div><div class=\"tr-npp-body\"><p>This shows who is suffering from particularly bad working conditions and whose work is neither recognized nor adequately paid: They are often refugee or immigrant workers. This finding is also confirmed by the labor law advice of AK Wien. The concerns of the employees in the small transport industry who turn to the AK make it clear that there is a lot going on in this industry.</p><p>During the corona lockdowns, online orders increased sharply. This was an extreme challenge for one professional group that was not applauded: the parcel delivery staff. The AK-funded study by WU Vienna \" Systemically relevant, but invisible: Working conditions of migrant and refugee Amazon delivery staff during the COVID-19 pandemic\" by Dr. Judith Kohlenberger, Dr. Milda Zilinskaite, Dr. Aida Hajro and Irini Vafiadis deal with precisely this professional group, whose work remains largely hidden despite its increased importance - this discussion is (e) missing in scientific studies as well as in public debates. It is therefore not surprising that there has not yet been any improvement in the quality of work or wages.</p><p>For the qualitative study, 15 delivery drivers (in their first languages) who worked for subcontractors commissioned by Amazon were surveyed. The participants were exclusively men between the ages of 19 and 43 and were asked about their motivation, working conditions, their collective identity as Amazon deliverers and the changed working conditions caused by the pandemic. For most of them, the job of delivery was their only source of income. They came from Hungary, Croatia, Syria, Iran and Afghanistan - almost all of them had come to Austria in the past ten years.</p><p>The statements of the interviewees paint a picture of systematic exploitation, which is mentally and physically stressful: ? It used to be like this only around Christmas time and now it is like that all the time. In the past it was always said to hold out for a month or two and then it was over. But now it is always like that, \"reports one of the respondents about how the workload has increased during the corona crisis.</p><p>Statements such as ? I use all of my life energy in this work? or ?Every day the delivery companies destroy the drivers? illustrate the extremely stressful work situation.</p><p>Very often there is reports of massive work pressure: ? The working hours are predetermined. Eight hours per day. But the tour is about nine hours ; \"\" It always takes nine to ten hours and not just eight hours. You always work overtime ; \"\". . . but we work ten hours a day and sometimes up to eleven hours . \"</p><p>Amazon parcel deliverers rarely work directly for Amazon. These subcontractor constructions create great uncertainty and were summarized by one of the respondents as follows: ? Amazon got rid of the employee and instead outsourced us to the delivery people. Amazon continues to set the tone and is the 'boss', but not legally responsible for us as we are not Amazon employees . \"</p><p>Study author Judith Kohlenberger from the Vienna University of</p><p>Economics and Business, ?All of the delivery people that we were able to interview as part of the study had either immigrated themselves or had a refugee or migration background. In many cases, this fact is causal for their exploitation, as the insecure residence status, lack of social networks in the destination country, lengthy recognition of qualifications obtained abroad and experiences of discrimination on the domestic labor market create additional pressure to accept the precarious delivery job.</p><p>Parcel deliverers are therefore another systemically relevant group of employees who are strongly influenced by migrants. They have carried our country through the crisis, but have hardly received any recognition to date - on the contrary: their labor and human rights were often further curtailed in the pandemic. \"</p><p>Findings confirmed by AK labor law advice</p><p>The findings of the study coincide with the experiences from the labor law advice of the AK Wien. Bianca Stepwieser, Head of Labor Law, explains: ?The most common concerns that employees in the small transport sector approached us with were wage arrears, unjustified deductions, unpaid overtime, unpaid rest periods or a lack of daily allowance. The pressure on the employees is immense and the fear of losing their jobs is great. The story of the origin of the deliverers, who mostly fled or immigrated, makes it even more difficult for them to claim their rights.</p><p>The cases that still end up with us are only the tip of the iceberg. It can be assumed that labor law violations in the small transport sector are not the exception, but rather the rule. During the consultation, the impression arises that Amazon is not doing anything against the systematic exploitation of employees and is evading responsibility by outsourcing it to subcontractors.</p><p>That is why the AK has long called for the first client to be liable for wages. The complex chains of subcontractors make it very difficult or even impossible to hold the company accountable that makes the greatest profit from the numerous labor law violations - and in this case that is Amazon.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}