{"date": "2021-11-05 14:13:49.246000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3384.0, "close": 3518.99}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_f1bvfn26&amp;referenceId=tag:reuters.com,2021:newsml_OVF2BTRPN_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_f1bvfn26&amp;referenceId=tag:reuters.com,2021:newsml_OVF2BTRPN_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: From a deal that could mean the end of coal, to Uber's first ever quarterly profit, we round up the big stories in business and finance over the week to November 5. Ilan Rubens reports.<br/>Short Link: <a href=\"https://refini.tv/3BNH917\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3BNH917</a><br/><br/>Video Transcript:<br/><br/>From the end of coal, to Uber's first profit, this is The Week in Numbers. First up. 77 is the number of signatories to a pledge to phase out coal. The vow came at the UN climate summit in Scotland. UK minister and event president Alok Sharma hailed the deal:<br/><br/>Today I think we can say that the end of coal is in sight.<br/><br/>46 countries are among the signatories, but skeptics point out that it excludes major coal consumers including India and China. Around $53 billion is the target valuation for electric pickup truck maker Rivian at its upcoming share sale. That would make the Amazon-backed firm almost as valuable as Japanese giant Honda. 108% was the gain for shares in Avis on Tuesday. The car rental company posted results way ahead of analyst forecasts, but some market watchers also saw signs of a fresh meme-stock mania. $5.6 billion is how much Coca-Cola is paying to take full control of energy drink BodyArmor. Acquiring the rival to PepsiCo's Gatorade marks Coke's largest-ever deal for a single brand. And $8 million is Uber's first ever quarterly profit after over a decade of operations. The champagne may stay on ice though, as that's an adjusted number excluding assorted items. Add in a massive drop in the value of its stake in Chinese ride-hailing giant Didi, and the firm saw a net loss of $2.4 billion. <br/></span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}