{"date": "2022-01-23 19:34:08.304000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Jan. 24 -- Amazon.com Inc. has offered financial support to bail out the debt-laden Future Group on the condition that the group calls off the Rs.24,713 crore transaction with Mukesh Ambani's Reliance Industries Ltd.</p><p>Amazon was responding to a plea by Future Retail Ltd's independent directors for emergency funding of Rs.3,500 crore by Monday.</p></div><div class=\"tr-npp-body\"><p>In a 22 January letter, the US e-commerce giant said it is interested in pursuing a 30 June 2020 term sheet signed between Samara Capital, Future Retail and the promoters of the Indian retailer to acquire all retail assets of Future Retail, including the \"small-store formats\" comprising the \"Easy Day\", \"Adhaar\" and \"Heritage\" brands, through an Indian owned and controlled entity structure led by Samara and supported by Amazon for Rs.7,000 crore.</p><p>Amazon and home-grown investment firm Samara Capital have jointly invested in other Indian retail assets, including supermarket chain More from the Aditya Birla Group in 2018. India restricts foreign investments in multi-brand retailers to 51%, but the investments are subject to government approval.</p><p>Future Group has been fighting a bitter legal battle with Amazon for about 18 months in various courts in India and in Singapore to clinch the deal with Reliance Industries. The group owes about $2.5 billion to 20-odd creditors.</p><p>According to a person close to the developments, independent directors of FRL are preparing a response to Amazon's letter, reiterating their query about whether Amazon was authorized to negotiate on behalf of Samara Capital and if the latter was an entity owned and controlled by resident Indians. \"They have reiterated an offer that was rejected by the management of FRL two years ago. The company's problems have compounded since then. We have asked for a proposal that addresses the needs of lenders, employees, vendors and other stakeholders, and all they have done is to come back with the same offer. We asked for clarity on the status of Samara. There's no response to that either,\" the person said.</p><p>FRL is faced with the prospect of being dragged to bankruptcy court if it fails to service its debts by 29 January. \"We face the prospect of bankruptcy and liquidation, and we need to be sure we are talking to a party with serious intent to help resolve the situation,\" the person said.</p><p>After Future Retail missed its 31 December repayment deadline for borrowing worth Rs.3,495 crore, the company now has time till 29 January to pay lenders, failing which it will be classified as non-performing. That is because Future Retail's loans were recast under the Reserve Bank of India's (RBI) 6 August 2020 circular that permits a 30-day review period from the date of default for restructured loans. If the company is unable to repay by 29 January, banks would have to set aside more than usual provisions as it would be considered that the account was never recast and had turned NPA on the date of implementation of the resolution plan. In that case, provisions would have to be made as if the recast never occurred, forcing banks to classify the account as \"doubtful\", requiring at least 25% provisions subsequently. Under RBI rules, banks must classify NPAs into three buckets-substandard, doubtful and loss asset-depending on default duration. As bad loans remain on a bank's books for longer, the chances of them being recovered also diminish.</p><p>\"We note that significant time has been lost on account of the unwillingness of FRL (Future Retail) and independent directors to consider potential solutions facilitated by Amazon in the past. Nevertheless, we reaffirm our offer to assist FRL within the framework of our rights under the agreements,\" said Amazon in the letter.</p><p>In the letter, Amazon said its move to help would in no way affect the pending legal cases between Amazon and Future Group. \"Our engagement shall, in no manner, affect the binding nature of the injunctions passed in the arbitration proceedings and by Indian Courts (\"binding injunctions\"), including in relation to the alienation/transfer/encumbrance/disposal of FRL's retail assets and such engagement will be consistent with our rights under the agreements,\" the letter said.</p><p>In the letter, Amazon said the proposed Samara-Future deal would be structured similar to the proposed acquisition of the retail and wholesale undertaking of Future Group (which includes FRL's retail assets) by Reliance Retail and Fashion Lifestyle Ltd.</p><p>\"We understand that this entity has negligible business operations and whose parent entity Reliance Retail Ventures Ltd has received at least Rs.47,265 crore from various foreign investors. We also understand that this amount is proposed to be utilised to fund the acquisition of FRL's retail, wholesale and logistics assets,\" says the latest letter.</p><p>Amazon also asked Future Retail's independent directors to implement the provisions set out in the Samara term sheet immediately, including by providing Samara with the opportunity to conduct due diligence of Future Retail. \"If access can be provided in relation to all financial, tax, regulatory, operational, licenses, assets, encumbrances, material contracts, material liabilities, material litigations, material investigations and similar data, which was shared with the MDA (Mukesh Dhirubhai Group), Samara is ready to commence due diligence exercise from Sunday, 23 January, and complete it in an expedited manner,\" reads the letter.</p><p>\"Given your (FRL independent directors') request that we (Amazon) assist on an urgent basis, in order to expedite the process further, it will help if all the existing due diligence report(s) prepared by or on behalf of FRL, are made available to Samara by Sunday, 23 January,\" said Amazon, while urging FRL to engage in discussions with Samara over the proposed deal as soon as possible so that binding commitments can be arrived at within the shortest possible time.</p><p>In the letter, Amazon asked FRL to consider recovering up to Rs.4,303 crore by unwinding the transactions relating to outstanding advances and security deposits as per the audited financial statements of FRL.</p><p>\"Samara and Amazon are confident that if the independent directors and FRL provide immediate access to the information and records of FRL and fully co-operate in the engagement/discussions, the transactions contemplated in the Samara term sheet can be implemented in an expedited manner. Further, we, along with Samara, are open to engaging with other stakeholders to find a viable solution at hand,\" said the letter. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}