{"date": "2022-02-16 17:27:14.143000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3130.21, "close": 3093.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>CELLEBRITE DI LTD (\"CLBT,CLBTW-Q\")\n- Fourth Quarter and Full Year 2021 Results\n\n     Cellebrite, a global leader in Digital Intelligence (\"DI\") solutions\nfor the public and private sectors, today announced financial results for\nthe three months and full year ended December 31, 2021.\n\n     \"We delivered a record revenue quarter, closing a strong year of\nrecord ARR, revenue, and operating profitability, while continuing to\nsuccessfully execute on our strategy to modernize the entire investigative\nprocess for our customers,\" said Yossi Carmil, Cellebrite's CEO. \"Our\nmarkets are healthy, our market position is strong, and our strategy is\nclear. We will continue to spearhead the growth of the investigative DI\nmarket as an undisputed leader of digital transformation in investigations.\nAs a one-stop-shop DI vendor, Cellebrite is a valued technology partner to\nthe law enforcement and judicial system. We look forward to continuing to\nprovide our customers with a software platform that enables the\nacceleration of justice, while delivering growth and profitability to our\nshareholders.\"\n\n     Fourth Quarter Financial Highlights\n\n     *  Revenue of $67.9 million, up 19% year-over-year, of which\nsubscription revenue was $50.1 million, up 32% year-over-year\n     *  Annual Recurring Revenue (ARR) of $187.1 million, up 37%\nyear-over-year\n     *  Recurring revenue dollar-based net retention rate of 137%\n     *  GAAP gross profit and gross margin of $55.6 million and 81.8%,\nrespectively\n     *  GAAP net income of $51.9 million; Non-GAAP net income of $5.2\nmillion\n     *  GAAP Diluted EPS of $0.25; Non-GAAP Diluted EPS of $0.03\n     *  Adjusted EBITDA and Adjusted EBITDA margin of $8.9 million and\n13.1%, respectively\n\n     Full Year Financial Highlights\n\n     *  Revenue of $246.2 million, up 26% year-over-year, of which\nsubscription revenue was $183.3 million, up 41% year-over-year\n     *  GAAP Gross profit and gross margin of $203.7 million and 82.7%,\nrespectively\n     *  GAAP net income of $71.4 million; Non-GAAP net income of $38.0\nmillion\n     *  Adjusted EBITDA and Adjusted EBITDA margin of $47.9 million and\n19.5%, respectively\n\n     Fourth Quarter and Recent Digital Intelligence Highlights\n\n     *  Closed 25 deals above $500,000\n     *  Closed the largest deal in the Company's history, with an\ninternational customer, of over $11 million in revenue.\n     *  Advanced its SaaS-based investigative digital evidence management\nsolution, Cellebrite Guardian, by joining AWS Partner Network as an\nAdvanced Technology Partner and by deploying it in AWS London Data Center.\n     *  Delivered early success on the acquisition of open-source\nintelligence company Digital Clues, by winning a significant customer\ncontract.\n     *  Formed a collaboration with The Exodus Road, a Colorado-based\nnonprofit organization specializing in disrupting human trafficking,\nfocused on training police and government officials in Brazil to combat\nhuman trafficking more effectively.\n\n     Full Year Digital Intelligence and Other Highlights\n\n     *  Began trading on Nasdaq on August 31, 2021, under the ticker\nsymbols \"CLBT\" and \"CLBTW\", as a result of entering and completing a\nbusiness combination with TWC Tech Holdings II Corp.\n     *  Closed 83 deals above $500,000, up from 63 deals in 2020.\n     *  Established a strategic partnership with Singapore's Home Team\nScience and Technology Agency (HTX), an arm of the Ministry of Home\nAffairs, to drive innovation and deliver industry leading digital\nintelligence capabilities.\n     *  Launched the latest version of Cellebrite Pathfinder, its flagship\ninvestigative analytics solution achieving significant milestones in data\nanalysis, enterprise readiness, scalability, and process performance.\n     *  Launched Premium Enterprise, boosting productivity and accelerating\ntime to evidence by decentralizing advanced collection capabilities.\n     *  Introduced a new SaaS solution: Guardian, a comprehensive\ninvestigative digital evidence management system (DEMS) designed to\ntransform evidence and workflow management throughout the entire\ninvestigative process.\n     *  Executing on its M&amp;A strategy, acquired the assets of open-source\nintelligence company Digital Clues, strengthening Cellebrite's\nmarket-leading DI platform and reinforcing its position as the premier\nend-to-end technology partner for law enforcement agencies.\n     *  Pioneered industry's first remote mobile device data collection\nsolution addressing private sector growing needs in corporate\ninvestigations, e-discovery, and incident response, and by that being the\nonly vendor offering a combined remote solution for both mobile devices and\ncomputers.\n     *  Established an Ethics &amp; Integrity Committee to advise the Board of\nDirectors on matters pertaining to evolving international law, ethical\nconsiderations related to responsible business practices, and requirements\nunder law and regulations applied to the sale and use of Cellebrite's\ntechnologies.\n\n     Supplemental financial information can be found on the Investor\nRelations section of our website at\n<a href=\"https://investors.cellebrite.com/financial-information/quarterly-results\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://investors.cellebrite.com/financial-information/quarterly-results</a>.\n\n     Financial Outlook\n\n     \"We are pleased that we exceeded revenue and profitability\nexpectations for the fourth quarter of 2021, and to introduce a robust\noutlook for 2022\" said Dana Gerner, Chief Financial Officer of Cellebrite.\n\n     *  Full year 2022 revenue is expected to be between $285 and $300\nmillion, representing 16-22% year on year growth.\n     *  December 2022 ARR is expected to be between $250 and $265 million,\nrepresenting 34-42% year on year growth.\n     *  Full year 2022 Adjusted EBITDA is expected to be between $39.0 and\n$44.0 million, representing a 13-15% margin.\n\n     \"We plan to continue and drive most of our growth from selling new\nsolutions and expanding our installed base within existing customers, and\nthus plan to continue to deliver strong ARR growth and best-in-class Net\nRetention Rate. Total subscription revenue is therefore expected to\ncontinue to grow as percentage of total revenue. Our strong business model\nand high profitability enable us to continue investing in innovation and\nour go-to-market activities,\" Gerner concluded.\n\n     Conference Call Information\n\n     Today, February 16, 2022, Cellebrite will host a conference call and\nwebcast to discuss the Company's financial results for the fourth quarter\nand full year 2021. The call details are below:\n\n//st\n\n                  Title:            Cellebrite Q4 21 Earnings\n\n                  Date:             February 16, 2022\n\n                  Time:             08:30 Eastern Time\n\n                  US (toll free):   +1 (800) 399-1934\n\n                  International:    +1 (210) 640-0859\n\n                  Conference ID:    1142505\n\n//et\n\n     Webcast:  <a href=\"https://edge.media-server.com/mmc/p/kpcespcn\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://edge.media-server.com/mmc/p/kpcespcn</a>\n\n     Participants dialing in are advised to join the call approximately 15\nminutes before the start time. The webcast will remain available and\naccessible after the call at:\n<a href=\"https://investors.cellebrite.com/events-presentations\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://investors.cellebrite.com/events-presentations</a>.\n\n     Investor Conferences Schedule:\n\n     Cellebrite management is scheduled to participate in the following\nevents:\n\n     *  William Blair Annual Tech Innovators Conference - March 15th, 2022\n     *  Raymond James &amp; Associates Annual Institutional Investors\nConference, Orlando - March 7-8, 2022\n\n     Public webcasts for some of these events will be accessible at:\n<a href=\"https://investors.cellebrite.com/events-presentations\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://investors.cellebrite.com/events-presentations</a>\n\n     Non-GAAP Financial Information and Key Performance Indicators\n\n     This press release includes non-GAAP financial measures. Cellebrite\nbelieves that the use of non-GAAP operating income and Adjusted EBITDA is\nhelpful to investors. These measures, which the Company refers to as our\nnon-GAAP financial measures, are not prepared in accordance with GAAP.\n\n     Non-GAAP operating income is calculated as operating income excluding\n(i) share-based compensation expense, (ii) acquisition-related costs, (iii)\namortization of intangible assets, (iv) a one-time compensation expense,\n(v) issuance expenses, (vi) dividend participation compensation, and (vii)\ncapital loss from FA disposal.\n\n     Adjusted EBITDA is calculated as net income excluding (i) financial\nincome, net, (ii) tax expense (iii) depreciation and amortization, (iv)\nshare-based compensation expense, (v) acquisition-related costs, (vi) a\none-time compensation expense, (vii) issuance expenses, (viii) dividend\nparticipation compensation, and (ix) capital loss from FA disposal.\n\n     The Company believes that the exclusion of these expenses provides a\nmore meaningful comparison of its operational performance from period to\nperiod and offers investors and management greater visibility to the\nunderlying performance of its business. Specifically:\n\n     *  Share-based compensation expenses utilize varying available\nvaluation methodologies, subjective assumptions and a variety of equity\ninstruments that can impact a company's non-cash expenses;\n     *  Acquired intangible assets are valued at the time of acquisition\nand are amortized over an estimated useful life after the acquisition, and\nacquisition-related expenses are unrelated to current operations and\nneither are comparable to the prior period nor predictive of future\nresults;\n     *  Tax expense, and depreciation and amortization expense vary for\nmany reasons that are often unrelated to our underlying performance and\nmake period-to-period comparisons more challenging; and\n     *  One-time or unusual expenses are often not representative of the\nunderlying performance of our business and make period-to-period\ncomparisons more challenging.\n\n     Each of our non-GAAP financial measures is an important tool for\nfinancial and operational decision making and for evaluating our own\noperating results over different periods of time. The non-GAAP financial\nmeasures do not represent our financial performance under U.S. GAAP and\nshould not be considered as alternatives to operating income or net income\nor any other performance measures derived in accordance with GAAP. Non-GAAP\nfinancial measures may not provide information that is directly comparable\nto that provided by other companies in our industry, as other companies in\nour industry may calculate non-GAAP financial results differently,\nparticularly related to non-recurring, unusual items. In addition, there\nare limitations in using non-GAAP financial measures because the non-GAAP\nfinancial measures are not prepared in accordance with GAAP, and exclude\nexpenses that may have a material impact on our reported financial results.\nFurther, share-based compensation expense has been, and will continue to be\nfor the foreseeable future, significant recurring expenses in our business\nand an important part of the compensation provided to our employees. In\naddition, the amortization of intangible assets is expected recurring\nexpense over the estimated useful life of the underlying intangible asset\nand acquisition-related expenses will be incurred to the extent\nacquisitions are made in the future. Furthermore, foreign exchange rates\nmay fluctuate from one period to another, and the Company does not estimate\nmovements in foreign currencies.\n\n     Annual recurring revenue (\"ARR\") is defined as the annualized value of\nactive term-based subscription license contracts and maintenance contracts\nrelated to perpetual licenses in effect at the end of that period.\nSubscription license contracts and maintenance contracts for perpetual\nlicenses are annualized by multiplying the revenue of the last month of the\nperiod by 12. The annualized value of contracts is a legal and contractual\ndetermination made by assessing the contractual terms with our customers.\nThe annualized value of maintenance contracts is not determined by\nreference to historical revenues, deferred revenues or any other GAAP\nfinancial measure over any period. ARR is not a forecast of future\nrevenues, which can be impacted by contract start and end dates and renewal\nrates.\n\n     Dollar-based net retention rate (\"NRR\") is calculated by dividing\ncustomer recurring revenue by base revenue. We define base revenue as\nrecurring revenue we recognized from all customers with a valid license at\nthe last quarter of the previous year period, during the four quarters\nended one year prior to the date of measurement. We define our customer\nrevenue as the recurring revenue we recognized during the four quarters\nended on the date of measurement from the same customer base included in\nour measure of base revenue, including recurring revenue resulting from\nadditional sales to those customers.\n\n     About Cellebrite\n\n     Cellebrite's (Nasdaq: CLBT) mission is to enable its customers to\nprotect and save lives, accelerate justice, and preserve privacy in\ncommunities around the world. We are a global leader in Digital\nIntelligence solutions for the public and private sectors, empowering\norganizations in mastering the complexities of legally sanctioned digital\ninvestigations by streamlining intelligence processes. Trusted by thousands\nof leading agencies and companies worldwide, Cellebrite's Digital\nIntelligence platform and solutions transform how customers collect,\nreview, analyze and manage data in legally sanctioned investigations.\nTo learn more visit us at www.cellebrite.com and\n<a href=\"https://investors.cellebrite.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://investors.cellebrite.com</a>.\n\n     Caution About Forward-Looking Statements\n\n     This document includes \"forward looking statements\" within the meaning\nof the \"safe harbor\" provisions of the United States Private Securities\nLitigation Reform Act of 1995. Forward-looking statements may be identified\nby the use of words such as \"forecast,\" \"intend,\" \"seek,\" \"target,\"\n\"anticipate,\" \"believe,\" \"could,\" \"continue,\" \"expect,\" \"estimate,\" \"may,\"\n\"plan,\" \"outlook,\" \"future\" and \"project\" and other similar expressions\nthat predict, project or indicate future events or trends or that are not\nstatements of historical matters. Such forward looking statements include\nestimated financial information. Such forward looking statements with\nrespect to revenues, earnings, performance, strategies, prospects and other\naspects of the business of Cellebrite are based on current expectations\nthat are subject to risks and uncertainties. A number of factors could\ncause actual results or outcomes to differ materially from those indicated\nby such forward looking statements. These factors include, but are not\nlimited to: if we do not continue to develop technologically advanced\nsolutions and successfully integrate with the software solutions used by\nour customers, our future revenue and operating results may be negatively\naffected; we are materially dependent on acceptance of our solutions by law\nenforcement markets and government agencies, both domestic and\ninternational. If law enforcement and other government agencies do not\ncontinue to purchase, accept and use our solutions, our revenue will be\nadversely affected; real or perceived errors, failures, defects or bugs in\nour DI solutions could adversely affect our results of operations, growth\nprospects and reputation; a failure to maintain sales and marketing\npersonnel productivity or hire, integrate and retain additional sales and\nmarketing personnel could adversely affect our results of operations and\ngrowth prospects; the global COVID-19 pandemic could negatively impact our\nbusiness, installations, trainings, and general operations; current and\nfuture competitors could have a significant impact on our ability to\ngenerate future revenue and profits; we face intense competition and could\nface pricing pressure from, and lose market share to, our competitors,\nwhich would adversely affect our business, financial condition, and results\nof operations; if our solutions are inadvertently or deliberately misused\nby customers, such customers may achieve sub-optimal results, which could\nlead to the perception that our solutions are low-quality; our reputation\nand brand are important to our success, and we may not be able to maintain\nand enhance our reputation and brand, which would adversely affect our\nbusiness, financial condition, and results of operations; the estimates of\nmarket opportunity and forecasts of market growth included in this\nprospectus may prove to be inaccurate, and even if the market in which we\ncompete achieves the forecasted growth, our business could fail to grow at\nsimilar rates, if at all; changes to our packaging and licensing models\ncould adversely affect our ability to attract or retain customers; if we\nfail to manage future growth effectively, our business could be harmed; our\nfuture growth depends in part on our ability to introduce new solutions and\nadd-ons and our failure to do so may harm business and operating results;\nissues in the use of artificial intelligence (\"AI\") (including machine\nlearning) in our platform may result in reputational harm or liability; we\nmay require additional capital to support the growth of our business, and\nthis capital might not be available on acceptable terms, if at all; higher\ncosts or unavailability of materials used to create hardware could\nadversely affect our financial results; fluctuations in foreign currency\nexchange rates could materially affect our financial results; the sales\ncycle for some of our solutions can be lengthy; if we are unable to retain\nqualified personnel and senior management and hire and retain additional\nqualified personnel, our business could suffer; the security of our\noperations and the integrity of our software solutions are critical to our\noperations and to maintaining the trust and confidence of our customers;\nour sales to government customers expose us to business volatility and\nrisks, including government budgeting cycles and appropriations, early\ntermination, audits, investigations, sanctions and penalties; evolving\ngovernment procurement policies and increased emphasis on cost over\nperformance could adversely affect our business; changes in civil\nforfeiture laws may affect our customers' ability to purchase our\nsolutions; failure to adequately obtain, maintain, protect and enforce our\nintellectual property and other proprietary rights could adversely affect\nour business; some of our software and systems contain open source\nsoftware, which may pose particular risks to our proprietary software and\ninformation technology systems; other companies may claim that we infringe\ntheir intellectual property, which could materially increase costs and\nmaterially harm our ability to generate future revenue and profits; certain\nof our solutions may be perceived as, or determined by the courts to be, a\nviolation of privacy rights and related laws. Any such perception or\ndetermination could adversely affect our revenue and results of operations;\nsome of our solutions may be used by customers in a way that is, or that is\nperceived to be, incompatible with human rights. Any such perception could\nadversely affect our reputation, revenue and results of operations; we\noccasionally have limited access to third party data, and if our security\nmeasures are breached and unauthorized access to this data is obtained, our\nsystems, data centers and our solutions may be perceived as not being\nsecure, customers may curtail or stop using our service and we may incur\nsignificant legal and financial exposure and liabilities; our business is\nsubject to complex and evolving U.S. and non-U.S. laws and regulations\nregarding privacy, data protection and security, technology protection, and\nother matters. Many of these laws and regulations are subject to change and\nuncertain interpretation, and could result in claims, changes to our\nbusiness practices, monetary penalties, increased cost of operations, or\notherwise harm our business; we may in the future become involved in legal,\nregulatory, or administrative inquiries and proceedings, and unfavorable\noutcomes in litigation or other of these matters could negatively impact\nour business, financial conditions, and results of operations; we are\nsubject to Israeli encryption laws and governmental trade controls,\nincluding export and regulations, and any non-compliance with these laws\ncould negatively impact our operating results; a variety of new and\nexisting laws and/or interpretations could materially and adversely affect\nour business; failure to comply with laws, regulations, or contractual\nprovisions applicable to our business could cause us to lose government\ncustomers or our ability to contract with the U.S. and other governments;\nConditions in Israel could materially and adversely affect our business; it\nmay be difficult to enforce a U.S. judgment against us, our officers and\ndirectors or the experts named in this prospectus in Israel or the United\nStates, or to assert U.S. securities laws claims in Israel or serve process\non our officers and directors or experts; we are subject to\nanti-corruption, anti-bribery, and similar laws, and non-compliance with\nsuch laws can subject us to criminal penalties or significant fines, harm\nand reputation, and adversely affect our business, financial condition,\nresults of operations, and growth prospects; and other factors, risks and\nuncertainties set forth in the sections titled \"Risk Factors\" and\n\"Cautionary Note Regarding Forward-Looking Statements\" in our prospectus\nthat was filed with the U.S. Securities and Exchange Commission (\"SEC\") on\nOctober 7, 2021 pursuant to Rule 424(b)(3) under the Securities Act of\n1933, as amended, which are available free of charge at www.sec.gov.\nFurther information on potential risks that could affect actual results\nwill be included in the subsequent filings that Cellebrite makes with the\nSEC from time to time. You are cautioned not to place undue reliance upon\nany forward-looking statements, which speak only as of the date made, in\nthis communication or elsewhere. Cellebrite undertakes no obligation to\nupdate its forward-looking statements, whether as a result of new\ninformation, future developments or otherwise, should circumstances change,\nexcept as otherwise required by securities and other applicable laws.\n\nContact:\n\n   Investors\nAnat Earon-Heilborn\nVP Investor Relations | Cellebrite DI Ltd.\n+972 73 394 8440\ninvestors@cellebrite.com\n\n   Media\nAdam Jaffe\nVP of Global Communications\n+1 973 206 7643\nadam.jaffe@cellebrite.com\n\n//st\n\nCellebrite DI Ltd.\n\nFourth Quarter 2021 Results Summary\n\n(U.S Dollars in thousands)\n\n                   For the three months ended   For the year ended\n\n                   December 31,                 December 31,\n\n                   2021            2020         2021           2020\n\nRevenue            67,908          57,168       246,246        194,913\n\nGross profit       55,572          46,648       203,689        157,034\n\nGross margin       81.8        %   81.6     %   82.7       %   80.6      %\n\nOperating income   4,306           5,068        13,822         9,218\n\nOperating margin   6.3         %   8.9      %   5.6        %   4.7       %\n\nCash flow from     29,792          32,114       36,052         66,510\noperations\n\nNon-GAAP\nFinancial Data:\n\nOperating income   7,751           9,543        42,869         26,528\n\nOperating margin   11.4        %   16.7     %   17.4       %   13.6      %\n\nAdjusted EBITDA    8,874           10,689       47,905         31,118\n\nAdjusted EBITDA    13.1        %   18.7     %   19.5       %   16.0      %\nmargin\n\n(1) For a reconciliation of operating income to non-GAAP operating income\nand net income to adjusted EBITDA, including for one-time issuance\nexpenses, see the table at the end of this press release titled\n\"Reconciliation of GAAP to Non-GAAP Financial Information.\"\n\n//et\n\n//st\n\nCellebrite DI Ltd.\n\nCondensed Consolidated Balance Sheets\n\n(U.S. Dollars in thousands)\n\n                    December 31,                 December 31,\n\n                                  2021                         2020\n\nAssets\n\nCurrent assets\n\nCash and cash       $             145,973        $             128,709\nequivalents\n\nRestricted cash                   -                            5,137\n\nShort-term                        35,592                       108,928\ndeposits\n\nTrade                             67,505                       66,324\nreceivables (net\nof allowance for\ndoubtful\naccounts of\n$1,040 and $616\nas of December\n31, 2021 and\n2020,\nrespectively)\n\nPrepaid expenses                  12,818                       7,439\nand other\ncurrent assets\n\nContract                          4,813                        2,979\nacquisition costs\n\nInventories                       6,511                        4,754\n\nTotal current                     273,212                      324,270\nassets\n\nNon-current\nassets\n\nOther                             1,958                        565\nnon-current\nassets\n\nDeferred tax                      9,800                        7,372\nassets, net\n\nProperty and                      16,756                       16,106\nequipment, net\n\nIntangible                        11,228                       6,611\nassets, net\n\nGoodwill                          26,829                       9,463\n\nTotal                             66,571                       40,117\nnon-current\nassets\n\nTotal assets        $             339,783        $             364,387\n\nLiabilities,\nredeemable\nconvertible\npreferred shares\nand\nshareholders'\nequity\n(deficiency)\n\nCurrent\nLiabilities\n\nTrade payables      $             9,546          $             4,727\n\nOther accounts                    54,044                       49,112\npayable and\naccrued expenses\n\nDeferred revenues                 122,983                      105,543\n\nTotal current                     186,573                      159,382\nliabilities\n\nLong-term\nliabilities\n\nLiability for                     375                          366\nemployees'\nseverance\nbenefits\n\nOther long term                   9,164                        6,191\nliabilities\n\nDeferred revenues                 36,426                       33,439\n\nRestricted                        44,712                       -\nSponsor Shares\nliability\n\nPrice Adjustment                  79,404                       -\nShares liability\n\nDerivative                        56,478                       -\nwarrant\nliabilities\n\nTotal long-term                   226,559                      39,996\nliabilities\n\nTotal liabilities   $             413,132        $             199,378\n\nRedeemable                        -                            101,205\nconvertible\npreferred shares\n\nShareholders'\nequity\n(deficiency)\n\nShare capital       * -                          * -\n\nAdditional                        (153,072   )                 34,226\npaid-in capital\n\nTreasury stock,                   (85        )                 (85       )\nNIS 0.00001 par\nvalue; 41,776\nordinary shares\n\nAccumulated                       1,372                        1,321\nother\ncomprehensive\nincome\n\nRetained earnings                 78,436                       28,342\n\nTotal                             (73,349    )                 63,804\nshareholders'\nequity\n(deficiency)\n\nTotal               $             339,783        $             364,387\nliabilities,\nredeemable\nconvertible\npreferred shares\nand\nshareholders'\nequity\n(deficiency)\n\n* Less than US$\n1.\n\n//et\n\n//st\n\nCellebrite DI Ltd.\n\nCondensed Consolidated Statements of Income\n\n(U.S Dollars in thousands, except share and per share data)\n\n      For the three months ended       For the year ended\n\n      December 31,             December 31,\n\n           2021      2020         2021      2020\n\nRevenue:\n\nSubscription  $    31,999    $ 27,771    $    120,889     $ 100,614\nservices\n\nTerm-license       18,088    10,279         62,428      29,131\n\nTotal        50,087    38,050         183,317     129,745\nsubscription\n\nPerpetual        9,387     11,832         34,169      42,136\nlicense and\nother\n\nProfessional       8,434     7,286        28,760      23,032\nservices\n\nTotal revenue      67,908    57,168         246,246     194,913\n\nCost of\nrevenue:\n\nSubscription       2,045     2,054        9,369       8,795\nservices\n\nTerm-license       753     773          2,299       1,709\n\nTotal        2,798     2,827        11,668      10,504\nsubscription\n\nPerpetual        4,659     2,900        9,817       9,370\nlicense and\nother\n\nProfessional       4,879     4,793        21,072      18,005\nservices\n\nTotal cost of      12,336    10,520         42,557      37,879\nrevenue\n\nGross profit       55,572    46,648         203,689     157,034\n\nOperating\nexpenses:\n\nResearch and       18,833    14,771         65,541      54,377\ndevelopment\n\nSales and        21,239    17,763         76,389      61,305\nmarketing\n\nGeneral and      11,194    9,046        47,937      32,134\nadministrative*\n\nTotal        51,266    41,580         189,867     147,816\noperating\nexpenses\n\nOperating        4,306     5,068        13,822      9,218\nincome\n\nFinancial        49,809    605          68,483      2,179\nincome, net\n\nIncome before      54,115    5,673        82,305      11,397\nincome tax\nexpense\n\nIncome tax       2,244     2,719        10,909      5,616\nexpense\n\nNet income    $    51,871    $ 2,954     $    71,396    $ 5,781\n\nEarnings per\nshare:\n\nBasic     $    0.28    $ (0.01   ) $    0.49      $ (0.08   )\n\nDiluted     $    0.25    $ (0.01   ) $    0.44      $ (0.08   )\n\nWeighted\naverage shares\noutstanding:\n\nBasic        180,170,342   123,773,763      144,002,394     123,696,624\n\nDiluted        199,082,479   123,773,763      161,538,579     123,696,624\n\nOther\ncomprehensive\nincome:\n\nUnrealized       495     797          (944    )   1,212\ngain (loss) on\nhedging\ntransactions\n\nCurrency       955     (749    )      995       (695    )\ntranslation\nadjustments\n\nTotal other      1,450     48         51        517\ncomprehensive\nincome , net\nof tax\n\nTotal other   $    53,321    $ 3,002     $    71,447    $ 6,298\ncomprehensive\nincome\n\n*Including\none-time\nissuance costs\n\n//et\n\n//st\n\nCellebrite DI Ltd.\n\nCondensed Consolidated Statements of Cash Flow\n\n(U.S. Dollars in thousands)\n\n       For the three months ended       For the year ended\n\n       December 31,           December 31,\n\n          2021      2020       2021     2020\n\nCash flow from\noperating\nactivities:\n\nNet income   $    51,871    $ 2,954   $    71,396   $ 5,781\n\nAdjustments to\nreconcile net\nincome to net\ncash provided\nby operating\nactivities:\n\nEmployees'        1,661     1,540        6,480      7,271\nstock option\ncompensation\nand RSU's\n\nDepreciation      1,814     1,533        7,091      5,879\nand amortization\n\nDeferred income     269     (4,119  )      (1,638   )   (2,818  )\ntaxes\n\nRevaluation of      (15,506 )   -        (11,967  )   -\nderivative\nwarrants\n\nRevaluation of      (35,115 )   -        (55,906  )   -\nRestricted\nSponsor Shares\nand Price\nAdjustment\nShares\nliabilities\n\nOther         -       689        -      689\n\nIncrease        11      (64   )      10       (63   )\n(decrease) in\nliability for\nseverance\nbenefits, net\n\nIncrease        8,690     (5,597  )      (1,958   )   (19,731 )\n(decrease) in\ntrade\nreceivables\n\nIncrease in       9,152     20,136       21,804     47,738\ndeferred revenue\n\nDecrease        (1,779  )   314        (1,394   )   335\n(Increase) in\nother\nnon-current\nassets\n\nDecrease        2,541     (193  )      (8,304   )   (339  )\n(Increase) in\nprepaid\nexpenses and\nother current\nassets\n\nIncrease in       (1,711  )   (100  )      (1,798   )   (693  )\ninventories\n\nIncrease        2,955     1,667        4,155      (1,433  )\n(decrease) in\ntrade payables\n\nIncrease in       2,428     12,656       5,107      22,449\nother accounts\npayable and\naccrued expenses\n\nIncrease in       2,511     698        2,974      1,445\nother long-term\nliabilities\n\nNet cash        29,792    32,114       36,052     66,510\nprovided by\noperating\nactivities\n\nCash flows from\ninvesting\nactivities:\n\nPurchases of      (778  )   (1,392  )      (5,111   )   (6,181  )\nproperty and\nequipment\n\nPayment related     (20,000 )   -        (20,000  )   (15,046 )\nto business\ncombination,\nnet of cash\nacquired\n\nPurchase of       -       -        (3,000   )   -\nintangible asset\n\nShort term        26,210    (17,052 )      73,337     14,778\ndeposits, net\n\nNet cash        5,432     (18,444 )      45,226     (6,449  )\nprovided by\n(used in)\ninvesting\nactivities\n\nCash flows from\nfinancing\nactivities:\n\nRepurchase of       -       -        -      (85   )\ncommon stock\n\nPayment of        -       -        (100,000 )   (10,000 )\ndividend\n\nExercise of       944     1,492        2,305      1,492\noptions to\nshares\n\nProceeds from       -       -        29,298     -\nRecapitalization\ntransaction, net\n\nNet cash        944     1,492        (68,397  )   (8,593  )\nprovided by\n(used in)\nfinancing\nactivities\n\nNet increase in     36,168    15,162       12,881     51,468\ncash and cash\nequivalents and\nrestricted cash\n\nNet effect of       (81   )   526        (754   )   695\nCurrency\nTranslation on\ncash and cash\nequivalents\n\nCash and cash       109,886     118,158      133,846    81,683\nequivalents and\nrestricted cash\nat beginning of\nperiod\n\nCash and cash  $    145,973   $ 133,846   $    145,973    $ 133,846\nequivalents and\nrestricted cash\nat end of period\n\nSupplemental\ncash flow\ninformation:\n\nIncome taxes      1,758     1,579        8,157      2,911\npaid\n\nNon-cash\nactivities\n\nPurchase of       749     (81   )      814      172\nproperty and\nequipment\n\n//et\n\n//st\n\nCellebrite DI Ltd.\n\nReconciliation of GAAP to Non-GAAP Financial Information\n\n(U.S Dollars in thousands, except share and per share data)\n\n       For the three months ended         Year ended\n\n       December 31,             December 31,\n\n          2021      2020         2021      2020\n\nOperating    $    4,306     $ 5,068     $    13,822    $ 9,218\nincome\n\nOne-time        -       -          -       1,519\nexpense\n\nIssuance        -       -          11,835      -\nexpenses\n\nDividend        -       -          966       -\nparticipation\ncompensation\n\nShare based       1,661       1,540        6,480       7,271\ncompensation\n\nAmortization      607       387          1,971       1,289\nof intangible\nassets\n\nAcquisition       1,177       1,859        7,795       6,542\nrelated costs\n\nCapital loss      -       689          -       689\nfrom FA\ndisposal\n\nNon-GAAP   $    7,751     $ 9,543     $    42,869    $ 26,528\noperating\nincome\n\n       For the three months ended         Year ended\n\n       December 31,             December 31,\n\n          2021      2020         2021      2020\n\nNet income   $    51,871    $ 2,954     $    71,396    $ 5,781\n\nOne-time        -       -          -       1,519\nexpense\n\nOne-time tax      -       -          7,067       -\nexpense\n\nIssuance        -       -          11,835      -\nexpenses\n\nDividend        -       -          966       -\nparticipation\ncompensation\n\nShare based       1,661       1,540        6,480       7,271\ncompensation\n\nCapital loss      -       689          -       689\nfrom FA\ndisposal\n\nAmortization      607       387          1,971       1,289\nof intangible\nassets\n\nAcquisition       1,177       1,859        7,795       6,542\nrelated costs\n\nIncome tax      498       (441    )      (1,670    )   (1,142    )\nexpense\n\nFinance       (50,621   )   -          (67,873   )   -\nexpenses\n\nNon-GAAP net   $    5,193     $ 6,988     $    37,967    $ 21,949\nincome\n\nNon-GAAP\nEarnings per\nshare:\n\nBasic    $    0.03      $ 0.06      $    0.26      $ 0.18\n\nDiluted    $    0.03      $ 0.06      $    0.24      $ 0.18\n\nWeighted\naverage\nshares\noutstanding:\n\nBasic         180,170,342     123,773,763      144,002,394     123,696,624\n\nDiluted       199,082,479     123,773,763      161,538,579     123,696,624\n\n       For the three months ended         Year ended\n\n       December 31,             December 31,\n\n          2021      2020         2021      2020\n\nNet income   $    51,871    $ 2,954     $    71,396    $ 5,781\n\nFinancial       (49,809   )   (605    )      (68,483   )   (2,179    )\nincome, net\n\nTax expenses      2,244       2,719        10,909      5,616\n\nOne time        -       -          -       1,519\nexpense\n\nIssuance        -       -          11,835      -\nexpenses\n\nDividend        -       -          966       -\nparticipation\ncompensation\n\nShare based       1,661       1,540        6,480       7,271\ncompensation\n\nAmortization      607       387          1,971       1,289\nof intangible\nassets\n\nAcquisition       1,177       1,859        7,795       6,542\nrelated costs\n\nDepreciation      1,123       1,146        5,036       4,590\nexpenses\n\nCapital loss      -       689          -       689\nfrom FA\ndisposal\n\nAdjusted   $    8,874     $ 10,689    $    47,905    $ 31,118\nEBITDA\n\n//et\n\n                     ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204600455.MNPRE2204602247-09261320220216</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}