{"date": "2021-12-30 18:52:35.003000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3384.02, "close": 3334.34}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Every day, we scour Amazon to find the best deals available. Whether it's something for your kitchen or top-rated tech to give your smart home an upgrade, the online shopping giant offers some of the best prices on a  <span>very</span> wide range of items. Whatever you need, Amazon has you covered.</p></div><div class=\"tr-npp-body\"><p><span><span>Make 2022 the year of good decisions.</span> Start by signing up for our newsletter for twice-weekly tips, reviews and more from our experts.</span> </p><p>Below, you'll find our top 10 Amazon deals right now, including noise-canceling earbuds, streaming services and our favorite tablet, all of which have been vetted by our team of deals experts to make sure they're \"best of web\" prices. </p><p>► <span>Are stores closed New Year's Eve?:</span> No, but the hours are limited</p><p>► <span>Year-end deals:</span> The 70 best end-of-year sales available right now—shop Amazon, Walmart, Best Buy and more</p><p>If you're not already an Amazon Prime subscriber, you can sign up for a 30-day membership for free. An Amazon Prime subscription gets you free two-day shipping and tons of other benefits for $12.99 a month ($6.49 for students and $5.99 for those receiving qualifying government assistance).</p><p class=\"tr-npp-section-title\">The 10 best Amazon deals you can get today</p><p><big>1. Less than $300: Our favorite tablet</big> </p><p>Apple makes some of the most acclaimed tech available and one market they've mastered (in our opinion) is tablets. The brand's current-generation iPad is now on sale for as low as $299 down from $329 in its 64-gigabyte capacity. The 10.9-inch device is the best tablet we've ever tried for its compact design, without sacrificing its generous screen size which is great for browsing the web or streaming content. Its battery offers up to 10 hours of video playback and supports the Apple Pencil ($89) so you can jot down notes throughout the day. </p><p><span>Get the Apple 10.9-Inch iPad (9th Generation) from $299 (Save $30)</span> </p><p><big>2. Save up to $302: This stylish TV</big> </p><p>Upgrade your TV while adding some style to your living room with Samsung's The Frame TV, on sale today. Typically listed from $599.99, you can get this smart screen for as low as $457.99 in its 32-inch size. Not only does it offer QLED HDR visuals, but Samsung says The Frame's Art Mode also lets you display purchasable pieces of art when you're not watching any shows or movies. It's both a house entertainment hub and the perfect piece of home décor, plus with Alexa built-in, you'll be able to access it hands-free.</p><p><span>Get the Samsung The Frame QLED LS03 Series HDR Smart TV from $457.99 (Save $142 to $302)</span> </p><p><big>3. 48% off: This portable cast-iron pan </big> </p><p>Get ready for next year's camping season by picking up this Lodge cast-iron pan for on-the-go cooking. Typically listed for $25, this 8-inch pan is currently listed for $12.90 thanks to a 48% discount. Lodge says its pan is seasoned with oil for a non-stick finish perfect for searing, simmering, frying and more. You can pop this pan in your oven or on your stove, or bring it with you on your next camping adventure. Not to mention, it's extremely easy to clean.</p><p><span>Get the Lodge 8-Inch Cast-Iron Round Pan for $12.90 (Save $12.10)</span> </p><p><big>4. Save $80: These powerful noise-canceling earbuds</big> </p><p>Bose is one of the biggest names in the world of headphones and it's packed some of the best noise-canceling technology in a package that can fit in the palm of your hand with these earbuds. The brand's QuietComfort earbuds are now on sale for $199—an $80 price cut from its regular listing of $279. In our testing, we adored the best-in-class noise-canceling technology built into the buds, which we found blocked out bustling traffic and strong winds. That tech is the cherry on top of the buds' well-balanced fit and highly-detailed sound output. </p><p><span>Get the Bose QuietComfort Noise-Canceling Earbuds for $199 (Save $80)</span> </p><p><big>5. 50% off: This easy-to-use indoor garden</big> </p><p>Though we're still in the bitter cold of winter, the gardeners can still keep plant life alive with the AeroGarden Harvest Elite 360. You can get this indoor garden for as low as $89.99—that's 50% off its list price of $179.95. The 360 is a more compact version of the standard Harvest Elite (from $112.78), one of our favorite hydrophobic garden systems, which we found to be both easy to use and clean. You can grow up to six herbs or veggies at a time under the garden's 20-watt LED lights and even keep the growing process going while you're away with the system's Vacation mode.</p><p><span>Get the AeroGarden Harvest Elite 360 from $89.99 (Save $46.06 to $89.96)</span> </p><p><big>6. Up to 43% off: These indoor electric fireplaces</big> </p><p>Keep your home warm this winter by shopping for Turbro electric fireplaces on sale at Amazon today. One price cut you'll find is on the Suburbs TS17 model, typically listed for $109.99 but now available for 14% off at $94.99. Turbro says the 18-inch fireplace stove can offer a heat output of 4,777 BTU with built-in overheating protection and easy temperature control. If you want the look of a fireplace without all the pesky smoke and soot, there's the Turbro Eternal Flame EF23-PB model on sale for $95.99—36% off its list price of $149.99. Not only does the 23-inch device mimic a fireplace (great if you're in the city and don't have one), but the brand also says it has three adjustable brightness levels for the flames to set the right mood as well as temperature.</p><p><span>Save up to 43% on Turbro Electric Fireplaces</span> </p><p><big>7. Save $20: This stylish digital picture frame</big> </p><p>If you've got a dozen photos from your recent holiday get-together and can't decide which one is the best to display, show them all with the Aura Mason digital picture frame. Normally priced at $199, this 9-inch smart frame can be yours in three different colors and dimensions for $179 thanks to a $20 price cut. Aura said the frame offers HD resolution for the images it displays and can hold over 10,000 photos sent from your smartphone. It also auto-adjusts to the brightness in any given room and will go dark when you turn off the lights.</p><p><span>Get the Aura Mason Smart Digital Picture Frame from $179 (Save $20)</span> </p><p><big>8. 27% off: These leakproof storage containers</big> </p><p>Keep your favorite snacks and side dishes fresh with the Lock &amp; Lock food storage containers. Typically listed for $14.99, you can get a 10-piece set of the containers with lids at a 27% discount for just $10.99. The developer says the set features 37-ounce, 29-ounce, 19-ounce, 16-ounce, and 12-ounce containers that are safe for both microwaves and dishwashers. The containers all come with lids that feature an enhanced silicone seal for airtight preservation, which means your foods should stay crispy and fresh longer.</p><p><span>Get the Lock &amp; Lock 10-Piece Easy Essentials Food Storage Container Set for $10.99 (Save $4)</span> </p><p><big>9. Up to 85% off: These popular eBooks</big> </p><p>Enter the new year with a good read thanks to these best-selling Kindle eBooks on sale through today. Amazon's digital reading outlet has a variety of highly-rated titles on sale for less than $5. If you've got an e-reader, you only need $4.99 to access <span>Taste: My Life Through Food</span> where Academy Award-nominee Stanley Tucci talks about his upbringing and how certain cuisines impacted his life. Political junkies can get an inside look at the 2020 presidential transition from Donald Trump to Joe Biden with Bob Woodward and Robert Costa's <span>Peril</span> also available for just $4.99. These are major price cuts, where Taste: My Life Through Food is typically listed for $28 while Peril is usually $30.</p><p><span>Save up to 85% on Best-Selling Kindle eBooks</span> </p><p><big>10. Up to $49 off: This popular streaming service</big> </p><p>If you love streaming, this is the deal for you! Right now, Amazon is offering up to six months of free access to Disney+ through its Amazon Music Unlimited service. New subscribers to AMU get six months of the House of Mouse's media library, while current subscribers get three months free. That means you can access Amazon Music Unlimited's library of 75 million songs ad-free one minute and watch the newly-released space adventure <span>Star Wars: The Book of Boba Fett</span> the next. The six-month bundle of Amazon and Disney's streaming apps together would normally run shoppers $107.88 (or $95.88 for Amazon Prime members), but this offer lets new subscribers cut that price down to $59.94 (or $47.94 for Prime members).</p><p><span>Get 6 Months of Amazon Music Unlimited and Disney+ for $59.94 (Save $47.94)</span> </p><p class=\"tr-npp-section-title\">Amazon deals you may have missed</p><p><big>1. TurboTax 2021 Deluxe Download Card with Amazon Gift Card</big> </p><p>Get a head start on tax season by grabbing a TurboTax Deluxe download card for PC. Not only is the card marked down to $49.99, 28% off its list price of $69.99, but it comes with a $10 Amazon gift card for free. TurboTax says the card lets you make five electronic filings of federal tax returns and one filing for state tax returns, and suggests that this specified package is best for homeowners who have made charitable donations and have high medical expenses.</p><p><span>Get the TurboTax Deluxe 2021 Download Card with Amazon Gift Card for $49.99 (Save $20)</span> </p><p><big>2. Melissa &amp; Doug Toys</big> </p><p>If you're still looking for gifts to give to the youngest ones in your family, Amazon has a handful of Melissa &amp; Doug toys on sale today. The little mechanics in your life can enjoy the brand's 48-piece wooden construction set, on sale for $14.99, or 30% off. Kids ages four and up can use the included nuts, bolts, drilled bars and screwdriver to start their own passion for engineering. There's also the Melissa &amp; Doug Mine to Love Mariana baby doll marked down to $18.49 from $26.99. The 18-inch poseable doll is a size fit for kids ages 18 months and up to hug, cuddle and care for.</p><p><span>Save up to 37% on Melissa &amp; Doug Toys</span> </p><p><big>3. Amazon Music Unlimited with Echo Dot (3rd Generation)</big> </p><p>For the rest of the month, Amazon is offering its most compact smart speaker for a massive discount when users try out its premiere streaming service. Through <span>Friday, December 31</span> , new subscribers to Amazon Music Unlimited will get the third-generation Echo Dot speaker for just $0.99—a whopping $39 discount from the speaker's usual price of $39.99, and $19 down from its current price. That means you pay $9.99 ($7.99 for Prime members, $0.99 for students) to stream and even download as many as 70 million songs on your mobile device, then less than a dollar for the device to play your favorite tunes via Bluetooth connection over the Echo Dot, for a total cost of $10.98. Though smaller than its newer brethren (now at $29.99), the third-generation Dot is still one of the best Echo speakers for giving you access to all standard Alexa features at a fraction of the cost of the rest of the Echo series.</p><p><span>Get 1 Month of Amazon Music Unlimited and the Amazon Echo Dot (3rd Generation) for $10.98 (Save $39)</span> </p><p><big>4. Colgate Products</big> </p><p>Keep your teeth pearly white with these sets of Colgate dental products on sale for major price cuts at Amazon today. There's the hum electric toothbrush kit, available for as low as $37.49 in blue thanks to an already active 33% discount and an additional 25% coupon on the product page. Colgate says the hum brush uses Bluetooth technology connected to your smartphone to guide you to the spots of your teeth that need the most thorough cleaning. Along with the brush itself, the kit comes with a charger, carrying case and a refill brush you can swap after six months. All you need to make your teeth cleaning complete is a two-pack of Colgate Optic Renewal teeth whitening toothpaste, which Amazon is selling for just $6.10 (provided you use the on-page coupon). </p><p><span>Save up to 49% on Colgate Dental Products</span> </p><p><big>5. All-Clad 12-Inch D3 Stainless Steel Frying Pan</big> </p><p>Upgrade your kitchen tools with this All-Clad 12-inch frying pan, on sale for just $99.99. Typically listed for $220, this stainless-steel pan is now available at a 55% discount. All-Clad says the pan is made with a responsive aluminum core bonded together with two layers of tough stainless steel for durability and more even heat distribution. The pan also promises easy handling with its riveted handle and a polished cooking surface that's stick-resistant.</p><p><span>Get the All-Clad 12-Inch D3 Stainless Steel Frying Pan for $99.99 (Save $120.01)</span> </p><p class=\"tr-npp-section-title\">Other noteworthy Amazon deals we found </p><ul class=\"bulleted-list arrowlist\"><li>Save up to 45% on DeWalt 20-Volt Tools</li><li>Save up to 50% on Razer gaming accessories</li><li>Save up to 63% on GE kitchen appliances</li><li>Zataye LED 100-Foot Strip Lights for $24.63 (Save $4.35)</li><li>Amazon Echo Dot (4th Generation) with Clock for $34.99 (Save $25)</li><li>YnM Weighted Blanket from $41.56 (Save $7.34 to $20.78)</li><li>Cuisinart ICE-21 Ice Cream Maker from $59 (Save $51)</li><li>Polaroid Hi-Print Portable Printer for $87.72 (Save $12.27)</li><li>Amazon Echo Show 8 (2nd Generation) for $94.99 (Save $35)</li><li>Sony WH-CH710N Wireless Headphones for $98 (Save $81.99)</li><li>Instant Pot 6-Quart Duo Crisp Electric Pressure Cooker with Air Fryer Lid for $99.95 (Save $50.04)</li><li>Eufy Security Wi-Fi Video Doorbell for $109.99 with coupon (Save $50)</li><li>Eufy BoostIQ RoboVac 11S Max for $159.99 (Save $90)</li><li>Winix 5500-2 Air Purifier for $159.99 (Save $90)</li><li>Le Creuset 3.5-Quart Enameled Cast Iron Signature Sauteuse Oven from $179.95 (Save $120.05)</li><li>Sandisk 1-Terabyte Extreme Pro Portable SSD for $184.99 (Save $125)</li><li>Apple AirPods Pro for $197 (Save $52)</li><li>Cricut Maker for $229 (Save $140)</li><li>Sony WF-1000XM4 Noise-Canceling Wireless Earbuds for $248 (Save $31.99)</li><li>iRobot Roomba j7+ Self-Emptying Robot Vacuum for $649 (Save $200.99)</li> </ul><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Updated daily: Here are the 10 best Amazon deals today in December 2021</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}