{"date": "2022-02-08 17:00:01+00:00", "ticker": "AAF", "mrkt_info": {"open": 155.0, "close": 139.1}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><span>\n              <p>LONDON, Feb 8 (IFR) - Warburg Pincus and Morningstar Investment cut their stakes in London-listed mobile telecoms business <b>Airtel Africa</b> on Monday night for an aggregate £81.2m.</p>\n              <p>The trade is the first accelerated sale in Europe since January 27 when Goldman Sachs led a sale of Phoenix Group shares.</p>\n              <p>The Airtel ABB led by sole bookrunner <span>Citigroup </span>followed a short wall-crossing to fewer than 10 accounts on Monday afternoon that completed with oversubscription on indications.</p>\n              <p>The trade followed strong results for the nine months to December 31 at the end of last week that showed revenues grew by 21.7% and the leverage ratio improved to 1.4 times from 2.1 previously.</p>\n              <p>Airtel Africa shares joined the FTSE 100 index on January 27.</p>\n              <p>As a broker to Airtel Africa, Citi had garnered indicative interest during non-deal roadshows and had significant reverse enquiry ahead of launch.</p>\n              <p>The deal launched with 53m shares on offer, representing 1.4% of Airtel Africa, and was covered in around 15 minutes. The upsize to 58m shares, representing 1.5% of outstanding and around 15 days' trading, was communicated shortly before books closed.</p>\n              <p>Pricing of 140p was a 9.7% discount to Monday’s close of 155p.</p>\n              <p>Airtel Africa shares have risen nearly 10% since the start of the year and more than doubled since the beginning of 2021. The 160p close on February 2 is the highest since listing.</p>\n              <p>The company’s market cap is now £5.82bn compared with £3.1bn at IPO in June 2019.</p>\n              <p>The stock opened on Tuesday just below pricing at 139p and had pushed above after 9am in London. The shares hung around strike for much of the day before closing at 141.7p.</p>\n              <p>The top 10 orders took around 75% of the trade, with highly concentrated allocations and multiple anchor investors in for more than 10% each.</p>\n              <p>The sellers are subject to a 90-day lock-up on their remaining shares.</p>\n              <p>(Reporting by Robert Venes; editing by Ian Edmondson)</p>\n              <p>((robert.venes@refinitiv.com; +44 (0) 20 75428326))</p>\n            </span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © Refinitiv 2022. Click For Restrictions - https://www.refinitiv.com/en/policies/copyright-notice</p></div>"}