{"date": "2021-10-25 06:45:41+00:00", "ticker": "AVV", "mrkt_info": {"open": 3643.0, "close": 3534.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\">\n<li><span>Will make it easy for customers to access and share PI System Data through AVEVA Connect Cloud Portal</span></li>\n</ul>\n<p> Dubai, UAE – AVEVA, a global leader in industrial software, driving digital transformation and sustainability, today announced its first SaaS offering that integrates key features of the market-leading PI System™ operations data management platform with the AVEVA industrial software portfolio.</p>\n<p>AVEVA Data Hub, a secure, cloud-native hub for aggregating, managing and securely sharing operations data to gain new insights and improve operating performance, will deliver the proven operations data-sharing capabilities of OSIsoft Cloud Services (OCS) through the convenient AVEVA Connect industrial cloud platform.</p>\n<p>AVEVA Connect subscribers will enjoy the flexibility to access AVEVA Data Hub services alongside any mix of other AVEVA cloud, hybrid and on-premises solutions as their business needs change, using the AVEVA Flex subscription program.</p>\n<p>“Customers are telling us that it’s not a question of whether they will adopt the cloud to view, enrich and share real-time and historical operations data, but how and when,” said Rónán de Hooge, AVEVA’s Executive Vice President of Information. “AVEVA Data Hub provides this answer, making it easy to aggregate and contextualize on-premises and remote data sources and securely share insights with a colleague across town, a business partner on the other side of the world, or even a data science application in the cloud for predictive modelling.”</p>\n<p>Customer applications for the technology have ranged from ensuring safe drinking water with predictive notifications to preparing data for advanced analysis to monitoring critical, remote equipment.</p>\n<p>The benefits of AVEVA Data Hub include:</p>\n<ul class=\"bulleted-list arrowlist\">\n<li>Native integration with PI System products such as PI Server and Edge Data Store, enabling easy, secure access to a single source of truth for operating data, from multi-plant facilities to the most remote and rugged environments.</li>\n<li>Nothing to install, maintain or program: authorized users have self-service data access through a simple browser interface, with all software updates and infrastructure managed by AVEVA.</li>\n<li>Purpose-built to handle the unique needs of operations data, even if receipt is delayed or out of order.</li>\n</ul>\n<p>AVEVA Data Hub was unveiled at this week’s AVEVA PI World Digital conference, which continues through October 21. It will become generally available for customer deployment in early 2022. Its predecessor product, OCS, is still available. Existing OCS customers will continue to be supported and have a path forward that preserves their information investments. <span> </span></p>\n<p>-Ends-</p>\n<p><strong>About AVEVA</strong></p>\n<p><span>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence.  AVEVA’s comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries.</span></p>\n<p><span>Learn more at <a href=\"http://www.aveva.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.aveva.com</a> </span></p>\n<p><span>Copyright © 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</span><strong> </strong></p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}