{"date": "2022-01-05 12:52:05+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>FLOW BEVERAGE CORP (\"FLOW-T;FLWBF-0\")\n- To Present at the 2022 ICR Conference\n\n    Flow Beverage Corp. (\"Flow\" or the \"Company\"), is pleased to announce\nthat it will be participating virtually in the upcoming 2022 ICR Conference\non January 10 - 12, 2022. Flow will be represented at the conference by\nNicholas Reichenbach, Founder and Executive Chairman and Maurizio\nPatarnello, Chief Executive Officer.\n\n    The Company will be hosting a presentation on Tuesday, January 11, 2022\nat 9:00AM ET. The webcast can be accessed live here, and will be available\nfor 90 days on the Company's Investor Relations Website at\n<a href=\"https://investors.flowhydration.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://investors.flowhydration.com</a>/.\n\n    Institutional investors interested in scheduling a virtual 1x1 meeting\nwith management should visit <a href=\"https://icrconference.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://icrconference.com</a> or contact their ICR\nrepresentative.\n\n    About Flow\n\n    Flow is a premium alkaline spring water company with a diversified line\nof health and wellness-oriented beverage products sold online and at\nretailers throughout North America. Flow's premium alkaline spring water is\noffered in original unflavored and a range of award-winning organic\nflavors, in sizes ranging from 330-ml to 1-liter.\n\n    Due to its unique artesian spring sources, Flow products contain\nnaturally occurring electrolytes and essential minerals, and its original\nand flavored water products have an alkaline pH. As part of its ongoing\ninnovation into functional \"better-for-you\" beverages, Flow recently\nintroduced a new line of collagen-infused waters with natural flavors.\n\n    Founded in 2014 by serial, mission-driven entrepreneur Nicholas\nReichenbach, Flow is highly dedicated to sustainability and is a B-Corp\nCertified company with a purpose to \"bring wellness to the world through\nthe positive power of water.\" Flow set out to be a sustainable brand,\npackaging its products in up to 75% renewable-resource-based Tetra Pak(TM)\ncartons utilizing sustainable operations.\n\n    Flow beverage products are available online at flowhydration.com, and\nare sold at over 20,000 stores across the United States and Canada,\nincluding Target, Walmart, Costco, Whole Foods Market, Loblaws, Sobeys,\nMetro, Shoppers Drug Mart, CVS Pharmacy, Farm Boy, Sprouts Farmers Market,\nSafeway, Wegmans, Harris Teeter, Sam's Club, Giant Eagle, Bristol Farms,\nRaley's, Vitamin Shoppe, and Duane Reade, among others.\n\n    Follow Flow on social media: Instagram\n(https://www.instagram.com/flow/); Twitter\n(https://twitter.com/FlowHydration ); and Facebook\n(https://facebook.com/FlowHydration).\n\n    For more information on Flow, please visit Flow's investor relations\nsite at: investors.flowhydration.com.\n\n    Cautionary Statement\n\n    This press release may contain \"forward-looking statements\" within the\nmeaning of applicable Canadian securities legislation. Such forward-looking\nstatements include, but are not limited to, information with respect to our\nobjectives and the strategies for achieving those objectives, as well as\ninformation with respect to our beliefs, plans, expectations,\nanticipations, estimates and intentions. Forward-looking statements are\ntypically identified by the use of words such as \"may\", \"would\", \"should\",\n\"could\", \"expect\", \"intend\", \"estimate\", \"anticipate\", \"plan\", \"foresee\",\n\"believe\", or \"continue\", although not all forward-looking statements\ncontain these words. Forward-looking statements are provided for the\npurposes of assisting the reader in understanding Flow and its business,\noperations, prospects, and risks at a point in time in the context of\nhistorical and possible future developments, and the reader is therefore\ncautioned that such information may not be appropriate for other purposes.\nForward-looking statements are based on assumptions and are subject to a\nnumber of risks and uncertainties, many of which are beyond our control,\nwhich could cause actual results to differ materially from those that are\ndisclosed in or implied by such forward-looking statements. Those risks and\nuncertainties include the following: impact and spread of COVID-19; ability\nto achieve and manage growth; failure to expand sales capabilities; changes\nin consumer preferences; criticism of packaged water; maintain brand image\nand product quality; constrained or unavailable spring water sources;\ninability to package products; increased competition; accurately estimating\ndemand; maintaining relationships with distributors and vendors; changing\nretail landscape; incorrect product design or development; product\ninformation misrepresentation; revenues derived entirely from packaged\nbeverages; increases in costs or shortages of materials; fluctuation of\nquarterly operating results; no assurance of profitability; fluctuations in\nforeign currency; changes in government regulation; contamination or\nrecalls of ingredients or end products; loss of intellectual property\nrights; litigation; future tax rates; catastrophic events; climate change;\nseasonal business; dependence on key information systems and third-party\nservice providers; ability to securely maintain confidential information;\nmaintaining and upgrading information technology systems; conflict of\ninterest; dual class share structure; potential volatility of share price;\nno assurance of active market for shares; lack of dividends; global\nfinancial condition; publication of inaccurate or unfavourable research and\nreports; operating history; and management and conflict of interests.\nConsequently, all of the forward-looking statements contained herein are\nqualified by the foregoing cautionary statements, and there can be no\nguarantee that the results or developments that we anticipate will be\nrealized or, even if substantially realized, that they will have the\nexpected consequences or effects on our business, financial condition or\nresults of operation. Unless otherwise noted or the context otherwise\nindicates, the forward-looking statements contained herein are provided as\nof the date hereof, and we do not undertake to update or amend such\nforward-looking statements whether as a result of new information, future\nevents or otherwise, except as may be required by applicable law.\n\n Contact Information:\n\nDevan Pennell, Chief Financial Officer\n1-844-356-9426\ninvestors@flowhydration.com\nUS Investors:\nAshley DeSimone\nAshley.DeSimone@icrinc.com\nCanadian Investors:\nMarc Charbin\ninvestors@flowhydration.com\nMedia:\nNatasha Koifman\nnk@nkpr.net\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200400024.MNPRE2200400475-04502520220105</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}