{"date": "2021-12-14 04:22:38+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds Biden approving aid for Tennessee, Illinois in paragraph 23</p><p class=\"tr-by\">By Gabriella Borter</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">MAYFIELD, Ky., Dec 13 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>The barrage of tornadoes that tore through six states killed at least 74 people in Kentucky, officials said on Monday, as those fortunate enough to survive unscathed opened their doors to victims whose homes were destroyed, and hundreds of the suddenly homeless took refuge in shelters.</p><p>The death toll was likely to rise as 109 people remained missing, Kentucky Governor Andy Beshear said.</p><p>But no more dead were expected to come from a destroyed candle factory as a company spokesperson said later that a final accounting showed only eight dead. At one time, dozens were feared buried there beneath the rubble.</p><p>Some 28,000 Kentucky homes and businesses still lacked power, and 1,000 homes were damaged or destroyed, officials said, after the tornadoes surprised people by striking unusually late in the year during cold weather on Friday.</p><p>The dead, including at least six children, ranged in age from 5 months to 86 years old.</p><p>\"You go from grief to shock to being resolute for a span of 10 minutes and then you go back,\" Beshear said, choking up at times.</p><p>Amid the roller coaster of emotions, it has proven difficult for authorities to pin down the exact death toll. Piles of wreckage, interruptions to cell service and the number of people sheltering with friends and relatives have complicated efforts to identify fatalities. </p><p>The final death toll from Mayfield's candle factory will stand at eight, as the remaining 102 workers who were on duty when the tornado struck are alive and have been accounted for, a process that took three days given the chaos brought by the disaster, company spokesperson Bob Ferguson said.</p><p>\"Tremendous relief,\" Ferguson told Reuters. \"And now there is a real urgency to help those who lost their loved ones.\"</p><p>While Kentucky bore the brunt of the tornadoes, including one that tore across tore across 227 miles (365 km) of terrain, six people died in an Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> warehouse in Illinois, four were killed in Tennessee and two in Missouri, while a nursing home was struck in Arkansas, causing one of that state's two deaths. </p><p>The U.S workplace safety watchdog is investigating the circumstances around the collapse of the Amazon facility, and the company said it would cooperate.</p><p>Across Kentucky, neighbors and volunteers worked to house, feed and offer any other assistance to those whose homes were damaged, destroyed or stripped of electricity.</p><p>In the neighboring town of Wingo, about 90 people, from babies to the elderly, are sleeping on green cots that fill a warehouse-like room with low ceilings and a large standing cross at a community center affiliated with a Presbyterian church.</p><p>Stephen Jennittie, 52, was staying there with his wife, Christie Bonds, their Chihuahua puppy, Mr. Jingles, and about 90 other Mayfield residents, since the power and heat were knocked out of their home.  </p><p>Their survival felt like such a miracle that it renewed his religious faith, Jennittie said, recalling how his house shook amid the rumbling noise. </p><p>\"I was talking to God and I told my lady, when we get out of here, we're going to start going to church,\" said Jennittie, a seventh-generation resident of Mayfield who said he may leave a devastated hometown that he no longer recognizes.</p><p>\"It ain't the Mayfield I grew up in.\"</p><p><br/></p><p>'KIND OF IN DISBELIEF'</p><p>Homes across the town had collapsed walls, missing roofs and uprooted trees scattered across lawns.</p><p>With so many homeless, the Wingo shelter was short on mattresses on Saturday. But after one phone call, a local furniture store owner brought in more than two dozen mattresses, said Meagan Ralph, 37, a middle-school teacher who found herself appointed the community outreach director when she showed up to volunteer over the weekend.</p><p>\"Some of them are really shocked and just kind of in disbelief, almost denial. For some, the emotion is unbearable,\" Ralph said.</p><p>President Joe Biden will attempt to raise spirits with a planned visit on Wednesday to hard-hit areas including Mayfield, the White House said, after the president declared a major federal disaster in Kentucky on Sunday. </p><p><span class=\"tr-strong\">Late </span>o<span class=\"tr-strong\">n Monday, the president also declared an emergency in Tennessee and Illinois and approved federal assistance for the two states. </span></p><p>More than 300 people in Kentucky, as well as in Arkansas and Tennessee, are being housed in Red Cross shelters, and that number is expected to grow. Hundreds more have been placed temporarily in resorts at area state parks, Kentucky Red Cross Chief Executive Steve Cunanan said.</p><p>Still others stayed with friends and relatives whose houses were spared. </p><p>David Hargrove, 62, surveyed the rubble that was once his private law office in downtown Mayfield. Amid the debris, a vault that was built into the 23-year-old building stood as the only part to remain upright.</p><p>He plans to rebuild.</p><p>\"You either sit down and cry or you get moving,\" Hargrove said. \"I'm not much one to cry if I can avoid it.\"</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Gabriella Borter in Mayfield, Kentucky; Additional reporting by Peter Szekely and Tyler Clifford in New York, Brendan O'Brien in Chicago, Susan Heavey in Washington, Dan Whitcomb in Los Angeles and Rich McKay in Atlanta; additional reporting by Shivam Patel in Bengaluru, Writing by Maria Caspani and Daniel Trotta; Editing by Paul Thomasch, Lisa Shumaker and Peter Cooney)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:daniel.trotta@reuters.com\" data-type=\"email\" translate=\"no\">daniel.trotta@reuters.com</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-WEATHER/TORNADOES (UPDATE 8, PIX, TV)</p></div>"}