{"date": "2021-12-14 13:11:36.416000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>OLLIE'S BARGAIN OUTLET HOLDINGS INC (\"OLLI-Q\")\n- Hiring of Senior Vice President of Supply Chain\n\n   Ollie's Bargain Outlet Holdings, Inc. (the \"Company\") announced today\nthat Mario Sampson has joined the company as Senior Vice President of\nSupply Chain, effective immediately. Mr. Sampson will report to Eric van\nder Valk, Executive Vice President and Chief Operating Officer. He will be\na key member of our leadership team with responsibilities that include\noversight of our Supply Chain, including Domestic and International\ntransportation, logistics, and distribution centers.\n\n   John Swygert, President and Chief Executive Officer, stated, \"We are\nthrilled to have Mario join the Ollie's family. He brings strong leadership\nskills and extensive experience in distribution and logistics. He has a\nproven track-record of driving process enhancements and leading\nhigh-performance teams. We look forward to his contributions as we continue\nto scale Ollie's for long term growth.\"\n\n   Mr. Sampson most recently served as Senior Vice President of Operations\nat Unique Industries, one of the largest distributors of licensed paper and\nparty goods, where he was responsible for global supply chain operations.\nPrior to this, he held various operations roles with Macy's, Amazon, and\nTarget.\n\n   About Ollie's\nWe are a highly differentiated and fast growing, extreme value retailer of\nbrand name merchandise at drastically reduced prices. We are known for our\nassortment of merchandise offered as Good Stuff Cheap(R). We offer name\nbrand products, Real Brands! Real Bargains!(R), in every department,\nincluding housewares, food, books and stationery, bed and bath, floor\ncoverings, toys, health and beauty aids and other categories. We currently\noperate 429 stores in 29 states throughout half of the United States. For\nmore information, visit www.ollies.us.\n\nJean Fontana\nICR\n646-277-1214\nJean.Fontana@icrinc.com\n\nTom Kuypers\nSenior Vice President - Marketing &amp; Advertising\n717-657-2300\ntkuypers@ollies.us\n\nTel   : 1-717-657-2300    OLLIE'S BARGAIN OUTLET HOLDINGSINC\nEmail : john.rouleau@icrinc.com\nWWW   : <a href=\"https://www.ollies.us\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.ollies.us</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134600783.MNPRE2134603211-23063720211213</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}