{"date": "2022-02-02 16:30:02.302000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3023.87, "close": 2776.91}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\"><p class=\"xn-distributor\">Canada NewsWire</p><p class=\"xn-dateline\">MONTREAL, Feb. 2, 2022</p></div><div class=\"xn-content\"><ul type=\"disc\" class=\"bulleted-list arrowlist\"><li><span class=\"xn-location\">Montreal</span>-based automation start-up has raised over <span class=\"xn-money\">CAD$55M</span> in total funding after closing its Series A</li><li>New direct investment from OMERS Ventures and White Star Capital—combined with debt financing from Silicon Valley Bank (SVB) and previously raised seed funding from Desjardins Capital and Real Ventures—will see Wrk expand its team and accelerate the development of its platform</li><li>Wrk's Hybrid Automation platform allows businesses to create end-to-end automated workflows without any technical expertise</li><li>Company adds four senior executives to its team as part of growth push, including a former Amazon CTO</li></ul><p><span class=\"xn-location\">MONTREAL</span>, <span class=\"xn-chron\">Feb. 2, 2022</span> /CNW Telbec/ - Wrk Technologies Inc. (Wrk), a <span class=\"xn-location\">Montreal</span>-based automation start-up dedicated to transforming and scaling the delivery of work, has secured <span class=\"xn-money\">CAD$55M</span> (<span class=\"xn-money\">USD$43M</span>) in cumulative seed, Series A, and debt financing after completing its Series A led by White Star Capital and OMERS Ventures. The total financing announcement includes <span class=\"xn-money\">CAD$12.5M</span> (USD <span class=\"xn-money\">$9.6M</span>) in previously raised seed financing from original seed investors Real Ventures and Desjardins Capital. In addition, several prominent angels including <span class=\"xn-person\">Sharon Rowlands</span> (CEO Web.com), Cherif Habib (CEO Dialogue Health), <span class=\"xn-person\">Mark MacLeod</span> (former CFO Shopify), <span class=\"xn-person\">Charlie Songhurst</span> (former head of strategy Microsoft), and <span class=\"xn-person\">Michael Litt</span> (CEO Vidyard) have invested over the course of the fundraising.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/1738763/Wrk_Wrk_making_waves_in_automation_space_with__55M_funding_annou.html\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Wrk co-founders David Li and Mohannad El-Barachi in good spirits after raising $55 million in Series A funding. (CNW Group/Wrk)\" src=\"https://mma.prnewswire.com/media/1738763/Wrk_Wrk_making_waves_in_automation_space_with__55M_funding_annou.jpg\" title=\"Wrk co-founders David Li and Mohannad El-Barachi in good spirits after raising $55 million in Series A funding. (CNW Group/Wrk)\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMTczODc2My9XcmtfV3JrX21ha2luZ193YXZlc19pbl9hdXRvbWF0aW9uX3NwYWNlX3dpdGhfXzU1TV9mdW5kaW5nX2Fubm91LmpwZw==&amp;key=10b68db25cb7597028c7c3b4518d6d892166e993d46c3448ee8099f13ea2f2c78f118ada1906e9fec879a5fab79734c69c5cdeeaa42cb28c96a956ebbbf8e1e2\"/></div></div></a></p></div><p>Founded by CEO Mohannad-El Barachi and COO <span class=\"xn-person\">David Li</span> in 2019, Wrk is currently serving a diverse roster of clients in <span class=\"xn-location\">North America</span> and <span class=\"xn-location\">Europe</span>, including communications and PR giant Cision, media conglomerate Gannett, Silicon Valley Bank (SVB), and international non-profit Penny Appeal. Wrk's Hybrid Automation platform is the first process automation solution to combine workplace automation with a skilled human workforce. By enabling organizations to automate routine tasks and freeing employees to dedicate more time for critical growth tasks, Wrk is helping organizations dramatically scale the delivery of their work without sacrificing quality or foregoing the value of human input.</p><p>To achieve this goal the company has created a unique 'building block' structure that makes it easy for anyone (even those without IT experience) to build workflows that can leverage the very best of bots, API integrations, Robotic Process Automation (RPA), and a vast array of human skills, without any heavy technical lifting. This easy-to-use structure and unprecedented mix of pre-configured technology with human ingenuity mean Wrk can handle almost any repetitive task, regardless of its complexity.</p><p>The trend for automation adoption has been amplified significantly by the unprecedented challenges brought on by COVID-19. A 2021 <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3431355-1&amp;h=3444669852&amp;u=https%3A%2F%2Fwww.mckinsey.com%2Ffeatured-insights%2Ffuture-of-work%2Fwhat-800-executives-envision-for-the-postpandemic-workforce&amp;a=survey+from+McKinsey\" data-type=\"url\" class=\"tr-link\" translate=\"no\">survey from McKinsey</a></u> found that 83 per cent of executives reported faster automation adoption rates in 2021 compared with before the pandemic.</p><p>However, while the demand for more traditional Business Process Automation (BPA) has increased steadily over the last decade, many first-generation automation solutions have struggled to ensure quick and easy adoption due to lengthy onboarding requirements, technical incompatibilities, and high up-front customization and implementation costs. By contrast, Wrk's simplified approach to automation means that customers can focus more on defining desired outputs than devoting time to understanding the complexities of technical integrations.</p><p>\"The scale of the investment we've received at this early stage from highly respected investors is a tremendous validation of the level of ambition and size of the opportunity we're going after,\" <b>said CEO Mohannad El-Barachi</b>. \"For far too long, businesses have struggled with adopting automation because of the high costs of entry, rigid implementation processes, and overly complex language. This investment is the first step in bringing to market an automation solution that breaks these barriers and delivers on its mission of making automation insanely simple.\"</p><p>The innovative nature of Wrk's Hybrid Automation platform has certainly garnered a lot of investor interest in recent months, culminating in this round of funding. It is perhaps the accessibility of the end-to-end solutions provided, however, that has been most appealing to experts in the tech space.</p><p>\"Unlike a lot of automation solutions, Wrk isn't trying to replace human ingenuity—instead, it is leveraging a skilled team to tailor automated solutions for each customer, so businesses can scale when and where they need to, without the barriers that exist today. We hear from companies every day who are struggling to bridge the gap between the potential of autonomous workflows and the time and cost to implement them. We see enormous potential in backing a company that can do just that.\" <b>said <span class=\"xn-person\">Laura Lenz</span>, Partner at OMERS Ventures</b>.</p><p>\"We were immediately excited about Wrk's product positioning in the workflow automation space,\" <b>added <span class=\"xn-person\">Christophe Bourque</span>, General Partner at White Star Capital</b>. \"The increased adoption of automation tools by businesses, allied with the team's unique approach combining human cognition with cutting-edge automation, has positioned the company for explosive growth. We look forward to working with the company as they continue to democratize access to business process automation solutions to companies big and small across the world.\"</p><p><b>Wrk adds senior hires</b></p><p>In support of this next growth phase, Wrk has added four key senior hires to the team of more than 50 full-time employees. <span class=\"xn-person\">Mathieu Rebeiro</span> joins as Vice-President of Automation Solutions. Mathieu has led automation at some of the largest financial institutions in the world including most recently Royal Bank of <span class=\"xn-location\">Canada</span>, TD Bank and Sun Life Financial.</p><p><span class=\"xn-person\">Michael Thompson</span> is joining Wrk as SVP of Customer Operations. Michael is a seasoned executive with over 20 years of experience leading large operational organizations, most recently at Gannett, bringing startups to IPO through the implementation of people, process, and technology enhancements.</p><p>In Sales, <span class=\"xn-person\">Maria Meadows</span> joins as SVP, with almost 20 years of experience leading and building top-performing sales teams from Fortune 500 companies to tech startups across multiple industries, including most recently at <span class=\"xn-location\">USA</span> Today and ModelB.</p><p>Finally, <span class=\"xn-person\">Jacques Bouchard</span> will bring over two decades of expertise to the role of Chief Technology Officer (CTO). Prior to joining Wrk, Jacques spent over a decade as CTO at Amazon's Global Security Operations division where he was responsible for leading security technology efforts.</p><p>To learn more about Wrk, visit <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3431355-1&amp;h=1874630272&amp;u=https%3A%2F%2Fhubs.li%2FQ013jxZY0&amp;a=www.wrk.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.wrk.com</a></u> today.</p><p><b>About Wrk:</b></p><p>Wrk is a fully-fledged Hybrid Automation platform that simplifies how work is delivered at scale. Powered by an experienced team and backed by some of the most reputable investors in <span class=\"xn-location\">North America</span>, Wrk's ambition is nothing short of transforming the Future of Work.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\"><p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=TO49654&amp;sd=2022-02-02\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1UTzQ5NjU0JnNkPTIwMjItMDItMDI=&amp;key=ee7a5ba037cf32cec7c24d3d944ed50afa2d44d581d6541790f4ce811358f071f90bf0d38920f7411b9c7f5b81ea3839ce7175ffc4993c5e489ffd893cf76ca0\"/></div></div> View original content to download multimedia:<a href=\"https://www.prnewswire.com/news-releases/wrk-making-waves-in-automation-space-with-55m-funding-announcement-301473767.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/wrk-making-waves-in-automation-space-with-55m-funding-announcement-301473767.html</a><p></p><p>SOURCE  Wrk</p><div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><p></p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=C3393&amp;sd=2022-02-02\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1DMzM5MyZzZD0yMDIyLTAyLTAy&amp;key=555e76c1beb57fe0bcfa72e7d9d0dcf3d4709a8cadc535960557f6257ba56ea9437d594c94fc82e0cbd2cb27d6fe9227758297245ff39f709ea955b4680d2141\"/></div></div> View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/February2022/02/c3393.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/February2022/02/c3393.html</a><p></p></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright CNW Group Ltd. 2022</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Wrk-AutomationFund</p></div>"}