{"date": "2021-12-21 00:40:02.435000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">AUCKLAND, New Zealand, Dec. 20, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">AUCKLAND, New Zealand</span>, <span class=\"xn-chron\">Dec. 20, 2021</span> /PRNewswire/ -- <u><a href=\"https://theclinician.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Clinician</a></u>, a global digital health leader, announced today that it has joined the Amazon Web Services (AWS) Independent Software Vendor (ISV) Accelerate program.</p>\n<p>The AWS ISV Accelerate Program is a co-sell program for AWS Partners who provide software solutions that run on or integrate with AWS. The AWS ISV Accelerate Program will provide The Clinician with co-sell support and benefits to connect with AWS field sellers globally, who service millions of active AWS customers. Co-selling provides better customer outcomes and assures mutual commitment from AWS and AWS Partners.</p>\n<p><span>\"Having established a close relationship with AWS from the start of The Clinician's journey, we are thrilled to have been accepted into the AWS ISV Accelerate Program. For us, the program will help accelerate our global business development efforts and will enable us to reach more organisations interested in digitally transforming their healthcare delivery.\"</span></p>\n<p><span><span class=\"xn-person\">Ron Tenenbaum</span>, CEO of The Clinician</span></p>\n<p>Headquartered in <span class=\"xn-location\">New Zealand</span> with teams in <span class=\"xn-location\">Australia</span>, <span class=\"xn-location\">Singapore</span>, <span class=\"xn-location\">Israel</span> and partners in MENA and the <span class=\"xn-location\">USA</span>, The Clinician works with healthcare organisations across the globe to improve patient health outcomes and enhance care delivery by enabling the timely exchange of health data and information between patients and providers outside traditional care settings. The company's artificial intelligence (AI)-driven ZEDOC platform offers healthcare providers real-time health monitoring, analysis, and risk prediction by collecting health data directly from patients in the comfort of their own homes. </p>\n<p>While developing ZEDOC, The Clinician joined the <u><a href=\"https://partners.amazonaws.com/partners/0010h00001ffdcBAAQ/The%20Clinician\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Partner Network</a></u> on the <u><a href=\"https://aws.amazon.com/partners/isv/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Independent Software Vendor</a></u> (ISV) Partner Path. By doing so, The Clinician leveraged AWS resources and programs specifically designed to meet its business goals faster, to develop its products while adhering to strict patient-data protocols.</p>\n<p><u><a href=\"https://metrosouth.health.qld.gov.au/princess-alexandra-hospital\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Princess Alexandra Hospital (PAH)</a></u> in <span class=\"xn-location\">Brisbane</span> uses the ZEDOC platform to monitor and act on post-chemotherapy side effects for lung cancer patients. ZEDOC sends a weekly questionnaire via an embedded link in a short messaging service (SMS), asking patients to report on 12 key chemotherapy-related symptoms following treatment. These responses help the hospital tailor patients' post-therapy medications or modify their next chemotherapy session accordingly.</p>\n<p>By using ZEDOC to capture patient responses, PAH's oncology team can analyse real-time patient outcomes and actionable information, which is presented in a single, interactive dashboard. The oncology team also receives automated, real-time alerts when any oncological emergencies are reported.</p>\n<p>Because of the improved efficiency from ZEDOC, the oncology team is able to handle increasing workloads while delivering individualised care. Furthermore, with accurate, real-time data on patient conditions, the oncology team can determine which patients can skip hospital consultations and go straight to treatment on their next visit, and who needs a doctor's review.</p>\n<p><b>About The Clinician</b></p>\n<p><u><a href=\"https://theclinician.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Clinician</a></u> is a digital health leader, redefining how healthcare is measured and delivered. Their cloud-based platform, ZEDOC, enables healthcare providers to manage patient-generated health data outside traditional clinical settings and transform slow, inefficient care processes through digitisation. Tightly integrated with health information systems, ZEDOC supports timely exchange of health data and information between providers and patients, including subjective patient-reported measures (PROMs and PREMs), objective wearable / device data, and important communication or educational materials. By streamlining the digital collection of critical health data and delivery of rich educational content, ZEDOC gives healthcare providers and patients real-time, actionable information to improve health outcomes and experiences while reducing waste and inefficiencies.</p>\n<p>For more information, visit <u><a href=\"http://www.theclinician.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.theclinician.com</a></u>.</p>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=CN09924&amp;sd=2021-12-20\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1DTjA5OTI0JnNkPTIwMjEtMTItMjA=&amp;key=e70a6b960cde1a2048c945b6bc38e7d1a431c24a75e642a0c0d2295174000ca568541feddec12899b4613673d76ad35f48d970312bf256901af50aab1646bb8f\"/></div></div> View original content:<a href=\"https://www.prnewswire.com/news-releases/the-clinician-joins-aws-isv-accelerate-program-301446935.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/the-clinician-joins-aws-isv-accelerate-program-301446935.html</a><p></p>\n<p>SOURCE  The Clinician</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: The-Clinician</p></div>"}