{"date": "2021-11-18 17:01:31.650000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3549.0, "close": 3676.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><span><strong>iText Suite 7 (BYOL) migrates to the AWS cloud, broadening its visibility to allow for embedded PDF functionality into developer software and workflow.</strong></span></p>\n<p><strong>BOSTON, MA / ACCESSWIRE / November 18, 2021 /</strong> <a href=\"https://pr.report/dC8-SDOG\" data-type=\"url\" class=\"tr-link\" translate=\"no\">iText</a> Software, a global leader in innovative PDF technology, announced today its PDF Library, iText 7 Suite, is now available in AWS Marketplace. Offering <a href=\"https://pr.report/k-sREVaW\" data-type=\"url\" class=\"tr-link\" translate=\"no\">iText 7 Suite</a> PDF Library within the AWS Marketplace provides broad functionality for manipulating and processing PDFs.</p>\n<p>The AWS Marketplace is a digital catalog with thousands of software listings from independent software vendors that make it easy to find, test, buy, and deploy software that runs on Amazon Web Services (AWS). iText partners with AWS to deploy its technology as a leading solution to reduce developer workload. A Bring Your Own License (BYOL) is a prerequisite to use iText 7 Suite on AWS Marketplace.</p>\n<p>The addition of the PDF library suite on the AWS Marketplace comes after the recent offering of <a href=\"https://pr.report/oTjHGJDq\" data-type=\"url\" class=\"tr-link\" translate=\"no\">iText DITO</a>, delivering a highly-performant, collaborative solution for developers and business users to collaborate simultaneously to get mass PDF documents out in the correctly branded templates, using data from various source systems, which significantly reduces developer workload.</p>\n<p>\"We are thrilled to have iText 7 Suite available on AWS Marketplace to support our clients who are already using AWS for many of their IT operations,\" <a href=\"https://pr.report/dySObTLI\" data-type=\"url\" class=\"tr-link\" translate=\"no\">said Gary Fry, CEO</a>, iText. \"It's validating to watch the continued adoption of PaaS to simplify PDF tasks, while at the same time supporting our large customer and user base now through AWS and iPaaS when it comes to managing their document management workflows.\"</p>\n<p>Customers on the marketplace can now take advantage of iText's powerful PDF capabilities without thinking about hardware costs, server configuration and more. The PDF library casts a wide range of common PDF tasks for developers to use at their utmost convenience using the REST API. The iText 7 Suite allows developers to embed <a href=\"https://pr.report/RG1eIwu4\" data-type=\"url\" class=\"tr-link\" translate=\"no\">iText APIs</a> into existing application workflows, freeing up time to handle tasks such as splitting and merging PDFs, conversion of Microsoft Office documents to PDF, delete pages from PDFs, rotate PDFs, password protect and unlock PDFs, convert images to PDF, and flatten XFA to static PDF.</p>\n<p>\"Companies are finding unsurpassed value from being able to use cloud-native technologies to empower their digital transformation strategies,\" said Raf Hens, CTO, iText. \"Offering iText 7 Suite BYOL to a wider audience means more value equipped to handle the increased challenges of today's document workflows.\"</p>\n<p><strong>About iText Software</strong></p>\n<p>iText Software is a global leader in innovative award-winning PDF solutions used by millions of users worldwide - both open source and commercial - to create digital documents for a variety of purposes: invoices, credit card statements, mobile boarding passes, and more.</p>\n<p>The iText 7 Core library is available as open source, while commercial licensing provides professional support and release from the AGPL requirements. The iText 7 Suite includes a wide range of add-ons providing extra functionality, and we also develop iText DITO: a collaborative template-based PDF generator with integrated template and resource management.</p>\n<p>Customers choose iText because of its world-class software quality, and reliable, mature, and proven technology. The PDF solutions can be embedded into the document workflows of various industries and their applications to enable creation and manipulation of PDFs, and advanced features like secure content redaction, encryption, digital signatures, Microsoft Office document conversion, and ensuring documents are accessible and archivable. iText supports a diverse customer base, which includes more than 70% of the Fortune 50 companies as well as small businesses and government agencies, with iText earning an overall 90%+ customer satisfaction rate.</p>\n<p><strong>Contact:</strong><br/>\nSarah Thorson<br/>\n<a href=\"mailto:sarah@york.ie\" data-type=\"email\" translate=\"no\">sarah@york.ie</a><br/>\n609-234-8531</p>\n<p><strong>SOURCE:</strong> iText Software Corp.</p>\n<br/>\n<br/>\nView source version on accesswire.com:<br/>\n<a href=\"https://www.accesswire.com/673648/iText-7-Suite-Now-Available-in-AWS-Marketplace-Simplifying-PDF-Tasks-and-Process-Automation\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.accesswire.com/673648/iText-7-Suite-Now-Available-in-AWS-Marketplace-Simplifying-PDF-Tasks-and-Process-Automation</a><br/>\n<br/>\n<div class=\"tr-image\"><div class=\"tr-image-components\"><img height=\"0\" src=\"https://www.accesswire.com/img.ashx?id=673648\" width=\"0\"/></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright 2021 ACCESSWIRE. All Rights Reserved.</p></div>"}