{"date": "2022-01-18 14:16:26.008000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_v1i47t4b&amp;referenceId=1_v1i47t4b&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_v1i47t4b&amp;referenceId=1_v1i47t4b&amp;pageId=RefinitivNewscasts</a></pre>Source: Stocktube<br/><br/>Description: Seraphim Space Investment Trust PLC (LSE:SSIT) (Seraphim Space Investment Trust PLC (LSE:SSIT)) Mark Boggett joins Proactive London to talk about the record year of private capital invested in space, with a 60% increase to US$12.4nm, amid a year of long-awaited breakthroughs from the industry. &amp;#xD;&amp;#xD;The first of their seven space predictions for 2022 is that the industry is likely to see continued momentum in investment and public interest in the area of space tech.&amp;#xD;&amp;#xD;His other predictions include, the growing relevance for space companies tackling climate change/ESG, the pipeline for Space SPAC remaining robust for communications and climate. Cloud transforming Space with tech giants validating space with disruptive technologies. And a massive increase in satcom capacity which will drive further consolidation.&amp;#xD;&amp;#xD;Then they're forecasting an explosion of EO data, leveraging of fusion of multi-data and multi-sensor to deliver insights and lastly the need for global leadership becoming clear amidst congestion and rising tension between the US and China.<br/>Short Link: <a href=\"https://refini.tv/3A8VB4s\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3A8VB4s</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; Hello, there. You're watching Proactive London. Well, 2021, I saw many breakthroughs in space, ranging from human space flights, deep space exploration, to record levels of investment. New space essentially came of age and became widely accepted as a new investment asset class in both public and private markets. We're looking ahead Seraphim blaze 2020 to see continued momentum in investment and public interests in the space tech domain. That's exactly what we're going to be talking about. Now, from Seraphim Space, it's of course, Mark Boggett. A warm welcome to you talking through your 2022 predictions one-by-one. Good to see, Mark. &gt;&gt; Great. It's great to be here, Katie. &gt;&gt; Good stuff. Well, let's get stuck in here. So you're predicting space momentum continuing public interest remains high with mega-rocket launches. &gt;&gt; That's right. That's the first of our predictions. 2021 was a record year with over 12 billion of private capital invested in the space ecosystem. That's a huge increase of more than 60% on the previous year. And we expect this momentum to continue because space is at an inflection point. There are significant new capabilities in satellite communications, an Earth observation that coming on stream that could disrupt traditional industries and create new ones. We believe that public enthusiasm for space will remain high with the launch of new mega rockets that are coming soon. This includes NASA's giant moon rocket and SpaceX's next-generation starship, both to return humans to the moon and some day onto Mars. Countries including Korea, Japan, India, the UAE are all planning to launch their first missions to the moon. &gt;&gt; Wow, that's a bit of a race, isn't it? I love it. The next one is growing relevance to space companies tackling climate change in ESG. &gt;&gt; Yeah, this is a hugely-excited area. There's been a huge explosion of geospatial data in the development of analytics that have become increasingly relevant to solving the big problems related to climate change. Diversity of high-resolution, more frequent space data is enabling new applications to monitor and to track objects and activities on Earth. At the same time, companies are rushing to integrate ESG, the Environmental, Social, and Governance, due to growing investor interest in regulatory pressures. So space data is providing tools to help institutions establish a baseline to monitor their operations at scale, and to track their progress in carbon footprint over time. We expect to see more space companies tackling climate change in a wide variety of applications such as greenhouse gas detection, building energy efficiency, weather forecasting, environmental monitoring, supply chain optimization, precision agriculture, efficient routing of air and maritime traffic, and many, many more. Space companies active in climate include Planet, Spy Global, Eisai, Tomorrow.io, GHGSat, Pixxel, Satellite Vu, and a whole range of others that are already operating in this market. &gt;&gt; And you believe the pipeline for space back remains robust for communications and climates? &gt;&gt; That's right. Although going public virus spark in 2022 will be more challenging for space companies. We still expect to see this market developed with emerging category leaders that have demonstrated solid commercial traction and growth, especially communications and climate-related companies. Almost all of the nine companies that went public, virus sark last year traded down largely due to high shareholder redemptions, while stronger ones are really starting to leverage that position for M&amp;A. We expect the weaker ones will become acquisition targets in an upcoming wave of consolidation. &gt;&gt; Number 4 is cloud transforming space. So tech giants validating space with disruptive technologies. &gt;&gt; That's right. Cloud players are going to accelerate their reach into space in the coming year. AWS, Amazon Web Services, the number 1 cloud player, they've already established a dedicated space unit more than a year ago. In fact, they've partnered with Seraphim on that space accelerated program. We're seeing leading vile players like AWS rapidly transforming the space industry by providing powerful, cost-effective, and scalable solutions to accelerate space companies across the ecosystem. Graduates from the Seraphim AWS Space Accelerator such as ASA Space, HawkEye 360, and LeoLabs, they've all seen dramatic increases in efficiency, helping them to scale rapidly their businesses and their work with the collaboration with partners. At the same time, Amazon itself is vesting more than 10 billion to build a network of over 3,000 satellites to deliver broadband connectivity. It's planning to launch its first project, CuPID Satellites later this year. And then there's the other second giant, Microsoft Azure, they've also launched their space business recently. They believe that every one of their enterprise customers could benefit from space and see space technology disrupting every industry in the economy. &gt;&gt; And you're forecasting a massive increase in SATCOM capacity driving further consolidation. &gt;&gt; That's right. Global SATCOM capacity is expected to increase by more than fivefold over this year. That's over 20 terabytes per second, 200 trillion bytes per second this year. So that's according to you I assume. And as long as these high-throughput satellites , HTSs, from the major companies like Viasat, Eutelsat, Hughes, and SES come online. At the same time we've got new Low Earth Orbit or LEO mega-constellations coming online from Starlink, and OneWeb, and others that gearing up their commercial services. Whilst received strong demand for broadband, mobile recovery in growing applications for autonomous vehicles, machine-to-machine, IoT, these operators still need to close their business cases in a highly fragmented market across many technologies and spectrums. And as a result, we expect to see further consolidation as operators try and scale and position themselves for growth. &gt;&gt; On the next one, I get you to explain what it is as well because we're talking about the explosion of EO data, the leveraging of fusion of multidata and multisensor to deliver insights. &gt;&gt; So just to be clear, EO stands for Earth observation. This is monitoring the planet from space. So like SATCOM, what we're saying is that the EO industry is rapidly transforming with new technologies that bring significant amounts of new capacity, new modalities in the coming year. There's an established business like Maxar launching its legion constellation this year. They're going to deliver high-resolution optical imagery. They're going to increase the revisit time, or to 15 times per day anywhere on the planet. That's tripling its own capacity. Then we've got new movies that have recently come to the market like planets that planning to double its image capacity. They're launching 44 of their Superdome satellites. We expect to see significant increase in other types of satellites, such as SAR, Synthetic-Aperture Radar. These are satellites that enable you to be able to look from space down to the ground in all weathers, 24/7, regardless of whether it's day or night. We've got more than half a dozen small SAR operators currently expanding their constellations. And then we've got the newcomers, companies like Tomorrow.io, Satellite Vu, and Pixxel. They're launching their first EO satellites into space during the course of this year, making new modalities of weather, infrared, and hyperspectral data available to commercial markets for the first time, which will enable new capabilities to deliver better customer solutions. We see this trend driving further horizontal and vertical consolidation, especially if a well-funded EO players, who are going to be acquiring complementary constellations like Synthetic-Aperture Radars to enhance their product offerings. &gt;&gt; And lastly, we're talking about a bit of geopolitics, and you're demanding the need for global leadership becoming clearer miscegenation and rising tension between the US and China. &gt;&gt; That's right. Well, we've seen debris as recently as just before Christmas when the Russians adjusted their weapon system. This highlighted the growing risks of constellations in space; a space becomes more congested. Well, global leadership and cooperation is urgently needed to promote norms and maintain sustainability in space. The chances of cooperation between the US and China are slim due to ongoing national securities concerns, rising geopolitical tensions, and of course, competition in space. Last year, China exceeded the US with 56 orbital launches, and is jockeying for global leadership and partnerships to develop the moon. In this year, the United Nations resolution on norms of behavior represents a great opportunity for the leading space powers to come together to reach consensus on how we can reduce the risks in space. We also expect to see more from private sector companies like LeoLabs, and Astroscale, and D-Orbit, stepping in to fill this gap and provide services including space situational awareness, in space debris removal, and in orbit services. &gt;&gt; All right, Mark. Thank you so much. Indeed some fantastic detail there. So we'll put all of that at the bottom of this video so that people can properly read it as well. From Seraphim Space here in Proactive London with your predictions for 2020.<br/></span></div></div></div></div>"}