{"date": "2021-12-03 20:01:34.895000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3437.36, "close": 3427.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Read Article MongoDB announced that it will make it easier for customers to build, scale, and manage data-rich applications with MongoDB Atlas in AWS Marketplace in calendar Q1 2022. With the launch of a pay-as-you-go MongoDB Atlas with Free Trial in A...</p><p>MongoDB announced that it will make it easier for customers to build, scale, and manage data-rich applications with MongoDB Atlas in AWS Marketplace in calendar Q1 2022. With the launch of a pay-as-you-go MongoDB Atlas with Free Trial in AWS Marketplace, developers will have a simplified subscription experience, and enterprises will have another way to procure MongoDB in addition to privately negotiated offers already supported on AWS Marketplace. There will be no up-front commitments required to use MongoDB Atlas on AWS, and customers will pay only for the resources they use and scale based on their needs. MongoDB is also launching the capability for customers to buy MongoDB Professional Services in AWS Marketplace at AWS re:Invent, providing enterprises with one place to implement, configure, and run MongoDB workloads. <br/><br/> Unqork, the leading enterprise no-code platform, built its business on MongoDB Atlas. <br/><br/> \"I first started using MongoDB when I was a Fortune 50 CIO and continued to do so later in my career when I founded Unqork. Atlas was my first choice for a data platform as it provided the performance benefits I needed to run my business. Unqork is an existing AWS Marketplace customer, and we are excited to now be able to subscribe to the new MongoDB SaaS solution through AWS Marketplace for simplified procurement, streamlined billing, and data governance,\" said Gary Hoberman, founder and CEO, Unqork. <br/><br/> \"MongoDB and its document model are deployed in many AWS and MongoDB customers' environments to increase developer productivity, decrease cost, and scale to meet the needs of high growth applications. This is why both rising startups and global enterprises from around the world, across multiple industries, have chosen MongoDB as the data foundation for their next generation, modern applications,\" said Alan Chhabra, Executive Vice President of Worldwide Partners, MongoDB. <br/><br/> \"MongoDB Atlas enables customers to extend their familiar environment into AWS to run the same applications with a common foundation and tooling regardless of whether it is on cloud or on premises. We are excited about offering MongoDB Atlas in AWS Marketplace which will make it easier for MongoDB customers to build, manage, and scale their data rich applications on AWS.\" <br/><br/> MongoDB and AWS Marketplace remain committed to removing friction and making it easier for customers to procure and innovate in the cloud. Earlier this year, MongoDB and AWS launched integrations between MongoDB Atlas and AWS Wavelength, Amazon Kinesis Data Firehose, Amazon EventBridge, AWS PrivateLink, AWS App Runner, Amazon Managed Grafana, and more. With today's new AWS Marketplace integrations, AWS customers can enjoy the benefits of consolidated billing via their AWS account. <br/><br/> \"AWS Marketplace makes it easy for customers worldwide to find, subscribe to, deploy, and govern the best third-party software, data, and professional services offerings,\" said Stephen Orban, General Manager, AWS Marketplace &amp; Control Services at AWS. \"MongoDB Atlas' pay-as-you-go offering will provide customers with one of the most developer-friendly databases with an integrated and simplified subscription experience on AWS Marketplace, and we'll continue to work with MongoDB to make AWS the best place for developers to run MongoDB Atlas.\" <br/><br/> To get started, visit MongoDB Atlas in AWS Marketplace. To learn more about MongoDB Atlas and AWS integrations, visit these documents.</p></div><div class=\"tr-npp-body\"><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}