{"date": "2021-12-17 16:32:02+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3377.42, "close": 3341.58}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The author is a Reuters Breakingviews columnist.  The opinions expressed are his own.</p><p class=\"tr-by\">By Robert Cyran</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW YORK, Dec 17 (Reuters Breakingviews)</span><span class=\"tr-dl-sep\"> - </span>Oracle <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ORCL.N\" data-type=\"ric\" data-ric=\"ORCL.N\" translate=\"no\" dir=\"ltr\">ORCL.N</a> has spent the past few years buying back an extraordinary amount of its own stock. The $270 billion enterprise-software firm founded by Larry Ellison, now chairman and chief technology officer, has bought back about $100 billion of its shares over the past four years. That makes the possibility that it <a href=\"https://www.wsj.com/articles/oracle-in-talks-to-buy-cerner-11639697730\" data-type=\"url\" class=\"tr-link\" translate=\"no\">might acquire</a> hospital-records software specialist Cerner <a href=\"reuters://REALTIME/Verb=FullQuote/ric=CERN.O\" data-type=\"ric\" data-ric=\"CERN.O\" translate=\"no\" dir=\"ltr\">CERN.O</a> for $30 billion, per the Wall Street Journal on Thursday, look like a sudden change of direction. Yet if it happened, the deal would be anything but spontaneous.</p><p>In 2004, confidential Oracle planning documents were released as part of a legal proceeding. The papers listed eight software firms Ellison's company should consider buying. Cerner is the only one on that list that remains independent and potentially available. Three others are now part of Oracle; the rest were sold to other suitors.</p><p>The reasoning is largely still the same: Cerner's business complements Oracle's, and the overlap in the technology behind it allows for cost cuts. Analysts expect Cerner to have operating profit of about $1.4 billion next year, according to Refinitiv data. Assume Oracle were to leave research and development spending intact but slash Cerner's $3 billion of other operating costs in half. Taxed at the statutory rate, that $2.9 billion of operating profit would equate to a pretty decent 7% to 8% return on invested capital.</p><p>The passing of nearly 20 years may have made Cerner more attractive in some ways, too. Oracle’s belated push into cloud-based software has left it behind rivals like Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and Microsoft <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MSFT.O\" data-type=\"ric\" data-ric=\"MSFT.O\" translate=\"no\" dir=\"ltr\">MSFT.O</a>. Buying Cerner could help, as workloads running on Amazon might be moved, at least in part, to Oracle’s systems. </p><p>A deal might slow down Oracle’s buyback machine. It might indicate more than a one-off shift towards further acquisitions. After all, Ellison has done plenty of deals over the years, and Oracle probably has a freer hand than rivals constrained <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2HD722\" data-type=\"storyId\" data-story-id=\"nL8N2HD722\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> by regulators. This possibility could explain why the company's stock fell about 5% in morning trade on Friday. </p><p>But Oracle said $10 billion more had been added to its repurchase program when it reported <a href=\"https://s23.q4cdn.com/440135859/files/doc_financials/2022/q2/2q22-pressrelease-December.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">earnings</a> last week. And if it does buy Cerner, it won't be splurging on a risky whim. If anything, investors should admire the persistence.</p><p>Follow <a href=\"https://twitter.com/rob_cyran\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@rob_cyran</a> on Twitter</p><p>         </p><p>CONTEXT NEWS </p><p>- Oracle is in talks to acquire Cerner, according to a Wall Street Journal story on Dec. 16.  Enterprise software firm Oracle had a market capitalization of $275 billion based on closing prices on Dec. 16, before the article was published. Cerner, which makes electronic medical-records software, had a market capitalization of $23 billion.</p><p><br/></p><p class=\"tr-signoff\"> (Editing by Richard Beales and Sharon Lam)</p><p class=\"tr-contactinfo\">((For previous columns by the author, Reuters customers can click on <a href=\"reuters://REALTIME/verb=Headlines/ric=CYRAN/\" data-type=\"newsExpression\" data-expression=\"CYRAN/\" translate=\"no\" dir=\"ltr\">CYRAN/</a> <br/> SIGN UP FOR BREAKINGVIEWS EMAIL ALERTS <a href=\"https://bit.ly/BVsubscribe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://bit.ly/BVsubscribe</a> | <a href=\"mailto:robert.cyran@thomsonreuters.com\" data-type=\"email\" translate=\"no\">robert.cyran@thomsonreuters.com</a> ; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://robert.cyran.thomsonreuters.com@reuters.net\">robert.cyran.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: ORACLE-CERNER/BREAKINGVIEWS</p></div>"}