{"date": "2021-11-09 05:40:35.643000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">Premier Tech Water and Environment launches a unique process and service for the on-site sanitation market</p>\n<p>RIVIÈRE-DU-LOUP, QC, Feb. 15, 2022</p>\n<p>RIVIÈRE-DU-LOUP, QC, Feb. 15, 2022 /CNW Telbec/ - Premier Tech Water and Environment has developed a process and unique tools to extract sludge accumulation in on-site aerated systems with fixed culture. Thanks to its innovative features, this efficient, fast and cost-effective solution is patent pending with the relevant authorities.</p>\n<p>\n\n</p>\n<p>On-site sanitation systems treat wastewater (kitchen, bathroom, etc.) from houses without a connection to the community sewage system. Some of these systems have integrated automated extraction devices to avoid gradual sludge accumulation at the bottom of the reactor, then through the media and finally up to the surface.</p>\n<p>This extraction process aims to prevent polluting emissions resulting from the accumulation of sludge. It also protects from an early replacement of the subsurface infiltration bed. Thus, we avoid damage to the landscaping, increase the lifespan of the system components and reduce the homeowners' bill significantly. A service offer based on this process will be launched on the global market and <span>Quebec</span> users will be the first to benefit from it, as its development was initiated through a network of local partners.</p>\n<p>\"As part of the development and validation phases, many clients have already been able to enjoy this new service and restore their system's operating conditions. Consequently, they have made savings on the lifespan of their system. We have received great feedback!\" says <span>Nicolas Robitaille</span> , senior director products and services development at Premier Tech Water and Environment.</p>\n<p>\n<span>Premier</span>\n<span>Tech anticipates the key trends of its industry</span> The launch of this process and unique tools is the result of sustained investments in innovation as well as the commitment and passion of experts. Premier Tech Water and Environment is strongly forward-looking and maintains its position as a global leader in sanitation systems thanks to the ongoing development of more efficient, intelligent and eco-friendly technologies and solutions.</p>\n<p>\n<span>About Premier</span>\n<span>Tech</span>\n</p>\n<p>Making a difference, this is what we are all about at Premier Tech. One team driven by a shared passion to deliver solutions that will better the lives of people, businesses and communities. At Premier Tech, People and Technologies connect in lasting, transformative ways, giving life to products and services that help feed, protect and improve our world. We are committed to creating sustainable solutions that help bring beautiful gardens to life, increase crop yields, improve the efficiency of manufacturing facilities, treat and recycle water, and much more as we keep innovating.</p>\n<p>For nearly a century, Premier Tech has been growing internationally, driven by the collective power of its team members in 28 countries. Backed by more than a quarter-century-long track record of solid growth, Premier Tech today records sales of more than <span>one billion dollars</span> .</p>\n<p>\n<span>People and Technologies making a difference</span> For more information about Premier Tech, visit <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3444483-1&amp;h=1576356751&amp;u=http%3A%2F%2Fwww.premiertech.com%2F&amp;a=www.premiertech.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.premiertech.com</a>\n</span> and follow <span>\n<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3444483-1&amp;h=387139768&amp;u=http%3A%2F%2Fwww.twitter.com%2F_PremierTech&amp;a=twitter.com%2F_PremierTech\" data-type=\"url\" class=\"tr-link\" translate=\"no\">twitter.com/_PremierTech</a>\n</span>\n</p>\n<p>SOURCE Premier Tech ltée</p>\n<p>View original content to download multimedia: <a href=\"http://www.newswire.ca/en/releases/archive/February2022/15/c1294.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/February2022/15/c1294.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}