{"date": "2021-11-03 17:35:41.874000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>A <a href=\"https://www.independent.co.uk/topic/scam\" data-type=\"url\" class=\"tr-link\" translate=\"no\">scam</a> that has caused hundreds of thousands of households to receive <a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> packages they have never ordered <a href=\"https://www.independent.co.uk/news/uk/home-news/amazon-brushing-scam-mystery-parcel-b1946858.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">has been identified</a> by the consumer group, <a href=\"https://www.independent.co.uk/topic/which\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Which</a> ?</p><p>A survey of 1,839 UK adults between 13 and 17 August found that <a href=\"http://go.redirectingat.com/?id=44681X1458326&amp;url=https%3A%2F%2Fwww.which.co.uk%2Fnews%2F2021%2F10%2Fone-million-households-in-the-uk-potentially-hit-by-amazon-brushing-scams%2F&amp;sref=https://www.independent.co.uk/news/uk/home-news/what-is-amazon-brushing-scam-parcels-b1946947.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">four per cent of respondents had received a mystery package</a> containing a free item they had not purchased and with no return address.</p></div><div class=\"tr-npp-body\"><p>It means the phenomenon, known as \"brushing\", is likely to have affected some 1.1m people across Britain.</p><p>Which? followed up its findings by speaking to three recipients of unwanted parcels in Swindon, Salisbury and Somerset, all of whom had taken delivery of packages addressed to apparently fictitious people with generic names at their residence and opened them to find a random selection of goods including bathmats, chocolate moulds, wireless karaoke microphones, kitchen tongs, fairy lights, LED bulbs, running gloves and feather dusters.</p><p>The practice appears to have taken root because unscrupulous third-party sellers, often based in China, are attempting to \"game\" Amazon's competitive ranking-based system that orders sellers according to sales volume and number of positive reviews.</p><p>By sending out unwanted items — typically, inexpensive tat that costs only a nominal amount to ship in large volumes — sellers aim to be displayed on the first and second pages of search results in the hope of attracting genuine orders.</p><p><span>Scam expands in pandemic</span> </p><p>Some sellers could theoretically be going further and setting up fake accounts under the name of the addressee to \"purchase\" an item and then later writing a glowing review of the service they claim to have received.</p><p>\"The reason for sending out the packages is to feed the Amazon algorithm, the more you sell, the higher your ranking is,\" a logistics expert named Eric based in Shenzhen, China, told the watchdog.</p><p>\"Brushing has been going on for at least a decade. The only reason it has now gone wild is because e-commerce has been accelerating very rapidly, especially because of the pandemic.\"</p><p>Another consumer expert from Shenzhen, David Li, said: \"In the Amazon universe, brushing is just a cost of doing business very similar to buying ads or getting an 'Amazon certified' logo. Generally, it's a marketing expense... The competition is intensive in cross border e-commerce.\"</p><p>The most concerning aspect of the practice is how precisely the bogus sellers are obtaining the addresses, with Amazon saying publicly available sources are used rather than its own customer database, which has not been compromised.</p><p><span>'Bad actors'</span> </p><p>Of the near-2,000 people surveyed by Which?, 63 per cent said they typically keep the magnetic eyelashes, iPhone cases and Frisbees they receive, 28 per cent toss them out and 16 per cent give them away, often to charity shops.</p><p>\"Consumers should be able to trust that the popularity and reviews of products they are buying online are genuine, so it is troubling that third-party sellers appear to be using 'brushing' scams to game Amazon Marketplace,\" said Which?'s director of policy and advocacy Rocio Concha.</p><p>\"Amazon needs to do more to thoroughly investigate instances of brushing scams and take strong action against sellers that are attempting to mislead consumers.\"</p><p>A spokesperson for the retail giant commented: \"We estimate that less than 0.001 per cent of Amazon orders are impacted by 'brushing' as Amazon has robust processes in place to prevent abuse from impacting our reviews, search rankings and other customer experiences.</p><p>\"We will never stop improving the sophistication of abuse prevention in our store, and we will continue to take the appropriate enforcement actions, including support for law enforcement organisations in their efforts to hold bad actors accountable.</p><p>\"We strongly encourage those who have received unsolicited packages to report them to our customer services team so that we can investigate fully and take the appropriate actions.\"</p><p>Customers are also <a href=\"http://buy.geni.us/Proxy.ashx?tsid=3658&amp;GR_URL=https%3A%2F%2Fwww.amazon.co.uk%2Fgp%2Fhelp%2Fcustomer%2Fdisplay.html%3FnodeId%3DG33XVXQPUV79Z2ZC\" data-type=\"url\" class=\"tr-link\" translate=\"no\">advised on the company's website</a> to dispose of or donate unwanted items and to be wary that they could be faulty, hence their being chosen for brushing purposes in the first place.</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/news/uk/home-news/amazon-brushing-scam-mystery-parcel-b1946858.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon mystery parcel scam: More than one million people may be victims of 'brushing'</a> </p><p><a href=\"https://www.independent.co.uk/money/amazon-underpaying-workers-email-jeff-bezos-b1946473.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Frustrated worker's email to Jeff Bezos may change way Amazon pays everyone</a> </p><p><a href=\"https://www.independent.co.uk/news/uk/home-news/amazon-uk-spy-agencies-classified-materials-b1945316.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon strikes deal with UK spy agencies to host classified material</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Independent, The (UK) (Online). All rights reserved.</p></div>"}