{"date": "2022-01-03 15:58:00.175000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.09, "close": 3287.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Starry Announces Rene Villegas Joins Company as Chief Marketing Officer</b>\n</p><p class=\"bwalignc\">\n<span>The former Amazon Executive joins the disruptive fixed wireless broadband company at a time of rapid growth and expansion and increased national focus on broadband</span>\n</p><p>\nStarry, Inc., (the “Company” or “Starry”) a next-generation fixed wireless broadband provider, today announced that Rene Villegas has joined the Company as Chief Marketing Officer. Villegas joins Starry from Amazon, where he was Head of Marketing and Sales and helped create and lead the marketing, business development and operations teams for “Subscribe with Amazon.” As a seasoned marketing executive, Villegas has served in a number of marketing leadership roles, including at AmericanExpress, True Car, Viggle and EF Education First. Villegas joins Starry at a time of rapid projected growth and as the company prepares to become a public company; on October 7, 2021, Starry announced that it will become a public company through a business combination with FirstMark Horizon Acquisition Corp. (“FirstMark”) (NYSE: FMAC).\n</p><p>\n“We’re thrilled to welcome Rene to the Starry team as we take this next big step to become a public company,” <b>said Chet Kanojia, Starry co-Founder and CEO. </b>“His track record of helping to successfully guide high-growth businesses, combined with his deep experience in performance marketing, brand management and business development make him the ideal person to lead Starry’s marketing efforts, as we expand and bring #HappyInterneting to more communities across the country.”\n</p><p>\n“Rene is joining Starry at a time of rapid growth and we’re excited for him to apply his experience and expertise to drive performance branding and marketing at the company,” <b>said Alex Moulle-Berteaux, Starry co-Founder and COO. </b>“At Starry, we are laser-focused on customer satisfaction and building highly disruptive unit economics to drive the success of our business. With Rene on board, we can continue to delight and build meaningful relationships with customers and bring much needed competition and choice to communities across the country.”\n</p><p>\n”Starry is disrupting the broadband industry with innovative technology and industry-leading customer obsession. Our customer satisfaction scores are orders of magnitude higher than any of our competitors,” <b>said Villegas.</b> “I’m thrilled to join a company that believes in putting the customer first, and I’m looking forward to providing exceptional service, not only to our subscribers, but to the network of property owners, management companies and housing partners with which we work.”\n</p><p>\nAt Starry, Villegas will lead the company’s growth and field marketing teams across all markets, in addition to leading the company’s creative and branding efforts as a senior member of the management team.\n</p><p>\nWhile at Amazon, Villegas helped launch Subscribe with Amazon, a new business unit that allowed Amazon subscription companies to list their products on Amazon for the first time, and enabled their discovery by Amazon customers. Initially built for digital subscriptions, Villegas helped the business pivot to include physical subscription boxes and achieve triple digit growth in product selection, customer subscriptions and revenue. Previously in his role as Head of Marketing and Business Development at Viggle, his teams drove five million app installs in 12 months, as Villegas helped guide the company to an initial public offering on the NASDAQ.\n</p><p>\nVillegas is a graduate of the Wharton School of Business at the University of Pennsylvania and holds an MBA from the University of Michigan’s Ross School of Business.\n</p><p>\n<b>About Starry, Inc.</b>\n</p><p>\nAt Starry, Inc. (“Starry”), we believe the future is built on connectivity and that connecting people and communities to high-speed, broadband internet should be simple and affordable. Using our innovative, wideband hybrid-fiber fixed wireless technology, Starry is deploying gigabit capable broadband to the home without bundles, data caps, or long-term contracts. Starry is a different kind of internet service provider. We’re building a platform for the future by putting our customers first, protecting their privacy, ensuring access to an open and neutral net, and making affordable connectivity and digital equity a priority. Headquartered in Boston and backed by world-class investors, Starry is currently available in Boston, New York City, Los Angeles, Washington, DC, Denver and Columbus and is expanding nationwide. To learn more about Starry or to join our team and help us build a better internet, visit: <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fstarry.com&amp;esheet=52556770&amp;newsitemid=20220103005247&amp;lan=en-US&amp;anchor=https%3A%2F%2Fstarry.com&amp;index=1&amp;md5=411c42f759632f73397b8e5fdf22fa21\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://starry.com</a>.\n</p><p>\n<b>About FirstMark Horizon Acquisition Corp.</b>\n</p><p>\nFirstMark Horizon Acquisition Corp. (“FirstMark”) is a special purpose acquisition company whose mission is to drive long-term value creation by actively supporting the next generation of iconic public companies. FirstMark is comprised of a team of seasoned investors and industry executives with an extensive track record of identifying transformative trends across innovative subsectors of technology. Notably, FirstMark's management team is composed of the founders and executives of FirstMark Capital, a prominent technology venture capital firm founded in 2008 with $2.3 billion in total capital commitments, which has backed entrepreneurs that have created leading companies, many valued at over a billion dollars. For more information, please visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Ffirstmarkhorizon.com&amp;esheet=52556770&amp;newsitemid=20220103005247&amp;lan=en-US&amp;anchor=http%3A%2F%2Ffirstmarkhorizon.com&amp;index=2&amp;md5=ef4a2208760d4c96be708087a72f4779\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://firstmarkhorizon.com</a>.\n</p><p>\n<b>Additional Information about the Business Combination and Where to Find It</b>\n</p><p>\nIn connection with the proposed business combination, Starry Holdings, Inc. (“Starry Holdings”), a newly formed subsidiary of Starry, has filed a registration statement on Form S-4 (the “Form S-4”) with the Securities and Exchange Commission (the “SEC”) on November 5, 2021 (as amended on December 20, 2021). The Form S-4 includes a proxy statement of FirstMark and a prospectus of Starry Holdings, referred to as a proxy statement/prospectus. The proxy statement/prospectus will be sent to all FirstMark stockholders. Additionally, Starry Holdings and FirstMark have also filed and may continue to file other relevant materials with the SEC in connection with the proposed business combination. Copies of the Form S-4, the proxy statement/prospectus and all other relevant materials filed or that will be filed with the SEC by FirstMark or Starry Holdings may be obtained free of charge at the SEC’s website at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.sec.gov&amp;esheet=52556770&amp;newsitemid=20220103005247&amp;lan=en-US&amp;anchor=www.sec.gov&amp;index=3&amp;md5=0b7a082c468fcb42e17f9de6c997b0d6\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.sec.gov</a>. Before making any voting or investment decision, investors and security holders of FirstMark are urged to read the Form S-4, the proxy statement/prospectus and all other relevant materials filed or that will be filed with the SEC in connection with the proposed business combination because they will contain important information about the proposed business combination and the parties to the proposed business combination.\n</p><p>\n<b>Participants in Solicitation</b>\n</p><p>\nFirstMark, Starry Holdings and Starry and their respective directors and executive officers, under SEC rules, may be deemed to be participants in the solicitation of proxies of FirstMark’s stockholders in connection with the proposed business combination. Investors and security holders may obtain more detailed information regarding the names and interests in the proposed business combination of FirstMark’s directors and officers in FirstMark’s filings with the SEC, including FirstMark’s registration statement on Form S-1, which was originally filed with the SEC on September 18, 2020. To the extent that holdings of FirstMark’s securities have changed from the amounts reported in FirstMark’s registration statement on Form S-1, such changes have been or will be reflected on Statements of Change in Ownership on Form 4 filed with the SEC. Information regarding the persons who may, under SEC rules, be deemed participants in the solicitation of proxies to FirstMark’s stockholders in connection with the business combination is included in the Form S-4 relating to the proposed business combination filed with the SEC on November 5, 2021 (as amended on December 20, 2021). You may obtain free copies of these documents as described in the preceding paragraph.\n</p><p>\n<b>No Offer or Solicitation</b>\n</p><p>\nThis press release shall not constitute a proxy statement or solicitation of a proxy, consent or authorization with respect to any securities or in respect of the proposed business combination. This press release shall also not constitute an offer to sell or a solicitation of an offer to buy any securities of FirstMark, Starry Holdings or Starry, nor shall there be any sale of securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction. No offering of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the Securities Act of 1933, as amended.\n</p><p>\n<b>Forward-Looking Statements</b>\n</p><p>\nCertain statements made in this press release are “forward-looking statements” within the meaning of the “safe harbor” provisions of the Private Securities Litigation Reform Act of 1995 with respect to the proposed business combination between FirstMark and Starry. Words such as “expect,” “estimate,” “project,” “budget,” “forecast,” “anticipate,” “intend,” “plan,” “may,” “will,” “could,” “should,” “believe,” “predict,” “potential,” “continue,” “strategy,” “future,” “opportunity,” “would,” “seem,” “seek,” “outlook” and similar expressions are intended to identify such forward-looking statements. Forward-looking statements are predictions, projections and other statements about future events that are based on current expectations and assumptions and, as a result, are subject to risks and uncertainties that could cause the actual results to differ materially from the expected results. These statements are based on various assumptions, whether or not identified in this communication. These forward-looking statements are provided for illustrative purposes only and are not intended to serve as, and must not be relied on by an investor as, a guarantee, an assurance, a prediction or a definitive statement of fact or probability. Actual events and circumstances are difficult or impossible to predict and will differ from assumptions. These forward-looking statements include, without limitation, Starry’s and FirstMark’s expectations with respect to the anticipated financial impacts of the proposed business combination, the satisfaction of closing conditions to the proposed business combination, and the timing of the completion of the proposed business combination. You should carefully consider the risks and uncertainties described in the “Risk Factors” section of FirstMark’s registration statement on Form S-1 (File No. 333-248916), its Annual Report on Form 10-K, as amended from time to time, for the fiscal year ended December 31, 2020, and its subsequent Quarterly Reports on Form 10-Q. In addition, there are risks and uncertainties described in the Form S-4 (File No. 333-260847) filed by Starry Holdings and other documents filed by FirstMark or Starry Holdings from time to time with the SEC. These filings identify and address other important risks and uncertainties that could cause actual events and results to differ materially from those contained in the forward-looking statements. Most of these factors are outside Starry’s, Starry Holdings’ and FirstMark’s control and are difficult to predict. Many factors could cause actual future events to differ from the forward-looking statements in this press release, including but not limited to: (1) the outcome of any legal proceedings that may be instituted against FirstMark, Starry or Starry Holdings following the announcement of the proposed business combination; (2) the inability to complete the proposed business combination, including due to the inability to concurrently close the business combination and related transactions, including the private placements of common stock and convertible notes or due to failure to obtain approval of the stockholders of FirstMark; (3) the risk that the proposed business combination may not be completed by FirstMark’s business combination deadline and the potential failure to obtain an extension of the business combination deadline if sought by FirstMark; (4) the failure to satisfy the conditions to the consummation of the proposed business combination, including the approval by the stockholders of FirstMark, the satisfaction of the minimum trust account amount following any redemptions by FirstMark’s public stockholders and the receipt of certain governmental and regulatory approvals; (5) delays in obtaining, adverse conditions contained in, or the inability to obtain necessary regulatory approvals or complete regulatory reviews required to complete the proposed business combination; (6) the occurrence of any event, change or other circumstance that could give rise to the termination of the merger agreement; (7) volatility in the price of FirstMark’s, Starry’s or Starry Holdings’ securities; (8) the risk that the proposed business combination disrupts current plans and operations as a result of the announcement and consummation of the business combination; (9) the inability to recognize the anticipated benefits of the proposed business combination, which may be affected by, among other things, competition, the ability of the combined company to grow and manage growth profitably, maintain relationships with customers and suppliers and retain key employees; (10) costs related to the proposed business combination; (11) changes in the applicable laws or regulations; (12) the possibility that the combined company may be adversely affected by other economic, business, and/or competitive factors; (13) the risk of downturns and a changing regulatory landscape in the highly competitive industry in which Starry operates; (14) the impact of the global COVID-19 pandemic; (15) Starry’s ability to obtain or maintain rights to use licensed spectrum in any market in which Starry operates and potential declines in the value of Starry’s FCC licenses; (16) the potential inability of Starry to raise additional capital needed to pursue its business objectives or to achieve efficiencies regarding other costs; (17) the enforceability of Starry’s intellectual property, including its patents, and the potential infringement on the intellectual property rights of others, cyber security risks or potential breaches of data security; and (18) other risks and uncertainties described in FirstMark’s registration statement on Form S-1 and Annual Report on Form 10-K, as amended from time to time, for the fiscal year ended December 31, 2020 and its subsequent Quarterly Reports on Form 10-Q, and in the Form S-4 filed by Starry Holdings. These risks and uncertainties may be amplified by the COVID-19 pandemic, which has caused significant economic uncertainty. Starry, Starry Holdings and FirstMark caution that the foregoing list of factors is not exclusive or exhaustive and not to place undue reliance upon any forward-looking statements, including projections, which speak only as of the date made. None of Starry, Starry Holdings or FirstMark gives any assurance that Starry, Starry Holdings or FirstMark will achieve its expectations. None of Starry, Starry Holdings or FirstMark undertakes or accepts any obligation to publicly provide revisions or updates to any forward-looking statements, whether as a result of new information, future developments or otherwise, or should circumstances change, except as otherwise required by securities and other applicable laws.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20220103005247r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjIwMTAzMDA1MjQ3cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=b3838f95a36418dce6681e9bd3888fe8e157a169629b2d358a2aafd418027d959811377f2bb398ef537328f649b10f0d48a1560bd4b50c93a76516ae21463741\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20220103005247/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220103005247/en/</a></span></p><p>\n<b>Investors for Starry and Starry Holdings: \n</b><br/><a href=\"mailto:investors@starry.com\" data-type=\"email\" translate=\"no\">investors@starry.com</a>\n</p><p>\n<b>Investors for FirstMark: \n</b><br/>Eric D. Cheung\n<br/><a href=\"mailto:eric@firstmarkcap.com\" data-type=\"email\" translate=\"no\">eric@firstmarkcap.com</a>\n</p><p>\n<b>Media: \n</b><br/>Mimi Ryals, Starry\n<br/><a href=\"mailto:mryals@starry.com\" data-type=\"email\" translate=\"no\">mryals@starry.com</a><br/><a href=\"mailto:press@starry.com\" data-type=\"email\" translate=\"no\">press@starry.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2022</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: MA-STARRY</p></div>"}