{"date": "2021-12-02 14:27:15.687000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MIMI'S ROCK CORP (\"MIMI-V\")\n- Expansion into United Arab Emirates will put Mimi's Rock Brands\n- into Marketplaces across the Middle East\n\n     Mimi's Rock Corp., (the \"Company\") announced its plan to expand into\nthe Middle East through a new partnership with UltraPharma, a licensed\npharmaceutical distribution company located in Dubai, United Arab Emirates\nreaching more consumers with top brands Dr. Tobias health supplements and\nskin care All Natural Advice and Maritime Naturals.\n\n     UltraPharma's multichannel marketing and distribution network enables\ncustomers in the Middle East to access and purchase a wide range of\nproducts offered by Mimi's Rock. In the past decade, the Middle Eastern\nmarket demonstrated strong growth in health-conscious consumers who are\nlooking for high quality, authentic vitamins, supplements and beauty\nproducts. UltraPharma has over 25 years of experience in the UAE and are\nrenowned for using tailored content that speaks the language of Mimi's Rock\naudience. Through UltraPharma's relationship with top eCommerce channels -\nAmazon, Noon, Mumzworld and FITAMINAT - Mimi's Rock's inventory will\nimmediately reach a wide audience in preparation for 2022 goals.\n\n     Mimi's Rock's first shipment of Dr. Tobias health supplements will\nreach the United Emirates in time for holiday shopping and will be sold\nonline through multiple marketplaces at the onset to meet the demands of\nshoppers across the country. Followed by All Natural Advice and Maritime\nNaturals to be available by the new year.\n\n     \"Expanding Mimi's Rock proprietary supplement, nutraceutical and\nbeauty care product brands into new markets is a top strategic priority,\"\nsaid David Kohler, Chief Executive Officer at Mimi's Rock. \"We are\nconfident our brands are well positioned to meet consumer demands in the\nUnited Arab Emirates. With top rated health supplements and beauty care\nproducts, we look forward to introducing them to top quality products for\nwhich Mimi's Rock brands are known.\"\n\n     Mimi's Rock's mission is to help people be the best version of\nthemselves and expansion into markets such as China will support the health\nand wellness of people everywhere.\n\n     About UltraPharma:\n\n     UltraPharma is a Ministry of Health licensed pharmaceutical\ndistribution company located in Dubai, United Arab Emirates. UltraPharma's\njourney began in 1996 in Abu Dhabi as UltraMed; specializing in\ndistribution of medical consumables and safety products for hospitals,\nlaboratories and blood banks. In 2012, UltraMed expanded its operation to\nreach the wider Middle Eastern market through the inception of UltraPharma\nin Dubai. In 2019, UltraPharma launched its eCommerce site FITAMINAT, which\noffers high quality health and beauty products and over two dozen brands -\nincluding Sambucol, Biolgan, and Haliborange.\n\n     About Mimi's Rock Corp.:\n\n     Mimi's Rock Corp. is an online dietary supplement and wellness company\nwhich market and sells its products under the Dr Tobias, All Natural Advice\nand Maritime Naturals brand names. The Dr Tobias brand features over 30\nproducts, including the top-selling Colon 14-Day Cleanse and the #1 selling\nOmega 3 Fish Oil on Amazon.com. All Natural Advice and Maritime Naturals\nproducts focus on skin and beauty care. Products sold under the All Natural\nand Maritime Naturals brand names are made in Canada and registered with\nHealth Canada and under the EU Cosmetics Act. All Natural Advice has been\nfeatured on BNN as a top selling skincare brand in Canada, and has been\nrated the #1 Beauty Brand on Amazon Canada for the past four years.\n\n     Forward-Looking Statements\n\n     This news release contains forward-looking statements and\nforward-looking information within the meaning of applicable securities\nlaws. Often, but not always, forward-looking statements can be identified\nby the use of words such as \"plans\", \"expects\", or \"does not expect\", \"is\nexpected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\",\n\"anticipates\" or \"does not anticipate\", or \"believes\", or describes a\n\"goal\", or variation of such words and phrases or state that certain\nactions, events or results \"may\", \"could\", \"would\", \"might\" or \"will\" be\ntaken, occur or be achieved. Please refer to the 2020 Annual Financial\nStatements for more details on the Company's calculation of EBITDA and\nadjusted EBITDA. All forward-looking statements reflect the Company's\nbeliefs and assumptions based on information available at the time the\nstatements were made. Actual results or events may differ from those\npredicted in these forward-looking statements. All of the Company's\nforward-looking statements are qualified by the assumptions that are stated\nor inherent in such forward-looking statements, including the assumptions\nlisted below. Although the Company believes that these assumptions are\nreasonable, this list is not exhaustive of factors that may affect any of\nthe forward-looking statements.\n\n     Although the Company has attempted to identify important factors that\ncould cause actual actions, events or results to differ materially from\nthose described in forward-looking statements, there may be other factors\nthat cause actions, events or results not to be as anticipated, estimated\nor intended. There can be no assurance that forward-looking statements will\nprove to be accurate, as actual results and future events could differ\nmaterially from those anticipated in such statements. Accordingly, readers\nshould not place undue reliance on forward-looking statements. All\nforward-looking information contained in this press release is given as of\nthe date hereof and is based upon the opinions and estimates of management\nand information available to management as at the date hereof. The Company\ndisclaims any intention or obligation to update or revise any\nforward-looking statements whether as a result of new information, future\nevents, or otherwise, except in accordance with applicable securities laws.\n\n     Please visit www.mimisrock.com or www.sedar.com for the Company's\nrecent filings.\n\n     Neither the TSX Venture Exchange nor its Regulation Services Provider\n(as that term is defined in the policies of the TSX Venture Exchange)\naccepts responsibility for the adequacy or accuracy of this news release.\n\n Contact Information:\n\nDavid Kohler - CEO, 905-330-5081, Dkohler@mimisrock.com; Bill Mitoulas -\nInvestor Relations, 416-479-9547, billm@venturenorthcapital.com\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133500162.MNPRE2133501002-05385520211202</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}