{"date": "2021-12-06 02:42:50.106000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>At AWS re:Invent, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company, announced three new database capabilities that make it easier and more cost efficient for customers to scale and run the right databases for their job. Today?s announcements introduce a new managed database service for business applications that allows customers to customize the underlying database and operating system, a new table class for Amazon DynamoDB designed to reduce storage costs for infrequently accessed data, and a service that uses machine learning to better diagnose and remediate database-related performance issues. Together, these innovations make it easier and more cost effective for customers to manage data at scale.</p><p>As a growing number of applications need to work with petabytes?or even exabytes?of data with low latency and high performance, a one-size-fits-all database no longer meets the needs of customers who require highly available, reliable, and performant ways to leverage and manage data at scale. To meet these demands, more and more customers are looking to choose the right database for their unique needs. AWS offers the broadest and deepest selection of specialized database engines, including DynamoDB for key-value databases, Amazon Neptune for graph databases, Amazon ElastiCache and Amazon MemoryDB for Redis for in-memory databases, Amazon DocumentDB for document databases, Amazon Keyspaces (for Apache Cassandra) for wide-column databases, Amazon Timestream for time series databases, and Amazon Quantum Ledger Database (Amazon QLDB) for ledger databases. AWS is also the best place to run open-source databases, which is why more than 100,000 customers choose to run their MySQL and PostgreSQL-compatible databases on Amazon Aurora and enjoy the performance and availability of the highest-grade commercial databases at one-tenth the cost. Many customers also choose to run commercial databases on AWS to take advantage of the superior scalability, security, and elasticity AWS provides. Amazon Relational Database Service (Amazon RDS) offers a fully managed relational database service that makes it easy to set up, operate, and scale Oracle and Microsoft SQL Server databases in the cloud. When it comes to databases, AWS offers the right tools for the job, with more than 15 purpose-built database engines that provide customers with high availability, performance, reliability, and security for a wide range of use cases. The three new database capabilities announced today deliver significant new features to give customers even more choice and higher performance at lower costs.</p></div><div class=\"tr-npp-body\"><p>?Customers have told us they want databases that are optimized for their most important use cases to deliver flexible, scalable, and reliable user experiences without worrying about the resource-intensive burden of managing infrastructure or incurring excess costs,? said Raju Gulabani, Vice President of Databases and Analytics at AWS. ?With today?s announcements, we?re excited to provide customers with even more flexibility and choice to easily improve database performance, optimize cost, and power their most business-critical applications. No one else in the industry can match the depth of capability and breadth of selection in databases offered by AWS, and we?re nowhere close to being done innovating for our customers.?</p><p>Amazon RDS Custom gives customers a managed database service for business applications that require customization of the underlying database and operating system</p><p>Customers who want to run commercial databases like Oracle and Microsoft SQL Server in the cloud choose Amazon RDS because it is easy to set up, operate, and scale. With Amazon RDS, customers no longer need to worry about time-consuming administrative tasks like provisioning capacity, scaling, and backing up their data. However, some business applications require customization to their underlying Oracle and Microsoft SQL Server database environment and operating system (e.g. Microsoft Dynamics AX, Microsoft SharePoint, and Oracle PeopleSoft). Today, customers often run these applications in a self-managed environment (e.g. on Amazon EC2 or on-premises) so they can have full control over the underlying database environment and operating system. While self-managed deployments are highly configurable, customers must spend time on administrative tasks like hardware provisioning, database setup, patching, and backups. What customers running applications that require database and operating system customization want instead is to automate these undifferentiated administrative tasks to make it easier to run these applications on AWS.</p><p>Amazon RDS Custom automates the setup, operation, and scaling of the Oracle and Microsoft SQL Server databases that are tightly integrated with common business applications, while allowing customization to the database and underlying operating system these applications require. With Amazon RDS Custom, customers running these types of business applications no longer need to worry about time-consuming administrative tasks like provisioning and scaling hardware, database setup, patching, and backups. Customers can use Amazon RDS Custom to configure their database environment and underlying operating system to modify settings, install custom patches, and integrate third-party software to meet the requirements of their business applications (e.g. custom database minor versions, third-party security and diagnostic software, or specific file system configurations). Amazon RDS Custom automatically monitors the database environment and operating system to detect user-initiated configurations that impact the ability of Amazon RDS Custom to manage the database. If an issue is detected, Amazon RDS Custom will attempt to automatically resolve the issue.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}