{"date": "2022-02-15 13:22:13.076000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>GOOD NATURED PRODUCTS INC (\"GDNP-V\")\n- Annual Letter to Owners Covers 2021 Highlights and Outlook for 2022\n\n     good natured Products Inc. (the \"Company\" or \"good natured(R)\") a\nNorth American leader in plant-based products and packaging, released its\nannual letter to shareholders from Paul Antoniadis, the Company's CEO.\n\n     Dear Owners,\n\n     As always, I'd like to start by expressing my sincere appreciation for\nyour commitment to good natured(R) and trusting us to be stewards of your\nsustainable investing dollars. This is your company, and on behalf of our\n200+ employees I want to personally thank you for your trust and\npartnership on our path to building North America's leading earth-friendly\nproduct company.\n\n     With ESG investment opportunities becoming more common, we hope our\n7-year track record of delivering on our growth strategy has made us - and\nwill continue to make us - stand out from the crowd. Helping our customers\nachieve their sustainable development goals remains at the core of what we\ndo, and your capital contribution plays an invaluable role in creating\npositive economic, environmental, and social impact for all our\nstakeholders and the families who depend on us.\n\n     We're kicking off 2022 with the same courage and conviction to\naggressively grow our topline revenue, both organically and through\nacquisition, with targeted gross margins in the 21% to 28% range and annual\nimprovements in EBITDA. We anticipate continued global supply chain\ndisruptions, external inflation, and fluctuation in our market valuation in\n2022 (both up and down). Our keen focus on execution, providing great\nservice, and managing operational excellence is our \"superpower\" and path\nto success. I've been so impressed with our team's demonstrated ability to\nstay focused on our strategic objectives, adapt quickly and continue to\nachieve our operational targets.\n\n     We passionately believe that the key to making annually renewable,\nplant-based materials truly mainstream must be about more than just the\ningredients. We're in the business of making better everyday products(R),\nwhich means they're designed to deliver great performance and do less\nenvironmental harm, while also making it easy and affordable for customers\nto make the switch. Every year, we assess what initiatives will be most\nmeaningful in the current market conditions to grow and maintain a strong\ncompetitive advantage. In 2022, we anticipate this to include continued and\npurposeful expansion of our sustainable product and service portfolio,\nalong with key technology investments to enhance our operational\ncapabilities and deploy predictive tools to deliver \"anticipatory service\"\nto our customers.\n\n     Our strategic acquisitions in 2020 and 2021, along with capital\ndeployed toward high-speed manufacturing technology, are solidifying good\nnatured(R) as a market leader with robust supply chain capabilities in\nCanada and the United States. Investments in robotics and manufacturing\nautomation will also increase high value, skilled employment opportunities\nin our local communities. These initiatives position the Company to deliver\nour 2022 plan by enhancing manufacturing capability for our existing\ncustomers and paving the way to add new organic customers to deliver our\nrevenue growth objectives. Many prospective customers are urgently seeking\nto re-shore their supply chain to de-risk global disruptions, creating a\nsubstantial pool of additional addressable markets for the Company in the\nimmediate future.\n\n     The year ahead will not be without challenges and unforeseen\ncircumstances. Economic and operating conditions are far from normal\n(although we all might be actively re-examining what \"normal\" is). Our team\nloves taking on new challenges and takes an unconventional approach to lean\ninto emerging opportunities when things are tough, so we're incredibly\nenergized for what's coming in 2022!\n\n     2021 - The Year in Review\n\n     This past year was truly one of the most challenging and rewarding\noperating environments I've experienced in my professional career. It was\nhumbling to witness our team's commitment to repeatedly overcoming\nobstacles caused by persistent external inflationary pressures and supply\nchain disruptions to achieve record-breaking annual revenue. We completed\nour largest acquisition, delivered strong organic customer growth, launched\na broad series of new sustainable products, invested in high-speed\nmanufacturing technology, and stayed on top of our cash, inventory and\nproduction requirements despite constantly fluctuating macro and\nmicro-economic conditions,\n\n     As noted in our press release dated January 20, 2022, we ended the\n2021 fiscal year with fantastic momentum and anticipated annual revenue\ngrowth of 255% to 270%, for the year ended December 31, 2021 (\"FY2021\")\ncompared to the year ended December 31, 2020 (\"FY2020\"); plus, FY2021\nrevenue expected to range between $59.3 million to $61.3 million. Variable\ngross margin, a non-GAAP measure1, for FY2021 is anticipated between 30%\nand 32%, while gross margin for FY2021 is estimated to land between 24% and\n26% for the full year. These are preliminary and unaudited revenue and\ngross margin estimates prepared by the Company for FY2021.\n\n     Our strategy remains centered on organic initiatives contributing 50%\nof our revenue growth and acquisitions delivering the remaining 50%. Our\nresults in 2021 are more heavily weighted to acquisition revenue due to the\ntiming of completing two major acquisitions - IPF in December 2020 and\nEx-Tech in May 2021. I don't want to let the strong execution of our\nacquisition strategy overshadow the tremendous success achieved on the\norganic side. By December 2021, we'd more than doubled the number of\nactive, recurring business customers compared to the 2020 year end, and our\ncustomer mix has become larger and more diverse than any other time in the\nhistory of the Company. Compared to any prior period, we're less reliant on\nany one customer to deliver our growth numbers, and have a healthy, highly\nvaried pipeline of future opportunities that makes us more resilient in\nunstable market conditions.\n\n     Our 2021 share price performance can only be described as a roller\ncoaster, and we appreciate those who've had the stomach for the full ride!\nAfter a very strong start to the year and reaching a record market\ncapitalization of $400+ million in February 2021, our market capitalization\nwas down ~12% at year end 2021 versus year end 2020. As owners ourselves,\nwith management and insiders representing 23% of shares outstanding, we're\nkeenly focused on creating both positive environmental impact and long-term\neconomic value. Despite the fluctuations of 2021, our 3-year market\ncapitalization has grown from approximately $10 million at the end of 2018\nto approximately $172 million at the end of 2021, representing an increase\nof over 1,600%. Our liquidity has also improved significantly, with average\ndaily volume in 2021 having increased over 1,200% from 2018.\n\n     We're also very pleased to have increased our analyst and research\ncoverage to a total of seven firms in 2021, including the first from a\nSchedule I bank in Canada. We were also able to attract several new\ninstitutional investors and family offices to invest in the company's\nstock. This has broadened our base of long-term investors\n\n     2021 Highlights\n\n//st\n\n  * Acquired Ex-Tech Plastics Inc., a US manufacturer of high quality,\nrigid plastic sheets with almost 40 years of operations. The acquisition\nsignificantly increased our capacity to produce plant-based rollstock that\nwe use to make our rigid thermoformed packaging, added 105 customers, and\nFY2020 revenue of approximately $33 million, adjusted EBITDA2 of US$2.6\nmillion, and net income of US$1.5 million.\n  * Announced commencement of shipments to our largest organic commercial\ncustomer, a national US food producer, expected to generate USD$13 million\nin its first year,\n  * Successfully completed a $17.25 million convertible debenture financing\nand a $35.8 million senior credit facility, inclusive of a $10 million\nuncommitted accordion, with National Bank, materially reducing the blended\ninterest rate paid on our long-term debt and principal repayments due over\nthe next three years.\n  * Announced partnership with Jones Healthcare Group, a market leader in\nadvanced packaging and medication dispensing solutions, to focused on\nexpanding sustainable packaging solutions. Jones' blister packaging\nproducts will now be made with good natured(R) Bio-PET, a food-safe,\ncurbside recyclable bioplastic material.\n  * Purchased high-speed manufacturing equipment that is anticipated to be\noperational in Q1 of 2022 and grow annual production capacity at our IPF\nfacility by 50% to 33 to 35 million pounds.\n  * Purchased high-speed thermoforming manufacturing technology that is\nanticipated to be installed and operational at our Shepherd facility in Q2\nof 2022.\n  * Announced good natured(R) as recipient of Deloitte's Clean Technology\naward, a new award category in the Technology Fast 50 program that\nrecognizes Canada's top clean innovators. The Company was also named to\nDeloitte's North American Technology Fast 500 category, recognizing our\n460% revenue growth between 2017 and 2020,\n  * Along with a multitude of plant-based food packaging products, launched\na line of plant-based Bin Bags, Zipper Bags and retail-packed Compostable\nTableware, expanding our general merchandise assortment for\ndirect-to-consumer and in-store retail locations across North America.\n  * Ranked among the TSX Venture Exchange's top 50 best performing\ncompanies. Presented by the TSX Venture Exchange, good natured(R) was\nranked 4th in the Clean Technology &amp; Life Sciences sector based on three\nequally weighted criteria: market capitalization growth, share price\nappreciation and trading volume amount,\n  * As part of the organic growth segment, added Better Bites Bakery, an\nAustin, Texas-based producer of plant-based treats free from the top 8\nallergens with nationwide US distribution to retailers such as Kroger,\nWhole Foods Market, Super Target, Costco and H-E-B.\n  * Launched Canada's first compostable and microwavable plant-based\ntake-out containers in response to Canada's proposed single-use plastic ban\nas well as Canada and US Plastics Pact guidelines.\n  * Highlighted new customer acquisitions in fast growing emerging\nindustries. such as meal kits (Simple Feast and Vegano), high-tech growers\n(Heron Farms and ColdAcre).\n  * Launched our plant-based Bio-PET material, containing 20-30%\nplant-based content, up to 50% recycled content and readily accepted in\ncurbside recycling programs across North America.\n  * Successfully completed and upsized $23.1 million bought deal short form\nprospectus financing in March 2021.\n\n//et\n\n     2022 - A Look at What's Next\n\n     Our 2022 plan stays true to our long-term strategy of delivering\naggressive revenue growth, gross margins within our targeted range and\nannual improvements in EBITDA, while concurrently fueling positive\nenvironmental impact and growing value for our owners.\n\n     The acquisition of Ex-Tech in May 2021 added approximately $33 million\nin trailing 12-month revenue (as at December 2020) and essentially doubled\nthe size of the Company. Annualized revenue from this acquisition and\nseveral organic customers already puts us in a strong position to\nsuccessfully deliver another year of very strong revenue growth. Any\npotential future acquisitions or additional organic growth from our active\nsales pipeline will be incremental.\n\n     Executing our 2022 plan will also result in a re-balancing of our\nrevenue mix by business group. With the recent IPF and Ex-Tech\nacquisitions, our Industrial business group became a larger percentage of\nour total revenue. As we deploy more manufacturing capability toward our\nown operations, we anticipate our packaging, general merchandise,\ncommercial/business supplies, and associated services will contribute\nhigher percentages of overall revenue mix in 2022.\n\n     Our 2021 capital investments in high-speed manufacturing and\nautomation technology will position us well to support our planned revenue\ngrowth in 2022. We expect this equipment to be fully operational over the\ncourse of the first and second quarter of 2022 and anticipate additional\ninvestments in manufacturing, robotics, and operational technology in 2022.\nThese strategic investments will drive operational efficiencies, position\nus as an emerging leader in domestic, high-tech manufacturing of\nsustainable products and create the pathway to continued revenue growth and\nEBITDA improvements in 2023.\n\n     Our 2022 plan also includes continued progress toward upgrading our\ntechnology platforms and the creation of real-time access to financial\ndata, metrics and business insights. To that end, good natured(R) will be\nimplementing a new ERP (Enterprise Resource Planning) system that is\nexpected to be fully functional in 2023. This system will provide\ncomprehensive access to AI-enabled planning and decision-making tools\nacross the Company's growing number of locations and be deployed as part of\nthe Enterprise tech stack with any future acquisitions.\n\n     We remain committed to driving alignment between our owners, our\nboard, and our operating team members. Our unique, \"good natured\" culture\nplays a big role in helping us achieve a higher level of cohesion and\ncommon purpose, along with strong differentiation against competitors.\nWe're here to deliver long term economic value as owners and make a\npositive contribution to the environment, and our team is rewarded\naccordingly to keep us moving together toward these collective goals.\n\n     Thank you for your dedication, passion and support that have enabled\nus to execute our strategic goals in 2021 and position the Company for\nsuccess in 2022 and beyond. For those of you who are not on our regular\ncommunications list, I encourage you to subscribe to our investor\nnewsletter at the link below to receive updates about our 2022 progress as\nit\nhappens:https://investor.goodnaturedproducts.com/contact-us/newsletter-subs\ncription/\n\n     Sincerely,\n\n     Paul Antoniadisgood natured Products Inc.CEO &amp; Executive Chair\n\n     *****\n\n     The good natured(R) corporate profile can be found at:\ninvestor.goodnaturedproducts.com\n\n     *****\n\n     About good natured Products Inc.good natured(R) is passionately\npursuing its goal of becoming North America's leading earth-friendly\nproduct company by offering the broadest assortment of eco-friendly options\nmade from plants instead of petroleum. We're all about making it easy and\naffordable for business owners and consumers to switch to better everyday\nproducts(R) made from renewable materials and free from chemicals of\nconcern.\n\n     Part of the sustainable consumer goods market, good natured(R) offers\nover 400 products and services through wholesale and retail channels,\nincluding our own e-commerce stores. From plant-based home organization\nproducts to compostable food containers, bioplastic industrial supplies and\nmedical packaging, we're focused on delivering a great customer experience\nto make more plant-based products readily accessible to more people as the\npath to deliver meaningful environmental and social impact.\n\n     For more information: goodnaturedproducts.com\n\n     Neither TSX Venture Exchange nor its Regulation Services Provider (as\nthat term is defined in the policies of the TSX Venture Exchange) accepts\nresponsibilities for the adequacy or accuracy of this release.\n\n     Non-GAAP financial measures\n\n     We have included in this press release certain non-GAAP measures that\nare used to evaluate the performance of business, including adjusted\nEBITDA. As non-GAAP measures generally do not have a standardized meaning,\nthey may not be comparable to similar measures presented by other issuers.\nAdjusted EBITDA does not have a generally accepted industry definition.\n\n     Cautionary Statement Regarding Forward-Looking Information\n\n     We have included in this press release certain non-GAAP financial\nmeasures and ratios that provide what management believes are meaningful\ncomparisons of the Company's performance, including adjusted EBITDA and\nvariable gross margin.\n\n     In this release, variable gross margin is gross margin excluding fixed\nproduction costs such as depreciation, repairs and maintenance, utilities\nand similar overhead items. The use of variable gross margin by management\nallows for evaluation of the core aspects of the Company's profit margin as\ncertain fixed production costs that are outside the Company's control are\nexcluded. Management believes variable gross margin provides an accurate\nmeasure of the Company's product margin contribution by removing fixed\nfactory overhead. Variable gross margin provides deeper insight into\nnormalized product margins related to variable material input costs,\ninbound freight and labour costs associated with producing the goods being\nsold. Variable gross margin also removes gross margin percentage\nfluctuations due to changes in revenue from factors such as mix of\ninsourced versus outsourced manufacturing to respond to specific customer\nrequirements for multiple-facility production, depreciation from facility\ncapital investments and the addition of manufacturing facility acquisitions\nwith factory overhead charges.\n\n     In this release, adjusted EBITDA is earnings before interest and\nfinance costs, taxes, depreciation and amortization, other non-cash items\nand one-time gains and losses. The use of adjusted EBITDA by management\nallows for evaluation of principal business activities as certain non-core\nitems such as interest and finance costs, taxes, depreciation and\namortization, and other non-cash items and one-time gains and losses are\nremoved. The Company believes that, in addition to conventional measures\nprepared in accordance with IFRS, certain investors and other stakeholders\nalso use this non-IFRS measure as information to evaluate the Company's\noperating and financial performance. Adjusted EBITDA provides an indication\nof the Company's continuing capacity to generate income from operations\nbefore considering the Company's financing decisions, share compensation,\ncosts of amortizing capital assets and other significant or unusual items.\nWith the Company being keenly focused on revenue growth, adjusted EBITDA\nprovides management a valuable, normalized metric for the evaluation of\nongoing operating performance, strategic decisions and future operating\nplans.\n\n     As non-GAAP financial measures or ratios generally, including variable\ngross margin and adjusted EBITDA do not have a standardized meanings under\nthe financial reporting framework used to prepare the Company's financial\nstatements, they may not be comparable to similar measures presented by\nother issuers.\n\n     The following table provides a reconciliation of preliminary and\nhistoric gross margin to preliminary and historic variable gross margin\n(expressed in thousands of dollars):\n\n//st\n\n                                           FY2021\n\n                                           Low end    Upper end\n\n       Cost of product revenue\n\n       Variable cost of product            (41,600)   (40,400)\n\n       Variable gross margin               18,700     19,900\n\n       Factory overhead and depreciation   (4,200)    (4,200)\n\n       Gross margin                        14,500     15,700\n\n       Revenue                             59,300     61,300\n\n//et\n\n     The following table provides a reconciliation of Ex-Tech's FY2020 net\nincome to adjusted EBITDA:\n\n//st\n\n                                            Year end\n\n                                            December 31, 2020\n\n       Net Income                          $1,378\n\n       Forgiveness of loan                 (936)\n\n       Depreciation and amortization       903\n\n       Interest Expense                    259\n\n       Rent                                444\n\n       Other normalizing adjustments       524\n\n       Adjusted EBITDA profit              $2,572\n\n       Adjusted EBITDA as a % of Revenue   10%\n\n//et\n\n     Cautionary Statement Regarding Forward-Looking Information\n\n     Certain statements in this release are not based on historical facts\nand constitute forward-looking information, as defined in securities laws.\nForward-looking information is not a promise or guarantee of future\nperformance but is only a prediction that relates to future events,\nconditions or circumstances or the Company's future results, performance,\nachievements or developments and is subject to substantial known and\nunknown risks, assumptions, uncertainties and other factors that could\ncause the Company's actual results, performance, achievements or\ndevelopments in its business or industry to differ materially from those\nexpressed, anticipated or implied by such forward-looking information.\n\n     Forward-looking statements in this release include information\nregarding preliminary financial results, future gross margins, the\nCompany's 2022 plans, the potential benefits expected from the Company's\nprevious investments and plans to expand our business organically or\nthrough acquisitions contained in this press release may constitute\nforward-looking information within the meaning of securities laws. Readers\nare cautioned not to place undue reliance upon any such forward-looking\nstatements, which speak only as of the date they are made.\n\n     The forward-looking statements in this release are based on certain\nfactors and assumptions regarding expected growth, results of operations,\nperformance and business prospects and opportunities. Specifically,\nmanagement has assumed that the Company's performance will meet\nmanagement's internal projections. While management considers these\nassumptions to be reasonable based on information currently available to\nus, they may prove to be incorrect. By their nature, forward-looking\nstatements involve known and unknown risks, uncertainties and other factors\nwhich may cause our actual results, performance or achievements, or other\nfuture events, to be materially different from any future results,\nperformance or achievements expressed or implied by such forward-looking\nstatement. The reader should not place undue importance on forward-looking\ninformation and should not rely upon this information as of any other date.\nAll forward-looking information contained in this news release is expressly\nqualified in its entirety by this cautionary statement.\n\n     Other than as required under securities laws, we do not undertake to\nupdate this information at any particular time.\n\n     The estimates of FY2021 revenues and variable gross margins, as well\nas the estimated yearly revenues from the Company's largest organic\ncommercial customer, a national US food producer, contained in this release\nwere approved by management on January 19, 2022 and October 11, 2021\nrespectively.\n\n//st\n\n  1 For more information regarding non-GAAP measures included in this news\nrelease, please refer to \"Non-GAAP financial measures\" below.\n\n  2 For more information regarding non-GAAP measures included in this news\nrelease, please refer to \"Non-GAAP financial measures\" below\n\n//et\n\n Contact Information:\n\nFor further information: Investor Contact: Spencer Churchill, Investor\nRelations, 1-877-286-0617 ext. 113, [email protected]\n\nTel   : 604-566-8466    GOOD NATURED PRODUCTS INC\nWWW   : <a href=\"https://www.goodnatured.ca\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.goodnatured.ca</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204500050.MNPRE2204500915-05211320220215</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}