{"date": "2021-11-12 15:35:01.307000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3482.05, "close": 3525.15}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Auckland Council will be out of pocket to the tune of $80 million over the coming decade after Amazon Studios' abrupt departure of its Lord of the Rings production from the city.</p><p>Internal council documents have highlighted MIQ, lockdowns and low-vaccination rates as \"contributing factors\" that might explain \"why Amazon terminated\" its contract.</p></div><div class=\"tr-npp-body\"><p>The Herald has obtained documents under the Official Information Act from Auckland Unlimited — the Auckland Council CCO which owns the film studios Amazon was filming at — that outline causes for the Middle Earth production leaving Kiwi shores.</p><p>On August 13, Amazon Studios announced it would be moving production of season 2 of the multibillion-dollar TV show to the UK.</p><p>The \"hugely disappointing\" news blindsided the Government and Auckland Council who were only informed of the decision a day before it was made public. Amazon enforced a contractual clause available to it to terminate rent of the Auckland Film Studios (AFS) in Kumeu and Henderson, and Kelly Park Studio in Wainui, in August 2022 rather than in 2029.</p><p>As Auckland Council's chair of their finance and performance committee, Desley Simpson, confirmed, this \"sadly\" lost the city a nine-year contract worth $80m-$60m into AFS's budget, and $20m into Auckland Unlimited's.</p><p>\"Amazon agreed to a long-term rent of our film infrastructure until 2029 subject to a break clause in August 2022, which sadly they have now exercised,\" Simpson told the Herald.</p><p>\"Now that won't be realised, Auckland Unlimited and AFS will now need to look to fill the revenue gap from August next year. I expect them to do this by contracting other film productions both domestically and internationally. I'm told there is a strong demand globally for studio infrastructure.\"</p><p>Among the documents obtained by the Herald, a report delivered to the board of Auckland Unlimited on August 25 entitled \"Auckland Film Studio Network [redacted] Termination and its Impact\" outlined a need to get rid of MIQ urgently for new film productions to take up these studio vacancies.</p><p>\"Contributing factors in Amazon's decision may have included uncertainties over New Zealand's vaccination rates, risk of lockdowns and having to navigate MIQ for cast and crew,\" the report said.</p><p>\"These are issues being faced by other international productions. There may also have been other factors relating to New Zealand's size and capacity to host such an ambitious project.\"</p><p>Under the heading 'What the Market is Saying', in reference to consultation with the film industry, the Auckland Unlimited report narrows in on the significant MIQ disruption to studios.</p><p>\"Attention needs to be given swiftly to: Advocating a clear path forward in relation to MIQ/border issues for screen, especially a request for class border exemptions to ensure timely and certain allocations of MIQ places for the very small number of overseas cast and crew that are required to unlock significant local employment and revenues.\"</p><p>Even despite the prospect of an MIQ bypass soon, the report estimates \"it will be challenging in future to meet the forecast revenues attributable to Amazon\" and that in a Covid-19 climate lucrative overseas film productions will be harder to attract to Auckland.</p><p>\"Without the impact of Covid-19, we would have productions flooding in to replace Amazon immediately. This will not be the case,\" the report says.</p><p>When questioned if there was more the Government could have done to help Amazon navigate MIQ, Economic and Regional Development Minister Stuart Nash said there had been 271 border exceptions for LOTR: 177 cast and crew, plus 94 family members.</p><p>\"Amazon was very clear at the time that it was grateful to the Government and agencies for their 'tremendous collaboration', and that its decision was purely commercial, based on a strategic plan to expand its studio footprint in London,\" Nash said.</p><p>\"It thanked the Government and people of New Zealand for their 'hospitality and dedication'.\"</p><p>Nash said as of July, 2021, there had been 694 border exemptions approved for international screen sector.</p><p>He cited the existing Screen Production Grant 20 per cent rebate on expenditure — which LOTR had access to before it exited New Zealand — as an enticement to international productions to replace Amazon.</p><p>The Auckland Unlimited report does identify \"encouraging signs\" that international productions are looking at Auckland studios in 2022 \"with solid enquiries for the first quarter at the time of writing\".</p><p>But it adds: \"However, there are real impediments to securing them — MIQ and low vaccination rates raising the likelihood of repeat lockdowns.\"</p><p>The report does reiterate the official reasoning from Amazon that its decision to move LOTR production from NZ \"was to align with its strategy of expanding its production footprint and investing in studio space across the UK — where many of its TV series and films are already based.\"</p><p>However, local film producers are open about international productions choosing other locations because of our MIQ system.</p><p>Screentime New Zealand chief executive Philly de Lacey says her production company had two \"really good\" US producers they had worked with before who decided not to bring productions to NZ since the pandemic's outset \"because it was too hard\".</p><p>De Lacey describes New Zealand's loss of Amazon, both financially and employment wise, as \"phenomenal, it's huge\".</p><p>\"I'm really hopeful, honestly, that MIQ finishes soon, and that self-isolation becomes a possibility because realistically it's the only way to have surety of knowing you can get the workers in that you need,\" she said.</p><p>\"The comfort for other territories coming here is not going to get back to 100 per cent normal until they're confident that we can get our people in.</p><p>\"It is hard to negotiate deals when you don't know exactly what the outcomes are. I think we're very quickly seeing the rest of the world is very quickly moving on and opening up and I do worry that the longer this drags on, if people find good production homes in other territories that's where they'll stay.\"</p><p>In September, the Herald revealed Amazon had made a pitch to the Government in 2020 to sidestep the usual MIQ process by securing hotels, holiday homes and rental properties to be used for their own private managed isolation.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 The New Zealand Herald. All rights reserved.</p></div>"}