{"date": "2022-02-02 02:34:53.949000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>In order to provide basic services to more towns in the Amazon, the Ministry of Housing, Construction and Sanitation (MVCS) completed the works to install the drinking water and sanitation service in the native communities of San Juan de Puritana and San Ram?n, district of Nauta, Loreto, which benefit more than 370 citizens of both jurisdictions.</p><p>Through its National Rural Sanitation Program (PNSR), the MVCS implemented in these two projects the innovative rainwater harvesting technology to provide families with drinking water. Likewise, for the sanitary disposal of excreta, composting basic sanitation units (UBS) were installed with the innovation of mobile trays. The MVCS took into account previous interventions and the importance of the local culture to provide improvements to the technology, in order to reduce time and cost, but above all to guarantee the sustainability of water and sanitation services.</p></div><div class=\"tr-npp-body\"><p>The investment destined for the execution of the projects carried out in both communities amounts to an investment of S/ 7,369,741, reported the Minister of Housing, Construction and Sanitation, Geiner Alvarado. In San Juan de Puritana, 60 rainwater harvesting modules and 60 UBS were installed, made up of a toilet, a shower, a sink and a multipurpose sink. The investment for this work was S/ 4,824,410 and 257 people benefited.</p><p>In the case of the community of San Ram?n, where the quality of life of 117 inhabitants was improved, 30 rainwater harvesting modules and 30 UBS were implemented. The investment amounted to a total of S/ 2,545,331.</p><p>With these projects, in charge of the Rural Amazon Program of the PNSR, the beneficiary families already have safe water and a decent bathroom that will reduce the rates of acute diarrheal diseases, as well as parasitosis, in children, adolescents and adults.</p><p>These works have also been possible thanks to the participation of the Apus and presidents of the administrative boards of sanitation services (JASS) since the beginning of the projects. To this is added the comprehensive accompaniment of the MVCS that provided training in water, sanitation, health care and social development of the inhabitants. So much so that San Ram?n was recognized as the most hygienic and clean community at the level of the ?La Cocha San Pablo? micro-basin.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Euclid Infotech Pvt Ltd.</p></div>"}