{"date": "2021-11-10 03:50:01+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>\n                <a href=\"https://www.tenable.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Tenable®, Inc.</a>, the Cyber Exposure company, today announced it has established a local cloud instance for its software-as-a-service (SaaS) solution, Tenable.io®, on Amazon Web Services (AWS), using the AWS Asia Pacific (Mumbai) Region. Hosted in Mumbai, using the local AWS Region increases the scalability and flexibility of Tenable.io for customers in India, offering additional data integrity, availability, and security on top of the already-secure cloud.\n    </p>\n              <p>\n      Organizations in India, including those in highly regulated sectors such as government and banking and financial service institutions (BFSI), have fast-tracked the adoption of cloud-based applications and SaaS models to bridge the gap between a distributed workforce and service delivery. By using Tenable.io hosted on the AWS Region in India, organizations can comply with local data privacy regulations and policies without compromising security, scalability and flexibility.\n    </p>\n              <p>\n      \"As a cloud-first company, we understand both the business benefits of operating in the cloud and the importance of doing so in a secure way,\" said Kartik Shahani, country manager for Tenable India. \"By expanding our Tenable.io support and service in India on AWS, organizations can benefit from the provider's breadth and depth of cloud capabilities while adhering to local data regulations and requirements.\"\n    </p>\n              <p>\n      \"As we expand our footprint to help organizations meet the data sovereignty requirements of their geographic regions, the ability to optimize onshore operating models is vital. Through our collaboration with AWS, and Tenable's track record of automating the deployment of our cloud infrastructure, we have the ability to rapidly create and maintain cloud instances in any region,\" said Manoj Srivastava, vice president of Engineering for Tenable.\n    </p>\n              <p>\n      Tenable.io is a core component of the Tenable portfolio, which uniquely provides the breadth of visibility into cyber risk across IT, cloud, IoT and operational technology (OT) environments and the depth of analytics to measure and communicate cyber risk in business terms to make better strategic decisions. Customers will also be able to leverage Frictionless Assessment to evaluate cloud assets without interruption, quickly detecting new vulnerabilities as their cloud environment changes without ever having to schedule a scan or deploy an agent.\n    </p>\n              <p>\n                <strong>Ends</strong>\n              </p>\n              <p>\n                <strong>About Tenable</strong>\n              </p>\n              <p>\n      Tenable®, Inc. is the Cyber Exposure company. Over 30,000 organizations around the globe rely on Tenable to understand and reduce cyber risk. As the creator of Nessus®, Tenable extended its expertise in vulnerabilities to deliver the world's first platform to see and secure any digital asset on any computing platform. Tenable customers include more than 50 percent of the Fortune 500, more than 30 percent of the Global 2000 and large government agencies. Learn more at <a href=\"https://www.tenable.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.tenable.com</a>.\n    </p>\n              <p>\n                <strong>Contact Information:<br/></strong> Pamela Philip<br/>\n       Tenable<br/><span><a href=\"https://www.tenable.com/cdn-cgi/l/email-protection#b7c3d2d9d6d5dbd2c7c5f7c3d2d9d6d5dbd299d4d8da\" data-type=\"url\" class=\"tr-link\" translate=\"no\">[email protected]</a></span></p>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.tenable.com/press-releases/local-tenable-io-instance-now-available-in-india-on-aws\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Tenable Holdings Inc.</strong> published this content on <strong>10 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>10 November 2021 03:50:01 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Tenable Holdings Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Tenable-Holdings-Inc.</p></div>"}