{"date": "2022-02-17 10:58:11+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3130.21, "close": 3093.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Rewrites first paragraph, adds background, writes through</p><p class=\"tr-by\">By Shivani Tanna and Mrinmay Dey</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Feb 17 (Reuters)</span><span class=\"tr-dl-sep\"> - </span><span class=\"tr-strong\">Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> has reached agreement with Visa Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=V.N\" data-type=\"ric\" data-ric=\"V.N\" translate=\"no\" dir=\"ltr\">V.N</a> to accept its credit cards across its network, ending a standoff between the two that threatened to disrupt e-commerce payments and deal a blow to the U.S.-based payments processor.</span></p><p><span class=\"tr-strong\">Details of the deal were not disclosed but Visa and other payments cards have faced increased pressure about their fees as more shoppers have turned online during the pandemic. The spat had highlighted the growing clout of retailers in the fee battle. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2S91RP\" data-type=\"storyId\" data-story-id=\"nL1N2S91RP\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> </span></p><p><span class=\"tr-strong\">Amazon had said in November it was considering dropping Visa as partner on its U.S. co-branded credit card, after earlier confirming it would stop accepting Visa credit cards in the UK because of high transaction fees. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2S824F\" data-type=\"storyId\" data-story-id=\"nL4N2S824F\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></span></p><p><span class=\"tr-strong\">The agreement announced on Thursday means Amazon customers can continue using Visa credit cards in its stores, the e-commerce group said in a statement.</span></p><p><span class=\"tr-strong\">Neither side said what fees would be levied in future - an issue which came to the fore particularly in Britain after </span>an EU-enforced cap on <span class=\"tr-strong\">card fees </span>is no longer in place following Brexit.</p><p><span class=\"tr-strong\">The dispute between Amazon and Visa in the UK was seen as a bad sign for the card industry by some analysts, who argued it could presage a fight in the much bigger U.S. market.</span></p><p>British lawmakers said l<span class=\"tr-strong\">ast month </span>they planned to scrutinise increases in the fees Visa and Mastercard charge businesses after the country's payments regulator found no evidence to justify the rises. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2TT1FU\" data-type=\"storyId\" data-story-id=\"nL1N2TT1FU\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>L<span class=\"tr-strong\">ast October, Visa began charging 1.5% of transaction value for credit card payments made online or over the phone between the UK and EU, and 1.15% for debit card transactions, up from 0.3% and 0.2%, respectively.</span></p><p><span class=\"tr-strong\">Average credit card processing fees across the industry range between 1.5% and 3.5%, according to analysts.</span></p><p><span class=\"tr-strong\">Retailers have in the past accepted credit card processing charges as an inevitable cost, but that could be changing because of innovations and increased consumer choice in the payments sector.</span></p><p><span class=\"tr-strong\">Credit cards accounted for a third of North American e-commerce spending in 2020, according to payments giant WorldPay, but mobile payment options like Venmo and \"buy now, pay later\" (BNPL) financing plans are gaining ground.</span></p><p><span class=\"tr-strong\">While alternative payments have been growing for years, the pandemic accelerated a downward trend in credit card applications and boosted the popularity of BNPL financing.</span></p><p><span class=\"tr-strong\">Credit cards' share of North American e-commerce spending declined 7% last year, according to WorldPay, while BNPL's share increased 78%.</span></p><p><span class=\"tr-strong\">Other big retailers have in the past settled fee disputes with Visa after announcing they were going to quit taking Visa credit cards in narrow segments of their businesses.</span></p><p><span class=\"tr-strong\">Walmart Inc's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=WMT.N\" data-type=\"ric\" data-ric=\"WMT.N\" translate=\"no\" dir=\"ltr\">WMT.N</a> unit in Canada, for example, said in 2016 it would stop accepting Visa credit cards after being unable to reach agreement on fees. Seven months later the companies said they had settled the matter.</span></p><p><span class=\"tr-strong\">Visa said it was pleased to have reached a broad, global agreement with Amazon.</span></p><p><span class=\"tr-strong\">\"This agreement includes the acceptance of Visa at all Amazon stores and sites today, as well as a joint commitment to collaboration on new product and technology initiatives,\" a Visa spokesperson said in an email.      </span></p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Shivani Tanna and Mrinmay Dey in Bengaluru; Editing by Shailesh Kuber and David Holmes)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:ShivaniJayesh.Tanna@thomsonreuters.com\" data-type=\"email\" translate=\"no\">ShivaniJayesh.Tanna@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: BRITAIN-AMAZON.COM/VISA (UPDATE 3, PIX)</p></div>"}