{"date": "2022-02-03 14:19:04+00:00", "ticker": "III", "mrkt_info": {"open": 1387.5, "close": 1390.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ENBRIDGE INC (\"ENB-TN\")\n- First Nation Capital Investment Partnership Teams up with Enbridge\n- to Advance CO2 Storage Solutions\n\n     Enbridge Inc. and the First Nation Capital Investment Partnership\n(FNCIP) have reached an agreement to advance the proposed Open Access\nWabamun Carbon Hub (the Hub) west of Edmonton. The Hub is being developed\nas an innovative combination of carbon transportation and storage solutions\nto support recently announced carbon capture projects from Capital Power\nCorporation (Capital Power), Lehigh Hanson Materials Limited (Lehigh\nCement), and potentially others.\n\n     Four Treaty 6 Nations - Alexander First Nation, Alexis Nakota Sioux\nNation, Enoch Cree Nation and Paul First Nation - recently formed the FNCIP\nto pursue ownership in major infrastructure projects with commercial\npartners who share Indigenous values - the Hub is the FNCIP's first\npartnership. The Lac Ste. Anne Metis Community will also have an\nopportunity to pursue ownership in future carbon transportation and storage\nprojects associated with the Hub.\n\n     \"This path creates an opportunity to generate wealth, but more\nimportantly it allows sustainable economic sovereignty for our communities.\nWe are creating a healthy future for the next seven generations to thrive,\"\nsaid Chief of Alexander First Nation, George Arcand Jr. \"We're looking\nforward to working with industry leaders who share our values of\nenvironmental stewardship and to collaborate with Enbridge on world-scale\ncarbon transportation and storage infrastructure investments.\"\n\n     \"We welcome the opportunity to partner with these Treaty 6 First\nNations and the Lac Ste. Anne Metis Community as equity owners in the\ncarbon transportation and storage projects being developed within the Open\nAccess Wabamun Carbon Hub,\" said Colin Gruending, Executive Vice President\nand President, Liquids Pipelines with Enbridge. \"We see Indigenous economic\npartnerships like this as critical to advancing reconciliation and\ndelivering world-class projects.\"\n\n     Once built, the Hub will be among the largest integrated carbon\ntransportation and storage projects in the world. Capital Power and Lehigh\nCement's planned carbon capture projects represent an opportunity to avoid\nnearly four million tonnes of atmospheric CO2 emissions.\n\n     With support of local Indigenous groups, Capital Power, and Lehigh\nCement, Enbridge has applied to develop the open access Hub through the\nGovernment of Alberta's Request for Full Project Proposals process.\n\n     About this collaboration\n\n     The four Treaty 6 First Nations involved in this collaboration\nrepresent, collectively, more than 10,000 on- and off-reserve members.\nParticipating groups include:\n\n     Alexander First Nation is a Treaty 6 First Nation located west of\nMorinville, Alberta. Alexander First Nation has a mission to protect\nInherent Treaty Rights through tactical initiatives, community enhancement,\nlaw development and continuous improvement.\n\n     Alexis Nakota Sioux Nation is a Treaty 6 First Nation located west of\nEdmonton. Alexis Nakota Sioux Nation focuses on protecting Inherent Treaty\nRights, maintaining the community's culture, language, history, and\ncustoms, working with the Elders and staff to revive tribal laws, building\nbusinesses, generating capital, improving education services, advancing\nwellness and supporting equity, justice and the development of future\ngenerations.\n\n     Enoch Cree Nation is a Treaty 6 First Nation located on Edmonton's\nwestern border. Enoch Cree Nation has a mandate to work collectively\ntowards an atmosphere of respect and trust for the community by providing\nopportunities, resources and programs that will enhance the quality of life\nfor future generations to work and prosper.\n\n     Paul First Nation is a Treaty 6 First Nation located on the eastern\nshore of Lake Wabamun, Alberta (Wabamun Indian Reserve #133 A &amp; B). Paul\nFirst Nation is a mix of Cree and Nakoda origin. Priorities of Paul First\nNation include the ongoing development of land, fiscal, protection of the\nenvironment and human resources, seeking business and employment\nopportunities within the province and abroad for the benefit of members and\nthe fair distribution of benefits and opportunities.\n\n     Enbridge Forward-Looking InformationForward-looking information, or\nforward-looking statements, have been included in this news release to\nprovide information about Enbridge Inc. (\"Enbridge\" or the \"Company\") and\nits subsidiaries and affiliates, including management's assessment of\nEnbridge and its subsidiaries' future plans and operations. This\ninformation may not be appropriate for other purposes. Forward-looking\nstatements are typically identified by words such as \"anticipate\",\n\"expect\", \"project\", \"estimate\", \"forecast\", \"plan\", \"intend\", \"target\",\n\"believe\", \"likely\" and similar words suggesting future outcomes or\nstatements regarding an outlook. Forward-looking information or statements\nin this news release include statements with respect to Enbridge's proposed\nOpen Access Wabamun Carbon Hub and its agreement with First Nation Capital\nInvestment Partnership, including the characteristics and benefits thereof.\n\n      Although Enbridge believes these forward-looking statements are\nreasonable based on the information available on the date such statements\nare made and processes used to prepare the information, such statements are\nnot guarantees of future performance and readers are cautioned against\nplacing undue reliance on forward-looking statements. By their nature,\nthese statements involve a variety of assumptions, known and unknown risks\nand uncertainties and other factors, which may cause actual results, levels\nof activity and achievements to differ materially from those expressed or\nimplied by such statements. Assumptions regarding the expected supply of\nand demand for crude oil, natural gas, natural gas liquids and renewable\nenergy, and the prices of these commodities, are material to and underlie\nall forward-looking statements, as they may impact current and future\nlevels of demand for the Company's services. Similarly, energy transition,\nincluding the drivers and pace thereof, the COVID-19 pandemic, exchange\nrates, inflation and interest rates impact the economies and business\nenvironments in which the Company operates and may impact levels of demand\nfor the Company's services and cost of inputs, and are therefore inherent\nin all forward-looking statements. Due to the interdependencies and\ncorrelation of these macroeconomic factors, the impact of any one\nassumption on a forward-looking statement cannot be determined with\ncertainty. The most relevant assumptions associated with forward-looking\nstatements on announced projects and projects under construction, including\nestimated in-service dates, include the following: the impact of litigation\nand government, regulatory and stakeholder actions and approvals on\nconstruction and in-service schedules; the availability and price of labour\nand construction materials; the effects of inflation and foreign exchange\nrates on labour and material costs; the effects of interest rates on\nborrowing costs; technology-related matters; and the impact of weather.\n\n      Enbridge's forward-looking statements are subject to risks and\nuncertainties, including, but not limited to those risks and uncertainties\ndiscussed in this news release and in the Company's other filings with\nCanadian and United States securities regulators. The impact of any one\nrisk, uncertainty or factor on a particular forward-looking statement is\nnot determinable with certainty as these are interdependent and Enbridge's\nfuture course of action depends on management's assessment of all\ninformation available at the relevant time. Except to the extent required\nby applicable law, Enbridge assumes no obligation to publicly update or\nrevise any forward-looking statements made in this news release or\notherwise, whether as a result of new information, future events or\notherwise. All subsequent forward-looking statements, whether written or\noral, attributable to Enbridge or persons acting on the Company's behalf,\nare expressly qualified in their entirety by these cautionary statements.\n\n     About First Nation Capital Investment Partnership:This alliance is an\nentrepreneurial partnership between Alexander First Nation, Alexis Nakota\nSioux Nation, Enoch Cree Nation, and Paul First Nation built on shared\nvalues. First Nation Capital Investment Partnership works together to\npursue ownership in major infrastructure assets and projects. The vision is\nthat First Nation Capital Investment Partnership will serve to create\nintergenerational wealth in our communities - ensuring a vibrant, healthy\nfuture for our Peoples.\n\n     About Enbridge Inc.Enbridge Inc. is a leading North American energy\ninfrastructure company. We safely and reliably deliver the energy people\nneed and want to fuel quality of life. Our core businesses include Liquids\nPipelines, which transports approximately 25 percent of the crude oil\nproduced in North America; Gas Transmission and Midstream, which transports\napproximately 20 percent of the natural gas consumed in the U.S.; Gas\nDistribution and Storage, which serves approximately 3.8 million retail\ncustomers in Ontario and Quebec; and Renewable Power Generation, which owns\napproximately 1,766 megawatts (net) in renewable power generation capacity\nin North America and Europe. The Company's common shares trade on the\nToronto and New York stock exchanges under the symbol ENB. For more\ninformation, visit www.enbridge.com\n\n     FOR FURTHER INFORMATION PLEASE CONTACT:\n//st\n\n             Enbridge                    pipikwan pe^hta^kwan\n\n             Jesse Semko                 Jill McKenzie\n\n             Toll Free: (888) 992-0997   Phone: (902) 830 0814\n\n             Email: [email protected]    Email: [email protected]\n\n//et\n\nTel   : 403-231-3900    ENBRIDGE INC CUM REDEEMABLE PR SHARES SERIES L\nFax   : 403-231-5929\nEmail : CorporateSecretary@enbridge.com\nWWW   : <a href=\"https://www.enbridge.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.enbridge.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203300242.MNPRE2203301364-06172620220203</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}