{"date": "2022-02-10 05:39:00+00:00", "ticker": "ABDN", "mrkt_info": {"open": 246.0, "close": 248.7}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Dubai, United Arab Emirates:</strong> Enterprises in the United Arab Emirates (UAE) have taken significant strides towards providing better health and well-being benefits to employees post-COVID, new research by Aetna International reveals. However, the study which polled over 1,000 employees across the UAE shows that work remains to be done to improve internal communication among some organizations and their workforces, concerning the benefits available and how to access them.</p>\n<p>Most UAE employees (70%) believe their company genuinely cares about their health and well-being and almost half (46%) say health and well-being have become an important part of their corporate culture. When asked to gauge their company’s progress on key health and well-being metrics, over a 12-month period between Sep 2020 and Aug 2021, some 61% of UAE employees say their employer has made efforts to meet the varied needs of employees when crafting insurance plans. A significant portion (77%) report action having been taken by their organization to support employees in maintaining their overall mental health and wellbeing while at work, as well as encouraging them to access the appropriate mental health resources when needed.</p>\n<p>At a time when many employees are having to manage the strains that come with hybrid work, 81% of those polled said their management has taken the right steps to help them avoid work-related stress and burnout. And 85% report their companies have made moves to support employees in dealing with the anxiety caused by the pandemic and its associated lockdowns.</p>\n<p>“<span>It is encouraging to see employers across the UAE fulfil their leadership roles and step up to the plate regarding employee health and wellness, particularly when it comes to mental health and pandemic induced stressors</span>,” said <strong>David Healy, CEO EMEA, Aetna International.</strong> “<span>In Aetna International’s previous research, employees said loud and clear that their employers should do more to support them in the post-COVID world. 72% of UAE workers expected their companies to prioritize mental health care more in the age of COVID, and 63% expected this of physical health. Furthermore, two thirds said their employer should be spending more on health benefits — it appears employers in the UAE have answered these calls</span>.”</p>\n<p>Despite the positive report cards from employees in terms of the post-COVID health and well-being benefits offered by their employers and some action on providing guidance and information, the latest research also notes that employees need more to be done in terms of where and how they can access benefits. Some 22% say their employer has not shared clear information on how to access benefits or support. And when asked what they feel was missing from the support currently provided, top of the list (43%) was better communication. Interestingly, 40% called for a centralized information hub with clear descriptions of what benefits are available and how to access them. This is a clear sign of need for improved communication as many players in the industry already offer information hubs on their websites or member portals, where employees can browse through the benefits they have.</p>\n<p>When asked what was needed to be done to increase the likelihood of them using health and well-being benefits, the top answer (45%) was being given a more comprehensive introduction to, or training on, the health and well-being benefits available. 44% said they were in favor of being given more information on how to access health and well-being benefits and 35% urged their employer’s leadership to communicate more clearly and more often.</p>\n<p>“<span>Our research shows that employees know great progress has been made by organizations in meeting their health and well-being needs, but they need more clarity and consistency in the information delivered to them and, more importantly, a safe space where honest conversations about health and well-being are encouraged</span>,” <strong>continued Healy</strong>.</p>\n<p>A close look at practices may reveal that what is needed is fresh ideas and an innovative approach in communication with employees – organizations should review workplace culture and allow for flexibility so employees feel supported and safe in and out of the office; offer trainings and webinars on physical and mental health awareness and practical tips on managing well-being; organize periodical town-hall-style meetings that take employees through all the benefits available to them and how they can access them, or smaller ‘lunch and learn’ sessions where insurers or brokers conduct Q&amp;As for employees; appoint health and well-being champions that employees can speak with when they have questions; promote virtual information sessions hosted by the health insurer and take advantage of the ready-made communications and tools that the insurer or broker offers.</p>\n<p>“<span>The tools and resources are there, the experts are there — by leaning on their health insurance providers and brokers for guidance, UAE organizations can provide consistent and clear communication that will ensure their employees are aware of, and can take advantage of, the vital health and well-being benefits available to them</span>.”</p>\n<p>More information about Aetna International’s research, the full data set, key findings and additional insights can be viewed here: <a href=\"https://www.aetnainternational.com/en/about-us/explore/future-health/polarised-perceptions-2022.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.aetnainternational.com/en/about-us/explore/future-health/polarised-perceptions-2022.html</a> </p>\n<p><strong>About Aetna International</strong></p>\n<p>Aetna International is committed to helping create a stronger, healthier global community by delivering comprehensive health care benefits and population health solutions worldwide. One of the largest providers of international private medical insurance, Aetna International serves more than 800,000 members worldwide, including expatriates, local nationals and business travelers. Its global benefits include medical, dental, vision and emergency assistance and, in some regions, life and disability. Aetna International also offers customised technological and health management solutions for health care systems, government entities and large employers to improve people’s health, enhance quality of care and contain costs. Aetna International is a subsidiary of Aetna, a CVS Health company, which serves an estimated 34 million people with information and resources to help them make better informed decisions about their health care.</p>\n<p>For more information, see www.aetnainternational.com or LinkedIn.</p>\n<p><strong>Media enquiries for Aetna International:<br/></strong>Vernon Saldanha<br/>\nProcre8 (on behalf of Aetna International)<br/>\nvernon@procre8.biz</p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}