{"date": "2021-12-12 22:20:32+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Corrects to show nursing home was in Arkansas, not Missouri</p><p class=\"tr-by\">By Gabriella Borter</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">MAYFIELD, Ky., Dec 12 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Rescue workers in Kentucky scoured debris fields for survivors as many residents without power, water or even a roof over their heads salvaged what they could after a string of powerful tornadoes that officials fear killed more than 100 people obliterated homes, businesses and anything else in their way.</p><p>Authorities said they had little hope of finding survivors after the <a href=\"https://www.reuters.com/markets/commodities/why-tornadoes-are-so-difficult-predict-2021-12-12\" data-type=\"url\" class=\"tr-link\" translate=\"no\">tornadoes tore through</a> the U.S. Midwest and South on Friday night, killing people in at least five states. <a href=\"https://www.reuters.com/markets/commodities/amazon-driver-died-bathroom-sheltering-tornado-with-colleagues-2021-12-12\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Six workers were killed</a> at an Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> warehouse in Illinois. A nursing home was struck in Arkansas. </p><p>\"To the people of America, there is no lens big enough to show you the extent of the damage,\" Kentucky <a href=\"https://www.reuters.com/world/us/ive-got-towns-that-are-gone-kentucky-governor-beshear-says-2021-12-12\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Governor Andy Beshear</a> told reporters on Sunday evening, saying one tornado tore across 227 miles (365 km) of terrain, almost all of that in Kentucky.</p><p>The governor said at least 80 people in his state were  confirmed dead and the toll was eventually going to exceed 100.</p><p>\"We're still hoping as we move forward for some miracles,\" Beshear said.</p><p>Nowhere suffered as much as the small town of Mayfield, Kentucky, where the large twisters, which weather forecasters say are unusual in winter, <a href=\"https://www.reuters.com/markets/commodities/an-instant-kentucky-factory-destroyed-dozens-employees-missing-2021-12-11\" data-type=\"url\" class=\"tr-link\" translate=\"no\">destroyed a candle factory</a> and the fire and police stations.</p><p>Across the community of 10,000 people in the state's southwestern corner, homes were flattened or missing roofs, giant trees had been uprooted and street signs were mangled.</p><p>Laurie Lopez, 53, received a tornado alert on her phone about 20 minutes before her entire house started shaking. She took cover in a hallway with her 19-year-old daughter and their two Huskies. Sirens near downtown also went off, she said. </p><p>\"Soon the (window) glass started just burst in, we could hear it flying. I have it like all over my bedroom,\" she said. The tornado \"sounded like a freight train going through a brick house.\"</p><p>The front of their two-story home appeared totally collapsed and part of the roof had fallen onto the lawn. Somewhere under the mound of debris was Lopez's car.</p><p>Steve Wright, 61, was driving around looking for gas on Sunday morning. A resident of Mayfield for the last four years, his apartment complex was largely spared.</p><p>After the storm had passed, he took a flashlight and started walking around town looking for people who might be trapped. He ended up helping a father pull his dead 3-year-old from the rubble. </p><p>\"It was bad. I helped dig out a dead baby, right up here,\" he said gesturing to debris that used to be a two-story house. \"I prayed for both of them, that was all I could do.\"</p><p><br/></p><p>DESTRUCTIVE, UNUSUAL </p><p>Beshear said the tornadoes were the most destructive in the state's history and knocked out power to between 36,000 and 50,000 homes. </p><p>More than 300 members of the National Guard were going door to door and removing debris. Teams were working to distribute water and generators.</p><p>\"The very first thing that we have to do is grieve together and we're going to do that before we rebuild together,\" Beshear said.</p><p>In Edwardsville, Illinois, <a href=\"https://www.reuters.com/markets/commodities/amazon-driver-died-bathroom-sheltering-tornado-with-colleagues-2021-12-12\" data-type=\"url\" class=\"tr-link\" translate=\"no\">six Amazon workers were killed</a> and more were missing after the plant buckled under the force of the tornado. One cargo driver died in the bathroom, where many workers told Reuters that they had been directed to shelter.</p><p>The genesis of the tornado outbreak was a series of overnight thunderstorms, including a super cell storm that formed in northeast Arkansas and moved into Arkansas and Missouri and then into Tennessee and Kentucky.</p><p>President Joe <a href=\"https://www.reuters.com/markets/commodities/biden-approves-kentucky-emergency-declaration-tornado-disaster-2021-12-11\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Biden</a> told reporters he would ask the Environmental Protection Agency to examine what role climate change may have played in fueling the storms. </p><p>Deanne Criswell, administrator of the U.S. Federal Emergency Management Agency, called the magnitude of the tornadoes \"historic.\" The agency was opening shelters and sending teams and supplies, including 30,000 meals and 45,000 liters of water. </p><p>Mayfield resident Jamel Alubahr, 25, said his 3-year-old nephew died and his sister was in the hospital with a skull fracture after being stuck under the rubble of their home. </p><p>\"It all happened in the snap of a finger,\" said Alubahr, who is now staying with another sister in Mayfield. </p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Gabriella Borter, Cheney Orr and Julio Cesar Chavez in Mayfield; Additional reporting by Doina Chiacu in Washington and Brendan O'Brien in Chicago; Writing by Alexandra Ulmer and Lisa Shumaker; Editing by Paul Thomasch and Daniel Wallis)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:daniel.trotta@reuters.com\" data-type=\"email\" translate=\"no\">daniel.trotta@reuters.com</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-WEATHER/TORNADOES (CORRECTED, UPDATE 4, TV, PIX)</p></div>"}