{"date": "2021-12-09 08:51:59+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.29, "close": 3483.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\">\n<li><span>Dell Technologies and AWS bring industry-leading data protection to customers with a public cloud vault, operational air gap and enhanced security</span></li>\n<li><span>Dell EMC PowerProtect Cyber Recovery for AWS offers modern data protection to isolate critical data and help accelerate data recovery</span></li>\n<li><span>New offering is the latest Dell Technologies data protection solution available as a transactable offer in AWS Marketplace</span></li>\n</ul>\n<p>Dell Technologies (NYSE:DELL) and Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company<strong>,</strong> are bringing Dell’s cyber recovery vault to the AWS Marketplace with the launch of Dell EMC PowerProtect Cyber Recovery for AWS. Through the AWS Marketplace, customers can easily purchase and deploy an air-gapped cyber vault from Dell, the leading provider of data protection appliances &amp; software globally<sup>1</sup>, to help securely protect and isolate data away from a ransomware attack.</p>\n<p>Dell EMC PowerProtect Cyber Recovery for AWS provides multiple layers of protection with a modern approach that allows AWS customers to resume normal business operations quickly and confidently after a cyberattack. The solution moves a customer’s critical data away from the attack surface, physically and logically isolating it with a secure, automated operational air gap. Unlike standard backup solutions, this air gap locks down management interfaces, requiring separate security credentials and multi-factor authentication for access.</p>\n<p>“Data is a strategic asset, and protecting it against ransomware and other cyberattacks is critical for organizations to make informed decisions about their business and thrive in today’s digital economy,” said David Noy, vice president of data protection product management, Dell Technologies. “By teaming with AWS, we are offering customers a cyber recovery solution that isolates business-critical data away from an attack with an air-gapped cyber vault, helping organizations reduce risk and protect data with confidence after a successful cyberattack.”</p>\n<p>As organizations continue to adopt diverse IT infrastructures, across the public cloud and on-premises environments, data protection solutions can improve data security. According to the 2021 Dell Technologies Global Data Protection Index survey of 1,000 global IT decision makers, 67% of organizations lack confidence that all business-critical data can be recovered in the event of a destructive cyberattack. Dell EMC PowerProtect Cyber Recovery for AWS helps customers address the increasing risk of ransomware and other cyberattacks.</p>\n<p>“Dell Technologies’ cyber recovery solution will help our joint customers face the threat of ransomware and other cyberattacks,” said Sabina Joseph, general manager, America’s Technology Partners, AWS. “Through Dell EMC PowerProtect Cyber Recovery for AWS, our customers can now have access to a data vault they can purchase and deploy on AWS.”</p>\n<p>Available today, Dell EMC PowerProtect Cyber Recovery for AWS is the latest data protection solution from Dell Technologies available for purchase in AWS Marketplace, a digital catalog with thousands of software listings from independent software vendors that make it easy to find, test, buy and deploy software that runs on AWS. Customers can gain fast access to Dell’s portfolio of data protection offerings for AWS with a simple purchase, so they can begin deployment immediately.</p>\n<p>“Having strong relationships with global technology experts, such as Dell Technologies and AWS, ensures our cloud operations always remain safe, sound and secure,” said Jason Sandery, executive manager, Cloud Services, Commonwealth Bank of Australia. “Using powerful cloud cyber recovery solutions gives us the confidence that our data remains protected from highly-destructive cyber threats, like ransomware, and overall uplifts our risk resilience and operational efficiency.”</p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}