{"date": "2021-12-21 14:52:12.579000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>FACTSET RESEARCH SYSTEMS INC (\"FDS-N\")\n- Results for First Quarter 2022\n\n     FactSet (\"FactSet\" or the \"Company\"), a global provider of integrated\nfinancial information, analytical applications, and industry-leading\nservice, announced results for its first quarter ended November 30, 2021.\n\n     First Quarter Fiscal 2022 Highlights\n\n     *  Revenues increased 9.4%, or $36.5 million, to $424.7 million for\nthe first quarter of fiscal 2022 compared with $388.2 million for the same\nperiod in fiscal 2021. The increase was primarily due to higher sales of\nanalytics and research and advisory solutions. Organic revenues, which\nexcludes the effects of acquisitions and dispositions completed within the\nlast 12 months and foreign currency movements, grew 9.1% to $423.2 million\nduring the first quarter of fiscal 2022 from the prior year period.\n     *  Annual Subscription Value (ASV) plus professional services was $1.7\nbillion at November 30, 2021, compared with $1.6 billion at November 30,\n2020. Organic ASV plus professional services, which excludes the effects of\nacquisitions and dispositions completed within the last 12 months and\nforeign currency movements, was also $1.7 billion at November 30, 2021, up\n$142.3 million from the prior year at a growth rate of 8.9%.\n     *  Organic ASV plus professional services increased $16.9 million over\nthe last three months. The primary contributors to this growth were higher\nsales of analytics and research and advisory solutions. Please see the \"ASV\n+ Professional Services\" section of this press release for details.\n     *  GAAP operating margin decreased to 28.9% compared with 31.2% for\nthe same period last year, mainly driven by restructuring costs and real\nestate exit costs. Adjusted operating margin decreased to 33.6% compared\nwith 34.3% in the prior year period, primarily as a result of increased\ninfrastructure expenses and data costs, partially offset by lower\ncompensation expenses.\n     *  Diluted GAAP earnings per share (EPS) increased 6.5% to $2.79\ncompared with $2.62 for the same period in fiscal 2021. Adjusted diluted\nEPS increased 12.8% to $3.25 compared with the prior year period, primarily\ndue to higher revenues and a decreased tax rate.\n     *  The Company's effective tax rate for the first quarter decreased to\n10.2% compared with 15.8% a year ago, primarily due to higher than expected\ntax benefit associated with the exercise of stock options in the current\nquarter compared with the three months ended November 30, 2020.\n     *  FactSet acquired Cobalt Software, Inc., a leading portfolio\nmonitoring solutions provider for the private capital industry, in October\n2021.\n     *  FactSet reaffirms its annual outlook for fiscal 2022 as provided in\nSeptember 2021. Please see the \"Annual Business Outlook\" section of this\npress release for details.\n\n     \"I'm pleased to report that FactSet once again delivered impressive\nquarterly results, reflecting the continuing momentum in our business,\"\nsaid Phil Snow, CEO, FactSet. \"It is clear that the investments we have\nmade in our business are paying off in top line growth. Demand for\ndifferentiated content remains strong, which we intend to capitalize on\nwith our leading open content and analytics platform.\"\n\n     Key Financial Measures*\n\n//st\n\n  (Condensed      Three Months Ended\n  and\n  Unaudited)\n\n                  November 30,\n\n  (In             2021                       2020                 Change\n  thousands,\n  except per\n  share data)\n\n  GAAP revenues   $            424,725       $      388,206       9.4\n%\n\n  Organic         $            423,153       $      387,891       9.1\n%\n  revenues\n\n  Operating       $            122,661       $      121,031       1.3\n%\n  income\n\n  Adjusted        $            142,710       $      133,003       7.3\n%\n  operating\n  income\n\n  Operating       28.9                   %   31.2             %\n  margin\n\n  Adjusted        33.6                   %   34.3             %\n  operating\n  margin\n\n  Net income      $            107,647       $      101,206       6.4\n%\n\n  Adjusted net    $            125,341       $      111,283       12.6\n%\n  income\n\n  Diluted EPS     $            2.79          $      2.62          6.5\n%\n\n  Adjusted        $            3.25          $      2.88          12.8\n%\n  diluted EPS\n\n//et\n\n     * See reconciliation of U.S. GAAP to adjusted key financial measures\nin the back of this press release.\n\n     \"Underpinning our accelerating top-line growth is our ongoing\ndedication to cost discipline, productivity, and focused execution,\" said\nLinda Huber, CFO, FactSet. \"This allowed us to deliver a 28.9% GAAP\noperating margin and a 33.6% operating margin on an adjusted basis, which\nexceeds our fiscal 2022 adjusted operating margin guidance of 32.5% to\n33.5%.\"\n\n     Annual Subscription Value (ASV) + Professional Services\n\n     ASV at any given point in time represents the forward-looking revenues\nfor the next twelve months from all subscription services currently\nsupplied to clients. Professional services is revenue derived from\nproject-based consulting and implementation.\n\n     ASV plus professional services was $1,706 million at November 30, 2021\ncompared with $1,562 million at November 30, 2020. Organic ASV plus\nprofessional services was $1,701 million at November 30, 2021, up $142.3\nmillion from the prior year at a growth rate of 8.9%. Organic ASV, which\nexcludes the effects of acquisitions and dispositions completed within the\nlast 12 months and foreign currency movements, plus professional services,\nincreased $16.9 million over the last three months.\n\n     Buy-side and sell-side ASV growth rates for the first quarter of\nfiscal 2022 were 8.5% and 13.2%, respectively. Buy-side clients, who\nprimarily include asset managers, asset owners, wealth managers, hedge\nfunds, corporations, and channel partners, accounted for approximately 83%\nof organic ASV while the remainder came from sell-side firms that include\nbroker-dealers, banking and advisory, private equity and venture capital\nfirms. Supplementary tables covering organic buy-side and sell-side ASV\ngrowth rates may be found on the last page of this press release.\n\n     Segment Revenues and ASV\n\n     ASV from the Americas region was $1,054.9 million compared with ASV in\nthe prior year period of $958.5 million. Organic ASV increased 9.4% to\n$1,048.2 million. Americas revenues for the quarter increased to $266.9\nmillion compared with $244.3 million in the first quarter last year.\nExcluding the effects of acquisitions and dispositions completed in the\nlast 12 months, the Americas region organic revenues growth rate was 8.5%.\n\n     ASV from the EMEA region was $452.0 million compared with ASV in the\nprior year period of $422.0 million. Organic ASV increased 7.2% to $453.4\nmillion. EMEA revenues were $115.0 million compared with $105.8 million in\nthe first quarter of fiscal 2021. Excluding the effects of acquisitions and\ndispositions completed in the last 12 months and foreign currency impacts,\nthe EMEA region organic revenues growth rate was 8.8%.\n\n     ASV from the Asia Pacific region was $175.4 million compared with ASV\nin the prior year period of $156.5 million. Organic ASV increased 13.6% to\n$176.2 million. Asia Pacific revenues were $42.8 million compared with\n$38.1 million in the first quarter of fiscal 2021. Excluding the effects of\nacquisitions and dispositions completed in the last 12 months and foreign\ncurrency impacts, the Asia Pacific region organic revenues growth rate was\n13.7%.\n\n     Segment ASV does not include professional services, which totaled\n$24.0 million at November 30, 2021.\n\n     Operational Highlights - First Quarter Fiscal 2022\n\n     *  Client count as of November 30, 2021 was 6,759, a net increase of\n306 clients in the past three months, primarily driven by an increase in\ncorporate clients. The count includes clients with ASV of $10,000 and more.\n     *  User count increased by 1,229 to 162,161 in the past three months,\nprimarily driven by an increase in research and advisory users.\n     *  Annual ASV retention was greater than 95%. When expressed as a\npercentage of clients, annual retention was 92%.\n     *  Expense highlights include a restructuring charge of $9 million to\ndrive organizational realignment. Ongoing savings from this realignment\nprimarily will be used for product reinvestment and key talent retention.\nIn addition, the Company recognized $4 million of expense related to\nvacating certain office space in New York City. The Company recently polled\nFactSet employees on optimal work arrangements and, consistent with what\nthe Company has seen in the market, the majority of the Company's employees\nhave indicated that they will work in a hybrid or a remote environment.\nAccordingly, FactSet is reassessing its real estate footprint to better\nreflect these new work arrangements.\n     *  Employee count was 10,898 as of November 30, 2021, up 2.6% over the\nlast twelve months. Excluding acquisitions made over the last twelve\nmonths, headcount grew by 1.8% year over year, primarily driven by\nincreased hiring in the Company's content and technology organizations.\n     *  Net cash provided by operating activities decreased to $72.9\nmillion compared with $89.3 million for the first quarter of fiscal 2021,\nprimarily due to the timing of tax payments in the UK and higher\nyear-over-year employee bonus payments. Quarterly free cash flow decreased\nto $64.3 million compared with $70.9 million a year ago, a decrease of\n9.3%, primarily due to the timing of tax payments in the UK, higher\nyear-over-year employee bonus payments and a $9.7 million reduction in\ncapital expenditures related to facilities build-outs completed in fiscal\n2021.\n     *  A quarterly dividend of $31.0 million, or $0.82 per share, was paid\non December 16, 2021 to holders of record of FactSet's common stock at the\nclose of business on November 30, 2021.\n     *  FactSet had the distinction of being added to the S&amp;P 500 Index on\nDecember 20, 2021.\n     *  FactSet incorporated the FactSet Charitable Foundation as a\nnonprofit corporation in November 2021 to facilitate our corporate social\nresponsibility goals.\n     *  FactSet announced the appointment of Kendra Brown as Global Head of\nInvestor Relations. Ms. Brown has over 20 years of product development\nexperience, including a focus on financial applications and content, as\nwell as market analysis. She most recently held the position of Chief of\nStaff to the FactSet CEO.\n     *  FactSet acquired Cobalt Software, Inc., a leading portfolio\nmonitoring solutions provider for the private capital industry. This\nacquisition advances FactSet's strategy to scale its data and workflow\nsolutions through targeted investments as part of its multi-year investment\nplan and expands its private markets offering.\n\n     *  FactSet launched its Technology, Media, and Telecoms (TMT) content\noffering. This furthers FactSet's strategy to bring more industry-specific,\nor \"deep sector,\" data to clients alongside analytic tools to drive\nimproved access and workflow efficiency.\n\n     *  FactSet also launched fixed income trading capabilities for its\nleading execution management system (EMS). With the introduction of fixed\nincome trading, Portware now enables clients to trade more efficiently\nacross more asset classes. FactSet worked with longtime client GIC to build\nout these new capabilities, which now operates in parallel with the other\nasset classes already supporting GIC's global trading desks.\n     *  FactSet joined Amazon Web Services (AWS) Data Exchange, with a\ncomprehensive financial data and analytics offering. FactSet will deploy\nover 30 proprietary datasets available within the FactSet ecosystem on AWS\nData Exchange, which will allow clients to leverage FactSet's leading\ncontent for faster, more efficient decision-making.\n\n     Share Repurchase Program\n\n     FactSet repurchased 46,200 shares of its common stock for $18.6\nmillion at an average price of $403.44 during the first quarter under the\nCompany's existing share repurchase program. As of December 21, 2021,\n$181.3 million is available for share repurchases under this program.\n\n     Annual Business Outlook\n\n     FactSet provided its outlook for fiscal 2022 on September 28, 2021.\nThe following forward-looking statements reflect FactSet's expectations as\nof today's date. Given the risk factors, uncertainties, and assumptions\ndiscussed below, actual results may differ materially, particularly with\nthe ongoing uncertainty surrounding the duration, magnitude, and impact of\nthe novel coronavirus pandemic. FactSet does not intend to update its\nforward-looking statements prior to its next quarterly results\nannouncement.\n\n     Fiscal 2022 Expectations\n\n     *  Organic ASV plus professional services is expected to increase in\nthe range of $105 million to $135 million over fiscal 2021.\n     *  GAAP revenues is expected to be in the range of $1,705 million to\n$1,720 million.\n     *  GAAP operating margin is expected to be in the range of 31% to 32%.\n     *  Adjusted operating margin is expected to be in the range of 32.5%\nto 33.5%.\n     *  FactSet's annual effective tax rate is expected to be in the range\nof 14.5% to 15.5%.\n     *  GAAP diluted EPS is expected to be in the range of $11.60 to\n$11.90. Adjusted diluted EPS is expected to be in the range of $12.00 to\n$12.30.\n\n     Both GAAP operating margin and GAAP diluted EPS guidance do not\ninclude certain effects of any non-recurring benefits or charges that may\narise in fiscal 2022. Please see the back of this press release for a\nreconciliation of GAAP to adjusted metrics.\n\n     Conference Call\n\n     The Company will host a conference call today, December 21, 2021, at\n11:00 a.m. Eastern Time to discuss its first quarter results. The call will\nbe webcast live at FactSet Investor Relations. The following information is\nprovided for those who would like to participate:\n\n//st\n\n                  U.S. Participants:            833.726.6487\n\n                  International Participants:   830.213.7677\n\n                  Passcode:                     9771799\n\n//et\n\n     An archived webcast with the accompanying slides will be available at\nFactSet Investor Relations for one year after the conclusion of the live\nevent. The earnings call transcript will also be available via the FactSet\nworkstation or web. An audio replay of this conference will also be\navailable until December 28, 2021 via the following telephone numbers:\n855.859.2056 in the U.S. and 404.537.3406 internationally using passcode\n9771799.\n\n     Forward-looking Statements\n     This news release contains forward-looking statements based on\nmanagement's current expectations, estimates, forecasts and projections\nabout industries in which FactSet operates and the beliefs and assumptions\nof management. All statements that address expectations, guidance, outlook\nor projections about the future, including statements about the Company's\nstrategy for growth, product development, revenues, future financial\nresults, anticipated growth, market position, subscriptions, expected\nexpenditures, trends in FactSet's business and financial results, are\nforward-looking statements. Forward-looking statements may be identified by\nwords like \"expects,\" \"believes, \" \"anticipates,\" \"plans,\" \"intends, \"\n\"estimates, \" \"projects,\" \"should,\" \"indicates,\" \"continues,\" \"may\" and\nsimilar expressions. These statements are not guarantees of future\nperformance and involve a number of risks, uncertainties and assumptions.\nMany factors, including those discussed more fully elsewhere in this\nrelease and in FactSet's filings with the Securities and Exchange\nCommission, particularly its latest annual report on Form 10-K and\nquarterly reports on Form 10-Q, as well as others, could cause results to\ndiffer materially from those stated. Forward-looking statements speak only\nas of the date they are made, and FactSet assumes no duty to and does not\nundertake to update forward-looking statements. Actual results could differ\nmaterially from those anticipated in forward-looking statements and future\nresults could differ materially from historical performance.\n\n     About Non-GAAP Financial Measures\n\n     Financial measures in accordance with U.S. GAAP including revenues,\noperating income and margin, net income, diluted earnings per share and\ncash provided by operating activities have been adjusted.\n\n     FactSet uses these adjusted financial measures both in presenting its\nresults to stockholders and the investment community and in its internal\nevaluation and management of the business. The Company believes that these\nadjusted financial measures and the information they provide are useful to\ninvestors because they permit investors to view the Company's performance\nusing the same tools that management uses to gauge progress in achieving\nits goals. Investors may benefit from referring to these adjusted financial\nmeasures in assessing the Company's performance and when planning,\nforecasting and analyzing future periods and may also facilitate\ncomparisons to its historical performance. The presentation of this\nfinancial information is not intended to be considered in isolation or as a\nsubstitute for the financial information prepared and presented in\naccordance with GAAP.\n\n     Adjusted revenues exclude the impact of the fair value of deferred\nrevenues acquired in a business combination. Organic revenues further\nexcludes the effects of acquisitions and dispositions completed in the last\n12 months and foreign currency movements in all periods presented. Adjusted\noperating income and margin, adjusted net income and adjusted diluted\nearnings per share exclude intangible asset amortization, the impact of the\nfair valuing of deferred revenues acquired in a business combination and\nnon-recurring items. The Company believes that these adjusted financial\nmeasures better reflect the underlying economic performance of FactSet.\n\n     The GAAP financial measure, cash flows provided by operating\nactivities, has been reduced by capital expenditures to report non-GAAP\nfree cash flow. FactSet uses this financial measure both in presenting its\nresults to stockholders and the investment community and in the Company's\ninternal evaluation and management of the business. Management believes\nthat this financial measure is useful to investors because it permits\ninvestors to view the Company's performance using the same metric that\nmanagement uses to gauge progress in achieving its goals and is an\nindication of cash flow that may be available to fund further investments\nin future growth initiatives.\n\n     About FactSet\n\n     FactSet (NYSE:FDS | NASDAQ:FDS) delivers superior content, analytics,\nand flexible technology to help more than 162,000 users see and seize\nopportunity sooner. We give investment professionals the edge to outperform\nwith informed insights, workflow solutions across the portfolio lifecycle,\nand industry-leading support from dedicated specialists. We're proud to\nhave been recognized with multiple awards for our analytical and\ndata-driven solutions and repeatedly scored 100 by the Human Rights\nCampaign(R) Corporate Equality Index for our LGBTQ+ inclusive policies and\npractices. Subscribe to our thought leadership blog to get fresh insight\ndelivered daily at insight.factset.com. Learn more at www.factset.com and\nfollow us on Twitter: www.twitter.com/factset.\n\nFactSet\nInvestor Relations\n\nContact:\nKendra Brown\n+1.203.810.2684\nkbrown@factset.com\n\nContact:\nLisa Knoll\n+1.203.810.1327\nlknoll@factset.com\n\n//st\n\n  Consolidated\n  Statements of\n  Income (Unaudited)\n\n                         Three Months Ended\n\n                         November 30,\n\n  (In thousands,         2021                          2020\n  except per share\n  data)\n\n  Revenues               $               424,725       $         388,206\n\n  Operating expenses\n\n  Cost of services       207,149                       188,088\n\n  Selling, general       94,915                        79,087\n  and administrative\n\n  Total operating        302,064                       267,175\n  expenses\n\n  Operating income       122,661                       121,031\n\n  Other income\n  (expense)\n\n  Interest expense,      (1,494                    )   (1,029\n)\n  net\n\n  Other (expense)        (1,237                    )   230\n  income, net\n\n  Income before          119,930                       120,232\n  income taxes\n\n  Provision for          12,283                        19,026\n  income taxes\n\n  Net income             $               107,647       $         101,206\n\n  Diluted earnings       $               2.79          $         2.62\n  per common share\n\n  Diluted weighted       38,641                        38,697\n  average common\n  shares\n\n//et\n\n//st\n\n  Consolidated Balance Sheets (Unaudited)\n\n  (In thousands)        November 30, 2021           August 31, 2021\n\n  ASSETS\n  Cash and cash         $               673,900     $              681,865\n  equivalents\n\n  Investments           34,993                      35,984\n\n  Accounts              157,390                     151,187\n  receivable, net of\n  reserves of $4,433\n  at November 30,\n  2021 and $6,431 at\n  August 31, 2021\n\n  Prepaid taxes         23,840                      13,917\n\n  Prepaid expenses      58,445                      50,625\n  and other current\n  assets\n\n  Total current         948,568                     933,578\n  assets\n\n  Property,             122,407                     131,377\n  equipment and\n  leasehold\n  improvements, net\n\n  Goodwill              783,025                     754,205\n\n  Intangible assets,    139,313                     134,986\n  net\n\n  Deferred taxes        2,125                       2,250\n\n  Lease right-of-use    227,904                     239,064\n  assets, net\n\n  Other assets          31,022                      29,480\n\n  TOTAL ASSETS          $               2,254,364   $\n2,224,940\n\n  LIABILITIES\n\n  Accounts payable      $               105,481     $              85,777\n  and accrued\n  expenses\n\n  Current lease         31,240                      31,576\n  liabilities\n\n  Accrued               50,088                      104,403\n  compensation\n  Deferred revenue      54,778                      63,104\n\n  Dividends payable     30,973                      30,845\n\n  Total current         272,560                     315,705\n  liabilities\n\n  Long-term debt        574,580                     574,535\n\n  Deferred taxes        15,784                      14,752\n\n  Deferred revenue,     7,720                       8,394\n  non-current\n\n  Taxes payable         31,305                      30,279\n\n  Long-term lease       249,752                     259,980\n  liabilities\n\n  Other liabilities     3,768                       4,942\n\n  TOTAL LIABILITIES     $               1,155,469   $\n1,208,587\n\n  STOCKHOLDERS'\n  EQUITY\n\n  TOTAL                 $               1,098,895   $\n1,016,353\n  STOCKHOLDERS'\n  EQUITY\n\n  TOTAL LIABILITIES     $               2,254,364   $\n2,224,940\n  AND STOCKHOLDERS'\n  EQUITY\n\n//et\n\n//st\n\n  Consolidated\n  Statements of Cash\n  Flows (Unaudited)\n\n                        Three Months Ended\n\n                        November 30,\n\n  (In thousands)        2021                           2020\n\n  CASH FLOWS FROM\n  OPERATING\n  ACTIVITIES\n  Net income            $                107,647       $         101,206\n\n  Adjustments to\n  reconcile net\n  income to net cash\n  provided by\n  operating\n  activities\n\n  Depreciation and      19,432                         15,290\n  amortization\n\n  Amortization of       11,117                         10,697\n  lease right-of-use\n  assets\n\n  Stock-based           10,401                         11,317\n  compensation\n  expense\n\n  Deferred income       1,507                          437\n  taxes\n\n  Changes in assets\n  and liabilities,\n  net of effects of\n  acquisitions\n\n  Accounts              (5,268                     )   (342\n)\n  receivable, net of\n  reserves\n\n  Accounts payable      20,702                         2,240\n  and accrued\n  expenses\n\n  Accrued               (53,457                    )   (45,858\n)\n  compensation\n\n  Deferred fees         (10,248                    )   (9,724\n)\n\n  Taxes payable, net    (9,524                     )   13,302\n  of prepaid taxes\n\n  Lease liabilities,    (10,521                    )   (10,007\n)\n  net\n\n  Other, net            (8,870                     )   718\n\n  Net cash provided     72,918                         89,276\n  by operating\n  activities\n\n  CASH FLOWS FROM\n  INVESTING\n  ACTIVITIES\n\n  Purchases of          (8,583                     )   (18,333\n)\n  property,\n  equipment,\n  leasehold\n  improvements and\n  internal-use\n  software\n\n  Acquisition of        (50,018                    )   (41,916\n)\n  businesses, net of\n  cash and cash\n  equivalents\n  acquired\n\n  Purchases of          (250                       )   (250\n)\n  investments\n\n  Proceeds from         --                             2,177\n  maturity or sale\n  of investments\n\n  Net cash used in      (58,851                    )   (58,322\n)\n  investing\n  activities\n\n  CASH FLOWS FROM\n  FINANCING\n  ACTIVITIES\n\n  Repurchases of        (18,639                    )   (43,144\n)\n  common stock\n\n  Dividend payments     (30,656                    )   (29,103\n)\n\n  Proceeds from         35,763                         17,993\n  employee stock\n  plans\n\n  Other financing       (2,950                     )   (2,123\n)\n  activities\n\n  Net cash used by      (16,482                    )   (56,377\n)\n  financing\n  activities\n\n  Effect of exchange    (5,550                     )   (45\n)\n  rate changes on\n  cash and cash\n  equivalents\n\n  Net decrease in       (7,965                     )   (25,468\n)\n  cash and cash\n  equivalents\n\n  Cash and cash         681,865                        585,605\n  equivalents at\n  beginning of period\n\n  Cash and cash         $                673,900       $         560,137\n  equivalents at end\n  of period\n\n//et\n\n     Reconciliation of U.S. GAAP Results to Adjusted Financial Measures\n\n     Financial measures in accordance with U.S. GAAP, including revenues,\noperating income and margin, net income, diluted EPS and cash provided by\noperating activities, have been adjusted below. FactSet uses these adjusted\nfinancial measures both in presenting its results to stockholders and the\ninvestment community and in its internal evaluation and management of the\nbusiness. The Company believes that these adjusted financial measures and\nthe information they provide are useful to investors because they permit\ninvestors to view the Company's performance using the same tools that\nmanagement uses to gauge progress in achieving its goals. Adjusted measures\nmay also facilitate comparisons to FactSet's historical performance.\n\n     Revenues\n\n     The table below provides a reconciliation of revenues to adjusted\nrevenues and organic revenues.\n\n//st\n\n  (Unaudited)     Three Months Ended\n\n                  November 30,\n  (In             2021                     2020                    Change\n  thousands)\n\n  GAAP revenues   $          424,725       $         388,206       9.4\n%\n\n  Deferred        86                       60\n  revenues\n  fair value\n  adjustment(a)\n\n  Adjusted        424,811                  388,266                 9.4\n%\n  revenues\n\n  Acquired        (2,267               )   (375                )\n  revenues(b)\n\n  Currency        609                      --\n  impact (c)\n\n  Organic         $          423,153       $         387,891       9.1\n%\n  revenues\n\n//et\n\n     (a) The amortization effect of purchase accounting adjustment on the\nfair value of acquired deferred revenue.\n\n     (b) Revenues from acquisitions completed within the last 12 months.\n\n     (c) The impact from foreign currency movements over the past 12\nmonths.\n\nOperating Income, Margin, Net Income and Diluted EPS\n\n     The table below provides a reconciliation of operating income,\noperating margin, net income and diluted EPS to adjusted operating income,\nadjusted operating margin, adjusted net income and adjusted diluted EPS.\n\n//st\n\n  (Unaudited)      Three Months Ended\n\n                   November 30,\n\n  (In              2021                         2020\nChange\n  thousands,\n  except per\n  share data)\n\n  Operating        $          122,661           $        121,031       1.3\n%\n  income\n\n  Deferred         86                           60\n  revenues fair\n  value\n  adjustment\n\n  Intangible       6,052                        5,699\n  asset\n  amortization\n\n  Transformation   1,188                        4,252\n  costs (a)\n\n  Business         --                           230\n  acquisition\n  costs\n\n  Restructuring    9,028                        1,014\n  / severance\n\n  Real estate      3,695                        717\n  charges\n\n  Adjusted         $          142,710           $        133,003       7.3\n%\n  operating\n  income\n\n  Operating        28.9                     %   31.2               %\n  margin\n\n  Adjusted         33.6                     %   34.3               %\n  operating\n  margin (b)\n\n  Net income       $          107,647           $        101,206       6.4\n%\n\n  Deferred         77                           51\n  revenues fair\n  value\n  adjustment\n\n  Intangible       5,419                        4,797\n  asset\n  amortization\n\n  Transformation   1,064                        3,579\n  costs (a)\n  Business         --                           194\n  acquisition\n  costs\n\n  Restructuring    8,084                        853\n  / severance\n\n  Real estate      3,309                        603\n  charges\n\n  Income tax       (259                 )       --\n  items\n\n  Adjusted net     $          125,341           $        111,283       12.6\n%\n  income (c)\n\n  Diluted          $          2.79              $        2.62          6.5\n%\n  earnings per\n  common share\n\n  Deferred         0.00                         0.00\n  revenues fair\n  value\n  adjustment\n\n  Intangible       0.14                         0.12\n  asset\n  amortization\n\n  Transformation   0.03                         0.10\n  costs (a)\n\n  Business         --                           0.00\n  acquisition\n  costs\n\n  Restructuring    0.21                         0.02\n  / severance\n\n  Real estate      0.09                         0.02\n  charges\n\n  Income tax       (0.01                )       --\n  items\n\n  Adjusted         $          3.25              $        2.88          12.8\n%\n  diluted\n  earnings per\n  common share\n  (c)\n\n  Weighted         38,641                       38,697\n  average\n  common shares\n  (Diluted)\n\n//et\n\n     (a) Costs primarily related to professional fees associated with the\nongoing multi-year investment plan.\n\n     (b) Adjusted operating margin is calculated as adjusted operating\nincome divided by adjusted revenues as shown in the revenues table above.\n\n     (c) For purposes of calculating adjusted net income and adjusted\ndiluted earnings per share, intangible asset amortization, deferred\nrevenues fair value adjustments and other items were taxed at the quarterly\neffective tax rates of 10.5% for fiscal 2022 and 15.8% for fiscal 2021.\n\n     Business Outlook Operating Margin, Net Income and Diluted EPS\n\n//st\n\n  (Unaudited)\n\n                      Annual Fiscal 2022 Guidance\n\n  (In millions,       Low end of range              High end of range\n  except per share\n  data)\n\n  GAAP Revenues       $             1,705           $          1,720\n\n  GAAP Operating      $             528             $          550\n  Income\n\n  GAAP Operating      31.0                      %   32.0\n%\n  margin\n\n  Intangible asset    18                            18\n  amortization (a)\n\n  Transformation      8                             8\n  costs (b)\n\n  Adjusted            $             554             $          576\n  Operating Income\n\n  Adjusted            32.5                      %   33.5\n%\n  operating margin\n\n  GAAP Net income     $             446             $          457\n\n  Intangible asset    16                            16\n  amortization (a)\n\n  Transformation      6                             6\n  costs (b)\n\n  Discrete tax        (7                    )       (7                 )\n  items\n\n  Adjusted net        $             461             $          472\n  income\n\n  GAAP Diluted        $             11.60           $          11.90\n  earnings per\n  common share\n\n  Intangible asset    0.41                          0.41\n  amortization\n\n  Transformation      0.16                          0.16\n  costs\n\n  Discrete tax        (0.17                 )       (0.17              )\n  items\n\n  Adjusted diluted    $             12.00           $          12.30\n  earnings per\n  common share\n\n//et\n\n     (a) The income tax effect related to intangible asset amortization is\n$2.4 million for the period presented above.\n\n     (b) Costs primarily related to professional fees and software\ndevelopment associated with the ongoing multi-year investment plan. The\nincome tax effect related to this item is $1.6 million for the period\npresented above.\n\n     Free Cash Flow\n\n//st\n\n  (Unaudited)    Three Months Ended\n\n                 November 30,\n\n  (In            2021                    2020                   Change\n  thousands)\n\n  Net Cash       $          72,918       $         89,276\n  Provided\n  for\n  Operating\n  Activities\n\n  Capital        (8,583              )   (18,333            )\n  Expenditures\n\n  Free Cash      $          64,335       $         70,943       (9.3     )\n%\n  Flow\n\n//et\n\n     Supplementary Schedules of Historical ASV by Client Type\n\n     The following table presents the percentages and growth rates of\norganic ASV by client type, excluding the impact of currency movements, and\nmay be useful to facilitate historical comparisons. Organic ASV excludes\nacquisitions and dispositions completed within the last 12 months and the\neffects of foreign currency movements. The numbers below do not include\nprofessional services.\n\n//st\n\n              Q1'22       Q4'21       Q3'21       Q2'21       Q1'21\nQ4'20       Q3'20       Q2'20\n\n  % of ASV    83.1    %   83.2    %   83.8    %   84.0    %   84.0    %\n83.8    %   84.1    %   84.1    %\n  from\n  buy-side\n  clients\n\n  % of ASV    16.9    %   16.8    %   16.2    %   16.0    %   16.0    %\n16.2    %   15.9    %   15.9    %\n  from\n  sell-side\n  clients\n\n  ASV         8.5     %   6.5     %   5.6     %   5.5     %   5.1     %\n5.4     %   4.8     %   4.5     %\n  Growth\n  rate\n  from\n  buy-side\n  clients\n\n  ASV         13.2    %   12.0    %   8.0     %   6.3     %   4.4     %\n4.6     %   5.6     %   2.9     %\n  Growth\n  rate\n  from\n  sell-side\n  clients\n\n//et\n\n     The following table presents the calculation of organic ASV plus\nprofessional services.\n(Details may not sum to total due to rounding)\n\n//st\n\n  (In millions)                                      Q1'22\n\n  As reported ASV plus Professional Services (a)     $       1,706.3\n\n  Currency impact (b)                                2.7\n\n  Acquisition ASV (c)                                (7.9              )\n\n  Organic ASV plus Professional Services             $       1,701.1\n\n  Organic ASV plus Professional Services growth      8.9\n%\n  rate\n\n//et\n\n     (a) Includes $24.0 million in professional services as of November 30,\n2021.\n\n     (b) The impact of foreign currency movements.\n\n     (c) Acquired ASV from acquisitions completed within the last 12\nmonths.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2135400313.MNPRE2135401335-06510620211221</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}