{"date": "2021-12-20 21:44:15+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <strong>Washington, D.C.</strong>\n                <strong>-</strong>\n                <br/>\n       U.S. Senators Marco Rubio (R-FL) and Sherrod Brown (D-OH) sent a letter to U.S. Secretary of Labor Martin Walsh calling for a full investigation into Amazon's labor practices.<br/>\n       \"Recent reports have brought to light troubling working conditions at Amazon that suggest improper treatment of its employees, to the detriment of workers and families across the country,\" <strong>the senators wrote.</strong> \"Today, approximately one out of every 170 U.S. workers is an Amazon employee, underscoring our particular interest in ensuring that the company's employment practices are fair, and in accordance with the law. We urge you to use every mechanism at your disposal to investigate Amazon's labor and employment practices immediately.\"<br/>\n       The <a href=\"https://www.rubio.senate.gov/public/_cache/files/bee553dc-18bc-4fca-b1e4-63435e7a5591/E3B940055ED54043E17BA7A6E088B1FC.12.20.21-letter-to-secretary-walsh-requesting-investigation-into-amazon-labor-practices.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">full text of the letter</a> is below.<br/>\n       Dear Secretary Walsh:<br/>\n       We write to urge you to investigate Amazon.com, Inc.'s (Amazon) labor practices. In your role, you oversee many of the investigative and enforcement authorities provided under federal labor and employment law. We ask you to use these authorities to ensure that Amazon is treating its workers fairly and with dignity, in accordance with the law.<br/>\n       Recent reports have brought to light troubling working conditions at Amazon that suggest improper treatment of its employees, to the detriment of workers and families across the country. While U.S. labor and employment laws should always be vigorously upheld, Amazon's size and scope necessitate particular scrutiny by federal regulators when widespread and credible allegations of labor and employment law violations surface.<br/>\n       Recent reports by the New York Times and other media outlets have documented concerning allegations by Amazon employees of mismanagement of benefits and pay, as well as grueling hours and a general lack of responsiveness to employee concerns due to highly automated management practices. Reporting has also suggested a lack of understanding and adherence to state labor laws, creating confusion for workers and alleged wrongful termination.<br/>\n       In addition to allegations of unlawful workplace conditions, Amazon has faced several charges of unfair labor practices in recent months, and recurring worker strikes and attempts to organize reflect a persistent frustration with the company's management. Though not exhaustive, the following recent examples are illustrative of chronic mismanagement at the company:<br/><ul class=\"bulleted-list arrowlist\"><li>\n          In December of 2020, the National Labor Relations Board (NLRB) upheld claims that Amazon had wrongfully terminated an employee who was protesting working conditions during the pandemic.\n        </li><li>\n          In February and March of 2021, the NLRB conducted a mail ballot election pursuant to a petition by workers at an Amazon warehouse in Bessemer, Alabama who sought union representation in response to frustrations with working conditions. The NLRB later set the election aside and directed a re-run election because its investigation determined that Amazon's actions during the election exhibited a \"flagrant disregard\" for the agency's rules and \"made a free and fair election impossible.\" ,\n        </li><li>\n          In April of 2021, the NLRB found merit to claims that Amazon had violated labor laws when firing two workers who criticized the employer's practices. Amazon recently reached a settlement with the workers.\n        </li><li>\n          In August of 2021, the NLRB charged Amazon with unlawfully interfering with worker organizing by stopping an employee in its Staten Island warehouse from handing out pro-union leaflets.\n        </li><li>\n          In October of 2021, the New York Times obtained hundreds of pages of internal company documents suggesting widespread human resources mismanagement at Amazon leading to wrongful termination of employees and ineffective distribution of worker benefits, and leaving many workers without recourse. Interviews conducted by the Times suggest a focus on \"customer experience\" rather than employee welfare.\n        </li><li>\n          On December 13, 2021, the Occupational Safety and Health Administration (OSHA) announced it would investigate the collapse of an Amazon warehouse in Edwardsville, Illinois after a tornado struck the facility, killing six people. Reports indicate that one of the employees killed by the collapsed building had texted his girlfriend claiming that the company would not allow him leave the facility to go home during the storm. Other Amazon workers have voiced concerns regarding the company's alleged lack of emergency response training, stringent cellphone policies, and expectations that workers continue to work during tornado warnings.\n        </li><li>\n          Ongoing reports of workers not having time to use the restroom on the job, and being forced to resort to extraordinary measures such as urinating in bottles to meet work quotas. The company initially denied these allegations, but later conceded that it was \"incorrect\" to do so.\n        </li></ul>\n      The cases mentioned above, along with other worker claims, raise serious concerns regarding Amazon's employment practices more generally. From reports covering everything from wage and hour laws to occupational safety rules, workers' concerns are clear: Amazon's business practices seem to prioritize profit over people. Given Amazon's impact on the economy as one of our nation's largest employers, and a federal contractor, it is paramount that we ensure workers are treated fairly, with dignity, and in full compliance with labor and employment laws.<br/>\n       We also note that these allegations have come at the same time as the company has experienced remarkable growth. Amazon thrived during the pandemic, even as many other companies struggled to survive. The firm grew from 800,000 employees at the end of 2019 to over 1.4 million worldwide today. In 2020, the firm's net income nearly doubled relative to the year before, and net sales grew by 38 percent to $386.3 billion. During the same period, Amazon's stock price grew by over $1,380 per share.<br/>\n       Amazon can afford to treat its workers well, and should be held accountable to do so. Today, approximately one out of every 170 U.S. workers is an Amazon employee, underscoring our particular interest in ensuring that the company's employment practices are fair, and in accordance with the law. We urge you to use every mechanism at your disposal to investigate Amazon's labor and employment practices immediately.<br/>\n       Sincerely,<br/></div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"http://www.rubio.senate.gov/public/index.cfm/press-releases?ID=A61C1DD9-4165-4315-8C95-40895502AFF2\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Marco Rubio</strong> published this content on <strong>20 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>20 December 2021 21:44:15 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Marco Rubio</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Marco-Rubio</p></div>"}