{"date": "2022-02-09 16:06:35.748000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3228.27, "close": 3180.07}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon has struck a record-breaking deal to lease space at Shepperton Studios in the company's first long-term commitment to making TV programmes and films in the UK.</p><p>The company's multimillion-pound deal with Shepperton, home to productions ranging from Alien to Mary Poppins Returns, will see it <a href=\"https://www.theguardian.com/media/2019/jul/03/netflix-strikes-production-deal-with-shepperton-studios\" data-type=\"url\" class=\"tr-link\" translate=\"no\">join its rival Netflix in having an exclusive contract</a> at the Surrey studio as the streaming wars continue to fuel a race for space to ensure that productions can be filmed without delays.</p></div><div class=\"tr-npp-body\"><p>While details of the deal have not been disclosed, it is understood that Amazon's lease is for well over 10 years – <a href=\"https://www.theguardian.com/media/2019/may/19/netflix-close-to-long-term-uk-studio-space-deal-at-pinewood\" data-type=\"url\" class=\"tr-link\" translate=\"no\">longer than similar deals</a><a href=\"https://www.theguardian.com/media/2021/nov/16/netflix-shepperton-uk-output-streaming-service\" data-type=\"url\" class=\"tr-link\" translate=\"no\">struck by Netflix</a> and Disney, which has secured space at Pinewood Studios, the parent of Shepperton – which makes it the biggest vote of confidence to date in the UK's booming £6bn TV and film production industry.</p><p>\"Shepperton has long been synonymous with top-tier television and movies and we're proud that it will be home to many [Amazon] Prime Video productions in the years to come,\" said Jennifer Salke, the head of Amazon Studios, which started filming productions in the UK in 2016 with The Grand Tour, from the ex-Top Gear hosts Jeremy Clarkson, James May and Richard Hammond.</p><p>Amazon said that the next two years were expected be its busiest yet for UK-made productions, with Shepperton due to come online in 2023 when an expansion of the site is complete.</p><p>The company would not say whether Shepperton would play a major role in the shooting of the <a href=\"https://www.theguardian.com/media/2017/nov/21/amazon-lord-of-the-rings-tv-netflix-disney-apple\" data-type=\"url\" class=\"tr-link\" translate=\"no\">eagerly anticipated Lord of the Rings adaptation</a> , after the <a href=\"https://www.theguardian.com/tv-and-radio/2021/aug/12/amazon-moves-production-of-lord-of-the-ring-tv-series-to-uk\" data-type=\"url\" class=\"tr-link\" translate=\"no\">surprise decision to shift filming</a> of the second series from New Zealand to the UK.</p><p>While Bray Film Studios and Bovingdon Airfield have been chosen as initial production facilities when filming begins this spring – between them, the locations have been used by productions including Fast &amp; Furious 6, Justice League, Rocketman and Mamma Mia! – regions of the UK <a href=\"https://www.theguardian.com/tv-and-radio/2021/aug/12/amazon-moves-production-of-lord-of-the-ring-tv-series-to-uk\" data-type=\"url\" class=\"tr-link\" translate=\"no\">including Scotland are hoping to benefit</a> from the big-budget series seeking to ape the New Zealand settings of the Peter Jackson trilogy.</p><p>For Pinewood, which has spent more than £1bn <a href=\"https://www.theguardian.com/politics/2014/jun/19/pinewood-studios-permission-double-opposition-planners\" data-type=\"url\" class=\"tr-link\" translate=\"no\">expanding its studio capacity since 2014</a> , its bet on the streaming-fuelled demand for shooting facilities is paying off.</p><p>\"It is superb for us,\" said Paul Golding, chairman of Pinewood Group. \"There are essentially five studios out there today with the guarantee, clear visibility and capacity of their production slate to enter into long-term contracts, and we now have deals with three of them.\"</p><p>The other two – the Batman-maker Warner Bros and Universal, home to the Fast &amp; Furious franchise – have their own facilities at Leavesden near Watford and the <a href=\"https://www.theguardian.com/business/2019/dec/03/sky-jobs-elstree-tv-film-studio\" data-type=\"url\" class=\"tr-link\" translate=\"no\">soon-to-open Sky Studios Elstree</a> in north London.</p><p>Pinewood and Shepperton will have grown from 29 sound stages across 100 hectares (250 acres) to 63 across 202 hectares (500 acres) when the latest investment programme is complete.</p><p>\"That is not the end of it,\" said Golding, who said Pinewood had consent for a further 65 hectares (160 acres) to be developed. \"It is a ringing endorsement of not just Pinewood, but also the UK film and TV industry.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 theguardian.com-NonSyndicated</p></div>"}