{"date": "2021-11-11 00:01:37.883000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3576.23, "close": 3472.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_4gkrkkmb&amp;referenceId=tag:reuters.com,2021:newsml_OVF30TKEJ_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_4gkrkkmb&amp;referenceId=tag:reuters.com,2021:newsml_OVF30TKEJ_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: Stocks moved lower Wednesday after fresh inflation data showed the biggest year-over-year spike in consumer prices in three decades.  After the close, Disney and Beyond Meat missed quarterly forecasts.  Conway G. Gittens has the details.<br/>Short Link: <a href=\"https://refini.tv/3kr5dky\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3kr5dky</a><br/><br/>Video Transcript:<br/><br/>Wall Street headed lower Wednesday as inflation once again reared its worrisome head. The Dow lost 240 points. The S&amp;P 500 gave up 38. The NASDAQ tumbled 263. US consumer prices surged 0.9% in October. The largest price gain in fourth months took the year-over-year inflation rate to its biggest jump in over 30 years. The latest surge in inflation hits at the heart of Main Street. Food prices, lodging costs, and filling up at the gas pump were all significantly higher. Hatem Dhiab, managing partner at Gerber Kawasaki, thinks inflation is going to force the Fed's hand to lift rates faster than it may want to.<br/><br/>If rates get to a point where they are too high, absolutely, that's going to be a problem for the stock market. However, I think this is more of a problem for the bond market right now. It's if inflation is running 4% or 5%, yields would definitely need to jump, which means bond markets will suffer quite a bit.<br/><br/>In other economic data, new applications for jobless benefits fell for the sixth week in a row. The weekly numbers were released a day early due to Thursday's Veteran's Day holiday. Meanwhile, a blockbuster IPO got Wall Street's attention. Rivian, backed by Ford and Amazon, launched the biggest US IPO of the year and the seventh biggest ever. Investors bet Rivian, which specializes in electric vans and pick-up trucks, will become the next Tesla. Shares ended their first day by soaring 29%. On the earnings calendar, Disney missed sales and profit targets after the close. Subscriber numbers for Disney+ were also disappointing. More bad news from Beyond Meat. The faux meat company posted a bigger-than-expected quarterly loss, sales missed forecasts, and the outlook was weak.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}