{"date": "2021-12-03 14:42:19.133000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3443.72, "close": 3389.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>INFORMATION ANALYSIS INC (\"IAIC-Q\")\n- Reorganization of Government Services Business &amp; Election of\n- Two New Directors\n\n     Information Analysis Incorporated a leading information technology\nservices and modernization company, announced that it is restructuring and\nreorganizing its legacy services business and new Board appointments to be\nbetter aligned with its vision for future growth.\n\n     Under the reorganization, IAI's existing professional services\nbusiness will be combined with its Tellenger subsidiary. Tellenger will\nhave a separate advisory board, led by Stan Reese and Charles May. Mr.\nReese has more than 25 years of senior management experience, including\nover a decade of strategic development and planning. Prior to serving as\nPresident of IAI, he served briefly as its CEO and was Chief Operating\nOfficer for 20 years. Lieutenant General Charles A. May USAF (Retired) is a\nconsultant focusing on national security and defense conversion issues. In\n1992, he retired from the Air Force where he last served as Assistant Vice\nChief of Staff at the Headquarters, US Air Force in Washington D.C. He is a\ngraduate of the US Air Force Academy, where he once served as Associate\nProfessor of Political Science.\n\n     This reorganization creates two open spots on the IAI Board of\nDirectors, which will be filled by James C. \"Chip\" DiPaula and Rear Admiral\n(Ret.) Paul Becker. Both appointees bring leadership and expertise in the\nintelligence community, technology, and marketing.\n\n     IAI CEO Jamie Benoit noted, \"Since joining IAI three months ago I have\nbeen working with our board and senior executives to establish a proper\nfoundation for growth. In providing Tellenger with its own advisory board,\nand moving IAI's government services business into Tellenger, we are\nensuring that we will be able to leverage Tellenger's capabilities and\nmaximize our opportunities for long-term growth. Stan Reese and Charlie May\ncontinue to be key leaders in our company and by stepping into new roles\nthey are putting Tellenger on a path to big things. Upon the imminent\nclosing of the acquisition of Gray Matters we will operate separate\nsoftware and government services businesses which we believe is the best\nway to maximize long-term shareholder value.\"\n\n     RADM (Ret.) Paul Becker\n\n     Rear Admiral (Ret.) Paul Becker served with distinction in the United\nStates Navy. In a career that spanned over 30 years as a Naval Intelligence\nOfficer in peace, crisis and combat, RADM Becker served assignments as the\nDirector of Intelligence (J2) for the Joint Chiefs of Staff, Director of\nIntelligence, United States Pacific Command, Vice Director of Intelligence,\nJoint Chiefs of Staff and Director of Intelligence, International Security\nAssistance Force, Afghanistan.\n\n     From 2016-17 RADM Becker led the Presidential Transition Intelligence\nCommunity Landing Team providing policy input and strategic guidance to new\nAdministration Secretaries and senior leaders.\n\n     RADM Becker is the founder of the Becker T3 Group LLC, a business\nfocused on global risk management, business intelligence, cyber security\nand organizational leadership. He holds an MPA from Harvard's Kennedy\nSchool of Government and a BS from the U.S. Naval Academy.\n\n     Chip DiPaula\n\n     Chip DiPaula is an accomplished senior executive who has launched, led\nand exited high-growth technology organizations and succeeded at the\nhighest levels of government and politics. A recognized expert in digital\nmarketing, Chip is the Co-Founder of Flywheel Digital, a pioneering digital\nadvertising firm that optimizes ecommerce sales for the world's largest\nbrands, including Amazon.\n\n     DiPaula also serves as the Chairman of the University System of\nMaryland Medical System, with 25,000+ employees and more than $4 billion in\nannual revenue. From 2005 to 2007, DiPaula served as Chief of Staff to the\nGovernor of Maryland. In 2000, he served as Chief Executive Officer of the\nRepublican National Convention - the youngest person ever to run a national\nconvention.\n\n     With diverse expertise from his career as an entrepreneur, technology\nand real estate executive, public servant, and political strategist,\nDiPaula has spent his career successfully enabling organizations to set and\nachieve ambitious strategic goals. He is a graduate of Towson University.\n\n     \"The addition of Admiral Paul Becker and Chip DiPaula are important\ncomponents of our transformation strategy,\" said Jamie Benoit, IAI Chairman\nand CEO. He added, \"Paul Becker's deep understanding of the intersection of\nintelligence operations and commercial technology will be vital as our team\npositions itself in the government markets. Chip DiPaula's unique expertise\nin digital marketing and corporate communications is an equally critical\nfoundation in our larger strategy. I'm looking forward to their partnership\nduring this exciting time.\"\n\n     About Information Analysis Incorporated\n\n     Information Analysis Incorporated (www.infoa.com), headquartered in\nFairfax, Virginia, is an information technology products and services\ncompany. The Company specializes in software conversions, systems\nmodernization and security.\n\n     In August 2021, IAI appointed Jamie Benoit Chairman and CEO to lead a\ncorporate transformation of IAI into a provider of Zero Trust technology\nsolutions to commercial and government organizations.\n\n     Additional information for investors\n\n     This release may contain forward-looking statements regarding the\nCompany's business, customer prospects, or other factors that may affect\nfuture earnings or financial results. Such statements involve risks and\nuncertainties which could cause actual results to vary materially from\nthose expressed in the forward-looking statements. Investors should read\nand understand the risk factors detailed in the Company's 10-K for the\nfiscal year ended December 31, 2020 and in other filings with the\nSecurities and Exchange Commission.\n\nFor additional information\n\nContact Information:\n\nJeremy Hellman, CFA\nVice President\nThe Equity Group Inc.\n(212) 836-9626\n\nMatt Sands, Sr. Vice President\nmsands@infoa.com\n(703) 293-7925\n\nTel   : 703-383-3000    INFORMATION ANALYSIS INC\nFax   : 703-293-7979\nEmail : sales@infoa.com\nWWW   : <a href=\"https://www.infoa.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.infoa.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133600150.MNPRE2133600720-06250820211203</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}