{"date": "2021-11-03 07:52:26.363000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The TSX rose more than 1% Thursday, closing less than 90 points away from its record high at the start of the week, powered by big gains in Shopify and Suncor Energy after reporting earnings.</p><p>Suncor Energy, which also announced a boost to its dividend payout and said it was buying back shares, jumped 13.19% to $25.91. Shopify gained 7%.</p></div><div class=\"tr-npp-body\"><p>The Toronto Stock Exchange's S&amp;P/TSX composite index ended up 242.54 points, or 1.16%, at 21,197.53, its biggest gain since June 1.</p><p>The index lost ground on Tuesday and Wednesday after notching on Monday a record closing high of 21,284.84.</p><p>Canadian e-commerce giant Shopify Inc reported a 46% rise in quarterly revenue as consumer spending \"normalizes\" after a year of a pandemic-fueled online shopping frenzy.</p><p>Canada's No. 2 oil and gas major Suncor Energy Inc. doubled its dividend. A rebound in crude prices from pandemic-driven lows helped it post a third-quarter profit compared with a year-ago loss.</p><p>The energy sector rose 4.6% to the highest level since April 2019, while the technology group added 3.1%.</p><p>Canada's GDP report for August is due on Friday, which could offer clues on the strength of the domestic economy.</p><p>On Wednesday, the Bank of Canada signaled it could hike interest rates as soon as April 2022 and said inflation would stay above target through much of next year, due to higher energy prices and supply bottlenecks.</p><p>Wall Street closed higher on Thursday, with the S&amp;P 500 and Nasdaq boasting record closing levels thanks partly to gains by Apple and Amazon, while solid results from companies including Caterpillar and Merck helped ease concerns about slowing economic growth denting profits.</p><p>Heavyweights Tesla Inc, finishing up 3.8%, and Apple Inc, up 2.5%, spurred the Nasdaq and helped propel the index to an intraday record after the S&amp;P 500 and Dow reached fresh peaks earlier in the week.</p><p>However, after closing up 1.6%, shares of <a href=\"http://amazon.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com</a> Inc fell 3% in extended trading when it forecast holiday-quarter sales well below Wall Street expectations, as labour and supply shortages make it difficult for retailers to keep shelves stocked.</p><p>Apple was also down about 3% in after hours trading. Supply chain woes cost the company US$6 billion in sales during the company's fiscal fourth quarter, which missed Wall Street expectations, and Chief Executive Tim Cook said that the impact will be even worse during the current holiday sales quarter.</p><p>Cook told Reuters on Thursday the quarter ended Sept. 25 had \"larger than expected supply constraints\" as well as pandemic-related manufacturing disruptions in Southeast Asia. While Apple had seen \"significant improvement\" by late October in those Southeast Asian facilities, the chip shortage has persisted and is now affecting \"most of our products,\" Cook said.</p><p>Apple's quarterly report was mixed overall. Its revenues and profits for the fiscal fourth quarter were $83.4 billion and $1.24 per share, compared with analyst estimates of $84.8 billion and $1.24 per share, according to IBES data from Refinitiv.</p><p>Caterpillar Inc closed the session up 4% after reporting a better-than-expected quarterly profit on rising commodity prices, while a bullish forecast from drugmaker Merck &amp; Co Inc pushed its shares up 6%.</p><p>Investors also eyed Washington where President Joe Biden said he had secured a new US$1.75 trillion framework for economic and climate change spending.</p><p>\"Earnings continue to be very good,\" said Bill Stone, chief investment officer at the Glenview Trust Co in Louisville, Kentucky, who also noted that Biden's framework, if it succeeds, would not boost corporate taxes as investors had previously feared.</p><p>\"Underneath the surface, that's a positive for corporate earnings\" going forward, said Stone.</p><p>The Dow Jones Industrial Average rose 239.79 points, or 0.68%, to 35,730.48, the S&amp;P 500 gained 44.74 points, or 0.98%, to 4,596.42 and the Nasdaq Composite added 212.28 points, or 1.39%, to 15,448.12.</p><p>All 11 major S&amp;P sectors closed higher, with real estate, consumer discretionary, and industrials leading the gains.</p><p>Solid earnings also helped offset a report from the Commerce Department which showed the U.S. economy grew at a 2% annualized rate in the third quarter as COVID-19 infections flared up, short of the 2.7% estimate, while another set of data showed fewer Americans filed new claims for unemployment benefits last week as the labor market slowly improves.</p><p>\"Clearly we are seeing a large batch of macroeconomic data that has been coming through during the middle of third-quarter earnings reporting season and you are seeing a little bit of a tug-of-war that exists between macroeconomic data that is appearing to be somewhat softer at the margin and corporate performance which is proving to be better than expectations,\" said Bill Northey, senior investment director at U.S. Bank Wealth Management in Minneapolis.</p><p>Earnings reports have helped advance in the benchmark S&amp;P index in 10 of the previous 12 sessions, with analysts now expecting profits for S&amp;P 500 companies to grow 38.6% year-on-year in the third quarter.</p><p>Of the 244 S&amp;P 500 companies that had reported by Thursday morning, 82% had beaten estimates.</p><p>However EBay Inc shares finished down 6.8% after the e-commerce firm forecast downbeat holiday-quarter revenue.</p><p>Advancing issues outnumbered declining ones on the NYSE by a 2.15-to-1 ratio; on Nasdaq, a 2.46-to-1 ratio favored advancers. The S&amp;P 500 posted 34 new 52-week highs and 4 new lows; the Nasdaq Composite recorded 104 new highs and 96 new lows. On U.S. exchanges 11.05 billion shares changed hands compared with the 10.34 billion moving average for the last 20 sessions.</p><p><span>Read more:</span><a href=\"https://www.theglobeandmail.com/investing/markets/inside-the-market/article-market-movers-stocks-seeing-action-on-thursday-and-why-108/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Stocks that saw action Thursday - and why</a> </p><p><span>Reuters, Globe staff</span> </p><p><span>Be smart with your money. Get the latest investing insights delivered right to your inbox three times a week, with the Globe Investor newsletter.</span><a href=\"https://www.theglobeandmail.com/newsletters/#newsletter-group-3\"><span>Sign up today</span> </a><span>.</span> </p><p>Follow this link to view this story on globeandmail.com: <a href=\"https://www.theglobeandmail.com/investing/markets/inside-the-market/market-news/article-premarket-stocks-caught-in-crosshairs-of-earnings-and-central-bank/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The close: TSX enjoys biggest gain in months as Suncor, Shopify shares surge; Apple, Amazon tumble in post market</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 The Globe and Mail Inc. and its licensors. All rights reserved.</p></div>"}