{"date": "2022-01-28 19:30:06+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2792.75, "close": 2991.47}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The Day Ahead is an email and PDF publication that includes the day's major stories and events, analyses and other features. To receive The Day Ahead, Eikon users can register at <a href=\"reuters://REALTIME/verb=Headlines/ric=DAY/US\" data-type=\"newsExpression\" data-expression=\"DAY/US\" translate=\"no\" dir=\"ltr\">DAY/US</a>. Thomson One users can register at RT/DAY/US. All times in ET/GMT</p><p class=\"tr-story-p1\"></p><p>ON MONDAY</p><p><br/></p><p>Business activity in the U.S. Midwest is likely to lose some momentum in January, with the Chicago Business barometer falling to 61.7 in the month, from a print of 63.1 in December. </p><p><br/></p><p>Federal Reserve Bank of San Francisco President Mary Daly participates in virtual Refinitiv \"Breakingviews Predictions 2022\" discussion on the economy, inflation challenges and the post-pandemic job market. (1130/1630) Separately, Kansas City Fed President Esther George speaks on the economic and monetary policy outlook before the hybrid Economic Club of Indiana event. (1240/1740)</p><p><br/></p><p>Statistics Canada releases the country's industrial prices for December. Producer prices in Canada rose 0.8% in November from October. </p><p><br/></p><p>Mexico's economy likely contracted in the last three months of 2021. Gross domestic product (GDP) is expected to have shrunk in the fourth quarter by 0.3% from the previous three-month period in seasonally adjusted terms. </p><p><br/></p><p><br/></p><p>REST OF THE WEEK</p><p><br/></p><p>U.S. employment growth likely picked up moderately in January after rising far less than expected in December amid worker shortages. Economists polled by Reuters forecast the economy created 155,000 new jobs in January versus 199,000 in December. January unemployment rate is expected to stay at a 22-month low of 3.9%.  ADP National Employment Report on Wednesday is expected to show private payrolls added 208,000 jobs in January, after surging by 807,000 jobs in the month before. Market participants will also keep an eye on the Job Openings and Labor Turnover Survey, or JOLTS report for December on Tuesday and weekly jobless claims data on Thursday. On Tuesday, the Institute for Supply Management's (ISM) purchasing managers' index (PMI) is likely to come in at 57.5 in January, marking a 1.2-point deceleration from December. Meanwhile, the Commerce Department's report on Thursday is expected to show factory orders edging down 0.2% in December, following a 1.6% gain in November. On the same day, ISM’s non-manufacturing activity index is expected to fall to 59.3 in January from a reading of 62.0 in the previous month.</p><p><br/></p><p>Earnings season, meanwhile, rolls on with Google parent Alphabet Inc's and e-commerce giant Amazon.com Inc's fourth-quarter reporting on Tuesday and Thursday, respectively. Alphabet is expected to show growth in quarterly revenue and profit, powered by its ad and cloud businesses. Investors will also keep an eye on any commentary on growth in 2022. Amazon is expected to show a fall in profit, hurt by escalating costs amid supply chain issues, new logistics investments and COVID-related spending. Revenue is expected to grow at its slowest pace since the pandemic as it caps strong sales from last year when consumers were heavily dependent on online shopping. On Wednesday, Meta Platforms Inc, formerly Facebook, is expected to show a rise in revenue, while profit is expected to slightly decline. Investors will focus on commentary and the financial impact of Mark Zuckerberg's latest project, the metaverse.</p><p><br/></p><p>General Motors Co and Ford Motor Co are expected to report solid profits for the last quarter of 2021 on Tuesday and Thursday, respectively, but rarely has past performance mattered less to investors. Analysts expect both companies to be cautious in their outlooks for 2022. </p><p><br/></p><p>When Eli Lilly and Co reports fourth-quarter earnings on Thursday, investors will look for commentary on its forecast for 2022 and the company's progress in getting anti-diabetes drug tirzepatide and Alzheimer's drug donanemab approved and launched. On Wednesday, AbbVie Inc reports fourth-quarter earnings. Investors will look for commentary on its plans to diversify its portfolio beyond the world's best-selling drug Humira, set to lose exclusivity in the United States next year, and its 2022 forecast and performance of its Botox anti-wrinkle injection. Meanwhile, Biogen Inc is expected to report fourth-quarter results on Thursday, the first earnings report after the U.S. Medicare program proposed to severely limit coverage of its Alzheimer's disease drug. Investors will focus on the company's discussions with Centers for Medicaid and Medicare Services ahead of a final coverage decision, and Biogen's full-year forecast. Merck &amp; Co Inc also reports its results for the fourth quarter on Thursday. When Regeneron Pharmaceuticals Inc reports its fourth-quarter earnings on Friday, investors will look for commentary on its COVID-19 antibody cocktail and the U.S. FDA's limiting its use as it was found unlikely to work against the Omicron variant.</p><p><br/></p><p>Exxon Mobil Corp reports fourth-quarter results on Tuesday. Its rival Chevron reported a fourth-quarter profit that missed Wall Street estimates and offered a weak outlook for this year's oil and gas production.</p><p><br/></p><p>United Parcel Service Inc is expected to post on Tuesday a rise in fourth-quarter profit and revenue, benefiting from higher demand for home deliveries during the COVID-19 pandemic.</p><p><br/></p><p>D.R. Horton Inc expects to post on Wednesday a rise in first-quarter revenue helped by soaring home prices, lower interest rates and robust demand. Investors will be looking out for its full-year forecast and the impact of increased interest rates.</p><p><br/></p><p>Coffee chain Starbucks Corp is expected to post on Tuesday an increase in first-quarter revenue, helped by higher prices, new menu items and strength in its drive-thru and digital sales channels. Investors will look out for comments on labor and commodity inflation as well as the performance of its stores in China amid renewed COVID-19 restrictions.</p><p><br/></p><p>Qualcomm Inc is expected to report on Wednesday a rise in first-quarter revenue, driven by strong demand for its chips used in mobile phones, cars and other devices. On Tuesday, Advanced Micro Devices Inc is expected to post a rise in fourth-quarter revenue driven by strong demand for its chips used in gaming devices and data centers. </p><p><br/></p><p>U.S. group life insurer MetLife Inc is scheduled to report fourth-quarter earnings on Wednesday. Investors are awaiting details on how insurance claims for COVID-19 deaths as well as investment income will impact MetLife's bottom line. Prudential Financial Inc will report its fourth-quarter earnings on Thursday. Investors will watch out for similar comments.</p><p><br/></p><p>Electronic Arts Inc reports third-quarter results on Tuesday. The company is expected to show a rise in quarterly revenue, driven by demand for its popular titles like \"FIFA\" and \"Apex Legends\". On Thursday, Activision Blizzard Inc is expected to show a fall in fourth-quarter revenue due to a slowdown in pandemic-driven demand for its popular titles. Investors will also look for comments on Microsoft's recent deal to buy the video game publisher.</p><p><br/></p><p>Estee Lauder Cos Inc is expected to post a rise in second-quarter revenue on Thursday, helped by strong demand for its self-care, Clinique skincare and fragrance products. Investors await comments on supply chain disruptions and the impact of Omicron. On the same day, Ralph Lauren Corp is expected to post a jump in December quarter sales, with the company's results coming after European luxury peers reported a healthy increase in demand for high-end fashion during the holiday shopping season. On Wednesday, Capri Holdings Ltd is expected to post a rise in third-quarter revenue, helped by strong demand for its Michael Kors and Versace brands in the United States and Europe as well as higher prices. Investors will be on the lookout for comments about the impact of supply chain disruptions and store closures in Asia due to COVID-19 restrictions.</p><p><br/></p><p>PayPal Holdings Inc is likely to report on Tuesday a rise in its fourth-quarter profit as the online payment processing firm banks on users shopping online.</p><p><br/></p><p>On Tuesday, Match Group Inc is expected to show a rise in fourth-quarter revenue, due to a surge in paying users for its dating apps like Tinder and The Hinge.</p><p><br/></p><p>New York Times Co is expected to report on Wednesday a growth in fourth-quarter revenue driven by increased ad sales, as it looks to win over digital subscribers. The company hit the one million digital subscribers mark in the third quarter.</p><p><br/></p><p>Industrial-automation systems maker Emerson Electric Co is expected to post on Wednesday a rise in first-quarter revenue, helped by strong demand for automation. Investors will focus on the company's financial forecast and comments on Omicron's impact.</p><p><br/></p><p>Pinterest Inc will report fourth-quarter earnings on Thursday. Revenue and earnings are expected to rise. Investors will look out for MAU growth, advertising income and commentary on the COVID-19 impact. Updates on its creator payments scheme, which launched in October, will also be tracked.</p><p><br/></p><p>On Thursday, chocolate maker Hershey Co is expected to post a rise in fourth-quarter sales and profit, bolstered by higher prices and strong demand for its products in North America. Investors will be interested in commentary about inflationary pressures, supply chain disruptions and any forecast for the upcoming year.</p><p><br/></p><p>Several thousand workers at General Motors' Silao plant will vote on Tuesday and Wednesday to choose new labor representation, one of the first such elections under a labor reform that aims to break the grip of powerful unions that long went unchallenged, in line with the USMCA. The U.S. government is watching closely after last year filing a USMCA complaint to demand scrutiny over a workers' vote at the plant that was marred by irregularities.</p><p><br/></p><p>Purdue Pharma and its Sackler family owners have until Tuesday to conduct mediation with nine states that opposed Purdue's reorganization plan and $4.5 billion opioid litigation settlement, which includes Sackler legal protections. The goal of the mediation, which was ordered after a judge threw out the bankruptcy court's order approving the deal, is to reach an amended settlement.</p><p><br/></p><p>The U.S. House panel holds a hearing on Wednesday on self-driving vehicles, even as a push in Congress to speed the deployment of autonomous vehicles has stalled. The hearing will explore concerns related to infrastructure, safety, workforce and other impacts.</p><p><br/></p><p>The Federal Aviation Administration's (FAA) head will testify on Thursday before the U.S. House of Representatives hearing on the new C-Band 5G deployment and its impact on aviation safety. The House Transportation and Infrastructure Committee will hear from FAA Administrator Steve Dickson along with aviation and telecommunications industry officials.</p><p><br/></p><p>On Thursday, the Bank of England will announce a rate decision and publish the minutes of its meeting. While investors have been in thrall to the U.S. Federal Reserve's hawkish anti-inflation twist in 2022, the Bank of England is widely expected to hike UK interest rates for the second time in less than three months. On the same day, the governing council of the European Central Bank will hold a monetary policy meeting and deliver a press conference.</p><p><br/></p><p>Canada's main economic indicators, including November GDP and January factory activity on Tuesday, and jobs data for January on Friday could offer further cues about economic momentum. The country's economy likely expanded by 0.4% in November after growing by 0.8% in October. The IHS Markit Manufacturing Purchasing Managers' Index fell to 56.5 in December from 57.2 in November. Canada's economy likely lost 125,000 jobs in January after it had gained a net 54,700 jobs in the prior month while the jobless rate likely edged up to 6.2% from 5.9%.</p><p><br/></p><p>Brazil's central bank is expected to raise its benchmark interest rate by another 150 basis points on Wednesday as it extends an aggressive tightening cycle in the face of double-digit inflation. Since last March, policymakers have raised the interest rate to 9.25% from 2%. Other economic events, including January manufacturing PMI on Tuesday, industrial output for December on Wednesday and January services PMI on Thursday, are scheduled for release. Separately, data on Mexico's manufacturing sector is due on Tuesday.</p><p><br/></p><p class=\"tr-signoff\"> (Compiled by Sourav Bose in Bengaluru; Editing by Ramakrishnan M.)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:sourav.bose@thomsonreuters.com\" data-type=\"email\" translate=\"no\">sourav.bose@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMERS-WHATTOWATCH/</p></div>"}