{"date": "2022-01-21 07:52:35.336000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3125.98, "close": 2852.86}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>India</p></div><div class=\"tr-npp-lead\"><p>India, Jan. 21 -- Amazon is currently hosting a mega discount session on its website. Many consumer items such as laptops, mobiles, clothes, household items.. you name it, and you will find them at discounted prices. Some of these products are being sold as part of the Republic Day sale but many have discounts even otherwise.</p><p>One such segment is clothing. An interesting sub segment to look into would be sarees. Amazon has a fine collection of chiffon sarees. Chiffon sarees in solid colours really look chic and give contemporary look to the wearer. What's more is that they are relatively easy to maintain. While many do need dry cleaning, they are easier to store than say handloom ethnic wear which are high maintenance.</p></div><div class=\"tr-npp-body\"><p>Choice of colours too can add that modern touch. Primary colours like those of VIBGYOR are obviously nice to have, opting for more subtle colours add a more modern and glamorous touch to one's personality, like the one that actor Sobhita Dhupipala chose to wear for a function some time back. She wore a solid beige saree by Sabyasachi and looked stunning in it.</p><p>Amazon has many options in beige, in prints as well as in solid colours. If you are keen, then you might want to take a look.</p><p>1) GoSriKi Women's Pure Chiffon Saree</p><p>This beautiful solid beige Chiffon saree is available in six meters in length and comes with a blouse piece (0.80), which is attached with the saree. This saree can be hand washe, though a dry wash can also be done. This saree is a versatile garment and can be worn for casual evening outing, office, for a festival, a wedding or as a summer wear. It is also available in seven other colours.</p><p>2) Satrani Chiffon Saree with Blouse Piece</p><p>This printed Chiffon saree is available in beige colour with maroon floral prints. It is six yards in length and comes with a blouse piece. This saree can only be dry cleaned. It is available in two other combinations - beige - green and beige - red.</p><p>3) SOURBH Women's Multiple Lace Border Having Plastic Mirror Work Chiffon Saree with Blouse Fabric</p><p>This saree comes with multiple contrast lace border with plastic mirror work. Its blouse too is in a contrast colour. While the saree is made from Marble Chiffon fabric, the blouse is in Art Silk. The latter comes in black colour. The measurements are follows - saree (5.5 meter) and blouse (0.8 meter, unstitched). It is available in three other colours - crimson, grey and orange. This saree can be hand washed.</p><p>4) Pavecha's Women plain Maheshwari chiffon Party saree - Beige</p><p>This Poly Chiffon saree comes in a solid colour pattern. It is 6.1 metre in length and includes a blouse piece. It can be a party wear as well as casual wear.</p><p>At Hindustan Times, we help you stay up-to-date with latest trends and products. Hindustan Times has affiliate partnership, so we may get a part of the revenue when you make a purchase.</p><p>For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.comHT Digital streams Ltd Published by HT Digital Content Services with permission from Hindustan Times. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 HT Digital streams Ltd</p></div>"}