{"date": "2022-01-24 10:53:20+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n                  <span>Tata Consultancy Services' Innovation-Driven Approach, Secure &amp; Scalable Solutions, and Broad Spectrum of AWS Consulting Services, Cited as Key Strengths</span>\n                </p>\n                <p>\n                  <strong>NEW YORK | MUMBAI, January 24, 2022:</strong> Tata Consultancy Services (TCS) (BSE: 532540, NSE: TCS) has been recognized as a Leader in the ISG Provider Lens™ AWS Ecosystem Partners report for the US across Managed Services, SAP Workloads, Internet of Things, Migration Services and Consulting Services.\n      </p>\n                <p>\n        According to the report, TCS' strength lies in its innovation approach, strategic value enablement and its Business 4.0™ capabilities combined with its technology offerings. It goes on to say that TCS' ability to manage large-scale complex AWS migrations and 360-degree cloud consulting services have demonstrated significant impact both on strategic and operational outcomes of clients.\n      </p>\n                <p>\n                  <span>\"TCS leverages its deep contextual knowledge, comprehensive portfolio of industry solutions, and investments in innovation to help customers leverage new scalable business models and drive their multi-horizon transformation journeys on AWS,\"</span> said <strong>Krishna Mohan, Global Head, AWS Business Unit, TCS</strong>. <span>\"This Leadership position in the US is a reflection of our vision complemented by our strategic investments across a broad set of offerings on AWS Cloud.\"</span></p>\n                <p>\n        TCS' <a href=\"https://www.tcs.com/tcs-aws\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Business Unit</a> is a full-stack, multidisciplinary business unit that offers global enterprise customers customised end-to-end services and solutions around cloud migration, application and data modernisation, managed services, and industry-specific innovation leveraging the AWS cloud. TCS is an AWS Premier Consulting Partner, AWS Public Sector Partner, AWS Solution Provider Partner and AWS Public Sector Solution Provider.\n      </p>\n                <p>\n        TCS' large pool of AWS cloud-ready professionals leverage their domain knowledge and AWS technology building blocks to create transformational solutions contextualised to specific industry sub-verticals. Furthermore, TCS' rich portfolio of leading-edge, industry-centric products like the TCS BaNCS™ suite in financial services, TCS Optumera™ in retail, TCS HOBS™ in telecom, TCS ADD™ in life sciences, TCS Aviana in airlines and Water Cloud in utilities is available on AWS, driving synergies across the enterprise value chain and impacting every stakeholder.\n      </p>\n                <p>\n        At the recently concluded AWS re:Invent, TCS launched its <a href=\"https://www.tcs.com/tcs-launches-assessment-migration-factory-aws-mainframe-modernization\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Assessment and Migration Factory</a>, a set of proprietary tools, accelerators, and services that enable customers to accelerate the migration of their on-premise mainframe workloads to the new AWS Mainframe Modernization platform.\n      </p>\n                <p>\n                  <span>\"TCS AWS services cover the broadest spectrum of cloud technologies with a 360-degree view, integrating deep services knowledge and new technology competencies. This consulting-led, business-first approach to cloud adoption enables large and complex client tech landscapes resembling a spaghetti of legacy and hybrid infra and apps stacks, to take a giant leap to cloud, in a cost-effective as well as risk-managed and governance-assured manner,\"</span>\n                  <strong>Tapti Bandopadhyay, Principal Analyst, ISG Research.</strong>\n                </p>\n                <p>\n        TCS was recently named the AWS 2021 Rising Star Partner of the Year (Global System Integrator) in the US. TCS' decade-long strategic partnership with AWS enables it to provide a holistic cloud experience and clear value path to enterprises, delivering full-stack enterprise transformation to the cloud.\n      </p>\n                <p>\n        About Tata Consultancy Services (TCS)\n      </p>\n                <p>\n        Tata Consultancy Services is an IT services, consulting and business solutions organization that has been partnering with many of the world's largest businesses in their transformation journeys for over 50 years. TCS offers a consulting-led, cognitive powered, integrated portfolio of business, technology and engineering services and solutions. This is delivered through its unique Location Independent Agile™ delivery model, recognized as a benchmark of excellence in software development.\n      </p>\n                <p>\n        A part of the Tata group, India's largest multinational business group, TCS has over 556,000 of the world's best-trained consultants in 46 countries. The company generated consolidated revenues of US $22.2 billion in the fiscal year ended March 31, 2021 and is listed on the BSE (formerly Bombay Stock Exchange) and the NSE (National Stock Exchange) in India. TCS' proactive stance on climate change and award-winning work with communities across the world have earned it a place in leading sustainability indices such as the MSCI Global Sustainability Index and the FTSE4Good Emerging Index. For more information, visit <a href=\"https://www.tcs.com/\"><strong>www.tcs.com</strong></a>.\n      </p>\n                <p>\n        TCS Media Contacts\n      </p>\n                <p>\n        Asia Pacific\n      </p>\n                <p>\n        Email: <a href=\"mailto:wenjian.lin@tcs.com\" data-type=\"email\" translate=\"no\">wenjian.lin@tcs.com</a></p>\n                <p>\n        Phone: +65 9695 9948\n      </p>\n                <p>\n        Australia and New Zealand\n      </p>\n                <p>\n        Email: <a href=\"mailto:kelly.ryan@tcs.com\" data-type=\"email\" translate=\"no\">kelly.ryan@tcs.com</a></p>\n                <p>\n        Phone: +61 422 989 682\n      </p>\n                <p>\n        Canada\n      </p>\n                <p>\n        Email: <a href=\"mailto:Tiffany.fisher@tcs.com\" data-type=\"email\" translate=\"no\">Tiffany.fisher@tcs.com</a></p>\n                <p>\n        Phone: +1 416-456-7650\n      </p>\n                <p>\n        Europe\n      </p>\n                <p>\n        Email: <a href=\"mailto:joost.galema@tcs.com\" data-type=\"email\" translate=\"no\">joost.galema@tcs.com</a></p>\n                <p>\n        Phone: +31 615 903387\n      </p>\n                <p>\n        India\n      </p>\n                <p>\n        Email: <a href=\"mailto:saxena.kritika@tcs.com\" data-type=\"email\" translate=\"no\">saxena.kritika@tcs.com</a></p>\n                <p>\n        Phone: +91 22 6778 9999\n      </p>\n                <p>\n        Email: <a href=\"mailto:vanshika.sood@tcs.com\" data-type=\"email\" translate=\"no\">vanshika.sood@tcs.com</a></p>\n                <p>\n        Phone: +91 22 67789098\n      </p>\n                <p>\n        Middle East &amp; Africa\n      </p>\n                <p>\n        Email: <a href=\"mailto:s.hasneen@tcs.com\" data-type=\"email\" translate=\"no\">s.hasneen@tcs.com</a></p>\n                <p>\n        Phone: +00971567471988\n      </p>\n                <p>\n        Japan\n      </p>\n                <p>\n        Email: <a href=\"mailto:douglas.foote@tcs.com\" data-type=\"email\" translate=\"no\">douglas.foote@tcs.com</a></p>\n                <p>\n        Phone: +81 80 2115 0989\n      </p>\n                <p>\n        Latin America\n      </p>\n                <p>\n        Email: <a href=\"mailto:martin.karich@tcs.com\" data-type=\"email\" translate=\"no\">martin.karich@tcs.com</a></p>\n                <p>\n        Phone: +569 6170 9013\n      </p>\n                <p>\n        UK\n      </p>\n                <p>\n        Email: <a href=\"mailto:peter.devery@tcs.com\" data-type=\"email\" translate=\"no\">peter.devery@tcs.com</a></p>\n                <p>\n        Phone: +44 20 3155 2421\n      </p>\n                <p>\n        USA\n      </p>\n                <p>\n        Email: <a href=\"mailto:william.thomas@tcs.com\" data-type=\"email\" translate=\"no\">william.thomas@tcs.com</a></p>\n                <p>\n        Phone: +1 203 984 3978\n      </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.tcs.com/tcs-leader-aws-services-us-isg\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>TCS - Tata Consultancy Services Ltd.</strong> published this content on <strong>24 January 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>24 January 2022 10:53:20 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - TCS - Tata Consultancy Services Ltd.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: TCS---Tata-Consultancy-Services-Ltd.</p></div>"}