{"date": "2022-01-11 06:09:52+00:00", "ticker": "AVV", "mrkt_info": {"open": 3017.0, "close": 3130.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Dubai, UAE:</strong> AVEVA, a global leader in industrial software, driving digital transformation and sustainability, has signed a long-term partnership with EDF, the world leader in power generation, to elevate its 3D nuclear engineering program and deliver leading-edge energy-efficient performance. AVEVA will help drive EDF’s SWITCH digital transformation program with its AVEVA™ E3D Design solution and other components of the AVEVA <sup>TM</sup> Unified Engineering solution.  EDF will strengthen its engineering design portfolio by way of faster design and delivery of its nuclear plants as well as advanced safety and performance standards.</p>\n<p>By streamlining data from different design disciplines – including mechanical, electrical and civil works – several hundred users across different global locations will be able to work together within a digital twin repository, eliminating siloed engineering design approaches, avoiding data inconsistencies, and removing duplication. AVEVA technology will enable users to collaborate on shared 3D models simultaneously, thus improving the competitiveness of EDF’s nuclear engineering design processes.</p>\n<p>This partnership builds on a long-term relationship between AVEVA and EDF. AVEVA has supported EDF with 3D digital engineering solutions at its N4 nuclear plants since the 1980s. To date, AVEVA’s capabilities have enabled EDF to drive its sustainable nuclear vision by reducing operational work-hours and by enhancing data consistency.</p>\n<p>The new partnership between AVEVA and EDF is expected to generate the following results:</p>\n<ul class=\"bulleted-list arrowlist\">\n<li>Reduction in design work times and in engineering work times.</li>\n<li>Decrease in the need for re-work due to consistently accurate and high-quality deliverables.</li>\n<li>Faster development rate of 3D models.</li>\n<li>Greater project visibility for all project stakeholders.</li>\n<li>Greater collaboration between design and engineering teams.</li>\n<li>Extended asset lifespans and the ability to reduce CO₂ emissions.</li>\n</ul>\n<p>The new agreement will see AVEVA digital design systems implemented as the gold standard for all new EDF nuclear projects.</p>\n<p>EDF Group Executive Director – Engineering and New Nuclear Project, Xavier Ursat commented, “The SWITCH digital transformation program is critical to reinforce EDF’s ambition of producing low-carbon electricity and achieving our carbon neutrality objective by 2050 across our portfolio. AVEVA has been a trusted partner for EDF for more than 30 years, helping us to accomplish our digital transformation. AVEVA understands our requirements and we trust them to enable us to accelerate our clean energy goals. This extended long-term partnership supports our engineering design and operations teams and empowers them to optimize operational performance and to exploit nuclear energy efficiently.”</p>\n<p>AVEVA CEO Peter Herweck said, “We are proud to have built a trusted partnership with EDF that serves as the foundation stone of its digital transformation vision and sustainability program. Our market-leading digital engineering design enables us to support EDF in driving their net-zero energy strategy for the benefit of end consumers throughout the world. With our new agreement, AVEVA will help EDF accelerate engineering collaboration, connect teams and unlock higher performance through shared contextual data and intelligence. We look forward to assisting EDF’s expert engineers to cut design time, improve collaboration and accelerate efficient decision-making to develop the nuclear industry of the future.”</p>\n<p><strong>About AVEVA</strong></p>\n<p>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence. AVEVA’s comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries. Learn more at www.aveva.com.</p>\n<p>Copyright © 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}