{"date": "2021-11-23 02:38:14.369000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>November 22, 2021</p></div><div class=\"tr-npp-lead\"><p>Ask Rosamund Pike to briefly explain her character in Amazon's new swords-and-sorcery fantasy series \"The Wheel of Time,\" and she'll have a hard time stopping herself from excitedly chatting about who Moiraine is for five minutes.</p><p>After a lengthy explanation of the complex mythology behind the 14-book series by Robert Jordan that inspired the new TV series, she wraps up her answer by saying, \"If you want to be brief, just say she's like Gandalf in 'Lord of the Rings' and forget I said anything else.\"</p></div><div class=\"tr-npp-body\"><p>Pike and series creator Rafe Judkins (\"Agents of S.H.I.E.L.D.\") say they're seeking to avoid barriers to entry for \"Wheel\" (first three episodes streaming Friday, then weekly): Satisfying book devotees and casual new fans alike is their top priority.</p><p>\"'Gone Girl' was a massive bestseller,\" Pike says of her most famous film role, also based on a popular book. \"But if we only made a movie that satisfied the people who read the book, the movie would have failed.\"</p><p>Introducing \"Wheel of Time\" to a broader audience is no small feat for Amazon, which has invested a huge sum into bringing the beloved fantasy books to life, and already has renewed it for a second season. Like \"Game of Thrones,\" to which the fantastical \"Wheel\" will inevitably draw comparisons, the world of the series is vast and full of mythology, culture and politics. Yet Judkins wants fans to fall in love with the characters, first and foremost.</p><p>\"The thing that's always gotten people so excited about the book series and kept them reading for 14 books and a prequel book, is these characters at the center of it,\" Judkins says. \"Even if it takes them a little bit of time to catch up to the mythology of the world that we're existing in, that they can identify with these people at the center of the show and want to follow what happens to them.\"</p><p>With Pike and Judkins' help, we answer some of the biggest questions you might have about \"Wheel\" ahead of its Amazon debut:</p><p class=\"tr-npp-section-title\">Who are the major players in the 'Wheel' world?</p><p>The series is set in a world in which a select group of women have access to magical powers, but men can't tap into it without going insane and dying. When the story kicks off, an ancient evil (the \"Dark One\") is stirring and an ancient hero has been reborn into one of five young adults and friends from a tiny village: Rand (Josha Stradowski), Perrin (Marcus Rutherford), Mat (Barney Harris), Egwene (Madeleine Madden) or Nynaeve (Zoë Robins).</p><p>\"At the center of (the show) are these five kids from a mountain village who are swept out of this place and out into the adventure of the world,\" says Judkins. \"Finding out which one of them is the Dragon Reborn will hopefully let people, through the eyes of these five kids, see this giant and complex world that surrounds them.\"</p><p>Pike's Moiraine is an Aes Sedai, or a woman who can \"channel\" the \"One Power,\" performing magic. Her life's mission is to find that chosen one, known as the Dragon Reborn, and deliver him or her to a final battle with the Dark One. She shows up in the tiny village and whisks the kids away.</p><p>\"She's a woman with tremendous sense of purpose, of honor, of mission,\" Pike says. \"She's like the best army general you could wish for who has got a true north and is not going to deviate. But along the way she might make decisions that not everyone will admire because she's always got her sole purpose. And so she's not all good.\"</p><p>Moiraine is accompanied on her adventures by her \"warder,\" Lan (Daniel Henney), her sworn fighter and protector.</p><p class=\"tr-npp-section-title\">Who are the bad guys?</p><p>There are many other powerful women like Moiraine, but they don't all have the same goals.</p><p>The women who are Aes Sedai \"all have different political allegiances,\" Pike says.</p><p>\"They're divided into Ajahs, and Ajahs are like political parties. Moiraine is of the Blue Ajah, but it would mean that someone of the Red Ajah is very likely to be diametrically opposed to her.\"</p><p>Also in Moiraine's way are the forces of the Dark One, including eyeless \"fades,\" evil humans and monstrous \"trollocs\" that resemble minotaurs and other human/beast hybrids. She also has to worry about the Children of the Light, an extremist religious group that hates the Aes Sedai and seeks to burn them at the stake as witches.</p><p class=\"tr-npp-section-title\">What does magic look like in 'Wheel'?</p><p>One of Pike's favorite parts filming \"Wheel\" was figuring out how she would show Moiraine performing magic.</p><p>\"Robert Jordan describes it as channeling, which means it passes through you. So what is the cost of doing it?\" Pike says. \"I don't want it to always look easy. Because I don't think it always can be easy. ... The feeling of wielding the power is completely seductive. Almost like an elixir of very sensual (being) – a kind of total body state of pleasure.\"</p><p class=\"tr-npp-section-title\">Is this the new 'Game of Thrones,' or what?</p><p>Amazon CEO Jeff Bezos famously said he wanted the company's streaming service to find its own version of HBO's fantasy hit, and \"Wheel\" certainly looks like the first attempt to re-create the fantasy magic that brought record ratings to HBO (a series based on the world of \"Lord of the Rings\" is due on Amazon next year). But Judkins insists that \"Wheel\" is its own story that isn't trying to re-create the \"Thrones\" hype.</p><p>The \"Wheel of Time\" books \"came before 'Game of Thrones,'\" Judkins points out (the first \"Wheel\" book was published in 1990, six years before George R.R. Martin published the first \"Thrones\"). \"I think that's a problem that I see in a lot of stuff: it's always chasing that ('Thrones' phenomenon). Whenever you're in the position of chasing something you're not likely to succeed. ... We don't have to chase 'Thrones.' We can just bring this world (to life), which is really incredible.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Gannett</p></div>"}