{"date": "2022-01-24 15:40:56.439000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>INNERSCOPE HEARING TECHNOLOGIES INC (\"INND-0\")\n- Retains PCAOB Auditor Paris, Kreit &amp; Chiu LLP to\n- Perform 2019, 2020, and Q1-Q3 2021 Audits\n\n    InnerScope Hearing Technologies Inc. (\"InnerScope\" or the \"Company\"),\nan emerging and disruptive leader in the Direct-to-Consumer Hearing\nTechnology space, is pleased to announce that it has retained the audit\nservices of CPA firm Paris, Kreit &amp; Chiu LLP (\"PKC LLP\") to perform an\nindependent audit of the Company's 2019, 2020, and Q1-Q3 2021 financial\nstatements. In addition, InnerScope intends to file a Form-10 or S-1 to\nbecome an SEC Fully Reporting company once the audit is complete and\nsubmitted to the SEC, FINRA, and other regulatory agencies.\n\n   Matthew Moore, President, and CEO of InnerScope commented: \"InnerScope\nis pleased to announce the Company has formally retained CPA firm Paris,\nKreit &amp; Chiu LLP to conduct an independent audit of our 2019, 2020 and\nQ1-Q3 2021 financial statements. PKC LLP is a public accounting firm with\noffices worldwide and possesses significant experience in auditing public\ncompanies.\"\n\n   About InnerScope Hearing Technologies, Inc. (OTC PINK: INND):\n\n   InnerScope Hearing Technologies Inc. is a leading Direct-to-Consumer\n(DTC) manufacturer and distributor of FDA-registered hearing aids, hearing\nassistive devices, hearing health-related products, and Personal Sound\nAmplifier Products (PSAPs) (\"Hearing Products\") dedicated to addressing the\nglobal demand for affordable hearing solutions. InnerScope's Hearing\nProducts and its business model break through the persistent barriers that\nprevent access to effective hearing solutions.\n\n   InnerScope's recent acquisition of iHear Medical Inc., a DTC cloud-based\nhearing solution provider, gives the Company access to over 40 patents and\nan FDA-registered manufacturing and R&amp;D facility. In addition, InnerScope\nhas acquired HearingAssist, an established leader in the direct-to-consumer\nhearing aid market with a customer base of over 400,000. These\nacquisitions, combined with a partnership with Atlazo Inc., a semiconductor\ninnovator for next-generation AI smart devices, will allow InnerScope to\nbetter position itself in the direct-to-consumer hearing solutions market\nby selling advanced hearing products through Walmart and other major\nretailers.\n\n   InnerScope's full line of Hearing Health products is currently available\nthrough these multiple retail/wholesale channels: Walmart.com, Amazon.com,\nGiant Eagle, Hy-Vee, Hartig Drug, Food City, and Cardinal Health dba RGH\nEnterprises Inc. Additional major retailers in-store and online are\nlaunching soon.\n\n   For information related to InnerScope Hearing Technologies latest\nhearing aids and related hearing products, please visit:\n\n   <a href=\"http://iheardirect.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://iheardirect.com</a>\n\n   <a href=\"http://hearingassist.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://hearingassist.com</a>\n\n   For the most up-to-date information about InnerScope Hearing\nTechnologies (OTC: INND), please visit and follow our official Twitter\naccount @inndstock page:\n\n   <a href=\"https://twitter.com/inndstock\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/inndstock</a>\n\n   InnerScope Hyperlinks:\n\n   HearingAssist\n\n   hearing assist - Walmart.com\n\n   Acquisition of iHear Medical Inc.\n\n   Acquisition of HearingAssist\n\n   Direct-to-Consumer Hearing Products.\n\n   InnerScope's Hearing Health Flexible Subscription Plans\n\n   Safe Harbor\n   This news release contains \"forward-looking statements\" within the\nmeaning of Section 27A of the Securities Act of 1933, as amended, and\nSection 21E of the Securities Exchange Act of 1934, as amended intended to\nbe covered by the \"safe harbor\" created by those sections. Any statements\nthat are not historical facts contained in this press release are also\n\"forward-looking statements,\" as that term is defined under the Private\nSecurities Litigation Reform Act of 1995 (PSLRA). Such statements may be\nidentified by words such as \"expects,\" \"plans,\" \"projects,\" \"will,\" \"may,\"\n\"anticipates,\" \"believes,\" \"should,\" \"intends,\" \"estimates,\" and other\nwords of similar meaning. Such forward-looking statements are based on\ncurrent expectations, involve known and unknown risks, a reliance on third\nparties for information, transactions or orders that may be canceled, and\nother factors that may cause our actual results, performance or\nachievements, or developments in our industry, to differ materially from\nthe anticipated results, performance or achievements expressed or implied\nby such forward-looking statements. Factors that could cause actual results\nto differ materially from anticipated results include risks and\nuncertainties related to the fluctuation of global economic conditions, the\nperformance of management and our employees, our ability to obtain\nfinancing or maintain contractual relationships with vendors and customers,\ncompetition, general economic conditions and other factors that are\ndetailed in our periodic reports filed with the Securities and Exchange\nCommission (\"S.E.C.\"). We intend that all forward-looking statements be\nsubject to the safe-harbor provisions of the PSLRA, Securities Act, and\nSecurities Exchange Act.\n\n Contact Information:\n\nContact:\n\n   InnerScope Hearing Technologies, Inc.\n\n   Investor Relations\n\n   ir@innd.com\n\n   833-788-0506\n\n   www.innd.com\n\n   Investor Relations Agency Contact:\n\n   Skyline Corporate Communications Group, LLC\n Lisa Gray, Senior Account Manager\n\n   One Rockefeller Plaza, 11th Floor\n New York, NY 10020\n Office: (646) 893-5835\n Email: lisa@skylineccg.com\n\n   For the most up-to-date information about InnerScope Hearing\nTechnologies (OTC: INND), please visit and follow our official Twitter\naccount @inndstock page.\n\n Wire Service Contact\n InvestorWire (IW)\n Los Angeles, California\n www.InvestorWire.com\n 212.418.1217 Office\n Editor@InvestorWire.com\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2202300706.MNPRE2202301922-07311120220124</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}