{"date": "2022-01-14 00:40:15.763000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3304.14, "close": 3242.76}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>BLENDER BITES LTD (\"BITE-Z\")\n- Approval of Forward Share Split\n\n     Blender Bites Ltd. (the \"Company\", \"Blender Bites\" or \"Blender\"), a\nCanadian company involved in the development and marketing of a line of\npremium, organic and plant-based pre-portioned frozen functional foods,\nannounces that the Canadian Securities Exchange (the \"CSE\") has approved a\nforward share split (the \"Forward Split\") in which existing shareholders of\nthe Company will receive 1.25 common shares in exchange for every existing\ncommon share of the Company, as previously announced on January 6, 2022.\n\n     All shareholders of record on January 19, 2022, will be entitled to\nthe Forward Split. The common shares of the Company will commence trading\non the CSE on a Forward Split basis effective as of the commencement of\ntrading on January 18, 2022 (the \"Effective Date\"). The new CUISP number\nassigned to the Company's shares following the Forward Split is 09353K208\n(ISIN: CA09353K2083).\n\n     As of the date of this news release, there are currently 29,582,624\ncommon shares of the Company outstanding. Following completion of the\nForward Split, the Company will have approximately 36,978,280 common shares\noutstanding. Management of the Company is of the view that the Forward\nSplit will help to improve liquidity, reduce the recent volatility in the\nmarket and address potential short-selling activity.\n\n     Following completion of the Forward Split, shareholders of the Company\nwho hold common shares represented by a physical certificate will receive a\nletter of transmittal from the transfer agent for the Company,\nComputershare Trust Company of Canada, with instructions on how to exchange\ntheir existing certificates for post-Forward Split certificates.\n\n     About Blender Bites\n\n     Blender Bites is a Canadian company involved in the development and\nmarketing of a line of premium frozen food products with a focus on\nfunctionality. Blender Bites was founded in 2016 and was first to market in\nWestern Canada with a pre-portioned \"easy smoothie\" product that is free of\nany unnecessary inner plastic packaging. Blender Bites products are\ncertified organic, vegan, non-GMO, gluten free, dairy free and soy free.\nThey contain no added sugars and are made in Canada. Blender Bites products\nare distributed internationally across Canada and the US, and are currently\nsold in over 850 stores, including Sobeys, Safeway, Save on Foods, Whole\nFoods Market, Buy-Low/Nesters, IGA and Fresh Street.\n\n     On behalf of the Board of Directors,\nBlender Bites Limited\n\n     Chelsie Hodge, Chief Executive Officer\n\n     For further information, contact Blender IR Team at:\nEmail - investors@blenderbites.com\nTelephone - 1-888-997-2055\n\n     CAUTIONARY DISCLAIMER STATEMENT\n\n     This news release includes certain \"forward-looking statements\" under\napplicable Canadian securities legislation. Forward-looking statements are\nnecessarily based upon several estimates and assumptions that, while\nconsidered reasonable, are subject to known and unknown risks,\nuncertainties, and other factors which may cause the actual results and\nfuture events to differ materially from those expressed or implied by such\nforward looking statements. Such factors include, but are not limited to\ngeneral business, economic, competitive, political, and social\nuncertainties, and uncertain capital markets. Readers are cautioned that\nactual results and future events could differ materially from those\nanticipated in such statements. Accordingly, readers should not place undue\nreliance on forward-looking statements. The Company disclaims any intention\nor obligation to update or revise any forward-looking statements, whether\nas a result of new information, future events or otherwise, except as\nrequired by law.\n                    ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201201091.MNPRE2201203477-16250120220113</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}