{"date": "2022-02-23 08:01:00.219000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Maple Leaf Sports &amp; Entertainment and AWS Team Up to Transform Experiences for Canadian Sports Fans</b>\n</p><p class=\"bwalignc\">\n<span>MLSE and AWS will innovate together to deliver more extraordinary moments for fans of Toronto’s premier hockey, basketball, soccer, and football teams, and aid scouting and coaching decisions</span>\n</p><p>\nAmazon Web Services, Inc. (AWS), an <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com&amp;esheet=52584012&amp;newsitemid=20220223005601&amp;lan=en-US&amp;anchor=Amazon.com&amp;index=1&amp;md5=0ed6e6e4bbf7683928aa0f6ac8e678b5\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com</a>, Inc. company (NASDAQ: AMZN), and Maple Leaf Sports &amp; Entertainment (MLSE) today announced they are innovating together to transform how some of Canada’s best-known sports franchises—Toronto Maple Leafs, Toronto Raptors, Toronto Football Club (FC), and Toronto Argonauts—create and deliver extraordinary sports moments and enhanced fan engagement. MLSE selected AWS as its official cloud provider and official provider of artificial intelligence (AI), machine learning (ML), and deep learning cloud services. MLSE will use AWS’s comprehensive portfolio of cloud capabilities, including ML, advanced analytics, compute, database, and storage services to support their teams and lines of business. Innovating together, MLSE will build solutions that will support how teams play on the ice, court, pitch, or field; how players stay healthy; how fans connect with each other and experience games; and how sports franchises operate internally.\n</p><p>\nMLSE aims to offer its teams new AWS-powered insights to further improve the caliber of gameplay. Using <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Frekognition%2F&amp;esheet=52584012&amp;newsitemid=20220223005601&amp;lan=en-US&amp;anchor=Amazon+Rekognition&amp;index=2&amp;md5=9aee26538a0468e35a304d83b7f0a959\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Rekognition</a> (AWS’s service for automated image and video analysis) and <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fkinesis%2F&amp;esheet=52584012&amp;newsitemid=20220223005601&amp;lan=en-US&amp;anchor=Amazon+Kinesis&amp;index=3&amp;md5=1669014e2df7bf98219ca3bbb3ac101b\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Kinesis</a> (AWS’s service for easily collecting, processing, and analyzing video and data streams in real time), MLSE will be able to process and analyze video footage from cameras installed at team training facilities and game venues in real time to better prepare for crucial decisions during games. For example, the critical game data stored and analyzed on AWS can be viewed by coaches on the bench to help them strategize their next play.\n</p><p>\n“We built Digital Labs at MLSE to become the most technologically advanced organization in sport. As technology advances and how we watch and consume sports evolves, MLSE is dedicated to creating solutions and products that drive this evolution and elevate the fan experience. We aim to offer new ways for fans to connect digitally with their favorite teams while also seeking to uncover digital sports performance opportunities in collaboration with our front offices,” said Humza Teherany, Chief Technology &amp; Digital Officer at MLSE. “With AWS’s advanced machine learning and analytics services, we can use data with our teams to help inform areas such as: team selection, training and strategy to deliver an even higher caliber of competition. Taking a cloud-first approach to innovation with AWS further empowers our organization to experiment with new ideas that can help our teams perform their very best and our fans feel a closer connection to the action.”\n</p><p>\n“We are always searching for innovative organizations to partner with that will disrupt the norm and create the very best experience for our fans. Our partnership and what we plan to achieve with AWS will help transform Toronto’s sports and entertainment industry,” said Jordan Vader, Senior Vice President, Global Partnerships at MLSE. “Tapping into the technology developed by AWS will also enhance how we engage with fans, giving them exciting, personalized experiences in and out of our venues from before the puck drops in the rink to after the final buzzer on the court.”\n</p><p>\nMLSE will develop new technology for sports fans as well, using AWS’s broad portfolio of cloud services to create extended and unrivaled experiences for its teams’ supporters in the arena, at home, and in the metaverse. MLSE will use augmented reality (AR) and virtual reality (VR) applications and Amazon Kinesis to power its planned “Game within the Game” digital experience. With it, fans will be able to track their favorite players, access enhanced game insights in real time, take part in free-to-play gaming, and participate in on-demand sports betting. Moving forward, MLSE will work with AWS to build an at-home and in-stadium mixed-reality experience by combining visual data from cameras around the arena with sensors in players’ jerseys and the puck or ball.\n</p><p>\nMLSE’s goal is to create a more powerful sense of community through platforms such as Digital Arena (also known as “Game Time” in the MLSE teams’ mobile apps). The platform offers fans an interactive, second-screen experience where fans can share and chat with other fans, alumni, and team mascots. The experience also includes a virtual t-shirt toss and trivia game, allowing fans to connect with each other. Digital Arena aims to help fans feel closer to the game and one another, no matter where they are watching. By running Digital Arena on the world’s leading cloud, MLSE can provide a consistent real and virtual fan-engagement experience.\n</p><p>\n“AWS supports many of the world’s most exciting sports organizations with the most comprehensive and broadly adopted cloud offerings. We help organizations like Formula 1 to redesign their cars, the National Football League to train their players, and the National Hockey League to pull fans deeper into the game with a growing roster of real-time stats. We’re thrilled to grow our global sports community with MLSE and help them build a winning suite of analytics and machine learning capabilities,” said Matt Garman, Senior Vice President of Sales and Marketing at Amazon Web Services. “Together with AWS, MLSE will continue to strengthen iconic Canadian sports franchises like the Toronto Maple Leafs, Toronto Raptors, Toronto FC, and Toronto Argonauts, and help them connect with fans on a more personal level than ever before.”\n</p><p>\nCanadian hockey fans experienced the winning combination of AWS and hockey viewing with the June 2021 debut of the U.S. National Hockey League’s (NHL) two new advanced analytics during the 2021 Stanley Cup Playoffs. Shot Analytics and Save Analytics real-time stats, powered by AWS, appeared as on-screen graphics and data visualizations during NHL games, giving fans a better understanding and deeper appreciation of how their favorite players and teams perform during crucial moments. For more information about AWS and its involvement with the world’s premier professional hockey league, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fsports%2Fnhl%2F&amp;esheet=52584012&amp;newsitemid=20220223005601&amp;lan=en-US&amp;anchor=https%3A%2F%2Faws.amazon.com%2Fsports%2Fnhl%2F&amp;index=4&amp;md5=dd17b7f2e08e30ba9a127569b2931b19\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://aws.amazon.com/sports/nhl/</a>.\n</p><p>\n<b>About Amazon Web Services</b>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 84 Availability Zones within 26 geographic regions, with announced plans for 24 more Availability Zones and eight more AWS Regions in Australia, Canada, India, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2F&amp;esheet=52584012&amp;newsitemid=20220223005601&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=5&amp;md5=f582cc47f07beafb2402a840accd6909\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<b>About Amazon</b>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2F&amp;esheet=52584012&amp;newsitemid=20220223005601&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=6&amp;md5=deac4967ad99b8be492afbf1412d76ac\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p>\n<b>About Maple Leaf Sports &amp; Entertainment</b>\n</p><p>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.mlse.com%2F&amp;esheet=52584012&amp;newsitemid=20220223005601&amp;lan=en-US&amp;anchor=Maple+Leaf+Sports+%26amp%3B+Entertainment&amp;index=7&amp;md5=084c8e37c4afa52d0faecd7c5df07755\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Maple Leaf Sports &amp; Entertainment</a> (MLSE), one of the world's premier sports and entertainment companies, owns the Toronto Maple Leafs (NHL), Toronto Raptors (NBA), Toronto FC (MLS), Toronto Argonauts (CFL), Toronto Marlies (AHL), Raptors 905 (NBA G League), TFC II (USL) and Raptors Uprising Gaming Club, the Toronto Raptors esports franchise in the NBA 2K League. Its charitable arm, MLSE Foundation, focuses on funding initiatives to support youth through sport and recreational programs. In 2017 MLSE Foundation, with support of community and corporate partners, built MLSE LaunchPad, a 42,000-sq. ft. space dedicated to programming that support its four Pillars: Healthy Body, Healthy Mind, Ready For School and Ready For Work. MLSE also owns and operates Scotiabank Arena, Canada’s premier sports and entertainment venue hosting more than 200 events each year, two digital channels - Leafs Nation Network and NBA TV Canada and has a partnership with Live Nation - the largest concert promoter in the world. MLSE has also invested in and operates five of Toronto's sports facilities – Coca-Cola Coliseum, BMO Field, BMO Training Grounds at Downsview Park, home of Toronto FC's Academy and the First Team's practice facility, OVO Athletic Centre, the practice facility for the Toronto Raptors, and Ford Performance Centre for Hockey Excellence, the practice facility for the Maple Leafs and Marlies.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20220223005601r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjIwMjIzMDA1NjAxcjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=cffd60893dfed3d83aebb2ed9ee7417a0154fe01827b72440d3e854700a0f52c34b0e3efdb25fecb54e40fd5e037bf97eeb42278a8bf3d99fe9a496b1e7a04a9\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20220223005601/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220223005601/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52584012&amp;newsitemid=20220223005601&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=8&amp;md5=1c0cef6b55af66016f00dfb6376c12d8\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2022</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON-WEB-SERVICES</p></div>"}