{"date": "2021-11-04 19:52:57.718000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3384.0, "close": 3518.99}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Shop the best gift cards 2021 for last-minute gifts this holiday. There are e-gift cards from Apple, Walmart, and more, plus where to buy Amazon gift cards.</p><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p></div><div class=\"tr-npp-body\"><p>Trying to find the right gift for someone can be difficult. But this year, trying to find the right gift for someone that actually arrives on time (or isn't already sold-out) can feel impossible. Amid the struggling supply chain and product shortages, more and more people are turning to digital gifts that don't require shipping—like gift cards.</p><p>Gift cards are expected to be one of the hottest gifts this holiday season, with a recent Coinstar survey reporting that 68% of Americans would prefer to receive a gift card rather than a physical gift. To help you shop the best ones for everyone on your list, we've rounded up 25 of the best gift cards of 2021 below, from Amazon to Apple to Walmart.</p><p><span><span>Tackle your holiday shopping</span> with deals and expert advice delivered straight to your phone. Sign up for text message alerts from the deal-hunting team at Reviewed.</span> </p><p class=\"tr-npp-section-title\">1. Adidas</p><p>Adidas offers e-gift and physical gift cards in any amount from $10 to $250 in $1 increments. You can send e-gift cards immediately or schedule them to be sent at a later date.</p><p><span>Get an Adidas gift card</span> </p><p class=\"tr-npp-section-title\">2. Amazon</p><p>Amazon offers e-gift and physical gift cards in any amount from $1 to $2,000. E-gift cards can be delivered immediately, scheduled for the date of your choice or printed at home.</p><p><span>Get an Amazon gift card</span> </p><p class=\"tr-npp-section-title\">3. Apple</p><p>Apple offers e-gift and physical gift cards in any amount from $25 to $2,000. Your giftee can use it to shop the App Store, Apple TV, Apple Music, iTunes, Apple Arcade, the Apple Store app, Apple's online store, and the Apple Store. </p><p><span>Get an Apple gift card</span> </p><p class=\"tr-npp-section-title\">4. Anthropologie</p><p>Anthropologie offers e-gift and physical gift cards in any amount from $25 to $2,000. The gift cards never expire or lose value and, if you opt for a physical gift card, you can ship it anywhere in the U.S. for free.</p><p><span>Get an Anthropologie gift card</span> </p><p class=\"tr-npp-section-title\">5. Away</p><p>Away offers e-gift cards in any amount from $25 to $2,000. The gift cards never expire and you can send one immediately or schedule it for the future.</p><p><span>Get an Away gift card</span> </p><p class=\"tr-npp-section-title\">6. Bandier</p><p>Bandier offers e-gift and physical gift cards in amounts from $25 to $1,000. While all gift cards are redeemable in-store and online, you must purchase physical gift stores in-store. As for the digital gift cards, you have to email the gift card to yourself and then forward it to your giftee.</p><p><span>Get a Bandier gift card</span> </p><p class=\"tr-npp-section-title\">7. Blue Apron</p><p>Blue Apron offers e-gift cards in $65, $130 and $260 amounts to be used towards any of its subscription meal plans. You can snag an e-gift card for either food or wine, but note that there are some restrictions as to where the wine subscription boxes can be delivered.</p><p><span>Get a Blue Apron gift card</span> </p><p class=\"tr-npp-section-title\">8. Brooklinen</p><p>Brooklinen offers e-gift cards in amounts from $50 to $500. You can send it immediately or choose a date to have it sent later on.</p><p><span>Get a Brooklinen gift card</span> </p><p class=\"tr-npp-section-title\">9. Dick's Sporting Goods</p><p>Dick's Sporting Goods offers e-gift and physical gift cards in any amount from $5 to $500. You can send an e-gift card immediately or schedule it to be sent on the date of your choice.</p><p><span>Get a Dick's Sporting Goods gift card</span> </p><p class=\"tr-npp-section-title\">10. DoorDash</p><p>DoorDash offers e-gift and physical gift cards in any amount from $25 to $500. E-gift cards can be sent via email or text message immediately or scheduled for the future.</p><p><span>Get a DoorDash gift card</span> </p><p class=\"tr-npp-section-title\">11. Grubhub</p><p>Grubhub offers e-gift and physical gift cards in any amount from $10 to $1,000. All gift cards are redeemable online or on the Grubhub mobile app.</p><p><span>Get a Grubhub gift card</span> </p><p class=\"tr-npp-section-title\">12. Harry &amp; David</p><p>Harry &amp; David offers e-gift cards in any amount from $15 to $250. You can send an e-gift card immediately or schedule it to be delivered at a future date.</p><p><span>Get a Harry &amp; David gift card</span> </p><p class=\"tr-npp-section-title\">13. Home Chef</p><p>Home Chef offers e-gift cards in any amount from $50 to $500. You can print the gift card at home or have it sent to your giftee.</p><p><span>Get a Home Chef gift card</span> </p><p class=\"tr-npp-section-title\">14. Lululemon</p><p>Lululemon offers e-gift and physical gift cards in any amount from $10 to $1,000. You can have a digital gift card emailed immediately or scheduled for later, while physical gift cards will be delivered in five to 10 business days.</p><p><span>Get a Lululemon gift card</span> </p><p class=\"tr-npp-section-title\">15. Madewell</p><p>Madewell offers e-gift and physical gift cards in amounts from $25 to $500. You can choose the delivery date of e-gift cards and the physical gift cards are sent with free shipping.</p><p><span>Get a Madewell gift card</span> </p><p class=\"tr-npp-section-title\">16. Nike</p><p>Nike offers e-gift and physical gift cards in any amount from $25 to $500. All gift cards can be used at Nike and Converse online and in stores and, if you buy a physical gift card, it will be mailed to your giftee in a mini Nike shoebox. </p><p><span>Get a Nike gift card</span> </p><p class=\"tr-npp-section-title\">17. Nordstrom</p><p>Nordstrom offers e-gift and physical gift cards in any amount from $5 to $2,000. Bonus: Nordstrom claims it donates 1% of all gift card sales to nonprofit organizations in its local communities.</p><p><span>Get a Nordstrom gift card</span> </p><p class=\"tr-npp-section-title\">18. Sephora</p><p>Sephora offers e-gift and physical gift cards in any amount from $10 to $250. Digital gift cards can be sent immediately or scheduled to be delivered later.</p><p><span>Get a Sephora gift card</span> </p><p class=\"tr-npp-section-title\">19. Target</p><p>Target offers e-gift and physical gift cards in any amount from $5 to $500. You can email or text e-gift cards immediately or at a future date.</p><p><span>Get a Target gift card</span> </p><p class=\"tr-npp-section-title\">20. The Body Shop</p><p>The Body Shop offers e-gift and physical gift cards in any amount from $5 to $200. Note that, while all gift cards can be used online or in-store, physical gift cards must be purchased in store.</p><p><span>Get a Body Shop gift card</span> </p><p class=\"tr-npp-section-title\">21. The Home Depot</p><p>The Home Depot offers e-gift and physical gift cards in any amount from $5 to $2,000. Physical gift cards ship free while e-gift cards can be sent immediately or scheduled for any date.</p><p><span>Get a Home Depot gift card</span> </p><p class=\"tr-npp-section-title\">22. Uncommon Goods</p><p>Uncommon Goods offers e-gift and physical gift cards in any amount from $5 to $1,000. E-gift cards are emailed immediately while physical gift cards will arrive in three to five business days.</p><p><span>Get an Uncommon Goods gift card</span> </p><p class=\"tr-npp-section-title\">23. Walmart</p><p>Walmart offers e-gift and physical gift cards in any amount from $5 to $500. All gift cards can be redeemed online and in stores at both Walmart and Sam's Club.</p><p><span>Get a Walmart gift card</span> </p><p class=\"tr-npp-section-title\">24. Winc</p><p>Winc offers e-gift cards in amounts from $50 to $700. You can also gift one-, two- or three-month subscriptions to Winc's wine club.</p><p><span>Get a Winc gift card</span> </p><p class=\"tr-npp-section-title\">25. Xbox</p><p>Xbox offers e-gift cards in any amount from $1 to $100. It can be used to shop the Microsoft Store online, on Windows or on Xbox.</p><p><span>Get an Xbox gift card</span> </p><p><span><span>Don't get thwarted by shipping delays or sold-out favorites this holiday season.</span>  Sign up for our free weekly newsletter and get the product reviews, deals and holiday gift guides you need to start shopping now.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>This article originally appeared on Reviewed: 25 of the best gift cards to give as gifts in 2021</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}