{"date": "2021-11-15 18:51:06.758000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>AMAZON (\"AMZN-Q\")\n- More Deals Than Ever Before for Its 48-Hour Black Friday Event\n\n     Amazon announced today that more Black Friday deals than ever before\nwill be available starting on Thursday, November 25. Customers will be able\nto shop incredible deals with deep discounts on top products and must-have\nitems. In addition, customers can find deals from Amazon's independent\nselling partners, most of which are small and medium-sized businesses,\nthroughout Amazon's 48-hour Black Friday event.\n\n     Customers can also shop from Amazon's biggest selection of gift\nguides, including newly launched guides and longtime customer favourites\nlike the Small Business Gift Guide, Home Gift Guide, and Holiday Toy List,\nalong with the Electronics, Fashion, Beauty guides.\n\n     The Black Friday 48-hour deal event, from November 25 through November\n26, while supplies last, is available to shop on amazon.ca/blackfriday, on\nthe Amazon shopping app, or by asking \"Alexa, what are my deals?\" Plus,\nPrime members get 30-minute early access to select Lightning Deals on\nAmazon throughout the holiday season, and every day. Below is a sneak peek\nof top deals available during Amazon's Black Friday event, from November 25\nthrough November 26.\n\n//st\n\n  * Seasonal Fashion: Save on a selection of footwear, apparel,\naccessories, and best sellers, including up to 40% on select Levi's for the\nfamily, up to 30% on select Calvin Klein outwear, up to 20% on select\nadidas, and more. Save up to 30% on select Fall Fashion styles from Amazon\nBrands and Staples by The Drop.\n  * Electronics: Save on select 4K &amp; HD TVs from Samsung, Sony, and LG.\nSave on select headphones from Bose, Sony, and Beats. Save up to 29% on\nselect Garmin watches and navigation products. Save up to 40% on select\nSamsung desktops, monitors, TVs, and tablets. Save up to 25% on select\nlaptops. Receive a $70 Amazon promotional credit with the purchase of\nOculus Quest 2.\n  * Amazon Devices: Get $35 off the All-New Kindle Paperwhite (just\n$114.99), get $45 off the Echo Show 8 (just $84.99), get $25 off the\nAll-New Fire TV Stick 4K Max (just $49.99), get $65 off the Echo Buds (just\n$89.99), and get $65 off the Fire HD 10 Kids Pro (just $194.99).\n  * Home: Save up to 30% on select furniture and mattresses from top brand\nsuch as Zinus, Ashley, and Linenspa.\n  * Kitchen: Save up to 30% on select espresso and coffee machines from\nfavourite brands such as Nespresso, Keurig, Breville, and De'Longhi. Save\nup to 30% on select Ninja, NutriBullet, and Vitamix blenders.\n  * Beauty: Save up to 40% on select Luxury Beauty brands including OPI,\nPureology, Redken, La Roche-Posay, and more. Save up to 15% on select\nPhilips Sonicare toothbrushes. Save up to 15% on select hair appliances\nincluding the Revlon One-Step Hair Dryer. Save up to 25% on select Adidas\nfragrances. Save up to 20% on select cosmetics including COVERGIRL, L'Oreal\nParis, Sally Hansen and more.\n  * Amazon brands: Save up to 30% on select men's and women's fashion, pet\nproducts, and home essentials from Amazon Basics. Save up to 15% on select\nfurniture essentials from Amazon Basics, Rivet and Stone &amp; Beam.\n  * Holiday Toy List: Save with deals on dolls, toys, and construction sets\nfrom L.O.L Surprise!, Nerf, Barbie, and LEGO. Save on gifts from Osmo,\nMattel, and Melissa &amp; Doug.\n  * Tools and home improvement: Save with deals on tools from brands\nincluding DEWALT, BLACK+DECKER, CRAFTSMAN, and more. Make your home smart\nwith deals on Philip Hue products.\n  * Entertainment: Prime members can get 4 months of Amazon Music Unlimited\nfor free and non-Prime customers can get 3 months of Amazon Music Unlimited\nfor free. On Prime Video rent popular movies for $2.99 or less or save up\nto 50% on popular movies.\n\n//et\n\n     About Amazon Amazon is guided by four principles: customer obsession\nrather than competitor focus, passion for invention, commitment to\noperational excellence, and long-term thinking. Amazon strives to be\nEarth's Most Customer-Centric Company, Earth's Best Employer, and Earth's\nSafest Place to Work. Customer reviews, 1-Click shopping, personalized\nrecommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct\nPublishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo,\nAlexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are\nsome of the things pioneered by Amazon. For more information, visit\namazon.com/about and follow @AmazonNews.\n\n Contact Information:\n\nFor further information: [email protected] Related Links\n<a href=\"http://www.amazon.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.amazon.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2131800921.MNPRE2131803203-10492120211115</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}