{"date": "2021-12-13 14:50:19+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Sankalp Phartiyal</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">NEW DELHI, Dec 13 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Indian internet firm Grofers on Monday rebranded itself Blinkit as its CEO promised to speed up deliveries of everything from groceries to electronics in a burgeoning market dominated by Walmart's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=WMT.N\" data-type=\"ric\" data-ric=\"WMT.N\" translate=\"no\" dir=\"ltr\">WMT.N</a> Flipkart and Amazon's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> local unit.</p><p>The SoftBank-backed firm, which until now has focused mainly on grocery deliveries, has more than 100 partner stores or warehouses in eight cities through which it makes 10-minute drop-offs to shoppers, CEO Albinder Dhindsa told Reuters.</p><p>\"We saw that this is going to be the future of commerce,\" Dhindsa said. \"We are targeting to have almost 1,000 (partner) merchants by the middle of next year... we are also planning to expand to 100 cities by March.\"</p><p>Engineering graduates Dhindsa and Saurabh Kumar founded Grofers as an online grocer in late 2013.</p><p>Its expansion into the wider Indian e-commerce space pits it directly against formidable rivals such as Flipkart, Amazon and the retail push of tycoon billionaire Mukesh Ambani's Reliance <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RELI.NS\" data-type=\"ric\" data-ric=\"RELI.NS\" translate=\"no\" dir=\"ltr\">RELI.NS</a> in a market which EY expects to grow at an average 27% annually, to touch $99 billion by 2024.</p><p>Dhindsa said the company, which currently has 2,000 employees, will hire many more engineers.</p><p>\"We will add as many people as we can according to our business needs. We've hired 700 people in the last 4 months and we're looking to scale up very, very aggressively.\"</p><p>Another 20,000 people work indirectly for the firm as delivery workers and partners.</p><p>Dhindsa added that Blinkit, which counts investment firm Tiger Global and homegrown food delivery company Zomato <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ZOMT.NS\" data-type=\"ric\" data-ric=\"ZOMT.NS\" translate=\"no\" dir=\"ltr\">ZOMT.NS</a> among its backers, is currently evaluating its capital requirements but is not in a hurry to raise funds anytime soon.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Sankalp Phartiyal; Editing by Kirsten Donovan)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:sankalp.phartiyal@thomsonreuters.com\" data-type=\"email\" translate=\"no\">sankalp.phartiyal@thomsonreuters.com</a> ; +91-11-49548064; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: BLINKIT-INDIA/</p></div>"}