{"date": "2021-07-01 09:09:42.205000+00:00", "ticker": "III", "mrkt_info": {"open": 1185.5, "close": 1186.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 8362D3i Group PLC01 July 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>Disclosure requirement re: UKLA Listing Rule 15.6.8R</span>\n</p>\n<p>\n<span>Pursuant to Listing Rule 15.6.8R, 3i Group plc announces that, as at the last business day of June 2021, it had no investments in listed closed-ended investment funds which themselves do not have stated investment policies to invest no more than 15% of their total assets in other listed closed-ended investment funds.</span>\n</p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>PFUUPUMAMUPGURG</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}