{"date": "2021-11-17 12:41:33.995000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>New Delhi [India], November 16 (ANI): Hearing the plea of traders body Confederation of All India Traders (CAIT), the Delhi High Court on Tuesday directed the Competition Commission of India (CCI) to \"expeditiously\" decide on allegations of misrepresentations by Amazon while taking approval for its investment in Future Coupons Private Limited (FCPL) in 2019.</p><p>New Delhi [India], November 16 (ANI): Hearing the plea of traders body Confederation of All India Traders (CAIT), the Delhi High Court on Tuesday directed the Competition Commission of India (CCI) to \"expeditiously\" decide on allegations of misrepresentations by Amazon while taking approval for its investment in Future Coupons Private Limited (FCPL) in 2019.</p></div><div class=\"tr-npp-body\"><p>The bench of Justice DN Patel and Justice Jyoti Singh issued direction to CCI to dispose of the matter expeditiously and take a decision on show-cause notice issued to Amazon on the point of revocation of approval given to Amazon by CCI which has been challenged by Future Coupon Limited.</p><p>The CAIT was represented by Advocate Saurabh Kripal, Rajat Sehgal, and others</p><p>While intervening in the corporate fight between Future Group and Amazon, the confederation of All India Traders (CAIT) through a PIL in Delhi High court stated that CCI is seized of the matter (since March 2021) concerning false and misrepresentations by Amazon while taking approval for its investment in Future Coupons Private Limited (FCPL) in 2019.</p><p>According to the CAIT plea, CCI had issued a show-cause notice on June 4 to Amazon but more than 235 days are over and CCI is sitting on the matter without taking any decision, plea stated. \"CCI, as a regulator, cannot delay deciding a matter which has ramifications on public interest. CCI should be asked to adjudicate and decide this matter within the next few weeks,\" the plea said.</p><p>The CAIT has prayed that between the fights of corporate giants, traders should not be made a scapegoat or suffer any financial loss.</p><p>CAIT stated that Amazon's claim of control over FRL through their investment in FCPL is illegal as no foreign company is allowed to own or control a multi-brand retail company such as Future Retail Limited. \"Had Amazon declared their intent of such control and relevant fact in their notice to CCI at the time of seeking its approval, CCI would have never allowed such illegal transaction to happen and therefore we are expecting CCI to revoke its approval,\" CAIT said in a press statement.</p><p>CAIT in its press statement further said, if such misrepresentations are allowed to continue, then every company would misrepresent the facts of transactions just to seek CCI's approval and subsequently carry out a different transaction camouflaged as a transaction approved by CCI.</p><p>It further added that the proposed transactions contemplated in the FRL's Scheme, if given effect, would ensure that the tens of thousands of investors and shareholders would get a lifeline to recover their hard-earned monies entrusted to the Future Group. Banks, including public sector banks, would avoid the prospect of yet another major Non-Performing loan being added to their book</p><p>CAIT has sought relief from the Court to issue directions calling for all documents, records, internal notes, and other information relating to the subject matter of the present petition from the Competition Commission of India. (ANI)</p><p>Copyright © 2021 aninews.in All rights reserved. Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SyndiGate. All Rights Reserved.</p></div>"}