{"date": "2021-11-29 13:00:00.447000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>LAS VEGAS, Nov.  29, 2021  (GLOBE NEWSWIRE) -- At the AWS re:Invent 2021 show today, <a href=\"https://www.globenewswire.com/Tracker?data=n2IFgShE8VHXqMbY_O5wANlPYmuvO7j0NHbG9D6r1D8ZE21m8LgW2oI-eUzVjNzupBjxMWwXXnUskrb85-vY_Q==\"><u>2nd Watch</u></a>, an original AWS Premier Consulting Partner, announced the launch of its AWS Developer Acceleration (DevAx) program. For a limited time, 2nd Watch will offer training on the latest Amazon Web Services, Inc. (AWS) products and development best practices to its AWS clients.<br/></p><p>The 2nd Watch AWS DevAx program, which teaches experienced developers how to build modern, cloud-native applications and architectures, is the fastest, easiest way for developers to expand their AWS skill sets. Over the course of several days, 2nd Watch’s team of AWS-certified experts will lead customers through hands-on workshops focused on the most pressing cloud development topics. 2nd Watch will also co-develop a real-world application (in a lab environment) with the customer that illustrates the key learnings​ of one of the workshop’s six modules:</p><p>Module 1 – Lift &amp; Shift – Migrating the Monolith<br/>Module 2 – Configuring Release Automation<br/>Module 3 – Create a Microservice<br/>Module 4 – Refactoring Your Data<br/>Module 5 – Messaging &amp; Event Driven Systems<br/>Module 6 – Authentication &amp; Authorization for Microservices</p><p>“Enriching the worldwide cloud development talent pool is a top priority for 2nd Watch and all IT leaders,” said Jesse Samm, Application Modernization Practice Director at 2nd Watch. According to a Global Knowledge survey of 9,500 IT professionals, nearly 80 percent of information technology (IT) decision-makers say their in-house development teams lack the skills they need to adopt cloud services. By helping to grow the skill set of the international cloud development community, 2nd Watch empowers enterprises to accelerate their cloud-native fluency while advancing their digital transformation objectives.</p><p>“Our DevAx program was designed to enrich in-house development teams that have company-wide goals to modernize their applications and workloads,” stated Samm. “It’s perfect for teams with monolithic Java and .NET applications that want to modernize their applications and companies motivated to develop cloud-native apps. We’re excited to officially launch the program today and look forward to partnering with our clients to grow their AWS skill sets.”</p><p>2nd Watch, which has been recognized by AWS as a Premier Consulting Partner since 2012 and as an audited and approved AWS Managed Service Provider for its outstanding client experiences and depth and breadth of products and services, has extensive experience helping companies migrate to and use AWS. Global brands including Yamaha, The Coca-Cola Company, Crate &amp; Barrel, and Conde Nast have relied on 2nd Watch to guide their AWS transformation. 2nd Watch engineers and architects hold over 200 AWS certifications.</p><p>More information about the 2nd Watch AWS DevAx program can be found <a href=\"https://www.globenewswire.com/Tracker?data=G96CbOwJimMpGzxOeuDrhoLj-PCLhHVtiCKxwsrjQj2AxKMyMOFLgeo-jqVXlxHPsGXKB4rGcxE55xFQjNLNnJ5DgEIYIbcs2mvOyyfzaoU=\"><u>here</u></a> and at the 2nd Watch re:Invent booth, #702.</p><p><strong>About 2nd Watch</strong></p><p>2nd Watch is an AWS Premier Consulting Partner, providing professional and managed cloud services to enterprise clients. The company’s subject matter experts and software-enabled services provide companies with tested, proven, and trusted solutions with a focus on six solution areas - Enterprise Cloud Migration, Security and Compliance, Cloud Native and DevOps, Optimization, Data Engineering and Analytics, and Managed Services - allowing them to fully leverage the power of the cloud. 2nd Watch solutions are high performing, robust, increase operational excellence, decrease time to market, accelerate growth and lower risk. 2nd Watch helps enterprises design, deploy and manage cloud solutions and monitors business critical workloads 24x7. The company is headquartered in Seattle, Washington. To learn more about 2nd Watch, visit <a href=\"https://www.globenewswire.com/Tracker?data=dAOg6UBBcV3byvJC_9VArGorwlMy-zdsnbVxwldHA7zR3hEvB5FoxjUsQv4b4FxY-nEc5Pb7VN7TqHyaQzFd-A==\"><u>www.2ndwatch.com</u></a>.</p><p>Media Contact:<br/>Kevin Wolf<br/>Owner - TGPR<br/><a href=\"https://www.globenewswire.com/Tracker?data=VuROXBA574LzvyXreaj5z7Br21WOyw7402aasDnXV1WgoaXeW-68LRarQS_KFPWfF_j2BpRHgr6wFljZsmQKTQ==\"><u>kevin@tgprllc.com</u></a></p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODM5OTc0MCM0NTc5NzI2IzIwODc2MDA=\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RNNU9UYzBNQ00wTlRjNU56STJJekl3T0RjMk1EQT0=&amp;key=8a1847026335e77cb3e8bfdc525777938195688a4cc3fb3b26a157c56dd4d3012bbf1d5979618cdb38093da1cbc8c8174c603195f10f9f9bd925ccaecc06b38f\"/></div></div><br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/NTBlYTVjNzctYTk3Ni00N2UzLTkxMmYtOWQ1OTgwMGM0ODBkLTEwOTkxNzE=/tiny/2nd-Watch.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9OVEJsWVRWak56Y3RZVGszTmkwME4yVXpMVGt4TW1ZdE9XUTFPVGd3TUdNME9EQmtMVEV3T1RreE56RT0vdGlueS8ybmQtV2F0Y2gucG5n&amp;key=326683e1dd086b978384e8a3e2c46d8083cfc0181e5f35d7d521220f4d941cc610981f93d7c0f4df2d36534b3e2bc3cd136aba92cab27e39a3005c20fe82dfe4\"/></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">GlobeNewswire, Inc. 2021</p></div>"}