{"date": "2021-11-30 20:46:19+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <h4>\n        Infineon's AIROC™ Cloud Connectivity Manager supports the AWS IoT ExpressLink to make IoT product development simple and quick\n      </h4>\n                <p>\n                  <span>Nov 30, 2021</span>| <span>Market News</span></p>\n                <div>\n                  <p>\n          Munich, Germany, and San Jose, California - 30 November, 2021 - Infineon Technologies AG (FSE: IFX / OTCQX: IFNNY) today announced the company's new AIROC™ IFW56810 Cloud Connectivity Manager (CCM) solution supports the AWS IoT ExpressLink standards and specifications. This combined offering makes it easier and faster for companies and end customers to connect products such as industrial sensors, home appliances, irrigation systems and medical devices to Amazon Web Services (AWS). It also enables developers who are implementing first-time Internet of Things (IoT) applications to offload the complex, undifferentiated work required to securely connect devices to AWS. This allows developers to focus on their core competencies of building new and innovative products, while reducing design efforts and accelerating time-to-market. The CCM solution is pre-certified with the Federal Communications Commission (FCC).\n        </p>\n                  <p>\n          \"Traditionally, connecting devices to the cloud has been a difficult and time-consuming process that requires developers to possess a wide range of technical competencies in Wi-Fi, embedded systems, antenna design and cloud configuration along while creating complex code,\" said Rob Conant, Vice President of Software and Ecosystem at Infineon. \"With this new plug-and-play solution, engineers can easily, quickly and securely connect devices at scale to AWS. We are excited to continue our work with AWS to help engineers focus on building products that get to market faster and to create new revenue streams.\"\n        </p>\n                  <p>\n                    <strong>Key benefits of the AIROC Cloud Connectivity Manager:</strong>\n                  </p>\n                  <ul class=\"bulleted-list arrowlist\">\n                    <li>\n            Allows developers to use simple configuration commands such as \"connect\" and \"send\" to establish a connection and start streaming data to AWS within hours, not weeks\n          </li>\n                    <li>\n            Enables original equipment manufacturers (OEMs) to easily transform products into IoT devices without merging large amounts of code, or have a deep understanding of the implementation\n          </li>\n                    <li>\n            Offers the flexibility to connect various devices to AWS, while preserving the original application software and avoiding costly redesign\n          </li>\n                    <li>\n            Software upgradable via over-the-air (OTA) upgrades with the CCM solution along with support for host OTA upgrades to ensure security and future proofing\n          </li>\n                    <li>\n            Maintains fleet security and health at scale by providing an out-of-the-box solution that securely transmits data to and from the cloud via Wi-Fi\n          </li>\n                    <li>\n            CCM includes support for the CIRRENT™ Cloud ID, which ensures that each device has a unique device identity and assignment to a product company stored in a secure hardware element to ensure a fail-proof mechanism.\n          </li>\n                  </ul>\n                  <p>\n          \"The combination of Infineon's CCM and our AWS IoT ExpressLink solution gives IoT developers an easy hardware solution to securely connect their products to the cloud,\" said Yasser Alsaied, Vice President of IoT at AWS. \"This collaboration helps developers bring smarter, secure IoT devices to market. It's a very exciting time to work in IoT with much more unique customer engagements to come.\"\n        </p>\n                  <p>\n                    <strong>About AIROC Wireless Connectivity Products</strong>\n                  </p>\n                  <p>\n          Infineon's AIROC wireless products, including Wi-Fi®, Bluetooth®, Bluetooth Low Energy and Wi-Fi and Bluetooth combos, have shipped more than a billion devices and are the go-to choice for IoT solutions. The broad portfolio includes high-performing, reliable, ultra-low-power products that deliver robust industry-leading performance.\n        </p>\n                  <p>\n          AIROC products leverage a common software framework across Android, Linux, RTOS platforms and are pre-integrated with Infineon's ModusToolbox™ software and tools, allowing developers to deliver high-quality, differentiated products to market on time and on budget.\n        </p>\n                  <p>\n          More information on AIROC Cloud Connectivity Manager and the AWS IoT ExpressLink is available at <a href=\"https://www.cypress.com/products/airoc-cloud-connectivity-manager\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.infineon.com/AIROCIFW56810</a>.\n        </p>\n                </div>\n                <div>\n        Share:\n      </div>\n                <h4>\n        Information Number\n      </h4>\n                <p>\n        INFCSS202111-025\n      </p>\n                <h4>\n        Press Photos\n      </h4>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <div>\n                      <div>\n              Supporting the AWS IoT ExpressLink standards and specifications Infineon's new AIROC™ IFW56810 Cloud Connectivity Manager is a plug-and-play solution that helps engineers to easily, quickly and securely connect devices at scale to Amazon Web Services.\n            </div>\n                      <a href=\"https://www.infineon.com/export/sites/default/media/press/Image/press_photo/2021/CCM_Industrial_Factory.jpg\" data-type=\"url\" class=\"tr-link\" translate=\"no\">CCM_Industrial_Factory</a>\n                      <p>\n              JPG | 549 kb | 2126 x 1408 px\n            </p>\n                    </div>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.infineon.com/cms/en/about-infineon/press/market-news/2021/INFCSS202111-025.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Infineon Technologies AG</strong> published this content on <strong>30 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>30 November 2021 20:46:19 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Infineon Technologies AG</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Infineon-Technologies-AG</p></div>"}