{"date": "2021-12-14 13:41:08.074000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Canada NewsWire</p>\n</div>\n<div class=\"tr-npp-body\">\n<p class=\"tr-npp-section-title\">Mobileum and VoerEir Partner to Provide End-to-End Service Assurance and Network Function Virtualization Infrastructure Testing and Benchmarking</p>\n<p class=\"tr-npp-section-title\">Joint solution delivers automated, end-to-end testing and assurance for 5G networks and beyond</p>\n<p>CUPERTINO, Calif., Feb. 24, 2022</p>\n<p>\n<span>CUPERTINO, Calif.</span> , <span>Feb. 24, 2022</span> /CNW/ -- Mobileum Inc. (\"Mobileum\"), a leading global provider of analytics solutions for roaming and network services, security, risk management, testing and service assurance, and subscriber intelligence, is pleased to announce their technology partnership with VoerEir, an award-winning edge cloud technology company.</p>\n<p>The partnership between Mobileum and VoerEir creates the most comprehensive and powerful test platform for end-to-end Service Assurance and network function virtualization infrastructure (NFVI) benchmarking, certification, and validation. Combining Mobileum's <a href=\"https://www.mobileum.com/products/testing-and-monitoring/domestic-network-testing/5g-performance-testing/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">SITE active test solution</a> with <a href=\"https://www.voereir.com/touchstone/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">VoerEir's TOUCHSTONE test suite</a> provides a vertically integrated, full-stack testing solution that enables Communication Service Providers (CSPs) to test services and infrastructure from end-to-end. From the lab to the live network and from virtual and cloud-native network functions and applications (VNF/CNF) to the end device - all in a fully automated manner. Extensive RESTful API and automation capabilities allow the joint solution to be integrated into Telco Continuous Integration and Delivery (CI/CD) pipelines and provide an essential Continuous Testing (CT) component.</p>\n<p>\n<span>Gabriel Chiriacescu</span> , Mobileum's SVP for Testing and Service Assurance said: \" <span>The virtualized network infrastructure is the foundation on which 5G and future 6G cellular networks are being built. Assuring the NFVI's strict SLAs are met should be top of mind for all communication service providers. Together with VoerEir, we are proud to offer our global customers a best-in-class solution that ensures their next-generation networks are performing as expected</span> .\"</p>\n<p>\n<span>Javier Garcia Gomez</span> , VoerEir´s CEO, says: \" <span>We are excited to announce this cooperation with Mobileum, which will provide our customers with the most comprehensive end-to-end testing solution for network applications (VNF/CNF), infrastructure (NFVI), and devices. VoerEir has been working steadily over the past six years to develop the best automated NVFI performance testing solution in the industry, and thanks to this partnership, we can prepare for the next level of growth.</span> \"</p>\n<p>VoerEir's Touchstone Platform enables Telco operators to facilitate the benchmarking of multiple telco cloud environments spanning across multiple data centers. It provides support for Openstack and Kubernetes environments using an advanced test engine developed by VoerEir. The Touchstone platform includes a wide array of features for environment benchmarking, report management, and Enhanced Platform Aware (EPA) test suites. It is a leading-edge platform for cloud environment test automation, benchmarking, certification, and validation.</p>\n<p>The Mobileum-VoerEir partnership marks an important breakthrough for operators looking to accelerate their 5G rollouts and scale 5G and Edge testing capabilities. It also highlights Mobileum's open collaboration strategy of working alongside technology partners to integrate and expand its analytics capabilities to help CSPs meet their subscribers' rising service performance standards and expectations.</p>\n<p>\n<span>About Mobileum Inc.</span> Mobileum is a leading provider of Telecom analytics solutions for roaming, core network, security, risk management, domestic and international connectivity testing, and customer intelligence. More than 1,000 customers rely on its Active Intelligence platform, which provides advanced analytics solutions, allowing customers to connect deep network and operational intelligence with real-time actions that increase revenue, improve customer experience, and reduce costs. Headquartered in Silicon Valley, Mobileum has global offices in <span>Australia</span> , <span>Germany</span> , <span>Greece</span> , <span>India</span> , <span>Portugal</span> , <span>Singapore</span> , UK, and <span>United Arab Emirates</span> .Learn more in <a href=\"https://www.mobileum.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.mobileum.com/</a> and follow @MobileumInc on Twitter</p>\n<p>\n<span>About VoerEir AB</span> VoerEir AB offers Touchstone, a test tool to facilitate telco cloud testing, deployment, and operation. VoerEir is headquartered in Kista ( <span>Sweden</span> ) and supplies its test suite and services to Tier-1 Telecommunication Operators and Vendors operating in several countries in <span>Europe</span> , the <span>Middle East</span> , and <span>Asia</span> .</p>\n<p>Learn more in <a href=\"https://www.voereir.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.voereir.com/</a>\n</p>\n<p>Logo - <a href=\"https://mma.prnewswire.com/media/1431792/Mobileum_Logo.jpg\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://mma.prnewswire.com/media/1431792/Mobileum_Logo.jpg</a>\n</p>\n<p>View original content: <a href=\"https://www.prnewswire.com/news-releases/mobileum-and-voereir-partner-to-provide-end-to-end-service-assurance-and-network-function-virtualization-infrastructure-testing-and-benchmarking-301488935.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/mobileum-and-voereir-partner-to-provide-end-to-end-service-assurance-and-network-function-virtualization-infrastructure-testing-and-benchmarking-301488935.html</a>\n</p>\n<p>SOURCE Mobileum</p>\n<p>View original content: <a href=\"http://www.newswire.ca/en/releases/archive/February2022/24/c8402.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.newswire.ca/en/releases/archive/February2022/24/c8402.html</a>\n</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 CNW Group Ltd.</p></div>"}