{"date": "2021-12-06 16:52:13+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        Small businesses around the globe are increasingly looking for faster, simpler, and more cost-effective ways to buy technology. In our last <a href=\"https://blogs.cisco.com/smallbusiness/the-big-risk-of-fraudulent-products-for-small-business\"><span>blog</span></a>, we shared the benefits and risks of new routes to market and focused particularly on the ease of purchasing online. With this, comes a risk of purchasing inferior quality or even counterfeit goods. Cisco Brand Protection has initiated a dedicated, broad-based effort to identify and take down fraudulent sites and false advertisements around the globe.\n      </p>\n                <p>\n        Cisco's Global <a href=\"https://www.cisco.com/c/en/us/about/legal/brand-protection.html?dtid=oblgzzz001087\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Brand Protection</a> group includes an amazing squad of investigators and engineers who actively monitor the marketplace to identify sellers of counterfeit products and takes steps to curb this problem.\n      </p>\n                <p>\n        Amazon has an <a href=\"https://sellercentral.amazon.com/gp/help/external/201165970\" data-type=\"url\" class=\"tr-link\" translate=\"no\">anti-counterfeit policy</a> that prohibits the sale of counterfeit or inauthentic products. Amazon has invested hundreds of millions of dollars and has over 10,000 employees who are dedicated to ensuring that customers only purchase safe, authentic, and legitimate products. While 99.99% of goods sold on Amazon do not yield a valid counterfeit complaint, Amazon won't be satisfied until that number is 100%, and has partnered with Cisco in its effort to drive counterfeits to zero.\n      </p>\n                <p>\n        Cisco works closely with Amazon's Counterfeit Crimes Unit (CCU) to help hold counterfeiters accountable through the courts and through law enforcement. This global team-which is made up of former federal prosecutors, experienced investigators and data analysts-pursues targets around the globe.\n      </p>\n                <p>\n        Cisco is the big company that loves small businesses and will always join forces with our partners to do everything we can to educate you and your peers, and to mitigate risk so that you can rest assured that you are #BuyingRight with Cisco.\n      </p>\n                <p>\n                  <span>\"We've enjoyed a close relationship with Cisco's Global Brand Protection group, which has enabled both companies to protect their customers from counterfeit products and bring justice to those who sell inauthentic Cisco products.\"- Kebharu Smith, CCU Director at Amazon.</span>\n                </p>\n                <p>\n                  <strong>Have questions?</strong>\n                </p>\n                <p>\n        Head over to our <a href=\"http://www.cisco.com/go/brandprotection\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Brand Protection site</a> to learn more about the dangers of unauthorized counterfeit products, as well as what you can do and what you can expect from Cisco and our partners.\n      </p>\n                <p>\n                  <strong>Helpful Resources:</strong>\n                </p>\n                <p>\n        Visit Amazon Cisco stores\n      </p>\n                <p>\n        Cisco Partner Blog: <a href=\"https://blogs.cisco.com/partner/look-closely-before-hitting-buy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Look Closely Before Hitting \"Buy\"</a></p>\n                <p>\n        Share:\n      </p>\n                <br/>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://blogs.cisco.com/smallbusiness/cisco-and-amazon-against-counterfeiting-fighting-the-good-fight-together\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Cisco Systems Inc.</strong> published this content on <strong>06 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>06 December 2021 16:52:13 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Cisco Systems Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Cisco-Systems-Inc.</p></div>"}