{"date": "2021-11-17 19:27:31.940000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>— <span>Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>The holiday shopping season is in full swing, and Amazon Black Friday 2021 deals are finally here. Amazon announced on <span>November 15</span> that it would be hosting a 48-hour sale with \"more deals than ever before\" starting on <span>Thanksgiving Day, November 25</span> —but hasn't shared what, exactly, will be on sale. In the interim, however, we have good news: Whether you're looking for the perfect Christmas gifts, some top-rated tech or something for your kitchen to make holiday cooking less stressful, the shopping giant already has some of the best Black Friday 2021 deals you can find online right now.</p></div><div class=\"tr-npp-body\"><p><span><span>Tackle your holiday shopping with deals and expert advice delivered straight to your phone.</span> Sign up for text message alerts from the deal-hunting team at Reviewed.</span> </p><p>Below, you'll find Amazon Black Friday 2021 deals on beloved page-turners, most-wanted NFL gifts and upgraded streaming devices, all of which have been vetted by our team of deals experts to make sure they're \"best of web\" prices. Meanwhile, you can check off even more things on your holiday shopping list and save big with markdowns on must-have products during Best Buy and Walmart's early Black Friday sales.</p><p>► <span>Amazon Black Friday 2021:</span> Amazon Black Friday 2021 sale to start on Thanksgiving with 'more deals than ever before'</p><p>If you're not already an Amazon Prime subscriber, you can sign up for a 30-day membership for free to gain early access to plenty of Amazon Black Friday deals. An Amazon Prime subscription gets you free two-day shipping, plus tons of other benefits, for $12.99 a month ($6.49 for students and $5.99 for those receiving qualifying government assistance).</p><p class=\"tr-npp-section-title\">The 5 best Amazon Black Friday 2021 deals you can get today</p><p><big>1. Up to 70% off: These top-rated books</big> </p><p>If you're looking to cozy up with a new book this winter, Amazon has a collection of highly-rated titles on sale in hardcover, paperback, Audible audiobook and Kindle. You can get the hardcover version of <span>In the Heights: Finding Home</span> , an inside look at the hit Broadway musical, by Lin-Manuel Miranda, Quiara Alegría Hudes and Jeremy McCarter for $17.89 (55% off). Or brush up on literary classics including the 1846 revenge epic <span>The Count of Monte Cristo</span> by Alexandre Dumas for 41% off at $9.49 in its Kindle version. You can also get <span>Letters to a Young Athlete</span> by Chris Bosh and Pat Riley for $12.99, or 50% off, in hardcover. </p><p><span>Save up to 70% on select books</span> </p><p><big>2. Save $100: One of our favorite massage guns</big> </p><p>Keep your muscles from tightening after even the most intense workout with the Vybe Pro massage gun. Normally listed for $199.99, you can get this percussion gun for $100 off when you check off the coupon on the main page. We named the Vybe Pro our favorite affordable massage gun thanks to its nine speed settings and eight attachments, double what other guns have. You can also easily change the speed of the gun, which has a memory function that stays on the level you had it at before turning it off.</p><p><span>Get the Vybe Pro Percussion Massage Gun for $99.99 with coupon (Save $100)</span> </p><p><big>3. Up to 30% off: These NFL gifts</big> </p><p>With football season heating up, Amazon is offering a variety of NFL-themed items on sale so shoppers can give a gift as exciting as Super Bowl Sunday. There's the Wild Sports tabletop stackers game with NFL team color designs available for as low as $14.39 (a 28% discount) in the Green Bay Packers edition. You can bring some football fever to the kitchen with a Pro Specialties Group oven mitt and pot holder set with the classic Oakland Raiders logo down to $10.14 from its list price of $17.89. There's even a Dallas Cowboys edition of the Rico Industries leather trifold wallet down 25% for $26.36. </p><p><span>Save up to 30% on NFL apparel</span> </p><p><big>4. Save $120: This spacious standing desk</big> </p><p>Revamp your home office with a Flexispot electric standing desk that you can now get for a shockingly low price. The 48-by-24 inch black desk is usually listed for $239.99, but you can get it for $119.99 by using the coupon code <span>50ZWPWQY</span> at checkout—that's a $120 price cut! Flexispot says the desk has the space for two monitors and a laptop with an overall weight capacity of 154 pounds. It also features a motor lift mechanism that allows you to adjust the height with ease. </p><p><span>Get the Flexispot 48x24 Electric Standing Desk for $119.99 with coupon code 50ZWPWQY (Save $120)</span> </p><p><big>5. As low as $20: This powerful streaming device</big> </p><p>Amazon recently released upgraded versions of their popular Fire TV Sticks and you can get two of them for great discounts today. The Fire Stick 4K MAX is available for $34.99 (36% off its list price of $54.99) and the standard Fire TV Stick is on sale for $19.99 (50% off its list price of $39.99). Amazon claims the 4K MAX is 40% more powerful than the Fire Stick 4K, which we named one of the best streaming devices for its excellent remote and support of major streaming services like Disney+, Prime Video and more. The 4K MAX has that same remote and multi-service compatibility but promises faster app starts and smoother navigation through its interface. Though the standard Fire TV Stick doesn't offer the same upgraded picture and sound quality when streaming, it still has the feature-loaded remote and promised faster streaming.</p><p><span>Get the Amazon Fire TV Stick for $19.99 (Save $20)</span> </p><p><span>Get the Amazon Fire Stick 4K MAX for $34.99 (Save $20)</span> </p><p class=\"tr-npp-section-title\">Amazon Black Friday 2021 deals you may have missed </p><p><big>1. Bose QuietComfort 35 Series 2 Gaming Headset</big> </p><p>If you want your headphones to be wireless for music and wired for gaming, the Bose QuietComfort 35 Series 2 headphones are a solid 2-in-1 device to score. Normally priced at $329, you can get these noise-canceling headphones with a detachable microphone on sale for $279. When we tested the Series 2, we found it offered great sound quality, whether for a pop album or first-person shooter. It also has some of the best active noise canceling we've ever heard from a gaming headset, and is specifically strong against low droning noises. </p><p><span>Get the Bose QuietComfort 35 Series 2 Gaming Headset for $279 (Save $50)</span> </p><p><big>2. Holiday Treats</big> </p><p>There are plenty of ways to satisfy your sweet tooth this holiday season with deals on these delicious delectables. Coffee fans can get a five-pack of Starbucks Holiday Blend Nespresso capsules for just $29.99, a 33% discount. Oreo is offering 12 four-ounce snack packs together for 25% off at $15.50. Even Swiss Miss is selling a 28-pack of its hot chocolate k-cup pods for $14.44, a 15% discount.</p><p><span>Save up to 47% on holiday-themed treats</span> </p><p><big>3. Cubii JR1 Under Desk Elliptical Machine</big> </p><p>Keep your fitness progress going while staying on-task at work with the Cubii JR1 elliptical machine for $249. Typically listed for $279, this pedal exercise machine is now 11% off. We found the JR1 to be an option for those working from home thanks to its accessibility and multiple resistance levels. Though not meant to be a full-on replacement for workouts, the whisper-quiet machine lets you stay active on even the longest days at your desk. </p><p><span>Get the Cubii JR1 Under Desk Elliptical Machine for $249 (Save $30)</span> </p><p><big>4. SpaceSaver Premium Vacuum Storage Bags Variety 12-Pack</big> </p><p>If you're about to switch out your wardrobe, these SpaceSaver premium storage bags help protect your clothes and make less clutter in your closet. You can get a 12-pack of these vacuum-seal bags in multiple sizes normally listed for $44.99 down to $38.24. We found the SpaceSaver bags to be the best storage container for soft loads, with 80 percent more space than other competing bags, and since they are vacuum-sealed, the bags promise no mold, mildew or bacteria inside.</p><p><span>Get the SpaceSaver Premium Vacuum Storage Bags Variety 12-Pack for $38.24 (Save $6.75)</span> </p><p><big>5. Amazon Music Unlimited and Showtime Prime Channel</big> </p><p>Ready to start streaming holiday movies and listening to Christmas songs? Right now new subscribers of Amazon Music Unlimited and Showtime can snag a three-month subscription to both services for just $2.97—or 99 cents a month. That means eligible shoppers can gain access to more than 75 million songs and watch ad-free movies and shows all while saving $53.97 during the three-month span. Following the promotion period, the Amazon Music Unlimited subscription will ring up at $9.99 a month (or $7.99 for Prime members), while Showtime will cost $10.99 monthly. </p><p><span>Get Three Months of Amazon Music Unlimited and Showtime for $2.97 (Save $53.97)</span> </p><p class=\"tr-npp-section-title\">Other noteworthy Amazon Black Friday 2021 deals we found</p><ul class=\"bulleted-list arrowlist\"><li>Get up to 25% back on select Amazon purchases with an Amazon Prime Card and eligible Prime membership </li><li>Save up to 20% on Tuft &amp; Needle Mattresses and Sleep Accessories</li><li>Save up to 29% on Bose Earbuds</li><li>Kasa Outdoor Smart Plug for $15.99 (Save $9)</li><li>Hamilton Beach Electric Tea Kettle for $24.88 (Save $10.11)</li><li>Eufy by Anker BoostIQ RoboVac 11S for $137.98 (Save $92.01)</li><li>Samsung Galaxy Watch Active 2 for $199.99 (Save $50)</li><li>Samsung 2 TB T7 Portable SSD for $249.99 (Save $80)</li><li>Toshiba 65-Inch LED 4K UHD Smart Fire TV for $529.99 (Save $190)</li><li>iRobot Roomba i6+ for $549.99 (Save $250)</li> </ul><p class=\"tr-npp-section-title\">When is Amazon Black Friday 2021? </p><p>Amazon Black Friday 2021 deals are in full swing. This year, Amazon kicked off its holiday shopping season earlier than ever. The popular online retailer announced its first wave of Black Friday sales on <span>October 4</span> , with markdowns across all categories. On <span>November 15</span> , the brand announced it will host a 48-hour sale starting at 12:01 a.m. PST on  <span>Thursday, November 25. </span> Amazon also announced a list of its most-loved gifts available right now. We expect to see even deeper discounts on everything from kitchen essentials and electronics to toys and fashion pieces in the coming weeks. </p><p class=\"tr-npp-section-title\">What are the best deals from the Amazon Black Friday 2021 sale? </p><p>To date, we've seen massive Amazon Black Friday deals on air fryers, headphones, home goods and more—including tons of products from some of our favorite brands, like Apple, KitchenAid, Instant Pot, Sony, Bose, iRobot and Shark.</p><p>Every day Amazon adds even more sales to their lineup of Black Friday 2021 deals. Be sure to bookmark this page and check back frequently to scoop the hottest Amazon discounts on must-have items this holiday season. </p><p class=\"tr-npp-section-title\">Are Amazon Black Friday sales available online? </p><p>Yes. Amazon Black Friday sales are exclusively available online. </p><p class=\"tr-npp-section-title\">What's the difference between Amazon Black Friday deals and Amazon Cyber Monday deals? </p><p>With Amazon Black Friday deals already here, the early holiday sales double as both Black Friday discounts and pre-Cyber Monday deals. While, technically, Amazon Cyber Monday deals roll out as soon as Black Friday ends on <span>November 26</span> , we expect to see significant overlap in Amazon's roundup of Black Friday and Cyber Monday markdowns. Both waves of holiday deals will be exclusively available online, so be sure to secure your Amazon Prime membership ahead of time to enjoy fast and free shipping. </p><p class=\"tr-npp-section-title\">Does Amazon have special Black Friday deals for Amazon Prime members? </p><p>Yes. During the holiday shopping season, Amazon Prime members have early access to select holiday deals and can even earn up to 25% back on select Amazon purchases with an Amazon Prime Card and an eligible Prime membership. Meanwhile, Prime members can get their holiday gifts quicker with access to free and fast shipping, with millions of must-have items available for same-day delivery. If you aren't already an Amazon Prime member, don't worry—there's still plenty of time to sign up.    </p><p class=\"tr-npp-section-title\"><span>When does the Amazon Black Friday sale end?</span><span> </span> </p><p>The Amazon Black Friday sale ends on <span>November 26</span> , with Amazon Cyber Monday deals rolling out the following day, on <span>November 27</span> . Keep in mind, however, that many of the markdowns included in the Amazon Black Friday sale are one-day deals. </p><p>Following the Black Friday and Cyber Monday weekend of sales, we expect to see discounts on select items throughout the holiday season—however, with shipping delays and stock shortages expected, we recommend shopping early to ensure you get all the holiday gifts on your list this year. </p><p class=\"tr-npp-section-title\">Shop Amazon Black Friday 2021 deals right now. </p><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Amazon Black Friday 2021 deals are live: Save on Fire TV Sticks, NFL apparel and more</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}