{"date": "2021-12-01 17:43:22.826000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MATTERPORT INC (\"MTTR-Q\")\n- Delivers New And Innovative Solutions For The Built World With\n- AWS\n\n     Matterport, Inc. (\"Matterport\"), the leading spatial data company\ndriving the digital transformation of the built world, announced the\navailability of its platform in AWS Marketplace, an online software store\nthat helps customers find, buy, and immediately start using the software\nand services that run on Amazon Web Services (AWS). As a result, AWS\ncustomers will be able to access the power and capabilities of Matterport's\ndigital twin technology with AWS add-ons that supercharge the value of\ndigitization. In addition, they will benefit from the joint offerings that\nthe companies take to market. Matterport and AWS will collaborate amongst\ntechnical teams to build deep technology integrations, as well as their\nsales and marketing teams to serve new enterprise customers.\n\n     \"With the hundreds of fully featured AWS services, we're excited that\nour customers can now easily capture their spaces and incorporate the\nMatterport spatial data platform into a wide range of solutions,\" said\nPrabal Acharyya, Global Head of IoT Partners for Energy and Process\nIndustries at AWS. \"Matterport is uniquely positioned to help customers of\nall types take full advantage of integrating their AWS cloud provider\nservices with their digital twins, accelerating the digitization of their\nspaces, while harnessing the power of their data assets.\"\n\n     Hundreds of thousands of companies in over 170 countries use\nMatterport's spatial data platform to turn any space into a photorealistic,\ndimensionally accurate digital twin. As an official AWS Independent\nSoftware Vendor (ISV) Partner and member of the AWS Partner Network (APN),\nMatterport will reach companies across the world that need a simple and\ncost-effective way to digitize their buildings and spaces. And, they can\naccess a free trial to instantly capture digital twins on their iOS or\nAndroid devices.\n\n     \"Although our digital twin vision was designed to enhance the operator\nand mechanic experience, we quickly expanded our use cases to include\ntraining, employee orientation, and office space optimization. Moving\nforward, I anticipate identifying even more opportunities to use Matterport\nthroughout our organization,\" says Dane Laughlin, Innovation Engineer at\nINVISTA, a world leader in supplying nylon 6,6 chemical intermediates,\npolymers and fibers used in the automotive, electronics, carpet and\nclothing industries.\n\n     Matterport Delivers Groundbreaking Enterprise IoT Solution\nWith over six million spaces captured to date, Matterport is building the\nlargest library of spatial data and information and it's open for\ninnovation through its developer tools. Matterport's Application\nProgramming Interfaces (APIs) and Software Development Kits (SDKs) allow\nits partners to build new solutions and custom add-ons on top of its\nplatform to address multiple use cases across an array of industries.\n\n     Matterport will work with AWS to develop and deliver best-in-class\nenterprise solutions that leverage Matterport digital twins. The first\noffering launched today by AWS is AWS IoT TwinMaker, a new service that\nmakes it easier for developers to create digital twins for the IoT\n(Internet of Things), smart buildings, industrial, and manufacturing\nindustries. With Matterport as a launch partner, AWS IoT TwinMaker allows\ncustomers to contextualize their digital twin data, gather insights and\nanalytics, as well as virtually access real-time and time-series replicas\nof their spaces. Groundbreaking capabilities include:\n\n     *  The ability to create 3D scenes with spatial anchors linked to\nreal-world data. Customers can take a Matterport digital twin, overlay\nequipment within it, then tag the space with anchors to connect those\nmodels with a knowledge graph created and managed by AWS IoT TwinMaker.\nThis knowledge graph enables the integration of data, such as heat mapping\nor temperature control, into the Matterport digital twin.\n     *  Better facilities management by establishing real-time remote\nmonitoring, process optimization and historical root cause analysis.\nCustomers can connect to disparate data sources to optimize site visits and\nassess issues immediately.\n     *  The option to build user-centric web apps on top of digital twins,\nwhether it's an app for training employees, or an app to trigger\nnotifications if there is an abnormal change in the device data.\n\n     \"AWS IoT TwinMaker is a perfect example of how companies like AWS can\nwork with Matterport to create unique and valuable experiences for our\nmutual enterprise customers. This demonstrates Matterport's unique ability\nto serve as the primary visualization layer of any space that enables a\ncontextual view of the data and analytics associated with that space, as\nwell as real-time and time-series access to them,\" said Conway Chen, Vice\nPresident of Business Development and Alliances at Matterport. \"We're\nseeing Matterport being used as the fabric of the built world,\nsupercharging use cases across the board from smart buildings, smart homes,\nand more, ultimately unlocking digital twin technology with unmatched AI\nand deep learning analytics.\"\n\n     For more information about how Matterport is working with AWS, please\nvisit the AWS IoT TwinMaker webpage.\n\n     About Matterport\n\n     Matterport, Inc. is leading the digital transformation of the built\nworld. Our groundbreaking spatial data platform turns buildings into data\nto make nearly every space more valuable and accessible. Millions of\nbuildings in more than 170 countries have been transformed into immersive\nMatterport digital twins to improve every part of the building lifecycle\nfrom planning, construction, and operations to documentation, appraisal and\nmarketing. Learn more at matterport.com and browse a gallery of digital\ntwins.\n\n     (c)2021 Matterport, Inc. All rights reserved. Matterport is a\nregistered trademark and the Matterport logo is a trademark of Matterport,\nInc. All other marks are the property of their respective owners.\n\n     Forward-Looking Statements\n\n     This document contains certain forward-looking statements within the\nmeaning of the federal securities laws, including statements regarding the\nbenefits of the business combination, the services offered by Matterport,\nInc. (\"Matterport\") and the markets in which Matterport operates, business\nstrategies, debt levels, industry environment, potential growth\nopportunities, the effects of regulations and Matterport's projected future\nresults. These forward-looking statements generally are identified by the\nwords \"believe,\" \"project,\" \"expect,\" \"anticipate,\" \"estimate,\" \"intend,\"\n\"strategy,\" \"future,\" \"forecast,\" \"opportunity,\" \"plan,\" \"may,\" \"should,\"\n\"will,\" \"would,\" \"will be,\" \"will continue,\" \"will likely result,\" and\nsimilar expressions (including the negative versions of such words or\nexpressions).\nForward-looking statements are predictions, projections and other\nstatements about future events that are based on current expectations and\nassumptions and, as a result, are subject to risks and uncertainties. Many\nfactors could cause actual future events to differ materially from the\nforward-looking statements in this document, including the expected\nbenefits of Matterport's partnership with Amazon Web Services, Matterport's\nability to implement business plans, forecasts, and other expectations in\nthe industry in which Matterport competes, and identify and realize\nadditional opportunities. The foregoing list of factors is not exhaustive.\nYou should carefully consider the foregoing factors and the other risks and\nuncertainties described in documents filed by Matterport from time to time\nwith the U.S. Securities and Exchange Commission (the \"SEC\"). These filings\nidentify and address other important risks and uncertainties that could\ncause actual events and results to differ materially from those contained\nin the forward looking statements. Forward-looking statements speak only as\nof the date they are made. Readers are cautioned not to put undue reliance\non forward-looking statements, and Matterport assumes no obligation and,\nexcept as required by law, does not intend to update or revise these\nforward-looking statements, whether as a result of new information, future\nevents, or otherwise. Matterport does not give any assurance that it will\nachieve its expectations.\n\nContact:\nTim McDowd\nDirector, Communications\npress@matterport.com\n+1 (650) 273-6999\n\nContact:\nSoohwan Kim, CFA\nVP, Investor Relations\nir@matterport.com\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133400729.MNPRE2133402799-09162220211201</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}