{"date": "2021-12-06 02:42:47.540000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>At AWS re:Invent, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company, announced four new storage services and capabilities that deliver more choice, reduce costs, and help customers better protect their data. Amazon Simple Storage Service (Amazon S3) Glacier Instant Retrieval is a storage class that provides retrieval access in milliseconds for archive data?now available as a new access tier in Amazon S3 Intelligent-Tiering. Amazon FSx for OpenZFS is a managed file storage service that makes it easy to move on-premises data residing in commodity file servers to AWS without changing application code or how the data is managed. Amazon Elastic Block Store (Amazon EBS) Snapshots Archive is a new storage tier for Amazon EBS Snapshots that reduces the cost of archiving snapshots by up to 75%. AWS Backup now supports centralized data protection and automated compliance reporting for Amazon S3, as well as for VMware workloads running on AWS and on premises. The new storage innovations announced today provide customers greater flexibility in how they manage storage while lowering costs and improving data management and protection capabilities.</p><p>?Every business today is a data business. One of the most important decisions that a business will make is where to store their data,? said Mai-Lan Tomsen Bukovec, Vice President, Block and Object Storage at AWS. ?As these latest storage services and capabilities show, AWS is the most powerful and lowest cost way to access and protect data. Our rapid innovation makes it the best storage choice for customers now and in the future.?</p></div><div class=\"tr-npp-body\"><p>Amazon S3 Glacier Instant Retrieval offers retrieval in milliseconds for archived data at the lowest cost in the cloud?also available as a new tier in Amazon S3 Intelligent-Tiering</p><p>Amazon S3 offers a wide range of storage classes that deliver the lowest cost storage for different data access patterns. Customers often need to store petabytes of data that is only accessed occasionally, but that must be highly available and immediately accessible when requested (e.g. medical records, public health research data, media content, etc.). Today, customers have several options to store infrequently accessed data. Customers with data that is rarely accessed and requires retrieval times from a few minutes to a few hours can use S3 Glacier. Customers with data that is accessed once per month on average but still requires rapid retrieval can use S3 Standard-Infrequent Access (S3 Standard-IA) for only a slightly higher price. However, some customers want a combination of the lower storage costs offered by S3 Glacier and the fast retrieval of S3 Standard-IA so they can meet their data access needs even more cost effectively.</p><p>S3 Glacier Instant Retrieval is a new storage class that is designed to offer milliseconds access for archive data, so customers can achieve the lowest cost storage in the cloud for data that is stored long-term and rarely accessed but requires immediate retrieval when requested. With S3 Glacier Instant Retrieval, customers no longer need to choose between optimizing for retrieval time or cost. Customers who move from S3 Standard-IA to S3 Glacier Instant Retrieval can save up to almost 70% for data that is accessed only a few times per year. Customers can now choose from three archive storage classes optimized for different access patterns and storage duration?S3 Glacier Flexible Retrieval (formerly S3 Glacier), S3 Glacier Deep Archive, and now S3 Glacier Instant Retrieval. S3 Glacier Instant Retrieval is the ideal storage class for customers who are sensitive to per-GB storage costs due to growing data volumes, by providing them the same low latency and high throughput of S3 Standard-IA, at the lowest cost for archive storage in the cloud.</p><p>S3 Glacier Instant Retrieval is now also available as a new access tier in S3 Intelligent-Tiering storage class. S3 Intelligent-Tiering optimizes storage costs by automatically moving data to the most cost-effective access tier based on access frequency without performance impact, retrieval fees, or operational overhead. Customers who need instant access to data and have unknown or changing access patterns can receive the same economic benefits as S3 Glacier Instant Retrieval with the new Archive-Instant Access tier in S3 Intelligent-Tiering without having to worry about where they are storing their data.</p><p>Amazon FSx for OpenZFS makes it easy to move data residing in on-premises commodity file servers to AWS without changing application code or how the data is managed</p><p>Organizations of all sizes are migrating their on-premises data stores to the cloud to increase agility, improve security, and reduce costs. Today, many of these organizations store their data using on-premises file storage built on commodity, off-the-shelf servers and open-source software like the popular ZFS file system. These file servers provide access to data via industry-standard protocols, offer a wide variety of data management capabilities like point-in-time snapshots, cloning, and compression, and deliver hundreds of thousands of IOPS with sub-millisecond latencies. Many storage and application administrators have developed familiarity and expertise using tools that rely on the specific capabilities and performance of these file servers when running their applications. Consequently, when migrating these applications to the cloud, storage and application administrators have to forgo the capabilities they are familiar with, and in many cases, re-architect their applications, tools, and workflows, which takes a lot of time and effort. These administrators would prefer to run their file servers on AWS to take advantage of improved agility, security, and cost but until now have not had the option of doing so.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}