{"date": "2021-12-03 15:42:10.714000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3443.72, "close": 3389.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>IGEN NETWORKS CORP (\"IGN-Z\")\n- Secures GSA Multiple Award Schedule Contract with State and\n- Federal Governments\n\n     Medallion GPS PRO to offer fleet management and maintenance services\nto 700 member Counties across the USA\n\n     IGEN Networks Corporation a leading innovator of cloud-based and\nInternet of Things (IoT) solutions for the protection and management of\nmobile assets, announced its qualification for GSA Multiple Award Schedule\nContract with selected states and federal government markets. The GSA/VA\nstatus enables IGEN to market its products and services directly to\ngovernments including Counties, States, and the Federal Government.\n\n     The GSA/VA Schedule contract status is a Preferred Vendor Status with\nlocal, state, and federal governments from which qualified companies are\nconsidered to be responsible and reputable to these governments. According\nto the GSA/VA Solicitation Services, there are only .003% of companies in\nthe United States that are GSA or VA Federal Supply Schedule Contract\nqualified.  According to The Authority in Government Contracts the Federal\nGovernment spends over $40B exclusively with GSA/VA Schedule Contract\nholders on an annual basis.\n\n     From this GSA/VA Schedule contract status, IGEN will market its\nMedallion GPS Fleet Platform initially to Counties located in six states\nthat include Pennsylvania, Michigan, New York City, New York, Tennessee,\nand California. Additional states will be added to IGEN's contract status\nas opportunities grow across the US. The Medallion GPS Fleet Platform will\noffer compelling features and services at lower costs with emphasis on\nease-of-use. The system is organized around both asset and driver with\ndispatch capabilities, automated reporting, maintenance, diagnostics\nreporting, driver behavior scoring, and video tutorials on demand that are\nbuilt on AWS Cloud-based infrastructure. The Medallion GPS Fleet Platform\nincorporates the patented \"Digital Telematics Signature\", which offers\ngreater accuracy in measuring and scoring driver behavior across diverse\nfleets providing a powerful tool for assessing actuarial risk of assets and\ntheir drivers.\n\n     \"Combined with our GSA/VA contract status, we now have the process to\nfacilitate transactions with the Counties across all US government markets.\nIn preparation we have increased our inventory levels to 2500 hardware\nactivation units for the next quartile period,\" said Neil G Chan, CEO of\nIGEN Networks Corp.  The diversity of government assets along with the\nself-insurance of these assets creates an excellent fit with the\ncapabilities of our Medallion GPS Fleet Platform.\"\n\n     About IGEN Networks Corporation\n\n     IGEN Networks Corporation provides peace-of-mind to automotive\nconsumers and their families through direct access to Internet-of-Things\n(IoT) cloud-based services that include Stolen Vehicle Protection,\nReal-time updates on asset health and Driver Behavior.\n\n     IGEN is a fully reporting company in both Canada and the United\nStates. It is publicly traded on the OTCQB under the symbol IGEN, and\nlisted on the CSE under the symbol IGN. For more information, please visit:\nwww.igennetworks.net\n\n     Forward-Looking Statements\n\n     This news release may contain forward-looking statements or\nforward-looking information within the meaning of the U.S. Private\nSecurities Litigation Reform Act of 1995 and Canadian securities law. The\nterms and phrases \"goal\", \"commitment\", \"guidance\", \"expects\", \"would\",\n\"will\", \"continuing\", \"drive\", \"believes\", \"indicate\", \"look forward\",\n\"grow\", \"outlook\", \"forecasts\", \"intend\", and similar terms and phrases are\nintended to identify these forward-looking statements. Forward-looking\nstatements are based on estimates and assumptions made by IGEN in light of\nits experience and its perception of historical trends, current conditions\nand expected future developments, as well as other factors that IGEN\nbelieves are appropriate in the circumstances, including but not limited to\nstatements regarding investment liquidity, financing options and long term\ngoals of the Company, general economic conditions, IGEN's expectations\nregarding its business, customer base, strategy and prospects, and IGEN's\nconfidence in the cash flow generation of its business. Many factors could\ncause IGEN's actual results, performance or achievements to differ\nmaterially from those expressed or implied by the forward-looking\nstatements, including, without limitation: risks related to competition;\nIGEN's reliance on key personnel; IGEN's ability to maintain and enhance\nits brand; and difficulties in forecasting IGEN's financial results,\nparticularly over longer periods given the rapid technological changes,\ncompetition and short product life cycles that characterize the mobile\napplication industry. These risk factors and others relating to IGEN that\nmay cause actual results to differ are set forth in the under the heading\n\"Risk Factors\" in IGEN's periodic filings with the British Columbia\nSecurities Commission and the U.S. Securities and Exchange Commission\n(copies of which filings may be obtained at www.sedar.com or www.sec.gov.\nThese factors should be considered carefully, and readers should not place\nundue reliance on IGEN's forward-looking statements. IGEN has no intention\nand undertakes no obligation to update or revise any forward-looking\nstatements, whether as a result of new information, future events or\notherwise, except as required by law.\n\nContact:\nNeil G. Chan\nIGEN Networks Corporation\nEmail: info@igennetworks.net\nCall us: (855)912-5378\n\nView original\ncontent:https://www.prnewswire.com/news-releases/igen-networks-corporation-\nsecures-gsa-multiple-award-schedule-contract-with-state-and-federal-governm\nents-301436960.html\n\nSOURCE IGEN Networks Corporation\n\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133600319.MNPRE2133601023-07324220211203</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}