{"date": "2021-12-21 15:10:59.246000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NEXTECH AR SOLUTIONS CORP (\"NTAR-Z;NEXCF-0\")\n- Signs Multi-year Virtual Event &amp; Marketplace Contract With\n- Restaurants Canada\n\nNextech AR Solutions Corp. (\"Nextech\"or the \"Company\") , a Metaverse\nCompany and leading provider of augmented reality (\"AR\") experience\ntechnologies and services is very pleased to announce a multi-year,\nMetaverse marketplace deal with Restaurants Canada. Founded as the Canadian\nRestaurant and Foodservice Association in 1944, Restaurants Canada is the\nlargest foodservice organization in Canada with over 30,000 members. This\ndeal utilizes the company's virtual events and Metaverse Studio as a\nmanaged service, which includes 3D AR booths, human holograms, 3D AR\nproduct experiences, and augmented reality ads. The company will also build\na \"metaverse marketplace\" which allows members and vendors to virtually\nmeet with one another and see all products and services under one umbrella.\n\nDue to the COVID-19 pandemic, earlier this year Restaurants Canada chose to\nput on its annual RC Show as a virtual event hosted on Nextech's platform.\nAs a result of the huge success of the February 2021 virtual RC Show,\nRestaurants Canada has now signed a multi-year pivotal industry deal with\nNextech. Through Nextech's virtual events platform now called ARitize\nEvents 3D, RC Show 2021 attendees had access to an interactive virtual\ntrade show floor and exhibitor booths, broadcast-quality content, and\ninteractive demonstrations. The event also featured augmented reality\ntechnology, including human holograms and 3D AR booths - see CNBC TV\nfeature here.\n\nIn combination with the upcoming in-person and virtual 2022 RC Show, taking\nplace Feb 27 - Mar 1, 2022, the Company will create a new industry standard\nfor the entire foodservice and hospitality industry in Canada with the\nlaunch of this new \"metaverse marketplace\", using Nextech's immersive AR\ntechnology to create meaningful connections with Restaurants Canada's\nmembers. This fusion of a virtual events platform with a 3D Metaverse\nmarketplace solution is unique to the foodservice industry in Canada, and\noffers a major opportunity to expand this type of hybrid solution into\nother industry sectors globally.\n\nChristopher Barry, Director of Membership at Restaurants Canada further\nelaborates on the Metaverse Marketplace: \"The Metaverse Marketplace allows\nbrands to market their product or service and set up live meetings. With\nthe ability for operators to no longer have to physically travel to meet\ntheir supplier, this results in more engagement and conversion for brands\nwithin the marketplace. It's a one-stop shop for people to come to do\nbusiness\". With plans for up to 5000 virtual vendor booths serving 30,000+\nmembers, this unique Marketplace will be a thriving centre for ecommerce\nand will leverage Nextech's 3D Augmented Reality solutions for products and\nadvertisements. Vendors will be able to show their products in 3D, allowing\nmembers to interact at a higher level.\n\nNextech anticipates generating additional revenue from add-ons like its ad\nnetwork, ARitize Ads, which has the capability to display throughout the\nevent and digital marketplace. This is not only a showcase of Nextech's\ntechnology as an integrated, seamless platform, but also provides a large\nrevenue sharing opportunity for Nextech.\n\nEvan Gappelberg, CEO of Nextech AR commented,\"This multi-year deal is a\nvery substantial validation of both our virtual events platform and new 3D\nMetaverse Marketplace. The opportunity for revenue potential is significant\nand we are excited to partner with Restaurants Canada again while having\nthe opportunity to showcase our ad network, AR features and 3D product\nvisualizations to 30,000 industry pros. He continues \"With the Omicron\nvariant spreading globally live events are being scaled back or canceled\nand the world is once again looking for virtual event platforms,\nmarketplaces, and 3D product visualizations which is causing a spike in our\nbusiness\".\nTodd Barclay, President and CEO, Restaurants Canada commented, \"The Nextech\nplatform offered a much more sophisticated experience for our attendees and\nexhibitors. The engagement levels were high and created what felt like a\npersonal connection, in what would otherwise be an impersonal platform.\" He\ncontinues, \"With Nextech, we look forward to providing the foodservice and\nhospitality industry with an innovative solution that can help our members\ngrow their business.\"\n\nClick here to see what Restaurants Canada had to say about working with\nNextech AR for the 2021 RC Show.\n\nAbout Restaurants Canada\n\nRestaurants Canada is a national, not-for-profit association advancing the\npotential of Canada's diverse and dynamic foodservice industry through\nmember programs, research, advocacy, resources and events. Before the start\nof the COVID-19 pandemic, Canada's foodservice sector was a $95 billion\nindustry, directly employing 1.2 million people, providing Canada's number\none source of first jobs and serving 22 million customers across the\ncountry every day. The industry has since lost hundreds of thousands of\njobs and billions in sales due to the impacts of COVID-19.\n\nTo learn more, please follow us on Twitter, YouTube, Instagram, LinkedIn,\nand Facebook, or visit our website: <a href=\"https://www.Nextechar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.Nextechar.com</a>.\n\nAbout Nextech AR\n\nNextech AR Solutions is a Metaverse company that develops and operates\naugmented reality (\"AR\") platforms, transporting three-dimensional (\"3D\")\nproduct visualizations, human holograms and 360 portals to its audiences\naltering e-commerce, digital advertising, hybrid virtual events (events\nheld in a digital format blended with in-person attendance) and learning\nand training experiences.\n\nNextech focuses on developing AR solutions for the Metaverse, however most\nof the Company's revenues are derived from three e-Commerce platforms:\nvacuumcleanermarket.com (\"VCM\"), infinitepetlife.com (\"IPL\") and\nTrulyfesupplements.com (\"TruLyfe\"). VCM and product sales of residential\nvacuums, supplies and parts, and small home appliances sold on Amazon.\n\nForward-looking Statements\n\nThe CSE and the NEO have not reviewed and do not accept responsibility for\nthe adequacy or accuracy of this release.\n\nCertain information contained herein may constitute \"forward-looking\ninformation\" under Canadian securities legislation. Generally,\nforward-looking information can be identified by the use of forward-looking\nterminology such as, \"will be\" or variations of such words and phrases or\nstatements that certain actions, events or results \"will\" occur.\nForward-looking statements regarding the completion of the transaction are\nsubject to known and unknown risks, uncertainties and other factors. There\ncan be no assurance that such statements will prove to be accurate, as\nfuture events could differ materially from those anticipated in such\nstatements. Accordingly, readers should not place undue reliance on\nforward-looking statements and forward-looking information. Nextech will\nnot update any forward-looking statements or forward-looking information\nthat are incorporated by reference herein, except as required by applicable\nsecurities laws.\n\nNextech AR Solutions Corp.\nLindsay Betts\ninvestor.relations@nextechar.com\n866-ARITIZE (274-8493) Ext 7201\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2135400326.MNPRE2135401352-06550820211221</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}