{"date": "2021-11-03 13:45:13.089000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>WONDERFI TECHNOLOGIES INC (\"WNDR-Z\")\n- Deploys Additional Ethereum Validator Nodes\n\n   WonderFi Technologies Inc. (the \"Company\" or \"WonderFi\") announced that\nit has established and deployed additional proof of stake (PoS) validator\nnodes on the Ethereum network, as part of its continued decentralized\nfinance (DeFi) infrastructure and portfolio management strategy. The\nCompany now operates a total of ten full Ethereum nodes.\n\n   \"We are continuing to grow our infrastructure which is supportive of our\nbalance sheet and also opens up opportunities within our product offering,\"\ncommented Cong Ly, CTO of WonderFi. Currently staking ETH through a\nvalidator node yields approximately 6% APY on the staked assets.\n\n   Blockchain protocols that use PoS consensus mechanisms are supported by\nvalidator nodes that play a critical role in securing the network and\nvalidating transactions. PoS requires participants to stake ETH to become a\nvalidator on the network. Validators are responsible for ordering\ntransactions and creating new blocks, earning block rewards in return for\nproviding this work.\n\n   The Company will continue to deploy best practices in managing, updating\nand operating its validator nodes, and evaluate the performance and\npotential for additional PoS-related opportunities across relevant networks\nthat power decentralized finance.\n\nAdditional Information\nFor additional information, please contact:\n\nWonderFi Technologies Inc.\nBen Samaroo, CEO\nben@wonder.fi\n(778) 843-9637\n\nInvestor Relations Contact:\ninvest@wonder.fi\n\nMedia Contact:\npress@wonder.fi\n\n   ABOUT WONDERFI\n\n   WonderFi is a leading technology company with the mission of creating\nbetter access to DeFi through the core principles of simplicity and\neducation. WonderFi has a multi-pronged business strategy which includes a\nhigh-growth consumer finance app which will serve as a trusted gateway to\nthe new financial system, and a digital asset portfolio which consists of\nleading crypto and DeFi assets. WonderFi's executive team and Board of\nDirectors have an established track record in finance and crypto, with\nprevious experience at Amazon, Shopify, PayPal, Galaxy Digital, Hut 8 and\nBIGG Digital. WonderFi's core team of engineers and technologists believe\nthat everyone should have equal access to finance, and are aligned in the\nmission to empower people around the world to access DeFi in a simple,\nsmart and secure way. For more information, visit www.wonder.fi.\n\n   Forward-Looking Information and Statements\n\n   This press release contains certain \"forward-looking information\" within\nthe meaning of applicable Canadian securities legislation and may also\ncontain statements that may constitute \"forward-looking statements\" within\nthe meaning of the safe harbor provisions of the United States Private\nSecurities Litigation Reform Act of 1995. Such forward-looking information\nand forward-looking statements are not representative of historical facts\nor information or current condition, but instead represent only the\nCompany's beliefs regarding future events, plans or objectives, many of\nwhich, by their nature, are inherently uncertain and outside of the\nCompany's control. Generally, such forward-looking information or\nforward-looking statements can be identified by the use of forward-looking\nterminology such \"could\", \"intend\", \"expect\", \"believe\", \"will\",\n\"projected\", \"estimated\", or variations of such words. The forward-looking\ninformation and forward-looking statements contained herein may include,\nbut are not limited to, information concerning: the deployment of best\npractices in managing, updating and operating its validator nodes.\n\n   By identifying such information and statements in this manner, the\nCompany is alerting the reader that such information and statements are\nsubject to known and unknown risks, uncertainties and other factors that\nmay cause the actual results, level of activity, performance or\nachievements of the Company to be materially different from those expressed\nor implied by such information and statements. In addition, in connection\nwith the forward-looking information and forward-looking statements\ncontained in this press release, the Company has made certain assumptions.\nAmong the key factors that could cause actual results to differ materially\nfrom those projected in the forward-looking information and statements are\nthe following: the ability of the Company to work effectively with\nstrategic investors; and changes in general economic, business and\npolitical conditions, including changes in the financial markets, changes\nin applicable laws, and compliance with extensive government regulation.\nShould one or more of these risks, uncertainties or other factors\nmaterialize, or should assumptions underlying the forward-looking\ninformation or statements prove incorrect, actual results may vary\nmaterially from those described herein.\n\n   Although the Company believes that the assumptions and factors used in\npreparing, and the expectations contained in, the forward-looking\ninformation and statements are reasonable, undue reliance should not be\nplaced on such information and statements, and no assurance or guarantee\ncan be given that such forward-looking information and statements will\nprove to be accurate, as actual results and future events could differ\nmaterially from those anticipated in such information and statements. The\nforward-looking information and forward-looking statements contained in\nthis press release are made as of the date of this press release, and the\nCompany does not undertake to update any forward-looking information and/or\nforward-looking statements that are contained or referenced herein, except\nin accordance with applicable securities laws. All subsequent written and\noral forward-looking information and statements attributable to the Company\nor persons acting on its behalf is expressly qualified in its entirety by\nthis notice.\n\n   Neither NEO Exchange nor its Regulation Services Provider (as that term\nis defined in policies of the NEO Exchange) accepts responsibility for the\nadequacy or accuracy of this news release.\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2130600264.MNPRE2130601783-06431120211103</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}