{"date": "2021-12-21 03:53:11.233000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>WASHINGTON, Dec 21 (Bernama) -- E-commerce giant Amazon needs to be investigated by the US Labour Department for harsh labour practices that include wrongful dismissals and lack of sensitivity to emergencies, such as the one that killed six workers in a tornado, US Senators Sherrod Brown and Marco Rubio said in a letter to Labour Secretary Martin Walsh.</p>\n<p>“Recent reports have brought to light troubling working conditions at Amazon that suggest improper treatment of its employees, to the detriment of workers and families across the country,” Sputnik quoted the senators as saying in the letter.</p>\n<p>“Today, approximately one out of every 170 US workers is an Amazon employee, underscoring our particular interest in ensuring that the company’s employment practices are fair, and in accordance with the law. We urge you to use every mechanism at your disposal to investigate Amazon’s labor and employment practices immediately.”</p>\n<p>The call by Brown and Rubio represents a bipartisan effort to rein in various business practices by Amazon objected to by US lawmakers and regulators over the past year. In February, New York Attorney-General Letitia James said Amazon may have broken the law when it fired an employee for attending a protest against working conditions at a warehouse owned by the company.</p>\n<p>In their complaint, the senators cited media reports of allegations by Amazon employees of how the company mismanaged their benefits and pay, set gruelling work hours and showed a general lack of response to their concerns due to its highly-automated management practices.</p>\n<p>The senators highlighted reports of “workers not having time to use the restroom on the job, and being forced to resort to extraordinary measures such as urinating in bottles to meet work quotas.”</p>\n<p>Brown and Rubio also pressed Secretary Walsh to look into the investigation by the Occupational Safety and Health Administration of Amazon’s conduct over the collapse of its warehouse in Edwardsville, Illinois after a tornado struck the facility earlier this month, killing six people.</p>\n<p>Reports indicated that one of the employees who died in that incident had texted his girlfriend, claiming that the company would not let him leave to go home during the storm, the senators said. Workers also voiced concerns about Amazon's alleged lack of emergency response training and expectations that workers continue to work during tornado warnings.</p>\n<p>-- BERNAMA</p>\n<p> </p>\n<p>TAGS: US, Amazon, harsh labour practices, investigation</p></div>"}