{"date": "2022-01-20 21:21:25+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3125.98, "close": 2852.86}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds interview with Senator Klobuchar</p><p class=\"tr-by\">By Diane Bartz</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">WASHINGTON, Jan 20 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>The U.S. Senate Judiciary Committee on Thursday approved a bill that would bar tech giants like Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> from giving preference to their own businesses on their websites, despite hefty lobbying from top executives like Apple <span class=\"tr-strong\">Chief Executive Tim </span>Cook.</p><p>The biggest technology companies, including Meta Platforms Inc's Facebook <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a> and Apple Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a>, have been under pressure in Congress because of allegations they abused their outsized market power. A long list of bills is aimed at reining them in, but none have become law.</p><p>Lawmakers voted on an amended version of a bill introduced by Senators Amy Klobuchar, a Democrat, and Chuck Grassley, a Republican, that expanded the definition of companies covered by the bill to include firms like the popular video app TikTok and specified that companies were not required to share data with firms that the U.S. government considers national security risks.</p><p>Republican Senator Ted Cruz said during the hearing that he spoke on Wednesday with Cook, saying he \"expressed significant concerns about the bill.\"</p><p>Cruz, who voted for the measure, said Cook expressed a \"reasonable\" concern the bill would make it harder for Apple to allow consumers to protect their privacy by electing that apps not be allowed to monitor or track their online activities.</p><p>Klobuchar, chair of the panel's antitrust panel, s<span class=\"tr-strong\">aid after the vote that she also had spoken with both Cook and Google CEO Sundar Pichai.</span></p><p><span class=\"tr-strong\">\"I had discussions with them and I made my case and I listened to them. They are most likely never going to like this bill,\" she said adding that she was open to changes but not to gutting the measure. \"We're not going to put a bill forward that does nothing.\"</span></p><p><span class=\"tr-strong\">The Cowen Washington Research Group said that despite the committee's 16-6 vote to approve the measure, enough of its supporters expressed reservations that it had less than a 50% chance of becoming law.</span></p><p>A second bill, which was held over, would bar big app stores, like Apple's, from requiring app providers to use their payment system and prohibit them from punishing apps that offer different prices through another app store or payment system.</p><p>Both bills have a version in the U.S. House of Representatives.</p><p>The legislation aimed at Big Tech set off a firestorm of opposition from powerful business groups.</p><p>Matt Schruers, president of the Computer and Communications Industry Association, criticized the Klobuchar/Grassley measure and predicted it would not pass the Senate. \"Antitrust policy should aim to promote consumer welfare - not punish specific companies,\" he said in a statement. </p><p>The advocacy group Consumer Reports supported the Klobuchar/Grassley bill to \"reset the power asymmetry between Big Tech, consumers and small businesses.\"</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Diane Bartz; Editing by David Gregorio, Jonathan Oatis and Cynthia Osterman)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Diane.Bartz@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Diane.Bartz@thomsonreuters.com</a> ; 1 202 898 8313; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: TECH-ANTITRUST/BILLS (UPDATE 3, PIX)</p></div>"}