{"date": "2022-01-19 14:42:02.544000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MOBILUM TECHNOLOGIES INC (\"MBLM-Z;MBLMF-0\")\n- Signs Agreement To Provide fiat On-Ramp Services Into KEYS Token\n- Inc.\n\n     Mobilum Technologies Inc. (\"Mobilum\" or the \"Company\"), a\ntechnology-driven company making traditional finance accessible through\ndigital payment infrastructure and digital asset management technologies,\nis pleased to announce it has signed an agreement to provide KEYS Token\nInc. (\"KEYS Token\") with Mobilum's on-ramp services.\n\n     KEYS Token is revolutionizing the real estate industry by bridging the\ngap between the digital and physical worlds, leveraging web3 and scalable\n3D technologies in tandem with real estate professionals and industry\nleaders.\n\n     Under the terms of the agreement, Mobilum will provide KEYS with an\neasy-to-use fiat-to-crypto- gateway where KEYS users will have the ability\nto seamlessly purchase KEYS Token using their Visa, Mastercard, debit and\ncredit cards, powered by Mobilum's industry leading on-ramp. This\nintegration will provide KEYS community the ability to purchase KEYS token\nat the best market price using the most ubiquitous of payment options,\nthereby helping KEYS ecosystem to grow and scale.\n\n     Wojciech Kaszycki, Mobilum CEO commented, \"We are very excited to\nbegin this long-term partnership with the team at KEYS. The collective\ntalent and team at KEYS have positioned KEYS at the forefront of\nblockchain-based real estate and metaverse projects in the crypto space. We\nare very impressed with the crypto community reception of the KEYS Token\nlaunch, with great success on November 18, 2021, by reaching a market\ncapitalization of just under USD $300,000,000 in less than 12 days. We look\nforward to supporting the KEYS team with our on-ramp services to begin\nwith, giving their community the ability to transact with Visa, Mastercard,\ndebit and credit cards immediately, and will continue to find synergies in\npartnering to support our collective ecosystems.\"\n\n     \"The metaverse and digital real estate industries are rapidly\nexpanding, businesses are moving quickly to establish partnerships and get\nahead in the emerging metaverse sector. With Mobilum's partnership and\nsuite of offerings, we are delighted to provide more value to our KEYS\ncommunity, and will begin by giving users the ability to acquire and hold\nKEYS Token through an easy to use payment gateway,\" commented Nima\nGhassemi, CEO of KEYS Token.\n\n     Noah Kent, Co-Founder and Chief Product Officer continues, \"Our\npartnership with Mobilum is a massive step for the growth, adoption, and\nrecognition of KEYS Token and our ecosystem. At its core, KEYS is a real\nestate and metaverse token focused on bridging the gap between the physical\nand digital worlds, providing our users the option to purchase KEYS using\nmajor debit and credit cards embodies this ethos to the highest degree. Our\nteam is extremely excited to continue pushing the needle and bringing value\nto our holders with Mobilum by our side.\"\n\n     About Mobilum Technologies Inc.\n     Mobilum Technologies Inc. (CSE:MBLM) (OTC:MBLMF) (FRA:C0B), a\ntechnology-driven Payment Service Provider (PSP) with a mission to make\ntraditional finance accessible through digital payment infrastructure and\ndigital asset management technologies.  Our goal is to allow consumers\naround the world to convert fiat-to-crypto and crypto-to-fiat with\nMobilum's on-ramp and off-ramp solutions.  Mobilum has offices in Canada,\nHong Kong, Poland, and Estonia.  For further information go to Mobilum.com.\n\n     About KEYS Token\n     Imagine a world where buying real estate (and countless other luxury\nassets) is as easy as receiving a key. KEYS will transform the way real\nestate and luxury assets are exchanged by increasing speed and transparency\nwhile reducing costs and friction through the revolutionary product\necosystem that will be built around the token. Our mission is to create\nrevolutionary blockchain products built around the exchange of luxury\nassets in both the metaverse and physical world exclusive to KEYS Token\nholders. By holding KEYS you will be able to: buy and sell real estate and\nluxury assets in both the metaverse and physical world, gain access to\nexclusive investment opportunities and events, and become part of a\npowerful network. Coming from diverse backgrounds of success, each of the\nKEYS founders brings a unique set of skills and attributes to the table.\nTheir collective talent pool encompasses development experience at publicly\ntraded companies like Amazon and operation experience as a COO at a\nmulti-million dollar AI start-up, as well as extensive professional chart\nand trading knowledge as owners of a registered crypto hedge fund, and\naccess to a global digital distribution network reaching upwards of 300\nmillion people per month through accounts such @houses on Instagram.\nTogether, this combination of knowledge and resources positions the KEYS\nteam to change the world as we know it, and positively impact billions of\nlives.\n\nFor further information:\nSoy Garipoglu, Investor Relations, (778) 990-8985\n\nTel   : 604-314-5675    MOBILUM TECHNOLOGIES INC\nWWW   : <a href=\"https://www.mobilum.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.mobilum.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201800114.MNPRE2201801302-06281520220119</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}