{"date": "2022-01-14 04:18:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3304.14, "close": 3242.76}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n                  <span>M1 leverages Artificial Intelligence technology to power its VoiceBot, Maxine</span>\n                </p>\n                <p>\n                  <strong>\n                    <span>SINGAPORE, 14 JANUARY 2022</span>\n                  </strong> - M1 Limited (M1), one of Singapore's leading Mobile Network Operators (MNO), today announced its collaboration with Amazon Web Services (AWS), to launch Maxine, a VoiceBot for M1's hotlines.<br/><br/>\n         Maxine is built on <a href=\"https://aws.amazon.com/connect/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon Connect</a>, AWS's omnichannel cloud-based contact center service that helps improve contact center agent productivity and end-user customer experiences. Powered by AWS Artificial Intelligence (AI) technologies such as automatic speech recognition and natural language understanding, Maxine is able to engage in more lifelike conversations with customers. Combined with M1's Session Initiation Protocol (SIP) trunk services for high quality digital voice communication, Maxine will help improve end-user customer experiences by engaging them in open-ended conversations instead of menu-driven interfaces.<br/><br/>\n         Since Maxine's rollout in the last quarter of 2021, M1 is seeing an improved performance to the existing call system with the VoiceBot performing sophisticated functions such as authentication of callers with a One-Time Pin (OTP), or sharing the customer's position in the call queue and estimated waiting time. In comparison with Dec 2020, M1's Net Promoter Score (NPS) for Dec 2021 has seen a marked 40% increase, largely attributed to Maxine's ability to capture callers' intentions which then improves call agent productivity by freeing them up to focus on more complex cases.<br/><br/>\n         The deployment of Maxine is part of M1's continuous transformation journey to be a digital platform. As a cloud native solution, M1 is able to regularly develop and deploy new and incremental features and capabilities that enhance Maxine's services.<br/><br/>\n         The easy to use and quick to deploy solution enables M1 to scale up and down in a short period of time. It also provides call center agents the flexibility they need to work remotely, without compromising the customer experience.<br/><br/>\n         \"Customer experience has always been a top priority for M1. Since embarking on our digital transformation journey two years ago, we have doubled down on delivering exceptional experiences for our customers. We are committed to ensuring a seamless and engaging experience for our customers on all platforms, including our hotlines. With technology as our enabler, M1 will continue to train Maxine to improve its capabilities and add more value to our customers, through the development of a self-help service,\" said Mr. Stamford Low, Director, Customer Experience and Retail, M1.<br/><br/>\n         \"Customers, such as M1, rely on actionable data to provide faster and more holistic customer experiences, optimise agents' time based on what matters most, and enable customer service managers to take action in real time,\" said Mr. Dean Samuels, Chief Technologist, ASEAN, Amazon Web Services. \"With Amazon Connect, M1 can provide superior customer service at a lower cost with an easy-to-use omnichannel cloud contact center. Embedded artificial intelligence (AI) and machine learning (ML) with Amazon Connect makes it easy to automate interactions, understand customer sentiment, authenticate callers, and enable capabilities like interactive voice response (IVR) and chatbots.\"<br/><br/>\n         As of today, M1 has its 1627 (Bespoke), 1622 (Business) and 1800-843-8288 (Prepaid) hotlines operating on the Amazon Connect platform. This will be progressively rolled out to other hotlines. M1 is also supporting other members of the Keppel Group that are making the transition to adopt Maxine, starting with Keppel Electric.<br/><br/></p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.m1.com.sg/about-us/news-releases/2022/m1-collaborates-with-aws-to-enhance-customer-experience\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>M1 Limited</strong> published this content on <strong>14 January 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>14 January 2022 04:18:00 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - M1 Limited</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: M1-Limited</p></div>"}