{"date": "2022-02-09 02:38:00.228000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_v4kn4gyf&amp;referenceId=tag:reuters.com,2022:newsml_OVFXTKJGR_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_v4kn4gyf&amp;referenceId=tag:reuters.com,2022:newsml_OVFXTKJGR_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: Wall Street ended sharply higher on Tuesday, while a jump in Treasury yields elevated bank stocks ahead of the release of Consumer Price Index data later this week. This report produced by Chris Dignam.<br/>Short Link: <a href=\"https://refini.tv/338dgND\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/338dgND</a><br/><br/>Video Transcript:<br/><br/>Stocks finished higher Tuesday, reversing early losses with a lift from Apple and Microsoft, while a jump in the 10-year Treasury yield elevated bank stocks ahead of a key inflation reading this week. The Dow closed up 1% higher, while the S&amp;P broke above the 4,500 level. And the NASDAQ finished more than 1.25% higher. Sam Stovall, Chief Investment Strategist at CFRA Research, said investors are bracing for the latest US consumer prices data set to be released on Thursday, which he expects to come in at 7.3%, what would be a four-decade high.<br/><br/>I think that if the number is not as bad as we think, then I think we do end up with a relief rally. Maybe today's market action is an implication that many people feel that CPI will come in a little bit lighter than currently anticipated, so people are buying in ahead of possibly a better than expected number.<br/><br/>Earnings were mixed on Tuesday, with Pfizer falling roughly 3% after forecasting full-year sales for its COVID-19 vaccine and therapeutic pills below analysts' estimates. Amgen surged close to 8% after the company announced a buyback of up to $6 billion and forecast earnings would be more than double by the year 2030. The spotlight stayed on Peloton, as shares soared again on Tuesday after the exercise bike maker said it would replace its CEO and cut jobs in a bid to revive sagging sales, on the back of news that Peloton was a possible takeover target with Amazon, Apple and Nike reportedly in the hunt. And Facebook-owner Meta Platforms saw its fourth straight day of losses since a bleak outlook erased about a quarter of the stock's value last week. On Tuesday, Meta's market cap shrank further after billionaire and early Facebook investor Peter Thiel decided to step down from the company's board.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}