{"date": "2021-11-04 15:02:30+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n      The First Movers Coalition targets emission reductions in aviation, ocean shipping, steel, and trucking, reflecting Amazon's continuing investment in decarbonizing technologies.\n    </div>\n              <div>\n                <p>\n        Amazon helped launch a new initiative during the <span><a href=\"https://ukcop26.org/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">U.N. Climate Change Conference</a></span>that will leverage the collective purchasing power of companies globally to send a clear demand signal to scale-up emerging technologies that are essential to transitioning the world's economy to net-zero carbon<span>.</span></p>\n                <p>\n        The First Movers Coalition is launching in partnership with the World Economic Forum and the U.S. State Department. The coalition will initially target four sectors: aviation, ocean shipping, steel, and trucking. Transportation is a major component of Amazon's business operations and a key part of the company's plan to reach net-zero carbon by 2040.\n      </p>\n                <p>\n        Unlike the green technologies available for short-distance deliveries, Long-distance transport-including air transport and ocean shipping-have few low-carbon technologies available. Through the First Movers Coalition, Amazon will continue to explore, test, and invest in sustainable innovations across freight, air, and ocean transport to reduce emissions on the longest routes.\n      </p>\n                <p>\n        The First Movers Coalition is complementary to the efforts of the recently announced Cargo Owners for Zero Emission Vessels, also known as coZEV. The first-of-its-kind platform is led by cargo owners, Amazon, and other leading companies in partnership with The Aspen Institute. The platform enables maritime freight customers to come together to accelerate maritime shipping decarbonization.\n      </p>\n                <div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/planet/climate-pledge\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Climate Pledge</a>\n                    </span>\n                  </div>\n                  <div>\n          Amazon is committed to building a sustainable business for our customers and the planet. In 2019, Amazon co-founded The Climate Pledge-a commitment to be net zero carbon across our business by 2040, 10 years ahead of the Paris Agreement.\n        </div>\n                  <div>\n                    <span>\n                      <a href=\"https://www.aboutamazon.com/planet/climate-pledge\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read more</a>\n                    </span>\n                  </div>\n                </div>\n                <p>\n        \"We created The Climate Pledge to demonstrate the power of collective action to protect our planet from the catastrophic impacts of climate change,\" said Andy Jassy, Amazon CEO. \"By joining the First Movers Coalition, we are sending a clear signal that companies like Amazon are seeking long-term, low-carbon fuel solutions to help us achieve net-zero carbon by 2040. We welcome the Biden Administration and the World Economic Forum's decision to launch the First Movers Coalition, which will help further accelerate our efforts to decarbonize our operations through real business change and innovation.\"\n      </p>\n                <p>\n        Helping launch the First Movers Coalition reflects Amazon's continuing investment in decarbonizing technologies as part of The Climate Pledge. Amazon and Global Optimism co-founded <span><a href=\"https://www.theclimatepledge.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Climate Pledge</a></span>in 2019 as a commitment to reach the goals of the Paris Agreement 10 years early and be net-zero carbon by 2040. The Pledge now has more than 200 signatories, including IBM, Unilever, Verizon, Microsoft, Visa, and PepsiCo.\n      </p>\n                <p>\n        To reach its goal, Amazon is focusing on several key areas. The company will continue to reduce emissions across its operations by taking real business actions and establishing a path to power its operations with 100% renewable energy, five years ahead of the company's original target of 2030.\n      </p>\n                <p>\n        Amazon is also delivering on its Shipment Zero vision to make all shipments net-zero carbon, with 50% net-zero carbon by 2030. The company is purchasing 100,000 electric delivery vehicles, the largest order ever of electric delivery vehicles. Amazon is also investing $2 billion in the development of decarbonizing services and solutions through the Climate Pledge Fund.\n      </p>\n              </div>\n              <div>\n                <div>\n        Related Tags\n      </div>\n                <div>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/the-climate-pledge\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Climate Pledge</a>\n                  </span>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/alternative-energy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Alternative energy</a>\n                  </span>\n                  <span>\n                    <a href=\"https://www.aboutamazon.com/news/tag/sustainability\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Sustainability</a>\n                  </span>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.aboutamazon.com/news/sustainability/amazon-joins-initiative-to-scale-up-climate-friendly-technologies\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Amazon.com Inc.</strong> published this content on <strong>04 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>04 November 2021 15:02:30 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Amazon.com Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Amazon.com-Inc.</p></div>"}