{"date": "2022-02-08 14:34:13.880000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>PLANTING HOPE CO INC (\"MYLK-V;MYLKF-0\")\n- To Showcase Both RightRice(R) and Mozaics(TM) Product\n- Lines in QVC's Gourmet Holiday Show\n\n     The Planting Hope Company Inc. (\"Planting Hope\" or the \"Company\"), a\nplant-based food and beverage company focused on producing the world's most\nnutritious and planet-friendly products, has been invited to feature both\nMozaics(TM) Real Veggie Chips and RightRice(R) Veggie Rice live on QVC(R)'s\nGourmet Holiday Show (QVC 1) on Tuesday, February 8, 2022, between 3:00 and\n6:00 PM EST.\n\n     \"We are delighted to have both RightRice(R) and Mozaics(TM) invited\nback to QVC, a great supporter of innovative, better-for-you,\nbetter-for-the-planet brands,\" said Julia Stamberger, CEO and Co-Founder of\nPlanting Hope. \"QVC customers are uniquely invested in the brands they\nencounter through QVC's hosts, who showcase the delicious taste and ease of\npreparation of better-for-you brands and educate their loyal customers on\nappealing options that are easy to adopt in a healthy lifestyle. These\ncustomers are actively seeking options that deliver on both nutrition and\ndeliciousness, like our real veggie chips and veggie rice.\"\n\n     QVC is a world leader in video commerce, which includes video-driven\nshopping across linear TV, ecommerce sites, digital streaming, and social\nplatforms. QVC empowers shoppers with knowledge and shares insights in a\nlively and engaging way. In the United States, QVC 1 reaches 94 million\nhouseholds (1) and reaches millions more via multiple streaming services,\nwebsites, mobile apps, and social pages.\n\n(figure class=\"image image_resized\" style=\"width:608px;\")(/figure)     A\nQVC-exclusive, the 10-flavor variety pack of RightRice(R) featured in\ntoday's segment includes:\n\n*  2 bags Original\n*  2 bags Spanish\n*  2 bags Garlic Herb\n*  2 bags Cilantro Lime\n*  2 bags Lemon Pepper\n\n     After airing, this RightRice(R) variety pack will be available to\ncustomers on QVC.com, where customers can also purchase single flavor\nmulti-packs of their favorite RightRice(R) flavors.\n\n     RightRice(R) redefines a household staple with a delicious\nvegetable-based rice grain that is packed with the power of vegetables and\ncomplete plant-based protein. RightRice(R) is the first-of-its-kind: a\nshelf-stable vegetable grain that is a blend of over 90 percent vegetables,\nincluding lentils, chickpeas, green peas, and rice. With 10g of complete\nprotein and 5g fiber per serving, RightRice(R) delivers more than double\nthe protein, five times the fiber, and around 40 percent fewer net\ncarbohydrates than traditional white rice, plus it can be prepared in 10\nminutes.\n\n(figure class=\"image\")(/figure)     Today's show features two variety packs\nof Mozaics(TM) Real Veggie Chips, each containing 16 snack-sized bags:\n\n*  BBQ Set: 10 bags Sea Salt + 6 bags BBQ\n*  Salsa Set: 10 bags Sea Salt + 6 bags Salsa\n\n     After airing, this Mozaics(TM) variety pack will be available to\ncustomers on QVC.com, where customers can also purchase single flavor\nmulti-packs of their favorite Mozaics(TM) flavors.\n\n     Mozaics(TM) Real Veggie Chips feature real veggies as the number one\ningredient, including green peas, yellow peas, and black beans, delivering\nplant protein and dietary fiber in every snackable serving. Our customers\ncall Mozaics(TM) their 'guilt-free' snack indulgence - popped like popcorn\n(not fried like potato chips!), then seasoned, with a light spray of extra\nvirgin olive oil.\n\n     For more information about QVC, please visit www.qvc.com.\n\n//st\n\n* Source: <a href=\"https://corporate.qvc.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://corporate.qvc.com</a>/\n\n//et\n\n     About RightRice(R)\n\n     RightRice(R) redefines a household staple with a delicious\nvegetable-based rice grain that's packed with the power of vegetables and\ncomplete plant-based protein. RightRice(R) is the first-of-its-kind: a\nshelf-stable vegetable grain that's a blend of over 90 percent vegetables,\nincluding lentils, chickpeas, green peas, and rice, and delivers on both\ntaste and nutrition. With 10g of complete protein and 5g fiber per serving,\nRightRice(R) delivers more than double the protein, five times the fiber,\nand around 40 percent fewer net carbohydrates than traditional white rice,\nplus it can be prepared in about 10 minutes. RightRice(R) is now available\nin a range of pre-seasoned flavors, plus multiple flavors of RightRice(R)\nMedley and RightRice(R) Risotto. RightRice(R) products are currently sold\nin more than 7,000 doors in leading retailers across North America,\nincluding Whole Foods Market, Wegman's, Kroger, Sprouts,\nAlbertsons/Safeway, HEB, Ahold, Meijer, as well as online through Amazon,\nThrive Market, Hive, and RightRice.com. All RightRice(R) products are made\nusing real herbs and spices, and are plant-based, Non-GMO Project verified,\ncertified gluten-free, and certified kosher. RightRice(R) continues to\nreceive awards and acclaim since its launch in 2019, including People\nMagazine's Best Plant-Based Food Award, NOSH's Best New Product, and Sunset\nMagazine's 2021 Pantry Award, in addition to being highlighted as the Best\nAlt Grain Grocery Store Swap by goop. RightRice(R) Risotto was awarded Best\nSauce/Store Cupboard Product in FoodBev's 2021 World Plant-Based Taste\nAwards and received the 2021 Eco Excellence Award for Best Gluten Free\nProduct, in addition to being chosen as a 2021 Editors' Pick for Best New\nProduct by Progressive Grocer. For more information visit:\nwww.rightrice.com.\n\n     About Mozaics(TM)\n\n     Mozaics(TM) Real Veggie Chips deliver a tasty crunch that you can feel\ngreat about with 3g to 4g of plant protein per serving and 2-3g of dietary\nfiber. Our #1 ingredients are veggies you can see in each popped chip with\nflavors including Sea Salt, BBQ, and Salsa. Big taste, big nutrition,\nguilt-free - now that's a REAL veggie chip. Mozaics(TM) comes in 0.75oz.\nand 3.5oz. sizes and can be purchased individually at www.mozaicschips.com\nand Amazon. Subscription options also available. Mozaics(TM) has been\nrecognized as NEXTY 2020 Finalist, Best New Salty/Savory Snack; as Mindful\nFood Awards/Best Veggie Chip; and as a Snaxpo Finalist.\n\n     About The Planting Hope Company Inc.\n\n     Planting Hope develops, launches, and scales uniquely innovative\nplant-based and planet-friendly food and beverage brands. Planting Hope's\naward-winning and cutting-edge products fill key unmet needs in the\nskyrocketing plant-based food and beverage space. The Planting Hope brand\nfamily includes Hope and Sesame(R) Sesamemilk, RightRice(R) Veggie Rice,\nMozaics(TM) Real Veggie Chips, and Veggicopia(R) Veggie Snacks. Founded by\nexperienced food industry entrepreneurs, Planting Hope is a women-managed\nand woman-led company with a focus on nutrition, sustainability, and\ndiversity. For more information visit: www.plantinghopecompany.com.\n\n     Contacts\n\n Contact Information:\n\nContact:\nJulia Stamberger\nCEO and Co-founder\n(773) 492-2243\njulia@plantinghopecompany.com\n\n     Contact:\nRachel Kay Public Relations\nBecca Stonebraker\n(818) 383-3929\nbecca@rkpr.net\n\n     Investor Relations Contact:\nCaroline Sawamoto\nInvestor Relations\n(773) 492-2243\nir@plantinghopecompany.com\n\n     Neither the TSX Venture Exchange nor its Regulation Services Provider\n(as that term is defined in the policies of the TSX Venture Exchange)\naccepts responsibility for the adequacy or accuracy of this release.\n\n     Forward-Looking Statement\n\n     This news release contains \"forward-looking statements\" or\n\"forward-looking information\" (collectively referred to hereafter as\n\"forward-looking statements\") within the meaning of applicable Canadian\nsecurities legislation. All statements that address activities, events, or\ndevelopments that the Company expects or anticipates will, or may, occur in\nthe future, including statements about the Company's ability to execute on\nits goals, the timing pertaining to these goals the potential demand for\nthe Company's products, the timing and success of anticipated product\nlaunches and distribution of the Company's products, and the Company's\nbusiness prospects, future trends, plans and strategies. In some cases,\nforward looking statements are preceded by, followed by, or include words\nsuch as \"may\", \"will,\" \"would\", \"could\", \"should\", \"believes\", \"estimates\",\n\"projects\", \"potential\", \"expects\", \"plans\", \"anticipates\", \"continues\", or\nthe negative of those words or other similar or comparable words. In\npreparing the forward-looking statements in this news release, the Company\nhas applied several material assumptions, including, but not limited to,\nthe assumption that demand for the Company's product will be sustained or\nincrease in accordance with management's projections, that the Company's\ncurrent business objectives can be achieved and that its other corporate\nactivities will proceed as expected, and that general business and economic\nconditions will not change in a materially adverse manner. Although the\nmanagement of the Company believes that the assumptions made and the\nexpectations represented by such statements are reasonable, there can be no\nassurance that a forward-looking statement herein will prove to be\naccurate. Forward-looking statements involve known and unknown risks,\nuncertainties, and other factors which may cause the actual results,\nperformance, or achievements of the Company to be materially different from\nany future results, performance, or achievements expressed or implied by\nsuch forward-looking statements. Although management of the Company has\nattempted to identify important factors that could cause actual results to\ndiffer materially from those contained in forward-looking information,\nthere may be other factors that cause results not to be as anticipated,\nestimated, or intended. Risks and uncertainties applicable to the Company,\nas well as trends identified by the Company affecting its industry can be\nfound in the Company's annual information form dated January 6, 2022 and\nthe Company's continuous disclosure record available on SEDAR at\nwww.sedar.com. Such cautionary statements qualify all forward-looking\nstatements made in this news release. The Company undertakes no obligation\nto update or revise any forward-looking statements, whether as a result of\nnew information, future events, or otherwise, except as required by\napplicable law.\n\nTel   : 604-889-4790    PLANTING HOPE CO INC\nEmail : kendra@vancouvercorporate.ca\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203800141.MNPRE2203801645-06311420220208</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}