{"date": "2020-12-15 19:29:07.921000+00:00", "ticker": "AAF", "mrkt_info": {"open": 92.2, "close": 79.7}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><span>\n              <p>LONDON, December 15 (IFR)</p>\n              <ul class=\"bulleted-list arrowlist\">\n                <li>Pirelli leaves it late for €500m CB </li>\n                <li>Locals fuel up on Scandinavian Biogas float</li>\n                <li>DP Eurasia looks to boost liquidity with Istanbul listing</li>\n                <li>N Brown completes £100m fundraise</li>\n                <li>Ecofin amends timetable and reduces minimum target</li>\n              </ul>\n              <p>Italian tyre manufacturer <strong>Pirelli</strong> printed €500m of zero-coupon convertible bonds due 2025 on Monday evening in the latest pricing for a European equity-linked deal in December in the last 10 years, by IFR's calculations.</p>\n              <p>The paper was offered at 100%–102.5% of principal, to be redeemed at par, for a yield to maturity of negative 0.49% to 0%. The premium was marketed at 40%–45% above the reference price set in an accompanying delta placement.</p>\n              <p>The deal was multiple times covered on pre-sounding in advance of launch.</p>\n              <p>A credit assumption of 225bp was based on outstanding paper, with borrow available at 50bp.</p>\n              <p>Books were covered within 45 minutes of launching after the close on Monday. After 7pm, investors were guided that orders not at 100% of issue price and 45% premium risked missing out, with pricing in the delta expected to come at €4.30 and books closing at 7:30pm.</p>\n              <p>A banker involved said that the impetus for a post-close launch was that the time of year meant lower trading volumes, which could have translated into a lower reference share price. “We thought we could get better control on stock slippage through a post-market close placement,” he said.</p>\n              <p>Pricing came at par with a 45% premium over the €4.30 reference price representing a conversion price of €6.235. The delta placing comprised 12.1m shares totalling €52m, having launched with expectations of no more than €75m. The discount was 4.2% to the €4.489 close, with shares down 16% year-to-date.</p>\n              <p>On pricing, implied vol was 35% and the bond floor was 91.7%. Shares briefly traded above the conversion price in 2019.</p>\n              <p>The banker said that the decision was taken to favour the premium over the yield, especially as Pirelli has two large shareholders in China National Chemical Corporation and Camfin, owned by Pirelli chief executive Marco Tronchetti Provera, that are sensitive to dilution.</p>\n              <p>A book of around 100 lines was dominated by outright orders, including all of the top five orders.</p>\n              <p>The banker said that despite the deal coming late in the year there was feedback that some accounts would have preferred a larger deal. He said that the pipeline for January is already building.</p>\n              <p>Proceeds for Pirelli will be used to refinance debt and for general corporate purposes.</p>\n              <p>The bonds were trading around 101% on Tuesday morning.</p>\n              <p>Pirelli’s fundraising will take European equity-linked issuance for 2020 to approximately US$34.87bn. That is not quite the mammoth US$36.3bn recorded when equity-linked returned in 2009 after the financial crisis, but is the best annual tally for the region in the product since then.</p>\n              <p>\n                <span>Credit Suisse</span> and <span>Goldman Sachs</span> were global coordinators, and bookrunners with <span>Banca IMI</span>, <span>BNP Paribas</span>, <span>CICC</span>, <span>Mizuho International</span> and <span>UniCredit</span>.</p>\n              <p>\n                <strong>Scandinavian Biogas Fuels</strong> has completed its SKr520.2m (US$62.1m) Premier Growth Market Stockholm IPO with a multiple times covered book from investors attracted by the company's green credentials.</p>\n              <p>It will become the first listed company to receive a dark green rating from second opinion provider Cicero Shades of Green when it begins trading on Wednesday.</p>\n              <p>IPO pricing was fixed at launch at SKr37.50 per share, with the company issuing 9.33m new shares and 4.53m shares sold by Ahlstrom Capital, Apriori and family-owned company John Nurminen. Separately, management acquired 324,919 shares from shareholder AC Cleantech Growth Fund.</p>\n              <p>A book of fewer than 100 lines was multiple times covered with strong demand from domestic money and pan-Nordic accounts, as well as good support from the UK and Germany, and ESG and energy specialists.</p>\n              <p>\n                <span>ABG Sundal Collier</span> was bookrunner.</p>\n              <p>Primary proceeds of SKr350m will fund expansion of the company’s production capacity, primarily within liquid biogas, through investments in new plants and to part-refinance the November acquisition of Ekdalens Biotransporter, which transports organic materials to biogas facilities in southern Sweden. The acquisition is expected to close by the end of the year.</p>\n              <p>The company has production sites in Sweden, Norway and South Korea.</p>\n              <p>The market capitalisation is SKr1.145bn and the free-float 46.5%, rising to 51.1% on full exercise of a 10% secondary greenshoe.</p>\n              <p>Lansforsakringar Fondforvaltning, Handelsbanken Hallbar Energi and Skandia Sverige Hallbar injected SKr130m, or 22.2% of the IPO, as cornerstone investors.</p>\n              <p>\n                <strong>DP Eurasia</strong>, which runs the Domino’s Pizza franchise in Turkey, Russia, Azerbaijan and Georgia, said on Tuesday it is considering a dual listing on the Istanbul Stock Exchange or an IPO of its Turkish business. </p>\n              <p>“The board believes such an additional listing could generate further interest from new investors in the company, build momentum and drive a re-rating in the shares as well as boost liquidity in the trading of the shares,” the company said in a statement.</p>\n              <p>DP Eurasia floated on the London Stock Exchange in a £152m July 2017 IPO that priced at 200p. The shares started the year at 52.3p, dropped to a low close of 30.4p earlier this month and finished on Monday at 35.5p. The shares closed up more than 12.6% on Tuesday at 40p.</p>\n              <p>The company’s Turkish business accounted for approximately 68% of its sales in the 10 months to October 31 but DP said London will remain its principal market. Nine new stores were opened in Turkey during 2020, with leases signed for another 16 stores that are due to open in December or early 2021. Sales in the 10 months ended October 31 were up nearly 12% over 2019, driven by online orders accelerating during the coronavirus pandemic.</p>\n              <p>Morgan Stanley was global coordinator, and bookrunner with Citigroup on the 2017 IPO.</p>\n              <p>Online clothing and homeware company <strong>N Brown</strong> secured solid if not overwhelming support from shareholders for its £100m open offer that was fully guaranteed by members of the Alliance family, the company’s main shareholders.</p>\n              <p>Shareholders, excluding the Alliances, bought 34% of the open offer shares. Adding David Alliance, who was chairman of the company for 44 years until 2012, and his son Joshua who together owned 44.8% of the company prior to the offering makes for effective take-up of 78.8% from the offer of 174.7m shares at 57p each.</p>\n              <p>There was oversubscription of 7.7m shares in addition to that from the Alliances, so both were scaled back with 1.3m shares going to independent shareholders and 35.1m to the Alliances. Father and son now own 52% of the retailer of several niche fashion brands.</p>\n              <p>The retailer will use the money to repay secured debt. It is also transferring to an AIM listing on December 23 from the main market on the LSE. The stock closed on Tuesday up 2.98% at 62.3p.</p>\n              <p>\n                <span>Jefferies </span>was global coordinator and sponsor with <span>Rothschild</span>, and Jefferies and <span>Shore Capital</span> are corporate brokers. Rothschild is financial adviser and Shore Capital is nominated adviser for the AIM listing.</p>\n              <p>\n                <strong>Ecofin US Renewables Infrastructure</strong>\n                <strong>Trust </strong>will wrap up bookbuilding on Thursday for its extended IPO, having also cut its fundraising target.</p>\n              <p>The trust had targeted US$250m but failed to reach the minimum US$150m when the IPO was due to close last week. Ecofin is now seeking US$125m.</p>\n              <p>A fund managed by Capricorn Investment Group, a long-standing partner of Ecofin, agreed at launch to subscribe for 5% of the shares in the IPO.</p>\n              <p>Ecofin said that it was “encouraged by the response to the proposition from a broad range of institutional investors and private wealth managers” and that Capricorn will invest more than 5%.</p>\n              <p>The trust will invest in US renewable energy assets benefiting from support from government incentives and the availability of fixed revenue contracts of 10–25 years.</p>\n              <p>A result will be published on Friday and trading is due on December 22.</p>\n              <p>\n                <span>Stifel</span> is sole bookrunner.</p>\n              <p>Last night's institutional selldown in London-listed <strong>Airtel Africa</strong> priced at 80p per share for a £48m deal size and 13.2% discount to the 92.2p close. The sale represented 1.6% of outstanding and <span>JP Morgan</span> was sole bookrunner.</p>\n              <p>xxxx</p>\n              <h3>This week’s deals</h3>\n              <p>\n                <strong>Monday</strong>\n              </p>\n              <p>\n                <strong>Granges (Sweden – Aluminium): </strong>SKr1.7bn (US$198m) rights issue, 28.34m new on 4-for-11 basis at SKr60 (32.2% discount to TERP), 66.4% shareholder commitments, balance underwritten, subscription November 27-December 11, rights trading finishes December 8. <span>Danske Bank, Nordea, Svenska Handelsbanken</span></p>\n              <p>\n                <strong>Gore Street Energy Storage Fund (UK): </strong>£60m initial placing, offer for subscription and intermediaries offer, 60m new shares at 100p (7.8% to the November 27 close of 108.5p, and a 3.6 % premium to the last reported NAV of 96.2p).<span> JP Morgan, Shore Capital</span></p>\n              <p>\n                <b>N Brown (UK – Online clothing retailer): </b>£100m placing and open offer, 174.66m in conditional placing, offered in 11-for-18 open offer November 6-December 14, 78.8% take-up. <span>Jefferies</span> (<span>Rothschild</span> advising)</p>\n              <p>\n                <b>Scandinavian Biogas Fuels (Sweden): </b>SKr532.4m (US$63m) Premier Growth Market Stockholm IPO, 9.33m primary and 4.8m secondary at fixed SKr37.50, 1.4m 10% secondary greenshoe, 46.5%-51.1% free-float, trading December 16. <span>ABG Sundal Collier</span></p>\n              <p>\n                <b>Pirelli (Italy – Tyres):</b> €500m 2025 CB at 100% (100%–102.5%), 0% coupon, 0% YTM (negative 0.49% to 0%), €6.235 conversion price, 45% premium (40%–45%) 12.1m delta placing at €4.30 (4.2% discount to €4.489 close).<span> Credit Suisse, Goldman Sachs</span>, <span>BNP Paribas, CICC, ING, Intesa Sanpaolo, Mizuho International, UniCredit</span></p>\n              <p>\n                <strong>Tuesday</strong>\n              </p>\n              <p>\n                <b>Round Hill Music Royalty Fund: </b>Placing at US$1.01. Closes 3pm December 15, result December 16. <span>Cenkos</span></p>\n              <p>\n                <strong>\n                  <b>Wednesday</b>\n                </strong>\n              </p>\n              <p>\n                <strong>\n                  <b>Schroder BCS Social (UK – Fund): </b>\n                </strong>£100m IPO via placing, offer for subscription and intermediaries offer, 100m at 100p, intermediaries/offer for subscription November 23-December 15, placing closes December 16, result December 17, trading December 22. <span>Winterflood Securities</span></p>\n              <p>\n                <b>Thursday</b>\n              </p>\n              <p>\n                <b>Ecofin US Renewables Infrastructure Trust (UK): </b>US$125m LSE IPO, 125m at US$1. <span>Stifel</span></p>\n              <h2>Pipeline </h2>\n              <p>\n                <strong>PENDING - JP Morgan Global Core Real Assets (UK)</strong>\n              </p>\n              <p>£80m-plus placing, offer for subscription and intermediaries offer at 100p, closes December 9, result December 10. <span>JP Morgan</span></p>\n              <p>\n                <strong>December </strong>\n                <strong>– </strong>\n                <strong>Agyapa<span> </span>Royalties (Ghana – Gold)</strong>\n              </p>\n              <p>US$400m-$500m IPO,<span> </span>LSE<span> </span>and Ghanaian Stock Exchange.<span> </span><span>Bank of America,<span> </span>JP<span> </span>Morgan</span></p>\n              <p>\n                <b>January 2021 - InDex Pharmaceuticals (Sweden)</b>\n              </p>\n              <p>SKr500m rights issue, January EGM, terms to follow. <span>Barclays</span>, <span>Carnegie</span></p>\n              <p>\n                <b>January 2021 - Swiss Steel</b>\n              </p>\n              <p>€200m-equivalent rights issue, December 22 EGM, guaranteed by main shareholder</p>\n              <p>\n                <b>February 2021 – VH Global Sustainable Energy Opportunities (UK)</b>\n              </p>\n              <p>£400m London IPO, prospectus early January, completion February. <span><span>Numis</span></span></p>\n              <p>\n                <b>March 2021 – ITAB Shop Concept (Sweden – Retail solutions)</b>\n              </p>\n              <p>SKr768m (US$91m) rights issue, 102.38m on 1-for-1 basis at SKr7.50 (24% discount to SKr9.91 TERP), 94% guaranteed, EGM January 15, subscription mid-February. <span>Macquarie Capital</span>, <span>Nordea</span></p>\n              <p>\n                <b>H1 2021 </b>\n                <strong>– </strong>\n                <strong>Sasol (South Africa - Chemicals)</strong>\n              </p>\n              <p>US$2bn rights issue. <span>Bank of America, Citigroup, JP Morgan</span></p>\n              <p>\n                <b>2021 </b>\n                <strong> – Vallourec (France – Steel tubes)</strong>\n              </p>\n              <p>€800m fully underwritten capital increase, approval at<span> </span>EGM<span> </span>April 6.<span> </span><span>BNP<span> </span>Paribas</span>,<span> </span><span>Morgan Stanley</span>,<span> </span><span>Natixis</span>,<span> </span><span>Societe Generale</span></p>\n              <p>\n                <b>2021</b>\n                <strong> </strong>\n                <strong>– Keliber (Finland – Lithium mining)</strong>\n              </p>\n              <p>Helsinki IPO.<span> </span><span>Carnegie</span>,<span> </span><span>Nordea</span></p>\n              <p>\n                <strong>2021– Giochi Preziosi (Italy – Toys)</strong>\n              </p>\n              <p>IPO.<span> </span><span>Banca Akros</span>, <span>Banca IMI</span>, <span>Barclays</span>, <span>Jefferies,<span> </span>Santander</span> (<span>Rothschild<span> </span></span>advising)</p>\n              <p>Contact the European<span> </span>ECM<span> </span>team at<span> </span><a href=\"mailto:IFRECM.EMEA@refinitiv.com\" data-type=\"email\" translate=\"no\">IFRECM.EMEA@refinitiv.com</a></p>\n              <p>Owen Wild: +44 78 8126 4973,<span> </span><a href=\"mailto:owen.wild@tr.com\" data-type=\"email\" translate=\"no\">owen.wild@refinitiv.com</a><br/>Robert<span> </span>Venes: +44 204 530 2523,<span> </span><a href=\"mailto:robert.venes@tr.com\" data-type=\"email\" translate=\"no\">robert.venes@refinitiv.com</a><br/>Lucy<span> </span>Raitano: +44 78 7174 0851,<span> </span><a href=\"mailto:lucy.raitano@tr.com\" data-type=\"email\" translate=\"no\">lucy.raitano@refinitiv.com</a></p>\n              <h3>EMEA equities: 01-Jan-2020 to 14-Dec-2020 UTC (SDC: C4cr)</h3>\n              <div class=\"story-table-container\"><table class=\"league-table-sdc-c4cr story-basic-table\">\n                <thead>\n                  <tr class=\"persist-header\">\n                    <th> </th>\n                    <th>Managing bank / group</th>\n                    <th>No of issues</th>\n                    <th>Total US$(m)</th>\n                    <th>Share (%)</th>\n                  </tr>\n                </thead>\n                <tbody>\n                  <tr>\n                    <td>1</td>\n                    <td>Morgan Stanley</td>\n                    <td>60</td>\n                    <td>14,828.40</td>\n                    <td>8.7</td>\n                  </tr>\n                  <tr>\n                    <td>2</td>\n                    <td>Goldman Sachs</td>\n                    <td>75</td>\n                    <td>14,779.69</td>\n                    <td>8.7</td>\n                  </tr>\n                  <tr>\n                    <td>3</td>\n                    <td>Citigroup</td>\n                    <td>72</td>\n                    <td>13,119.85</td>\n                    <td>7.7</td>\n                  </tr>\n                  <tr>\n                    <td>4</td>\n                    <td>JP Morgan</td>\n                    <td>87</td>\n                    <td>12,451.02</td>\n                    <td>7.3</td>\n                  </tr>\n                  <tr>\n                    <td>5</td>\n                    <td>Bank of America</td>\n                    <td>59</td>\n                    <td>11,131.67</td>\n                    <td>6.5</td>\n                  </tr>\n                  <tr>\n                    <td>6</td>\n                    <td>Credit Suisse</td>\n                    <td>47</td>\n                    <td>8,639.19</td>\n                    <td>5.1</td>\n                  </tr>\n                  <tr>\n                    <td>7</td>\n                    <td>Barclays</td>\n                    <td>49</td>\n                    <td>7,179.32</td>\n                    <td>4.2</td>\n                  </tr>\n                  <tr>\n                    <td>8</td>\n                    <td>BNP Paribas</td>\n                    <td>45</td>\n                    <td>5,859.71</td>\n                    <td>3.4</td>\n                  </tr>\n                  <tr>\n                    <td>9</td>\n                    <td>HSBC</td>\n                    <td>37</td>\n                    <td>5,638.88</td>\n                    <td>3.3</td>\n                  </tr>\n                  <tr>\n                    <td>10</td>\n                    <td>Jefferies</td>\n                    <td>51</td>\n                    <td>4,801.87</td>\n                    <td>2.8</td>\n                  </tr>\n                  <tr>\n                    <td>11</td>\n                    <td>UBS</td>\n                    <td>29</td>\n                    <td>4,526.44</td>\n                    <td>2.7</td>\n                  </tr>\n                  <tr>\n                    <td>12</td>\n                    <td>Numis</td>\n                    <td>45</td>\n                    <td>3,814.62</td>\n                    <td>2.2</td>\n                  </tr>\n                  <tr>\n                    <td>13</td>\n                    <td>Carnegie</td>\n                    <td>78</td>\n                    <td>3,127.08</td>\n                    <td>1.8</td>\n                  </tr>\n                  <tr>\n                    <td>14</td>\n                    <td>Berenberg</td>\n                    <td>38</td>\n                    <td>3,059.59</td>\n                    <td>1.8</td>\n                  </tr>\n                  <tr>\n                    <td>15</td>\n                    <td>Deutsche Bank</td>\n                    <td>27</td>\n                    <td>2,765.59</td>\n                    <td>1.6</td>\n                  </tr>\n                  <tr>\n                    <td>16</td>\n                    <td>UniCredit</td>\n                    <td>15</td>\n                    <td>2,071.07</td>\n                    <td>1.2</td>\n                  </tr>\n                  <tr>\n                    <td>17</td>\n                    <td>Santander</td>\n                    <td>15</td>\n                    <td>2,053.61</td>\n                    <td>1.2</td>\n                  </tr>\n                  <tr>\n                    <td>18</td>\n                    <td>Davy</td>\n                    <td>9</td>\n                    <td>1,994.42</td>\n                    <td>1.2</td>\n                  </tr>\n                  <tr>\n                    <td>19</td>\n                    <td>Nordea</td>\n                    <td>36</td>\n                    <td>1,820.79</td>\n                    <td>1.1</td>\n                  </tr>\n                  <tr>\n                    <td>20</td>\n                    <td>ABG Sundal Collier</td>\n                    <td>55</td>\n                    <td>1,816.63</td>\n                    <td>1.1</td>\n                  </tr>\n                  <tr>\n                    <td>21</td>\n                    <td>SG</td>\n                    <td>22</td>\n                    <td>1,799.44</td>\n                    <td>1.1</td>\n                  </tr>\n                  <tr>\n                    <td>22</td>\n                    <td>Danske Bank</td>\n                    <td>30</td>\n                    <td>1,728.32</td>\n                    <td>1.0</td>\n                  </tr>\n                  <tr>\n                    <td>23</td>\n                    <td>VTB Capital</td>\n                    <td>7</td>\n                    <td>1,454.82</td>\n                    <td>0.9</td>\n                  </tr>\n                  <tr>\n                    <td>24</td>\n                    <td>Investec</td>\n                    <td>22</td>\n                    <td>1,444.49</td>\n                    <td>0.8</td>\n                  </tr>\n                  <tr>\n                    <td>25</td>\n                    <td>SEB</td>\n                    <td>20</td>\n                    <td>1,363.68</td>\n                    <td>0.8</td>\n                  </tr>\n                </tbody>\n                <tfoot>\n                  <tr>\n                    <td>\n                      <div>-</div>\n                    </td>\n                    <td>TOTAL</td>\n                    <td>1089</td>\n                    <td>170,085.02</td>\n                    <td>100.0</td>\n                  </tr>\n                </tfoot>\n              </table></div>\n              <p>Including all domestic and international deals and rights issues</p>\n              <p>\n                <strong>Source:</strong> Refinitiv <strong>SDC code:</strong> C4cr</p>\n              <h3>Global Convertible Offerings - EMEA: 01-Jan-2020 to 14-Dec-2020 UTC (SDC: C09d)</h3>\n              <div class=\"story-table-container\"><table class=\"league-table-sdc-c09d story-basic-table\">\n                <thead>\n                  <tr class=\"persist-header\">\n                    <th> </th>\n                    <th>Managing bank / group</th>\n                    <th>No of issues</th>\n                    <th>Total</th>\n                    <th>Share (%)</th>\n                  </tr>\n                </thead>\n                <tbody>\n                  <tr>\n                    <td>1</td>\n                    <td>JP Morgan</td>\n                    <td>29</td>\n                    <td>5,527.58</td>\n                    <td>16.1</td>\n                  </tr>\n                  <tr>\n                    <td>2</td>\n                    <td>Morgan Stanley</td>\n                    <td>16</td>\n                    <td>3,512.10</td>\n                    <td>10.3</td>\n                  </tr>\n                  <tr>\n                    <td>3</td>\n                    <td>BNP Paribas</td>\n                    <td>25</td>\n                    <td>3,402.64</td>\n                    <td>9.9</td>\n                  </tr>\n                  <tr>\n                    <td>4</td>\n                    <td>Goldman Sachs</td>\n                    <td>22</td>\n                    <td>3,152.99</td>\n                    <td>9.2</td>\n                  </tr>\n                  <tr>\n                    <td>5</td>\n                    <td>HSBC</td>\n                    <td>14</td>\n                    <td>2,107.56</td>\n                    <td>6.2</td>\n                  </tr>\n                  <tr>\n                    <td>6</td>\n                    <td>Credit Agricole</td>\n                    <td>16</td>\n                    <td>2,102.25</td>\n                    <td>6.1</td>\n                  </tr>\n                  <tr>\n                    <td>7</td>\n                    <td>Barclays</td>\n                    <td>13</td>\n                    <td>1,924.96</td>\n                    <td>5.6</td>\n                  </tr>\n                  <tr>\n                    <td>8</td>\n                    <td>UniCredit</td>\n                    <td>11</td>\n                    <td>1,803.54</td>\n                    <td>5.3</td>\n                  </tr>\n                  <tr>\n                    <td>9</td>\n                    <td>Bank of America</td>\n                    <td>15</td>\n                    <td>1,759.53</td>\n                    <td>5.1</td>\n                  </tr>\n                  <tr>\n                    <td>10</td>\n                    <td>SG</td>\n                    <td>13</td>\n                    <td>1,632.00</td>\n                    <td>4.8</td>\n                  </tr>\n                  <tr>\n                    <td>11</td>\n                    <td>Citigroup</td>\n                    <td>10</td>\n                    <td>1,607.44</td>\n                    <td>4.7</td>\n                  </tr>\n                  <tr>\n                    <td>12</td>\n                    <td>UBS</td>\n                    <td>10</td>\n                    <td>1,162.17</td>\n                    <td>3.4</td>\n                  </tr>\n                  <tr>\n                    <td>13</td>\n                    <td>Jefferies</td>\n                    <td>3</td>\n                    <td>748.26</td>\n                    <td>2.2</td>\n                  </tr>\n                  <tr>\n                    <td>14</td>\n                    <td>Natixis</td>\n                    <td>6</td>\n                    <td>714.51</td>\n                    <td>2.1</td>\n                  </tr>\n                  <tr>\n                    <td>15</td>\n                    <td>Deutsche Bank</td>\n                    <td>5</td>\n                    <td>620.97</td>\n                    <td>1.8</td>\n                  </tr>\n                  <tr>\n                    <td>16</td>\n                    <td>Banca IMI</td>\n                    <td>3</td>\n                    <td>353.10</td>\n                    <td>1.0</td>\n                  </tr>\n                  <tr>\n                    <td>17</td>\n                    <td>Commerzbank</td>\n                    <td>3</td>\n                    <td>298.16</td>\n                    <td>0.9</td>\n                  </tr>\n                  <tr>\n                    <td>18</td>\n                    <td>Wells Fargo</td>\n                    <td>1</td>\n                    <td>287.50</td>\n                    <td>0.8</td>\n                  </tr>\n                  <tr>\n                    <td>19</td>\n                    <td>VTB Capital</td>\n                    <td>1</td>\n                    <td>250.00</td>\n                    <td>0.7</td>\n                  </tr>\n                  <tr>\n                    <td>20</td>\n                    <td>ING</td>\n                    <td>2</td>\n                    <td>160.81</td>\n                    <td>0.5</td>\n                  </tr>\n                  <tr>\n                    <td>21</td>\n                    <td>RBC</td>\n                    <td>2</td>\n                    <td>115.00</td>\n                    <td>0.3</td>\n                  </tr>\n                  <tr>\n                    <td>22</td>\n                    <td>Swedbank</td>\n                    <td>2</td>\n                    <td>104.20</td>\n                    <td>0.3</td>\n                  </tr>\n                  <tr>\n                    <td>23</td>\n                    <td>Mizuho</td>\n                    <td>1</td>\n                    <td>96.15</td>\n                    <td>0.3</td>\n                  </tr>\n                  <tr>\n                    <td>24</td>\n                    <td>BBVA</td>\n                    <td>1</td>\n                    <td>96.15</td>\n                    <td>0.3</td>\n                  </tr>\n                  <tr>\n                    <td>25</td>\n                    <td>ABG Sundal Collier</td>\n                    <td>2</td>\n                    <td>86.41</td>\n                    <td>0.3</td>\n                  </tr>\n                </tbody>\n                <tfoot>\n                  <tr>\n                    <td>\n                      <div>-</div>\n                    </td>\n                    <td>TOTAL</td>\n                    <td>69</td>\n                    <td>34,261.24</td>\n                    <td>100.0</td>\n                  </tr>\n                </tfoot>\n              </table></div>\n              <p>Including exchangeables.</p>\n              <p>\n                <strong>Source:</strong> Refinitiv <strong>SDC code:</strong> C09d</p>\n            </span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © Refinitiv 2020. Click For Restrictions - https://www.refinitiv.com/en/policies/copyright-notice</p></div>"}