{"date": "2021-11-29 22:12:09.615000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NAKED BRAND GROUP INC (\"NAKD-Q\")\n- Cenntro Receives Order for 2,000 Metro Electric Commercial\n- Vehicles in Japan End Customers Include Amazon Fleet and Hana\n- Cupid\n\n     Cenntro Automotive (\"Cenntro\", the \"Company\" or \"We\"), a leading EV\ntechnology company with advanced, market-validated commercial vehicles,\ntoday announced it has received an order of 2,000 Metro (Kei Car Type)\nelectric vehicles from its channel partner in Japan, HW ELECTRO, with\ndeliveries expected to begin in January 2022.\n\n     The order follows the recent announcement of Cenntro's Metro receiving\nKei car approval as the first imported, non-Japanese made, all-electric\ncommercial vehicle. The Metro order will be deployed to support last-mile\ndelivery and logistics companies including Amazon Fleet, Amazon's local\ndelivery partner in Japan, and Hana Cupid, Japan's largest floral gifting\nassociation. Amazon Fleet is currently supported by 2,000 dedicated\nvehicles in Tokyo and Hana Cupid has a network of 4,500 member stores in\nJapan.\n\n     \"HW ELECTRO has established deep relationships with renowned companies\nin Japan's transportation and logistics sector. They are an excellent\nstrategic partner to introduce our vehicles throughout the country,\" said\nPeter Wang, Cenntro's Chairman and Chief Executive Officer. \"This purchase\norder represents a significant milestone for Cenntro in Japan, one of our\nkey strategic markets. Japan has historically been a bellwether for new\ntransportation and logistics trends and the initial order for 2,000\nvehicles for end customers like Tokyo's Amazon Fleet and Hana Cupid\nrepresents a significant market opportunity. The approval of Cenntro's\nMetro electric Kei car ahead of local brands provides us a substantial\nadvantage in the growing last-mile delivery sector in Japan. We expect\ncontinued strong interest in the Metro and growing sales momentum ahead.\"\n\n     HW ELECTRO was an early advocate for \"Electric-Mobility-Innovation\" in\nJapan and through its partnership with Autobacs, a leading Japanese vehicle\ndealership, the firm is confident the Metro, locally called the ELEMO-K,\nwill lead fleets to further integrate EVs into their operations.\n\n     About Cenntro Automotive Group\n\n     A leading EV technology company with advanced, market-validated\ncommercial vehicles, which has entered into a definitive merger agreement\nwith Naked Brand Group Limited (NASDAQ: NAKD) with Cenntro's shareholders\nto own approximately 70% of the combined entity on a fully-diluted basis.\nCenntro leads the transformation in the automotive industry through\nscalable, decentralized production and fully digitalized autonomous driving\nsolutions empowered by the Cenntro iChassis. Cenntro has sold and delivered\n3300 commercial EVs in more than 26 countries as of Dec 2020. For more\ninformation about the company, please visit www.cenntroauto.com.\n     For further information:\n\n     Investor Contact\n\n     IR@cenntroauto.com\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133200364.MNPRE2133201636-07365720211129</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}