{"date": "2021-11-19 19:37:17.305000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3696.06, "close": 3572.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>E-commerce retailer Amazon has introduced a packaging solution made from recycled paper to make grocery delivery more sustainable.</p><p>Manufactured regionally in the US, the kerbside-recyclable insulation packaging will be used for delivering products from Amazon Fresh grocery hubs, stores and Whole Foods Market locations.Amazon has tested the packaging's thermal effectiveness in its internal thermal labs, as well as in multiple external labs in North America and Europe.The retailer also conducted 'secret-shopper programmes' to validate the solution's thermal effectiveness, as well as consumer pilots in multiple cities.Amazon Grocery vice-president Stephenie Landry said: \"This new packaging is just the latest step in Amazon's commitment to both The Climate Pledge, a bold commitment to be net-zero carbon across our business by 2040, and to building a sustainable business for our employees, customers and the planet.\"The initiative is part of Amazon's wider sustainability efforts and its commitment to becoming carbon-neutral across its business by 2040.It is expected to replace around 735,000lb of plastic film, 3.15 million pounds of natural cotton fibre and 15 million pounds of non-recyclable mixed plastic a year.Amazon grocery delivery packaging team senior programme manager Joe Rake led the project to develop the packaging.Rake said: \"Our teams are constantly working on ways to minimise waste, increase recycling and provide options for customers to reuse, repair and recycle their products.\"The goal is to send less material to the landfill and more back into the circular economy loop.\"This recyclable packaging will hopefully inspire others, both at Amazon and elsewhere, to continue finding creative, sustainable solutions for customers and communities around the world.\"In 2018, Amazon introduced frozen water bottles as an alternative to frozen gel packs to provide a more widely recyclable and reusable grocery insulation solution.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}