{"date": "2021-12-22 19:32:12.391000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3408.34, "close": 3421.37}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>AWS has chosen Shiji as the pilot Partner for newly launched AWS Outpost servers, amplifying Shiji's initiatives as a global hospitality solutions provider.</p><p>Shiji has recently announced that Amazon Web Services, Inc. (AWS) has selected Shiji as the pilot Partner for their newly launched AWS Outposts servers, a fully managed service that offers hybrid cloud experiences to run the same AWS infrastructure and services, application programming interfaces (APIs) and tools to locations with limited space.The work between Shiji and AWS has continued to amplify Shiji's initiatives as a global industry-leading hospitality solutions provider. With the addition of AWS Outposts servers Shiji plans to introduce next-level cloud technology to the restaurant point-of-sale customers of Infrasys.AWS Outposts servers provide AWS infrastructure and services to sites with space and capacity constraints for a truly consistent hybrid experience. They are ideal for low-latency and local data processing needs.Shiji, a multi-national hospitality technology company, earlier this year selected AWS to build and move many of its products onto AWS, on top of achieving the AWS Travel and Hospitality Independent Software Vendor (ISV) Competency status.\"We are thrilled to work with AWS as the pilot Partner for their new AWS Outposts servers as we pave the way into the next generation of cloud-based technology and infrastructure. As we have already been working hand in hand with AWS, the continued relationship further solidifies our commitment to building enterprise-level, cloud-based products, and solutions to enable better guest experiences and operations for the hospitality industry,\" said Michael Heinze, Chief Architect, Shiji Group.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}