{"date": "2022-01-19 14:12:56+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n          Stans, Switzerland\n        </li>\n                  <li>\n          19 January 2022\n        </li>\n                </ul>\n                <div>\n        SoftwareONE Holding AG, a leading global provider of software and cloud technology solutions, today announced a multi-year strategic collaboration agreement with Amazon Web Services (AWS) to accelerate their customers' cloud journeys. Through this comprehensive agreement, SoftwareONE and AWS will collaborate to accelerate the adoption of AWS services and solutions globally across all industries, supported by joint investments into go-to-market and delivery capabilities.\n      </div>\n                <div>\n                  <div>\n                    <p>\n            Building on a well-established relationship, SoftwareONE and AWS have entered into a multi-year Strategic Collaboration Agreement to provide customers globally with a variety of AWS solutions and services to support their cloud migration and modernization efforts. Key areas of collaboration include accelerating growth of SoftwareONE's Simple for AWS offering, industrializing AWS cloud migrations and driving AWS Marketplace adoption in conjunction with SoftwareONE's platform PyraCloud.\n          </p>\n                    <p>\n            SoftwareONE helps customers manage their software and cloud spend through software digital supply chain and FinOps Certified services and platforms. By accessing thousands of ISV partners consolidated in SoftwareONE's ecosystem, customers can use volume to maximize the value of the AWS Estate. At the same time, customers can achieve ongoing AWS cloud cost optimization and management. SoftwareONE's PyraCloud platform delivers a single digital experience for customers to help manage their software and cloud spend in one place.\n          </p>\n                    <p>\n            Utilizing investments from AWS, SoftwareONE will further develop its global Cloud Center of Excellence with best-in-class and fully certified AWS resources to support and improve the overall customer experience. In addition, SoftwareONE will provided dedicated training for the next generation of AWS cloud professionals through the SoftwareONE Academy by sourcing talent from a diverse range of backgrounds. The Academy will leverage AWS Education Programs to develop both sales and technical capabilities to support entire customer journeys and overall growth of SoftwareONE's AWS practice.\n          </p>\n                    <p>\n            SoftwareONE's Chief Executive Officer, Dieter Schlosser, said, \"We maintain long-term relationships with our customers, modernizing their software, cloud and technology to attain their digital transformation goals. This ground-breaking agreement signals our commitment to scaling out our global AWS practice to advance our customers' multi-cloud strategies. It underpins our vision of growing our Application Services, SAP Services, Industry Vertical Solutions, Cloud Services and FinOps to a combined CHF 1 billion services business by 2025. Finally, it helps our PyraCloud platform customers optimize their AWS cloud service consumption.\"\n          </p>\n                    <p>\n            \"As cloud adoption accelerates, we are excited to work with our AWS Public Sector Partners, like SoftwareONE, that are global in scale and have comprehensive cloud-native expertise and delivery capabilities to address mission-critical tasks and the complex needs of today's organizations,\" said Jeff Kratz, Vice President, Worldwide Public Sector Partners and Programs, AWS.\n          </p>\n                    <p>\n            SoftwareONE is an AWS Advanced Consulting Partner and recently acquired HeleCloud, an AWS Premier Consulting Partner and AWS Managed Service Provider. SoftwareONE also holds competencies for Migration, SAP, DevOps, Solution Provider, Public Sector, AWS Well-Architected Program, End User Computing and Microsoft Workloads.\n          </p>\n                    <p>\n            No terms or financial details of the agreement have been disclosed.\n          </p>\n                  </div>\n                  <div>\n                    <a href=\"https://www.softwareone.com/-/media/global/about/investors/files/softwareone-2022-aws-strategic-collaboration-agreement-20220119-en.pdf?rev=cbb40055c64645068d8b4e75211d834b&amp;sc_lang=en-us\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Download PDF English</a>\n                  </div>\n                  <div>\n                    <a href=\"https://www.softwareone.com/-/media/global/about/investors/files/softwareone-2022-aws-strategic-collaboration-agreement-20220119-de.pdf?rev=ee59fd40694f44ccbd948365655a215f&amp;sc_lang=en-us\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Download PDF German</a>\n                  </div>\n                  <div>\n                    <h4>\n            About SoftwareONE\n          </h4>\n                    <div>\n                      <p>\n              SoftwareONE is a leading global provider of end-to-end software and cloud technology solutions, headquartered in Switzerland. With an IP and technology-driven services portfolio, it enables companies to holistically develop and implement their commercial, technology and digital transformation strategies. This is achieved by modernizing applications and migrating critical workloads on public clouds, while simultaneously managing and optimizing the related software and cloud assets and licensing. SoftwareONE's offerings are connected by PyraCloud, its proprietary digital platform, which provides customers with data-driven, actionable intelligence. With around 8,300 employees and sales and service delivery capabilities in 90 countries, SoftwareONE provides around 65,000 business customers with software and cloud solutions from over 7,500 publishers. SoftwareONE's shares (SWON) are listed on SIX Swiss Exchange. For more information, please visit <a href=\"https://www.softwareone.com/en/about/investors\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.softwareone.com/investors</a><br/></p>\n                      <p>\n              SoftwareONE Holding AG, Riedenmatt 4, CH-6370 Stans\n            </p>\n                    </div>\n                  </div>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.softwareone.com/en-us/pressreleases/2022/01/19/softwareone-and-amazon-web-services-sign-strategic-collaboration-agreement\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>SoftwareONE Holding AG</strong> published this content on <strong>19 January 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>19 January 2022 14:12:56 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - SoftwareONE Holding AG</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SoftwareONE-Holding-AG</p></div>"}