{"date": "2021-12-15 07:01:21+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        Amazon has today opened a new Amazon Fresh grocery store at Regent's Place, one of British Land's London campuses. Located on the ground floor of Euston Tower, the 2,500 sq ft store is the second Amazon Fresh to open in British Land's portfolio, following the opening of its first ever UK store at Ealing Broadway in March.\n      </p>\n                <p>\n        The letting follows a period of excellent leasing activity, with over 1 million sq ft of retail deals signed in the first half of the year. It also reflects the attraction of British Land's campuses, which benefit from excellent locations, proximity to key transport links and access to a diverse mix of office occupiers.\n      </p>\n                <p>\n        The store uses Amazon's Just Walk Out technology, designed to offer a convenient and seamless shopping experience for customers. After scanning into the store using a smartphone QR code on the Amazon app, customers can shop Amazon Fresh's range of food and daily essentials, including Amazon's private label, 'by Amazon', then walk out of the store without having to visit a cashier. Billing and receipts are handled through the customer's Amazon account shortly after their visit.\n      </p>\n                <p>\n                  <strong>Darren Richards, Head of Real Estate at British Land,</strong> said: \"We are thrilled to welcome Amazon Fresh to Regent's Place. The campus benefits from its proximity to local and international transport links, the latest in sustainable design and a lively mix of retail, leisure and public spaces. The letting follows one of our strongest six months for retail leasing activity in recent years, with total activity of more than 1 million sq ft.\"\n      </p>\n                <p>\n        Amazon Fresh joins a diverse mix of high street brands, independent stores and leisure brands, including speciality coffee chain, Black Sheep Coffee, Asian-inspired food chain, itsu, independent Italian restaurant, Nuvola, and boutique hair salon, Don Hair Port.\n      </p>\n                <p>\n                  <strong>- ENDS -</strong>\n                </p>\n                <div class=\"story-table-container\"><table class=\"story-basic-table\">\n                  <tbody>\n                    <tr>\n                      <td>\n                        <strong>Media:</strong>\n                      </td>\n                      <td>\n                      </td>\n                    </tr>\n                    <tr>\n                      <td>\n              Lizzie King, British Land\n            </td>\n                      <td>\n              07808 912 784\n            </td>\n                    </tr>\n                    <tr>\n                      <td>\n              Giles Barrie, FTI Consulting\n            </td>\n                      <td>\n              07798 926 814\n            </td>\n                    </tr>\n                  </tbody>\n                </table></div>\n                <p>\n                  <strong>Notes to Editors</strong>\n                </p>\n                <p>\n                  <strong>About British Land</strong>\n                </p>\n                <p>\n        Our portfolio of high quality UK commercial property is focused on London Campuses and Retail &amp; Fulfilment assets throughout the UK. We own or manage a portfolio valued at £13.3bn (British Land share: £9.8bn) as at 30 September 2021 making us one of Europe's largest listed real estate investment companies.\n      </p>\n                <p>\n        We create Places People Prefer, delivering the best, most sustainable places for our customers and communities. Our strategy is to leverage our best in class platform and proven expertise in development, repositioning and active management, investing behind two key themes: Campuses and Retail &amp; Fulfilment.\n      </p>\n                <p>\n        Our three Campuses at Broadgate, Paddington Central and Regent's Place are dynamic neighbourhoods, attracting growth customers and sectors, and offering some of the best connected, highest quality and most sustainable space in London. We are delivering our fourth Campus at Canada Water, where we have planning consent to deliver 5m sq ft of residential, commercial, retail and community space over 53 acres. Our Campuses account for 70% of our portfolio.\n      </p>\n                <p>\n        Retail &amp; Fulfilment accounts for 30% of the portfolio and is focused on retail parks which are aligned to the growth of convenience, online and last mile fulfilment. We are complementing this with urban logistics primarily in London, focused on development-led opportunities.\n      </p>\n                <p>\n        Sustainability is embedded throughout our business. In 2020, we set out our sustainability strategy which focuses on two time-critical areas where British Land can create the most benefit: making our whole portfolio net zero carbon by 2030, and partnering to grow social value and wellbeing in the communities where we operate.\n      </p>\n                <p>\n        Further details can be found on the British Land website at <a href=\"http://www.britishland.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.britishland.com</a>.\n      </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.britishland.com/news-insights/press-releases/british-land-continues-leasing-momentum-new-amazon-fresh-store-its-regents-place-campus\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>British Land Company plc</strong> published this content on <strong>15 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>15 December 2021 07:01:21 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - British Land Company plc</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: British-Land-Company-plc</p></div>"}