{"date": "2021-11-04 16:00:00.329000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3384.0, "close": 3518.99}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwmarginl1{margin-left:30px;}</style><p class=\"bwalignc\">\n<b>New Enterprise-Grade WafCharm Release Eases Key Cybersecurity Burden Revealed by CSC 2021 Survey, Offers U.S.-based Customer Service</b>\n</p><p class=\"bwalignc\">\n<span>With 72% of developers overwhelmed by WAF rules, WafCharm SaaS uses AI to auto-optimize AWS WAF rule operations making WAF easy for improved web and API protection</span>\n</p><p>\nCyber Security Cloud, Inc. (CSC), the world’s leading innovator in cyber threat intelligence and AI-driven web security, today announced a major release of WafCharm, the SaaS that automates and optimizes AWS WAF rule operations to help address web-related cyber attacks against business and critical government infrastructure increasing worldwide. WafCharm eliminates frequent mistakes and eases the burden of complex WAF rule creation and modification shouldered by developers. The release is an enterprise-grade, production-ready, affordable SaaS now supported by U.S.-based customer service representatives.\n</p><p>\n<b>Survey Reveals Cloud and Web Developers “Overwhelmed” by Key Cybersecurity Burden</b>\n</p><p>\nA well managed WAF, or web application firewall, prevents web-based attacks at the application layer and protects against exploits directed at application programming interface (API) vulnerabilities. Software developers and security engineers can tune WAF rules to block malicious traffic from entering a site and can prevent data from being extracted as a result of an intrusion that finds a way through.\n</p><p>\nA recent 2021 CSC <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.wafcharm.com%2Fen%2Fnews%2Fwaf-in-the-cloud&amp;esheet=52521258&amp;newsitemid=20211104005290&amp;lan=en-US&amp;anchor=survey&amp;index=1&amp;md5=81fd682de88a9e03a422121d3c076490\" data-type=\"url\" class=\"tr-link\" translate=\"no\">survey</a> of developers found that almost three-quarters, 72%, at all WAF skill levels said they are overwhelmed with WAF rules and conditions—and a telling 71% of WAF experts said the same thing. A stunning 94% of developers are interested in automated managed rules for WAF operation, instead of managing the rules themselves.\n</p><p>\n“Effective WAF operation isn’t easy to figure out, even for cloud experts, but it’s critically necessary to protect applications and data,” said CSC CEO Toshihiro Koike. “Recently, WAF operation has become one of the most talked about topics in Japan. We’re confident that CSC’s U.S. customers will be extremely satisfied with WafCharm, which is used by the Chief Information Security Officer (CISO) of Japan, who rightfully demands consistent, high quality services.”\n</p><p>\nAmong the developers surveyed, 85% said that their own team or their boss was typically held responsible for successful cyber attacks. And the stress they experienced was real: Over a third reported developing unhealthy habits from the impact of managing cloud or web applications, including drinking more alcohol, oversleeping, fighting more with family or friends, grinding their teeth at night, or overeating and eating unhealthy foods.\n</p><p>\n“Using WafCharm can reduce the stress, frustration, and blame that teams experience in a very concrete way,” added Koike. “It solves a major, real-world pain point. Companies won’t have to designate a security engineer just for managing WAF operation. And we’ve never had a case where a customer canceled WafCharm due to dissatisfaction. With this major release, I am very much looking forward to U.S. customers using WafCharm and experiencing the superb quality of the product. WAF has become an indispensable part of cybersecurity strategy for businesses of every size and across every vertical, and optimizing its rules is essential to its successful use.”\n</p><p>\n<b>Enterprise-Grade Release Offers Ease of Use, U.S.-Based Reps and Affordable Pricing</b>\n</p><p>\nWhile CSC headquarters is located in Tokyo, with this release, the company is now offering U.S.-based customer service representatives. <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.wafcharm.com%2Fen%2F%23service_plans&amp;esheet=52521258&amp;newsitemid=20211104005290&amp;lan=en-US&amp;anchor=Affordable+pricing&amp;index=2&amp;md5=9e25ae4d09d1d8f61fcdf8c054f7bc6f\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Affordable pricing</a> is tiered for individuals, SMBs and enterprises, and easy payment options include credit card or invoice payment. Customers can sign up online with a 30-day free trial.\n</p><p>\nWafCharm only takes a few minutes to implement, then all AWS WAF operations are supported, including the handling of new vulnerabilities that surface around the world and may impact customer deployments anywhere. WafCharm is built for ease of use, offering:\n</p><p class=\"bwmarginl1\">\n● <b>Easy installation and operation — </b>It’s not necessary to install any special equipment or switch a DNS. WafCharm automatically selects the optimal rules/signatures*, but allows customers to fix those that they do not want changed automatically.\n</p><p class=\"bwmarginl1\">\n● <b>Optimal protection for everyone — </b>For any deployment leveraging AWS WAF, Wafcharm enables automated selection of optimal rules/signatures from detection status*.\n</p><p class=\"bwmarginl1\">\n● <b>Better security with hundreds of signatures — </b>Since there is a possibility of leakage with limited numbers of rules, WafCharm rematches access data with hundreds of rules/signatures; attack sources identified by rematching are blacklisted automatically.\n</p><p class=\"bwmarginl1\">\n● <b>Robust reporting and notifications —</b> Via AWS Kinesis Data Firehose, S3 and Lambda, WafCharm support can help customers generate reports from the WafCharm management screen.\n</p><p class=\"bwmarginl1\">\n*For AWS WAF Version 1 only\n</p><p>\nWafCharm is the only service on the market that automatically builds, tests and tunes AWS WAF rules, and continuously defends against zero-day threats—while leveraging one of the most sophisticated threat intelligence and research teams in the world. WafCharm cyber threat intelligence analytics employ extremely fast vulnerability response speeds.\n</p><p>\n<b>About Cyber Security Cloud Inc. (CSC)</b>\n</p><p>\nCyber Security Cloud’s mission is to create a secure cyberspace that people everywhere can use safely. In more than 70 countries, CSC provides web application security services that leverage the most effective cyber threat intelligence and AI-driven security technology available. As one of the very few Amazon Web Services (AWS) WAF Managed Rules Sellers in the world certified by AWS — the cloud giant that holds almost half of the global cloud market share — CSC uniquely optimizes and automates rules best suited to each customers’ AWS deployments as new cyber threats emerge. CSC also offers its powerful WAF solution for Microsoft Azure and other clouds. Leading cybersecurity improvements worldwide, CSC continues to develop and refine award-winning technologies and security solutions that contribute to the information revolution.\n</p><p>\nTo learn more, please visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.cscloud.co.jp%2Fen%2F&amp;esheet=52521258&amp;newsitemid=20211104005290&amp;lan=en-US&amp;anchor=https%3A%2F%2Fwww.cscloud.co.jp%2Fen%2F&amp;index=3&amp;md5=4d7e1a3edac31a6af2bedb3daeea7d25\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.cscloud.co.jp/en/</a>.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211104005290r1&amp;sid=ucdp4&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTA0MDA1MjkwcjEmc2lkPXVjZHA0JmRpc3Rybz1ueCZsYW5nPWVu&amp;key=1a9136ac8ae93d50a31258f75569544abec8000075ee263f0f94dab58a8ea4794ab186126dc09c5f113bd8771a70264a4c9f5c03668c6b7ea450037f997e0cad\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211104005290/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211104005290/en/</a></span></p><p>\nAnri Nakayama\n<br/><a href=\"mailto:anri.nakayama@cscloud.co.jp\" data-type=\"email\" translate=\"no\">anri.nakayama@cscloud.co.jp</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: CYBER-SECURITY-CLOUD</p></div>"}