{"date": "2022-01-25 14:41:19.980000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>FLYHT AEROSPACE SOLUTIONS LTD (\"FLY-V;FLYLF-0\")\n- Achieves Amazon Web Services Travel and Hospitality\n- Competency Status\n\n     FLYHT Aerospace Solutions Ltd. (the \"Company\" or \"FLYHT\") announced it\nhas achieved Amazon Web Services (AWS) Travel and Hospitality Competency\nstatus.\n\n     As an AWS Travel and Hospitality Competency Partner, FLYHT has\ndemonstrated customer success and technical proficiency in connecting their\ncustomers' aircraft, crews, and operations. FLYHT's product family enables\nairlines to provide exceptional customer service and achieve operational\nexcellence. THE AWS Travel and Hospitality Competency designation helps\ncustomers to identify and validate the most experienced AWS partners who\ncan help industry customers to succeed. These AWS Partners help customers\nby providing technology products and services to accelerate the industry's\nmodernization and innovation journey - from behind-the-scenes operational\nefficiencies to guest-facing customer experiences.\n\n     The FLYHT product family, including AFIRSTM, AFIRS Edge and other AWS\npowered applications in the Actionable Intelligence suite provide\nsignificant benefits to airline customers. FLYHT's unique on-wing inference\ntechnology keeps airlines connected to their aircraft by aggregating and\ndisseminating data in real-time via the Iridium satellite network, other\nsatellite feeds, 5G, Wi-Fi, and Bluetooth. Actionable Intelligence derived\nfrom this data delivers guidance to airlines' ground operations to reduce\nturn times, costs, fuel burn, and CO2 emissions. FLYHT's solutions bring\nIoT connectivity to aircraft. The product family will be further enhanced\nthrough the relationship with AWS and their Partner Network in IoT, machine\nlearning, and other advanced technologies.\n\n     Azur Air is one of FLYHT's customer airlines who benefits from FLYHT's\nsolutions. \"Utilizing FLYHT technology, Azur Air has complete visibility\nand situational awareness of its fleet in one user friendly interface\n(FLYHT's UpTime Cloud platform with FLYHT's Aircraft Situational Display).\"\nsays Ummehan Mert, Aircraft Systems Engineer for Azur Aviation. \"FLYHT was\nable to also summarize all the information in weekly automated flight\nsummary reports directly from the UpTime Cloud AWS platform. FLYHT is well\npositioned from a cost and innovation perspective, by using AWS services\nand support, to continue to outperform competitors and create end to-end\nsolutions for airlines.\" continues Ms. Mert.\n\n     Derek Taylor, VP Sales and Marketing stated, \"The team at FLYHT is\nvery excited to be leveraging AWS. The AWS Travel and Hospitality\nCompetency recognizes our unique value proposition, together with their\nextensive sales network, will ensure we reach more customers who are able\nto benefit from our solutions. We look forward to strengthening ties with\naviation leaders in 2022 as the recovery of our industry gets into full\nswing.\"\n\n     \"Many travel and hospitality companies are reinventing themselves on\nAWS. We are delighted to welcome FLYHT to the AWS Travel and Hospitality\nCompetency Program,\" said David Peller, Managing Director, Travel &amp;\nHospitality, Amazon Web Services. \"FLYHT's connectivity and operational\nefficiency solutions, powered by AWS, can help our customers transform\ntheir business by maintaining complete operational visibility to their\ncritical aviation assets and people.\"\n\n     About FLYHT Aerospace Solutions Ltd.\n\n     FLYHT provides airlines with Actionable Intelligence to transform\noperational insight into immediate, quantifiable action, delivering\nindustry leading solutions to improve aviation safety, efficiency, and\nprofitability. This unique capability is driven by FLYHT's patented\naircraft certified hardware products including AFIRS(TM), a satcom aircraft\ninterface device which enables real-time streaming of flight information,\ncockpit voice and black box data streaming, AFIRS Edge, a state-of-the-art\n5G WQAR and satellite data communications device, and TAMDAR(TM) and the\nFLYHT-WVSS-II(TM), which deliver airborne weather and humidity data in\nreal-time. FLYHT is headquartered in Calgary, Canada with an office in\nLittleton, Colorado, and is an AS9100 Quality registered company. For more\ninformation, view our presentation here, or visit www.flyht.com.\n\n     Cautionary Note Regarding Forward-Looking Statements\n\n     Except for statements of historical fact, this news release contains\ncertain \"forward-looking information\" within the meaning of applicable\nsecurities law. Forward-looking information is frequently characterized by\nwords such as \"plan\", \"expect\", \"project\", \"intend\", \"believe\",\n\"anticipate\", \"estimate\" and other similar words, or statements that\ncertain events or conditions \"may\" or \"will\" occur. Although we believe\nthat the expectations reflected in the forward-looking information are\nreasonable, there can be no assurance that such expectations will prove to\nbe correct. We cannot guarantee future results, performance, or\nachievements. Consequently, there is no representation that the actual\nresults achieved will be the same, in whole or in part, as those set out in\nthe forward-looking information.\n\n     Forward-looking information is based on the opinions and estimates of\nmanagement at the date the statements are made and are founded on the basis\nof expectations, assumptions and hypotheses made by the Company. Such\nforward-looking information is subject to a variety of risks and\nuncertainties and other factors that could cause actual events or results\nto differ materially from those anticipated in the forward-looking\ninformation. Some of the risks and other factors that could cause the\nresults to differ materially from those expressed in the forward-looking\ninformation include but are not limited to global economic and industry\nconditions. Readers are cautioned that this list of risk factors should not\nbe construed as exhaustive.\n\n     The forward-looking information contained in this news release is\nexpressly qualified by this cautionary statement. We undertake no duty to\nupdate any of the forward-looking information to conform such information\nto actual results or to changes in our expectations except as otherwise\nrequired by applicable securities legislation. Readers are cautioned not to\nplace undue reliance on forward-looking information.\n\n     Contact Information:\n\nFLYHT Aerospace Solutions Ltd.\nAlana Forbes\nChief Financial Officer\n403.291.7437\naforbes@flyht.com\ninvestors@flyht.com\n\nFNK IR LLC\nMatt Chesler, CFA\nInvestor Relations\n646.809.2183\nflyht@fnkir.com\n\nTel   : 403-250-9956    FLYHT AEROSPACE SOLUTIONS LTD\nFax   : 403-291-9717\nEmail : aforbes@flyht.com\nWWW   : <a href=\"http://www.flyht.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.flyht.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2202400100.MNPRE2202401126-05435520220125</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}