{"date": "2022-02-01 16:11:47.149000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ATERIAN INC (\"ATER-Q\")\n- Adds Two Industry Leaders To Its Board Of Directors\n\n     Aterian, Inc. (\"Aterian\" or the \"Company\") announced that effective\ntoday Susan Lattmann and Sarah Liebel have joined the Company's Board of\nDirectors (the \"Board\"). In addition, Greg Petersen plans to transition off\nthe Board effective April 1, 2022, following the end of the first quarter\nand the reporting of the Company's 10-K for the 2021 fiscal year.\n\n     Lattmann, who is an experienced executive and corporate board\ndirector, having spent more than 23 years at Bed Bath &amp; Beyond (Nasdaq:\nBBBY) in leadership roles, has joined the Compensation and Audit Committee\nand is expected to chair the Audit Committee following the departure of\nGreg Petersen. Liebel, who is a seasoned executive in the e-commerce\nindustry with significant experience in revenue generation, has joined the\nCompensation and Nominating and Corporate Governance Committee.\n     \"We are pleased to welcome Sue and Sarah as new independent directors\nto the Aterian board,\" said Yaniv Sarig, Aterian's Chief Executive Officer.\n\"They join Aterian at an important time as we continue pursuing our goal of\nbecoming a leading e-commerce platform. They bring incredibly valuable\nretail and e-commerce expertise to our board and further strengthen our\ncompany's leadership.\"\n\n     \"We are grateful for Sue's financial expertise and look forward to\ntransitioning her to Audit Committee Chair when Greg Petersen steps down,\"\nsaid Bill Kurtz, Aterian's Lead Independent Director. \"I would like to\nthank Greg for his contributions to the Company and our Board including his\nleadership of the Audit Committee.\"\n\n     \"I want to thank the other Board members and management for their\ncommitment to the Company,\" said Mr. Petersen. \"I wish them all the best in\nachieving their long term goals.\"\n\n     Lattmann currently serves on the boards of directors of Landsea Homes\nCorporation (Nasdaq: LSEA), a publicly traded residential homebuilder,\nFarmer Focus, a private organic chicken company and ArcTrust III, a private\ngrowth and income real estate investment trust. Lattmann also serves as\nChief Financial Officer for The Row, an international luxury apparel\nretailer. Previously, she worked for Bed Bath &amp; Beyond Inc. (Nasdaq: BBBY),\nwhere she held several roles including Chief Financial Officer and Chief\nAdministrative Officer. She began her professional career with Arthur\nAndersen LLP and is a certified public accountant.\n\n     Liebel currently serves as Chief Revenue Officer at 1stdibs.com\n(Nasdaq: DIBS), where she oversees the sales and operations teams at the\ncompany, including Customer Experience, Logistics, Business Operations,\nTrade &amp; Private Client sales. Before joining 1stdibs in 2015, Liebel was\nmost recently at Groupon. During her five year tenure there she held a\nnumber of leadership roles including running operations &amp; sales at ideeli,\na fashion flash sales e-commerce company, after it was acquired by Groupon\nas well as leading deals on the corporate development team.\n\n     About Aterian, Inc.\nAterian, Inc. (Nasdaq: ATER), is a leading technology-enabled consumer\nproducts platform that builds, acquires, and partners with best-in-class\ne-commerce brands by harnessing proprietary software and an agile supply\nchain to create top selling consumer products. The Company's cloud-based\nplatform, Artificial Intelligence Marketplace Ecommerce Engine (AIMEE(TM)),\nleverages machine learning, natural language processing and data analytics\nto streamline the management of products at scale across the world's\nlargest online marketplaces, including Amazon, Shopify and Walmart. Aterian\nhas thousands of SKUs across 14 owned and operated brands and sells\nproducts in multiple categories, including home and kitchen appliances,\nhealth and wellness, beauty and consumer electronics.\n\n     Forward Looking Statements\n\n     All statements other than statements of historical facts included in\nthis press release that address activities, events or developments that we\nexpect, believe or anticipate will or may occur in the future are\nforward-looking statements including, in particular, the statements\nregarding our becoming the leading e-commerce platform. These\nforward-looking statements are based on management's current expectations\nand beliefs and are subject to uncertainties and factors, all of which are\ndifficult to predict and many of which are beyond our control and could\ncause actual results to differ materially and adversely from those\ndescribed in the forward-looking statements. These risks include, but are\nnot limited to: those related to the global shipping disruptions, our\nability to continue as a going concern, our ability to meet financial\ncovenants with our lenders, our ability to create operating leverage and\nefficiency when integrating companies that we acquire, including through\nthe use of our team's expertise, the economies of scale of our supply chain\nand automation driven by our platform; those related to our ability to grow\ninternationally and through the launch of products under our brands and the\nacquisition of additional brands; those related to the impact of COVID-19,\nincluding its impact on consumer demand, our cash flows, financial\ncondition and revenue growth rate; our supply chain including sourcing,\nmanufacturing, warehousing and fulfillment; our ability to manage expenses,\nworking capital (including for PPE products) and capital expenditures\nefficiently; our business model and our technology platform; our ability to\ndisrupt the consumer products industry; our ability to grow market share in\nexisting and new product categories, including PPE; our ability to generate\nprofitability and stockholder value; international tariffs and trade\nmeasures; inventory management, product liability claims, recalls or other\nsafety and regulatory concerns; reliance on third party online\nmarketplaces; seasonal and quarterly variations in our revenue;\nacquisitions of other companies and technologies, our ability to continue\nto access debt and equity capital (including on terms advantageous to the\nCompany) and the extent of our leverage and other factors discussed in the\n\"Risk Factors\" section of our most recent periodic reports filed with the\nSecurities and Exchange Commission (\"SEC\"), all of which you may obtain for\nfree on the SEC's website at www.sec.gov.\n\n\nContact:\n\nIlya Grozovsky\nDirector of Investor Relations &amp; Corp. Development\nAterian, Inc.\nilya@aterian.io\n917-905-1699\n\nTel   : 347-676-1681    ATERIAN INC\nWWW   : <a href=\"https://www.aterian.io\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.aterian.io</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203100376.MNPRE2203102309-07433920220201</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}