{"date": "2022-02-07 16:37:14+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Updates shares, adds milestone, short interest, analyst quote</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Feb 7 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Shares of Peloton Interactive Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=PTON.O\" data-type=\"ric\" data-ric=\"PTON.O\" translate=\"no\" dir=\"ltr\">PTON.O</a> rose 22% on Monday after reports of takeover interest from Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and Nike Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=NKE.N\" data-type=\"ric\" data-ric=\"NKE.N\" translate=\"no\" dir=\"ltr\">NKE.N</a> in the exercise bike maker that recently lost a majority of the share gains it made during the pandemic.</p><p>Peloton's shares were set for their best day since their debut in Sept. 2019. They earlier rose as much as 31% in the session.</p><p>Amazon is exploring an offer for Peloton, a source told Reuters on Friday, while Nike too, reportedly, is weighing a bid for Peloton, which touched new records last year as its bikes sold like hot cakes during the pandemic when people were stuck at home. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2UF2UY\" data-type=\"storyId\" data-story-id=\"nL4N2UF2UY\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Amazon.com, Nike and Peloton did not immediately respond to a request for comment.</p><p>Bearish bets on Peloton's shares have increased recently with estimated short interest as a percentage of free float nearly doubling over the past two months to 14.1%, according to data from analytics firm Ortex.</p><p>\"Even though short sellers in PTON have losses of about $250 million since Friday's close, they are still in significant profit,\" said Ortex's co-founder, Peter Hillerberg. Peloton's shares were down over 84% in the past year. </p><p>Last month, activist investor Blackwells Capital urged Peloton to fire its chief executive officer and put the company up for sale. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2U42OW\" data-type=\"storyId\" data-story-id=\"nL4N2U42OW\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>\"Peloton's founder John Foley, who has attracted the ire of activist investors on governance grounds, might be an obstacle to any deal given the veto power he enjoys under the firm's dual share class structure,\" said Russ Mould, investment director at UK-based investment platform AJ Bell.</p><p>Meanwhile, Cowen and Co analyst John Blackledge believes Peloton would not be an ideal fit for Amazon as the e-commerce giant typically sells mass market products and services, whereas Peloton's products are positioned as premium.</p><p>Peloton is slated to report second quarter results Tuesday after market close.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Medha Singh in Bengaluru; Editing by Shinjini Ganguli)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Medha.Singh@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Medha.Singh@thomsonreuters.com</a> ; within U.S. +1646 223 8780, outside U.S. +91 80 6182 2802; Twitter: <a href=\"https://twitter.com/medhasinghs;\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/medhasinghs;</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: PELOTON-STOCK/TAKEOVER (UPDATE 1, PIX)</p></div>"}