{"date": "2022-02-16 14:00:02.312000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Mindy Kaling, Amazon Publishing, and Amazon Studios Announce Mindy’s Book Studio and First-Look Deal, a New Home for Dynamic Storytelling</b>\n</p><p class=\"bwalignc\">\n<span>Best-selling author, actor, screenwriter, and producer Mindy Kaling teams up with Amazon Publishing and Amazon Studios to launch a book studio that centers on diverse voices and imagines stories from page-to-screen</span>\n</p><p>\n(NASDAQ:AMZN)—Mindy Kaling, Amazon Publishing, and Amazon Studios announced today the launch of Mindy’s Book Studio, a boutique story studio that will publish books selected by Kaling from emerging and established diverse voices. Starting in late 2022, Mindy’s Book Studio will publish books across genres, from fresh romantic comedies and poignant coming-of-age stories to make readers laugh—and cringe—to suspenseful dramas with unforgettable female protagonists. Amazon Studios and Kaling will team to adapt material published under Mindy’s Book Studio as feature motion pictures which will exclusively stream on Prime Video in more than 240 countries and territories worldwide; Kaling holds first-producer option on adaptations. Kaling has also signed her debut novel and new essay collection for publication with Amazon Publishing.\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: <a href=\"https://www.businesswire.com/news/home/20220216005482/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220216005482/en/</a></p><p>\n\"I had the best time working on <span>Nothing Like I Imagined</span>, and I am so excited to continue my relationship with Amazon,” said Kaling. “I’m passionate about bringing unique stories to readers and viewers, and I can’t wait to help discover and support talented new voices through Mindy’s Book Studio.”\n</p><p>\nFrom best-selling memoirs to some of television’s most beloved shows and characters, Kaling has entertained readers, viewers, and listeners alike for nearly two decades. Building on her relatable and hilarious take on love and relationships—as seen in her Amazon Charts best-selling essay collection <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazon.com%2FNothing-Like-Imagined-Book%2Fdp%2FB08GL1BXPR&amp;esheet=52580344&amp;newsitemid=20220216005482&amp;lan=en-US&amp;anchor=Nothing+Like+I+Imagined+%28Except+for+Sometimes%29&amp;index=1&amp;md5=2bb44b1beba452a58d1e23d017b84f51\"><span>Nothing Like I Imagined (Except for Sometimes)</span></a> and Amazon Studios’ hit film <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazon.com%2FLate-Night-Emma-Thompson%2Fdp%2FB08K2Y8Z8T%2Fref%3Dsr_1_1%3Fkeywords%3Dlate%2Bnight%26qid%3D1639111149%26sr%3D8-1&amp;esheet=52580344&amp;newsitemid=20220216005482&amp;lan=en-US&amp;anchor=Late+Night&amp;index=2&amp;md5=e565b948ab746eafe9df10455d3e40e7\"><span>Late Night</span></a> (which she co-wrote, produced, and starred in)—Mindy’s Book Studio will expand Kaling’s beloved storytelling sensibilities to a new slate of juicy, unforgettable books that readers can access through subscription programs such as <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.amazon.com%2Fkindle-dbs%2Fhz%2Fsubscribe%2Fku%3Fref%3Dks_us_g_gr_kwd-304580754138_an%26_encoding%3DUTF8%26shoppingPortalEnabled%3Dtrue&amp;esheet=52580344&amp;newsitemid=20220216005482&amp;lan=en-US&amp;anchor=Kindle+Unlimited&amp;index=3&amp;md5=874a1ef14b321812527f17c22c7610c5\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Kindle Unlimited</a>, and in print and audio.\n</p><p>\n“We are delighted to work with Mindy and Amazon Studios on Amazon’s first-ever book studio,” said Julia Sommerfeld, publisher of Amazon Publishing. “Mindy is brilliant at bringing to life highly entertaining, funny, sharp, and bingeable stories, and we can’t wait to collaborate with her on discovering and championing must-read stories from new and diverse voices.”\n</p><p>\n“With her visionary voice, trademark wit, and tremendous artistic acumen, Mindy Kaling remains a relentless innovator in the creative community,” said Jennifer Salke, head of Amazon Studios. “She is a pioneering artist, remarkable role model, and philanthropist who continues to tap into global and cultural zeitgeists as a source for her refreshingly authentic storytelling. We could not be more thrilled to expand our collaboration with her across Amazon to not only showcase her incredible talents but also introduce new, dynamic storytellers to our global customers.”\n</p><p>\nKaling is represented by 3 Arts Entertainment, CAA, The Lede Company, and PJ Shapiro. Sommerfeld, Lauren O’Connor, head of IP &amp; literary acquisitions at Amazon Studios, and Carmen Johnson, editorial director of Mindy’s Book Studio, will work with Kaling to find unputdownable stories with the potential to come to life on the screen.\n</p><p>\nIn 2023, Amazon Publishing will also publish Kaling’s debut novel, a comedic and twisty page-turner under Mindy’s Book Studio. In 2024, Amazon Publishing will publish a new collection of personal essays in print, digital, and audio, offering Kaling’s latest reflections on life, motherhood, friendship, and being a boss. Amazon Studios has acquired first-look rights for Kaling’s forthcoming novel and essay collection.\n</p><p>\n<b>About Amazon Publishing</b>\n</p><p>\nAmazon Publishing is a leading trade publisher of fiction, nonfiction, and children’s books with a mission to empower outstanding storytellers and connect them with readers worldwide. We publish emerging, best-selling and critically acclaimed authors in digital, print, and audio formats.\n</p><p>\n<b>About Amazon Studios</b>\n</p><p>\nAmazon Studios is the home for talent, creating and producing Original films and television series for a global audience. Original series premiere exclusively on Prime Video, which is available in more than 240 countries and territories worldwide. Amazon Studios also produces and acquires Original movies for theatrical release and exclusively for Prime Video, in addition to producing Original content for IMDb TV, Amazon’s premium free streaming service.\n</p><p>\n<b>About Amazon</b>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fabout&amp;esheet=52580344&amp;newsitemid=20220216005482&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=4&amp;md5=84cbc02c1a6309d3211ac1c6ac541c71\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Ftwitter.com%2FAmazonNews&amp;esheet=52580344&amp;newsitemid=20220216005482&amp;lan=en-US&amp;anchor=%40AmazonNews&amp;index=5&amp;md5=6022f32ec53b19dc63ddc4549c681d32\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@AmazonNews</a>.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20220216005482r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjIwMjE2MDA1NDgycjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=237009e920415a8707503542d028437309b3da36d42dbba0f63ff118fe86b3db06e6bee7c95a34048627f9add6b031edb591d8cd3c47ceba2372983d213e155d\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20220216005482/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220216005482/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52580344&amp;newsitemid=20220216005482&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=6&amp;md5=7d9b93e7e00eb2089f36176feb44c080\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2022</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON.COM,-INC.</p></div>"}