{"date": "2021-11-07 16:53:10.819000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The independent directors of Future Retail Ltd have complained to the Competition Commission of India (CCI) saying that the American retail giant, Amazon has violated the foreign direct investment (FDI) norms when it picked up 49 per cent stake in the company's promoter entity, Future Coupons Pvt Ltd and applied for CCI's approval by concealing facts.</p><p>Asking the CCI to revoke the approval granted to Amazon to buy stake in Future Coupons, the independent directors said the CCI should act to stop Amazon from perpetuating \"its evil non-desirable designs\" against the Indian company.</p></div><div class=\"tr-npp-body\"><p>Future Coupons Ltd owns 9.9 per cent stake in Future Retail Ltd and Amazon had picked up stake in FCL in September 2019 just before the FRL\u0092s sales started falling and the company started defaulting to its vendors. Later, the Corona pandemic made things worse for the entire group. After the Future group sold its businesses to Reliance Retail, Amazon moved the Singapore International Arbitration Centre asking the court to stop the transaction based on its non-compete and right of first refusal (ROFR) agreements with the Future group promoters.</p><p>In a statement to the stock exchanges, the independent directors of FRL said the Board of FRL consisting of majority of independent directors were not aware that strategic rights over FRL were being acquired by Amazon. The FCPL shareholding agreement (SHA) between the promoters and the board has not approved the FCPL SHA. Further, the FRL SHA has not been incorporated in the articles of association of FRL, the directors said.</p><p>In its letter today, the directors said Amazon has not disclosed its strategic interest over FRL to the Commission only to prevent the CCI from referring the transaction to other Governmental agencies in which case, the other Government agencies would have responded that the transaction is illegal and hence Amazon could not have proceeded with the transaction.</p><p>The directors said Amazon has concealed facts, made misrepresentations and false representations to the CCI. \u0093Amazon sought and obtained the approval of the Commission on the basis that it was investing in the business of FCPL and not on the basis that it was acquiring strategic, material and special rights over FRL in preference to all the shareholders of FRL, which it has claimed with success in the arbitral tribunal now,\u0094 the directors said,</p><p>\"'It is clear that the transaction approved by the CCI (that is a simple investment by Amazon in FCPL, with only investment protection rights) is not the one which is now claimed by Amazon. The transaction as per Amazon is investment in FCPL for the only purpose of getting strategic, special and material rights over FRL enabling Amazon to prevent the independent directors from discharging their fiduciary duties. Certainly, the Commission has not granted its approval to this transaction. The approval given by the Commission does not hold good due to the concealment and misrepresentation and false representations made by Amazon, it said.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}