{"date": "2021-11-26 16:04:53.336000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3504.56, "close": 3507.07}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-abstract\"><p>E-commerce giant Amazon has written to the independent directors of Future Retail (FRL), including Gagan Singh, Ravindra Dhariwal and Jacob Mathew, and its audit committee, providing data and alleging that there have been significant financial irregularities to the prejudice of public shareholders, banks, creditors, and third-party suppliers. Amazon has said this warrants a thorough and independent examination of all relevant facts and related-party transactions, including of past financial years, by an independent agency.</p></div><div class=\"tr-npp-lead\"><p>Separately, Amazon has written to Securities and Exchange Board of India Chairman Ajay Tyagi, seeking the withdrawal of the regulator\u0092s conditional approval granted to FRL related to the merger deal with Reliance. The letter has also been sent to top officials of the stock exchanges.</p><p>Amazon\u0092s letter to the FRL independent directors, dated November 24, which Business Standard has accessed, states: \u0093Given the nature of disclosure and findings, a careful and detailed examination must be made by statutory authorities/regulators/enforcement agencies also to enquire and investigate into the financial statements, and records, including related-party transactions and discussions in board, and audit committee</p></div><div class=\"tr-npp-body\"><p>meetings, in the interest of public shareholders, banks, creditors, and third party suppliers.\u0094</p><p>\u0093The allegations contained in Amazon\u0092s letter are being made as part of a legal dispute that is being dealt with by the Supreme Court, high court and other regulatory forums.\u0094</p><p>The spokesperson said the Board of FRL had formed a crisis management committee to deal with the situation arising out of Covid lockdowns, nationwide store closures, and the sale of pledged shares impacting all aspects of the company\u0092s functioning. \u0093It was the committee\u0092s job to raise questions with the management. Various questions were raised by the committee from time to time and these were clarified through detailed explanations by management with supporting documents and presentations to their satisfaction, as well as through special audits, wherever required.\u0094</p><p>The spokesperson said all related-party transactions and records of fund utilisation were on record and part of the public disclosures made by the company as part of standard governance practices. \u0093There is nothing new that is being brought to the notice, except for false speculations being created out of selective excerpts from these documents,\u0094 said the spokesperson. \u0093One should understand the motivation behind these allegations and the timing of the same, rather than rely on these baseless and malicious allegations.\u0094</p><p>A query sent to Amazon remained unanswered till the time of going to press.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}