{"date": "2021-12-30 15:30:02.334000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3413.22, "close": 3372.89}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">Jair Lynch has invested over $900 million into affordable housing efforts since 2019</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">WASHINGTON, Dec. 30, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">WASHINGTON</span>, <span class=\"xn-chron\">Dec. 30, 2021</span> /PRNewswire/ -- Jair Lynch Real Estate Partners (\"<span class=\"xn-person\">Jair Lynch</span>\"), a leading owner and developer of mixed-use properties and attainable housing in the DC metro area, today announced the acquisition of Barcroft Apartments, the 1,334-unit, garden style apartment complex located along Columbia Pike in <span class=\"xn-location\">Arlington, VA</span>. <span class=\"xn-person\">Jair Lynch</span> purchased the 60-acre site, including two commercial parcels with 34,000 square feet of retail from the DeLashmutt family who built the complex in 1939 and have owned it since. <span class=\"xn-person\">Jair Lynch</span> purchased the naturally occurring affordable housing complex, also known as market-rate affordable housing, as part of its broader initiative to preserve and/or increase affordable and workforce housing throughout the Mid-Atlantic region.</p>\n<p>With the addition of this acquisition, <span class=\"xn-person\">Jair Lynch</span> has now invested over <span class=\"xn-money\">$900 million</span> in its attainable housing initiative that was launched in 2019. The strategic initiative is aimed at increasing and/or preserving affordable and workforce housing throughout the Mid-Atlantic region for working families and individuals earning between 30% - 120% of the area median income (AMI).</p>\n<p>This investment was supported by the Amazon Housing Equity Fund, a more than <span class=\"xn-money\">$2 billion</span> commitment to create and preserve affordable housing in Amazon's hometown communities, and <span class=\"xn-location\">Arlington County</span> who have collectively committed to providing <span class=\"xn-money\">$310 million</span> in immediately available acquisitions financing to create a public-private partnership for a reimagined Barcroft neighborhood. This new partnership will help <span class=\"xn-person\">Jair Lynch</span> ensure that 1,334 units will remain affordable with rents up to 60% Area Median Income (AMI) for 99 years.</p>\n<p> \"I had the privilege of touring Columbia Pike eleven years ago. Back then, it was clear Columbia Pike held a bright future, but to unlock it, we needed to invest properties of size and scale in order to accelerate the transformation of the corridor. When the opportunity to purchase Barcroft Apartments arose, we knew we had to act,\" said <span class=\"xn-person\">Jair K. Lynch</span>, President &amp; CEO of Jair Lynch Real Estate Partners. \"With our acquisition of Barcroft Apartments, our full talents as an organization will be on display - A commitment to preserving affordable housing as well as building for the future with mixed-use placemaking along the corridor.  We are thankful for our great partnership with Amazon and <span class=\"xn-location\">Arlington County</span>, one which will ensure housing stability for the existing residents long term.\"</p>\n<p>On <span class=\"xn-chron\">Tuesday, December 14</span><sup>th</sup>, the <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3400704-1&amp;h=1065311611&amp;u=https%3A%2F%2Fwww.arlingtonva.us%2FAbout-Arlington%2FNews%2FArticles%2F2021%2FCounty-Amazon-Partner-to-Preserve-1300-Affordable-Homes-in-Arlington&amp;a=Arlington+County+Board+committed+to+a+loan+of+%24150+million\"><span class=\"xn-location\">Arlington County</span> Board committed to a loan of <span class=\"xn-money\">$150 million</span></a> in support of <span class=\"xn-person\">Jair Lynch's</span>  acquisition of the property. In addition, <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3400704-1&amp;h=1756174640&amp;u=https%3A%2F%2Fwww.aboutamazon.com%2Fnews%2Fcommunity%2Famazon-commits-160-million-to-preserve-housing-affordability-in-arlington-virginia&amp;a=Amazon+committed+%24160+million+in+a+low-rate+loan+from+the+Amazon+Housing+Equity+Fund\">Amazon committed <span class=\"xn-money\">$160 million</span> in a low-rate loan from the Amazon Housing Equity Fund</a> to support the preservation of the neighborhood's long-standing affordability. The County's and Amazon's funding will also support <span class=\"xn-person\">Jair Lynch</span> in addressing immediate repairs, adding amenities, making property upgrades, and taking steps to improve the residents' overall living environment.</p>\n<p>\"The Amazon Housing Equity Fund was conceived to preserve the affordability of homes for our neighbors in our hometown communities. We are humbled to join our partners and reassure the families of Barcroft that their homes will remain affordable for generations to come,\" said <span class=\"xn-person\">Catherine Buell</span>, director of the Amazon Housing Equity Fund. \"Partnerships like this one with <span class=\"xn-location\">Arlington County</span> and Jair Lynch Real Estate Partners are how we build better and more inclusive communities for people to live, work, and thrive.\"</p>\n<p>\"My colleagues and I thank, and congratulate, all those who have made possible the sale of this property to a buyer committed to preserving affordable housing,\" stated County Board Chair <span class=\"xn-person\">Matt de Ferranti</span>. \"We are one step closer to ensuring stable, safe and affordable housing for the current residents, and are pleased to collaborate with our partners on a vision for Barcroft that puts residents at the center.\"</p>\n<p>A new property management company, Gates Hudson, will begin its transition onto the property in the coming days. <span class=\"xn-person\">Jair Lynch</span> selected Gates Hudson to manage Barcroft Apartments due to their depth of experience in managing properties across <span class=\"xn-location\">Arlington County</span> and the Mid-Atlantic region.</p>\n<p>\"Gates Hudson has a proven track record of managing quality affordable properties across <span class=\"xn-location\">Arlington County</span> and brings to the table a wealth of experience in providing robust resident service programs,\" said <span class=\"xn-person\">Anthony Startt</span>, Director of Investments for Jair Lynch Real Estate Partners. \"Their social impact programs aim to improve the living situations of all families in their communities regardless of income level, and their ample support staff are ready and eager to provide the high level of support these valued residents need and deserve.\"   </p>\n<p>In addition to a new property management company, <span class=\"xn-person\">Jair Lynch</span> intends to conduct a full master planning process which will begin in the new year with a thorough assessment of the site and current resident living situations. The goal of this initial assessment will be to identify immediate needs for both the physical site and its current residents to ensure the most pressing needs are addressed first. A robust resident engagement plan will be established to ensure Barcroft residents' voices are heard throughout the longer-term master planning process. Additionally, <span class=\"xn-person\">Jair Lynch</span> and <span class=\"xn-location\">Arlington County</span> will work hand-in-hand to ensure that any current residents who need additional rent support are connected with community organizations for assistance.  </p>\n<p>Noted during the County Recessed Board Hearing on <span class=\"xn-chron\">December 14, 2020</span>, regardless of income, current residents will not be displaced. Rents will also remain stagnant for 2022, after which, rents for current residents will increase by no more than 3% per year up to a cap of 60% AMI rent levels. <span class=\"xn-person\">Jair Lynch's</span> revitalization plan for the property will include renovation of the majority of units while a selection of vacant units will be demolished and reconstructed. There will be no reduction in the number of affordable units at Barcroft. <span class=\"xn-person\">Jair Lynch</span> also intends to utilize vacant units on site for any temporary relocations that may be needed during the long-term phasing of the master plan.</p>\n<p>Hogan Lovells represented Jair Lynch Real Estate Partners in this transaction.</p>\n<p><b>About Jair Lynch Real Estate Partners  <br/></b>Jair Lynch Real Estate Partners is a leading real estate investment and development firm in the Mid-Atlantic market that specializes in the thoughtful transformation of walkable urban places. Founded in 1998, <span class=\"xn-person\">Jair Lynch</span> has acquired, developed, and operated a portfolio of residential, commercial, and neighborhood assets that contribute to the company's mission of creating extraordinary places. The firm has developed over 5.6 million square feet of real estate projects, currently has <span class=\"xn-money\">$2.8 billion</span> of assets under management, and has a controlled pipeline of 4.6 million square feet valued at more than <span class=\"xn-money\">$1.7 billion</span>. Visit <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3400704-1&amp;h=702235506&amp;u=http%3A%2F%2Fwww.jairlynch.com%2F&amp;a=www.jairlynch.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.jairlynch.com</a> to learn more.</p>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=PH18574&amp;sd=2021-12-30\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1QSDE4NTc0JnNkPTIwMjEtMTItMzA=&amp;key=0256cd85b504215e1ccf33c0c70d3115f1e2815fef5b3c82d882bf3baac7d9fe86dce2204dfb863d4385e1e92a517ad247b2adfca6730abd8ea3a511785a3920\"/></div></div> View original content:<a href=\"https://www.prnewswire.com/news-releases/jair-lynch-real-estate-partners-completes-acquisition-of-barcroft-apartments-with-backing-by-amazon--arlington-county-301451909.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/jair-lynch-real-estate-partners-completes-acquisition-of-barcroft-apartments-with-backing-by-amazon--arlington-county-301451909.html</a><p></p>\n<p>SOURCE  Jair Lynch Real Estate Partners</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: JAIR-LYNCH-REALESTATE</p></div>"}