{"date": "2021-11-18 08:03:36.205000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_8xtbnrml&amp;referenceId=tag:reuters.com,2021:newsml_OVF3ZS6TN_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_8xtbnrml&amp;referenceId=tag:reuters.com,2021:newsml_OVF3ZS6TN_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: Stocks on Wall Street closed down on Wednesday on inflation fears and supply chain concerns, with investors betting the Federal Reserve will raise interest rates sooner than expected to tame rising prices. Fred Katayama reports.<br/>Short Link: <a href=\"https://refini.tv/3CtnRya\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3CtnRya</a><br/><br/>Video Transcript:<br/><br/>Wall Street got another batch of strong earnings from big retailers Wednesday, but unlike Tuesday, the markets went south on inflation fears and supply chain concerns. Investors worried that further increases in prices could hurt economic growth and push the Federal Reserve to raise interest rates sooner than expected. The Dow retreated more than 200 points. The S&amp;P 500 fell a quarter percent, and the Nasdaq lost a third of a percent. Dragging on the Dow, Visa, Amazon said it would stop accepting Visa credit cards that are issued in the UK, citing high transactions fees. Early holiday shopping by Americans significantly boosted quarterly sales at Target, pushing the retailer to raise its annual forecasts. But shares fell because the supply chain issues that dogged rival Walmart also hurt Target and dented its margins. Loweâ\u0080\u0099s shares went the other way. Higher demand from builders and contractors led the home improvement chain to hike its full-year outlook for sales.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}