{"date": "2022-01-20 08:01:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Jeffrey Dastin</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Jan 20 (Reuters)</span><span class=\"tr-dl-sep\"> - </span><span class=\"tr-strong\">Amazon.com Inc's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> recipe for the department store of the future includes algorithmic recommendations and what one corporate director called \"a magic closet\" in the fitting room.</span></p><p>The online retailer is making another push to grow its fashion business, announcing on Thursday it will open its first-ever apparel store this year, with a tech twist. \"We wouldn't do anything in physical retail unless we felt we could significantly improve the customer experience,\" said Simoina Vasen, a managing director.</p><p>At 30,000 square feet (<span class=\"tr-strong\">2,787 </span>sq meters), the planned \"Amazon Style\" shop near Los Angeles is smaller than the typical department store. Model items are on the racks, and customers scan a code using Amazon's mobile app to select the color and size they would like. To try on the clothes, which are stored in the back, shoppers enter a virtual queue for a fitting room that they unlock with their smartphone when it is ready.</p><p>Inside, the dressing room is \"a personal space for you to continue shopping without ever having to leave,\" Vasen said. Each has a touchscreen letting shoppers request more items that staff deliver to a secure, two-sided closet \"within minutes,\" she said.</p><p>\"It's like a magic closet with seemingly endless selection,\" Vasen said.</p><p>The touchscreens suggest items to shoppers too. Amazon keeps a record of every good a customer scans so its algorithms personalize clothing recommendations. Shoppers can fill out a style survey as well. By the time they arrive in a fitting room, employees have already deposited customers' requested items and others that Amazon has picked.</p><p><span class=\"tr-strong\">Shoppers can </span>opt out with a concierge's <span class=\"tr-strong\">help</span>, Amazon said.</p><p>Amazon has unveiled tech to help customers choose outfits <a href=\"https://www.reuters.com/article/us-amazon-com-echolook-idUSKBN17S29V\" data-type=\"url\" class=\"tr-link\" translate=\"no\">before</a>. The company has surpassed Walmart Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=WMT.N\" data-type=\"ric\" data-ric=\"WMT.N\" translate=\"no\" dir=\"ltr\">WMT.N</a> as the most-shopped clothing retailer in the United States, <a href=\"https://www.reuters.com/article/us-amazon-com-brands-apparel/selling-with-the-enemy-why-rival-retailers-embrace-amazon-com-idUSKCN1RL0E7\" data-type=\"url\" class=\"tr-link\" translate=\"no\">according to analyst research</a>. </p><p>But it still has room to expand and compete with the likes of Macy's Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=M.N\" data-type=\"ric\" data-ric=\"M.N\" translate=\"no\" dir=\"ltr\">M.N</a> and Nordstrom Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=JWN.N\" data-type=\"ric\" data-ric=\"JWN.N\" translate=\"no\" dir=\"ltr\">JWN.N</a>, which have opened smaller-format stores. Amazon's lineup of physical grocery and convenience shops have yet to upend brick-and-mortar retail. </p><p>The company's new store aims to attract a broad range of shoppers with hundreds of brands, Vasen said, declining to name examples.</p><p>It has hundreds of associates, and no cashier-less checkout like some Amazon stores, Vasen said. Still, using a biometric system known as Amazon One, customers can pay with a swipe of their palm.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting By Jeffrey Dastin in Palo Alto, California; Editing by Christian Schmollinger)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Jeffrey.Dastin@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Jeffrey.Dastin@thomsonreuters.com</a> ; +1 424 434 7548; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-FASHION/ (PIX)</p></div>"}