{"date": "2021-12-21 19:28:00.203000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3341.58, "close": 3420.74}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwmarginl1{margin-left:30px;}</style><p class=\"bwalignc\">\n<b><span>Mawari Uses AWS Wavelength to Build 3DXR Content Streaming Platform</span></b>\n</p><p class=\"bwalignc\">\n<b><span>Digital Human as a Service (DHaaS) is Born</span></b>\n</p><p>\nMawari, a leading XR streaming solution provider, today announced that its 3DXR Content Streaming Platform for the Metaverse will debut on the AWS Marketplace next month, a managed and curated software catalogue from Amazon Web Services that allows customers to find, buy and immediately deploy third party software.<sup>1</sup> The Platform leverages the ultra-low latencies enabled by AWS Wavelength<sup>2</sup>. AWS Wavelength: AWS Wavelength embeds AWS compute and storage services at the edge of 5G networks and enables developers to build applications and services that require increased speeds, massive bandwidth, and ultra-low latency.\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: <a href=\"https://www.businesswire.com/news/home/20211221005654/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211221005654/en/</a></p><div id=\"bwbodyimg\" style=\"width:480px;float:left;padding-left:0px;padding-right:20px;padding-top:0px;padding-bottom:0px\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Mawari XR Streaming Demo (Photo: Business Wire)\" src=\"https://mms.businesswire.com/media/20211221005654/en/1313022/4/01-Mawari-mainvisual.jpg\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbXMuYnVzaW5lc3N3aXJlLmNvbS9tZWRpYS8yMDIxMTIyMTAwNTY1NC9lbi8xMzEzMDIyLzQvMDEtTWF3YXJpLW1haW52aXN1YWwuanBn&amp;key=642251452c34379356cc556eee2d01e04ae482f6d55c91b2f614e3f7288b9d86d646b6c6aff34452143870716671daff6ec224c0c15e35f866ac761f201501bc\"/></div></div><p style=\"font-size:85%\">Mawari XR Streaming Demo (Photo: Business Wire)</p></div><p>\nMawari’s 3DXR Content Streaming Platform will feature Mawari’s <span>Digital Human as a Service</span> (DHaaS) as the first demonstration of this platform’s capabilities, featuring 3D streamed multilingual human avatars and interactive 3D content in combination with seamless indoor and outdoor spatial mapping that, together, provide for accurate delivery of interactive, personalized, geo-local 3DXR experiences on smartphones and XR glasses. A video demonstrating the platform capabilities is available at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fyoutu.be%2F91pa3JK1DSs&amp;esheet=52554542&amp;newsitemid=20211221005654&amp;lan=en-US&amp;anchor=https%3A%2F%2Fyoutu.be%2F91pa3JK1DSs&amp;index=1&amp;md5=be11c28a11ebbfd7bc7792716d133442\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://youtu.be/91pa3JK1DSs</a>\n</p><p>\nLuis Oscar Ramirez Solorzano, Mawari CEO states:\n</p><p class=\"bwmarginl1\">\n<span>“We are proud of this momentous introduction of our interactive 3DXR Content Streaming Platform powered by AWS. Our unique approach delivers rich, high-quality, interactive content to mobile XR devices while overcoming the otherwise intractable limitations of end-user devices. Simply put, we move the power and rendering burdens upstream to the cloud, then stream that content in real time to devices in a novel way that preserves the content’s richness.”</span>\n</p><p>\nUniquely, Mawari’s patent-pending 3D streaming CODEC enables the highest visual quality to be streamed to mobile XR Devices by substantially lowering the heavy processing requirements of rich interactive and ultra-realistic 3D content like real-time digital humans, reducing cost, data size and battery consumption while unlocking scalability.\n</p><p>\nMawari’s platform is compatible with modern web browsers or applications built with Unreal Engine and Unity, most importantly it is cross-platform and cross-engine by design. The platform’s split rendering capability allows developers to decide what content should be rendered in the cloud versus on the end-user device where, for example, UI or lightweight content might ideally be rendered.\n</p><p>\nCEO Luis Oscar Ramirez Solorzano concludes:\n</p><p class=\"bwmarginl1\">\n<span>“While others talk about the metaverse future, we are making it happen today. Our technological innovation is purpose-driven - our mission is to provide creative companies and developers around the world with the right tools and infrastructure, empowering them to bring the physical-world metaverse to life on as wide a range of mobile XR devices as possible… as soon as possible. Digital Human as a Service is just the beginning.”</span>\n</p><p>\n1: AWS Marketplace: A managed and curated software catalogue that allows customers to find, buy and immediately deploy third party software\n</p><p>\n2: AWS Wavelength: AWS Wavelength embeds AWS compute and storage services at the edge of 5G networks and enables developers to build applications and services that require increased speeds, massive bandwidth, and ultra-low latency, such as machine learning inference, Internet of Things (IoT), and video and game streaming.\n</p><p>\n<b>About Mawari Inc.</b>\n</p><p>\nMawari, Inc. has been pioneering the creation of cloud rendering and streaming technology for interactive XR experiences since 2018. Since then, Mawari’s client list is a who’s-who of visionary innovators in telecom and entertainment including KDDI Corporation, Sapporo Breweries Ltd., Adways Co., Ltd, and AFK Australia. As part of its larger technology stack, Mawari has developed a proprietary, XR-focused 3D Content Streaming Platform that renders 3D content in the cloud and delivers it efficiently to devices. Core to this is Mawari’s unique, patent-pending 3D Streaming CODEC / compression technology that minimizes the weight of 3D content and enables real-time rendering and streaming to smartphones and XR glasses. Mawari’s mission is to accelerate the arrival and widespread adoption of synthetic reality experiences to meet the demands of its visionary clients and has been working relentlessly to solve real-world challenges to meet the demands of visionary XR partners.\n</p><p>\nFor more information, please visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fmawari.co.jp&amp;esheet=52554542&amp;newsitemid=20211221005654&amp;lan=en-US&amp;anchor=https%3A%2F%2Fmawari.co.jp&amp;index=2&amp;md5=39b4a7a41f521c89751b7ab0a8789ae5\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://mawari.co.jp</a> or contact <a href=\"mailto:konnichiwa@mawari.co.jp\" data-type=\"email\" translate=\"no\">konnichiwa@mawari.co.jp</a>.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211221005654r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMjIxMDA1NjU0cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=6edcfe540df6959ceaaeeaba45945d0093e05fe3d21c04420199bc51b8133aca6f59b70c03de89fcdb0db6847f0d21c010e270f4fa9c8780c3e527576586aa1f\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211221005654/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211221005654/en/</a></span></p><p>\nLuis Oscar Ramirez Solorzano - CEO\n<br/>+81-3-6416-1096\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: MAWARI</p></div>"}