{"date": "2021-12-01 19:55:01.113000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>AWS Supports Roche in Harnessing the Power of Health Data at Scale</b>\n</p><p class=\"bwalignc\">\n<span>One of the world’s largest healthcare companies uses AWS technology to facilitate secure research collaboration, deliver new diagnostic technologies, and unlock insights from health data to improve patient care and health outcomes</span>\n</p><p style=\"font-weight:normal\">\nToday, Amazon Web Services (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), announced that the Roche Group (SIX: RO, ROG; OTCQX: RHHBY) is using AWS for the majority of its cloud workloads to help Roche extract greater value from its health data. The company uses AWS capabilities in high performance computing, analytics, machine learning, database, storage, and security to accelerate drug discovery and development, and process health data at scale to deliver high-quality, individually tailored care. Roche also works with AWS Professional Services to integrate its information technology (IT) systems so that it can securely share data as needed both within the company and with key external stakeholders such as academic institutions, regulatory agencies, and healthcare providers, while Roche complies with laws and guidelines to protect patient privacy.\n</p><p>\nAWS’s secure infrastructure and portfolio of services power Roche’s personalized healthcare program. While biopharmaceutical companies have been pursuing personalized medicine for over two decades, only recently have advances in data, analytics, and digital technology positioned the healthcare industry for transformational change. Roche uses AWS analytics and database services like Amazon OpenSearch Service (AWS’s service for searching, visualizing, and analyzing up to petabytes of text and unstructured data) and Amazon Aurora (AWS’s MySQL and PostgreSQL-compatible relational database built for the cloud) to help it gain actionable insights from its enterprise, research, clinical, digital health, and real-world patient data. With AWS, Roche can examine health data at scale related to patients’ genetic makeup, overall health, and drug efficacy and interactions, analyzing structured datasets of de-identified patient data that Roche anonymizes and aggregates to protect patient privacy. This capability gives Roche researchers a more detailed understanding of patient biology across larger patient populations, and can help them identify patterns and outliers that inform development of diagnostics and treatments.\n</p><p>\n“With profound advances in data, analytics, and digital technology, we are transforming the way medicines are discovered and developed, and how care is delivered to patients. AWS provides us with high-performance and secure cloud solutions that help to harness the power of data to improve patients’ lives,” said Dr. Alan Hippe, CFO and CIO of Roche Group. “With AWS, we are bringing together health data in new ways to better detect, diagnose, treat, monitor, and manage diseases more effectively and efficiently for the benefit of patients. Roche complies with all applicable data privacy laws—including but not limited to the Swiss Data Protection Act, the European Union General Data Protection Regulation (GDPR), the US Health Insurance Portability and Accountability Act (HIPAA), and China’s Cybersecurity Law and associated data privacy standard.”\n</p><p>\nAWS powers Roche’s use of digital technologies like smartphone apps that can support healthcare professionals in providing individually tailored care and allow patients to play a role in managing their own health. AWS services such as AWS Lambda (a serverless, event-driven compute service), Amazon Elastic Kubernetes Service (Amazon EKS), and Amazon SageMaker (AWS’s service that helps developers and data scientists build, train, and deploy machine learning models quickly) allow Roche to ingest, store, process, and rapidly analyze health data collected by smart devices. For instance, Roche built and runs its <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.mysugr.com%2Fen-us%2F&amp;esheet=52541353&amp;newsitemid=20211129005490&amp;lan=en-US&amp;anchor=mySugr+app&amp;index=1&amp;md5=7e4758d13c162e49fc8306167b9a7096\" data-type=\"url\" class=\"tr-link\" translate=\"no\">mySugr app</a> on AWS to securely aggregate and analyze data such as blood glucose measurements for patients with diabetes. Roche uses the app to automatically pull and analyze data from smart meters to better inform a patient’s schedule and dosing for medication. Across its range of digital healthcare applications, Roche continuously and securely collects and analyzes patient health data in the cloud, giving the patient and their healthcare providers a more timely, precise understanding of how diseases progress and respond to treatment.\n</p><p>\nRoche also uses AWS’s scalable high performance computing capabilities, along with AWS container and analytics services like Amazon Redshift (AWS’s cloud data warehousing service), to securely process and extract insights from dozens of petabytes of genomic data from more than 300,000 consenting cancer patients globally while maintaining patient privacy. Roche uses Amazon FSx for Lustre (AWS’s service that provides cost-effective, high-performance, scalable storage for compute workloads) to store that genomic data and make it quickly available for analysis. With the support of AWS, Roche continues to expand its knowledge base of cancers to identify future cases more rapidly.\n</p><p>\nRoche enhances the value of its tumor-profiling work with patient health insights derived from aggregated electronic health records it processes on AWS. Roche runs its analytics, machine learning, storage, and managed database applications on AWS, helping it extract and standardize high-quality data from more than 3 million electronic health records to produce de-identified, real-world patient datasets. These include petabytes of oncology data and other protected health information that Roche researchers use to guide their work and inform the design of clinical trials.\n</p><p>\n“With AWS powering its research, development, and healthcare operations, Roche can deliver timely, relevant data that helps scientists collaborate more securely and effectively, researchers design more efficient clinical trials, caregivers make decisions with more accuracy, and patients take greater control over their health,” said Kathrin Renz, Vice President of Business Development and Industries at Amazon Web Services. “AWS is helping the healthcare and life sciences industry cross the threshold of personalized medicine, reduce the time and cost for clinical trials, and improve patients’ health outcomes through digital healthcare. With AWS, Roche is turning complex health data into a resource rather than an obstacle and reducing the time it takes to get new medicines into the hands of patients.”\n</p><p>\n<b>About Amazon Web Services</b>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com&amp;esheet=52541353&amp;newsitemid=20211129005490&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=2&amp;md5=2eb327b0469a887cd3c3fe3bb5ff242f\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<b>About Amazon</b>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Famazon.com%2Fabout&amp;esheet=52541353&amp;newsitemid=20211129005490&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=3&amp;md5=59c3f5b642d5aa75acdc2a7e7b979a44\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211129005490/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211129005490/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52541353&amp;newsitemid=20211129005490&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=4&amp;md5=3723796e658616d3d6e376cbae9e02a5\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: WA-AMAZON-WEB-SERVICES</p></div>"}