{"date": "2021-12-08 10:06:12+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-story-p1\"><span class=\"tr-dateline\">BERLIN, Dec 8 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>German police searched homes and businesses and made several arrests across 12 states on Wednesday as part of an investigation into foreign workers being brought in illegally to be exploited in the logistics industry.</p><p>At the centre of the investigation is a gang suspected of founding and using a network of companies in Germany and abroad to send non-EU nationals illegally as temporary workers for large logistics companies, the federal police said. </p><p>Police made several arrests in Berlin, Brandenburg, Bremen and Lower Saxony, they said, adding that they planned to  confiscate assets worth several million dollars.</p><p>It was not clear which large logistics companies were targeted. </p><p>     Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> and Deutsche Post <a href=\"reuters://REALTIME/Verb=FullQuote/ric=DPWGn.DE\" data-type=\"ric\" data-ric=\"DPWGn.DE\" translate=\"no\" dir=\"ltr\">DPWGn.DE</a>, main players in Germany's logistics sector, did not immediately respond to requests for comment.</p><p>Federal police, Berlin's public prosecutors and customs office were due to hold a news conference on the results of the raids later in the day.</p><p>     In 2019, following a nationwide raids on illicit employment and exploitation at subcontracting delivery firms, Germany approved a law to force logistics and ecommerce companies that outsource deliveries to ensure that their subcontractors pay proper social security contributions for their drivers.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Riham Alkousaa and Matthias Inverardi; Editing by Nick Macfie)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Riham.Alkousaa@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Riham.Alkousaa@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: GERMANY-CRIME/LOGISTICS</p></div>"}