{"date": "2021-12-08 17:11:45.029000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.29, "close": 3483.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>INNERSCOPE HEARING TECHNOLOGIES INC (\"INND-0\")\n- Receives Walmart Purchase Orders of $277,000+ for\n- In-Store Product Sales\n\n   InnerScope Hearing Technologies Inc. (\"InnerScope\"), an emerging and\ndisruptive leader in the Direct-to-Consumer Hearing Technology space, is\npleased to announce today its wholly-owned subsidiary, HearingAssist,\nWalmart's largest direct-ship and wholesale hearing aid supplier, has\nreceived purchase orders from Walmart totaling over $277,000 for its\nEZ-Hear Neckband Bluetooth Hearing Amplifier for an in-store display to be\nlocated in 757 Walmart Stores.\n\n HearingAssist has ramped up its current production of the EZ-Hear Neckband\nBluetooth Hearing Amplifiers and its distribution to 757 Walmart stores in\n5 states (Texas, North Carolina, Tennessee, Colorado, and Arizona) to meet\nthe demand for in-store Walmart purchases. In addition, HearingAssist is\ncurrently rolling out hearing aid product displays to the 757 Walmart\nstores and expects to continue receiving and fulfilling additional purchase\norders for the EZ-Hear Neckband Hearing Amplifiers.\n\n The EZ-Hear Neckband Bluetooth Hearing Amplifier (\"EZ-Hear\") is a fully\nrechargeable Bluetooth hearing amplifier that combines hearing\namplification with easy-to-use hands-free calling with a smartphone and\nmusic streaming. The EZ-HEAR is designed for every occasion with a strong\nnoise filtering feature, little to no feedback from amplification, and is\nsimple and easy-use with minimal buttons. The EZ-Hear has modern features\nincluding hands-free phone calls and streaming your music via Bluetooth\nfrom any smartphone. Easily answer phone calls or pause music with the\ntouch of a button. This neckband has a sleek modern design that provides\nall-day comfort due to its lightweight design.\n\n \"With our recent Acquisition of HearingAssist, we are excited to continue\nto build on the Walmart relationship with HearingAssist affordable hearing\nproducts offered at Walmart in-store and on Walmart.com,\" said Mr. Matthew\nMoore, president and CEO of InnerScope. \"We anticipate HearingAssist's\ncontinued sales growth with Walmart starting in the fourth quarter of 2021\nas we execute our marketing plan. Additionally, we believe the path and\ntrajectory of these initial Walmart purchase orders will put HearingAssist\non track for a banner year in 2022.\"\n\n About InnerScope Hearing Technologies, Inc. (OTC PINK: INND):\n\n InnerScope Hearing Technologies Inc. is a leading Direct-to-Consumer (DTC)\nmanufacturer and distributor of FDA-registered hearing aids, hearing\nassistive devices, hearing health-related products, and Personal Sound\nAmplifier Products (PSAPs) (\"Hearing Products\") dedicated to addressing the\nglobal demand for affordable hearing solutions. InnerScope's Hearing\nProducts and its business model break through the persistent barriers that\nprevent access to effective hearing solutions.\n\n InnerScope's recent acquisition of iHear Medical Inc., a DTC cloud-based\nhearing solution provider, gives the Company access to over 40 patents and\nan FDA-registered manufacturing and R&amp;D facility. In addition, InnerScope\nhas acquired HearingAssist, an established leader in the direct-to-consumer\nhearing aid market with a customer base of over 400,000. These\nacquisitions, combined with a partnership with Atlazo Inc., a semiconductor\ninnovator for next-generation AI smart devices, will allow InnerScope to\ntake the lead position in the direct-to-consumer hearing solutions market\nby selling innovated proprietary advanced hearing products through Walmart\nand other major Big Box retailers.\n\n InnerScope's full line of Hearing Health products is currently available\nthrough these multiple retail/wholesale channels: Walmart.com,\nAmazon.com,  Giant Eagle, Hy-Vee, Hartig Drug, Food City, and Cardinal\nHealth dba RGH Enterprises Inc., which provides products to FSAStore.com,\nHSAStore.com, and WellDeservedHealth.com. Additional major retailers\nin-store and online are launching soon.\n\n For information related to InnerScope Hearing Technologies' latest hearing\naids and related hearing products, please visit:\n<a href=\"http://iheardirect.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://iheardirect.com</a>\n\n <a href=\"http://hearingassist.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://hearingassist.com</a>\n\n For the most up-to-date information about InnerScope Hearing Technologies\n(OTC: INND), please visit and follow our official Twitter account\n@inndstock page:\n<a href=\"https://twitter.com/inndstock\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/inndstock</a>\n\n InnerScope Hyperlinks:\nHearingAssist\nhearing assist - Walmart.com\nThe EZ-Hear Neckband Hearing Amplifier\nAcquisition of iHear Medical Inc.\nAcquisition of HearingAssist\nDirect-to-Consumer Hearing Products.\n\n InnerScope's Hearing Health Flexible Subscription Plans\n Safe Harbor\n\n This news release contains \"forward-looking statements\" within the meaning\nof Section 27A of the Securities Act of 1933, as amended, and Section 21E\nof the Securities Exchange Act of 1934, as amended, intended to be covered\nby the \"safe harbor\" created by those sections. Any statements that are not\nhistorical facts contained in this press release are also \"forward-looking\nstatements,\" as that term is defined under the Private Securities\nLitigation Reform Act of 1995 (PSLRA). Such statements may be identified by\nwords such as \"expects,\" \"plans,\" \"projects,\" \"will,\" \"may,\" \"anticipates,\"\n\"believes,\" \"should,\" \"intends,\" \"estimates,\" and other words of similar\nmeaning. Such forward-looking statements are based on current expectations,\ninvolve known and unknown risks, a reliance on third parties for\ninformation, transactions or orders that may be canceled, and other factors\nthat may cause our actual results, performance or achievements, or\ndevelopments in our industry to differ materially from the anticipated\nresults, performance or achievements expressed or implied by such\nforward-looking statements. Factors that could cause actual results to\ndiffer materially from anticipated results include risks and uncertainties\nrelated to the fluctuation of global economic conditions, the performance\nof management and our employees, our ability to obtain financing or\nmaintain contractual relationships with vendors and customers, competition,\ngeneral economic conditions and other factors that are detailed in our\nperiodic reports filed with the Securities and Exchange Commission\n(\"S.E.C.\"). We intend that all forward-looking statements be subject to the\nsafe-harbor provisions of the PSLRA, Securities Act, and Securities\nExchange Act.\n\nInnerScope Hearing Technologies, Inc.\nInvestor Relations\nir@innd.com\n833-788-0506\nwww.innd.com\n\nInvestor Relations Agency Contact:\nSkyline Corporate Communications Group, LLC\nLisa Gray, Senior Account Manager\nOne Rockefeller Plaza, 11th Floor\nNew York, NY 10020\nOffice: (646) 893-5835\nEmail: lisa@skylineccg.com\n\n For the most up-to-date information about InnerScope Hearing Technologies\n(OTC: INND), please visit and follow our official Twitter account\n@inndstock page.\n\n Corporate Communications:\n InvestorBrandNetwork (IBN)\n Los Angeles, California\n www.InvestorBrandNetwork.com\n 310.299.1717 Office\n Editor@InvestorBrandNetwork.com\n\n Wire Service Contact:\n InvestorWire (I.W.)\n Los Angeles, California\n www.InvestorWire.com\n 212.418.1217 Office\n Editor@InvestorWire.com\n     ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134100963.MNPRE2134102743-08542220211208</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}