{"date": "2022-01-19 15:00:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-story-p1\"><span class=\"tr-dateline\">LOS ANGELES, Jan 19 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>The long-awaited, expensive Middle-earth fantasy series from Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> has a name: \"The Lord of the Rings: The Rings of Power.\"</p><p>Amazon's Prime Video revealed the full name of the fantasy series on Wednesday ahead of its planned streaming debut of Sept. 2. </p><p>The show's storyline takes place thousands of years before the events in writer J.R.R. Tolkien's \"Lord of the Rings\" books, which are set in the fictional land of Middle-earth and were brought to life in blockbuster movies. </p><p>The subtitle foreshadows a story \"that welds the major events of Tolkien's Second Age together: the forging of the iconic rings,\" Amazon said in a statement.</p><p>Creators J.D. Payne and Patrick McKay said the series \"unites all the major stories of Middle-earth's Second Age: the forging of the rings, the rise of the Dark Lord Sauron, the epic tale of Numenor, and the Last Alliance of Elves and Men.\"</p><p>\"Until now, audiences have only seen on screen the story of the One Ring,\" they added. \"But before there was one, there were many ... and we're excited to share the epic story of them all.\"</p><p>Amazon spent about $465 million filming the first season of the show, according to government officials in New Zealand, where the series was filmed. The company is expecting to make five seasons of the show, making it one of the most expensive TV series ever.</p><p>The first season will be available in more than 240 nations in multiple languages, Amazon said. New episodes will be released weekly.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Lisa Richwine; Editing by Leslie Adler)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:lisa.richwine@thomsonreuters.com\" data-type=\"email\" translate=\"no\">lisa.richwine@thomsonreuters.com</a> ; <br/> Follow me on Twitter <a href=\"https://twitter.com/LARichwine\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/LARichwine</a>; <br/> 1-424-434-7324; <br/> Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://lisa.richwine.thomsonreuters.com@reuters.net\">lisa.richwine.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: TELEVISION-LORD OF THE RINGS/ (PIX)</p></div>"}