{"date": "2021-12-14 13:42:17.501000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>BLACKBERRY LTD (\"BB-TN\")\n- Achieves Carbon Neutrality\n\n     BlackBerry Limited announced it has achieved carbon neutrality across\nScope 1, Scope 2 and material Scope 3 emissions, the three groups that\ncategorize the emissions a company creates, as classified under the\nGreenhouse Gas (GHG) Protocol Corporate Standard. Additionally, BlackBerry\nhas invested in carbon removal, for a net effect of the company removing\ncarbon from the atmosphere.\n\n     BlackBerry has achieved these environmental sustainability milestones\nby:\n\n//st\n\n  * Moving company and customer workloads to the cloud. Customers are\ndeploying our cloud-based solutions, including BlackBerry(r) UEM Cloud,\nBlackBerry(r) Optics 3.0, and BlackBerry(r) Workspaces.\n  * Reducing direct and indirect emissions across our operations by 88%\nsince 2013, across company facilities, energy consumption, business travel,\nwaste management and more.\n  * Partnering with the Restore the Earth Foundation in the United States\nto help reforest the Mississippi River Basin, North America's Amazon.\n  * Investing in advanced wastewater treatment technology in Canada, which\neliminates the environmental impacts of, and consumes less energy than,\ntraditional systems.\n  * Partnering with School Boards in Canada to implement energy efficiency\nmeasures. The partnership also includes enabling climate change related\neducation and programs.\n  * Investing in innovative cookstove technology in Rwanda, which\nsignificantly reduces non-renewable fuel consumption and relieves\ndeforestation pressures.\n  * Committing to the United Nations Global Compact (UNGC), whose purpose\nis to mobilize a global movement of sustainable companies and stakeholders\nto create the world we want.\n\n//et\n\n     \"Businesses are key to building a more sustainable and equitable today\nand tomorrow,\" said Neelam Sandhu, SVP &amp; Chief Elite Customer Success\nOfficer, BlackBerry. \"BlackBerry is proud to have achieved carbon\nneutrality, invest in carbon removal, and partner with customers to reduce\ntheir carbon footprints through our cloud-based solutions.\"\n\n     \"It has been a pleasure to partner with BlackBerry on their\nachievement of carbon neutrality,\" said Dan Fraleigh, CEO, Carbonzero, a\nleader in corporate carbon management strategies and solutions. \"We applaud\ntheir approach to significantly reducing direct and indirect emissions, and\noffsetting the remainder through investments in Canadian, United States,\nand international projects.\"\n\n     \"We are delighted to partner with BlackBerry to help them accomplish\ntheir environmental sustainability goals,\" said PJ Marshall, Executive\nDirector of Restore the Earth Foundation. \"Their proactive approach to\ncarbon emission reductions is commendable, and their partnership with\nRestore the Earth and ClimeCo will also have meaningful impacts to the\necological landscape where the restoration is taking place. The\nreforestation that will occur as a result of this partnership will ensure\nthat biodiversity, critical habitats, and communities are enhanced and\nsupported in self-sustaining systems.\"\n\n     The technology sector has a central role to play in responding to the\nclimate crisis, as digital transformation has the potential to decouple\neconomic growth from carbon emissions growth. Furthermore, the technology\nsector is responsible for 2 to 3 percent of global carbon emissions. To\nlearn more about BlackBerry's Corporate Social Responsibility (CSR)\nstrategy visit BlackBerry.com/CSR.\n\n     About BlackBerry BlackBerry (NYSE: BB; TSX: BB) provides intelligent\nsecurity software and services to enterprises and governments around the\nworld. The company secures more than 500M endpoints including over 195M\nvehicles. Based in Waterloo, Ontario, the company leverages AI and machine\nlearning to deliver innovative solutions in the areas of cybersecurity,\nsafety and data privacy solutions, and is a leader in the areas of endpoint\nmanagement, endpoint security, encryption, and embedded systems.\nBlackBerry's vision is clear - to secure a connected future you can trust.\n\n     BlackBerry. Intelligent Security. Everywhere.\n\n     For more information, visit BlackBerry.com and follow @BlackBerry.\n\n     Trademarks, including but not limited to BLACKBERRY and EMBLEM Design\nare the trademarks or registered trademarks of BlackBerry Limited, and the\nexclusive rights to such trademarks are expressly reserved. All other\ntrademarks are the property of their respective owners. BlackBerry is not\nresponsible for any third-party products or services.\n\n     Media Contact: BlackBerry Media Relations +1 (519) 597-7273\nmediarelations@BlackBerry.com\n\n     View original content to download\nmultimedia:https://www.prnewswire.com/news-releases/blackberry-achieves-car\nbon-neutrality-301443960.html\n\nTel   : 519-888-7465    BLACKBERRY LTD\nFax   : 519-888-6990\nEmail : investor_relations@blackberry.com\nWWW   : <a href=\"https://www.blackberry.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.blackberry.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134700062.MNPRE2134700867-05184720211214</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}