{"date": "2021-11-20 23:39:16.940000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3676.57, "close": 3580.04}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><a href=\"https://www.independent.co.uk/topic/amazon\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a> gave numerous employees 'free for all' access to customer information which allowed low-level workers to see personal shopping history of celebrities and people they were romantically involved with, a new report alleges.</p><p>It has been claimed that customer service representatives were given the ability to look up any user's purchase history on command to ensure quick assistance. One former service representative told Wired that colleagues would look up the purchases of celebrities including Kanye West or Marvel actors – including sensitive purchases such as sex toys.</p></div><div class=\"tr-npp-body\"><p>Other staffers recalled employees looking up the <a href=\"https://www.independent.co.uk/topic/data\" data-type=\"url\" class=\"tr-link\" translate=\"no\">data</a> of exes and girlfriends or boyfriends – despite this being forbidden by Amazon's policies.</p><p>The report, from <a href=\"https://www.wired.com/story/amazon-failed-to-protect-your-data-investigation/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Wired and Reveal</a> , is based on a series of six-page memos between 2016 and 2018 between numerous Amazon executives, internal Amazon documents dating back to 2015, and interviews with former, anonymous, staff.</p><p>The system that \"allows associates to quickly work on behalf of Amazon customers ... puts those same customers at risk from intentional abuse and unintentional exposure by employees and contractors who have been entrusted with elevated privileges\", an internal memo reportedly read.</p><p>\"We strongly reject the notion that abuse of these privileges is 'common.'\", an Amazon spokesperson told Wired. Amazon did not respond to <span>The Independent's</span> request for comment before time of publication.</p><p>Amazon's vast company network was allegedly \"put together with tape and bubblegum,\" according to cybersecurity executive Gary Gagnon who was Amazon's vice president of information security in 2016.</p><p>Gagnon says he made attempts to increase his security staff – having only 300 on a team he believed should be 1000-strong – but was pushed back by Amazon higher-ups who would not provide the resources because it would increase overhead costs.</p><p>\"I would tell new hires, 'Assume your budget is zero and go from there. Just be as frugal as you can,'\" Ellie Havens, a former business operations manager on the security team, recalled.</p><p>In addition, the report alleges that up to 24 million American Express credit card numbers, and customer names, had also been stored in Amazon's internal network where they could have been vulnerable to attack.</p><p>The security team allegedly said they were unable to say whether the details had been accessed or not, because their access logs only went back 90 days.</p><p>\"We had no idea what the exposure actually was,\" Gagnon says. \"I was astonished by that.\"</p><p>It is claimed that one of the causes of these issues was Amazon's 3,300 teams' tendency to copy data and store it in various locations, according to a 2018 security memo, resulting in a \"mostly undocumented proliferation of copies of their required data sets.\"</p><p>Even before then, an attempt to map all of Amazon's data in 2016 by its security team reportedly proved impossible.</p><p>Amazon told Wired that \"there is no evidence to suggest the data was ever exposed outside of our internal system in any way.\"</p><p>Another reported scandal saw Chinese data firms been harvesting millions of customers' information using a backdoor in a tool that allows third-party developers to look at their own metrics. Using AMZReview, a service advertised as a way for sellers to boost their Amazon rankings, third-part companies collected the 'keys' from 92 different sellers to unlock huge amounts of information without the knowledge of 16 million customers.</p><p>AMZReview gave sellers access the personal email address attached to customers – allegedly allowing them to target buyers leaving bad reviews and entice them to remove them with special offers – but these had allegedly been collected from \"other open and breached sources\", Wired says.</p><p>One memo said that over half of the third-party developers the Amazon had researched were violating its terms of service. When Amazon discovered companies doing this, it claims that it cut them off; it also used an outside auditor to ensure companies complied with the rules.</p><p>Amazon has \"an exceptional track record of protecting customer data,\" a company spokesperson told Wired, and said these documents proved its strong culture.</p><p>\"The fact that Amazon's privacy and security issues are extensively documented with extensive review from senior leadership highlights our commitment to these issues and demonstrates the vigilance with which we identify, escalate, and respond to potential risks,\" they said. \"We've invested billions of dollars over the years to build systems and processes to keep data secure, and are constantly looking for ways to improve.\"</p><p>Read More</p><p><a href=\"https://www.independent.co.uk/life-style/gadgets-and-tech/amazon-visa-credit-card-payments-debit-b1959206.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon to stop accepting Visa credit cards for payments</a> </p><p><a href=\"https://www.independent.co.uk/life-style/gadgets-and-tech/news/alexa-amazon-listen-voice-recordings-b1958780.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">How to listen to the recordings Amazon's Alexa has of you</a> </p><p><a href=\"https://www.independent.co.uk/life-style/gadgets-and-tech/sky-routers-hackers-fix-update-b1960817.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Millions of Sky routers left open to hackers now have a fix</a> </p><p><a href=\"https://www.independent.co.uk/life-style/gadgets-and-tech/sky-routers-hackers-fix-update-b1960817.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Millions of Sky routers left open to hackers now have a fix</a> </p><p><a href=\"https://www.independent.co.uk/space/lunar-eclipse-pictures-blood-moon-2021-today-b1960762.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Stunning photos show beaver 'blood' moon's partial eclipse</a> </p><p><a href=\"https://www.independent.co.uk/space/beaver-blood-moon-eclipse-peak-b1960650.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Beaver 'blood' moon lunar eclipse reaches spectacular peak</a> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Independent, The (UK) (Online). All rights reserved.</p></div>"}