{"date": "2021-07-08 06:10:53.231000+00:00", "ticker": "III", "mrkt_info": {"open": 1209.5, "close": 1173.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 5400E3i Infrastructure PLC08 July 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>8 July 2021</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>3i Infrastructure plc - Q1 Performance update</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>Strong diverse portfolio delivers good level of income underpinned by a solid liquidity position</p>\n<p>3i Infrastructure plc (\"3i Infrastructure\" or the \"Company\") is an investment company whose purpose is to invest responsibly in infrastructure, delivering long-term sustainable returns to shareholders and having a positive impact on its portfolio companies and stakeholders. This statement relates to the period from 1 April 2021 to 30 June 2021 (the \"period\").</p>\n<p>\n<span>Highlights</span>\n</p>\n<p>\n<span>Â·</span>\n<span>Portfolio performing well</span> : Overall our portfolio performed as expected at March 2021, continuing to show resilience despite the ongoing effects of the pandemic. Our businesses remain well-funded.</p>\n<p>\n<span>Â·</span>\n<span>New i</span>\n<span>nvestment:</span> On 1 April 2021, 3i Infrastructure announced the acquisition of a 60% stake in DNS:NET for c.â\u0082¬182 million alongside Founder and CEO Alexander Lucke, who has reinvested to retain a 40% stake. The transaction completed on 10 June 2021.</p>\n<p>\n<span>Â·</span>\n<span>Good income in the period:</span> Total income and non-income cash was Â£22 million in the period, in line with our expectations.</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Â·</span>\n<span>Final FY21 dividend payment and FY22 target:</span> Payment of the final dividend for FY21 of 4.9 pence per share is due to be made on 12 July 2021. The Company is on track to deliver a FY22 dividend target of 10.45 pence per share, up 6.6% from FY21.</p>\n<p>\n<span>Â·</span>\n<span>Solid liquidity</span> : At 30 June 2021, the Company's cash balance was Â£287 million.</p>\n<p>\n<span>\n<span>Phil White, Managing Partner and Head of Infrastructure, 3i Investments plc, Investment Manager of the Company, commented</span>\n</span>\n<span>: \"</span> During the period, we invested in <span>leading independent telecommunications provider DNS:NET, our first sizeable investment in Germany, which further diversifies our portfolio. The portfolio continues to show resilience, despite the current market conditions, and to provide a solid level of income. We have a good pipeline of potential investment opportunities across our target markets and have liquidity to invest, though we continue to be patient and selective in what are still very competitive market dynamics.\"</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Portfolio update</span>\n</p>\n<p>\n<span>The portfolio overall performed in line with expectations during the period.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>On 1 April 2021, the Company agreed to invest c.â\u0082¬182m to acquire a 60% stake in DNS:NET and to provide additional funding for the future growth of the business. DNS:NET is a leading independent telecommunications provider in Germany.</span> The transaction completed on 10 June 2021.</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>On 29 April 2021, Joulz completed the acquisition of rooftop solar developer Zonel Energy (\"Zonel\"), a leading provider of solar rooftop solutions to businesses across the Netherlands, furthering Joulz's ambition to become the leading provider of integrated energy transition solutions in the Netherlands. No new funding was required from 3i Infrastructure for this transaction.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Further to the announcement in March 2021 that the facilities of Steril Milano, a subsidiary of Ionisos, had been closed, Steril Milano decided to place itself into voluntary liquidation during the period. This was fully provided for in the March 2021 valuation of Ionisos. Steril Milano represented c.3% of Ionisos's 2020 EBITDA. The remainder of Ionisos's operations continue to perform well.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>The Company's existing commitment to invest a further Â£11.6 million into ESVAGT was injected on 17 May 2021 to fund further growth in the offshore wind segment. ESVAGT has accepted the second of three new Service Operation Vessels for MHI Vestas during the period.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Portfolio returns</span>\n</p>\n<p>\n<span>The portfolio overall is delivering a good level of income. Total income and non-income cash was Â£22 million in the period. This compares with Â£24 million of income and non-income cash received in the same period last year.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Balance sheet</span>\n</p>\n<p>At 30 June 2021, the Company's cash balance was Â£287 million, after the investment of Â£157 million in DNS:NET. The full revolving credit facility of Â£300 million remains undrawn and is available to fund potential new investment opportunities and to invest in portfolio companies.</p>\n<p>Â£107 million of deferred proceeds (including accrued interest) from the sale of WIG in 2019 is due in December 2021.</p>\n<p>The cash balance includes Â£44 million which will fund the Company's final dividend payment to shareholders on 12 July 2021 if approved at the AGM.</p>\n<p>Ends</p>\n<p>For information, please contact:</p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>Richard Laing</p>\n</td>\n<td>\n<p>Chair, 3i Infrastructure plc</p>\n</td>\n<td>\n<p>+44 37 1664 0445</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Thomas Fodor</p>\n</td>\n<td>\n<p>Shareholder enquiries</p>\n</td>\n<td>\n<p>+44 20 7975 3469</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Kathryn van der Kroft</p>\n</td>\n<td>\n<p>Media enquiries</p>\n</td>\n<td>\n<p>+44 20 7975 3021</p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>About 3i Infrastructure plc</p>\n<p>\n<span>3i Infrastructure plc is a Jersey-incorporated, closed-ended investment company, an approved UK Investment Trust, listed on the London Stock Exchange and regulated by the Jersey Financial Services Commission. The Company's purpose</span> is to invest responsibly in infrastructure, delivering long-term sustainable returns to shareholders and having a positive impact on our portfolio companies and stakeholders <span>.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>3i Investments plc, a wholly-owned subsidiary of 3i Group plc, is authorised and regulated in the UK by the Financial Conduct Authority and acts as Investment Manager to 3i Infrastructure plc.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>This press release is not for distribution (directly or indirectly) in or to the United States, Canada, Australia or Japan and is not an offer of securities for sale in or into the United States, Canada, Australia or Japan. Securities may not be offered or sold in the United States absent registration under the U.S. Securities Act of 1933, as amended (the \"Securities Act\"), or an exemption from registration under the Securities Act. Any public offering to be made in the United States will be made by means of a prospectus that may be obtained from the issuer or selling security holder and will contain detailed information about 3i Group plc, 3i Infrastructure plc, 3i India Infrastructure Fund and management, as applicable, as well as financial statements. No public offering in the United States is currently contemplated.</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>This statement aims to give an indication of material events and transactions that have taken place in the period from 1 April 2021 to 30 June 2021 and their impact on the financial position of 3i Infrastructure plc. These indications reflect the Board's current view. They are subject to a number of risks and uncertainties and could change. Factors which could cause or contribute to such differences include, but are not limited to, general economic and market conditions and specific factors affecting the financial prospects or performance of individual investments within the portfolio of 3i Infrastructure plc.</span>\n</p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>TSTEANXXEFFFEFA</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}