{"date": "2021-11-07 06:54:56+00:00", "ticker": "AVV", "mrkt_info": {"open": 3540.0, "close": 3510.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>Abu Dhabi, United Arab Emirates – AVEVA, a global leader in industrial software, driving digital transformation and sustainability, has announced its participation in ADIPEC 2021, the global energy industry’s largest, most important and influential event, which is being held at the Abu Dhabi National Exhibition Center from 15-18 November 2021. AVEVA will showcase a broad portfolio of leading-edge solutions powered by cloud, Artificial Intelligence (AI) and digital twin technologies that enable oil &amp; gas and energy companies to accelerate their digital transformation and sustainability journeys.</p>\n<p>AVEVA CEO Peter Herweck will host an exclusive ADIPEC Leadership Roundtable for C-suite executives at the event, where delegates will discuss how digitalization, innovation and cross-sector partnerships are fundamental in supporting organizations as they develop, invest and deploy technology to meet the world’s net-zero climate ambitions. The panel will also discuss strategies that lead to industrial innovation, as well as elaborating how to accomplish a greener and truly digital value chain. Herweck will be joined by Amish Sabharwal, EVP Engineering Business, AVEVA, BCG and Arthur Hanna, ADIPEC Strategy Advisor and World Energy Council Advisor.</p>\n<p>Sabharwal will also address the ADIPEC Offshore and Marine Conference, where he will discuss the role of technology and digitalization in enabling growth in the offshore and marine industry.</p>\n<p>Digitalization and sustainability have emerged as two of the biggest issues impacting industries, including oil and gas players. AVEVA enables 19 of the top 20 petroleum companies to leverage the benefits of digital transformation for sustainable and environmental benefits by accelerating capital project efficiency, driving operational excellence, and optimizing plant capabilities.</p>\n<p>“Technology and digitalization now play a central role in delivering business success. Now more than ever, cutting-edge digital innovations are supporting energy companies in improving performance while boosting value creation and business competitiveness as they decarbonize their operations. Requirements to meet climate targets are compelling organizations to fast-track the onboarding of data- and automation-related tools for transformative impact amid an uncertain business landscape. An expansion of connected worker capabilities will likewise require embracing a new operational paradigm,” said Evgeny Fedotov, Senior Vice President, Head of EMEA region at AVEVA.</p>\n<p>AVEVA will attend ADIPEC 2021 alongside its strategic partner, Schneider Electric as well as host an independent booth, where it will showcase its innovative technologies such as AVEVA Unified Operations Center, Digital Twin, and Value Chain Optimization to name some. AVEVA will also be present at the Microsoft stand, demonstrating how AVEVA PI System™ and its Asset Performance Management software use artificial intelligence and machine learning to support asset reliability and performance, while warning users of potential anomalies and maintenance issues. At the AWS booth, AVEVA will present its AVEVA Unified Engineering and Digital Twin solutions, with Amit Kar, Director of Global Pursuits at AVEVA, providing real-life examples of this data-centric ecosystem in action.</p>\n<p>Across the event, senior AVEVA executives and experts will be available to meet with customers and share success stories of how AVEVA serves the world’s largest industrial and oil and gas companies by offering powerful market-ready solutions with an integrated end-to-end digital portfolio spanning asset and operational lifecycles.</p>\n<p>“With its breadth of expertise across the energy sector, AVEVA is uniquely poised to help energy partners unlock the benefits of digital transformation at every level and we look forward to engaging with partners and stakeholders at ADIPEC 2021,” Fedotov said.</p>\n<p>As a silver sponsor of ADIPEC 2021, AVEVA will be exhibiting at booth 4410 in Hall 4.</p>\n<p>-Ends-</p>\n<p><strong>About AVEVA</strong></p>\n<p><span>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence.  AVEVA’s comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries.</span></p>\n<p><span>Learn more at <a href=\"http://www.aveva.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.aveva.com </a> </span></p>\n<p><span>Copyright © 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</span></p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}