{"date": "2022-02-08 00:10:32+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By David Shepardson</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">WASHINGTON, Feb 7 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>The U.S. House of Representatives is set to vote on Tuesday on a bipartisan reform bill aiming to help Postal Service (USPS) save about $50 billion over a decade and requiring future retirees to enroll in a government health insurance plan.</p><p>USPS has reported net losses of more than $90 billion since 2007. One reason is 2006 legislation mandating it pre-fund more than $120 billion in retiree healthcare and pension liabilities.</p><p>House Oversight Committee chair Carolyn Maloney said Monday the bill would put USPS on a stronger footing and save $50 billion over 10 years. </p><p>If approved, the legislation moves to the U.S. Senate.</p><p>The bill eliminates requirements USPS pre-fund retiree health benefits for current and retired employees for 75 years, a requirement no business or other federal entity faces. USPS projects it would sharply reduce its pre-funding liability and save it roughly $27 billion over 10 years.</p><p>It requires future retirees to enroll in Medicare. About 25% of postal retirees do not enroll in Medicare even though they are eligible, which results in USPS paying higher premiums than other employers. USPS estimates the change could save it about $22.6 billion over 10 years.</p><p>The White House and postal unions support the bill as does the Greeting Card Association and Hallmark</p><p>One of the service's biggest customers, Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, <a href=\"https://oversight.house.gov/sites/democrats.oversight.house.gov/files/PSRA%20Support%20Letters.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">said</a> it strongly backs the legislation.</p><p>\"Americans across the country have long depended on the USPS for its reliable and affordable delivery options,\" Amazon Public Policy Vice President Brian Huseman wrote in a Feb. 2 letter to lawmakers.     </p><p>Postmaster General Louis DeJoy in March 2021 proposed cutting $160 billion in predicted losses over the next decade, <a href=\"https://about.usps.com/what/strategic-plans/delivering-for-america/assets/USPS_Delivering-For-America.pdf#:~:text=The%20Plan%E2%80%99s%20strategic%20initiatives%20are%20designed%20to%20reverse,next%20ten%20years%20by%20achieving%20break-even%20operating%20performance\" data-type=\"url\" class=\"tr-link\" translate=\"no\">which included</a> financial reforms in the House bill. USPS also adopted new delivery standards <a href=\"https://www.reuters.com/world/us/slower-us-mail-standards-take-effect-friday-2021-09-29\" data-type=\"url\" class=\"tr-link\" translate=\"no\">in October</a> that slow some first-class mail deliveries.</p><p>The bill requires USPS to maintain six-day a week mail deliveries and develop an online weekly performance data dashboard by zip code, and expands special rates for local newspaper distribution.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by David Shepardson; Editing by Stephen Coates)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:David.Shepardson@thomsonreuters.com\" data-type=\"email\" translate=\"no\">David.Shepardson@thomsonreuters.com</a> ; 2028988324; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: USA-POSTAL SERVICE/CONGRESS</p></div>"}