{"date": "2021-11-23 15:11:39.438000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>NEXTECH AR SOLUTIONS CORP (\"NTAR-Z;NEXCF-0\")\n- Appoints Jeff Dawley To Its Board Of Directors And As Chair Of\n- The Audit Committee\n\n  Nextech AR Solutions Corp. (\"Nextech\" or the \"Company\"), a Metaverse\nCompany and leading provider of augmented reality (\"AR\") experience\ntechnologies and services is pleased to announce that it has appointed Jeff\nDawley to the Company's Board of Directors and as the Chair of the Audit\nCommittee.\n\n  Mr. Dawley holds a Chartered Professional Accountant designation from\nOntario, Canada, a Certified Public Accountant and Certified Information\nTechnology Professional designation from Illinois, USA and a Chartered\nGlobal Management Accountant designation, recognized in the UK and USA.\n\n  Jeff Dawley commented on his appointment, \"I'm looking forward to joining\nNextech AR during such an exciting time of growth for the Company and the\naugmented reality industry as a whole. With decades of experience in\nfinancial services, compliance and cybersecurity, I will help guide the\ncompany while it continues to execute on its long-term initiative.\"\n\n  Evan Gappelberg, CEO of Nextech AR commented, \"We are pleased to have\nJeff as the Chair of the Audit Committee for Nextech, and to utilize his\nextensive technology experience and financial background to fuel the\nongoing growth of our company. Our Company is in a transformative period of\ngrowth as we push towards the Metaverse, and his experience in particular\nwith start-ups like ourselves, will assist us in reaching our ultimate\nvision. On behalf of Nextech, I would like to welcome him to the team and\nthe Company looks forward to his leadership.\"\n\n  About Jeff Dawley:In 2018, Jeff co-founded Cybersecurity Compliance Corp.\nto address a communication gap in the cybersecurity space. The\nCybersecurity Pulse(TM) solution provides board members and non-IT\nexecutives with a complete view of their cybersecurity environment, while\nequipping IT professionals with a framework-based assessment and roadmap\nfor future improvements.\n\n  Before devoting his career to helping SMEs better understand their\ncybersecurity environment Jeff worked in finance and technology across a\nbroad spectrum of Canadian and international organizations. Over 25 years\nJeff has benefited from exploring many industries including financial\nservices, mining, information processing, manufacturing and professional\nservices. His career has seen him operate as a CFO for 10 years with both\npublicly listed and private companies, as well as 5 years as a CTO/CIO,\nresponsible for all aspects of information management and technology.\n\n  Jeff was honored with the award of Business Person of the Year 2020 by\nthe Whitby Chamber of Commerce, and Cybersecurity Educator of the Year -\nNorth America 2020 by the Cybersecurity Excellence Awards.\n\n  To learn more, please follow us on Twitter, YouTube, Instagram, LinkedIn,\nand Facebook, or visit our website: <a href=\"https://www.Nextechar.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.Nextechar.com</a>.\n\n  About Nextech ARNextech AR Solutions is a Metaverse company that develops\nand operates augmented reality (\"AR\") platforms, transporting\nthree-dimensional (\"3D\") product visualizations, human holograms and 360\nportals to its audiences altering e-commerce, digital advertising, hybrid\nvirtual events (events held in a digital format blended with in-person\nattendance) and learning and training experiences.\n\n  Nextech focuses on developing AR solutions for the Metaverse, however\nmost of the Company's revenues are derived from three e-Commerce platforms:\nvacuumcleanermarket.com (\"VCM\"), infinitepetlife.com (\"IPL\") and\nTrulyfesupplements.com (\"TruLyfe\"). VCM and product sales of residential\nvacuums, supplies and parts, and small home appliances sold on Amazon.\n\n  Forward-looking StatementsThe CSE and the NEO have not reviewed and do\nnot accept responsibility for the adequacy or accuracy of this release.\n\n  Certain information contained herein may constitute \"forward-looking\ninformation\" under Canadian securities legislation. Generally,\nforward-looking information can be identified by the use of forward-looking\nterminology such as, \"will be\" or variations of such words and phrases or\nstatements that certain actions, events or results \"will\" occur.\nForward-looking statements regarding the completion of the transaction are\nsubject to known and unknown risks, uncertainties and other factors. There\ncan be no assurance that such statements will prove to be accurate, as\nfuture events could differ materially from those anticipated in such\nstatements. Accordingly, readers should not place undue reliance on\nforward-looking statements and forward-looking information. Nextech will\nnot update any forward-looking statements or forward-looking information\nthat are incorporated by reference herein, except as required by applicable\nsecurities laws.\n\nOn behalf of the Board of Nextech AR Solutions Corp.\nEvan Gappelberg\nCEO and Director\ninfo@nextechar.com\n866-274-8493\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132600224.MNPRE2132601497-06520020211123</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}