{"date": "2022-01-25 13:00:01.307000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>TYSONS CORNER, Va., Jan.  25, 2022  (GLOBE NEWSWIRE) -- stackArmor, Inc., a leading provider of FedRAMP, FISMA, CMMC and StateRAMP compliance acceleration solutions on Amazon Web Services, Inc. (AWS), government centric security and compliance, today announced that it has collaborated with Red Hat to accelerate the FedRAMP Authority To Operate (ATO) project for Red Hat OpenShift Service on AWS (ROSA). stackArmor's FASTTR on AWS offering helps to reduce the time and cost of ATO projects through automation, standardization, and integration with the National Institute of Standards and Technology (NIST) Open Security Controls Assessment Language (OSCAL).  </p>   <p>Red Hat OpenShift is the industry-leading enterprise Kubernetes platform that enables developers to increase productivity and support application portability through containers. Organizations and industries are accelerating application development projects using cloud services such as Red Hat OpenShift Service on AWS (ROSA), the jointly operated and supported cloud service from Red Hat and AWS. Customers in regulated markets, especially U.S. government agencies, state and local governments and the Department of Defense, require a FedRAMP accreditation or ATO. </p>   <p>\"The FASTTR initiative created under the Authority to Operate on AWS Program, is an AWS Partner-focused process established to reduce the time and cost associated with achieving compliance certifications that can significantly stall efforts to migrate to the cloud,\" said Jeff Kratz, Vice President, Worldwide Public Sector Partners and Programs, AWS. \"With Red Hat leveraging FASTTR on AWS to achieve FedRAMP ATO, we can help meet the increased interest in Red Hat OpenShift Service on AWS (ROSA), which can accelerate cloud-native developments while considering security, regulatory and compliance requirements.\"</p>   <p>The FASTTR on AWS offering was developed by stackArmor to accelerate FedRAMP, FISMA, and CMMC ATOs for customers in hyper-regulated markets. FASTTR, stands for Faster ATO with Splunk, Telos and ThreatAlert® for Regulated Markets, enhances stackArmor's ThreatAlert® ATO Accelerator with Telos' Xacta360 for security compliance &amp; OSCAL automation and Splunk for security information and event management. </p>   <p>\"Helping customers address their security and compliance requirements while speeding cloud-native development and modernization efforts is essential,\" said Clara Conti, vice president and general manager, North American Public Sector, Red Hat.  \"We are pleased to collaborate with stackArmor to help us accelerate the FedRAMP ATO for Red Hat OpenShift Service on AWS GovCloud offering.\"<br/> </p>   <p><strong>About stackArmor FASTTR on AWS </strong><br/>The unique combination of cyber-engineering, compliance automation with NIST OSCAL and continuous monitoring services delivered \"in-boundary\" within an AWS Landing Zone ensure rapid compliance. The FASTTR on AWS offering is tailored for AWS GovCloud (US) and AWS US Commercial regions (East/West) that offer FedRAMP and DOD accredited cloud services and cloud-native security services.  The offering supports FedRAMP High, Moderate, and Low; DOD CC SRG IL2, IL4, and IL5; and CMMC Level 3, Level 4 and Level 5, including CUI compliance. Other compliance frameworks such as MARS-E 2.0, IRS 1075, HIPAA, SOC2 and emerging standards like StateRAMP are supported by mapping to NIST SP 800-53 security controls. Organizations can select and tailor their AWS cloud hosting environment with EC2-based, container or serverless components. All ThreatAlert® ATO services are audit-ready and fully compliant with Federal and Defense security standards such as FIPS, CIS benchmarks and DISA STIG's. The solution is available through the AWS Marketplace and a variety of Government procurement vehicles.</p>   <p>Interested in pursuing an ATO project and learning more about FASTTR on AWS, click <a href=\"https://www.globenewswire.com/Tracker?data=VHPL7gpEhgvhWiWcM_wRONbYbnI4b8p5JBZtZcT2oOiHeXX9-odEcLXm_glNqB5PT6QYq3msdgB7a5q2sKIOyg==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a> to connect.<br/> </p>   <p>stackArmor Media Contact<br/>Amreen Hamirani<br/>Email: amreen@stackArmor.com  <br/>###</p>   <p>Red Hat, the Red Hat logo and OpenShift are trademarks or registered trademarks of Red Hat, Inc. or its subsidiaries in the U.S. and other countries.</p>     <p>  This content was issued through the <a href=\"https://www.globenewswire.com/Tracker?data=7zEhVzNTCWCXu-7u9KcgnocyoMYGyJg2MMqG80o0_JwoHPSgs7ABwJHzkagp21xn2SUPVvyw4gzF5SoMbBtAEkuLq6BZdw-7h4hlk3glw_4C3bYwJcNXv9wRA2VOdBGRcuftM10pUjF2SXug712XVw==\" data-type=\"url\" class=\"tr-link\" translate=\"no\">press release distribution service at Newswire.com</a>. </p>  <div class=\"tr-image\"><div class=\"tr-image-components\"><img class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=ODQ2MjQ2NiM0NjkxNjEyIzIxODAyNDc=\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly93d3cuZ2xvYmVuZXdzd2lyZS5jb20vbmV3c3Jvb20vdGk/bmY9T0RRMk1qUTJOaU0wTmpreE5qRXlJekl4T0RBeU5EYz0=&amp;key=9b967aab4abf3e803613bb039cb82bf28118c4abe5be241179b67561a003cae440e19392dfdfe0b52f6a18636099f182cb1306ddfde4167329794d27045bb69f\"/></div></div> <br/><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://ml.globenewswire.com/media/MjRhZjZlZjUtNDZiZC00YjM0LTk3MjQtYzE2NjhlYTIxY2NkLTExOTE4MTY=/tiny/stackArmor.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbC5nbG9iZW5ld3N3aXJlLmNvbS9tZWRpYS9NalJoWmpabFpqVXRORFppWkMwMFlqTTBMVGszTWpRdFl6RTJOamhsWVRJeFkyTmtMVEV4T1RFNE1UWT0vdGlueS9zdGFja0FybW9yLnBuZw==&amp;key=f60ed7c6dc3dfd3b9ea00d718983547c5d2943fb48ef2fc1a170feeb20a6bd8a09d4e6151887693b898f04f7831df7365b5b2eb94fc692ce11379f38cfa6b9cd\"/></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright GlobeNewswire, Inc. 2022</p></div>"}