{"date": "2022-01-17 12:01:26+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n        When I run out of one of my favorite household products, I visit Amazon's website. There, I search for the item I need, add it to my cart, and head to \"Check Out\".\n      </p>\n      Then, I'm prompted to begin processing my order by filling out my shipping, billing, and payment details. Once complete, the order continues processing or working its way through the <span>order to cash cycle (O2C) <span>- also known as the <span>order to cash process <span>- while I go about my daily activities.</span></span></span></span><h4>\n        What is O2C?\n      </h4><div><h4>\n          Order to Cash Cycle\n        </h4><div><p>\n            The order to cash cycle, often abbreviated to O2C or OTC, is how your business receives, processes, manages, and completes customer orders. This means handling all aspects of the sale including shipping the items, collecting the payment, creating invoices, and reporting on the end-to-end process. The OTC impacts your bottom line and relationships with your customers, so the process must be well-optimized.\n          </p></div></div><h4>\n        Why is the order to cash process important?\n      </h4><p>\n        The order to cash cycle is a critical part of how your business functions - it impacts your revenue, interactions with your customers, customer retention rates, and overall growth. Here are some specific examples that explain the importance of the order to cash cycle.\n      </p><p>\n        By optimizing the order to cash cycle, you can:\n      </p><ul class=\"bulleted-list arrowlist\"><li>\n          Streamline the buying process for your customers\n        </li><li>\n          Reduce order-to-fulfillment time for your customers\n        </li><li>\n          Minimize the need for customer support rep intervention\n        </li><li>\n          Fulfill orders accurately the first time they're placed\n        </li><li>\n          Fulfill orders in a timely fashion for customers\n        </li><li>\n          Ensure a quick conversion of receivables and collections for customers\n        </li><li>\n          Avoid order and form information re-entry\n        </li><li>\n          Prove to customers your business is professional and you value their time\n        </li><li>\n          Avoid backorders and make sure you have enough product\n        </li><li>\n          Improve your data reporting and accuracy of records over time\n        </li></ul><p>\n        Now that you have a better understanding of the reasons why you should prioritize your OTC cycle, let's look into the seven steps within this process and what each entails.\n      </p><h4>\n        Order to Cash Process\n      </h4><p>\n        Before we dive into what the seven steps in the order to cash cycle are, take a look at this visual to get a better idea of what the process looks like.\n      </p><div><h4>\n          Order to Cash Process Steps\n        </h4></div><h4>\n        1. Receive Order\n      </h4><p>\n        The moment an order is placed, your online <a href=\"https://www.shopify.com/enterprise/order-management-system-oms\" data-type=\"url\" class=\"tr-link\" translate=\"no\">order management system</a> (OMS) - such as <a href=\"https://ecosystem.hubspot.com/marketplace/apps/marketing/ecommerce/shopify?_ga=2.131283855.1813074168.1576179987-1675356138.1572978608\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Shopify</a> or <a href=\"https://ecosystem.hubspot.com/marketplace/apps/marketing/ecommerce/makewebbetter?_ga=2.131283855.1813074168.1576179987-1675356138.1572978608\" data-type=\"url\" class=\"tr-link\" translate=\"no\">WooCommerce</a> - will notify you.\n      </p><p>\n        Depending on your OMS, specific people, teams, and systems will be notified about an order as soon as it's submitted by a customer. Then, the rest of the order to cash process can begin.\n      </p><p><strong>Note</strong>: Your OMS may connect with your CRM (similar to how Shopify and WooCommerce integrate with the <a href=\"https://www.hubspot.com/products/crm?_ga=2.131283855.1813074168.1576179987-1675356138.1572978608\" data-type=\"url\" class=\"tr-link\" translate=\"no\">HubSpot CRM</a>). This allows you to manage all customer-facing aspects of your business from a central location.\n      </p><h4>\n        2. Manage Customer Payment\n      </h4><p>\n        Next, manage your customer's payment based on the method they chose to use (e.g. credit, debit, PayPal).\n      </p><p>\n        Your ecommerce system will help you manage this part of the process as well - when the customer places the order, the system will automatically send the payment through an approval process. The system will accept or deny payment and then move onto fulfillment, if and when it's approved.\n      </p><p><strong>Note</strong>: Typically, new customers will go through the payment approval or denial process while returning customers will move straight to fulfillment because their data is already stored in the system.\n      </p><p>\n        If for some reason a new or returning customer is denied, a member of your team will likely have to reach out to the customer to correct the issue.\n      </p><p>\n        Your system may also automatically send a prompt to the customer so they can input their information again (if the issue is as simple as needing to re-enter details like a credit card number).\n      </p><h4>\n        3. Fulfill Order\n      </h4><p>\n        Next, it's time to fulfill the order - meaning, locate and prepare the item for the customer who purchased it. This should be done with the assistance of your <a href=\"https://blog.hubspot.com/marketing/inventory-management?_ga=2.131283855.1813074168.1576179987-1675356138.1572978608\" data-type=\"url\" class=\"tr-link\" translate=\"no\">inventory management system</a>.\n      </p><p>\n        (Most order management software has inventory management included in the system, similar to the way <a href=\"https://www.shopify.com/inventory-management\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Shopify</a> and <a href=\"https://woocommerce.com/product-category/woocommerce-extensions/shipping-methods/inventory-fulfillment/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">WooCommerce</a> do.) This allows you to keep track of your inventory in real-time without having to count or sort manually.\n      </p><p>\n        Inventory management systems help you fulfill orders accurately for customers as well as keep track of your inventory records and data.\n      </p><p>\n        For example, this type of system will help you know when you're running low on specific items so you can avoid products going on backorder.\n      </p><h4>\n        4. Ship Order to Customer\n      </h4><p>\n        Ship the order to your customer in a timely fashion so they receive it by the date you promised. Whether you do so manually or in an automated way, make sure your package is prepared for shipment using your fulfillment details to guarantee the right item is going to the correct address.\n      </p><p>\n        By doing so, the shipment will be sent both professionally and efficiently. Your order and inventory management system will make a record of the shipment for future reference and reporting.\n      </p><h4>\n        5. Create the Invoice\n      </h4><p>\n        Customer invoicing is a crucial part of this cycle to get right. A customer invoice is a document that states the items purchased and the price at which those items were sold to a customer.\n      </p><p>\n        Creating an invoice for each purchase and order is how you keep track of what's paid for and shipped to avoid monetary discrepancies.\n      </p><p><a href=\"https://blog.hubspot.com/marketing/how-to-create-invoicing-process?_ga=2.131283855.1813074168.1576179987-1675356138.1572978608\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Invoicing</a> software will help you with this step - a system, such as <a href=\"https://quickbooks.intuit.com/online/advanced/?cid=DIS_US_CAM_QBMM-MID-FY20-Subscription-US-CAM_QBOAV_Capterra_255707358_121530153&amp;dclid=CPbroOShq-YCFdDT4QodpW4EOw\" data-type=\"url\" class=\"tr-link\" translate=\"no\">QuickBooks</a>, might be included in your order management software depending on which one you have (<a href=\"https://www.shopify.com/invoice\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Shopify</a>, for example, comes with its own <a href=\"https://blog.appsumo.com/quickbooks-alternative/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">invoicing system</a>).\n      </p><p>\n        This way, your invoices will include all necessary information such as items purchased, payment details, order date, and shipping address. Invoices are also important for your business's accounts receivables team. These employees can review the invoices and flag anything that appears to be problematic.\n      </p><p>\n        An example would be a payment delay - upon identifying one, a rep can contact the associated customer and take the necessary steps to mitigate the issue.\n      </p><h4>\n        6. Collect Payment\n      </h4><p>\n        Next, it's time to ensure a smooth collection of your customer's payment.\n      </p><p>\n        Assuming everything goes accordingly, this step of the cycle should be automated by your order management and invoicing systems - meaning, the customer's form of payment should automatically process as stated on the invoice.\n      </p><p>\n        Then, your business can confirm the sale (and receipt of the money that came from that sale) via your order management system.\n      </p><p>\n        If there's an issue of any kind with collection of payment - such as delayed payment or complete lack of payment due to an error that occurred after invoicing - your accounts receivables team should reach out to the customer.\n      </p><p>\n        Depending on the situation, they might explain the necessary procedures to correct the payment issue. Depending on the severity of the situation, they may also review penalties the customer could be subject to in the future.\n      </p><h4>\n        Order to Cash Process Tool: <a href=\"https://www.hubspot.com/products/payments\" data-type=\"url\" class=\"tr-link\" translate=\"no\">HubSpot Payments</a></h4><p>\n        HubSpot Payments helps with the order to cash process in a number of ways. This is especially true for businesses that are looking to manage subscription memberships.\n      </p><p>\n        It allows you to create and share a quote that includes a recurring payment link - this way, your prospect can immediately transact.\n      </p><p>\n        The tool also integrates with your <a href=\"https://www.hubspot.com/products/crm?hubs_post=blog.hubspot.com/sales/recurring-payments&amp;hubs_post-cta=CRM\" data-type=\"url\" class=\"tr-link\" translate=\"no\">CRM</a> so you can use connected data to offer buying experiences that are tailored to individual customers.\n      </p><p><span>Price:</span><span>HubSpot payments is currently in beta and only available in the US premium editions of HubSpot, with advanced functionality in Sales Hub for quotes.</span></p><p><span><span>Pro Tip: <a href=\"https://www.hubspot.com/products/payments?hubs_post=blog.hubspot.com/sales/recurring-payments&amp;hubs_post-cta=Use%20HubSpot%20Payments%20to%20send%20quotes%20with%20recurring%20payment%20links%20to%20prospects%20so%20they%20can%20transact%20at%20that%20exact%20moment.%C2%A0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Use HubSpot Payments to send quotes with recurring payment links to prospects so they can transact at that exact moment.</a></span></span></p><h4>\n        7. Report and Analyze\n      </h4><p>\n        Lastly, you'll want to report on all data related to your OTC. Your automated order and invoicing systems make this simple because they already manage all data about your sales, orders, and customers.\n      </p><p>\n        By analyzing OTC process data, your business can determine how well your cycle is optimized as well as its impact on revenue and customers.\n      </p><p>\n        Additionally, when you review this information frequently, you can identify inefficiencies in your process before they snowball. You'll be able to identify and capitalize on the successful parts of your cycle.\n      </p><p>\n        This way, you'll make sure you're consistently accurately fulfilling and shipping orders on time for your customers and maximizing your profits.\n      </p><h4>\n        Optimize Your Order to Cash Cycle\n      </h4><p>\n        Without a streamlined OTC cycle, you jeopardize your ability to meet the needs of your customers. This has the potential to negatively impact your business's growth and revenue - and who wants that?\n      </p><p>\n        So, consider the various steps in this process and work to optimize them in a way that works for your specific business, product or service, and base of customers.\n      </p><p><span>Editor's note: This post was originally published in December 2019 and has been updated for comprehensiveness.</span></p><div><p>\n        Originally published Jan 17, 2022 7:00:00 AM, updated January 17 2022\n      </p><div><h4>\n          Don't forget to share this post!\n        </h4></div></div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://blog.hubspot.com/sales/order-to-cash-cycle\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>HubSpot Inc.</strong> published this content on <strong>17 January 2022</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>17 January 2022 12:01:26 UTC</strong></p>\n              </div>\n            </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2022 - HubSpot Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: HubSpot-Inc.</p></div>"}