{"date": "2021-11-26 12:41:28.483000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3580.41, "close": 3561.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>BLENDER BITES LTD (\"BITE-Z\")\n- Appoints former Vega VP, Mark Wilson and Ener-C Co-Founder,\n- Richard Pollock, to Advisory Board\n\n     Blender Bites Ltd. (the \"Company\", \"Blender Bites\" or \"Blender\"), a\nCanadian company involved in the development and marketing of a line of\nfrozen premium organic and plant-based pre-portioned frozen smoothie pucks,\nis pleased to announce the appointment of Mark Wilson, former VP at Vega\nFoods, and Mr. Richard Pollock, Co-founder of Pauling Labs and the brand\nEner-C Vitamins, to the Company's Advisory Board.\n\n     About Mark Wilson\n\n     Mr. Wilson joins Blender's Advisory Board with over 25 year's\nexperience in supply chain operations management. Mark is the former Vice\nPresident - Operations of VEGA, a leading North American plant-based,\nnutritional supplement company. Mark led all aspects of the company's\nSupply Chain, Quality, and Research and Development Operations from the\nearly days as a smaller Canadian player with $10M in sales to an\ninternational company selling over $200M USD annually. The growth of the\ncompany saw Mark architect a completely new manufacturing and distribution\nstructure with four times the manufacturing partners, twice the number of\ndistribution centers, and supporting rapid growth in new product\ndevelopment. Mark was also an integral player in supporting the company\nthrough a highly successful strategic sale to Whitewave Foods for $550M USD\nin 2015.\n\n     Following his success at Vega, Mark founded his own Supply Chain\nOperations consulting firm called Wilson Management Group Ltd, where he and\nhis team advise companies in developing and deploying their procurement,\npurchasing, manufacturing, logistics, distribution, research &amp; development,\nregulatory, and quality control programs. Mark focuses his firm's efforts\non primarily smaller to medium sized nutrition and supplement companies who\nare experiencing explosive growth often in partnership with leading private\nequity organizations.\n\n     \"Supply chain management and logistics is an aspect to Company\noperations that cannot be underestimated,\" stated Chelsie Hodge, CEO of\nBlender Bites. \"The ability to streamline the operational processes of\nplanning, sourcing, producing, and delivering quality well-timed products\nwill be crucial in executing our rapid growth and expansion plans. The\ntiming of Mark's appointment to the Advisory Board will allow Blender Bites\nto capitalize on his extensive knowledge and experience at an early stage\nof our growth development, maximize customer value, and gain a competitive\nadvantage in the marketplace, in a relatively short period. Mark's\nexpertise in this area will be invaluable, and we are honoured to have him\nas the newest member of our 'team'\".\n\n     About Richard Pollock\n\n     A perennial entrepreneur with multiple exits, Richard co-founded\nPauling Labs-and the brand Ener-C-in 2014. Ener-C experienced significant\nglobal growth in its first three years of business and is currently one of\nthe fastest growing supplement brands in North America. Ener-C is currently\ndistributed in 15,000+ retail locations in Canada, US, England, Greece,\nCypress, Ukraine, UAE, Australia, Singapore, Hong Kong, and the Caribbean.\n\n     In 1999, Richard founded Vitascorb Supplements and acquired the\nlicense for the brand Emergen-C(TM) in Canada. Vitascorb was acquired by\nPfizer Inc. in 2012. Since 2012 Richard has actively invested and sat on\nthe board of several CPG companies that have either transacted or continue\nto operate today.\n\n     \"I am extremely pleased to welcome Richard to our advisory board. His\nexperience building and leading companies from inception speaks for itself\nand will provide a deep pool of invaluable knowledge upon which to dive, as\nour team ramps up our expansion and brand recognition endeavours. I look\nforward to working with Richard, and on behalf of the entire Blender team,\nwelcome him to the 'team',\"commented Chelsie Hodge.\n\n     About Blender Bites\n\n     Blender Bites is a Canadian company involved in the development and\nmarketing of a line of premium frozen food products with a focus on\nfunctionality. Blender Bites was founded in 2016 and was first to market in\nWestern Canada with a pre-portioned \"easy smoothie\" product that is free of\nany unnecessary inner plastic packaging. Blender Bites products are\ncertified organic, vegan, non-GMO, gluten free, dairy free and soy free.\nThey contain no added sugars and are made in Canada. Blender Bites products\nare distributed internationally across Canada and the US, and are currently\nsold in over 900 stores, including Loblaws, Real Canadian Superstore,\nSobeys, Safeway, Save on Foods, Thrifty Foods, Whole Foods Market, and\nselect Ontario club stores.\n\n     On behalf of the Board of Directors,\n     Blender Bites Limited\n\n     Chelsie Hodge, Chief Executive Officer\n\n     For further information, contact Blender IR Team at:\n\n     Email - investors@blenderbites.com\n     Telephone - 1-888-997-2055\n\n     CAUTIONARY DISCLAIMER STATEMENT\n\n     This news release includes certain \"forward-looking statements\" under\napplicable Canadian securities legislation. Forward-looking statements are\nnecessarily based upon a number of estimates and assumptions that, while\nconsidered reasonable, are subject to known and unknown risks,\nuncertainties, and other factors which may cause the actual results and\nfuture events to differ materially from those expressed or implied by such\nforward looking statements. Such factors include, but are not limited to\ngeneral business, economic, competitive, political and social\nuncertainties, and uncertain capital markets. Readers are cautioned that\nactual results and future events could differ materially from those\nanticipated in such statements. Accordingly, readers should not place undue\nreliance on forward-looking statements. The Company disclaims any intention\nor obligation to update or revise any forward-looking statements, whether\nas a result of new information, future events or otherwise, except as\nrequired by law.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132900021.MNPRE2132900335-04134420211126</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}