{"date": "2021-12-15 03:30:28.615000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">BANGALORE, India, Dec. 15, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">BANGALORE, India</span>, <span class=\"xn-chron\">Dec. 15, 2021</span> /PRNewswire/ -- <a href=\"https://www.flutura.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Flutura Decision Sciences and Analytics</a> announced today that it has achieved Amazon Web Services (AWS) Energy Competency status. This designation recognizes that Flutura has demonstrated deep expertise helping customers leverage AWS to build, implement, and integrate technology to enable the transformation of complex business and operational systems.</p>\n<div id=\"prni_dvprnejpg2aa1left\" style=\"WIDTH:100%;TEXT-ALIGN:left\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img align=\"middle\" alt=\"Flutura Achieves AWS Energy Competency Status\" border=\"0\" id=\"prnejpg2aa1left\" src=\"https://mma.prnewswire.com/media/1709490/Flutura_AWS.jpg\" title=\"Flutura Achieves AWS Energy Competency Status\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMTcwOTQ5MC9GbHV0dXJhX0FXUy5qcGc=&amp;key=56a0fe26d936a6a7deddf4388c70bb82a36abac539898cdfb04024e5b5071241864326c9046f079c3528abee6ca8c4cf0f24ab26e83b456ae7157cb95e4fcfb7\"/></div></div></div><p>AWS is enabling scalable, flexible, and cost-effective solutions from startups to global enterprises. To support the seamless integration and deployment of these solutions, AWS established the <a href=\"https://aws.amazon.com/partners/competencies/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Competency Program</a> to help customers identify AWS Partners with deep industry experience and expertise.</p>\n<p>Achieving the AWS Energy Competency differentiates Flutura as an AWS Partner with demonstrated AWS technical expertise and proven customer success in the energy industry. Flutura has developed industrial artificial intelligence (AI) solutions across the value chain, from production operations and optimization to commodities trading, new energy solutions, and more. The advanced AI solutions provide improved situational awareness, enabling the operators to reduce production deferment and cost per barrel.</p>\n<p>To receive the AWS Energy Competency Partner status, AWS Partners undergo a rigorous technical validation process, including a customer reference audit. The AWS Energy Competency provides energy customers the ability to more easily select skilled partners to help accelerate their digital transformations with confidence.</p>\n<p>Flutura's flagship Industrial AI product, Cerebra, has been field tested for 10 years and has proven to be a hyper-scalable solution achieving uptime and operational excellence in a sustainable manner, securing Net Zero outcomes for Energy, Process Manufacturing and Heavy Machinery industries. In the oil and gas industry, Cerebra empowers both OEM and end operators with last-mile visibility giving access to job performance information, equipment intelligence, historical trending, comparative analysis, in near real-time. Flutura built Cerebra using AWS, making it a highly scalable and integrable solution for customer, a leading technology provider for Oil and Gas, to improve operational efficiency, reduce costs, and mitigate Green House Gas (GHG) emissions.</p>\n<p>\"It is a proud moment for Flutura to achieve AWS Energy Competency status. The need to reduce emissions and go green is becoming increasingly important for customers. Our collaboration with AWS will enable us to help our customers improve their productivity, reduce downtime, and reach their net zero greenhouse gas targets,\" said <span class=\"xn-person\">Srikanth Muralidhara</span>, Co-founder &amp; Chief Customer Officer at Flutura. \"Our team is dedicated to helping companies achieve their technology and sustainability goals by leveraging AWS services, enabling companies to become more agile and innovative.\"</p>\n<p>About <a href=\"http://www.flutura.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Flutura</a></p>\n<p>Flutura is an Industrial AI company that helps large-scale industrial facilities to achieve two core business objectives of Asset Uptime and Operational Excellence. Flutura's flagship AI product Cerebra achieves best operational performance by impacting the yield, uptime and NetZero outcomes making it a strategic choice for some of the largest companies in the Energy, Process Manufacturing, Automotive and Heavy Machinery industries. Flutura is rated #1 (4.7/5) in the Gartner Peer Insight Voice of Customer report making it an industry preferred one. The company has consistently taken a spot at Gartner Magic Quadrant for 4 years in a row.</p>\n<p>Flutura's vision is to unlock <span class=\"xn-money\">1 billion dollars</span> for their customers by 2024 and empower 100,000 engineers by enabling reliable and timely decisions.</p>\n<p>Contact Details: <br/>+1 832 804 9139 <br/><a href=\"mailto:websales@fluturasolutions.com\" data-type=\"email\" translate=\"no\">websales@fluturasolutions.com</a> <br/>Flutura Decision Science &amp; Analytics</p>\n<div id=\"prni_dvprnejpg7b5dleft\" style=\"WIDTH:100%;TEXT-ALIGN:left\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img align=\"middle\" alt=\"Flutura Business Solutions Pvt Ltd\" border=\"0\" id=\"prnejpg7b5dleft\" src=\"https://mma.prnewswire.com/media/1511688/Flutura_Logo.jpg\" title=\"Flutura Business Solutions Pvt Ltd\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMTUxMTY4OC9GbHV0dXJhX0xvZ28uanBn&amp;key=8ba6bf79590ff9fbcb172220bba506dcc73c6b03b7a11d5fa4076818fa80c86edbc4060e526585194f4689a28d044fcca9471651d523f03cc0c26aab20813000\"/></div></div></div><p>Photo: <a href=\"https://mma.prnewswire.com/media/1709490/Flutura_AWS.jpg\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://mma.prnewswire.com/media/1709490/Flutura_AWS.jpg</a> </p>\n<p>Logo: <a href=\"https://mma.prnewswire.com/media/1511688/Flutura_Logo.jpg\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://mma.prnewswire.com/media/1511688/Flutura_Logo.jpg</a> </p>\n</div>\n<div class=\"tr-image\"><div class=\"tr-image-components\"></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p></div>"}