{"date": "2022-01-20 15:11:10.529000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>FOUNDER SPAC (\"FOUN-Q\")\n- RUBICONSmartCity(TM) Featured in New Amazon Documentary Series\n\n     RUBICONSmartCity(TM), the cutting edge software and technology\nplatform from Rubicon Technologies, LLC (\"Rubicon\" or the \"Company\"), an\ninnovative software leader that provides smart waste and recycling\nsolutions for businesses and governments worldwide, is featured in a new\ndocumentary series produced by Amazon.\n\n     The four-part series, titled Climate Next, is focused on a selection\nof Amazon Web Services (AWS) partners using AWS cloud technology to drive\ninnovation and enable their sustainability efforts. The episode featuring\nRubicon explores the Company's partnership with the City of Santa Fe, New\nMexico, in which it has helped the city improve the performance of its\nwaste, recycling, and sustainability operations.\n\n     Santa Fe leverages RUBICONSmartCity, a proprietary, cloud-based\ntechnology suite that helps city governments run more efficient, effective,\nand sustainable operations. In turn, Rubicon uses AWS cloud services\nincluding Amazon CloudWatch, Amazon RDS for SQL Server, and Amazon S3 to\npower its smart city solutions which are deployed in waste and recycling\ntrucks, effectively creating an Internet of Things-enabled waste collection\nfleet.\n\n     \"It is an honor to be featured in this ground-breaking documentary\nseries by Amazon,\" said Nate Morris, Founder and CEO of Rubicon. \"As one of\nRubicon's very first RUBICONSmartCity partners, the transformational work\nof the Santa Fe team proves that stories of environmental innovation can be\nfound anywhere and everywhere in our great country. Our growing partnership\nwith AWS helps us to deliver solutions to today's toughest waste and\nrecycling challenges, and to create a healthier, cleaner, and safer America\nfor all.\"\n\n     By working with Rubicon, Santa Fe has improved customer service for\ncity residents by reducing the number of missed pickups, optimizing\ncollection routes, eliminating paper route sheets, automating the tracking\nof customer issues, and saving taxpayer dollars through actions such as\nreducing fuel consumption and wear and tear on vehicles.\n\n     Each of Santa Fe's trash vehicles collects garbage and recycling from\nbetween 800 and 900 locations per day. Drivers carry a smartphone running\nRubicon's proprietary app which provides optimized collection routes and\nlive telematics information, and streams that data back to city\nheadquarters via the cloud. Managers and supervisors can track the service\nstatus at every home in the city, monitor route progress, and address\nissues in the field; all of which are essential insights for efficient\nprogram operations. Using cloud technology, RUBICONSmartCity is turning\nSanta Fe's fleet of garbage trucks into mobile data collection centers,\nenabling them to complete additional tasks such as detect potholes or\nidentify graffiti.\n\n     \"Rubicon has worked with us on new technology solutions that have\nhelped to redesign our waste and recycling operations, and move us toward\nmore efficient collections and better customer service,\" said Shirlene\nSitton, Environmental Services Division Director at the City of Santa Fe.\n\"These efficiencies will reduce our carbon emissions associated with\nservice delivery, moving us toward Santa Fe's goal of carbon neutrality by\n2040.\"\n\n     As seen with the partnership between Rubicon and Santa Fe, cloud\ntechnology can do much more than just modernize waste and recycling\nprograms. It empowers businesses, governments, and organizations of all\nkinds to streamline operations and work toward long term sustainability\ngoals, all the while saving money and improving the customer experience.\n\n     \"We are pleased to showcase the important and innovative work that\nRubicon has done with the City of Santa Fe to rethink waste collection,\ncreating a vastly better system for both constituents and collectors,\" said\nKim Majerus, Vice President, State and Local Government &amp; Education at\nAmazon Web Services. \"As governments around the country--and around the\nworld--evaluate how to innovate in a climate-friendly manner, the power of\nthe cloud will continue to be an invaluable tool in reimagining how we live\nand govern.\"\n\n     Watch Rubicon and Santa Fe's episode in Amazon's Climate Next\ndocumentary series, titled The Road to Zero Waste, here.\n\n     About Rubicon\n\n     Rubicon is a Lexington, Kentucky-based software platform that provides\nsmart waste and recycling solutions for businesses and governments\nworldwide. Creating a new industry standard by using technology to drive\nenvironmental innovation, the Company helps turn businesses into more\nsustainable enterprises, and neighborhoods into greener and smarter places\nto live and work. Rubicon's mission is to end waste. It helps its partners\nfind economic value in their waste streams and confidently execute on their\nsustainability goals. Learn more at Rubicon.com.\n\n     Rubicon previously announced an agreement for a business combination\nwith Founder SPAC (\"Founder\") (Nasdaq: FOUN), which is expected to result\nin Rubicon becoming a public company listed on the NYSE under the new\nticker symbol \"RBT\" in the second quarter of 2022, subject to customary\nclosing conditions.\n\n     About Founder SPAC\n\n     Investors and security holders will be able to obtain free copies of\nthe Registration Statement, the proxy statement / consent solicitation\nstatement / prospectus and all other relevant documents filed or that will\nbe filed with the SEC by Founder through the website maintained by the SEC\nat www.sec.gov.\n\n     The documents filed by Founder with the SEC also may be obtained free\nof charge at Founder's website at <a href=\"https://www.thefounderspac.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.thefounderspac.com</a> or upon\nwritten request to 800 Capital Street, Suite 2400, Houston, TX 77002.\n\n     NEITHER THE SEC NOR ANY STATE SECURITIES REGULATORY AGENCY HAS\nAPPROVED OR DISAPPROVED THE TRANSACTIONS DESCRIBED IN THIS PRESS RELEASE,\nPASSED UPON THE MERITS OR FAIRNESS OF THE BUSINESS COMBINATION OR RELATED\nTRANSACTIONS OR PASSED UPON THE ADEQUACY OR ACCURACY OF THE DISCLOSURE IN\nTHIS PRESS RELEASE. ANY REPRESENTATION TO THE CONTRARY CONSTITUTES A\nCRIMINAL OFFENSE.\n\n     Participants in the Solicitation\n\n     Founder and Rubicon and their respective directors and executive\nofficers may be deemed to be participants in the solicitation of proxies\nfrom Founder's shareholders in connection with the proposed transactions.\nFounder's shareholders and other interested persons may obtain, without\ncharge, more detailed information regarding the directors and executive\nofficers of Founder in the Registration Statement to be filed with the SEC.\nInformation regarding the persons who may, under SEC rules, be deemed\nparticipants in the solicitation of proxies from Founder's shareholders in\nconnection with the proposed business combination will be set forth in the\nRegistration Statement.\n\n     No Offer or Solicitation\n\n     This press release is not intended to and does not constitute an offer\nto sell or the solicitation of an offer to buy, sell or solicit any\nsecurities or any proxy, vote or approval, nor shall there be any sale of\nsecurities in any jurisdiction in which such offer, solicitation or sale\nwould be unlawful prior to registration or qualification under the\nsecurities laws of such jurisdiction. No offer of securities shall be\ndeemed to be made except by means of a prospectus meeting the requirements\nof Section 10 of the Securities Act.\n\nTel   : 713-651-2600    FOUNDER SPAC\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201900473.MNPRE2201901824-06582920220120</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}