{"date": "2021-12-07 23:20:01+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds details on outage</p><p class=\"tr-by\">By Eva  Mathews</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Dec 7 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>A major outage disrupted Amazon's cloud services on Tuesday, temporarily knocking out streaming platforms Netflix and Disney+, Robinhood, a wide range of apps and Amazon.com Inc's e-commerce website as consumers shopped ahead of Christmas.</p><p>\"Many services have already recovered, however we are working towards full recovery across services,\" Amazon said on its <a href=\"https://status.aws.amazon.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">status dashboard</a>.</p><p>Amazon's Ring security cameras, mobile banking app Chime and robot vacuum cleaner maker iRobot, that use Amazon Web Services (AWS), reported issues according to their social media pages.</p><p>Trading app Robinhood <a href=\"reuters://REALTIME/Verb=FullQuote/ric=HOOD.N\" data-type=\"ric\" data-ric=\"HOOD.N\" translate=\"no\" dir=\"ltr\">HOOD.N</a> and Walt Disney's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=DIS.N\" data-type=\"ric\" data-ric=\"DIS.N\" translate=\"no\" dir=\"ltr\">DIS.N</a> streaming service Disney+ and Netflix were also down, according to Downdetector.com.</p><p>\"Netflix which runs nearly all of its infrastructure on AWS appears to have lost 26% of its traffic,\" Doug Madory, head of internet analysis at analytics firm Kentik, said.</p><p>Amazon said the outage was related to network devices and linked to application programming interface, or API, which is a set of protocols for building and integrating application software.</p><p>Downdetector.com showed more than 24,000 incidents of people reporting issues with Amazon, including Prime Video and other services. The outage tracking website collates status reports from a number of sources, including user-submitted errors on its platform.</p><p>Users began reporting issues around 10:40 a.m. ET on Tuesday and the outage might have affected a larger number of users.</p><p>Amazon has experienced 27 outages over the past 12 months related to its services, according to web tool reviewing website ToolTester.</p><p>In June, websites including Reddit, Amazon, CNN, PayPal, Spotify, Al Jazeera Media Network and the New York Times were hit by a widespread hour-long outage linked to U.S.-based content delivery network provider Fastly Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FSLY.N\" data-type=\"ric\" data-ric=\"FSLY.N\" translate=\"no\" dir=\"ltr\">FSLY.N</a>, a smaller rival of AWS.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Eva Mathews in Bengaluru; Editing by Shounak Dasgupta)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Eva.Mathews@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Eva.Mathews@thomsonreuters.com</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-OUTAGES/ (UPDATE 5, PIX)</p></div>"}