{"date": "2021-11-23 17:24:06+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Recasts with government source information</p><p class=\"tr-by\">By Joan Faus</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">BARCELONA, Nov 23 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Spain will force streaming platforms, such as Netflix <a href=\"reuters://REALTIME/Verb=FullQuote/ric=NFLX.O\" data-type=\"ric\" data-ric=\"NFLX.O\" translate=\"no\" dir=\"ltr\">NFLX.O</a>, to air shows in regional languages and will impose sanctions if they do not comply under a law expected to be approved in 2022, an economy ministry source said on Tuesday.</p><p>Under the proposed law, at least 6% of the streaming platforms' catalogue must be in Spain's co-official languages - Catalan, Galician or Basque - and the platforms will have to assume the cost, the government source told a media briefing.</p><p>That quota would include, for example, original content in Catalan but it is unclear if content produced in Spanish and dubbed in Catalan would qualify, the source said, adding those details would be defined later.</p><p>The 6% threshold comes under a broader requirement that 30% of the platforms' content is produced in Europe, with 9% in Spanish</p><p>Spain's cabinet is set to rubber stamp the draft law in the coming weeks before sending it to parliament, where it is expected to be approved in 2022 and come into full force in 2023, the source said.  </p><p>The language quotas introduced in the law come in exchange for Catalan separatist party Esquerra Republicana de Catalunya's (ERC) critical support for Spain's leftist coalition government's 2022 budget bill, which will be voted this week.</p><p>ERC said earlier on Tuesday the audiovisual law would include a 5% tax on private platforms, but the government source said it did not have any information in that regard.  </p><p>Netflix did not respond to requests for comment.</p><p>The law will also require platforms to include content that has already been translated or subtitled in a regional Spanish language - for instance by a TV channel - but only if that is technically and financially possible, the economy ministry source said.</p><p><br/></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SPAIN-TAX/STREAMING (UPDATE 1)</p></div>"}