{"date": "2021-11-03 12:33:43.500000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Russian Federation : Elon Musk became the richest man in history. His fortune approached $ 300 billion Previously, Amazon founder Jeff Bezos was considered the richest man on Earth.</p><p>The American magazine Forbes recognized Elon Musk as the richest man in the entire existence of his own rating. The fortune of the founder of Tesla and SpaceX has reached a record $ 271.3 billion (about two trillion rubles at the current exchange rate). At the same time, the total capitalization of Musk's two American corporations exceeded a trillion dollars. In the prestigious rating of the financial publication, the owner of Tesla has surpassed Amazon founder Jeff Bezos.</p></div><div class=\"tr-npp-body\"><p>The bulk of Musk's fortune is 21 percent of Tesla shares. A few days ago, the electric car maker's shares rose 13 percent, bringing the American businessman $ 42 billion. This jump is due to a large order for 100,000 electric cars received from the Hertz car rental company. In addition, Musk owns a minority stake in SpaceX - the company is estimated at $ 74 billion.</p><p>Elon Musk has surpassed Amazon founder Jeff Bezos in the Forbes ranking, whose fortune is currently about $ 200 billion. However, Musk's fortune may be reduced due to tax tightening in the United States. If the US government passes the new bill, businessmen who earn more than $ 100 million a year will be required to pay higher taxes on the increased value of their stocks and bonds.</p><p>In early January, Elon Musk was already recognized as the richest man in the world. Then the head of Tesla took the leading position according to Bloomberg, again beating Jeff Bezos in the rating.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}