{"date": "2021-11-30 15:33:13.157000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>FACTSET RESEARCH SYSTEMS INC (\"FDS-N\")\n- Joins AWS Data Exchange\n\n     FactSet a global provider of integrated financial information,\nanalytical applications, and industry-leading service, announced that it\nhas joined Amazon Web Services (AWS) Data Exchange with a comprehensive\nfinancial data and analytics offering.\n\n     FactSet will deploy over 30 proprietary datasets available within the\nFactSet ecosystem on AWS Data Exchange, which will allow clients to\nleverage FactSet's leading content for faster, more efficient\ndecision-making. This data will be made available on AWS Data Exchange\nusing Amazon Redshift Data Sharing, which allows clients to securely and\neasily share live data across Amazon Redshift clusters. This ability will\nhelp clients connect proprietary and third-party content already housed on\nAmazon Redshift while simplifying the extract, transform, and load (ETL)\nprocess to reduce time-to-market and improve data integrity.\n\n     FactSet will also begin listing APIs that allow users to benefit from\nits industry leading portfolio analytics engine without having to be an\nexisting FactSet client. Furthermore, it plans to bring additional APIs to\nAWS Data Exchange to give clients flexible access to all FactSet content\nand functionality.\n\n     \"We are excited that FactSet is making its content available to\nclients via cloud data sharing services like AWS Data Exchange,\" said John\nChappell, Managing Director and Global Head of Market Data, Goldman Sachs.\n\"FactSet's work to embrace distribution of their data via the cloud aligns\nwith our strategy to accelerate the sourcing and use of third-party data,\nenabling our people to focus on tasks that create the most value for our\nbusiness and our clients.\"\n\n     \"FactSet is delighted to offer its data and solutions on AWS Data\nExchange,\" said Jonathan Reeve, Executive Vice President and Global Head of\nContent and Technology Solutions, FactSet. \"Our clients are accelerating\ntheir shifts to the cloud to reduce costs, consolidate infrastructure, and\neliminate the waste of duplicated data, and AWS is a leader in this space.\nFactSet's expansion of our data management services to support Amazon\nRedshift will make our content available to more clients in a streamlined\nway, improving workflow efficiency.\"\n\n     \"We launched AWS Data Exchange to help customers easily find,\nsubscribe to, and use third-party data in the cloud,\" said Samantha Gibson,\nWW Industries Lead for AWS Data Exchange, AWS. \"We're excited to work with\nFactSet, who is licensing their data via Amazon Redshift and Amazon API\nGateway, to give customers more delivery choices and make it even easier to\naccess the financial data and insights they need to make informed\ndecisions.\"\n\n     For more information, please visit:\n<a href=\"https://www.factset.com/marketplace/catalog/product/amazon-redshift\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.factset.com/marketplace/catalog/product/amazon-redshift</a>.\n\n     About FactSet\n\n     FactSet (NYSE:FDS | NASDAQ:FDS) delivers superior content, analytics,\nand flexible technology to help more than 160,000 users see and seize\nopportunity sooner. We give investment professionals the edge to outperform\nwith informed insights, workflow solutions across the portfolio lifecycle,\nand industry-leading support from dedicated specialists. We're proud to\nhave been recognized with multiple awards for our analytical and\ndata-driven solutions and repeatedly scored 100 by the Human Rights\nCampaign(R) Corporate Equality Index for our LGBTQ+ inclusive policies and\npractices. Subscribe to our thought leadership blog to get fresh insight\ndelivered daily at insight.factset.com. Learn more at www.factset.com and\nfollow us on Twitter: www.twitter.com/factset.\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133300388.MNPRE2133302302-07300620211130</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}