{"date": "2021-11-18 13:00:02.646000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwlistdisc{list-style-type:disc;}</style><p class=\"bwalignc\">\n<b>VMware Cross-Cloud Services Help Customers Run their Businesses Better in AWS</b>\n</p><p class=\"bwalignc\">\n<span>VMware Carbon Black Cloud and VMware Tanzu now available in AWS Marketplace</span>\n</p><p>\nVMware, Inc. (NYSE:VMW) is making it easier for Amazon Web Services (AWS) customers to purchase and deploy VMware Cross-Cloud services to support their AWS environments. VMware Cross-Cloud services help AWS customers drive digital innovation with enterprise control.\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: <a href=\"https://www.businesswire.com/news/home/20211118005471/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211118005471/en/</a></p><div id=\"bwbodyimg\" style=\"width:480px;float:left;padding-left:0px;padding-right:20px;padding-top:0px;padding-bottom:0px\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"VMware Cross-Cloud services (Graphic: Business Wire)\" src=\"https://mms.businesswire.com/media/20211118005471/en/1278383/4/VMware_Cross-Cloud_Services_2.jpg\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbXMuYnVzaW5lc3N3aXJlLmNvbS9tZWRpYS8yMDIxMTExODAwNTQ3MS9lbi8xMjc4MzgzLzQvVk13YXJlX0Nyb3NzLUNsb3VkX1NlcnZpY2VzXzIuanBn&amp;key=4e72ee1114b8f3f81d26b40dd3d6b97bb636ef1af0260deef445eb45d11682d9782335a951c53a9fed04c5f0a90dc41d5cc3082a1852dfd55fc57beb5530bfc4\"/></div></div><p style=\"font-size:85%\">VMware Cross-Cloud services (Graphic: Business Wire)</p></div><p>\nVMware Carbon Black Cloud and VMware Tanzu are the latest services now available in the AWS Marketplace, a digital catalog with thousands of software listings from independent software vendors that make it easy for customers to find, test, buy, and deploy software that runs on AWS.\n</p><p>\nVMware Cross-Cloud services offer distinct advantages to both IT operators and developers working in AWS. These advantages include accelerating application modernization, migrating workloads faster to the cloud, adopting a cloud operating model for their entire organization, and more securely and efficiently connecting a distributed workforce to cloud-based resources.\n</p><p>\n<span>“Whether a customer has transitioned their business to run entirely in AWS or has a mixed environment of AWS and VMware vSphere, VMware Cross-Cloud services gives them the freedom and enterprise control they need to innovate and win,” said Vittorio Viarengo, vice president, cross-cloud solutions, VMware. “Our expanded presence in AWS Marketplace is another proof point of our focus on meeting customers where they are at by delivering value for the strategic cloud environment of their choice.”</span>\n</p><p>\n<span>“The addition of VMware Cross-Cloud services in AWS Marketplace brings VMware’s portfolio of solutions to both developers and infrastructure and operations professionals who are building apps and operating their businesses in AWS,” said Mona Chadha, Director, AWS Marketplace Category Management, AWS. “Our mutual customers can streamline procurement and accelerate adoption of VMware Cross-Cloud services, leading to faster time-to-value and better business outcomes.”</span>\n</p><p>\n<b><span>Advancing App Modernization and DevSecOps with VMware Tanzu</span></b>\n</p><p>\nVMware Tanzu (<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fmarketplace%2Fpp%2Fprodview-iz2amhvqlrhwe%3Fsr%3D0-2%26ref_%3Dbeagle%26applicationId%3DAWSMPContessa&amp;esheet=52533859&amp;newsitemid=20211118005471&amp;lan=en-US&amp;anchor=marketplace+listing&amp;index=1&amp;md5=848bdb2a44c534235beae9f5e6f71871\" data-type=\"url\" class=\"tr-link\" translate=\"no\">marketplace listing</a>) is a modular application platform for building, running, and managing modern apps on AWS and hybrid-cloud infrastructure. Tanzu provides a consistent experience for developers and for operators, enabling them to navigate the complexities of modern apps and Kubernetes—gaining efficiencies and scale. Core to Tanzu is an upstream-aligned Kubernetes distribution that’s easy to operate and maintain using Cluster API for deploying and updating clusters. As an AWS Partner Network (APN) Advanced Technology Partner, customers can leverage the expert services of VMware Tanzu Labs to work side by side with teams to build capabilities and instill processes that show immediate and lasting impact. With Tanzu, AWS customers benefit from:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\nDeveloper self-service access to clusters, along with a standardized, more secure build model for creating and maintaining containers.\n</li>\n<li>\nFleet-wide policy management for pod access, networking, and security enabling simultaneous policy application to hundreds of Kubernetes clusters wherever they’re running, as well as to a particular namespace that is common across multiple different Kubernetes clusters.\n</li>\n<li>\nFull-stack observability capable of performing at more than a million data points per second to enable faster troubleshooting and smart alerting of potential anomalies across all clusters and the workloads running within them.\n</li>\n</ul><p>\n<b><span>Enabling Consistent and Unified Enterprise Security with VMware Carbon Black Cloud</span></b>\n</p><p>\nVMware Carbon Black Cloud (<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fmarketplace%2Fsearch%2Fresults%3FsearchTerms%3DVMware%2BCarbon%2BBlack&amp;esheet=52533859&amp;newsitemid=20211118005471&amp;lan=en-US&amp;anchor=marketplace+listing&amp;index=2&amp;md5=724906aab477c6aa91d2679d0a6908ab\" data-type=\"url\" class=\"tr-link\" translate=\"no\">marketplace listing</a>) is a cloud-native endpoint, workload, and container protection platform that enables customers to operationalize consistent, modern security in AWS and hybrid cloud environments. By analyzing more than one trillion security events per day<sup>(1)</sup> VMware Carbon Black Cloud proactively uncovers attackers’ behavior patterns and empowers defenders to respond and remediate in real-time from anywhere in the world. Endpoint, workload, and container security capabilities are unified into one console and one agent so that infrastructure and infosec teams have a single, shared source of truth to improve security together. With VMware Carbon Black Cloud, AWS customers benefit from:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\nCloud-native endpoint security that combines prevention and automated detection to defend organizations from the full spectrum of today’s sophisticated attacks.\n</li>\n<li>\nAdvanced workload protection for the modern data center to better secure workloads running in virtualized, private and hybrid cloud environments.\n</li>\n<li>\nEnterprise-grade container security that provides continuous visibility, enhanced security, and compliance for containerized applications from development to production in AWS and private cloud environments.\n</li>\n</ul><p>\n<b><span>Transforming Cloud Management with CloudHealth</span></b>\n</p><p>\nCloudHealth <span>(<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fmarketplace%2Fpp%2Fprodview-rpfawu4mhw64m%3Fsr%3D0-1%26ref_%3Dbeagle%26applicationId%3DAWSMPContessa&amp;esheet=52533859&amp;newsitemid=20211118005471&amp;lan=en-US&amp;anchor=marketplace+listing&amp;index=3&amp;md5=9690b91f8822dd88593e167e1d557c5d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">marketplace listing</a>) </span>is<span> </span>a robust cloud management platform that helps AWS customers simplify cloud financial management, streamline cloud operations, and improve cross-organizational collaboration. AWS customers can leverage VMware’s deep insight and experience in public cloud management to grow their own cloud expertise using a proven framework to progress through their cloud management maturity journey. With CloudHealth, AWS customers benefit from:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\nFaster decision making through alignment of cloud data with business context and access to custom reports and dashboards tailored to each business function, team, or project.\n</li>\n<li>\nBetter resource utilization and cost optimization through actionable recommendations for rightsizing AWS services and managing Reserved Instances and Savings Plans.\n</li>\n<li>\nMore efficient cloud operations by implementing governance policies to proactively alert and take automated actions within an AWS environment.\n</li>\n</ul><p>\n<span>“We really love the visibility CloudHealth provides for being able to have a single pane of glass into our AWS spend and sharing reporting across teams,” said James Fogerson, senior manager of the Cloud Center of Excellence for Robert Half. “Senior management really appreciates our focus on cost management with AWS and keeping people on track for managing spend. The reports we can generate are a good way to make sure the team is aware of where the costs are going and agree that those should be the main drivers.”</span>\n</p><p>\n<b><span>Improving Cloud &amp; Kubernetes Security Posture with CloudHealth Secure State</span></b>\n</p><p>\nCloudHealth Secure State (<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fmarketplace%2Fpp%2Fprodview-an32q6yihvkjg%3Fsr%3D0-2%26ref_%3Dbeagle%26applicationId%3DAWSMPContessa&amp;esheet=52533859&amp;newsitemid=20211118005471&amp;lan=en-US&amp;anchor=marketplace+listing&amp;index=4&amp;md5=45d3d4cff3794469cdfc525d1c52977f\" data-type=\"url\" class=\"tr-link\" translate=\"no\">marketplace listing</a>) is an intelligent cloud native security and compliance platform that helps organizations protect millions of cloud resources at scale. Using a resource relationship-based cloud data model, CloudHealth Secure State improves security visibility with real-time inventory search, advanced risk correlation, and more than 950 best practices rules to report security and compliance violations. With CloudHealth Secure State, AWS customers can:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\nReduce misconfigurations and prioritize threats with visual risk context and a more secure auto-remediation approach.\n</li>\n<li>\nIncrease compliance with industry standards with out-of-the-box benchmarks and enterprise customizations.\n</li>\n<li>\nOperationalize a cloud security program through better collaboration between developers, security, and operations team.\n</li>\n</ul><p>\n<span>“CloudHealth Secure State provides us with a global view of Discovery’s cloud estate and enables us to operate more securely in AWS,” said Johan Marais, senior platform services manager, Discovery Group. “We can visualize real-time risks due to infrastructure deployments or configuration changes in our AWS environment, and based on various metrics and guard rails, delivers a mechanism to auto-remediate policy violations and improve our AWS security posture. Additionally, the CloudHealth Secure State platform makes it easy to measure compliance against predefined governance frameworks as well as custom frameworks critical to our organization.”</span>\n</p><p>\n<b><span>Cloud-Native Load Balancing and Web Security with VMware NSX Advanced Load Balancer</span></b>\n</p><p>\nVMware NSX Advanced Load Balancer (<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fmarketplace%2Fsearch%2Fresults%3FsearchTerms%3DAvi%2BNetworks%26CREATOR%3De39c3856-136d-4d5d-8389-16f315505376%26filters%3DCREATOR&amp;esheet=52533859&amp;newsitemid=20211118005471&amp;lan=en-US&amp;anchor=marketplace+listing&amp;index=5&amp;md5=cb1c8bc7f017a2ce6990154920450c6e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">marketplace listing</a>) is a modern, standalone application services platform for public cloud or on-premises deployments. The software-defined platform includes local and global load balancing, Web Application Firewall (WAF), and container ingress services. NSX Advanced Load Balancer natively integrates with AWS to provide central orchestration of a distributed load balancing and application security fabric, powerful analytics and visibility that helps administrators troubleshoot in seconds, and elastic on-demand scaling of services across data centers and clouds. With NSX Advanced Load Balancer, AWS customers can:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\nSimplify application delivery operations with central orchestration, elastic scale, and cloud-native integration across clouds and on-premises environments.\n</li>\n<li>\nAutomate load balancing, autoscaling, container ingress, and application security to facilitate self-service capabilities for app teams.\n</li>\n<li>\nPinpoint application performance and security issues with powerful insights covering more than 700 application networking parameters.\n</li>\n</ul><p>\n<b><span>Delivering More Secure and Consistent Access to Apps with VMware SASE</span></b>\n</p><p>\nVMware SASE (<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fmarketplace%2Fsearch%2Fresults%3FsearchTerms%3DVeloCloud&amp;esheet=52533859&amp;newsitemid=20211118005471&amp;lan=en-US&amp;anchor=marketplace+listing&amp;index=6&amp;md5=38b59c7915e821ea5caf8a7ece3c6bcc\" data-type=\"url\" class=\"tr-link\" translate=\"no\">marketplace listing</a>) combines SD-WAN capabilities with cloud-delivered security functions, including cloud web security, zero trust network access, and firewalling. These capabilities are delivered as-a-service across both the near and far edge locations from a global network of points of presence (PoPs). By leveraging VMware SASE, AWS customers can simplify, manage, and automate WAN infrastructure across thousands of locations and better support distributed workforces. With VMware SASE, AWS customers benefit from:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\nScalable and easy-to-deploy and more secure remote access for applications running in AWS and AWS Outposts.\n</li>\n<li>\nConsistent, reliable application delivery to mobile clients, branches, and campuses under virtually any network condition.\n</li>\n<li>\nBetter business resiliency through network transport independence and actionable and automated insights on network health and app delivery\n</li>\n</ul><p>\n<sup>(1) </sup><b>Citation </b>-VMware Internal Analysis, August 2021\n</p><p>\n<b>About VMware</b>\n</p><p>\nVMware is a leading provider of multi-cloud services for all apps, enabling digital innovation with enterprise control. As a trusted foundation to accelerate innovation, VMware software gives businesses the flexibility and choice they need to build the future. Headquartered in Palo Alto, California, VMware is committed to building a better future through the company’s 2030 Agenda. For more information, please visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.vmware.com%2Fcompany&amp;esheet=52533859&amp;newsitemid=20211118005471&amp;lan=en-US&amp;anchor=www.vmware.com%2Fcompany&amp;index=7&amp;md5=3b00c534d3d082780031d716e45a4ec5\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.vmware.com/company</a>.\n</p><p>\n<span>VMware, Carbon Black, Tanzu, vSphere, CloudHealth, and NSX are registered trademarks or trademarks of VMware, Inc. or its subsidiaries in the United States and other jurisdictions. VMware makes no guarantee that services announced in preview or beta will become available at a future date. The information in this press release is for informational purposes only and may not be incorporated into any contract. This article may contain hyperlinks to non-VMware websites that are created and maintained by third parties who are solely responsible for the content on such websites.</span>\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211118005471r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTE4MDA1NDcxcjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=9b78e62593f644053cbd8313eba88ea46ae1bd78e9050e0fe969ec06c6e13f12b978e445eef2e333c09bae76bdd38baace72958d4b9fd3b5547c652e0dbadb56\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211118005471/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211118005471/en/</a></span></p><p>\nRoger T. Fortier\n<br/>VMware Global Communications\n<br/>+1 (408) 348-1569\n<br/><a href=\"mailto:rfortier@vmware.com\" data-type=\"email\" translate=\"no\">rfortier@vmware.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: CA-VMWARE</p></div>"}