{"date": "2021-07-25 09:57:24.720000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3998.0, "close": 3894.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Dubai, UAE –</strong> AVEVA, a global leader in industrial software, driving digital transformation and sustainability, today announced that it has become the 47<sup>th</sup> company in the FTSE 100 to join the United Nation’s Race to Zero campaign.</p>\n<p>“By joining the Race to Zero initiative and aligning to the highest level of ambition for climate targets under the Paris Agreement, AVEVA is leading by example on climate action. We are demonstrating our commitment to work across our entire value chain to help avoid global impacts from climate change. We are also pleased to be joining many of our customers in this initiative, as well as key partners, including Microsoft, Accenture and Schneider Electric, that have already committed to this pledge,” commented Peter Herweck, AVEVA CEO.</p>\n<p>Race to Zero is a global campaign designed to rally leadership and support from businesses, cities, regions, and investors for a healthy, resilient, zero carbon recovery that prevents future threats, creates jobs, and unlocks inclusive, sustainable growth. It aims to mobilize a coalition of leading net zero initiatives and is the largest ever alliance committed to achieving net zero carbon emissions by 2050. Collectively participants now cover nearly 25% of global CO2 emissions and over 50% of GDP. AVEVA’s objective is to build momentum and spur rapid action around decarbonization ahead of COP26, where governments must strengthen their contributions to the Paris Agreement.</p>\n<p>Andrew Griffith MP, the UK’s Net Zero Business Champion also commented, “Congratulations to AVEVA on joining the UN’s Race to Zero campaign. This demonstrates great leadership and goes hand in hand with the company’s work to support clients like National Grid and Anglian Water in creating a positive impact on the environment. AVEVA joins 46 other FTSE100 companies in the Race to Zero, together representing over a trillion pounds in market capitalization. With just 100 days to go until we host the COP26 Summit in Glasgow – the time to act is now.”</p>\n<p><strong>Collaborating to Nurture Sustainability Throughout its Ecosystem</strong></p>\n<p>AVEVA has already joined a number of corporate sustainability initiatives to date that bring together companies to work on climate challenges collectively, including BSR and the UN Global Compact. Most recently AVEVA joined The Renewable Energy Buyers Alliance (REBA) a joint collaboration of large clean energy buyers, energy providers, and service providers that, together with NGO partners, are unlocking the marketplace for all nonresidential energy buyers to lead a rapid transition to a cleaner, prosperous, zero-carbon energy future.</p>\n<p>“AVEVA, remains committed to lead sustainable innovation and we are taking affirmative actions to embed sustainability into our operations, our culture and our core business strategy,” commented Herweck. “By being part of the Race to Zero initiative, we are leading by example and setting the direction we will take to drive sustainability throughout our own operations, and the software we develop for our customers globally. We will continue to formalize our sustainability pledges across all our focus areas as well as develop interim goals to help us report and communicate on our progress, and we look forward to sharing more details in the months to come.”</p>\n<p>Today’s AVEVA announcements builds on a recent climate mitigation commitment made by AVEVA as part of its long-term sustainability agenda. In June 2021, the company announced its commitment to reach net zero greenhouse gas emissions across its operations (Scopes 1 &amp; 2) by 2030, as well as its plans to submit ambitious mitigation targets for external validation by the Science Based Targets initiative (SBTi) before the end of the fiscal year.</p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Â© Press Release</p></div>"}