{"date": "2022-01-12 01:26:00.613000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3229.72, "close": 3304.14}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>SLT-MOBITEL, the National ICT Solutions Provider score another first as the only telecommunication company in the country to fully integrate Amazon Alexa services for all Home Broadband customers offering exciting new intelligent built experiences and digital lifestyles.</p><p>Today, the physical and digital worlds are blurring with artificial Intelligence (AI) and voice commanded services developed rapidly changing lifestyles. To help streamline and make hectic lives more manageable, applications such as Apple Siri, Google Assist in mobile phones promotes the use of voice assisted AI services.</p></div><div class=\"tr-npp-body\"><p>Amazon?s virtual smart assistant, simply known as Alexa, is a cloud based artificial intelligence powered futuristic yet human-cantered technology platform. Alexa as an AI voice assistance mechanism connects to many smart devices and transforms abodes and offers individuals new digital lifestyles.</p><p>Supporting the best possible connected experience in the home, SLT-MOBITEL now offers Home Broadband customers a new way to manage their fixed connections, by connecting to Alexa App or a Device. Fully integrating SLT-MOBITEL?s Home services with Alexa, customers can seek help from the smart assistant and obtain a range of information on SLT-MOBITEL services such as Voice, Broadband, PEO TV, call center services etc.</p><p>With Alexa, customers have a ready digital assistant. Customer can even add data, check data usage, change TV channels and purchase movies etc. through Alexa. Providing unprecedented simplicity of use, SLT-MOBITEL?s integration of Alexa delivers superior, multi-channel, automated customer service experiences for Home Broadband consumers creating significant momentum to experience a digital lifestyle.</p><p>SLT-MOBITEL Amazon Alexa skill was developed in collaboration with The Connection Workshop (Pvt) Ltd, a South Asian Technology Company, the organization instrumental in introducing Tedi Alexa voice assistant and home automation services to Sri Lanka.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Euclid Infotech Pvt Ltd.</p></div>"}