{"date": "2021-09-08 08:49:56+00:00", "ticker": "AVV", "mrkt_info": {"open": 4220.0, "close": 4146.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><br/>\nBy Arab News<br/>\n<div>\n<div>\n<div>\n<div> </div>\n</div>\n</div>\n</div>\n<div>\n<div>\n<div>\n<div>\n<div>DUBAI: British industrial software company AVEVA is setting up its “largest digital hub” in Saudi Arabia, following its initial agreement with Aramco.</div>\n</div>\n</div>\n</div>\n<div data-io-article-url=\"https://www.arabnews.com/node/1924936/business-economy\">\n<p>The hub will have research and development capabilities, the company said in a statement, and will support its operations across the Middle East.</p>\n<p>London-listed AVEVA has signed a memorandum of agreement with Aramco to develop various technologies including artificial, machine learning, and data management.</p>\n<p>The partnership will help Aramco in its development and implementation of blue hydrogen and decarbonization facilities in the Kingdom, the statement said.</p>\n<p>It will deploy predictive analytics technology across Aramco’s operating facilities.</p>\n<p>“Digital technologies have the potential to accelerate the transformation of the industrial sector and drive it towards more efficient and sustainable operations,” Ahmad Al-Sa’adi, senior vice president of technical services in Aramco said.</p>\n</div>\n</div>\n<p class=\"syndigate_disclaimer\">Copyright: Arab News © 2021 All rights reserved. Provided by SyndiGate Media Inc. (<a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a>).</p>\n<div class=\"footnote-disclaimer\">Disclaimer: The content of this article is syndicated or provided to this website from an external third party provider. We are not responsible for, and do not control, such external websites, entities, applications or media publishers. The body of the text is provided on an “as is” and “as available” basis and has not been edited in any way. Neither we nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this article. <a href=\"https://d3a0oa8cittb3t.cloudfront.net/researchreports/Disclaimers/TR%20Disclaimer.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read our full disclaimer policy here</a>.</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Arab News</p></div>"}