{"date": "2021-05-25 12:04:14.334000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3275.0, "close": 3416.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>ENPNEWSWIRE-(C)2021 ENPUBLISHING</p><p>Release date- 25052021 - Global Industrial Software and Data Management Leader Delivers A Strong Business Performance with further Opportunities Ahead.</p></div><div class=\"tr-npp-body\"><p>AVEVA, a global leader in industrial software, driving digital transformation and sustainability, today announced its results for the year ended 31 March 2021 (FY21). The results showed that AVEVA had made strategic, financial, and operational progress in the face of the pandemic.</p><p>The last year proved transformational for AVEVA. The Group was quick to react to the COVID crisis, rapidly moving employees to remote working and conducting business transactions virtually. Evolving how it operated it demonstrated the resilience and strength of both the business and its relationships with customers. Today, AVEVA is a stronger and better positioned business, with a more diversified customer base. It has a fundamental role to play to in supporting customers' energy transition and environmental efficiency journeys.</p><p>Alongside the successful navigation of the global pandemic, AVEVA completed the transformational $5bn acquisition of OSIsoft in March 2021. This acquisition established AVEVA as a clear global leader bringing together industrial software applications with the market leading industrial data platform.</p><p>Industrial Digitalisation Driving Significant Growth as well Sustainability</p><p>The ongoing digitalisation of the industrial world continues to be a fundamental demand driver for AVEVA's software. Strong Subscription growth continued, and the Group also delivered Software as a Service (SaaS) to customers at increasing scale. Despite the challenging macro-economic environment, AVEVA continued to invest in its future growth by increasing investment in areas of its world class technology and software, such as AI and Cloud.</p><p>While digital transformation remains at the core of customers' decisions to adopt AVEVA's solutions, the company is also making a strong contribution to sustainability through its products. For example, the remote deployment of AVEVA Unified Operations Centre enabled Saudi Aramco to monitor emissions and optimise energy usage; while Neste, the world's leading producer of renewable diesel and sustainable aviation fuel, used AVEVA's Unified Supply Chain to drive collaboration between its remote teams, boosting efficiency. Several of AVEVA's EPC customers used AVEVATM Unified Engineering to help pioneer hydrogen production designs while other engineering companies use our software for offshore windfarms.</p><p>Strong Customer Business Strengthens AVEVA's Market Leadership</p><p>Whilst the pandemic had a direct impact on planned capital projects being postponed, demand shift from 3D design software to project execution software grew:</p><p>Engineering, which contributed 42% of revenue during the year, saw significant contract wins with EPC's such as Wood, Worley, and Petrofac. Likewise, demand shift to plant operations led to an increase in orders from owner operators managing engineering information as the core of the digitalization strategy within their existing plant facilities. There were a number of significant wins including with Shell and BHP Group, while we also had an increase in orders from the Power End market with significant contract wins from companies including EDF.</p><p>Monitoring &amp; Control represented 32% of AVEVA's total revenue as customers continued to focus on operations efficiency, remote operations, and collaboration. AVEVA also saw strength in mid-stream Oil &amp; Gas with as a result, there were several O&amp;G wins including from SoCalGas. In other sectors AVEVA also achieved significant order wins from customers including BHP Group.</p><p>Asset Performance Management represented 14% of total revenue with AVEVA winning its first mining customer in APM and continued a substantial global roll out with an Energy major.</p><p>Planning &amp; Operations represented 12% of total revenue with growth supported by sales of Supply Chain planning solutions to help customers in the Energy sector operate efficiently in the context of the disrupted market. There was also growth in the Food &amp; Beverage and Metals and Mining sectors for Manufacturing Execution software.</p><p>Commenting on the results, Peter Herweck, CEO of AVEVA Group plc said, 'Through 2021 we both helped our industrial customers to successfully navigate the short-term challenges of the pandemic whilst also creating innovative solutions to achieve their digitalisation goals. The acquisition of OSIsoft brought a real sense of excitement from our employees and customers and our conversation is now focused as the recognition of the power and value of the combined products sets become apparent.'</p><p>'It's clear that moving forward, AVEVA has a strong springboard for the future long-term growth of the business. As we look ahead, we do so in the knowledge that AVEVA is optimally positioned to support customers in their digitalisation journey and in creating more sustainable and resilient businesses,' Herweck concluded.</p><p>This news release contains a summary of our results, for the full results, please see our investor relations website at www.aveva.com.</p><p>About AVEVA</p><p>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence. AVEVA's comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries. Learn more at www.aveva.com.</p><p>Copyright 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</p><p>Enquiries:</p><p>AVEVA Media Contacts</p><p>Rose Bambi</p><p>Senior Director Global PR and External Communications</p><p>Tel: +44 (0) 208 323 2789</p><p>rose.bambi@aveva.com</p><p>Caroline Stephens</p><p>Senior Global PR Manager</p><p>caroline.stephens@aveva.com</p><p>Catherine Singh</p><p>Global PR/Social Media Coordinator</p><p>catherine.singh@aveva.com</p><p>External Communications Alias</p><p>external.communications@aveva.com</p><p>[Editorial queries for this story should be sent to newswire@enpublishing.co.uk]</p><p>((Comments on this story may be sent to info@enpublishing.co.uk))</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 M2 Communications Ltd.</p></div>"}