{"date": "2022-02-18 00:10:22.257000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3162.01, "close": 3052.03}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Singapore consumers no longer have to pay a surcharge when they use their Visa credit cards to make purchases on Amazon's Singapore website, after a global deal was reached.</p><p>This reprieve took effect from yesterday.</p></div><div class=\"tr-npp-body\"><p>In a message to its Singapore customers, Amazon said: \"We've recently reached a global agreement with Visa that allows all customers to continue using their Visa credit cards in our stores.\"</p><p>As a result, Visa credit card purchases on Amazon.sg will no longer incur a surcharge.</p><p>Amazon had added a 0.5 per cent surcharge on Visa credit card transactions on its Singapore website on Sept 15 last year.</p><p>Singapore was the first country where consumers had to pay this surcharge.</p><p>Amazon said in August last year that the surcharge would apply to most purchases made on Amazon.sg, such as apparel and consumer electronics sold by third parties, or Amazon itself, from Singapore or overseas.</p><p>However, groceries from Amazon Fresh, digital goods and services such as in-app purchases on Amazon service Twitch, as well as subscription schemes such as Amazon Prime would not be affected by the surcharge.</p><p>It was also reported that purchases from other Amazon websites remained unaffected then, even when they were shipped to Singapore.</p><p>Amazon and Visa had feuded over the fees that the retailer pays each time a consumer uses the card at checkout.</p><p>While the customer's bank reaps most of that fee, it is Visa that sets the levels merchants are charged, Bloomberg said.</p><p>\"Visa is pleased to have reached a broad, global agreement with Amazon,\" a Visa spokesman said in a statement.</p><p><q>    </q> </p><p>Amazon had added a 0.5 per cent surcharge on Visa credit card transactions on its Singapore website on Sept 15 last year.</p><p>Singapore was the first country where consumers had to pay this surcharge.</p><p>\"This agreement includes the acceptance of Visa at all Amazon stores and sites today, as well as a joint commitment to collaboration on new product and technology initiatives to ensure innovative payment experiences for our customers in the future.\"</p><p>Amazon had also been imposing a surcharge on customers using Visa cards on its Australia site.</p><p>Late last year, it was expected to prevent British customers from using Visa-issued credit cards on its platform from January this year. But two days before the plan took effect, Amazon informed its British customers that the change would not be taking place.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 SPH</p></div>"}