{"date": "2022-02-08 17:56:19.346000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_o5mxxpf6&amp;referenceId=1_o5mxxpf6&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_o5mxxpf6&amp;referenceId=1_o5mxxpf6&amp;pageId=RefinitivNewscasts</a></pre>Source: Stocktube<br/><br/>Description: Mode Global Holdings PLC (LSE:MODE, OTCQB:MODGF)'s (Mode Global Holdings PLC (LSE:MODE, OTCQB:MODGF)) Jonathan Rowland is back in charge as CEO of the firm and joins Proactive London to discuss the news employees of the ecommerce platform Heroes will be able to take some of their monthly salaries in Bitcoin as part of a new partnership.&amp;#xD;&amp;#xD;Employees of Heroes will have the option to steadily invest into Bitcoin each month. The agreement is part of the expanding #PayMeInBitcoin movement, and follows the partnership between Mode and PayEscape, a payroll supplier, in November 2021.<br/>Short Link: <a href=\"https://refini.tv/3JcxkxH\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3JcxkxH</a><br/><br/>Video Transcript:<br/><br/>&gt;&gt; Hello there, a very good morning, you're watching Proactive London. Mode Global Holdings have said the employees of e-commerce platform Heroes will be able to take some of their monthly salaries in Bitcoin as part of a new partnership. We're going to talk about that and much more with Jonathan Rowland. It's so great to see you again. So you've taken back the rounds at the firm. Now, are you happy to be back in action? &gt;&gt; Yeah. It's nice to see you again, Katie, and thanks for having me back on the show. Yeah, I took back control of the company in mid-January. Our old CEO Ron Moore resigned and so I got much more involved in the day-to-day of the last couple of weeks, so very happy to be back in control of the ship. &gt;&gt; Good stuff. Steering the ship. So let's talk about the seas that you're at now because some exciting news this week, we are going to talk about that. But first, what I want to talk about is L.K.Bennett. How's the integration. How's it going so far? How's the process? &gt;&gt; So the L.K.Bennett integration is done now, so we're live on the L.K.Bennett website and to our app. It's been a partnership that we've been working on for the best part of eight or nine months. These cycles of getting new merchants takes around eight or nine months so we have a long tail of motions coming on board, but L.K.Bennett was one that we concentrated on due to the relationship we have with the CEO and we launched the live version last week, so it's doing very well. So people are able to go onto the website of L.K.Bennett and buy stuff and get Bitcoin rewards back in return. So very happy that's been launched behind the THD deal we did last year. &gt;&gt; Yeah, good stuff and Heroes, of course, you've got to talk about this because Heroes and [inaudible 00:01:49] have formed this payroll partnership. Could you maybe tell us a bit more about the Heroes themselves and how you first contacted them about this? &gt;&gt; Yes, so Heroes we got in contact with several months ago. It's been quite a quick transaction from meeting them to deploying the offering that we created. We found that our own internal employees wanted to be paid in Bitcoin. So Mode employees now have the ability to be paid in Bitcoin including myself, and we just saw that maybe it's an offering that we should offer to other people because it's very easy to offer through our platform. Heroes came to us through a connection we have, they're fast growing company evolved in e-commerce Amazon businesses. And they said, \"Absolutely, our staff would love to be paid in Bitcoin. Can you do this for us\", and it was very easy for us to automate for them. We signed the deal within four to six weeks and they're very happy with it. I think it went live last week with the first payment to the employees of a percentage of their payroll into Bitcoin, into their Mode wallet. And we also see it as a new business line which we didn't see before. So Bitcoin payrolls as you well know is a buzzword at the moment and we seem to be very much at the forefront of that. &gt;&gt; We're talking about buzzwords so this payment in Bitcoin, we're going to talk about more because it is dominating the headlines, getting a lot of attention, and now one of your runaway products as well. So what's next would you say, Jonathan? &gt;&gt; Next for Mode, we've done a lot of research over the last few months and since I came back, over the three weeks, we've really focused in on our roadmap and we'll be announcing over the next coming months a number of different avenues that we're searching and going down. In particular, we want to bring back the interest-bearing account which was called the jaw, which we had over a year ago which we had to withdraw due to regulatory pressure but we will be bringing that back. We're looking at bringing a card into our offering and just continue to add to the peroxy we have already, the platforms there, we have a consumer wallet, we have a payment system that we built ourselves. So the platform's there to add things till now is the point where we can scale up and add innovative products to the platform. So we're excited about the roadmap now, it's very encouraging to see research back from our own customers who said we would like to see this and this, coupled with what we were doing anyway, so we're all aligned. &gt;&gt; Let's talk about being aligned now and your share price because it's still in decline, the volumes have picked up. You say you've been in the job back at the helm now about three weeks or so. Are you confident that you can pick this up and would you be able to push ahead of your competitors now, do you think with all that's been going on with the firm? &gt;&gt; Yeah. I think the share price of the last eight months, nine months has been disappointing. We seem to reach the bottom now. As I've said to many people over the last few weeks, compared to our competitors, we're very cheaply valued. So the sector is very highly valued. The sector has a lot of capital coming into it and we've just been left behind. So I think with the new injection of enthusiasm from myself as the largest shareholder and Chairman, along with other investors who are keen to get back into the story and to hear the story as it is now and where it's going. There's limited downside now. &gt;&gt; And you were on the Sunday Roast over the weekend you were talking about the Mode 2022 roadmap ahead, a lot is going on, Jonathan. &gt;&gt; Yeah, the Sunday roast is a good podcast, a good following, and I did an interview with them on Friday, they released it on Sunday. A lot of investors and shareholders have been asking for answers on various things so it gave me the ability to answer questions directly, openly, transparently, and the roadmap as I said is fantastic. We've got a lot to do now. We've got to get our hands dirty again and get back into it. The future is very bright for us so I'm very excited about the future. &gt;&gt; So what are you most looking forward to what you're saying? &gt;&gt; Just delivering what we said we were going to deliver in the beginning, which is a very innovative super financial services focused with very innovative products. So just delivering that now during this year and next year, scaling up and delivering something that we can be proud of, that works and people want to use. &gt;&gt; We'll let you get back stuck into it. Back in charge there, Jonathan Rowland, and thank you very much indeed for Mode Global Holdings. &gt;&gt; Thanks, Katie.<br/></span></div></div></div></div>"}