{"date": "2021-12-01 19:53:08.081000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>AWS Announces AWS IoT FleetWise</b>\n</p><p class=\"bwalignc\">\n<span>New service makes it easier and more cost-effective for automakers to collect vehicle data and transfer it to the cloud in near-real time so customers can build applications that use analytics and machine learning to improve vehicle quality, safety, and autonomy</span>\n</p><p class=\"bwalignc\">\n<span>The new service is part of AWS for Automotive, an initiative that provides automotive customers with purpose-built tools for connected mobility, autonomous development, digital customer engagement, product design and engineering, manufacturing, and supply chain</span>\n</p><p class=\"bwalignc\">\n<span>NXP, WirelessCar, and Otonomo among customers and partners using AWS IoT FleetWise</span>\n</p><p>\nToday, at AWS re:Invent, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), announced AWS IoT FleetWise, a new service that makes it easier and more cost-effective for automakers to collect, transform, and transfer vehicle data to the cloud in near-real time. With AWS IoT FleetWise, automakers can easily collect and organize data in any format present in their vehicles (regardless of make, model, or options) and standardize the data format for easy data analysis in the cloud. AWS IoT FleetWise helps automakers efficiently transfer data to the cloud in near-real time using the service’s intelligent filtering capabilities that allow developers to reduce network traffic by selecting the data to transfer and defining rules for when to transfer it based on parameters like weather conditions, location, or vehicle type. Once the data is in the cloud, automakers can use it for applications that remotely diagnose issues in individual vehicles, analyze vehicle fleet health to help prevent potential recalls or safety issues, or improve advanced technologies like autonomous driving and advanced driver assistance systems with analytics and machine learning. There are no upfront commitments or fees to use AWS IoT FleetWise, and customers only pay for the underlying services used. To learn more about AWS IoT FleetWise, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fiot-fleetwise&amp;esheet=52542179&amp;newsitemid=20211130005970&amp;lan=en-US&amp;anchor=aws.amazon.com%2Fiot-fleetwise&amp;index=1&amp;md5=f342337ecb5ca474cf80404f52b5bbcd\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com/iot-fleetwise</a>.\n</p><p>\nAutomakers have been collecting data from standard vehicle sensors for over a decade to evaluate operational and safety indicators like engine temperature and vehicle stability. However, automakers today are building cars with new classes of advanced sensors like radar and cameras that improve vehicle safety but also generate exponentially increasing amounts of data. For example, advanced vehicle sensors can generate up to 2 terabytes of data hourly per vehicle, making the cost of transferring this type of data to the cloud prohibitive. Automakers want to collect, standardize, and transfer this data to the cloud more cost-effectively, so they can use it to generate insights that help improve vehicle quality, safety, and autonomy. However, the ever-increasing variety of vehicle makes, models, and options that generate data in different proprietary formats creates a complex array of data across the vehicles on the road. Collecting and transforming all of this vehicle data so that it can be analyzed in the cloud requires automakers to build custom data collection systems that standardize the data across the wide variety of data formats, which is difficult and time-consuming. Instead, automakers want to select the data to collect and transfer to the cloud in near-real time based on their specific use case, but this type of intelligent data filtering doesn’t exist today. As a result, automakers are unable to put data to work to help solve common problems like diagnosing issues with individual vehicle performance, spotting fleet-wide issues before they become a growing problem, and using the data to improve vehicle performance and autonomy.\n</p><p>\nAWS IoT FleetWise provides automakers a managed service that makes it easier and more cost-effective to collect and transfer data from millions of vehicles to the cloud in near-real time. AWS IoT FleetWise can access the unique data format of a vehicle and then structure and standardize the data so automakers don’t have to develop custom data collection systems. Automakers start in the AWS Management Console by defining and modeling vehicle attributes (e.g. a two-door coupe) and the sensors associated with the car’s make, model, and options (e.g. engine temperature, front-impact warning, parking assist system, etc.) for individual vehicle types or multiple vehicle types across their entire fleet. After vehicle modeling, automakers install the AWS IoT FleetWise application on the vehicle gateway (an in-vehicle communications hub that monitors and collects data), so it can read, decode, and transmit information to and from AWS. With AWS IoT FleetWise’s intelligent filtering controls, automakers can select the exact data they need for their use cases and help reduce costs by limiting the amount of data transferred to the cloud by creating conditional rules to filter the data they want to collect and analyze (e.g. sensor data from hard-braking events associated with a vehicle make and model). Once data is transferred to the cloud with AWS IoT FleetWise, automakers can use AWS’s breadth and depth of services to extract value from vehicle data. For example, automakers can use intelligent filtering to collect camera data from vehicles traveling on newly built highways when an autonomous driving system identifies text in road signage with less than 90% confidence. When that data is sent to the cloud, automakers can label the data for accuracy to improve the machine learning models powering autonomous driving systems. Or, automakers can use intelligent filtering to collect data from electric vehicle batteries when the temperature drops below freezing and then analyze it and run simulations in the cloud to improve battery performance in cold weather.\n</p><p>\n“While automakers have collected, stored, and analyzed vehicle data for years, they are not equipped to manage the explosion of data generated by advanced vehicle safety and autonomous driving systems, nor have they had access to the near-real-time data needed to help proactively address vehicle problems,” said Mike Tzamaloukas, General Manager of IoT Automotive at AWS. “With AWS IoT FleetWise, automakers can now efficiently collect this data, transform it, and gain deep, actionable insights on the condition and usage of vehicles on the road. Automakers can now use the power of AWS to help maintain millions of vehicles, increase vehicle safety, and improve customer service.”\n</p><p>\nAWS IoT FleetWise is a new service that is part of AWS for Automotive, a comprehensive offering of AWS services and AWS Partner Network (APN) solutions used by automotive and mobility customers globally to help automotive customers digitally transform their business for connected mobility, digital customer engagement, product design and engineering, manufacturing, and supply chain. For more information on AWS for Automotive, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.com%2Fautomotive&amp;esheet=52542179&amp;newsitemid=20211130005970&amp;lan=en-US&amp;anchor=aws.com%2Fautomotive&amp;index=2&amp;md5=93d86a03b0c8ad1e85a547959110a404\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.com/automotive</a>.\n</p><p>\nAWS IoT FleetWise with standard vehicle data collection is available in preview today in US East (N. Virginia) and Europe (Frankfurt), with availability in additional AWS Regions coming soon.\n</p><p>\nNXP Semiconductors is the leader in secure vehicle network processors, enabling secure connections for a smarter world. “We are driving automotive industry innovations, including our new S32G vehicle network processors for service-oriented gateways,” said Ray Cornyn, Vice President and General Manager of Vehicle Control and Networking Solutions at NXP. “The collaboration with AWS on AWS IoT FleetWise is one that will enable smart data collection from every corner of the vehicle. With AWS IoT FleetWise and NXP’s automotive gateway solutions, OEMs will be able to leverage deeper vehicle insights to improve vehicles over time and enable compelling, new vehicle capabilities and business opportunities.”\n</p><p>\nWirelessCar has a 20+ year history of developing, delivering, and operating secure digital solutions and products for connected cars. “As our automotive services and solutions have continued to grow and establish us as a leader in the connected vehicle industry, we continue to enjoy the scale, availability, and resilience of AWS services as a foundation of our solutions,” said Jessica Nymark, CTO at WirelessCar. “With the arrival of AWS IoT FleetWise as an AWS for Automotive service, we look forward to a further expansion of our portfolio around efficient vehicle data collection and of our data ecosystem.”\n</p><p>\nOtonomo is a mobility intelligence platform that fuels a network of original equipment manufacturers (OEMs), fleets, and over 100 service providers, ranging from mobility as a service (MaaS), electric vehicles (EV), and transportation to insurance. The platform is powered daily by over 4 billion data points. “At Otonomo, we’re committed to driving smarter decisions and services for our customers through the use of connected vehicle data and mobility intelligence,” said Ben Volkow, CEO at Otonomo. “Today’s AWS IoT FleetWise announcement helps automakers collect and transfer data to the cloud more easily and efficiently than ever before. We’re thrilled to continue to collaborate with AWS and are excited about the additional capabilities made possible through AWS IoT FleetWise.”\n</p><p>\n<b>About Amazon Web Services</b>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com&amp;esheet=52542179&amp;newsitemid=20211130005970&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=3&amp;md5=01ac9de8de78230f4ac155ff88446ab6\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<b>About Amazon</b>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Famazon.com%2Fabout&amp;esheet=52542179&amp;newsitemid=20211130005970&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=4&amp;md5=f5ad0ba919501234c6936610e4b2685a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211130005970/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211130005970/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52542179&amp;newsitemid=20211130005970&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=5&amp;md5=e2f04e332092cbf9a5b54afe6f92708c\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NV-AMAZON</p></div>"}