{"date": "2021-12-17 21:31:21.467000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3377.42, "close": 3341.58}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>An Amazon factory in Illinois collapsed, killing six. A nursing home was destroyed in Arkansas, killing one and critically injuring five. A candle manufacturing plant in hard-hit Kentucky was devastated, killing eight.</p><p>The latest estimates place the death count from last week's tornado event at 88, a figure that may still rise. The number of fatalities indicates tragedy without very much modern precedent, a stark deviation from recent tornado outbreaks in which there was considerably less loss of life.</p></div><div class=\"tr-npp-body\"><p>Increasingly accurate and timely weather forecasts and warnings have brought about a significant downward trend in tornado fatalities. But the extreme toll of the Dec. 10-11 outbreak illustrates that vulnerable areas still face a serious risk of highly lethal storms.</p><p>The outbreak was by far the deadliest on record in December, more than doubling the previous toll from a 1953 tornado in Mississippi. No tornado event this decade has produced as many fatalities. In fact, this outbreak killed more people in a single day than in the three years from Jan. 1, 2016 to Dec. 31, 2018.</p><p>Recent years have seen the lowest tornado fatality numbers in U.S. history.</p><p>Between 1880, the start of reliable weather records, and 1950, often considered the dawn of modern meteorology, tornado outbreaks regularly killed hundreds. An 1896 tornado spree that hit St. Louis killed 350 and a cluster of violent storms spread across the Southeast in 1908 killed 324. Devastating outbreaks in 1917 and 1927 killed over 200 apiece. Often, the high death tolls were triggered by individual tornadoes, such as two twisters in 1936 that each killed more than 200 people and a well-known 1947 tornado that killed 181.</p><p>Perhaps the most infamous single twister to ever strike the United States carved a path through Missouri, Illinois and Indiana in March 1925. Known as the Tri-State Tornado, the storm devastated a number of towns along a 219-mile track, and was responsible for a staggering 695 fatalities. When considered alongside other tornadoes that tore through the south-central U.S. that day, the outbreak's death toll reached 747.</p><p>While these tornadoes were all incredibly violent and powerful, the reason they were responsible for so many deaths also has a lot to do with the complete lack of warning that preceded their arrival. Tornadoes were not forecast before the 1940s, and many of the tools that people have at their disposal when confronting severe weather did not exist until the 1970s or 1980s.</p><p>The second half of the 20th century saw great advances in atmospheric science as technological advances gave meteorologists tools including Doppler radar and forecast models, while trailblazing scientists such as Theodore Fujita revolutionized the field's understanding of tornadoes.</p><p>At the same time, an increasingly connected population, first via cable television and eventually via the Internet, has had unprecedented access to real-time forecasts. The National Weather Service now issues tornado watches and severe weather outlooks hours or even days before most significant events. When a threat appears imminent, tornado warnings that sometimes have more than a half-hour of lead time trigger automatic Wireless Emergency Alerts on smartphones. More and more, the element of surprise has been removed from tornadoes.</p><p>The result? While destructive twisters are likely no less frequent than they once were, the number of people killed annually has plummeted by up to two orders of magnitude.</p><p>But people still die in tornadoes even when supplied with the most accurate, timing warnings. Sometimes, tornadoes are just so strong that one cannot be safe without a fortified shelter or concrete basement, something many people lack. Sometimes, tornadoes strike vulnerable populations that may have neither means to shelter nor means to receive sufficient warning. Sometimes, tornadoes strike at night, or move incredibly fast, and even warnings with substantial lead times are inadequate.</p><p>Since the first time the Weather Service's Storm Prediction Center issued a high risk for severe weather, a March 1984 day, only two 24-hour periods have seen more United States tornado deaths than last week's outbreak. Both of these were in 2011, a year that featured by far the most tornado fatalities in modern history. Like last Friday, the massive death tolls seen on these two 2011 days came as incredibly violent tornadoes impacted densely populated areas, often while moving quickly.</p><p>On May 22, 2011, an isolated EF5 tornado tore through the heart of Joplin, Mo., a city of 50,000. By far the deadliest tornado since 1950, the violent twister killed 158 amid a swath of destruction.</p><p>On April 27, 2011, 321 peopled died when 75 tornadoes rated at least EF2 (including 11 EF4s and four EF 5s) on the 0 to 5 scale for tornado intensity raked the Southeast United States.</p><p>The 2011 tornado disasters affirmed an unavoidable fact that, if violent enough, even when there are many warnings, a tornado that impacts population centers can cause dozens of deaths.</p><p>Like those two catastrophic days just over 10 years ago, last week's outbreak saw a remarkable number of towns and cities hit by violent tornadoes. One EF4 was on the ground for 166 miles, another for 80; an EF3 tracked 123 miles.</p><p>The outbreak's scope can be quantified to this end by multiplying the track length of each twister by its EF rating, resulting in a preliminary value of 1,859 adjusted Fujita miles. According to a 2014 study, this means last week's twisters produced the sixth highest adjusted Fujita miles of any tornado outbreak since 1973, a statistic that helps explain the tremendous death toll.</p><p>The bottom line is that improving forecasts reduce but does not eliminate the danger of deadly tornadoes. In fact, research has shown the fatality risk escalating in some areas because of increasing population density and inadequate building construction in certain vulnerable zones. Efforts must continue to educate people, businesses and communities about tornado safety preparedness.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 The Washington Post</p></div>"}