{"date": "2022-02-08 16:41:14.989000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>TOUCHPOINT GROUP HOLDINGS INC (\"TGHI-0\")\n- Launches Touchpoint.Games for Virtual Game Development\n\n     Touchpoint Group Holdings, Inc. a media and digital technology holding\ncompany, announced the launch of Touchpoint.Games, the Company's new game\ndivision, with an initial focus on aerial esports competitions including\nthe development of VR games for the Company's AIR RACE subsidiary.\n\n     Touchpoint.Games is developing games for popular platforms such as\nOculus, Steam, Amazon Luna, Google Play, iOS gaming, and Origin. The games\nare being built on the leading developer platforms, including Adobe\nAnimate, Unity, Android Studio, Pygame, Unreal Engine, and Pixel Game Maker\nMV.\n\n     The launch of Touchpoint.Games follows the Company's recently\nannounced partnership with AppSwarm, Corp. (OTC: SWRM) to develop\nnon-fungible token (NFT) ecosystem around projects involved in metaverse\ngaming that hold both virtual and real-life uses. Touchpoint.Games will\nfocus on integrating NFT access passes, digital assets for in-game use,\nvirtual characters, and Play2Earn rewards around their game environments\nand platforms.\n\n     Touchpoint.Games plans to leverage its live AIR RACE event to develop\naerial gaming competitions utilizing advanced aerial mobility vehicle\nassets in virtual games. In addition to its own game development,\nTouchpoint.Games will explore a growth strategy through game acquisition\nand development collaborations.\n\n     AIR RACE World Championship is a race format originally developed by\nRed Bull as the Red Bull Air Race. It was founded in 2003 and has hosted 94\nchampionship series races around the globe. It has attracted viewers in 187\ncountries and has been broadcast to an audience of over 230 million viewers\nwith over 2.3 billion media impressions worldwide in its most recent\nseason. It is the largest live spectator sports event in the world\nattracting over 1 million spectators to a single air race on multiple\noccasions in cities such as Porto and Barcelona.\n\n     Spencer Christopher, CTO of Touchpoint Group, commented, \"Esports is\nthe most viewed competitive entertainment in the world, and the AIR RACE\nWorld Championship has set records for in person attendance. It's the\nperfect marriage of digital and physical and I am incredibly excited about\nthe opportunity we have right now at Touchpoint. We've seen entire\neconomies flourish out of AAA game titles, with marketplaces such as Valves\nSteam leading the way through their titles like Counter Strike and Dota. As\na result, we believe Touchpoint.Games will transform our established\nTouchpoint Connect platform.\"\n\n     For updates on Touchpoint.Games, please follow us at\n<a href=\"https://www.facebook.com/touchpointgames\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.facebook.com/touchpointgames</a>/\n\n     About Touchpoint Group Holdings.\n\n     Touchpoint Group Holdings Inc. is a media and digital technology\nacquisition and software company. For more information, see\n<a href=\"http://touchpointgh.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://touchpointgh.com</a>/.\n\n     Safe Harbor Statement\n\n     This news release may contain \"forward-looking\" statements. These\nforward-looking statements are only predictions and are subject to certain\nrisks, uncertainties and assumptions that could cause actual results to\ndiffer from those in the forward looking-statements. Potential risks\ninclude such factors as the inability to enter into agreements with parties\nwith whom we are in discussions, the uncertainty of consumer demand for the\nCompany's products, as well as additional risks and uncertainties that are\nidentified and described in the Company's SEC reports. Actual results may\ndiffer materially from the forward-looking statements in this press\nrelease. Statements made herein are as of the date of this press release\nand should not be relied upon as of any subsequent date. The Company does\nnot undertake, and it specifically disclaims, any obligation to update any\nforward-looking statements to reflect occurrences, developments, events or\ncircumstances after the date of such statement.\n\nContact\n\nCrescendo Communications, LLC\n212-671-1021\ntghi@crescendo-ir.com\n\nTel   : 305-420-6640    TOUCHPOINT GROUP HOLDINGS INC\nWWW   : <a href=\"https://www.touchpointgh.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.touchpointgh.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203800470.MNPRE2203802451-08244920220208</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}