{"date": "2022-02-01 23:18:43.204000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>GLOBEX DATA LTD (\"SWIS-Z;SWISF-0\")\n- GlobeX Data Update on Launch of SekurMessenger with America\n- Movil's Telcel - Aims to Replace WhatsApp for Business\n\n     GlobeX Data Ltd. (\"GlobeX\" or the \"Company\"), the leader in Swiss\nhosted secure communications and secure data management, is pleased to\nupdate its shareholders on its SekurMessenger Swiss hosted email and\nmessaging security and privacy solution launch with America Movil's Telcel\nunit in Mexico.\n\n     As previously announced in 2021, GlobeX is launching SekurMessenger,\nits Swiss hosted encrypted instant messaging, secure voice recording\ntransfer and secure file transfer application, with America Movi's Telcel\nmobile operator in Mexico. The secure messaging service has been fully\nintegrated with Telcel's billing and provisioning platform and the\ncommercial launch has started in the CDMX region, representing Mexico City\nand the greater Mexico City, a region covering 21.9 million people.\n\n     America Movi's Telcel has now approved the launch to go nationally to\nthe rest of Mexico and it will include the mass markets as well as\nbusinesses. Previously the launch of SekurMessenger was limited only to\ncorporate entities and large enterprises. The mass markets classification\nis composed of small businesses (SMB) and consumers. Once sales gain\nmomentum in Mexico, the launch is planned to expand to other countries\nwhere America Movil operates through its Claro brand, such as Colombia,\nPeru and other Latin American countries, as the business grows over the\ncoming years.\n\n     GlobeX Data and America Movil are looking at offering a secure and\nprivate alternative to other non-secure and non-private messaging\napplications. The market is geared primarily for business and government\nusers, and privacy conscious consumers. According information published on\nAmerica Movi's website, Telcel is the largest mobile operator in Mexico,\nwith over 75 million mobile subscribers. America Movil is the 7th largest\ntelecom operator in the world with over 277 million mobile subscribers in\nover 20 countries throughout Latin America and Europe. Its shares trade in\nthe New York Stock Exchange under ticker AMX.\n\n     Recent data breaches in messaging applications and in particular in\nthe WhatsApp application have created a certain urgency for businesses and\ndata privacy advocates to protect their communications form cyber-attacks\nand identity theft via mobile and desktop devices.\n\n     SekurMessenger eliminates many of the privacy and security risks by\nnot only not requiring a phone number, which would divulge a user's phone\ndevice ID, but also by not social engineering a user's phone or computer\ncontact list and infecting the contacts by default as well, eliminating a\nhuge loophole in security and privacy. SekurMessenger issue each user a\nusername and a SM number. The SM number is the contact ID a user would\ndisclose in order for other SM users to be added. As the Introduction Video\ndemonstrates, the service comes with a self-destruct timer and other\nfeatures as well, including GlobeX's proprietary VirtualVaults and HeliX\ntechnologies with all data stored in Swiss hosted encrypted servers.\n\n     Additionally, SekurMessenger now comes with a proprietary feature and\ntechnology called Chat by Invites. This feature allows a SekurMessenger\nuser (\"SM user\") invite a non-SM user, or a group of non-SM users, by\nsending an SMS or email to the recipient, to chat in a fully private and\nsecure way, without the recipient ever having to register to SekurMessenger\nor download the app. At the end of the chat, the initiator of the\nconversation can remotely terminate the conversation and all traces of the\nconversation are deleted from all users, including the recipient. This\nunique feature is now fully deployed and functional on all iOS and Android\ndevices and web platforms. The target sectors are numerous, including but\nnot limited to legal, financial, government, real estate, energy, mining,\nmanufacturing, trade and medical sectors.\n\n     Alain Ghiai, CEO of GlobeX Data said: \"We are very happy to have been\napproved for the national launch of SekurMessenger with Telcel, and to have\nbeen approved for the mass market segment as well. We are now looking\nforward to start generating revenues from all of Mexico from government\norganizations, businesses, and consumers. We know that in certain sectors,\nthere is a growing demand to replace WhatsApp as a business messaging\nsolution. SekurMessenger is here to satisfy that demand, and as we are not\nconnected, and never have been connected, to AWS, Microsoft Azure or Google\nCloud platforms, commonly referred to as \"Big Tech\", we can offer a truly\nindependent, private and secure means of communications through secure\nmessaging, secure voice record transfer and secure email through our\nproprietary technology and our secure servers based in Switzerland. We are\nlooking forward to expand in Central and Latin America in the coming years,\nas we plan to launch with other partners in the region as well. According\nto statista.com and other information sites, there are over 580 million\npeople speaking Spanish in Latin America alone, and with security and\nprivacy becoming a global concern, we have seen a surge in demand and\ninquiries for our secure and private communications solutions.\"\n\n     GlobeX's Data privacy solutions are all hosted in Switzerland,\nprotecting users' data from any outside data intrusion requests. In\nSwitzerland, the right to privacy is guaranteed in article 13 of the Swiss\nFederal Constitution. The Federal Act on Data Protection (\"FADP\") of 19\nJune 1992 (in force since 1993) has set up a strict protection of privacy\nby prohibiting virtually any processing of personal data which is not\nexpressly authorized by the data subjects. The protection is subject to the\nauthority of the Federal Data Protection and Information Commissioner.\n\n     Under Swiss federal law, it is a crime to publish information based on\nleaked \"secret official discussions.\" In 2010 the Federal Supreme Court of\nSwitzerland found that IP addresses are personal information and that under\nSwiss privacy laws they may not be used to track Internet usage without the\nknowledge of the individuals involved.\n\n     About GlobeX Data Ltd.\n     GlobeX Data Ltd. is a Cybersecurity and Internet privacy provider of\nSwiss hosted solutions for secure communications and secure data\nmanagement. The Company distributes a suite of secure encrypted e-mails,\nand secure communication tools, secure cloud-based storage, disaster\nrecovery and document management. GlobeX Data Ltd. sells its products\nthrough its approved wholesalers and distributors, and telecommunications\ncompanies worldwide. GlobeX Data Ltd. serves consumers, businesses and\ngovernments worldwide.\n\nOn behalf of Management\nGLOBEX DATA LTD.\nAlain Ghiai\nPresident and Chief Executive Officer\n+1.416.644.8690\ncorporate@globexdatagroup.com\n\n     For more information, please contact GlobeX Data at\ncorporate@globexdatagroup.com or visit us at <a href=\"https://globexdata.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://globexdata.com</a>.\n\nFor more information on Sekur visit us at: <a href=\"https://www.sekur.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.sekur.com</a>.\n\n     Forward Looking Information\n     This news release contains certain forward-looking information within\nthe meaning of applicable Canadian securities laws (\"forward-looking\nstatements\"). All statements other than statements of present or historical\nfact are forward-looking statements. Forward-looking statements are often,\nbut not always, identified by the use of words such as \"anticipate\",\n\"achieve\", \"could\", \"believe\", \"plan\", \"intend\", \"objective\", \"continuous\",\n\"ongoing\", \"estimate\", \"outlook\", \"expect\", \"project\" and similar words,\nincluding negatives thereof, suggesting future outcomes or that certain\nevents or conditions \"may\" or \"will\" occur. These statements are only\npredictions. These statements reflect management's current estimates,\nbeliefs, intentions and expectations; they are not guaranteeing future\nperformance. GlobeX cautions that all forward-looking statements are\ninherently uncertain and that actual performance may be affected by a\nnumber of material factors, many of which are beyond GlobeX's control. Such\nfactors include, among other things: risks and uncertainties relating to\nthe future of the Company's business; the success of marketing and sales\nefforts of the Company; the projections prepared in house and projections\ndelivered by channel partners; the Company's ability to complete the\nnecessary software updates; increases in sales as a result of investments\nsoftware development technology; consumer interest in the Products; future\nsales plans and strategies; reliance on large channel partners and\nexpectations of renewals to ongoing agreements with these partners;\nanticipated events and trends; the economy and other future conditions; and\nother risks and uncertainties, including those described in GlobeX's\nprospectus dated May 8, 2019 filed with the Canadian Securities\nAdministrators and available on www.sedar.com. Accordingly, actual and\nfuture events, conditions and results may differ materially from the\nestimates, beliefs, intentions and expectations expressed or implied in the\nforward-looking information. Except as required under applicable securities\nlegislation, GlobeX undertakes no obligation to publicly update or revise\nforward-looking information.\n\nTel   : 416-644-8690    GLOBEX DATA LTD\nWWW   : <a href=\"https://www.globexdatagroup.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.globexdatagroup.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2203100273.MNPRE2203102115-07160920220201</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}