{"date": "2022-02-01 00:21:11.426000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2991.47, "close": 3012.25}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"storyframe\" id=\"storydiv\"><div class=\"TEXT\" id=\"storybody\" name=\"storybody\"><div id=\"storybodycontent0\"><span class=\"storycontent\"><pre>Click the following link to watch video: <a href=\"https://share.newscasts.refinitiv.com/link?entryId=1_jbo52m0f&amp;referenceId=tag:reuters.com,2022:newsml_OVFWKME17_930&amp;pageId=RefinitivNewscasts\" data-type=\"url video-url\" translate=\"no\">https://share.newscasts.refinitiv.com/link?entryId=1_jbo52m0f&amp;referenceId=tag:reuters.com,2022:newsml_OVFWKME17_930&amp;pageId=RefinitivNewscasts</a></pre>Source: Reuters<br/><br/>Description: The three main benchmarks closed higher on Monday with the gains helping the Nasdaq narrowly avoid its worst ever January. This report produced by Chris Dignam.<br/>Short Link: <a href=\"https://refini.tv/3KRQOt8\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://refini.tv/3KRQOt8</a><br/><br/>Video Transcript:<br/><br/>Stocks finished higher on Monday, closing out a volatile month for Wall Street, with the day's gains helping the tech-heavy NASDAQ narrowly avoid its worst ever start to the year. The NASDAQ gained a whopping 3.4% on Monday, while the S&amp;P and Dow Jones also finished strong for the day. The NASDAQ finished the month down roughly 9%, just ahead of its worst January performance on record, when it fell close to 10% in 2008. The bellwether S&amp;P 500 had its worst month since March 2020 when the pandemic hit. But Kevin Mahn, the President and Chief Investment Officer at Hennion &amp; Walsh Asset Management, said he believes the stock market will bounce back from a rough January.<br/><br/>There's some recent research from LPL that supports that belief as there have been only other six times in history where the S&amp;P 500 has experienced a correction as quickly as it has in 2022. And here's the silver lining, in all six of those cases, the stock market was higher six months from those points in time by an average of 15%.<br/><br/>Shares of Netflix surged after Citigroup upgraded the streaming company's stock to buy. It comes just days after it was revealed that billionaire investor Bill Ackman had taken a position in the company. Shares of Tesla jumped after Credit Suisse raised the electric car maker's stock rating to outperform. Bank stocks also rose as a widely watched section of the US Treasury yield curve flattened to its lowest levels since October 2020. And the fourth quarter earnings season rolls on with megacaps Amazon, Meta Platforms, formerly Facebook, and Google parent Alphabet all expected to report later this week.</span></div></div></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - http://about.reuters.com/fulllegal.asp</p></div>"}