{"date": "2022-01-13 17:29:24.569000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3304.14, "close": 3242.76}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-abstract\"><p>The National Company Law Appellate Tribunal (NCLAT) has agreed to hear US e-commerce firm Amazon\u0092s plea challenging the Competition Commission of India\u0092s (CCI\u0092s) suspension of approval to the 2019 transaction with Future Group on February 2.</p></div><div class=\"tr-npp-lead\"><p>The appellate tribunal has directed CCI and Future Coupons Pvt Ltd (FCPL) to file their reply in the next 10 days and Amazon to file a rejoinder.</p><p>Sources said Amazon made many arguments in its petition to NCLAT, including saying that deal with Future was signed in April 2019, and the complaint was filed towards the end of 2021 and according to the law, CCI did not have the right to unwind a transaction post-12 months. The e-commerce firm also has contended that the fine imposed by CCI was way more than the penalties charged in previous cases.</p></div><div class=\"tr-npp-body\"><p>Last year in December, the CCI suspended Amazon\u0092s 2019 deal worth ~1,500 crore with Future Retail, citing the company\u0092s alleged deliberate design to suppress information about the scope and purpose of the deal. The antitrust regulator imposed a penalty of ~200 crore on Amazon to be paid within 60 days of receipt of the order.</p><p>This month, Amazon filed a legal challenge at the NCLAT against the CCI suspension of the e-commerce firm\u0092s 2019 deal with Future Retail (FRL). Parallelly, Amazon\u0092s Indian unit also approached the Supreme Court against a halt on an arbitration case against Future Retail\u0092s (FRL) asset sale to Reliance Industries (RIL).</p><p>The Confederation of All India Traders (CAIT), which represents about 70 million traders, said NCLAT has also refused to grant interim relief to Amazon and to stay the CCI order. It said in December 2021, CCI held that Amazon misguided, did not make full disclosure, and suspended approval granted to Amazon.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Business Standard Ltd.</p></div>"}