{"date": "2021-12-14 14:01:51+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><br/>\nBy Staff Writer<br/>\n<div>\n<div>\n<div>\n<div>\n<div>LONDON: Al Arabiya announced on Tuesday that the news network has cooperated with Amazon’s Alexa, the virtual voice assistant, to be the voice of its newly launched Arabic-language news service.</div>\n</div>\n</div>\n</div>\n<div data-io-article-url=\"https://www.arabnews.com/node/1986821/media\">\n<p>General Manager of Al Arabiya, Mamdouh Al-Muhaini said: “The smart virtual voice assistant will allow you to access the most important news, with the help of Al-Arabiya’s presenter, and will provide you with a short bulletin full of the latest regional and international news.”</p>\n<p>“Alexa and Al Arabiya have agreed to provide the voice service for the daily newsletters,” Al-Muhaini said. “Alexa has also decided to provide news in Arabic to its customers, as well as other voice commands to play music, play audio books, access weather information, traffic and sports.”</p>\n<p>Last week, Amazon officially introduced Alexa to the Middle East, starting with Saudi Arabia and the UAE.</p>\n<p>The virtual voice assistant can now speak in Arabic and understands local dialects from the region.</p>\n<p>Not only that, but the virtual voice assistant can also understand cultural references.</p>\n<p>For example, Alexa can tell customers when the next prayer time is or when the next Eid falls.</p>\n</div>\n</div>\n<p class=\"syndigate_disclaimer\">Copyright: Arab News © 2021 All rights reserved. Provided by SyndiGate Media Inc. (<a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a>).</p>\n<div class=\"footnote-disclaimer\">Disclaimer: The content of this article is syndicated or provided to this website from an external third party provider. We are not responsible for, and do not control, such external websites, entities, applications or media publishers. The body of the text is provided on an “as is” and “as available” basis and has not been edited in any way. Neither we nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this article. <a href=\"https://d3a0oa8cittb3t.cloudfront.net/researchreports/Disclaimers/TR%20Disclaimer.pdf\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Read our full disclaimer policy here</a>.</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Arab News</p></div>"}