{"date": "2021-11-14 02:33:55.867000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3525.15, "close": 3540.7}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>In the framework of the fight against the COVID-19 pandemic, the Government approved the transfer of four budget items in favor of the Ministry of Health (Minsa) for a total of S / 92 374 806, which will be used to strengthen the epidemiological surveillance and the first level of care, as well as financing health interventions in the Peruvian Amazon, as the head of the sector, Hernando Cevallos Flores, had advanced this week.</p><p>Minister Cevallos stressed that these transfers are part of this Government's decision to continue prioritizing the fight against the pandemic. In this case, this new budget will make it possible to strengthen the COVID-19 care and isolation centers at the national level and reinforce the vaccination strategy for indigenous or native peoples.</p></div><div class=\"tr-npp-body\"><p>Continuity of CAAT</p><p>Among the supreme decrees in favor of the Minsa, published on November 5 in El Peruano, the Supreme Decree No. 305-2021-EF stands out, which authorizes a budget of S / 25 684 935 for the strengthening of the Care and Isolation Centers Temporary (CAAT). This rule seeks to guarantee the care, isolation and recovery of patients affected by the coronavirus.</p><p>?This is very good news because it will allow us to strengthen all the temporary isolation centers and prepare ourselves so that, if the volume of patients increases, we will have special centers to be able to contain, with the security of the case, people who have some level complications from COVID-19. More than 25 million 684 thousand soles have been earmarked for this, ?said the head of the Minsa.</p><p>In addition, through Supreme Decree No. 303-2021-EF, an amount of S / 2 351 030 is transferred to the Minsa to finance the strengthening of the Epidemiological Surveillance and the National Epidemiology Network (RENACE).</p><p>The same rule also establishes the transfer of the sum of S / 3 012 966 in favor of the governing body and the Regional Governments to finance intensive psychosocial support for girls, boys and adolescents in a situation of orphans due to COVID-19. This budget is framed in number 61.2 of article 61 of Law N ? 31084 that orders the financing of prevention, control, surveillance and health response actions in the face of the pandemic.</p><p>?These 3 million soles will allow us to work in an underserved area in our country, which is the psychosocial impact that COVID-19 has generated on us, especially in children, so that we can move in the right direction by healing wounds. that causes the loss of family members, ?added the minister.</p><p>Intervention in indigenous peoples</p><p>In parallel, the Ministry of Economy and Finance (MEF) was authorized to transfer S / 27 761 119 to the Health sector to finance health interventions for Amazonian indigenous peoples against COVID-19 and the acquisition of basic prevention kits for the Community Health Agents.</p><p>\"We also have more than 27 million 761 thousand to strengthen the strategy to address indigenous or native peoples who have enormous difficulties in accessing health, education and adequate vaccination,\" Cevallos Flores highlighted.</p><p>The transfer of this item in the Public Sector Budget for Fiscal Year 2021 was approved by Supreme Decree No. 304-2021-EF, which will allow the execution of prevention actions for the vulnerable population of the Amazon.</p><p>?We have allocated money to hire links to reach the communities and discuss with them the convenience of vaccination, to purchase fuel so that our brigades can travel. In general, anything that means investing in the right to health is good for the country, \"he added.</p><p>Payment to health professionals</p><p>Another of the provisions of the Executive Power for the benefit of the health of the Peruvian population, is reflected in Supreme Decree No. 306-2021-EF that assigns S / 33 564 756 to finance the payment for complementary services performed by professionals of the health until August of this year in the context of COVID-19.</p><p>The legal provisions - which are endorsed by the President of the Republic, Pedro Castillo; the Minister of Health, Hernando Cevallos; and the Minister of Economy and Finance, Pedro Francke? specify that the transferred resources cannot be used, under responsibility, for different purposes for which they have been destined.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Euclid Infotech Pvt Ltd.</p></div>"}