{"date": "2021-12-01 20:13:28.612000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>CANADIAN NEXUS TEAM VENTURES CORP (\"TEAM-Z\")\n- Media Subsidiary\n\n     Canadian Nexus Team Ventures Corp. (\"Team\" or the \"Company\") Creates\n100% owned Media Division.\n\n     Canadian Nexus Team Ventures Corp. is pleased to announce the creation\nof Polar Bear Universal Media Corp. (\"Polar Bear\") resulting in a new media\ndivision for the Company.\n\n     Founded by top award-winning industry veterans with extensive\nexperience in; traditional and digital entertainment, marketing, licensing,\nsponsorship, corporate strategy and partnerships, education, and video and\nmobile gaming. Polar Bear will create and implement compelling narratives\nand content intrinsically integrated across multiple mediums in innovative\nways to produce strong return on investment dollars for our partners and\ncollaborators.\n\n     Polar Bear will cultivate, design, and execute on projects in\nmetaverse creation and new technologies. The first project includes\nintegrated global campaigns, the development of a wholly-owned metaverse,\nan immersive giant screen film, suitable for IMAX theatres, TV pilot\ndesigned for a major streaming service (Netflix, Apple, Amazon),\nfree-to-play mobile games, an influencer campaigns, including key\npartnerships with major global brands.\n\n     \"Polar Bear is the culmination of my life's work in entertainment and\nmarketing. The opportunities offered to create and distribute actual\nengagement between brands and consumers is truly a win win scenario, where\nconsumers get the content and the engagement they want, at no cost to them\nand brands and corporate partners get meaningful effective ROI on their\nmarketing expense - we firmly believe this can and will be a Media company\nlike no other,\" explains Scott Davis, President of Polar Bear Universal.\n\n     \"This investment will play a significant role in shaping our portfolio\nin the future. Not only from fiscal performance but through cross brand\nenhancement and synergies.  The team has come together very well and\nalready presented significant opportunities.  As these opportunities come\nto fruition, we look forward to sharing them with our shareholders,\" stated\nCEO Arni Johannson.\n\n     Polar Bear will be led by Scott Davis, Scott has over 25 years'\nexperience in marketing with a primary focus in sponsorship and business\ndevelopment in the entertainment industry. His experience includes\nvirtually every role in the creation, evaluation, sale, activation,\ndistribution, and marketing and promotion of integrated sponsorship\nproperties. He has worked for or with sponsors, evaluation firms, agencies,\nmedia partners, licensing firms, sponsor rights holders, and corporate\npartners. The majority of his experience has been in the demographic of\naction sports and other core markets. He specializes in the global campaign\nintegration and leverage of large companies marketing, promotions,\nsponsorship and corporate partnership strategies.\n\n     About Canadian Nexus Team Ventures Corp.\n\n     Canadian Nexus Team Ventures Corp. is an investment issuer that\nactively invests in a diversified portfolio of early-stage to mid-level\ncompanies and projects. Canadian Nexus leverages its extensive network of\noperators and global thought leaders to provide investors with a unique\nmulti-opportunity portfolio.\n\n     Forward-Looking Statements:\n\n     This news release includes certain forward-looking statements and\nforward-looking information (collectively, \"forward-looking statements\")\nwithin the meaning of applicable Canadian securities legislation. All\nstatements, other than statements of historical fact, included herein\nincluding, without limitation, statements about timing, future projects and\nfuture revenues are forward-looking statements. Although the Company\nbelieves that such statements are reasonable, it can give no assurance that\nsuch expectations will prove to be correct. Often, but not always,\nforward-looking information can be identified by words such as \"pro forma\",\n\"plans\", \"expects\", \"will\", \"may\", \"should\", \"budget\", \"scheduled\",\n\"estimates\", \"forecasts\", \"intends\", \"anticipates\", \"believes\", \"potential\"\nor variations of such words including negative variations thereof, and\nphrases that refer to certain actions, events or results that may, could,\nwould, might or will occur or be taken or achieved. Forward-looking\nstatements involve known and unknown risks, uncertainties, and other\nfactors which may cause the actual results, performance, or achievements of\nthe Company to differ materially from any future results, performance or\nachievements expressed or implied by the forward-looking statements. Such\nrisks and other factors include, among others, statements as to the\nanticipated business plans and timing of future activities of the Company\nand it's wholly-owned subsidiaries, including the ability of the Company to\nobtain sufficient financing to fund its business activities and plans,\ndelays in obtaining regulatory approvals (including of the Canadian\nSecurities Exchange), changes in laws, regulations, and policies affecting\nthe Company's operations and the Company's limited operating history.\n\n     Readers are cautioned not to place undue reliance on forward-looking\nstatements. The Company undertakes no obligation to update any of the\nforward-looking statements in this presentation or incorporated by\nreference herein, except as otherwise required by law.\n\n     The Canadian Securities Exchange has not approved nor disapproved the\ncontents of this news release\n\n     Contact:\n\n     Arni Johannson, CEO\n     604-960-1878\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133400860.MNPRE2133403181-11511520211201</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}