{"date": "2022-01-23 23:00:00.220000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2890.88, "close": 2777.45}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Pandemic Accelerates Australian Digital Transformations, Leading More Firms to Seek Out AWS Provider Partners</b>\n</p><p class=\"bwalignc\">\n<b>ISG Provider Lens™ report finds enterprises migrating to cloud platforms even faster as disruptions intensify their need for agility, competitiveness and lower costs</b>\n</p><p>\nThe effects of the COVID-19 pandemic have led more Australian enterprises to speed up and expand their digital transformations, generating growing demand for cloud-native IT solutions on hyperscaler platforms, including Amazon Web Services (AWS), according to a new research report published today by Information Services Group (<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.isg-one.com&amp;esheet=52566651&amp;newsitemid=20220123005018&amp;lan=en-US&amp;anchor=ISG&amp;index=1&amp;md5=367831f6d742fbdf3f02e8e2216244ab\" data-type=\"url\" class=\"tr-link\" translate=\"no\">ISG</a>) (Nasdaq: <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.nasdaq.com%2Fsymbol%2Fiii&amp;esheet=52566651&amp;newsitemid=20220123005018&amp;lan=en-US&amp;anchor=III&amp;index=2&amp;md5=efd13e898ed0e784b61f887e0591a7ed\" data-type=\"url\" class=\"tr-link\" translate=\"no\">III</a>), a leading global technology research and advisory firm.\n</p><p>\nThe 2021 ISG Provider Lens™ AWS Ecosystem Partners report for Australia finds organizations are seeking cloud solutions that reduce costs, improve business agility, enhance security and deliver measurable business results. This growing demand has increased companies’ engagement with service providers that work with AWS.\n</p><p>\n“Innovative service providers are responding to Australia’s enterprise public cloud trend by extending and promoting their services and capabilities, even as they adapt their own businesses to new requirements such as remote work,” said Scott Bertsch, partner and regional leader, ISG Asia Pacific. “AWS is playing its part by investing in new tools and services and spending heavily on partnerships with providers.”\n</p><p>\nManaged service providers (MSPs) have taken on more of what were traditionally considered system integrator roles as more companies move to the cloud and adjust to pandemic-related disruptions, the report says. Many MSPs are investing in additional skills, acquiring other providers and expanding their roles with AWS.\n</p><p>\nDigital transformation has made Australian enterprises more aware of how much business data they can gather and use, and the recent disruptions have made the need for data even more urgent, ISG says. More companies are now seeking advanced data analytics capabilities, including the use of machine learning, and many have adopted AWS as the platform of choice for these functions. Amid the shortage of skilled personnel in this field, enterprises are turning to service providers for analytics capabilities.\n</p><p>\nThe sharp expansion of remote work during the pandemic, as well as industrial disruptions such as supply chain issues and plant shutdowns and reconfigurations, have increased Australian investments in IoT, according to ISG. In response, service providers have quickly aligned their portfolios with the changing market, adding complementary services such as IoT analytics.\n</p><p>\nMany Australian companies pursuing digital transformation are migrating their SAP instances to AWS or implementing entirely new instances on the platform, the report says. The pandemic has only increased the pressure to move workloads to the cloud, and many enterprises are engaging with providers of SAP migration and management services.\n</p><p>\nThe ongoing business disruptions and transformations in Australia have also increased demand for enterprise IT consulting services covering workload migration, application modernization, workplace transformation, security, governance and other needs, ISG says. With the growing use of AWS as a core IT platform, demand for consulting services from providers that are partnered with AWS is also increasing.\n</p><p>\nThe 2021 ISG Provider Lens™ AWS Ecosystem Partners report for Australia evaluates the capabilities of 38 providers across six quadrants: AWS Managed Services, AWS SAP Workloads, AWS Data Analytics and Machine Learning, AWS Internet of Things (IoT) Services, AWS Migration Services, and AWS Consulting Services.\n</p><p>\nThe report names Accenture, Deloitte and TCS as Leaders in all six quadrants. It names DXC Technology, Infosys and Versent as Leaders in four quadrants each and AC3 and Cognizant as Leaders in three quadrants each. HCL and Wipro are named as Leaders in two quadrants each, and Datacom, Intellify and Telstra Purple are named as Leaders in one quadrant each.\n</p><p>\nIn addition, Slalom is named as a Rising Star—a company with a “promising portfolio” and “high future potential” by ISG’s definition—in two quadrants. CMD, Datacom and Lemongrass are named as Rising Stars in one quadrant each.\n</p><p>\nA customized version of the report is available from <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.tcs.com%2Ftcs-leader-aws-services-australia&amp;esheet=52566651&amp;newsitemid=20220123005018&amp;lan=en-US&amp;anchor=TCS&amp;index=3&amp;md5=b3aa8bc9eeeda16b5a28a926f7ffbb1e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">TCS</a>.\n</p><p>\nThe 2021 ISG Provider Lens™ AWS Ecosystem Partners report for Australia is available to subscribers or for one-time purchase on this <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fresearch.isg-one.com%2Freportaction%2FQuadrant-AWS-Australia-2021%2FMarketing&amp;esheet=52566651&amp;newsitemid=20220123005018&amp;lan=en-US&amp;anchor=webpage&amp;index=4&amp;md5=ff7419540daf4b7432b5f634a2b5bd25\" data-type=\"url\" class=\"tr-link\" translate=\"no\">webpage</a>.\n</p><p>\n<b>About ISG Provider Lens™ Research</b>\n</p><p>\nThe ISG Provider Lens™ Quadrant research series is the only service provider evaluation of its kind to combine empirical, data-driven research and market analysis with the real-world experience and observations of ISG's global advisory team. Enterprises will find a wealth of detailed data and market analysis to help guide their selection of appropriate sourcing partners, while ISG advisors use the reports to validate their own market knowledge and make recommendations to ISG's enterprise clients. The research currently covers providers offering their services globally, across Europe, as well as in the U.S., Canada, Brazil, the U.K., France, Benelux, Germany, Switzerland, the Nordics, Australia and Singapore/Malaysia, with additional markets to be added in the future. For more information about ISG Provider Lens research, please visit this <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fc212.net%2Fc%2Flink%2F%3Ft%3D0%26l%3Den%26o%3D2369469-1%26h%3D861603975%26u%3Dhttps%253A%252F%252Fisg-one.com%252Fresearch%252Fisg-provider-lens%26a%3Dwebpage&amp;esheet=52566651&amp;newsitemid=20220123005018&amp;lan=en-US&amp;anchor=webpage&amp;index=5&amp;md5=23c37d73dc35a71ce69954b9c0c84899\" data-type=\"url\" class=\"tr-link\" translate=\"no\">webpage</a>.\n</p><p>\nA companion research series, the ISG Provider Lens Archetype reports, offer a first-of-its-kind evaluation of providers from the perspective of specific buyer types.\n</p><p>\n<b>About ISG</b>\n</p><p>\nISG (Information Services Group) (Nasdaq: <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.nasdaq.com%2Fsymbol%2Fiii&amp;esheet=52566651&amp;newsitemid=20220123005018&amp;lan=en-US&amp;anchor=III&amp;index=6&amp;md5=cd096c85eddc332e3a39f8c1489722d2\" data-type=\"url\" class=\"tr-link\" translate=\"no\">III</a>) is a leading global technology research and advisory firm. A trusted business partner to more than 800 clients, including more than 75 of the world’s top 100 enterprises, ISG is committed to helping corporations, public sector organizations, and service and technology providers achieve operational excellence and faster growth. The firm specializes in digital transformation services, including automation, cloud and data analytics; sourcing advisory; managed governance and risk services; network carrier services; strategy and operations design; change management; market intelligence and technology research and analysis. Founded in 2006, and based in Stamford, Conn., ISG employs more than 1,300 digital-ready professionals operating in more than 20 countries—a global team known for its innovative thinking, market influence, deep industry and technology expertise, and world-class research and analytical capabilities based on the industry’s most comprehensive marketplace data. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.isg-one.com&amp;esheet=52566651&amp;newsitemid=20220123005018&amp;lan=en-US&amp;anchor=www.isg-one.com&amp;index=7&amp;md5=6dfde59a82a197b309cba3cf252e8528\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.isg-one.com</a>.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20220123005018r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjIwMTIzMDA1MDE4cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=283eac4727385251ddce9d8def4bff6d4f863d4767d292da2237e0758226abab2f5f2439bb3f9100a82be5a9132d0e2885cacdb927144433ae08f2fcc074ab86\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20220123005018/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220123005018/en/</a></span></p><p>\n<b>Press Contacts:\n<br/>\n</b><br/>Will Thoretz, ISG\n<br/>+1 203 517 3119\n<br/><a href=\"mailto:will.thoretz@isg-one.com\" data-type=\"email\" translate=\"no\">will.thoretz@isg-one.com</a><br/>\n<br/>Erik Arvidson, Matter Communications for ISG\n<br/>+1 617 874 5214\n<br/><a href=\"mailto:isg@matternow.com\" data-type=\"email\" translate=\"no\">isg@matternow.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2022</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: ISG</p></div>"}