{"date": "2021-11-03 11:47:16+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n                  <span>\n                    <strong>New York, USA and Bangalore, India - November 3, 2021</strong>: Wipro Limited (NYSE: WIT, BSE: 507685, NSE: WIPRO), a leading global information technology, consulting and business process services company, today announced that it has been recognized as the 'AWS Migration Success Partner of the Year 2021 - India' at the Amazon Web Services (AWS) Partner Summit Online in India.</span>\n                </p>\n                <p>\n                  <span>The <a href=\"https://press.aboutamazon.in/news-releases/news-release-details/aws-announces-winners-apn-awards-2021-india\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AWS Partner Network (APN) awards</a> recognises technology leaders that play a key role in helping organisations build solutions on AWS and accelerating innovation. The 'AWS Migration Success Partner of the Year 2021 Award' is given to an AWS Partner who has scaled customer engagement, cloud adoption and migration to AWS during the qualifying period.</span>\n                </p>\n                <p>\n                  <span>Wipro, an AWS Premier Consulting Partner, focuses on enabling enterprises navigate their transformation journey across the entire cloud lifecycle, helping customers make the most of AWS's unmatched portfolio of cloud capabilities across strategy, migration, innovation and operations. Wipro won the 'AWS Migration Success Partner of the year 2021 - India' award for originating multiple large migration customer wins on AWS, and for supporting global customers in financial services and telecom domains in 2020. Wipro has also achieved eight AWS Competencies and continues to participate in several AWS partner programs. Wipro's AWS LaunchPad, a co-innovation center in India and other geographies, has helped customers gain from the 'as-a-Service' economy through its vast industry domain expertise and proven approach.</span>\n                </p>\n                <p>\n                  <span>\n                    <strong>Anshul Sarin, Vice President and Head of Asia Pacific-Middle East-Africa (APMEA), Cloud and Infrastructure Services, Wipro Limited</strong> said, \"We are delighted to win this prestigious award from AWS. This recognition highlights our synergies stemming from our collaboration with AWS, and deep expertise in enabling cloud led transformation for large and complex migrations. Wipro's 'business-first' strategy supported by strong industry solutions, uniquely positions us to support today's modern enterprises, enhance the customer experience, drive business acceleration and increase connected insights. We look forward to building on our productive partnership with AWS, while continuing to deliver innovative services to our customers in India.\"<br/></span>\n                </p>\n                <p>\n                  <span>Wipro also recently announced the launch of <a href=\"https://www.wipro.com/cloud/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Wipro FullStride Cloud Services</a> and its commitment to invest $1 billion in cloud technologies, capabilities, acquisitions and partnerships over the next three years.<br/></span>\n                </p>\n                <p>\n                  <span>India is one of the six focus regions that comprise Wipro's APMEA Strategic Market Unit. With several decades of a strong presence in the Indian market, long standing customer and partner relationships, Wipro is widely recognized for its technology leadership, innovation and contribution towards social good.</span>\n                  <br/>\n                </p>\n                <p>\n                  <span>About Wipro Limited</span>\n                  <br/>\n                </p>\n                <p>\n                  <span>Wipro Limited (NYSE: WIT, BSE: 507685, NSE: WIPRO) is a leading global information technology, consulting and business process services company. We harness the power of cognitive computing, hyper-automation, robotics, cloud, analytics and emerging technologies to help our clients adapt to the digital world and make them successful. A company recognized globally for its comprehensive portfolio of services, strong commitment to sustainability and good corporate citizenship, we have over 220,000 dedicated employees serving clients across six continents. Together, we discover ideas and connect the dots to build a better and a bold new future.</span>\n                </p>\n                <p>\n                  <span>Media Contact:</span>\n                  <br/>\n                </p>\n                <p>\n                  <span>Nisha Chandrasekaran<br/>\n         Wipro Limited<br/><a href=\"mailto:nisha.chandrasekaran@wipro.com\" data-type=\"email\" translate=\"no\">nisha.chandrasekaran@wipro.com</a></span>\n                </p>\n                <p>\n                  <span>Forward-Looking Statements</span>\n                </p>\n                <p>\n                  <span>The forward-looking statements contained herein represent Wipro's beliefs regarding future events, many of which are by their nature, inherently uncertain and outside Wipro's control. Such statements include, but are not limited to, statements regarding Wipro's growth prospects, its future financial operating results, and its plans, expectations and intentions. Wipro cautions readers that the forward-looking statements contained herein are subject to risks and uncertainties that could cause actual results to differ materially from the results anticipated by such statements. Such risks and uncertainties include, but are not limited to, risks and uncertainties regarding fluctuations in our earnings, revenue and profits, our ability to generate and manage growth, complete proposed corporate actions, intense competition in IT services, our ability to maintain our cost advantage, wage increases in India, our ability to attract and retain highly skilled professionals, time and cost overruns on fixed-price, fixed-time frame contracts, client concentration, restrictions on immigration, our ability to manage our international operations, reduced demand for technology in our key focus areas, disruptions in telecommunication networks, our ability to successfully complete and integrate potential acquisitions, liability for damages on our service contracts, the success of the companies in which we make strategic investments, withdrawal of fiscal governmental incentives, political instability, war, legal restrictions on raising capital or acquiring companies outside India, unauthorized use of our intellectual property and general economic conditions affecting our business and industry. The conditions caused by the COVID-19 pandemic could decrease technology spending, adversely affect demand for our products, affect the rate of customer spending and could adversely affect our customers' ability or willingness to purchase our offerings, delay prospective customers' purchasing decisions, adversely impact our ability to provide on-site consulting services and our inability to deliver our customers or delay the provisioning of our offerings, all of which could adversely affect our future sales, operating results and overall financial performance. Our operations may also be negatively affected by a range of external factors related to the COVID-19 pandemic that are not within our control. Additional risks that could affect our future operating results are more fully described in our filings with the United States Securities and Exchange Commission, including, but not limited to, Annual Reports on Form 20-F. These filings are available at <a href=\"https://nam04.safelinks.protection.outlook.com/?url=http%3A%2F%2Fwww.sec.gov%2F&amp;data=04%7C01%7Csanreddy%40adobe.com%7Ceb1dcb6706ea4ecf260208d9949aa239%7Cfa7b1b5a7b34438794aed2c178decee1%7C0%7C0%7C637704214136542850%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C1000&amp;sdata=TbptGS1I8mKOd6iiKue3lMFMNgOdNmnqiDDfrcBQICo%3D&amp;reserved=0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.sec.gov</a>. We may, from time to time, make additional written and oral forward-looking statements, including statements contained in the company's filings with the Securities and Exchange Commission and our reports to shareholders. We do not undertake to update any forward-looking statement that may be made from time to time by us or on our behalf.</span>\n                </p>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.wipro.com/newsroom/press-releases/2021/wipro-named-aws-migration-success-partner-of-the-year-2021-in-india/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Wipro Limited</strong> published this content on <strong>03 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>03 November 2021 11:47:16 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Wipro Limited</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Wipro-Limited</p></div>"}