{"date": "2022-02-03 23:54:22.693000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3012.25, "close": 3152.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon is raising the price of its Prime membership for the first time since 2018.</p><p>An annual membership will go up $20 from $119 to $139 and the monthly fee will go up $2 from $12.99 to $14.99, the company said Thursday.</p></div><div class=\"tr-npp-body\"><p>Jamil Ghani, Amazon Prime vice president, said in a statement, that the price of Prime is increasing with \"the continued expansion of Prime member benefits as well as the rise in wages and transportation costs.\"</p><p>For new members, the price change will go into effect Feb. 18. For current Prime members, the new price will apply after March 25 on the date of their next renewal.</p><p><span><span>DAILY MONEY NEWSLETTER:  </span> Money tips and advice delivered right to your inbox. Sign up here</span> </p><p><span><span>STARBUCKS PRICE INCREASE:</span> Your Starbucks run is about to get more expensive – again</span> </p><p>Neil Saunders, managing director of research firm GlobalData, told USA TODAY that he wasn't surprised Amazon was raising fees and called it \"long overdue.\"</p><p>Amazon's 2018 Prime hike also was $20 when the membership fee went from $99 to $119. The 2014 increase was $20, too.</p><p>\"Amazon is facing much higher costs and is still investing heavily in Prime, so there is a real justification for hiking fees,\" Saunders said. \"While no one likes to pay more, Prime remains a very attractive, good value for money program which most members use extensively.\"</p><p>Other membership programs have also hiked prices. Netflix raised the rates for its streaming plans in January after last hiking prices in 2020. Hulu also raised the monthly price of its on-demand video plans last year.</p><p>Saunders doesn't expect there to be a significant number of Prime cancellations from the hike.</p><p>\"Amazon will have done the math on this and their view will be that they have more to gain than lose from this move,\" he said.</p><p>Shares of Amazon spiked nearly 17% in after market trading when Amazon released its results.</p><p><span><span>AMAZON DEALS:</span> Updated daily: Here are the 10 best Amazon deals today</span> </p><p><span><span>PRIME MEMBERSHIP DEALS:</span> Looking for an Amazon Prime membership discount? Here's how to save up to 50%</span> </p><p class=\"tr-npp-section-title\">Amazon Prime benefits: Free delivery, Prime Video and Whole Foods discount</p><p>Amazon said U.S. Prime members received more than 6 billion free deliveries in 2021 while over 200 million members worldwide streamed shows and movies.</p><p>Here are some of the top benefits:</p><ul class=\"bulleted-list arrowlist\"><li>Free two-day delivery on millions of items</li><li>Free one-day delivery on more than 10 million items</li><li>Free same-day delivery in select areas for orders $35 or more</li><li>Streaming and digital benefits with Prime Video, Amazon Music</li><li>Prime member deals at Whole Foods Market</li> </ul><p><span><span>FACEBOOK LOSS:</span> Facebook is losing users for the first time ever and shares in Meta have fallen off a cliff</span> </p><p><span><span>STIMULUS CHECK AND TAXES:</span> Missing a stimulus check? IRS Letter 6475 can help you claim Recovery Rebate Credit on taxes.</span> </p><p><span>Contributing: Associated Press</span> </p><p><span>Follow USA TODAY reporter Kelly Tyko on Twitter:  <a href=\"https://twitter.com/KellyTyko\">@KellyTyko. <span> For shopping news, tips and deals, join us on our Shopping Ninjas Facebook group. </span> </a> </span> </p><p><span>This article originally appeared on USA TODAY: Amazon raising price of Prime membership for new and current members</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}