{"date": "2021-12-30 22:11:18.297000+00:00", "ticker": "ABDN", "mrkt_info": {"open": 241.6, "close": 240.9}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ABERDEEN ASIA PACIFIC INCOME INVESTMENT CO LTD (\"FAP-T;ABAKF-0\")\n- Release Of Monthly Factsheet\n\n     Please see below for a link to the monthly factsheet for the Aberdeen\nAsia-Pacific Income Investment Company Limited including performance and\nportfolio composition as of November 30, 2021.\n\n     Aberdeen Asia-Pacific Income Investment Company Limited Factsheet\n\n     Important Information\n\n     Aberdeen Standard Investments (\"ASI\") is the registered marketing name\nin Canada for the following entities, which now operate around the world\nunder the abrdn brand: Aberdeen Standard Investments (Canada) Limited,\nAberdeen Standard Investments Luxembourg Standard Life Investments Private\nCapital Ltd, SL Capital Partners LLP, Standard Life Investments Limited,\nAberdeen Standard Alternative Funds Limited, and Aberdeen Capital\nManagement LLC. Aberdeen Standard Investments (Canada) Limited, is\nregistered as a Portfolio Manager and Exempt Market Dealer in all provinces\nand territories of Canada as well as an Investment Fund Manager in the\nprovinces of Ontario, Quebec, and Newfoundland and Labrador.\n\n     Closed-end funds are traded on the secondary market through one of the\nstock exchanges. The Company's investment return and principal value will\nfluctuate so that an investor's shares may be worth more or less than the\noriginal cost. Shares of closed-end funds may trade above (a premium) or\nbelow (a discount) the net asset value (NAV) of the company's portfolio.\nThere is no assurance that the Company will achieve its investment\nobjective. Past performance does not guarantee future results.\n\n     If you wish to receive this information electronically, please\ncontact: Investor.Relations@abrdn.com\n\n     abrdnfap.com\n\n     For More Information\n\nContact:\n\nAberdeen Standard Investments Inc.\nInvestor Relations\n1-800-992-6341\nInvestor.Relations@abrdn.com\n\nTel   : 800-992-6341    ABERDEEN ASIA PACIFIC INCOME INVESTMENT CO LTD\nFax   : +682-8863544005\nEmail : InvestorsRelations@aberdeen-asset.com\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2136300888.MNPRE2136301544-14090820211230</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}