{"date": "2021-11-14 06:50:25.045000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3525.15, "close": 3540.7}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>New Delhi</p></div><div class=\"tr-npp-lead\"><p>New Delhi, Nov. 14 -- Amazon Prime Video will premiere epic fantasy series The Wheel of Time on 19 November. The series is based on Robert Jordan's novel series of the same name and is produced by Sony Pictures Television and Amazon Studios. It stars Rosamund Pike and Josha Stradowski in lead roles.</p><p>To be sure, American films, television shows and programming in Turkish, German and Korean languages-including their dubbed versions-are emerging as a big draw on over-the-top (OTT) video streaming services, making up as much as 30% of overall viewership, according to senior executives at several platforms.</p></div><div class=\"tr-npp-body\"><p>While such international content finds ready takers among young urban Indians in the metros, those in small towns benefit from their dubbed versions in both Hindi and regional languages.</p><p>Netflix's Extraction and The Kissing Booth have been popular in Hindi and Tamil as have Amazon's The Boys, The Tomorrow War, Wonder Woman and Parasite. Walt Disney, too, has decided to tap smaller towns by making Disney+ (including Marvel) content available even on its cheaper price plans in India to expand reach.</p><p>While a handful of niche, foreign language TV channels and torrent websites on the Internet had introduced Indians to international content earlier, OTT platforms have helped improve ease of access, according to media experts. Essentially, TV had laid the foundation for international programming, while OTT has the luxury of talking to users individually and customizing recommendations with artificial intelligence and machine learning.</p><p>While metro audiences are over-saturated with the discovery of such international content on OTT, small towns have recently started acquiring a taste for what may be considered cool, and is part of social media chatter. The covid-19 pandemic has also ensured people are exposed to a lot more things on the phone, given that several large families do not have multiple TV sets. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}