{"date": "2022-02-14 10:00:44.987000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>The Lord of the Rings: The Rings of Power teases a gargantuan production that blows anything we have seen on the small screen out of the water. Yes, including Game of Thrones, although it may be too early to tell.</p><p>After years of waiting for Amazon's The Lord of the Rings series, we finally have our first teaser. It is pretty short at just one minute, but it does give us the initial idea of how the series is going to look and feel. Judging by this teaser, and everything we know about the series so far, it does not look like we are going to be disappointed.</p></div><div class=\"tr-npp-body\"><p>The clip teases a gargantuan production that blows anything we have seen on the small screen out of the water. Yes, including Game of Thrones, although it may be too early to tell.</p><p>In terms of plot, the teaser does not reveal much beyond what we know already. We know younger versions of Galadrie and Elrond are here (played by different actor), but on the whole, most characters are new to most Lord of the Rings fans. Some are specifically invented for the show.</p><p>And what a show it is turning out to be.</p><p>The visuals shown in the teaser exude grandeur suitable to a fantasy world with imposing edifices, statues that dwarf mountains, and almost otherworldly beautiful vistas (the first season was filmed in New Zealand).</p><p>There are shots of various fantastical creatures that populate Middle-earth and massive battle scenes, which are familiar to the fans of JRR Tolkien's writings.</p><p>Created by JD Payne and Patrick McKay, The Rings of Power is set in the Second Age of Middle-earth as opposed to the main story's third age. With an estimated budget of $1 billion, the series is by far the most expensive television production ever. It is also the more expensive than any movie ever made.</p><p>The Lord of the Rings: The Rings of Power will premiere with its eight-episode season 1 on September 2, 2022.</p><p>Copyright 2022 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}