{"date": "2021-11-23 13:10:55+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Corrects day in first paragraph to Tuesday from Monday.</p><p class=\"tr-by\">By Foo Yun Chee</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">STRASBOURG, Nov 23 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>A key committee of EU lawmakers on Tuesday agreed to tougher laws targeting Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>, Apple <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAPL.O\" data-type=\"ric\" data-ric=\"AAPL.O\" translate=\"no\" dir=\"ltr\">AAPL.O</a>, Alphabet <a href=\"reuters://REALTIME/Verb=FullQuote/ric=GOOGL.O\" data-type=\"ric\" data-ric=\"GOOGL.O\" translate=\"no\" dir=\"ltr\">GOOGL.O</a> unit Google and Facebook <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a>, earning a thumbs-up from EU antitrust chief and architect of the idea Margrethe Vestager.</p><p>Frustrated by the slow pace of antitrust investigations, Vestager late last year proposed the Digital Markets Act (DMA), which sets out a list of dos and don'ts for U.S. tech giants designated as online gatekeepers.</p><p>Gatekeepers are companies with at least 8 billion euros ($9 billion) in European turnover and an 80 billion euro market capitalisation. The rules need to be thrashed out with the European Parliament and EU countries before they can be adopted. </p><p>A Parliamentary committee, drafting lawmakers' negotiating position on the issue, voted for a tougher line that could also see travel website booking.com, China's Alibaba <a href=\"reuters://REALTIME/Verb=FullQuote/ric=BABA.N\" data-type=\"ric\" data-ric=\"BABA.N\" translate=\"no\" dir=\"ltr\">BABA.N</a> and online retailer Zalando <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ZALG.DE\" data-type=\"ric\" data-ric=\"ZALG.DE\" translate=\"no\" dir=\"ltr\">ZALG.DE</a> classified as gatekeepers.</p><p>The group also extended the scope of the DMA to web browsers, virtual assistants and connected TV, from Vestager's list of online intermediation services, social networks, search engines, operating systems, online advertising services, cloud computing and video-sharing services.</p><p>It also wants to empower the European Commission to temporarily halt so-called killer acquisitions by gatekeepers, or takeovers aimed at shutting down nascent rivals.</p><p>Targeted advertising would be allowed with the consent of users, but banned for minors.</p><p>Breaches of the rules would result in fines of between 4% to 20% of a company's global turnover, compared with Vestager's proposed 10%.</p><p>\"Great news! Today's @EP_SingleMarket vote brings us one step closer to the DMA's adoption. One step closer to a free, fair and competitive Tech market where all players stand a chance to make it,\" Vestager tweeted.</p><p>\"We do not want bigger companies getting bigger and bigger without getting any better and at the expense of consumers and the European economy,\" lawmaker Andreas Schwab said.</p><p>Tech lobbying group CCIA warned of one-size-fits-all legislation.</p><p>\"The lack of any impact assessment of the Parliament's amendments take the DMA deeper into unknown territory creating significant risks of unintended consequences for Europe's digital economy,\" its competition lawyer Kayvan Hazemi-Jebelli said.</p><p>($1 = 0.8898 euros)</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Foo Yun Chee<br/>Editing by Mark Potter)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:foo.yunchee@thomsonreuters.com\" data-type=\"email\" translate=\"no\">foo.yunchee@thomsonreuters.com</a> ; +32 2 287 6844; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://foo.yunchee.thomsonreuters.com@reuters.net\">foo.yunchee.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: EU-TECH/ (CORRECTED, PIX)</p></div>"}