{"date": "2021-12-02 14:27:14.830000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SOFTCHOICE CORP (\"SFTC-T;SFTCF-0\")\n- Wins 2021 AWS US Rising Star of the Year Partner Award\n\n    Softchoice today announced that it has been honored with the Rising\nStar Partner of the Year Award by Amazon Web Services (AWS). The award\nrecognizes how Softchoice is helping organizations innovate and win with\nAWS.\n\n    Announced during the AWS re:Invent 2021 event, AWS Partner Awards\nrecognize a wide range of born-in-the-cloud and traditional consulting and\nIndependent Software Vendor partners whose business models have embraced\nspecialization and collaboration. AWS Partners are dedicated to helping\ncustomers build, market, and sell their offerings so they can grow\nsuccessful cloud businesses.\n\n    \"Together, Softchoice and AWS are helping our customers fully realize\nthe value of the cloud through innovative and customized solutions,\" said\nChristopher Woodin, Vice President, Cloud, Softchoice. \"We have scaled our\nAWS solutions and team of experts over the last year, giving our customers\nthe ability to quickly adopt the AWS platform and transform through\napplication development and modernization.\"\n\n    In October, Softchoice and AWS announced a strategic collaboration to\ncreate solutions for customers to help launch, migrate, modernize, and\nscale workloads on AWS even faster. Customers will also benefit from\nSoftchoice's dedicated team of AWS solutions architects, which will help\nthem design and optimize their AWS environments with speed and agility.\n\n    Softchoice is a multi-cloud certified managed service provider and one\nof the first AWS managed service partners, holding the following AWS\nCompetencies and designations: AWS Non-Profit Competency, AWS Microsoft\nWorkloads Competency, AWS Storage Competency, Amazon EC2 for Windows Server\nDelivery and AWS CloudFormation Service Delivery designations. Thousands of\norganizations across North America trust Softchoice to help them succeed\nwith cloud and win in their markets.\n\n    Learn more about our Amazon Web Services solutions here.\n\n    About Softchoice\n\n    Softchoice (TSX: SFTC) is a software-focused IT solutions provider that\nequips organizations to be agile and innovative, and for their people to be\nengaged, connected and creative at work. That means moving them to the\ncloud, helping them build the workplace of tomorrow, and enabling them to\nmake smarter decisions about their technology. For more information, please\nvisit www.softchoice.com.\n\n    Forward-Looking Statements\n\n    This news release may contain forward-looking information within the\nmeaning of applicable securities laws, which reflects the Company's current\nexpectations regarding future events, including the Company's plans to\ncreate customer solutions and expectations regarding its cloud-based\nservices. Forward-looking information is based on a number of assumptions\nand is subject to a number of risks and uncertainties, many of which are\nbeyond the Company's control. Actual results could differ materially from\nthose projected herein. Unless otherwise noted or the context otherwise\nindicates, the forward-looking information contained in this news release\nis provided as of the date of this news release and Softchoice does not\nundertake any obligation to update such forward-looking information,\nwhether as a result of new information, future events or otherwise, except\nas expressly required under applicable securities laws.\n\nContact Information:\n\nmedia@softchoice.com\n<a href=\"http://www.softchoice.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.softchoice.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133500177.MNPRE2133501044-05420720211202</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}