{"date": "2021-11-09 19:31:06+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The Day Ahead is an email and PDF publication that includes the day's major stories and events, analyses and other features. To receive The Day Ahead, Eikon users can register at <a href=\"reuters://REALTIME/verb=Headlines/ric=DAY/US\" data-type=\"newsExpression\" data-expression=\"DAY/US\" translate=\"no\" dir=\"ltr\">DAY/US</a>. Thomson One users can register at RT/DAY/US. All times in ET/GMT</p><p class=\"tr-story-p1\"></p><p><br/></p><p>Market analysts will closely monitor the data on U.S. consumer prices to get clues on the direction of interest rates. The consumer price index (CPI) is expected to have gained 0.6% last month after rising 0.4% in September. In the 12 months through October, the CPI probably increased 5.8% after advancing 5.4% year-on-year in September. Excluding the volatile food and energy components, the CPI is expected to have climbed 0.4% in October after increasing 0.2% in the previous month. The so-called core CPI likely rose 4.3% on a year-on-year basis after increasing 4.0% in September. Weekly jobless claims numbers are also scheduled on the economic calendar. Weekly jobless claims figures are scheduled to be released one day in advance due to Veterans Day holiday. Initial claims for state unemployment benefits likely fell 4,000 to a seasonally adjusted 265,000 for the week ended November 6. Meanwhile, the Commerce Department will release data on wholesale inventories and sales at wholesalers.</p><p><br/></p><p>Walt Disney Co is expected to post a rise in fourth-quarter revenue, helped by resumption in theme parks attendance and steady subscriber growth on its streaming platforms.</p><p><br/></p><p>Beyond Meat Inc's forecast will be the main focus on investors when it reports its third-quarter results after the plant-based meat maker warned that a host of factors including a drop in demand from grocery stores and a labor shortage was hurting its sales. Wall Street is keen to find out how long the company expects those pressures to last.</p><p><br/></p><p>U.S. fast-food chain Wendy's Co is expected to post an increase in third-quarter revenue, helped by consumers returning to its restaurants as pandemic-related restrictions ease. Investors will be looking out for the company's forecast and its commentary on labor and inflation.</p><p><br/></p><p>Bumble Inc is expected to report third-quarter results. The Match Group rival is benefiting from a rise in paying subscribers even after the easing of pandemic-related curbs.</p><p><br/></p><p>EV startup Rivian Automotive Inc, which is backed by Amazon.com Inc and Ford Motor Co, will make its Nasdaq debut.</p><p><br/></p><p>A hearing on a judge's order for LTL Management, the Johnson &amp; Johnson entity holding its talc liabilities in bankruptcy, to show why the judge shouldn't move the Chapter 11 case out of North Carolina and to another court is expected to be held. The judge hinted in the order that the case should be sent to New Jersey, where the company and its employees are based.</p><p><br/></p><p>The UK Supreme Court will decide whether to allow a bellwether, potential multi billion pound lawsuit against Alphabet Inc's Google, over alleged unlawful tracking of iPhone users, to proceed as a class action in Britain. </p><p><br/></p><p>Brazil's consumer prices as measured by the benchmark IPCA index are expected to have risen 1.05% in October, compared to an increase of 1.16% in the previous month. Prices probably rose 10.45% in the 12 months through October, up from a rise of 10.25% in September.</p><p><br/></p><p>LIVECHAT - REUTERS GLOBAL MARKETS FORUM</p><p>Reuters markets correspondents in London and New York discuss what's driving equity markets and what to look out for. (1000/1400) To join the conversation, <a href=\"https://www.refinitiv.com/en/products/refinitiv-messenger/global-markets-forum\" data-type=\"url\" class=\"tr-link\" translate=\"no\">click here</a></p><p><br/></p><p><br/></p><p class=\"tr-signoff\"> (Compiled by Sourav Bose in Bengaluru; Editing by Krishna Chandra Eluri)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:sourav.bose@thomsonreuters.com\" data-type=\"email\" translate=\"no\">sourav.bose@thomsonreuters.com</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMERS-WHATTOWATCH/</p></div>"}