{"date": "2022-02-03 20:28:38+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3012.25, "close": 3152.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds institutional investors</p><p class=\"tr-by\">By Maiya Keidan</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">TORONTO, Feb 3 (Reuters)</span><span class=\"tr-dl-sep\"> - </span><span class=\"tr-strong\">Facebook owner Meta Platforms Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FB.O\" data-type=\"ric\" data-ric=\"FB.O\" translate=\"no\" dir=\"ltr\">FB.O</a> was widely held by hedge funds, according to recent data, leaving a number of funds potentially exposed by the wipe-out in its shares. </span></p><p>    Shares of Meta on Thursday touched their lowest level since July 2020 after the social media giant issued a dismal forecast in which it blamed increased competition and Apple's privacy changes. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2UE1L9\" data-type=\"storyId\" data-story-id=\"nL4N2UE1L9\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2UD2FF\" data-type=\"storyId\" data-story-id=\"nL4N2UD2FF\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>Meta was the third most important position for hedge funds, behind Microsoft <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MSFT.O\" data-type=\"ric\" data-ric=\"MSFT.O\" translate=\"no\" dir=\"ltr\">MSFT.O</a> and Amazon <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> at the end of the third quarter of 2021, according to an analysis of U.S. regulatory filings compiled by Goldman Sachs, a summary of which was sent to Reuters. Goldman Sachs could not be immediately reached for comment.</p><p>\"The value destruction is pretty large and Facebook has certainly been a core holding of many funds, traditional and long-short,\" said Jim Neumann, chief investment officer of alternatives advisory firm Sussex Partners.</p><p><span class=\"tr-strong\">Funds including Wellington Management Group, Sanders Capital and Tiger Global Management declared positions at the end of September, as well as </span>Polen Capital Management, Lone Pine Capital, Soroban Capital Partners, Egerton Capital and Marshall Wace, the most recent filings showed.</p><p>Together, those eight hedge funds held more than 62 million shares as of Sept. 30, the most recent U.S. regulatory filings showed, which means they could have lost more than $5 billion in paper profits - if they still held those positions and had not hedged them.</p><p><span class=\"tr-strong\">When it came to broader investors The Vanguard Group, Fidelity Management &amp; Research Company, BlackRock Institutional Trust Company, T. Rowe Price Associates and State Street Global Advisors were the top five institutional shareholders over the same time period, according to Refinitiv data.</span></p><p><span class=\"tr-strong\">Capital International Investors, Capital World Investors, Capital Research Global Investors, Geode Capital Management and Norges Bank Investment Management made up the rest of the top 10.</span></p><p><span class=\"tr-strong\">Spokespeople for Vanguard, Fidelity, T. Rowe Price, Capital International Investors, Capital Research Global Investors and Norges declined to comment. None of the other firms were immediately available to comment. Together they held more than 802.72 million shares.</span></p><p>Sussex Partners' Neumann added it's also possible that funds took some risk off by hedging or reducing prior to earnings announcements.</p><p>\"It will not be lost on the managers that the earning misses and forecast disappointments of the current period have been met with violent reaction, most pronounced when the company is reliant upon forward earnings rather than current.\"  </p><p>Spokespeople for Wellington, Marshall Wace, Lone Pine and Soroban declined to comment while Sanders, Tiger Global, Polen and Egerton were not immediately available for comment.</p><p>The latest data on hedge fund holdings, which will detail the fourth quarter, is expected in mid-February. </p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Maiya Keidan in Toronto<br/>Editing by Megan Davies, Matthew Lewis and Bernard Orr)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Maiya.Keidan@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Maiya.Keidan@thomsonreuters.com</a> ; 44 207 542 1594; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://maiya.keidan.thomsonreuters.com@reuters.net\">maiya.keidan.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: META PLATFORMS-FUNDS/ (UPDATE 2)</p></div>"}