{"date": "2021-12-11 19:15:03.370000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3444.24, "close": 3381.83}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">Confidential Cloud software first to secure Kubernetes-managed applications on AWS with AWS Nitro Enclaves, designed to make data impervious to insiders and attacks.</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">PALO ALTO Calif., Nov. 29, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">PALO ALTO Calif.</span>, <span class=\"xn-chron\">Nov. 29, 2021</span> /PRNewswire/ -- Anjuna Security Inc., the Confidential Cloud company, today announced that Kubernetes workloads can now be run on Amazon Web Services (AWS) by using Anjuna Confidential Cloud software and AWS Nitro Enclaves.</p>\n\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/1197982/Anjuna_Logo.html\">\n                    <div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"(PRNewsfoto/Anjuna Security, Inc)\" src=\"https://mma.prnewswire.com/media/1197982/Anjuna_Logo.jpg\" title=\"(PRNewsfoto/Anjuna Security, Inc)\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMTE5Nzk4Mi9Bbmp1bmFfTG9nby5qcGc=&amp;key=731de93005ad94058bdb0008f75b6e8face671d5ee4c79a884ef31da2b0545a1ec5b3d346bc9e8dfbbb9c77157947e1c73cd0df0adb50b59952de1ccba68f2a9\"/></div></div>\n                        </a>\n                </p>\n\n    </div>\n<p>Anjuna Confidential Cloud software enables applications and workloads managed by Amazon Elastic Kubernetes Service (Amazon EKS) to utilize the isolated execution environment capability of AWS Nitro Enclaves, designed to make data impervious to insiders, bad actors, and malicious software. This means Amazon EKS-managed workloads gain the strong, secure computing protections built into AWS Nitro Enclaves.</p>\n<p>Anjuna Confidential Cloud software deployment requires no changes to applications, environments, or information technology (IT) processes to simply and invisibly secure highly sensitive data, such as personally identifiable information (PII), healthcare or private financial information, and intellectual property. </p>\n<p>\"Previously, there was no easy way for enterprise IT organizations to operate Kubernetes workloads on AWS Nitro Enclaves,\" said <span class=\"xn-person\">Ayal Yogev</span>, co-founder, and CEO of Anjuna. \"Now the Anjuna Confidential Cloud platform makes it simple to fully isolate even highly distributed Kubernetes workloads with the strongest protection available.\"</p>\n<p>\"This support extends the Anjuna commitment to make the public cloud the safest place for every enterprise to compute,\" Yogev added.</p>\n<p>AWS Nitro Enclaves enable customers to create isolated compute environments to further protect and securely process highly sensitive data. Amazon EKS is a managed service that makes it easy to run Kubernetes—open-source software that deploys and manages applications at scale. </p>\n<p>With Anjuna's software support for Amazon EKS, you can now run any Pod inside an AWS Nitro Enclave without requiring any modification to application code or associated Kubernetes environments. The added support for Amazon EKS managed workloads builds on Anjuna's support of AWS Nitro Enclaves, announced in 2020, and the ongoing work Anjuna is doing as a part of its active membership in the Amazon Partner Network (APN). </p>\n<p>The combination of Amazon EKS, AWS Nitro Enclaves, and Anjuna Confidential Cloud for AWS Nitro Enclaves achieves a level of data security and implementation simplicity beyond that achievable by either public clouds or private data centers alone. Anjuna software deploys natively using a single webhook—no sidecars, complicated configuration changes or code modifications are required. The result is a wholly isolated computing infrastructure that secures workloads with the strongest security protections available..</p>\n<p>\"As CISOs for modern financial organizations, we see the ongoing struggle to define comprehensive security and data privacy compliance controls for Kubernetes-based workloads,\" said <span class=\"xn-person\">Robert Ficcaglia</span>, CTO of SunStone Secure, Co-Chair of the CNCF Kubernetes Policy Workgroup, and a member of the Kubernetes External Audit team. \"True Pod isolation is not possible without enclaves. Anjuna's solution radically simplifies this and makes these enclave protections possible and practical, creating infrastructure that can be fully trusted. This level of protection and control is game-changing for highly regulated container workloads in commercial and government clouds.\"</p>\n<p>Anjuna Confidential Cloud for AWS Nitro Enclaves software is available immediately both in AWS Marketplace and directly from Anjuna. Anjuna will be demonstrating its full security for Amazon EKS and AWS Nitro Enclaves at <span>AWS re:Invent</span> in <span class=\"xn-location\">Las Vegas</span> from <span class=\"xn-chron\">November 29 to December 3, 2021</span> in Booth #110.</p>\n<p>For further information go to <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3372033-1&amp;h=2088549451&amp;u=https%3A%2F%2Fwww.anjuna.io%2Famazon-nitro-enclaves%3FhsLang%3Den&amp;a=https%3A%2F%2Fwww.anjuna.io%2Famazon-nitro-enclaves%3FhsLang%3Den\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.anjuna.io/amazon-nitro-enclaves?hsLang=en</a> </p>\n<p><b>About Anjuna<br/></b>Anjuna Security makes the public cloud secure for business. Software from Anjuna Security effortlessly enables enterprises to safely run even their most sensitive workloads in the public cloud. Unlike complex perimeter security solutions easily breached by insiders and malicious code, Anjuna leverages the strongest hardware-based secure computing technologies available to make the public cloud the safest computing resource available anywhere. Anjuna is based in Palo Alto, <span class=\"xn-location\">California</span>.</p>\n<p>To learn more, go to <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3372033-1&amp;h=3893715412&amp;u=http%3A%2F%2Fwww.anjuna.io%2F&amp;a=www.anjuna.io\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.anjuna.io</a></u> or email <u><a href=\"mailto:info@anjuna.io\" data-type=\"email\" translate=\"no\">info@anjuna.io</a></u> .</p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n</div>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=LA89249&amp;sd=2021-11-29\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1MQTg5MjQ5JnNkPTIwMjEtMTEtMjk=&amp;key=07539f211e61b536b24bc1ea098ec988f5fb38b4200999290dced82ef169738ec57d20c6dd41b73d6640a149bb7bdcc441cb65ad445383dca6f04e4fd853e783\"/></div></div> View original content to download multimedia:<a href=\"https://www.prnewswire.com/news-releases/anjuna-security-software-secures-kubernetes-workloads-and-sensitive-data-utilizing-aws-nitro-enclaves-301432609.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/anjuna-security-software-secures-kubernetes-workloads-and-sensitive-data-utilizing-aws-nitro-enclaves-301432609.html</a><p></p>\n<p>SOURCE  Anjuna Security, Inc</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Anjuna-Kubernetes</p></div>"}