{"date": "2022-01-26 23:25:54+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2799.72, "close": 2792.75}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds quote from worker and statement from Amazon</p><p class=\"tr-by\">By Julia Love</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Jan 26 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>A group of Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> workers has met the requirements to hold a union election at a warehouse in Staten Island, New York, a spokesperson for the U.S. National Labor Relations Board confirmed on Wednesday, paving the way for another high-profile labor battle at the online retailer. </p><p>NLRB spokesperson Kayla Blado wrote in an email that group of workers, known as the Amazon Labor Union, had \"reached a sufficient showing of interest.\" In order to hold an election supervised by the U.S. National Labor Relations Board, unions must show that they have gathered signatures of support from at least 30% of workers who are eligible to vote.</p><p>\"We are jumping for joy,\" said Chris Smalls, president of the group and a former employee at the Staten Island warehouse. \"We know it’s a long battle ahead of us, but to get over this hump, the show of interest, it’s definitely historic for us.\"</p><p>    The Amazon Labor Union, which is not affiliated with a major U.S. union, <a href=\"https://www.reuters.com/world/us/amazon-worker-group-new-york-withdraws-petition-organize-union-2021-11-12\" data-type=\"url\" class=\"tr-link\" translate=\"no\">withdrew its petition</a> in November after the NLRB notified them that they had not collected enough signatures. But on Wednesday afternoon, the NLRB told the group that they had cleared the hurdle, Smalls said. </p><p>    Amazon spokesperson Kelly Nantel said the company was seeking more information about how the signatures were verified<span class=\"tr-strong\">.</span></p><p>“We’re skeptical that there are a sufficient number of legitimate signatures,\" Nantel said in a statement. \"Our employees have always had a choice of whether or not to join a union, and as we saw just a few months ago, the vast majority of our team in Staten Island did not support the ALU.”</p><p>The NLRB will hold a hearing regarding the upcoming election on Feb. 16.</p><p>Amazon is facing a growing volley of campaigns to organize its vast workforce. Next month, workers at an Amazon warehouse in Alabama will vote again on whether to join the Retail, Wholesale and Department Store Union (RWDSU). Amazon handily defeated the union campaign last year, but the NLRB called for another vote after finding the company improperly interfered in the first contest.</p><p>    </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Julia Love; additional reporting by Jeffrey Dastin; Editing by Leslie Adler and Aurora Ellis)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Julia.Love@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Julia.Love@thomsonreuters.com</a> , @byJuliaLove; 52 (55) 5282-7131; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON.COM-UNION/ (UPDATE 1)</p></div>"}