{"date": "2021-11-18 15:10:43.991000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ESE ENTERTAINMENT INC (\"ESE-V;ENTEF-0\")\n- Digital Motorsports Launches World Cup with US-Based TV Channel\n- ESTV to Deliver the Event Live on its Global Network\n\n     ESE Entertainment Inc. (\"ESE\" or the \"Company\") brand, Digital\nMotorsports, is pleased to announce that it has entered into a distribution\nagreement (the \"Agreement\") with ESTV (Esports TV), whereby ESTV will air\nand promote content relating to the Digital Motorsports World Cup which\nwill be broadcast November 28, 2021.\n\n     Since launching in 2019, ESTV has grown rapidly and is now available\non various digital, over-the-top (OTT) video, mobile, over the air and\nbasic cable video platforms. Programming includes gaming, news, shows and\ncoverage, competitive gaming team analysis and player content, casual\nmainstream gaming news, live streaming event broadcasting and more. In\nNovember 2020, ESTV signed a European distribution agreement with ESE to\nprovide direct exposure to the European market. The Agreement expands the\nCompany's and Digital Motorsports' direct exposure in the United States and\naims to increase Digital Motorsports' revenue opportunities through content\ncreation that supports sales of simulator products.\n\n     The Agreement will expand Digital Motorsports' content reach through\nESTV's and its partners' global distribution channels, which include:\n\n     *  Roku(R) Channel and apps\n     *  Amazon Fire TV\n     *  Dish(R) Sling(TM) TV\n     *  VIZIO WatchFree\n     *  Samsung TV Plus\n     *  LG\n     *  TCL\n     *  Xiaomi\n     *  Rakuten\n     *  PlayStation\n     *  Atari\n     *  PLEX\n     *  RAD TV\n     *  Sports.TV\n     *  Netgem\n\n     Eric Yoon, Founder and CEO of ESTV, commented \"We are excited to begin\nworking with ESE and Digital Motorsports and look forward to this\nopportunity for ESTV to further its business internationally. The synergy\nbetween Digital Motorsports and ESTV is clear, and we believe this\nrelationship will further develop.\"\n\n     \"ESTV is expected to guide us through an addition to the Digital\nMotorsports brand. They are allowing us to tap into a new market and we\nlook forward to expanding our business relationship with ESTV into the\nfuture,\" stated Konrad Wasiela, CEO of ESE.\n\n     Niall Maher, CEO of Digital Motorsports, commented \"The Digital\nMotorsports World Cup is a global event that looks to bring motorsports\nonto the same level as League of Legends and other top tier esports titles.\nWe look forward to working with ESTV as it gives us the platform to expand\nour online racing onto a global stage. The Agreement will also allow us to\ncollaborate with ESTV's partners and co-distributors, which include Roku,\nAmazon, Samsung, Vizio, Dish Sling TV and more, especially in the United\nStates market. This directly supports our expansion plans into this\nregion.\"\n\n     About Digital Motorsports\n\n     K Digital Motorsports is an award-winning organization and one of the\nleading sim racing solutions providers in Europe, specializing in building\nbespoke simulators and offering turnkey simulator packages. Digital\nMotorsports is currently developing both products and technology to reduce\nthe complexity and barriers to entry in sim racing. Digital Motorsports has\nkey vendor distribution rights and partnerships in the industry, and they\nhave worked with world champions across multiple disciplines from F1, WEC,\nWRC, Drifting, and more. Digital Motorsports are a customer-centric\nbusiness offering a mix of professional products, turnkey solutions, and a\nworld class esports racing league | www.digital-motorsports.com\n\n     About ESE\n\n     ESE is a Europe based entertainment and technology company focused on\ngaming, particularly on esports. The Company provides a range of services\nto leading video game developers, publishers, and brands by providing\ntechnology, infrastructure, and fan engagement services internationally.\nESE also operates its own ecommerce channels, esports teams, and gaming\nleagues. In addition to the Company's organic growth opportunities, the\nCompany is considering selective acquisitions that align with its objective\nof becoming a dominant global player in esports technology and\ninfrastructure. | www.esegaming.com\n\n     About ESTV\n\n     ESTV is the first worldwide 24-7 live linear video channel dedicated\nto esports. Launched in May 2019, ESTV streams live linear feeds and AVOD\nservices, providing round-the-clock coverage of esports athletes and gaming\nfranchises from an insider perspective. ESTV is available on the Roku(R)\nChannel (U.S. &amp; Canada), Amazon Fire TV, Samsung TVPlus (CTV &amp; Mobile),\nDish(R) Sling TV, VIZIO, Rakuten TV (Europe), TCL TV (worldwide), Xiaomi\n(CTV &amp; Mobile), ZEASN (worldwide), Hisense Sharp (worldwide), PLEX, RAD TV\n(PlayStation, Google TV &amp; Android TV), Hearo.LIVE, EASY TV (Brazil), Select\nTV, TikiLIVE, XOD Global (worldwide), SimulTV (Atari), Glewed TV, Netgem\n(Europe), Sports.TV in the U.S. and international territories.  ESTV is\nalso available on Twitch, YouTube and Facebook. ESTV partners with the\nworld's top gaming networks and production partners for the most robust\nesports content lineup on linear, online and mobile. ESTV is also an\nexclusive broadcast partner for esports events for the United States\nDepartment of Defense's Joint Base Lewis-McChord and for NFL Alumni. |\nwww.estv.co\n\n     Forward-Looking Statements\n\n     This news release contains certain statements that may constitute\nforward-looking information under applicable securities laws. All\nstatements, other than those of historical fact, which address activities,\nevents, outcomes, results, developments, performance or achievements that\nESE anticipates or expects may or will occur in the future (in whole or in\npart) should be considered forward-looking information. Such information\nmay involve, but is not limited to, statements with respect to: the\nexpansion of the reach of ESE's Digital Motorsports' brand, the direct\nexposure to Europe and the United States through ESTV's services and the\nincrease in revenue for Digital Motorsports. Often, but not always,\nforward-looking information can be identified by the use of words such as\n\"plans\", \"expects\", \"is expected\", \"budget\", \"scheduled\", \"estimates\",\n\"forecasts\", \"intends\", \"anticipates\", or \"believes\" or variations\n(including negative variations) of such words and phrases, or statements\nformed in the future tense or indicating that certain actions, events or\nresults \"may\", \"could\", \"would\", \"might\" or \"will\" (or other variations of\nthe forgoing) be taken, occur, be achieved, or come to pass.\nForward-looking information is based on currently available competitive,\nfinancial and economic data and operating plans, strategies or beliefs as\nof the date of this news release, but involve known and unknown risks,\nuncertainties, assumptions and other factors that may cause the actual\nresults, performance or achievements of ESE to be materially different from\nany future results, performance or achievements expressed or implied by the\nforward-looking information. Such factors may be based on information\ncurrently available to ESE, including information obtained from third-party\nindustry analysts and other third-party sources, and are based on\nmanagement's current expectations or beliefs regarding future growth,\nresults of operations, future capital (including the amount, nature and\nsources of funding thereof) and expenditures. Any and all forward-looking\ninformation contained in this press release is expressly qualified by this\ncautionary statement. Trading in the securities of ESE should be considered\nhighly speculative.\n\n     Neither the TSX Venture Exchange nor its Regulation Services Provider\n(as that term is defined in the policies of the TSX Venture Exchange)\naccepts responsibility for the adequacy or accuracy of this release.\n\n     SOURCE ESE Entertainment Inc.\nFor further information about ESE, please\n\nContact Information:\n\nDaniel Mogil, Investor Relations\ninvestors@esegaming.com\n647-492-1535\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132100280.MNPRE2132101931-07000720211118</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}