{"date": "2021-11-09 13:10:10.515000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>VERY GOOD FOOD CO INC (\"VERY-V\")\n- The Very Good Butchers Increases Holiday Production in Response to\n- Product Popularity and Nationwide Turkey Shortages\n\n    The Very Good Butchers, a brand of The Very Good Food Company\ndedicated to making whole food, highly nutritious, minimally processed\nplant-based meats accessible, has increased production of its\nbest-selling Stuffed Beast and Thanksgiving Box as recent reports hint\nat nationwide turkey shortages, resulting in higher meat costs. The\ncompany is also testing a new pilot program offering delivery of its\nStuffed Beast direct to consumers in select U.S. cities including Los\nAngeles, San Jose, Las Vegas, Philadelphia and Chicago, in just 30\nminutes, in time for Thanksgiving, via same day online food delivery\nplatforms Uber Eats, DoorDash and GrubHub.\n\n    Packed with fall and winter-inspired flavours, these limited\nedition plant-based offerings are made with a variety of seasonal\nvegetables and spices, and can be used in several festive dishes,\nincluding special recipes by The Very Good Butchers here.\n\n    Recently, the U.S. Department of Agriculture predicted a 1.5%\ndecrease in turkey production from 2020, falling by 84 million pounds,\nand consumers are searching for different options this holiday season.\nCoupled with ongoing issues in the food supply chain, and shortages in\nlabor, transportation and packaging materials, the cost of turkeys may\nincrease by 10-15%. The Very Good Butchers sold out of its\nbest-selling Stuffed Beast during last year's Canadian Thanksgiving\nand with the recent turkey decline, the brand is increasing production\nand offering an alternative protein to traditional holiday meals now\navailable in both Canada and the U.S.\n    \"In response to consumer demand for our best-selling Stuffed Beast\nlast year, we're thrilled to launch our limited-edition Thanksgiving\nand Holiday Boxes for the holidays,\" said Mitchell Scott, co-founder\nand CEO of The Very Good Food Company. \"Given nationwide turkey\nshortages, increasing production of our Stuffed Beast will give\nconsumers alternatives to 'traditional' holiday dinners, while\nsimultaneously showing that eating plant-based can be delicious, easy\nand approachable.\"\n\n    All of The Very Good Butchers plant-based meats are carefully\ncrafted and made with real, whole-food ingredients like beans, grains,\nvegetables, and a variety of spices. On a mission to show that making\ngood choices doesn't mean sacrificing flavour, The Very Good Butchers\nare making plant-based eating as convenient, nutritious and delicious\nas possible.\n\n    The Very Good Butchers Stuffed Beast and Thanksgiving Box can be\npurchased online via the brand's website and in-store at a variety of\nCanadian retailers now and U.S. retailers at the beginning of\nNovember, including Whole Foods (Canada) and Wegmans. To learn more\nabout The Very Good Butchers, visit www.us.verygoodbutchers.com, or\nfollow them on Instagram (@theverygoodbutchers), Facebook\n(@theverygoodbutchers), and Twitter (@VeryGoodButcher).\n\n    About The Very Good Food Company Inc.\n     The Very Good Food Company Inc. is an emerging plant-based food\ntechnology company that produces nutritious and delicious plant-based\nmeat and cheese products under VERY GOOD's core brands: The Very Good\nButchers and The Very Good Cheese Co. The Company is publicly traded\nin Canada on the TSX Venture Exchange under the symbol VERY, in the\nUnited States on the Nasdaq Capital Market under the symbol VGFC and\non the Frankfurt Stock Exchange under the symbol OSI. For more\ninformation visit www.verygoodfood.com.\n\n    Certain statements in this release constitute \"forward-looking\nstatements.\" These statements, including statements relating to the\nattributes and nutritional content of The Very Good Butchers products,\nthe increased production of the Stuffed Beast and the availability of\nthe Stuffed Beast via online food delivery platforms, the effect of\nthe expected turkey shortage, and the launch of Thanksgiving and\nHoliday Boxes for the holidays and the timing therefor, are based on\nthe current opinions, expectations, beliefs, plans, objectives,\nassumptions or projections of management of The Very Good Food Company\nInc., regarding future events or future results. These forward-looking\nstatements are only predictions, not historical fact, and involve\ncertain risks and uncertainties, as well as assumptions. Actual\nresults, levels of activity, performance, achievements and events\ncould differ materially from those stated, anticipated or implied by\nsuch forward-looking statements. While The Very Good Food Company\nbelieves that its assumptions are reasonable, it is very difficult to\npredict the impact of known factors and anticipate all factors that\ncould affect actual results. There are many risks and uncertainties\nthat could cause actual results to differ materially from\nforward-looking statements made herein, including, among others, the\nimpact of, uncertainties and risks associated with the ongoing\nCOVID-19 pandemic, negative cash flow and future financing\nrequirements to sustain and grow operations, limited history of\noperations and revenues and no history of earnings, expansion of\nfacilities, competition, availability of raw materials, dependence on\nsenior management and key personnel, general business risk and\nliability, regulation of the food industry, change in laws,\nregulations and guidelines, compliance with laws, unfavourable\npublicity or consumer perception, product liability and product\nrecalls, risks related to intellectual property, difficulties with\nforecasts, management of growth and litigation. For a more\ncomprehensive discussion of the risks faced by The Very Good Food\nCompany, please refer to the company's most recent Annual Information\nForm filed with Canadian securities regulatory authorities at\nwww.sedar.com. and as an exhibit to the registration statement on Form\nF-10 filed with the SEC at www.sec.gov. Such forward-looking\nstatements are made only as of the date of this release. The Very Good\nFood Company Inc. undertakes no obligation to publicly update or\nrevise any forward-looking statement because of new information,\nfuture events or otherwise, except as otherwise required by law.\n\n\nMedia Contact:\nAubrey Martin\nRachel Kay Public Relations\n(858) 922-1576\naubrey@rkpr.net\n\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2131200328.MNPRE2131201237-05093920211109</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}