{"date": "2021-12-09 12:15:30+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.29, "close": 3483.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <p>\n                  <span>\n                    <strong>\n                      <span>KONE Corporation, press release,</span>\n                    </strong>\n                    <strong>\n                      <span>December 9, 2021</span>\n                    </strong>\n                  </span>\n                </p>\n                <p>\n                  <span>KONE, a global leader in the elevator and escalator industry, has today announced an agreement with Amazon Web Services (AWS), the world's most comprehensive and broadly adopted cloud offering. AWS will provide KONE with global cloud capabilities such as Internet of Things (IoT) and analytics. The companies will also innovate together to develop new technologies that further strengthen the scalability and performance of KONE's connected services and solutions.</span>\n                </p>\n                <p>\n                  <span>Value-added services and connectivity can revolutionize the role of elevators and smart buildings. Architects, developers and system integrators can offer new digital services that extend from the lobby throughout the building. For facility managers and building owners, a key advantage is the ability to have easy, secure integration with existing systems, where services and apps can be used to create new experiences and improve people flow. For example, using the KONE Digital Platform, a hotel could create a personalized experience for their guests, combining elevator lighting and streaming music, specific content on media screens inside the elevator, and integrated service robots to provide room-service deliveries.</span>\n                </p>\n                <p>\n                  <span>As well as these advanced capabilities, using AWS means KONE can more quickly scale and tailor its services to meet its customers' needs, and provide uninterrupted service across different regions and zones. An example of where this is important can be seen with <a href=\"https://www.kone.com/en/products-and-services/maintenance-and-modernization/24-7-connected-services.aspx\" data-type=\"url\" class=\"tr-link\" translate=\"no\">KONE 24/7 Connected Services</a> for predictive maintenance, which need to scale up as demand increases. The services use machine learning</span>\n                </p>\n                <p>\n                  <span>to help KONE customers detect potential breakdowns before they occur, as well as help KONE technicians get the right information, at the right time, so they can quickly diagnose and fix problems.</span>\n                </p>\n                <p>\n                  <span>\"Joining forces with AWS is an important milestone in creating new business opportunities and a better People Flow experience for our customers and the people who use our equipment. In the elevator and escalator industry, platform resilience is crucial, as is the ability to provide value-added services at scale globally,\" says <strong>Maciej Kranz</strong>, Chief Technology Officer, KONE Corporation. \"For instance, we already have over 160,000 elevators and escalators using KONE 24/7 Connected Services. Through data-driven predictability and insights, we can reduce repair call-outs by more than 40%. We can also proactively identify up to 70% of faults and reduce entrapments by up to 50%. Overall, this brings huge benefits to our customers and illustrates how, at KONE, we have been strengthening our unique position in the industry. Quite simply, we want to do more for our customers by working with AWS, one of the most innovative companies in the world.\"</span>\n                </p>\n                <p>\n                  <span>KONE's ambition is to enable its maintenance base of more than 1.4 million units with KONE 24/7 Connected Services. To help realize this goal, the solution will use AWS services including AWS IoT Core, AWS IoT Device Management, Amazon API Gateway, AWS Lambda, and AWS Step Functions.</span>\n                </p>\n                <p>\n                  <span>\"We're thrilled to co-innovate with KONE to help customers all over the world create smart building solutions developed with AWS IoT services and cloud infrastructure,\" said <strong>Michael MacKenzie</strong>, General Manager of IoT Connectivity and Control Services, Amazon Web Services, Inc. \"AWS IoT capabilities make it easy for organizations to build intelligent connected solutions that integrate artificial intelligence, and then deploy those solutions globally at scale.\"</span>\n                </p>\n                <p>\n                  <span>The KONE Digital Platform is at the heart of connectivity and innovation for digital products and services, providing real-time data from equipment, People Flow solutions and KONE enterprise applications. In addition, its broad API integration possibilities provide an opportunity to work together with other companies to create new services.</span>\n                </p>\n                <p>\n                  <span>\n                    <a href=\"https://materialbank.kone.com/content/kone-material-bank/search_page.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">For images and videos, visit KONE's Material Bank.</a>\n                  </span>\n                </p>\n                <p>\n                  <span>\n                    <strong>For further information, please contact:</strong>\n                  </span>\n                </p>\n                <p>\n                  <span>Hanna Rutanen, Head of Communications, KONE Corporation, tel. +358 41 507 1361, <a href=\"mailto:media@kone.com\" data-type=\"email\" translate=\"no\">media@kone.com</a></span>\n                </p>\n                <p>\n                  <span>\n                    <strong>Read more</strong>\n                  </span>\n                </p>\n                <p>\n                  <span>Previous press releases are available at <a href=\"https://www.kone.com/en/news-and-insights/releases/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.kone.com/en/news-and-insights/releases/</a></span>\n                </p>\n                <p>\n                  <span>\n                    <strong>About KONE</strong>\n                  </span>\n                </p>\n                <p>\n                  <span>At KONE, our mission is to improve the flow of urban life. As a global leader in the elevator and escalator industry, KONE provides elevators, escalators and automatic building doors, as well as solutions for maintenance and modernization to add value to buildings throughout their life cycle. Through more effective People Flow®, we make people's journeys safe, convenient and reliable, in taller, smarter buildings. In 2020, KONE had annual sales of EUR 9.9 billion, and at the end of the year over 60,000 employees. KONE class B shares are listed on the Nasdaq Helsinki Ltd. in Finland.</span>\n                </p>\n                <p>\n                  <span>\n                    <a href=\"https://www.kone.com/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.kone.com</a>\n                  </span>\n                </p>\n                <p>\n                  <strong>\n                    <a href=\"https://mb.cision.com/Public/18027/3467941/83d4400ccf6bc240_org.png\" data-type=\"url\" class=\"tr-link\" translate=\"no\">picture</a>\n                  </strong>\n                </p>\n                <br/>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.kone.com/en/news-and-insights/releases/kone-works-with-aws-to-boost-the-power-and-scale-of-its-digital-services-for-smart-buildings-2021-12-09.aspx\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Kone Oyj</strong> published this content on <strong>09 December 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>09 December 2021 12:15:30 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Kone Oyj</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Kone-Oyj</p></div>"}