{"date": "2021-11-23 20:05:42.974000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>THE INSPIRE 100 ETF (\"BIBL-N\")\n- Lands Morningstar 5-Star Rating\n\n   The Inspire 100 ETF from biblically responsible ESG investing firm,\nInspire Investing, recently celebrated its fourth anniversary with extra\nfashion, having received a 5-Star Morningstar Rating on 3-year returns as\nof September 30, 2021. As a US large cap index fund, it is worthy of\nmention that BIBL landed in the top 18 percentile rank out of 1,257 other\nfunds in Morningstar's Large Blend category without exposure to the\nhigh-flying \"FAANG stocks,\" referring to the mega-cap technology giants\nFacebook (now called Meta), Apple, Amazon, Netflix and Google, as none of\nthe FAANG pass Inspire's biblically responsible investing standards.\n\n(figure class=\"image image_resized\" style=\"width:510px;\")(/figure)     \"We\nare truly humbled with the 5-Star rating received by our flagship fund,\"\ncommented Robert Netzly, CEO of Inspire. \"Every recognition like this\ncontinues to reinforce our belief that our Inspire Impact Score approach to\nbiblically responsible ESG investing can deliver exceptional investment\noutcomes for faith-based investors.\"\n\n   BIBL has grown rapidly along with Inspire's other biblically responsible\nETFs, pushing total assets under management over $1.8 billion and helping\nInspire gain recognition as the #3 in 'Top 50 Fastest Growing Firms' by FA\nMagazine - two years running, along with the parent company of Inspire\nInvesting being featured on the Inc. 5000 list of most successful private\ncompanies for the second year in a row.\n\n   About BIBL\n\n   The Inspire 100 ETF [NYSE: BIBL] invests in one-hundred of the most\nbiblically-aligned, large cap companies in the United States, as measured\nby the Inspire Impact Score methodology, Inspire's globally recognized\nfaith-based ESG (environmental, social and governance)1 scoring system. The\nInspire Impact Score methodology excludes companies involved with problem\nareas such as abortion and human trafficking, while awarding positive\npoints to companies exhibiting \"best in class\" performance in areas such as\nsocial impact, labor practices, political action and environmental\nstewardship.\n\n   BIBL offers a net expense of 0.35%, which is contractually reduced by\nInspire from the gross expense of 0.48% to keep fees lower for investors at\na minimum through March 31, 2022, at which point the fee waiver can be\nrenewed. BIBL seeks to replicate investment results that generally\ncorrespond, before fees and expenses, to the performance of the Inspire 100\nIndex.\n\n   To learn more about the Inspire 100 ETF [NYSE: BIBL], including\nperformance and prospectus, please visit www.inspireETF.com/BIBL.\n\n   About Morningstar Research\n\n   The star rating is a quantitative measure that ranks funds each month\nbased on their trailing three-, five-, and 10-year risk-adjusted returns\nversus their Morningstar Category peers. The star rating follows a\nbell-shaped distribution: The 10% of funds with the best rankings receive a\n5-star rating; the next 22.5% get 4 stars; the 35% after that earn 3 stars;\nthe next 22.5% receive 2 stars; and the bottom 10% of funds earn 1 star.\nWith few exceptions, any fund that possesses a three-year track record is\neligible to receive a star rating.\n\n   About Inspire Investing\nInspire Investing is a leading provider of biblically responsible,\nfaith-based ESG investments and creator of the globally recognized Inspire\nImpact Score(TM) which is used by investors around the world to measure the\nbiblical alignment of their investments according to Biblically Responsible\nInvesting (BRI) principles. Inspire's Discretionary Assets Under Management\n(AUM) has grown another 41% so far this year, bringing total assets to $1.8\nbillion as of October 31, 2021.\n\n   Inspire also donates 50% or more of their own net corporate profits to\nsupport impactful ministry projects around the globe through its Give50\nProgram. Most recently Inspire completed a 3-year village transformation\neffort in the coffee farming mountains of Guatemala to transform the lives\nof the those living in that impoverished community. Thanks to investors,\nadvisors and institutions using Inspire products, the village now has a\nchurch building, a clean water well, improved education facilities and a\nfully functional medical clinic. To learn more about the Give50 program,\nplease visit www.inspireinvesting.com/impact.\n\n   Visit <a href=\"http://www.inspireinvesting.com/to\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.inspireinvesting.com/to</a> learn more about Inspire's\nbiblically responsible investment products and inspiring impact projects.\n\n   Media contact:\nDaniel Mastrolonardo\n(208) 994-0495\ninspire@inspireinvesting.com\n   Investment advisory services offered through Inspire Investing, LLC, a\nRegistered Investment Advisor with the SEC.\n\n   1Environmental criteria considers how a company performs as a steward of\nnature. Social criteria examine how it manages relationships with\nemployees, suppliers, customers, and the communities where it operates.\nGovernance deals with a company's leadership, executive pay, audits,\ninternal controls, and shareholder rights.\n\n   Important Risk Information: Inspire, the adviser, provides the index for\nthe Inspire Funds to track. The indexes use software that analyzes publicly\navailable data relating to the primary business activities, products and\nservices, philanthropy, legal activities, policies and practices when\nassigning Inspire Impact Scores to a company. The securities with the\nhighest Inspire Impact Scores are included in the Indexes and are equally\nweighted. As the Fund may not fully replicate the Index, it is subject to\nthe risk that investment management strategy may not produce the intended\nresults.\n\n   Securities in the Index or in the Fund's portfolio may underperform in\ncomparison to the general securities markets or other asset classes. The\nFund may focus its investments in securities of a particular industry to\nthe extent the Index does. This may cause the Fund's net asset value to\nfluctuate more than that of a fund that does not focus in a particular\nindustry. Fluctuations in the value of equity securities held by the Fund\nwill cause the net asset value (\"NAV\") of the Fund to fluctuate.\n\n   The Fund is not actively managed and the Adviser will not sell shares of\nan equity security due to current or projected underperformance of a\nsecurity, industry or sector, unless that security is removed from the\nIndex or the selling of shares of that security is otherwise required upon\na rebalancing of the Index as addressed in the Index methodology. Tracking\nerror may occur because of imperfect correlation between the Fund's\nholdings of portfolio securities and those in the Index. The Fund's use of\na representative sampling approach, if used, could result in its holding a\nsmaller number of securities than are in the Index. To the extent the\nassets in the Fund are smaller, these risks will be greater.\n\n   There is no guarantee that the Funds will achieve their objective,\ngenerate positive returns, or avoid losses. Before investing, consider the\nfunds' investment objectives, risks, charges and expenses. To obtain a\nprospectus which contains this and other information, visit\nwww.inspireetf.com. Read it carefully. The Inspire ETFs are distributed by\nForeside Financial Services LLC., Member FINRA.\n\n   Inspire and Foreside Financial Services LLC are not affiliated\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132600460.MNPRE2132602354-11531820211123</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}