{"date": "2022-02-16 13:30:06.729000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3103.34, "close": 3162.01}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">The acquisition is on behalf of a Delaware statutory trust investment offering that seeks to raise $52.2 million in equity from accredited investors</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">DES MOINES, Iowa, Feb. 16, 2022</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">DES MOINES, Iowa</span>, <span class=\"xn-chron\">Feb. 16, 2022</span> /PRNewswire/ -- <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3445273-1&amp;h=3757255090&amp;u=https%3A%2F%2Fwww.capitalsquare1031.com%2F&amp;a=Capital+Square+1031\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Capital Square 1031</a>, a leading sponsor of <span class=\"xn-location\">Delaware</span> statutory trust (DST) offerings for Section 1031 exchange and other accredited investors, announced today the acquisition of a 2,690,000-square-foot distribution facility on a long-term absolute net lease to Amazon.com Inc. (NASDAQ: AMZN). The facility was acquired on behalf of CS1031 Zero Coupon Fulfillment Center, DST.</p>\n\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/957271/Capital_Square_Logo.html\">\n                    <div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"(PRNewsfoto/Capital Square)\" src=\"https://mma.prnewswire.com/media/957271/Capital_Square_Logo.jpg\" title=\"(PRNewsfoto/Capital Square)\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvOTU3MjcxL0NhcGl0YWxfU3F1YXJlX0xvZ28uanBn&amp;key=6de608af7e94e5af4ee38ffab02859346cd97b5436de6ec6de8f1f107b72a15575bba2bcc6663b78cd53c0a2e6d43f818572c2cc6bbe5dc87fefba7a8bc39fa1\"/></div></div>\n                        </a>\n                </p>\n\n    </div>\n<p>\"This significant offering is designed for Section 1031 exchange investors who need additional debt because their replacement property has lower leverage than their relinquished property,\" said <span class=\"xn-person\">Louis Rogers</span>, founder and chief executive officer. \"Section 1031 requires equal or greater debt to qualify for 100% tax deferral, but leverage today is much lower than in the past, making high LTV offerings very desirable. In addition to exchangers, other owners of real estate want to invest in real estate like this that generates excess passive losses from a combination of depreciation, cost segregation and bonus depreciation to offset taxable income from other real estate investments. Due to the quality of the Amazon facility and financial strength of the tenant, this offering has both a compelling tax angle and exceptional economics for Capital Square's investors nationwide.\" </p>\n<p>Located at 500 32nd St. S.W., the 169.6-acre property is adjacent to U.S. Route 65 and Interstate 80 in <span class=\"xn-location\">Bondurant, Iowa</span>, a premiere industrial submarket in <span class=\"xn-location\">Greater Des Moines</span>. The four-story structure was completed in the fourth quarter of 2020. The building was designed by Amazon with the most recent technological advances and high-grade materials and can process nearly one million packages per day by implementing both robotics and human labor to maximize efficiencies.<sup>1,2</sup> The property is leased on an absolute net basis and is guaranteed by Amazon, which enjoys an investment-grade credit rating of AA from by S&amp;P.<sup>3</sup></p>\n<p>\"Structured to be highly tax efficient, this acquisition includes a dual loan system that shields investors from phantom income,\" said Whitson Huffman, chief strategy and investment officer. \"The lease also enjoys unsurpassed creditworthiness from the full guaranty of Amazon and its investment-grade corporate credit.\"</p>\n<p>As of <span class=\"xn-chron\">February 2022</span>, Amazon ranked as the world's fifth largest company by market capitalization, and the fourth largest in <span class=\"xn-location\">the United States</span> at nearly <span class=\"xn-money\">$1.52 trillion</span>.<sup>4</sup> It is the second largest firm in the Fortune 500. Amazon operates its retail sales and distribution activity through its Amazon Services business line, the sole tenant of the <span class=\"xn-location\">Bondurant, Iowa</span> facility. As of <span class=\"xn-chron\">December 2021</span>, Amazon's domestic industrial network totaled more than 347.6 million square feet of active facilities, with more than 125.6 million square feet either planned or under development.<sup>5</sup> Amazon Robotics sort fulfillment centers are the largest facilities in the Amazon logistical network. </p>\n<p>CS1031 Zero Coupon Fulfillment Center, DST seeks to raise <span class=\"xn-money\">$52.2 million</span> in equity from accredited investors.</p>\n<p><span class=\"xn-location\">Greater Des Moines</span> has experienced a great deal of interest from developers and end users, with more than 630 acres purchased since 2019.<sup>6</sup> The MSA is also attractive to technology companies. <span class=\"xn-location\">Des Moines</span> enjoys a high ranking on the 2021 lists \"Top Emerging North American Tech Market\" by CBRE, \"Most Resilient Tech Hub\" by LinkedIn, and \"Rising Star for Tech Jobs\" by CompTIA. As a result, tech companies, such as Apple, Facebook and Microsoft have found the area to be a strategic and cost-effective location for data center operations.</p>\n<p>Capital Square acquired the property from Mesirow Realty Sale-Leaseback Inc. (\"Mesirow\"). Mesirow's Sale-Leaseback Capital team structured and financed the development of this property, starting prior to the commencement of construction. Mesirow's breadth of specialized expertise, depth of relationships and balance sheet strength has enabled the firm to execute more than <span class=\"xn-money\">$8 billion</span> in single-tenant transactions while serving the long-term strategic needs of organizations such as Amazon. </p>\n<p>Since its founding in 2012, Capital Square has acquired 149 real estate assets for over 4,600 individual investors, spanning across 5,800 investments, seeking quality replacement properties that qualify for tax deferral under Section 1031 of the Internal Revenue Code and other investors seeking stable cash flow and capital appreciation.</p>\n<p><b>About Capital Square<br/></b>Capital Square is a national real estate firm specializing in tax-advantaged real estate investments, including <span class=\"xn-location\">Delaware</span> statutory trusts for Section 1031 exchanges and qualified opportunity zone funds for tax deferral and exclusion. Since 2012, Capital Square has completed more than <span class=\"xn-money\">$4.9 billion</span> in transaction volume. Capital Square's executive team has decades of experience in real estate investments. Its founder, <span class=\"xn-person\">Louis Rogers</span>, has structured hundreds of investment offerings totaling in excess of <span class=\"xn-money\">$5 billion</span>. Capital Square's related entities provide a range of services, including due diligence, acquisition, loan sourcing, property/asset management, and disposition, for a growing number of high net worth investors, private equity firms, family offices and institutional investors. Since 2017, Capital Square has been recognized by Inc. 5000 as one of the fastest growing companies in the nation for five consecutive years. Additionally, in 2021, the company was ranked 101st on the list of Inc. 5000 Washington D.C. Metro's Fastest-Growing Private Companies. In 2017, 2018 and 2020, the company was also ranked on Richmond BizSense's list of fastest growing companies. Capital Square was listed by Virginia Business on their \"Best Places to Work in <span class=\"xn-location\">Virginia</span>\" report in 2019 and 2021 as well as on their \"Fantastic 50\" reports in 2019 and 2020. To learn more, visit <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3445273-1&amp;h=3076189330&amp;u=http%3A%2F%2Fwww.capitalsquare1031.com%2F&amp;a=www.CapitalSquare1031.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.CapitalSquare1031.com</a>. </p>\n<p>Sources: 1. <a href=\"https://who13.com/news/amazon-confirms-bondurant-fulfillment-center-facility-to-create-1000-full-time-jobs/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://who13.com/news/amazon-confirms-bondurant-fulfillment-center-facility-to-create-1000-full-time-jobs/</a> | 2. <a href=\"https://www.radioiowa.com/2021/09/14/amazonlooking-to-hire-more-workers-at-its-iowa-locations/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.radioiowa.com/2021/09/14/amazonlooking-to-hire-more-workers-at-its-iowa-locations/</a> | 3. CompaniesMarketCap.com | 4. <a href=\"https://finance.yahoo.com/quote/AMZN/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://finance.yahoo.com/quote/AMZN/</a> | 5. MWPVL International | 6. Greater Des Moines Partnership, <a href=\"https://www.dsmpartnership.com/news-media/news/partnership-news/dsm-population-growth-percentageoutpaces-other-midwest-metros\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.dsmpartnership.com/news-media/news/partnership-news/dsm-population-growth-percentageoutpaces-other-midwest-metros</a> </p>\n<p>Disclaimer: Securities offered through WealthForge Securities, LLC, Member FINRA/SIPC. Capital Square and WealthForge Securities, LLC are separate entities. There are material risks associated with investing in DST properties and real estate securities including illiquidity, tenant vacancies, general market conditions and competition, lack of operating history, interest rate risks, the risk of new supply coming to market and softening rental rates, general risks of owning/operating commercial and multifamily properties, short term leases associated with multi-family properties, financing risks, potential adverse tax consequences, general economic risks, development risks, long hold periods, and potential loss of the entire investment principal. Past performance is not a guarantee of future results. Potential cash flow, returns and appreciation are not guaranteed. IRC Section 1031 is a complex tax concept; consult your legal or tax professional regarding the specifics of your particular situation. This is not a solicitation or an offer to see any securities. Please read the Private Placement Memorandum (PPM) in its entirety, paying careful attention to the risk section prior to investing. Private placements are speculative. Diversification does not guarantee profits or protect against losses.</p>\n<p><b>Contact: <br/></b><span class=\"xn-person\">Julie Leber</span><br/>Spotlight Marketing Communications<br/>949.427.1391<br/><a href=\"mailto:julie@spotlightmarcom.com\" data-type=\"email\" translate=\"no\">julie@spotlghtmarcom.com</a>        </p>\n<p> </p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n</div>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=LA63729&amp;sd=2022-02-16\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1MQTYzNzI5JnNkPTIwMjItMDItMTY=&amp;key=95c6d95a4d59956917711fc1833f71c55ccd4e59db403166cf644a00377781315bbce36af78a679261f0beba89a9cfad0ccaf0937ea5652cd183e840fb956f4f\"/></div></div> View original content to download multimedia:<a href=\"https://www.prnewswire.com/news-releases/capital-square-1031-acquires-newly-constructed-2-69-million-square-foot-state-of-the-art-amazon-distribution-facility-301483453.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/capital-square-1031-acquires-newly-constructed-2-69-million-square-foot-state-of-the-art-amazon-distribution-facility-301483453.html</a><p></p>\n<p>SOURCE  Capital Square</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: CAPITAL-SQUARE-AMZN</p></div>"}