{"date": "2022-02-23 19:38:18.522000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3003.95, "close": 3027.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Element Nutritional Sciences has signed an agreement with Pattern to accelerate global online sales over the Amazon platform.</p><p>Effective February 2, 2022, the agreement captures both the Company's flagship Rejuvenate muscle health brand as well as its recently announced line of sports nutrition products, Promino, under the JAKTRX Performance Supplement line of products.Pattern is an international brand accelerating platform focused on the Amazon marketplace, managing revenue of over US$800 million in 2021. Pattern has created proprietary predictive software using artificial intelligence to drive e-commerce strategy and offers a full suite of growth services for retailers and consumer brands. Through this partnership, Pattern will oversee and help distinguish the full Element product portfolio on <a href=\"http://Amazon.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com</a> , as well as its international markets in Europe, Asia, Latin America and Australia.Stuart Lowther, Chief Executive Officer, \"We are at an exciting stage in our growth having recently announced our exclusive North America rights for the sports nutrition market and plans to develop a line of sports nutrition products called Promino. As one of the top three private sellers on Amazon in the US1, Pattern has an established presence in the e-commerce space and we believe that this partnership will be a significant catalyst to accelerating our growth of merchant partners and bringing our clinically-proven, innovative products in front of more customers, globally.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}