{"date": "2021-11-25 17:09:00.092000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3580.41, "close": 3561.57}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon Prime subscription price will soon be increased in India. The company has confirmed this news on its FAQ page. It says that the existing annual Prime membership plan, which is priced at Rs 999, will be available at a much higher price from December 13.</p><p>As per the e-commerce giant's support page, the monthly price of Amazon Prime will soon be Rs 179 and those who will buy the annual subscription will be required to pay Rs 1,499. This basically means that the annual plan will get a price hike of Rs 500. Amazon also offers a quarterly plan, which will soon cost Rs 459 in the country.</p></div><div class=\"tr-npp-body\"><p>Currently, customers can buy 30 days subscription plan for Rs 129. The quarterly plan is listed on the site for Rs 329, whereas the annual plan is available for Rs 999. The company has already announced that customers will not be charged extra on their existing plan.</p><p>According to the support page, Amazon will automatically charge users for the next membership period from the day when your free trial or membership period ends.</p><p>\"Existing Prime members can continue their membership for the duration their membership plan is at the current price. However, after the price change, you can choose to renew your membership at the new price,\" the company said.</p><p>In addition to this, the company has also confirmed that users who have joined Amazon Prime as a part of their telecom plan will soon see an increase in the pricing.</p><p>\"Since the launch 5 years ago in IN, Prime has continued to increase the value it offers members. Prime provides an unparalleled combination of shopping, savings and entertainment benefits to make life more convenient and entertaining every single day, and we continue to invest in making Prime even more valuable for customers,\" Amazon stated. This is the reason why the company wants to increase the price of the subscription.</p><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}