{"date": "2021-12-24 18:18:02.497000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3421.37, "close": 3413.22}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Mumbai</p></div><div class=\"tr-npp-lead\"><p>Mumbai, Dec. 24 -- Lenders to Future Retail Ltd are in initial talks on whether they should take a more active role to offload some of the group's non-core assets in a bid to salvage their loans, said a person aware of the development.</p><p>\"Non-core asset sales planned as part of the debt recast process have not fructified. Banks are discussing whether they would like to take control of the process and push for it. However, discussions are still at a preliminary stage,\" the person cited above said, requesting anonymity.</p></div><div class=\"tr-npp-body\"><p>Future Retail's lenders include Union Bank of India, Bank of India, Bank of Baroda, State Bank of India, Indian Bank, Central Bank, Axis Bank and IDBI Bank.</p><p>According to data from Care Ratings, the company owes banks Rs.6,278 crore. The Future group owes around $3 billion in loans on an aggregate basis. The moratorium on loan repayment ended on 30 September, and if the company fails to clear its dues by December-end, it would be termed a defaulter on 1 January and would be eventually classified as non-performing.</p><p>\"Even if the company defaults on repayments this month, banks would have another 90 days before loans turn non-performing,\" the person said.</p><p>Reuters reported on 8 December that Italy's Generali is in talks to raise its stake in two Indian insurance businesses as its local partner, Future group, is looking to exit the arrangement.</p><p>Generali wants to increase its stake to as much as 74% in both the life and non-life insurance companies from 49%, the report said.</p><p>Lenders are, meanwhile, hopeful that the recent Competition Commission of India's (CCI's) ruling suspending Amazon's 2019 deal with Future Coupons Ltd, a group unit, would pave the way for Future Retail's deal with Reliance Retail.</p><p>On 17 December, the competition watchdog kept Amazon's purchase of a 49% stake in Future Coupons in abeyance and ordered a penalty of Rs.202 crore for allegedly not being upfront about the actual scope and purpose of the deal.</p><p>In August 2019, Amazon had bought the 49% stake in Future Coupons, which owns a 7.3% equity in Future Retail through convertible warrants, with the right to buy into the flagship Future Retail after 3 to 10 years.</p><p>\"This deal with Future Coupons was the premise of Amazon's legal battle. We have to wait for the final verdict. Unless there are more legal delays, the Future-Reliance deal could now be finalized in the coming months, and repayments would be forthcoming,\" said the person cited above.</p><p>A spokesperson for Future Retail did not immediately respond to queries.</p><p>Amazon has objected to Future group's deal with Reliance Retail Ventures Ltd, citing a violation of its investment agreement with the group that barred it from selling its assets to other entities.</p><p>A tussle over the assets of Future group between two of the world's richest men-Mukesh Ambani of Reliance Industries Ltd and Jeff Bezos of Amazon-has left lenders scrambling to recover their loans to the Indian conglomerate.</p><p>Last August, Reliance Retail, a unit of Reliance Industries, agreed to buy Future group's retail assets on a slump sale basis for Rs.24,713 crore.</p><p>The cash-strapped Future group is trying to expedite the deal with Reliance Industries to pay creditors and save the Big Bazaar retail chain from a possible collapse. Published by HT Digital Content Services with permission from MINT. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htlive.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 HT Digital streams Ltd</p></div>"}