{"date": "2021-04-29 07:08:18+00:00", "ticker": "AVV", "mrkt_info": {"open": 3695.0, "close": 3542.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Dubai, UAE</strong> – AVEVA, a global leader in industrial software, driving digital transformation and sustainability, has strategically partnered with PlanetTogether, the leading Advanced Planning &amp; Scheduling (APS) platform provider, to bring scheduling optimization capabilities to manufacturers looking to deliver digital transformation and sustainable solutions across their industrial operations. The partnership adds robust new capabilities to the AVEVA Manufacturing Execution System (MES) in terms of visual planning and scheduling, multi-plant production planning and production schedule optimization, further broadening AVEVA’s portfolio of Industry 4.0 manufacturing solutions.</p>\n<p>The combined offering leverages the strengths of both companies, to optimize performance across the value chain for manufacturers seeking to deploy integrated production planning and execution systems in order to increase their agility and supply chain resilience and deliver increased business returns in a volatile market. As a manufacturing planning and scheduling system provider, PlanetTogether resolves production and operational constraints and its integration with AVEVA MES enables supply chain planners to conduct realistic, integrated sales and operations planning based on actual plant capacity and material availability, with full visibility to progress against plan for on-time delivery at the lowest cost.</p>\n<p>“Our partnership with AVEVA enables us to broaden our reach to new players across the industrial ecosystem. We chose to work with them because they stood head and shoulders above the industry in terms of delivering transformative digital technology to enhance customer digital collaboration in order to drive higher operational efficiency, quality, and agility to maintain a competitive edge in today’s dynamic markets,” said Jim Cerra, Co-founder and CEO of PlanetTogether.</p>\n<p>“In the last year alone, the landscape for manufacturers has changed irrevocably, driven by the increasing need for enterprise agility, sustainability and value chain optimization. Manufacturers are integrating their operations into their supply chain systems, as a result of the impact of pandemic,” commented Harpreet Gulati, Senior Vice-President, Planning &amp; Operations Business Unit at AVEVA.</p>\n<p> “Our partnership also speaks to our joint commitment to sustainability. Together, PlanetTogether and AVEVA enable customers to add sustainability drivers, such as energy use or greenhouse gas (GHG) to the optimization rules of the production schedule, resulting in less waste, and more responsible use of resources for production,” Gulati continued.</p>\n<p>Advanced Planning and Scheduling, delivered by PlanetTogether, simultaneously plans and schedules production based on available materials, labor, and machine capacity. The software, which has been successfully deployed in the Food and Beverage (F&amp;B) and Consumer Packaged Goods (CPG) manufacturing industries, provides a proven vertical fit for AVEVA MES. The integration of both production planning and manufacturing execution into a single digital system represents the next step for manufacturers for growth and increased profitability.</p>\n<p>To learn more about Advanced Planning and Scheduling from PlanetTogether visit: <a href=\"https://www.aveva.com/en/products/PlanetTogether-aps/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.aveva.com/en/products/PlanetTogether-aps/</a> </p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}