{"date": "2021-12-01 19:54:02.164000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwlistdisc{list-style-type:disc;}</style><p class=\"bwalignc\">\n<b>Zerto Announces Zerto In-Cloud for AWS to Deliver Disaster Recovery at Scale</b>\n</p><p class=\"bwalignc\">\n<b><span>Demonstrates Simple, Scalable, Efficient Disaster Recovery for On-Premises and Public Cloud Workloads</span></b>\n</p><p>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.zerto.com%2F&amp;esheet=52541889&amp;newsitemid=20211130005190&amp;lan=en-US&amp;anchor=Zerto&amp;index=1&amp;md5=df5f13a77fa26c016ac1a122b50fd3c9\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Zerto</a>, a Hewlett Packard Enterprise company, has announced the availability of Zerto In-Cloud for Amazon Web Services, Inc. (AWS), a new cloud-native, software offering of the Zerto platform that delivers disaster recovery (DR) for Amazon Elastic Compute Cloud (Amazon EC2), scaling to protect 1,000+ instances across regions, availability zones, and accounts. Unveiled at AWS re:Invent 2021, Zerto In-Cloud for AWS brings reliability and speed to the protection of enterprise AWS applications with simple automated workflows for failover, recovery, and testing.\n</p><p>\nOrganizations that run workloads in Amazon EC2 instances need to protect them with a simple and scalable disaster recovery solution. The challenge with available solutions is that they are either agent-based, require heavy manual configuration and management, are limited in regional coverage, or do not easily integrate with automation tools. As such, these solutions do not allow for protection and recovery at scale or speed.\n</p><p>\nTo address these challenges, Zerto is now expanding its leading DR capabilities to Amazon EC2 instances that need protection across AWS regions and availability zones. Zerto’s innovative approach for in-cloud replication solves the scaling issue with orchestration and automation without requiring agents. Zerto In-Cloud for AWS improves volume replication efficiency at scale across regions and zones, and optimizes orchestration workflows to achieve minimal data loss and rapid recovery to achieve your Recovery Point Objective (RPO) and Recovery Time Objective (RTO). Zerto In-Cloud for AWS brings a simple, scalable, and efficient cloud-native DR to AWS workloads that are born in the cloud or migrated into the cloud.\n</p><p>\nZerto’s breadth of capabilities includes migration, disaster recovery, and backup to AWS as well as protection of Amazon EC2 workloads to on-premises environments. The Zerto In-Cloud for AWS offering complements these capabilities by introducing a resilient, highly scalable, cloud-native architecture for in-cloud disaster recovery. API-centric management allows Zerto In-Cloud for AWS to be easily integrated into a user’s automation solution of choice to streamline workload protection as part of an overall data management strategy. Zerto provides one platform and one experience for disaster recovery, backup, and mobility to, from, and between AWS workloads, whether that’s for VMs or containers.\n</p><p>\nAdditional key capabilities of Zerto In-Cloud for AWS include:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\n<b>Automated Failover Testing</b>: Zerto In-Cloud for AWS automation and orchestration allows for non-disruptive failover testing of all instances in an AWS region or availability zone to validate recovery plans and ensure you are ready when an outage of disaster strikes.\n</li>\n<li>\n<b>Application Protection:</b> Protect and recover large complex applications like SAP or Oracle. Zerto In-Cloud for AWS orchestration enables protection groups across multiple instances in AWS.\n</li>\n<li>\n<b>Stateless Management:</b> The Zerto In-Cloud for AWS management components can be run from any Amazon EC2 region and can be protected region to region to be resilient against any regional outage.\n</li>\n</ul><p>\n“For years, Zerto has been the industry-leading DR platform for protecting on-premises VMs to AWS, and with the availability of Zerto In-Cloud for AWS, Amazon EC2 users can now quickly recover their workloads across different AWS regions after any disruptions, including ransomware attacks,” said <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.zerto.com%2Fmanagement-team%2F&amp;esheet=52541889&amp;newsitemid=20211130005190&amp;lan=en-US&amp;anchor=Ziv+Kedem&amp;index=2&amp;md5=82dc4b64fd4029ca0fe03b0c8a2bb43e\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Ziv Kedem</a>, VP and general manager, Zerto. “We bring the Zerto simplicity at scale to this user community. By delivering easy disaster recovery orchestration at scale, organizations can build DR strategies to protect their mission-critical applications running on EC2.”\n</p><p>\nZerto In-Cloud for AWS will be available on the AWS Marketplace in early 2022.\n</p><p>\nFor further information about Zerto In-Cloud for AWS, click <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.zerto.com%2Fsolutions%2Fuse-cases%2Fcloud%2Faws%2F&amp;esheet=52541889&amp;newsitemid=20211130005190&amp;lan=en-US&amp;anchor=here&amp;index=3&amp;md5=2de04cd8b4f6fdb57dac92fa3fa6aa69\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a>. If attending AWS re:Invent 2021, visit Zerto at booth 640. Click <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.zerto.com%2Fpage%2Flabs%2F&amp;esheet=52541889&amp;newsitemid=20211130005190&amp;lan=en-US&amp;anchor=here&amp;index=4&amp;md5=f0e94af667ea1894698c46d24dce0de0\" data-type=\"url\" class=\"tr-link\" translate=\"no\">here</a> to also get on-demand access to learn and explore Zerto for AWS.\n</p><p>\n<b>About Zerto</b>\n</p><p>\nZerto, a Hewlett Packard Enterprise company, empowers customers to run an always-on business by simplifying the protection, recovery, and mobility of on-premises and cloud applications. Zerto’s cloud data management and protection platform eliminates the risks and complexity of modernization and cloud adoption across private, public, and hybrid deployments. The simple, software-only platform uses continuous data protection at scale to converge disaster recovery, backup, and data mobility. Zerto is trusted by over 9,500 customers globally and is powering offerings for Microsoft Azure, IBM Cloud, AWS, Google Cloud, Oracle Cloud, and more than 350 managed service providers.\n</p><p><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211130005190/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211130005190/en/</a></span></p><p>\nDerrick Shannon\n<br/>Touchdown PR\n<br/><a href=\"mailto:zerto@touchdownpr.com\" data-type=\"email\" translate=\"no\">zerto@touchdownpr.com</a><br/>772.475.1027\n</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NV-ZERTO</p></div>"}