{"date": "2021-05-05 09:42:08+00:00", "ticker": "AAF", "mrkt_info": {"open": 77.0, "close": 78.9}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">The author is a Reuters Breakingviews columnist.  The opinions expressed are his own.</p><p class=\"tr-by\">By Ed Cropley</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">LONDON, May 5 (Reuters Breakingviews)</span><span class=\"tr-dl-sep\"> - </span>The prospect of a cashless Africa has triggered a scramble for control of its payments plumbing. The continent’s top telecoms operators have become big financial players thanks to their “mobile money” networks, which provide basic banking to tens of millions through handsets. If China is a guide, that could make them gatekeepers to a fintech revolution.</p><p>Africa’s patchy personal banking industry helped make it the world leader in mobile money, which lets consumers and small enterprises zap each other cash via a bare-bones cellphone handset. For the industry’s four big players – France’s Orange <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ORAN.PA\" data-type=\"ric\" data-ric=\"ORAN.PA\" translate=\"no\" dir=\"ltr\">ORAN.PA</a>, South Africa’s MTN <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MTNJ.J\" data-type=\"ric\" data-ric=\"MTNJ.J\" translate=\"no\" dir=\"ltr\">MTNJ.J</a>, Britain’s Vodafone <a href=\"reuters://REALTIME/Verb=FullQuote/ric=VOD.L\" data-type=\"ric\" data-ric=\"VOD.L\" translate=\"no\" dir=\"ltr\">VOD.L</a> and Airtel Africa <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AAF.L\" data-type=\"ric\" data-ric=\"AAF.L\" translate=\"no\" dir=\"ltr\">AAF.L</a>, controlled by India’s Bharti Airtel <a href=\"reuters://REALTIME/Verb=FullQuote/ric=BRTI.NS\" data-type=\"ric\" data-ric=\"BRTI.NS\" translate=\"no\" dir=\"ltr\">BRTI.NS</a> – the coronavirus pandemic has affirmed the social importance of the service to the region’s billion people. It’s also a reminder of the industry’s commercial fragility.</p><p>Restrictions on movement and increased wariness of handling physical cash helped lift sub-Saharan mobile money transaction volumes 23% to $490 billion last year, greater than the GDP of Nigeria, the region’s biggest economy. Active users increased by 18% to 159 million, according to the GSMA, an industry body. However, that boom failed to translate into a windfall for operators. Revenue fell 24% in the first quarter of 2020, the GSMA reckons, as governments pressured mobile money providers to reduce commissions on simple transactions to cushion the economic blow of lockdowns.</p><p>Unsurprisingly, that has made operators nervous. Such fees typically bring in 90% of mobile money providers’ revenue and, thanks to a hefty EBITDA margin of nearly 50%, an appreciable chunk of their parent companies’ overall bottom line. MTN’s MoMo unit brought in $437 million of EBITDA in 2019, accounting for 10% of the $12 billion group’s total. More importantly, the higher valuation multiples investors bestow on fintech-related enterprises mean mobile money represents an outsize chunk of their telco owners’ worth. Last month, Mastercard <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MA.N\" data-type=\"ric\" data-ric=\"MA.N\" translate=\"no\" dir=\"ltr\">MA.N</a> invested $100 million in Airtel Africa’s mobile money division at an enterprise value of 12 times the unit’s EBITDA. By that yardstick, MoMo would be worth more than $5 billion, nearly a third of MTN’s total value, including debt.</p><p>The providers’ other big worry is the gradual rollout across Africa of 4G telephone networks, along with cut-price smartphones made by Chinese vendors like Transsion <a href=\"reuters://REALTIME/Verb=FullQuote/ric=688036.SS\" data-type=\"ric\" data-ric=\"688036.SS\" translate=\"no\" dir=\"ltr\">688036.SS</a>, Huawei Technologies and Xiaomi <a href=\"reuters://REALTIME/Verb=FullQuote/ric=1810.HK\" data-type=\"ric\" data-ric=\"1810.HK\" translate=\"no\" dir=\"ltr\">1810.HK</a>. Together, these threaten mobile money’s low-tech monopoly by opening the door for lenders like South Africa’s Standard Bank <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SBKJ.J\" data-type=\"ric\" data-ric=\"SBKJ.J\" translate=\"no\" dir=\"ltr\">SBKJ.J</a> to offer basic digital banking to the masses.</p><p>Happily for operators, the two threats might combine to deliver a solution. Though lower fees reduced commission revenue for mobile money operators, expanded customer bases represent a new opportunity. The role model is Ant, the Chinese financial giant that grew out of the payments arm of the Alibaba <a href=\"reuters://REALTIME/Verb=FullQuote/ric=9988.HK\" data-type=\"ric\" data-ric=\"9988.HK\" translate=\"no\" dir=\"ltr\">9988.HK</a>, <a href=\"reuters://REALTIME/Verb=FullQuote/ric=BABA.N\" data-type=\"ric\" data-ric=\"BABA.N\" translate=\"no\" dir=\"ltr\">BABA.N</a> e-commerce behemoth. For the billion-plus users of its Alipay service, cash transfers are largely free. The bulk of its revenue now comes from selling them investment products, loans and insurance.</p><p>The switch has been dramatic. Ant’s fintech revenue more than doubled to $10.4 billion between 2017 and 2019. More importantly, revenue per user rose by a third every year, to $15 in 2019.</p><p>Africa’s average per capita wealth is only a fifth of China’s. However, its consumer banking services are arguably even worse than in the People’s Republic, while the absence of social safety nets beyond immediate family creates a fertile market for products like insurance. Furthermore, Africans have shown they are happy to pay for services that make life easier. Last year, the pioneering M-Pesa mobile money service owned by Vodafone offshoot Safaricom <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SCOM.NR\" data-type=\"ric\" data-ric=\"SCOM.NR\" translate=\"no\" dir=\"ltr\">SCOM.NR</a> brought in $33 for each of the 25 million Kenyans – over half the country – that used it.</p><p>If the mobile money providers could eventually squeeze an Ant-style $15 of extra revenue out of each of their 159 million users in sub-Saharan Africa, they would generate $2.4 billion in additional annual revenue. Assuming a 50% EBITDA margin and valuation multiple of 12 times, that would represent more than $14 billion of additional market worth.</p><p>The prospect of such grand prizes has created a flurry of activity. African banks are scrambling to launch basic mobile accounts. M-Pesa is hawking insurance and savings products to Kenyans. Orange is shunting its mobile money customers to its new digital-only Orange Bank Africa. Airtel Africa and MTN are both contemplating initial public offerings for their respective units, presumably to enable nimbler dealmaking with prospective partners. The scramble for Africa’s mobile money is just around the corner.</p><p>Follow <a href=\"https://twitter.com/edwardcropley\" data-type=\"url\" class=\"tr-link\" translate=\"no\">@edwardcropley</a> on Twitter</p><p><br/></p><p>CONTEXT NEWS</p><p>- Mobile operator MTN on May 5 reported that its revenue from fintech operations expanded by 31% in the first three months of 2021, on the back of an 87% increase in the value of online financial transactions. Fintech operations accounted for 8.7% of total service revenue for the period, which was 42.3 billion rand.</p><p>- The company said that a plan to spin off the fintech unit, which includes mobile money, should be finalised by the first quarter of 2022. </p><p>- Shares of MTN were up 7.6% at 0927 GMT on May 5.</p><p>- For previous columns by the author, Reuters customers can click on <a href=\"reuters://REALTIME/verb=Headlines/ric=CROPLEY/\" data-type=\"newsExpression\" data-expression=\"CROPLEY/\" translate=\"no\" dir=\"ltr\">CROPLEY/</a> </p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (SIGN UP FOR BREAKINGVIEWS EMAIL ALERTS <a href=\"http://bit.ly/BVsubscribe\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://bit.ly/BVsubscribe</a> | Editing by Peter Thal Larsen and Oliver Taslic)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:ed.cropley@thomsonreuters.com\" data-type=\"email\" translate=\"no\">ed.cropley@thomsonreuters.com</a> ; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://ed.cropley.thomsonreuters.com@reuters.net\">ed.cropley.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AFRICA-PAYMENT/BREAKINGVIEWS</p></div>"}