{"date": "2022-01-29 20:10:11+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2879.56, "close": 3023.87}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Alexandra Valencia</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">QUITO, Jan 29 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>OCP Ecuador, the operator of Ecuador's privately held heavy crude pipeline, suspended pumping crude on Saturday as a preventative measure after it ruptured in the Amazon, and began cleaning and repairs.</p><p>The burst happened late on Friday in the Piedra Fina zone, an area in Ecuador's Amazon where regressive erosion caused the OCP pipeline and the state-owned SOTE pipeline to halt pumping in December, forcing the government to declare force majeure over its oil exports and production.</p><p>\"OCP Ecuador S.A. informs that the pumping of crude oil has been stopped as a preventive measure, and that it will be restarted when the conditions are right,\" the company said in a statement.</p><p>Remedial action includes containing the spilled crude so it cannot contaminate bodies of water, the company said. Repairs had also begun on the tube, it said.</p><p>Regressive erosion has advanced steadily in the area since 2020, threatening pipelines and causing problems for water sources for Ecuador's largest hydroelectric plant and a highway.</p><p>OCP Ecuador said on Friday that the pipeline burst in an area which is not directly exposed to rivers, and that it had controlled the oil flow. However, Indigenous organization CONFENIAE said communities were already being affected.</p><p>\"The impact of the oil spill has reached the Kichwa community of Panduyaku in the province of Sucumbíos,\" CONFENIAE said in a message on Twitter, along with a video showing crude contamination in a river.</p><p>Both pipelines burst in 2020 due to the erosion, causing an oil spill in the Coca river and affecting numerous Amazon communities.   </p><p>Energy Minister Juan Carlos Bermeo said he was keeping an eye on the situation. </p><p>OCP Ecuador has employed measures to make sure neither the flow of oil nor the country's export of crude is affected, it said.</p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Alexandra Valencia<br/>Writing by Oliver Griffin; editing by Grant McCool)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Oliver.Griffin@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Oliver.Griffin@thomsonreuters.com</a> ; +57 304-583-8931; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: ECUADOR-OIL/ENVIRONMENT</p></div>"}