{"date": "2022-01-13 07:51:13.297000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3307.24, "close": 3224.28}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p> <br/>   By Siddhi Nayak<br/>NewsRise<br/>   MUMBAI (Jan 13) -- An Indian tribunal today gave Competition Commission of India (CCI) and Future Group 10 days to respond to Amazon’s plea challenging the antitrust watchdog’s revocation of the U.S. company's 2019 deal with Future Coupons.<br/><br/>The CCI urged the National Company Law Appellate Tribunal (NCLAT) to not pass any interim order. The agency is ready to argue whenever asked for, CCI counsel told a bench led by justices M. Venugopal and V.P. Singh. The bench ordered the parties to submit brief, written replies in the matter and adjourned the next hearing to Feb. 2. <br/><br/>The U.S. online retailer has been locked in a long-drawn dispute with debt-ridden Future Group over its plan to sell the retail, wholesale, warehousing, and logistics businesses to billionaire Mukesh Ambani’s Reliance Industries in a $3.4 billion. <br/><br/>Amazon had in 2019 bought a 49% stake in Future Coupons, the group’s gift voucher unit, which owned a 7.3% stake in Future Retail, effectively giving the U.S. company a foothold in the flagship retailer.<br/><br/>The antitrust regulator had last month suspended the deal, saying the U.S. company concealed information while filing for regulatory approval. Amazon had \"suppressed the actual scope\" of the deal and made \"false and incorrect statements,\" the CCI order said.  <br/><br/>Amazon’s counsel Gopal Subramanium argued at the NCLAT today that competition commission’s assessment in 2019 did not suggest any law or regulation was messed with. Subramanium contended that Amazon had already negotiated over the call option on Future Retail’s shares held by its promoters. Amazon has paid a premium of 25% over the regulatory price of securities of Future Retail just to get strategic rights and call option, he said.<br/><br/>Meanwhile, Reliance Industries had, in 2020, agreed to buy the retail, wholesale, warehousing, and logistics businesses of the debt-ridden Future Group. However, the deal has been delayed due to the long-drawn dispute with Amazon.<br/><br/>The dispute started after Amazon sought to block the Reliance deal by getting a freeze order from Singapore arbitration court, citing alleged violation of contractual agreements.  <br/>   - By Siddhi Nayak; siddhi.nayak@newsrise.org; 91-22-61353307<br/>- Edited by Dhanya Ann Thoppil<br/>- Send Feedback to feedback@NewsRise.org<br/>- Copyright (c) 2022 NewsRise Financial Research &amp; Information Services Pvt. Ltd.<br/>    </p></div>"}