{"date": "2021-11-29 10:51:56.266000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p> <br/>   By Ujjwal Narayan<br/>NewsRise<br/>   NEW DELHI (Nov 29) -- India’s Supreme Court today granted Amazon two more weeks to file its response in a case at the Competition Commission of India on the U.S. e-commerce giant’s 2019 stake purchase deal with Future Group, said one of the lawyers representing the case.<br/><br/>A bench led by Chief Justice N. V. Ramana heard a plea by Amazon challenging the Delhi High Court’s order, directing CCI to expedite a decision on the validity of U.S. company’s investment in Future Coupons, the lawyer said. Amazon had, in 2019, bought a 49% stake in Future Coupons that owns a 7.3% stake in Future Retail.<br/><br/>The CCI had concluded hearing in the matter last week, but reserved the order. Meanwhile, Amazon moved the Supreme Court seeking reprieve on the High Court order.<br/><br/>The top court today observed that it is not “going into details” of CCI proceedings, but will give an extension of two weeks to the commission beyond the two-week deadline that was set by the Delhi High Court, the lawyer said. <br/><br/>The parties are at liberty to raise all objection before commission, the court observed, disposing off Amazon’s special leave petition. <br/><br/>The U.S. online retailer has been locked in a long-drawn dispute with debt-ridden Future Group over its plan to sell the retail, wholesale, warehousing, and logistics businesses to billionaire Mukesh Ambani’s Reliance Industries. <br/><br/>The deal has been delayed after Amazon accused Future Group of violating contractual obligations by agreeing to sell out to Reliance. Amazon sought to block the deal by getting an order from Singapore arbitration court to put the deal on hold. <br/><br/>Shares of Future Retail closed 3.6% higher at 52.10 rupees in Mumbai trading, while those of Reliance Industries rose 1.3% to 2,442.50 rupees. The S&amp;P BSE Sensex rose 0.3%.<br/>   - By Ujjwal Narayan; Ujjwal.Narayan@newsrise.org; 01166767700<br/>- Edited by Dhanya Ann Thoppil<br/>- Send Feedback to feedback@NewsRise.org<br/>- Copyright (c) 2021 NewsRise Financial Research &amp; Information Services Pvt. Ltd.<br/>    </p></div>"}