{"date": "2021-11-30 20:11:46.633000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>Box Secure Connectivity to the AWS Cloud</p>\n<p>1252936 30.11.2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<pre>EQS Group-News: u-blox AG / Key word(s): Product Launch                        \nu-blox AG: New u-blox AWS IoT ExpressLink Modules Offer Out-of-the-Box Secure  \nConnectivity to the AWS Cloud                                                  \n                                                                               \n30.11.2021 / 21:00                                                             \n                                                                               \n                                                                               \n------------------------------------------------------------                   \nPress Release                                                                  \n                                                                               \nNew u-blox AWS IoT ExpressLink Modules Offer Out-of-the-Box Secure Connectivity\nto the AWS Cloud                                                               \n                                                                               \nPre-provisioned modules enable out-of-the-box secure communication with AWS via\nWi-Fi and cellular IoT                                                         \n                                                                               \nThalwil, Switzerland - November 30, 2021 - u-blox (SIX:UBXN,OTC:UBLXF), a      \nleading global provider of positioning and wireless communication technologies \nand services, has announced two modules designed to enable Amazon Web Services \n(AWS) cloud services for device and fleet management out of the box: the       \nNORA-W2 AWS IoT ExpressLink Wi-Fi module and the SARA-R5 AWS IoT ExpressLink   \ncellular module for internet of things (IoT) connectivity. The AWS IoT         \nExpressLink modules will significantly accelerate design-in and time to market.\n                                                                               \n                                                                               \nFor many businesses, connecting devices to the cloud remains challenging.      \nExisting solutions involve installing and maintaining dedicated software to    \nmanage connectivity on the devices. In addition, many legacy devices are too   \nresource-constrained to accommodate the additional code required to enable     \ncloud connectivity. To solve these challenges, these two modules were selected \nby EDN, Inc. for their gardening products:                                     \n                                                                               \n\"We were looking for a quick and effective way to enable robust cloud          \ncapabilities for our indoor growing platform. From past experience we knew that\ndoing so adds significant risk in terms of time, money, and overall            \ngo-to-market execution,\" stated Ryan Woltz, CEO at EDN, Inc. \"IoT device       \nconnectivity is complex, forcing our team to either outsource the development  \nto a costly third party or allocate internal engineering resources, both of    \nwhich can delay innovative features and increase our time to market. With      \nu-blox's NORA-W2 and SARA-R5 AWS IoT ExpressLink modules, we can go from       \nprototype to production in days, with secure and reliable cloud connectivity   \nthat scales. The u-blox platform has become our strategic advantage, enabling  \nus to focus on what we do best-creating innovative products that make nature   \naccessible indoors.\"                                                           \n                                                                               \nThe u-blox AWS IoT ExpressLink modules are all about speed and simplicity.     \nPaving the way for rapid design-ins with no complex software to run and        \nmaintain on the device side, the modules are ideal for small to medium-sized   \nbusinesses targeting consumer and industrial markets.                          \n                                                                               \nFeaturing a simplified and highly abstracted command set, the modules can be   \nconfigured without requiring specialized competencies in IoT product           \ndevelopment, networking, and cryptography. Pre-provisioned to communicate with \nAWS IoT Core, they can connect to AWS securely, out of the box, with a few     \ncommands only and integrate with services in the AWS ecosystem.                \n                                                                               \nSupport for Wi-Fi and cellular communication                                   \n                                                                               \nThe two modules are the first Wi-Fi and cellular AWS IoT ExpressLink modules on\nthe market.                                                                    \n                                                                               \nThe NORA-W2 AWS ExpressLink module is a new u-blox module delivering Wi-Fi 4   \nconnectivity as well as Bluetooth low energy 5 connectivity (including         \nBluetooth long range). The compact module (10.4 by 14.3 millimeters) features a\npowerful dual-core central processing unit (CPU) for advanced customer         \napplications. It is available with an antenna pin or featuring a printed       \ncircuit board (PCB) antenna.                                                   \n                                                                               \nThe SARA-R510 AWS IoT ExpressLink module is a variant of the SARA-R510S LTE-M  \nand NB-IoT module. The power optimized low-power wide-area (LPWA) module       \nconsumes less than 1 µA of current in power save mode (PSM), making it ideal   \nfor battery-powered applications. The module is certified for multi-regional   \nuse.                                                                           \n                                                                               \nEasy access for new entrants in the IoT space                                  \n                                                                               \n\"With the NORA-W2 and SARA-R5 IoT ExpressLink modules, wireless devices can be \nconnected to the cloud in a snap,\" said Andreas Thiel, Executive Director      \nProduct Centers and Co-Founder at u-blox. \"By simplifying access to cloud      \nservices, AWS IoT ExpressLink knocks down one of the key barriers standing in  \nthe way of newcomers to the IoT space: complexity.\"                            \n                                                                               \n\"The decision to work with u-blox was a clear choice for us at AWS, as we knew \nthat their high quality modules targeting industrial and professional          \napplications would complement our wide range of software and cloud services for\nIoT. Covering both Wi-Fi and LTE-M, the NORA-W2 and the SARA-R5 modules will   \naddress the critical need for IoT connectivity, and accelerate our customers'  \ntime to market,\" said Shyam Krishnamoorthy, General Manager, Consumer IoT and  \nConnectivity at AWS.                                                           \n                                                                               \nFirst samples of the u-blox AWS IoT ExpressLink modules and EVKs will be       \navailable by Q1 2022.                                                          \n                                                                               \n                                                                               \nAbout u-blox                                                                   \nu-blox (SIX:UBXN) is a global technology leader in positioning and wireless    \ncommunication in automotive, industrial, and consumer markets. Their smart and \nreliable solutions, services and products let people, vehicles, and machines   \ndetermine their precise position and communicate wirelessly over cellular and  \nshort range networks. With a broad portfolio of chips, modules, and secure data\nservices and connectivity, u-blox is uniquely positioned to empower its        \ncustomers to develop innovative and reliable solutions for the Internet of     \nThings, quickly and cost-effectively. With headquarters in Thalwil,            \nSwitzerland, the company is globally present with offices in Europe, Asia, and \nthe USA. (www.u-blox.com) Find us on Facebook, LinkedIn, Twitter @ublox and    \nYouTube                                                                        \nu-blox media contact:                                                          \nNatacha Seitz                                                                  \nSenior Manager PR and Content Marketing                                        \nMobile +41 76 436 0788                                                         \nnatacha.seitz@u-blox.com                                                       \n                                                                               \n                                                                               \n------------------------------------------------------------                   \nEnd of Media Release                                                           \n                                                                               \n------------------------------------------------------------                   \n\n\n\nLanguage:    English           \n\nCompany:     u-blox AG         \n\n             Zürcherstrasse 68 \n\n             8800 Thalwil      \n\n             Switzerland       \n\nPhone:       +41 44 722 74 44  \n\nFax:         +41 44 722 74 47  \n\nE-mail:      info@u-blox.com   \n\nInternet:    www.u-blox.com    \n\nISIN:        CH0033361673      \n\nListed:      SIX Swiss Exchange\n\nEQS News ID: 1252936           \n\n\n\n\n\n\n\n                                            \n\nEnd of News          EQS Group News Service\n\n\n\n------------------------------------------------------------</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}