{"date": "2021-11-02 19:47:23.756000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Frontier Communications announced that it has joined hands with eero, an Amazon company, to offer the eero Pro 6 to new fiber-optic customers, delivering a fast, reliable whole-home Wi-Fi experience.</p><p>Frontier's fiber-powered internet delivers symmetrical gigabit speeds and, when combined with eero's TrueMesh technology, optimizes Wi-Fi coverage throughout the home. An eero mesh Wi-Fi system minimizes dead zones, slow spots, and buffering by broadcasting wireless internet signals from multiple points in a home, rather than a single location.\"When you enter gigabit territory, it's a different world for your whole-home Wi-Fi experience,\" said John Harrobin, Executive Vice President, Consumer, Frontier Communications. \"With our powerful fiber-optic network, supported by eero Pro 6, our customers will enjoy high-quality and reliable premium speeds. Your home will have consistent internet connectivity, whether it is down a hall or between floors, providing a seamless experience for working, learning, shopping, gaming, and connecting.\"\"Working together with Frontier, we believe we can deliver a world-class Wi-Fi experience throughout the entire home,\" said Nick Weaver, Co-founder and CEO of eero. \"With Frontier Fiber and eero systems, we offer fast, reliable, and secure connectivity so customers can connect with friends and family, work and learn from home, or stream and game in 4K - all at the same time.\"Frontier customers can administer their eero network via a mobile app, giving customers the power to remotely manage their Wi-Fi network across an increasing number of devices in the home, with available eero Secure features such as advanced online security, ad blocking, content filter, and parental controls.With the mobile app, customers can link their Amazon account to automatically connect Zigbee devices like smart lights, locks, plugs and other compatible devices directly to their eero network simply by turning them on. Customers can even use the mobile application to manage their network, pause the internet, share their network with friends or guests, and more -- whether they're at home or on-the-go.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2001 MarketLine. All rights reserved. Republication or redistribution, including by framing or similar means, is expressly prohibited without prior written consent. MarketLine shall not be liable for errors or delays in the content, or for any actions taken in reliance thereon.</p></div>"}