{"date": "2021-11-30 13:50:04+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div>\n                <div>\n                  <div>\n                    <h4>\n            Qlik Extends Advanced Machine Learning Capabilities in Qlik Cloud With Amazon SageMaker\n          </h4>\n                  </div>\n                  <div>\n          Introduction Of Amazon SageMaker Integration Extends Predictive Modeling With Qlik's Active Intelligence Platform\n        </div>\n                  <div>\n                    <h4>\n            November 30, 2021\n          </h4>\n                  </div>\n                  <div>\n                    <p>\n                      <strong>Philadelphia</strong> - <u><a href=\"https://www.qlik.com/us/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Qlik</a></u>® deepened its work with Amazon Web Services (AWS) today with the release of an advanced analytics connector for Amazon SageMaker and integration with Amazon SageMaker Autopilot. These integrations increase the breadth of advanced analytics capabilities already available in <a href=\"https://www.qlik.com/products/qlik-cloud\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Qlik Cloud</a>®, providing seamless integration to Amazon's advanced machine learning capabilities all via Qlik's <a href=\"https://www.qlik.com/us/active-intelligence\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Active Intelligence</a> Platform™.\n          </p>\n                    <p>\n            \"Advanced machine learning capabilities to drive more predictive and prescriptive analytics is an important part of our vision for Active Intelligence, where businesses can seize every business moment. Now users of Amazon SageMaker can take advantage of their offerings directly in our SaaS platform, opening up even more opportunities,\" said James Fisher, Chief Product Officer at Qlik. \"This capability supplements what is available today via Qlik AutoML, and illustrates our ongoing commitment to being a fully open, independent platform for data.\"\n          </p>\n                    <p>\n            The new Amazon SageMaker connector is part of Qlik's Advanced Analytics Integration strategy, offering native, engine-level integrations built directly into Qlik's cloud analytics. It enables direct data exchange between Qlik's Analytics Engine and Amazon SageMaker to deliver a set of predictive data and updated calculations in real time as the user interacts with the data. Additionally, the new integration with SageMaker Autopilot, available through <a href=\"https://www.qlik.com/us/products/application-automation\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Qlik Application Automation</a>™, will enable less technical users to create their own predictive models, expanding the potential of predictive analytics to more analytics users in the organization.\n          </p>\n                    <p>\n            These new integrations further extend Qlik's existing <a href=\"https://www.qlik.com/us/augmented-analytics\" data-type=\"url\" class=\"tr-link\" translate=\"no\">augmented analytics</a> capabilities through <a href=\"https://www.qlik.com/us/products/qlik-sense/ai\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Insight Advisor</a>, which auto-generates advanced analytics and insights, automates creation and data preparation, and supports natural language interaction. Qlik expanded its augmented analytics capabilities recently with Qlik AutoML, a no-code automated ML capability aimed at helping business analysts and analytics teams create models and perform predictive analytics in a complementary fashion to data scientists. Together, users can now leverage the sophisticated models created in Amazon SageMaker to make business decisions, with AutoML alongside to generate additional value where data scientists don't focus.\n          </p>\n                    <p>\n            To learn more about Qlik's data analytics and data integration solutions on AWS, visit <a href=\"https://www.qlik.com/us/products/technology/amazon-web-services\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.qlik.com/us/products/technology/amazon-web-services</a>.\n          </p>\n                    <h4>\n            About Qlik\n          </h4>\n                    <p>\n            Qlik's vision is a data-literate world, where everyone can use data and analytics to improve decision-making and solve their most challenging problems. A private SaaS company, Qlik offers an Active Intelligence platform, delivering end-to-end, real-time data integration and analytics cloud solutions to close the gaps between data, insights and action. By transforming data into Active Intelligence, businesses can drive better decisions, improve revenue and profitability, and optimize customer relationships. Qlik does business in more than 100 countries and serves over 50,000 customers around the world.  \n          </p>\n                    <p>\n            © 2021 QlikTech International AB. All rights reserved. All company and/or product names may be trade names, trademarks and/or registered trademarks of the respective owners with which they are associated.\n          </p>\n                    <p>\n            The information provided herein is subject to change without notice. In addition, the development, release and timing of any product or functionality described herein remain at the sole discretion of Qlik and should not be relied upon in making a purchasing decision, nor as a representation, warranty or commitment to deliver specific products or functionality in the future.\n          </p>\n                  </div>\n                </div>\n                <div>\n                  <a href=\"https://www.qlik.com/us/company/press-room\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Press Room</a>\n                </div>\n              </div>\n              <div id=\"public_attachments\">\n                <p>\n                  <strong>Attachments</strong>\n                </p>\n                <ul class=\"bulleted-list arrowlist\">\n                  <li>\n                    <a href=\"https://www.qlik.com/us/company/press-room/press-releases/qlik-introduces-amazon-sagemaker-integration\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Original document</a>\n                  </li>\n                </ul>\n              </div>\n              <div id=\"public_disclaimer\">\n                <p>\n                  <strong>Disclaimer</strong>\n                </p>\n                <p>\n                  <strong>Qlik Technologies Inc.</strong> published this content on <strong>30 November 2021</strong> and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on <strong>30 November 2021 13:50:04 UTC</strong></p>\n              </div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(C) Copyright 2021 - Qlik Technologies Inc.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Qlik-Technologies-Inc.</p></div>"}