{"date": "2021-12-14 17:41:55.175000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>The LCD Soundsystem Holiday Special With Amazon Music Featuring Eric Wareheim, Macaulay Culkin, Christine Ko, and Aparna Nancherla to Stream on December 22</p>\n</div>\n<div class=\"tr-npp-body\">\n<pre>AMAZON (\"AMZN-Q\")\n- The LCD Soundsystem Holiday Special With Amazon Music--Featuring\n- Eric Wareheim, Macaulay Culkin, Christine Ko, and Aparna\n- Nancherla--to Stream on December 22\n\n    Amazon Music announced The LCD Soundsystem Holiday Special, an\ninnovative virtual event streaming December 22, featuring the band on the\nheels of their sold-out 20-show residency in Brooklyn. Comedian, actor, and\nwriter Eric Wareheim (Tim &amp; Eric) will direct and star in the special,\nwhich also features a star-studded cast including Macaulay Culkin,\nChristine Ko, and Aparna Nancherla portraying the band in a '90s-inspired\nsitcom titled All My Friends. Amazon Music invites fans around the world to\nwatch on the Amazon Music channel on Twitch and Prime Video beginning at 6\np.m. PST/9 p.m. EST on December 22.\n\n     Named for the 2007 LCD anthem, the All My Friends sitcom is set inside\na fictional home shared by all of the members of LCD Soundsystem, with Eric\nWareheim playing the band's fearless leader, James Murphy. The cast also\nincludes actors Christine Ko as Nancy Whang (vocals and keyboards),\nMacaulay Culkin as Pat Mahoney (drums), Tony Cavalero as Nick Millhiser\n(synth), Cory Loykasek as Al Doyle (guitar and synth) Aparna Nancherla as\nAbby Echiverri (synths), Jon Daly as Tyler Pope (bass), Rex Lee as Brian\nGraf (LCD Soundsystem's manager), Luenell as the band's tour manager, and\nEric's puppet as Korey Richey (synth). After the sitcom opens the show, the\nreal LCD Soundsystem will take the stage to perform a career-spanning\nset-capped off with a special rendition of the band's 2015 single,\n\"Christmas Will Break Your Heart,\" performed live for the first time ever.\n\n     \"I've already conquered film, James has conquered music, but we have\nyet to conquer the sitcom--the HIGHEST form of art,\" said Eric Wareheim.\n\"We've been working on this project for 15 years, and for this show we're\nunveiling a uniquely emotional perspective of the sitcom universe for the\nholidays--provided by one of the greatest bands of all time and my dear\nfriends, LCD Soundsystem. I can't believe Amazon Music is letting us do\nthis.\"\n\n     \"I am similarly stunned that someone let us do this,\" said James\nMurphy. \"At least we finally get to use our Korey puppet.\"\n\n     Emerging from New York in the early '00s, LCD Soundsystem released the\nacclaimed albums LCD Soundsystem, Sound of Silver, and This Is Happening,\nbefore playing  a 2011 farewell concert at New York's Madison Square Garden\nimmortalized as the recently reissued The Long Goodbye. The band reunited\nfive years later, and in 2017 released their #1-charting fourth album,\nAmerican Dream, which featured the Best Dance Recording GRAMMY-winning\n\"Tonite.\" American Dream is available to stream here. The LCD Soundsystem\nHoliday Special airs on the Amazon Music channel on Twitch and on Prime\nVideo for all Amazon customers globally on December 22 at 6 p.m. PST/9 p.m.\nEST. The show will also be available only for Prime members to watch\non-demand on Prime Video for a limited time.\n\n     Earlier this month, Amazon Music announced its biggest season of\nholiday programming yet, with a variety of new Amazon Original songs,\nincluding Taylor Swift's reimagined version of her beloved hit \"Christmas\nTree Farm,\" Camila Cabello's cover of \"I'll Be Home for Christmas,\" a fresh\noriginal song from Dan + Shay called \"Pick Out a Christmas Tree,\" Leon\nBridges' reimagined version of Marvin Gaye's \"Purple Snowflakes,\" Sech's\nnew original song, \"Carta Navidena,\" and George Ezra's \"Come on Home for\nChristmas.\" Listeners can find new Amazon Originals and classic hits on the\nglobal playlist, \"Merry Mix.\"\n\n     Prime members who haven't yet tried Amazon Music Unlimited can sign up\nto get four months free for a limited time - with unlimited access to\nmillions of songs in the highest quality streaming audio, ad-free, and\nmillions of podcast episodes. Non-Prime customers can get three months\nfree. Terms apply.\n\n     About Amazon Music Amazon Music reimagines music listening by enabling\ncustomers to unlock millions of songs and thousands of curated playlists\nand stations with their voice. Amazon Music provides unlimited access to\nnew releases and classic hits across iOS and Android mobile devices, PC,\nMac, Echo, and Alexa-enabled devices including Fire TV and more. With\nAmazon Music, Prime members have access to ad-free listening of 2 million\nsongs at no additional cost to their membership. Listeners can also enjoy\nthe premium subscription service, Amazon Music Unlimited, which provides\naccess to millions of songs and the latest new releases. Amazon Music\nUnlimited customers also now have access to the highest-quality listening\nexperience available, with millions of songs available in High Definition\n(HD), more than 7 million songs in Ultra HD, and a growing catalog of\nspatial audio. Customers also have free access to an ad-supported selection\nof top playlists and stations on Amazon Music. All Amazon Music tiers now\noffer a wide selection of podcasts at no additional cost, and live\nstreaming in partnership with Twitch. Engaging with music and culture has\nnever been more natural, simple, and fun. For more information, visit\namazonmusic.com or download the Amazon Music app.\n\n     About AmazonAmazon is guided by four principles: customer obsession\nrather than competitor focus, passion for invention, commitment to\noperational excellence, and long-term thinking. Amazon strives to be\nEarth's Most Customer-Centric Company, Earth's Best Employer, and Earth's\nSafest Place to Work. Customer reviews, 1-Click shopping, personalized\nrecommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct\nPublishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo,\nAlexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are\nsome of the things pioneered by Amazon. For more information, visit\namazon.com/about and follow @AmazonNews.\n\n     Watch the All My Friends sitcom opening credits sequence HERE (Credit:\nAmazon Music)Watch The LCD Soundsystem Holiday Special event trailer HERE\n(Credit: Amazon Music)Download stills and artwork HERE (Credit: Amazon\nMusic)\n\n Contact Information:\n\nFor further information: [email protected]\n Related Links\n <a href=\"http://www.amazon.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.amazon.com</a>\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134700489.MNPRE2134702506-09175120211214</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}