{"date": "2021-11-13 00:03:11.461000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3472.5, "close": 3545.68}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>A group of Amazon warehouse workers in Staten Island withdrew their petition to hold a unionization vote Friday after the National Labor Relations Board told the union it did not have enough support to call the election.</p><p>The Amazon Labor Union, an independent organization established to represent workers at the facility, pulled the petition after hearing from the agency that the number of signed cards from workers authorizing the union to negotiate on their behalf didn't meet its threshold, union leader Chris Smalls said. The agency \"blindsided\" him with the news.</p></div><div class=\"tr-npp-body\"><p>\"We thought we were good,\" Smalls said.</p><p>The NLRB typically requires authorization cards signed by at least 30 percent of the proposed negotiating unit.</p><p>When Smalls filed the petition to hold the vote last month, he said more than 2,000 workers signed authorization cards. Smalls said he has received hundreds of cards since the filing. Last week, Amazon filed documents with the agency saying it had submitted a payroll list of 9,660 workers at the Staten Island facility.</p><p>Smalls said he expects the union will refile its petition to hold the vote soon.</p><p>Amazon spokeswoman Kelly Nantel said the company learned that the petition was withdrawn Friday.</p><p>\"Our focus remains on listening directly to our employees and continuously improving on their behalf,\" Nantel said in a emailed statement.</p><p>(Amazon founder Jeff Bezos owns The Washington Post.)</p><p>NLRB spokeswoman Kayla Blado said the union could refile a petition to hold an election at a later date. She declined to say whether the agency contacted the union about the deficiency in the number of signed authorization cards.</p><p>Earlier this week, Smalls told The Post that he had added enough signed authorization cards to still qualify for a vote, given Amazon's workforce claims.</p><p>The NLRB had scheduled a hearing for Nov. 22, during which it would have heard from the union and Amazon regarding whether the union had collected enough valid cards to call a vote.</p><p>The withdrawn petition is the latest setback for unionization at Amazon. The company fended off a high-profile organizing drive by the Retail, Wholesale and Department Store Union in April when workers at a Bessemer, Ala., warehouse overwhelmingly rejected unionization by a more than 2-to-1 margin. In August, an NLRB hearing officer recommended that the results be scrapped and a new election be held, after determining that the company improperly pressured workers to oppose unionization. The agency has yet to rule on those recommendations.</p><p>Smalls created his own independent union to take on Amazon. He said the Amazon Labor Union had a better chance of success because it was not relying on a large trade labor group to make its case to warehouse workers.</p><p>Smalls had worked at Amazon as a process assistant, a management job overseeing operations of workers picking items to be shipped to customers. He first gained notoriety at the start of the coronavirus pandemic, when he raised safety concerns at the Staten Island warehouse and led a handful of workers to walk out in March 2020. Smalls pressed Amazon to temporarily close warehouses for cleaning where workers tested positive for the coronavirus, among other demands.</p><p>Amazon fired Smalls later that day, claiming he violated quarantine, since he had been in contact with a co-worker who tested positive. Smalls said the company hadn't warned him about not showing up to work.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 The Washington Post</p></div>"}