{"date": "2021-11-04 11:17:48.428000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3312.75, "close": 3477.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>RNS Number : 3712RProvexis PLC04 November 2021</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>\n<span>Prior to publication, the information contained within this announcement was deemed by the Company to constitute inside information as stipulated under the UK Market Abuse Regulation. With the publication of this announcement, this information is now considered to be in the public domain.</span>\n</p>\n<p>4 November 2021</p>\n<p>\n<span>Provexis plc</span>\n</p>\n<p>\n<span>('Provexis' or the 'Company')</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>Agreement between Provexis and By-Health for supply of Fruitflow and support in R&amp;D</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Provexis, the business that develops, licenses and sells the proprietary, scientifically-proven Fruitflow® heart-health functional food ingredient, is pleased to announce that it has entered into a long term strategic co-operation framework agreement (the 'Agreement') for Fruitflow with By-Health Co., Ltd. ('By-Health'),</span> a listed Chinese dietary supplement business with a market capitalisation of approximately £5 billion.</p>\n<p>The Agreement, which will take full effect from 1 January 2023, gives By-Health exclusive supply and distribution rights to commercialise the Company's lead Fruitflow heart-health technology in Mainland China, Hong Kong, Macau, Taiwan and Australia (the 'Territories').</p>\n<p>Under the Agreement:</p>\n<p>\n<span>·</span> Provexis will be responsible for the manufacture, supply and sale of its Fruitflow heart-health functional food ingredient to By-Health, and it will contribute scientific expertise necessary for successful commercialisation.</p>\n<p>\n<span>·</span> By-Health will be responsible for the manufacture, marketing, and sale of Fruitflow based functional food and dietary supplement finished products in the Territories, through By-Health's extensive sales network. Dietary supplement products such as Fruitflow are required to be authorised by the relevant Government authorities in each of the Territories in respect of health claims.</p>\n<p>\n<span>·</span> By-Health will also have exclusive rights to act as the distributor of Fruitflow as an ingredient in the Territories, selling Fruitflow as an ingredient to other businesses in the Territories which wish to use Fruitflow to manufacture and sell their own Fruitflow based finished products in the Territories.</p>\n<p>\n<span>·</span> Provexis and By-Health will seek to collaborate on research and development projects which may result in the development and approval of Fruitflow as a drug, for potential sale and distribution in the Territories.</p>\n<p>\n<span>·</span> The Agreement commences immediately and has a term of ten years, subject to extension and termination clauses.</p>\n<p>Regulatory progress in China - new permitted health function claim</p>\n<p>The Company has previously announced that it has been working with By-Health to support the planned launch of a number of Fruitflow based products in the Chinese market, with potential volumes at a significant multiple of current Fruitflow sales.</p>\n<p>The planned launch of Fruitflow based products in the Chinese market has been progressing well. Clinical studies conducted in China are typically required to obtain the necessary regulatory clearances in China, and a significant investment in eight separate Fruitflow studies has been undertaken at By-Health's expense.</p>\n<p>Five studies have been successfully completed in China, and two clinical studies and one animal study are currently ongoing.</p>\n<p>The five completed studies showed excellent results in use for Fruitflow, and they provide strong evidence for its efficacy on platelet functions. The Chinese regulatory system for functional health food ingredients such as Fruitflow is governed by the State Administration for Market Regulation (SAMR), China's top market regulator, and it is based on a defined list of 27 permitted health function claims which brand owners are permitted to use on product labels.</p>\n<p>Health function claims are based on test methods and criteria that have been systematically evaluated and verified, and it is currently envisaged that the existing list of 27 permitted health function claims might be reduced to a revised list of 24 permitted claims. The SAMR provides the possibility of adding new health function claims to the list, as long as the claim can be evaluated and verified by the SAMR.</p>\n<p>Under SAMR regulations functional health foods need to indicate a relationship between a food or nutrient and a consequent health improvement which falls under one of the permitted health function claims. This relationship must be supported by scientific tests which are performed by the SAMR.</p>\n<p>SAMR certified functional health foods are required to use a blue cap / blue hat logo on their product packaging, which identifies products as approved functional health foods.</p>\n<p>By-Health's regulatory clearance preparations for Fruitflow were originally focussed on obtaining blue cap health claim status for some Fruitflow based products in China, under the existing 27 permitted health function claim structure.</p>\n<p>By-Health is now working on an extensive regulatory submission to the SAMR for Fruitflow, seeking to establish a new permitted health function claim for foods such as Fruitflow that can demonstrate an anti-platelet effect, inhibiting platelet function and conferring beneficial effects for people who are at risk of platelet hyperactivity-associated thrombosis - the aberrant blood clots which lead to heart attacks and strokes.</p>\n<p>By-Health has recently updated its website <a href=\"http://www.by-health.com/en/aboutus\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.by-health.com/en/aboutus</a> stating that it has completed: 'Research comprehensively in the cardiovascular health area. We have developed a new product made with Fruitflow®, popularly known as 'natural Aspirin'. It helps to maintain normal platelet aggregation.'</p>\n<p>By-Health currently expects to be in a position to complete the last of its eight studies in 2022, and it will file its regulatory submission to the SAMR for Fruitflow at the appropriate time seeking to obtain a new permitted health function claim which would be in addition to the currently defined list of 27 (reducing to 24) permitted claims. Subject to the timing the new anti-platelet claim, if approved, would therefore represent the 28 <span>th</span> - or the 25 <span>th</span> - permitted health function claim in China.</p>\n<p>If By-Health is successful in obtaining a new permitted health function claim for functional health foods such as Fruitflow that can demonstrate an anti-platelet effect, it is currently expected that this would result in some significant orders for Fruitflow, potentially at a multiple of current total sales values.</p>\n<p>DSM Nutritional Products</p>\n<p>The Company's Alliance Agreement with DSM Nutritional Products ('DSM') dates back to June 2010, with a contractual term which runs to 31 December 2022.</p>\n<p>By default from 1 January 2023 the agreement: (i) permits DSM to continue to sell Fruitflow to its existing customers, on the basis that a royalty on Fruitflow sales, fixed at favourable market conditions, will remain payable to the Company; and (ii) permits the Company to sell Fruitflow as an ingredient directly to third parties, outside the existing profit sharing arrangements.</p>\n<p>The Agreement for Fruitflow announced today between the Company and By-Health falls under (ii) above, with the Company set to sell Fruitflow as an ingredient directly to By-Health from 1 January 2023; 100% of the Company's sales of Fruitflow to By-Health will accrue directly to the Company, and the Company will retain all of the resulting profits.</p>\n<p>The Company and DSM have started and are currently engaged in constructive negotiations working towards a new agreement. The commercial terms of the negotiations remain confidential between the two parties, and the Company will provide shareholders with a further update in due course.</p>\n<p>Supply chain</p>\n<p>Fruitflow is currently produced by outsourced third party manufacturers in Europe, and it is intended that the Company will have direct access to these manufacturers for its sales of Fruitflow to third parties. The Company and the third party manufacturers are actively engaged in some ongoing production capacity planning, looking at the steps required to scale-up the production of Fruitflow to meet the anticipated increase in demand.</p>\n<p>Market opportunity</p>\n<p>A study backed by scientists from the National Center for Cardiovascular Diseases in China which was updated in 2020 ( <a href=\"http://www.ncbi.nlm.nih.gov/pmc/articles/PMC7008101/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.ncbi.nlm.nih.gov/pmc/articles/PMC7008101/#</a> ) stated that:</p>\n<p>\n<span>·</span> the prevalence of Cardiovascular Disease ('CVD') in China has been increasing continuously since 2006, with approximately 290 million patients in China who now have CVD; and</p>\n<p>\n<span>·</span> two in five deaths in China are attributed to CVD, with CVD remaining the leading cause of death in 2016.</p>\n<p>In December 2020 the World Health Organisation reported ( <a href=\"http://www.who.int/news/item/09-12-2020-who-reveals-leading-causes-of-death-and-disability-worldwide-2000-2019\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.who.int/news/item/09-12-2020-who-reveals-leading-causes-of-death-and-disability-worldwide-2000-2019</a> ): 'Heart disease has remained the leading cause of death at the global level for the last 20 years. However, it is now killing more people than ever before. The number of deaths from heart disease increased by more than 2 million since 2000, to nearly 9 million in 2019. Heart disease now represents 16% of total deaths from all causes. More than half of the 2 million additional deaths were in the WHO Western Pacific region.' The WHO Western Pacific region includes China.</p>\n<p>By-Health's long-term goal of science-based nutrition is to achieve 'comprehensive intervention for human health' ( <a href=\"http://www.by-health.com/en/aboutus\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.by-health.com/en/aboutus</a> ), and Fruitflow is well placed to provide such intervention in the Chinese cardiovascular health market.</p>\n<p>Ian Ford, CEO of Provexis, commented:</p>\n<p>'We are delighted to announce this supply and distribution agreement for Fruitflow with By-Health, which follows our extensive work together over the last five years. The collaborative approach facilitated by this agreement will allow both Provexis and By-Health to continue to contribute their expertise in the most effective way.</p>\n<p>By-Health currently expects to be in a position to complete the last of its eight studies in 2022, and it will file its regulatory submission to the SAMR for Fruitflow at the appropriate time, seeking to obtain a new permitted health function claim for foods such as Fruitflow that can demonstrate an anti-platelet effect. If By-Health is successful in obtaining a new permitted health function claim, it is currently expected that this would result in some significant orders for Fruitflow, potentially at a multiple of current total sales values.</p>\n<p>Fruitflow is well placed to play an important role in the Chinese cardiovascular health market under the permitted health function claim legislation, and we look forward to working closely with By-Health seeking to maximise the commercial success of this agreement for the benefit of both companies.'</p>\n<p>\n<span>\n</span></p>\n<p>Felix Zhang, MSc PhD, Group Director, Science and Technology Centre; Director, Nutrition and Health Research Institute at By-Health Co., Ltd; Director, R&amp;D Life Space Australia, commented:</p>\n<p>'We are delighted to have entered into this supply and distribution agreement for Fruitflow, following our strong collaboration with Provexis and extensive clinical study and other scientific work with Fruitflow over the last five years.</p>\n<p>By-Health is recognised as the leader of China's Vitamin &amp; Dietary Supplements industry, and the strong science behind Fruitflow fits very well with our 'science-based nutrition' strategy, which focusses on strong science-backed evidence to support health claims which are of benefit to consumers. We look forward to progressing our work with Fruitflow, in partnership with Provexis, towards future significant commercialisation in China and Australia.'</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>For further information please contact:</span>\n</p>\n<p>\n<span>\n</span></p>\n<div class=\"story-table-container\"><table class=\"story-basic-table\">\n<tbody>\n<tr>\n<td>\n<p>\n<span>Provexis plc</span>\n</p>\n<p>\n<span>Ian Ford, CEO</span>\n</p>\n<p>\n<span>Dawson Buck, Chairman</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>Tel: 07490 391888</span>\n</p>\n<p>\n<span>enquiries@provexis.com</span>\n</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>\n<span>Allenby Capital Limited</span>\n</p>\n<p>\n<span>Nick Naylor / Liz Kirchner</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n<td>\n<p>\n<span>Tel: 020 3328 5656</span>\n</p>\n<p>\n<span>\n</span></p>\n</td>\n</tr>\n</tbody>\n</table></div>\n<p>\n<span>\n</span></p>\n<p>\n<span>\n</span></p>\n<p>\n<span>Notes for editors</span>\n</p>\n<p>\n<span>\n</span></p>\n<p>\n<span>About Provexis plc</span>\n</p>\n<p>AIM-listed Provexis is focused on the development, licensing and sales of its proprietary, scientifically-proven Fruitflow® heart-health functional food ingredient.</p>\n<p>Fruitflow is a natural, breakthrough ingredient that helps with platelet aggregation. This helps promote normal blood flow and circulation, which in turn benefits cardiovascular health. Fruitflow helps the platelets to circulate freely and smoothly throughout your blood, without sticking to one another or to the blood vessels themselves. Freely flowing blood helps reduce stress on your cardiovascular system.</p>\n<p>Fruitflow is a highly concentrated form of bioactives which is lycopene-free and contains over 30 known anti-platelet compounds. Published clinical studies have shown that Fruitflow works to maintain healthy blood flow in a similar way to 75mg aspirin but with a milder and reversible action; Fruitflow has a similar antiplatelet effect to a single dose of aspirin - but when taken daily, it has none of aspirin's side effects.</p>\n<p>The science behind Fruitflow has been validated by leading peer review publications and regulatory authorities. Fruitflow is the only natural antiplatelet to have a health claim approved by the European Food Safety Authority, stating that 150mg of Fruitflow 'helps maintain normal platelet aggregation, which contributes to healthy blood flow'.</p>\n<p>Provexis plc entered into a long-term Alliance Agreement with DSM Nutritional Products in 2010 to commercialise Fruitflow through sales as an ingredient to brand owners in the food, beverage and dietary supplement categories. More than 90 regional consumer healthcare brands have now been launched by direct customers of DSM, and a number of further regional brands have been launched through DSM's distributor channels.</p>\n<p>Fruitflow has a number of other specific health benefits which have been reflected in separate patent filings for the use of Fruitflow in:</p>\n<p>\n<span>·</span> mitigating exercise-induced inflammation;</p>\n<p>\n<span>·</span> managing blood pressure; and</p>\n<p>\n<span>·</span> protecting against the adverse effects of air pollution on the body's cardiovascular system. Laboratory work has shown that Fruitflow can reduce the platelet activation caused by airborne particulate matter, such as that from diesel emissions, by approximately one third.</p>\n<p>Provexis sells a high quality dietary supplement product containing Fruitflow and Omega-3 from its separate website <span>\n<a href=\"http://www.fruitflowplus.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.fruitflowplus.com</a>\n</span> on a mail order basis. The product is also available to purchase from Amazon.co.uk and from Holland &amp; Barrett.</p>\n<p>COVID-19</p>\n<p>The Company and DSM have experienced increased consumer interest for Fruitflow in recent months, in light of the COVID-19 pandemic, as consumers look to nutritional interventions to help them fortify the circulatory system against the effects of COVID-19. The Company and DSM will look to maximise the commercial opportunities arising from this increased consumer interest in Fruitflow, and will further promote the core blood circulatory and anti-inflammatory benefits of the product.</p>\n<p>In September 2020 Fruitflow was recognised in a review article by the Frontiers in Nutrition journal <span>\n<a href=\"http://www.frontiersin.org/articles/10.3389/fnut.2020.583080/full\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.frontiersin.org/articles/10.3389/fnut.2020.583080/full</a>\n</span> which stated that nutraceuticals such as Fruitflow may serve as:</p>\n<p>'A safe antiplatelet prophylactic treatment for those at high risk of COVID-19 who may also be at increased risk of thrombotic complications and an alternative to pharmacological compounds that may cause greater risk of bleeding.'</p>\n<p>Provexis was founded in 1999 and is headquartered in Reading, Berkshire.</p>\n<p>Provexis shares are traded on the AIM market of the London Stock Exchange under the ticker symbol PXS.</p>\n<p>For further information, please visit <span>\n<a href=\"http://www.provexis.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.provexis.com</a>\n</span>\n<span> and <span>\n<a href=\"http://www.fruitflowplus.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.fruitflowplus.com</a>\n</span> .</span></p>\n<p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" data-type=\"email\" translate=\"no\">rns@lseg.com</a> or visit <a href=\"http://www.rns.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.rns.com</a> .RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our <a href=\"https://www.lseg.com/privacy-and-cookie-policy\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Privacy Policy</a> .END</p>\n<p>MSCBIBBTMTMMBJB</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}