{"date": "2021-12-17 14:46:50+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3466.3, "close": 3400.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Steve Stecklow and Jeffrey Dastin</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">LONDON, Dec 17 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon.com Inc was marketing a collection of President Xi Jinping's speeches and writings on its Chinese website about two years ago, when Beijing delivered an edict, according to two people familiar with the incident. The American e-commerce giant must stop allowing any customer ratings and reviews in China.</p><p>A negative review of Xi's book prompted the demand, one of the people said. \"I think the issue was anything under five stars,\" the highest rating in Amazon's five-point system, said the other person.</p><p>Ratings and reviews are a crucial part of Amazon's e-commerce business, a major way of engaging shoppers. But Amazon complied, the two people said. Currently, on its Chinese site Amazon.cn, the government-published book has no customer reviews or any ratings. And the comments section is disabled.</p><p>Amazon's compliance with the Chinese government edict, which has not been reported before, is part of a deeper, decade-long effort by the company to win favor in Beijing to protect and grow its business in one of the world's largest marketplaces.</p><p>An internal 2018 Amazon briefing document that describes the company's China business lays out a number of \"Core Issues\" the Seattle-based giant has faced in the country. Among them: \"Ideological control and propaganda is the core of the toolkit for the communist party to achieve and maintain its success,\" the document notes. \"We are not making judgement on whether it is right or wrong.\"</p><p>That briefing document, and interviews with more than two dozen people who have been involved in Amazon's China operation, reveal how the company has survived and thrived in China by helping to further the ruling Communist Party's global economic and political agenda, while at times pushing back on some government demands.</p><p>In a core element of this strategy, the internal document and interviews show, Amazon partnered with an arm of China's propaganda apparatus to create a selling <a href=\"https://www.amazon.com/chinabookscibtc\" data-type=\"url\" class=\"tr-link\" translate=\"no\">portal</a> on the company's U.S. site, Amazon.com – a project that came to be known as China Books. The venture – which eventually offered more than 90,000 publications for sale – hasn't generated significant revenue. But the document shows that it was seen by Amazon as crucial to winning support in China as the company grew its Kindle electronic-book device, cloud-computing and e-commerce businesses.</p><p>The 2018 briefing document spells out the strategic stakes of the China Books project for Jay Carney, the global head of Amazon's lobbying and public-policy operations, ahead of a trip he took to Beijing. \"Kindle has been operating in China in a policy grey area,\" the document stated, and noted that Amazon was having difficulty obtaining a license to sell e-books in the country.</p><p>\"The key element to safeguard\" against its license problem with the Chinese government \"is the Chinabooks project,\" the document stated.</p><p>The document also noted: \"Amazon.com/China books project has also gained wide recognition among Chinese regulators.\"</p><p><br/></p><p>LIFE IN XINJIANG</p><p>The books include many apolitical titles, such as Chinese language textbooks, cookbooks and children's bedtime stories. But they also include titles that amplify the Communist Party's official line.</p><p>One book extols life in Xinjiang, where United Nations experts have said China interned one million ethnic Uyghurs in a network of camps. The book – \"Incredible Xinjiang: Stories of Passion and Heritage\" – discusses an online comedy show situated in the region. The book quotes an actor who plays a Uyghur \"country bumpkin\" saying that ethnicity is \"not a problem\" there. That echoes the position of Beijing, which has denied mistreating minority groups.</p><p>Some books portray China's battle against the COVID-19 pandemic, which began in the Chinese city of Wuhan, in heroic terms. One is titled \"Stories of Courage and Determination: Wuhan in Coronavirus Lockdown.\" Another begins with commentary from Xi: \"Our success to date has once again demonstrated the strengths of CPC (the Communist Party of China) leadership and Chinese socialism.\"</p><p>The state-owned firm that partners with Amazon on China books, China International Book Trading Corp, or CIBTC, told Reuters that the venture is a \"commercial relationship between two enterprises.\" China's National Press and Publication Administration, or NPPA, the state propaganda arm with which Amazon has had a partnership, had no comment.</p><p>In response to questions, Amazon said it \"complies with all applicable laws and regulations, wherever we operate, and China is no exception.\" It added that \"as a bookseller, we believe that providing access to the written word and diverse perspectives is important. That includes books that some may find objectionable.\"</p><p>Amazon said it has \"a wide selection of books\" on China, and the China Books portal \"is an additional channel for serving our Chinese readers in the United States and elsewhere.\" CIBTC is \"just one of the millions of selling partners around the world offering products in our stores.\"</p><p>The new details about Amazon's China strategy demonstrate the challenges Western companies face in accessing the world's most populous market – and in coping with an authoritarian regime that has been tightening control over public discourse.</p><p>The company's compromises with Beijing contrast with its efforts to get around regulators in the world's two largest democracies. In India, Reuters this year has documented <a href=\"https://www.reuters.com/investigates/special-report/amazon-india-operation\" data-type=\"url\" class=\"tr-link\" translate=\"no\">how Amazon circumvented local regulations</a> and, to promote its own brands, <a href=\"https://www.reuters.com/investigates/special-report/amazon-india-rigging\" data-type=\"url\" class=\"tr-link\" translate=\"no\">rigged search results on its Indian website</a>. In the United States, Reuters detailed how Amazon <a href=\"https://www.reuters.com/investigates/special-report/amazon-privacy-lobbying\" data-type=\"url\" class=\"tr-link\" translate=\"no\">gutted or killed state privacy bills</a> designed to protect consumers.</p><p>Amazon said it has always complied with the law in India and doesn't favor its private-label products in search results. Regarding the United States, the company said it prefers U.S. federal privacy legislation, and that it protects consumers' privacy and doesn't sell their data.</p><p>Some companies have responded to Beijing's demands by leaving the market. Yahoo recently exited China and Microsoft Corp's LinkedIn announced it would pull out some of its services. Both cited the country's difficult business environment and regulatory requirements.</p><p>Amazon, by contrast, has grown into a powerful economic force in China in recent years, providing lucrative export opportunities to thousands of Chinese businesses while growing its own industry-leading cloud-services unit. Amazon Web Services, or AWS, is now one of the largest providers to Chinese companies globally, according to a report this year by analysis firm iResearch in China, and people who have worked for AWS.</p><p>Still, by 2018, Amazon was receiving an \"increasing number of requests from (Chinese) watchdogs to take down certain content, mostly politically sensitive ones,\" stated the briefing document prepared that year for Carney. He previously served as communications director for U.S. President Joe Biden, when Biden was vice president, and as press secretary for President Barack Obama.</p><p>Amazon declined to make Carney available for an interview.</p><p>According to the briefing document, the Cyberspace Administration of China, or CAC, asked Amazon in 2018 to take down a \"link to China's new blockbuster film Amazing China because of especially harsh user reviews.\" The CAC is responsible for online security and content regulation.</p><p>\"Amazing China\" praises the country's accomplishments since Xi became president in 2013. CAC wanted the link removed from IMDb, an Amazon-owned website of movie information and reviews.</p><p>Amazon's China office responded to CAC that \"it is difficult for Amazon China to accommodate such requests, and we'll relay the message to\" Amazon headquarters \"and seek their views about possibilities,\" the briefing document stated.</p><p>The film remains on IMDb's U.S. website. Shortly after the request, some negative reviews disappeared, archived screenshots of IMDb.com on archive.org show. Others remain, and \"Amazing China\" currently has an overall rating of just 2.3 out of a top score of 10. Some reviews call it \"pathetic,\" \"garbage\" or \"government propaganda.\"</p><p>\"Some reviews submitted for the title 'Amazing China' were removed because they violated our user review content guidelines, with the majority being off topic,\" Amazon told Reuters. \"IMDb is not aware of any request from external parties (including the Chinese government) to do anything about reviews for this title.\"</p><p>CAC didn't respond to a request for comment.</p><p><br/></p><p>'WINK AND A NOD'</p><p>Amazon entered China in 2004 through a $75 million deal to acquire Joyo.com, an online book-and-media seller. Eventually, Amazon wanted to introduce e-books and its popular Kindle reading devices to the Chinese market.</p><p>To accomplish that, it worked with the General Administration of Press and Publication, or GAPP, a regulator that engages in state censorship in its role as overseer of publications in China. NPPA now handles most of GAPP's responsibilities. NPPA, in turn, is overseen by the Communist Party's Publicity Department, which was previously known as the Propaganda Department.</p><p>According to a former Amazon executive involved in talks with China, the company secured some, but not all, of the government approvals it needed to sell Kindle devices and e-books. That situation gave the government leverage over the retailer, the former executive said. Amazon's public-policy team came up with the China Books project as a novel way \"to get what we wanted on Kindle and other things,\" the person said. \"It was a wink and a nod.\"</p><p>Amazon soon began working with GAPP to set up China Books, according to the briefing document. The company planned to tout the portal to Chinese authorities as Amazon's only store named after a country, the document said. Amazon dedicated several employees to the effort, which involved CIBTC, the government book-trading company, which the document described as \"the executing body from GAPP.\"</p><p>A photograph on CIBTC's website shows Chinese officials toasting the launch of the project at a hotel in Beijing in September 2011.</p><p>In October 2012, China Books was awarded the title, \"a key national culture export\" project, by a group of Chinese government bodies, including GAPP, as well as the entity now known as the Publicity Department of the Communist Party of China. Two months later, Amazon launched its electronic-books business in China and soon began selling Kindles.</p><p>By the end of 2017, China had become Kindle's largest global market, \"accounting for 40%+ of our world device sales volume,\" according to the 2018 briefing document. By then, Amazon had added a Chinese e-book store to its American website and had translated 19 books.</p><p>And Carney, the top public-policy executive who then reported to Amazon founder Jeff Bezos, went to China in April 2018. There, he told an alternate member of the Communist Party central committee that Amazon would make \"every effort\" to promote China Books and make it \"bigger and stronger,\" according to a CIBTC press release.</p><p>The briefing document prepared for Carney stated: \"Both China Books and Kindle Chinese eBook Store are Amazon China's main commitment to assist China in 'Going Abroad,' an umbrella project that aims to promote Chinese culture to the world.\"</p><p>Amazon's China Books webpage prominently displays CIBTC's name, but doesn't disclose that it's a project that Amazon created in a partnership with a Chinese government agency.</p><p>\"Details about the company are readily available online,\" Amazon told Reuters, \"and CIBTC has placed its name and logo prominently throughout its page. Our relationship with CIBTC is entirely appropriate.\"</p><p>Eventually, the China Books project flopped financially, according to a person who has been involved in it. Few of the portal's titles have sold well, and Amazon even shipped back books because its warehouses lacked space for them.</p><p>Nonetheless, the China Books project continues. The Chinese-language version of \"Xi Jinping: The Governance of China Volume Three\" – is listed first on China Books' \"BEST SELLER\" page. It recently showed a sales rank of 1,347,071. Another \"best seller,\" about COVID-19, was ranked 10,654,483. The Xinjiang title, which Reuters purchased, had been ranked 13,441,455.</p><p>But sales weren't the goal, according to the person who has been involved in the project. \"It's a high-level photo-op,\" part of a \"soft-power campaign to basically put the books out there and just have it be visible.\"</p><p>In its statement to Reuters, CIBTC, the government book-trading company, said it doesn't \"rank books sold through Amazon.\" It didn't elaborate.</p><p><br/></p><p>A THREAT TO 'RETALIATE'</p><p>Amazon continued its Chinese expansion in 2013, announcing the introduction in Beijing of Amazon Web Services, its cloud-computing business. At the time, no Chinese law regulated cloud services, the 2018 briefing document noted.</p><p>In 2016, China began taking actions that made it more difficult for foreign cloud-computing firms, such as AWS, to operate in the country.</p><p>The government began requiring cloud providers to hold a new license that only Chinese-owned companies could obtain, according to the briefing document. \"Regulators have since become very hostile\" toward AWS, the 2018 document stated.</p><p>The result was that Amazon took an unusual step for the company: It handed off its cloud technology to local companies so it could keep operating in China. The Chinese companies – not Amazon – were responsible for \"monitoring and taking down illegal content, collecting and reporting basic information of customers … and working with PRC (the People's Republic of China) authorities on all compliance-related inquiries that may arise,\" the 2018 document stated.</p><p>In its statement to Reuters, Amazon said that AWS, as a foreign cloud provider, has to license or sell technology to local partners in China in order to have a presence there.</p><p>That structure didn't shield AWS from Chinese pressure, however.</p><p>In February 2018, China's Ministry of Public Security, or MPS, called AWS to a meeting, the briefing document stated. MPS threatened to \"retaliate\" against Amazon unless it removed content and blocked a website it hosted in the United States for Guo Wengui, a Chinese dissident. AWS refused, the document said. But the company asked Guo to take an action that exposed the dissident's Internet Protocol, or IP address, and AWS \"provided to MPS\" this data, the document stated. An IP address is a unique code that identifies a computer accessing the internet.</p><p>The ministry \"recognized our effort to find a solution, though not ... to their satisfactory level,\" the document stated.</p><p>The 2018 briefing document advised Carney to raise the government's request on Guo when meeting a top Ministry of Commerce official in Beijing, and stress that China shouldn't make requests that involve data stored abroad.</p><p>Asked about the Guo incident, Amazon confirmed it received the Chinese government's request, but said it \"did not provide any non-public information or any other customer information.\"</p><p>The commerce ministry said Guo wasn't discussed at the meeting with Carney. Amazon didn't say whether Guo came up.</p><p>An employee for MPS said the ministry doesn't respond to requests for comment. An attorney for Guo said Guo had no comment.</p><p>AWS's China business continues to grow. Despite being blocked from selling cloud services to the government and some state-owned enterprises, AWS has landed key customers in China, say people familiar with the matter.</p><p>Among them are two Chinese companies, Tiktok developer ByteDance and video-surveillance firm Hikvision, as well as multinationals Nike, Samsung and Philips, according to the 2018 briefing document and a 2019 blog on AWS's website. Philips declined to comment; the other four companies didn't respond to requests for comment.</p><p>In June, AWS announced it was expanding further in the country, \"to support the demands of our growing customer base in China.\"</p><p><br/></p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Steve Stecklow in London and Jeffrey Dastin in San Francisco. Additional reporting by the Reuters Shanghai newsroom. Editing by Peter Hirschberg.)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:steve.stecklow@thomsonreuters.com\" data-type=\"email\" translate=\"no\">steve.stecklow@thomsonreuters.com</a> ; <a href=\"mailto:jeffrey.dastin@thomsonreuters.com\" data-type=\"email\" translate=\"no\">jeffrey.dastin@thomsonreuters.com</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AMAZON-CHINA/BUSINESS (SPECIAL REPORT, PIX)</p></div>"}