{"date": "2022-01-13 18:49:00.171000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3304.14, "close": 3242.76}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwlistdisc{list-style-type:disc;}</style><p class=\"bwalignc\">\n<b>Eat Well Group Engages Leading Digital Merchandising Agency Avenue7Media to Drive Amazon Sales of Portfolio Products</b>\n</p><p class=\"bwalignc\">\n<b><span>Not for Distribution to U.S. Newswire Services or for Release, Publication, Distribution or Dissemination Directly or Indirectly, in Whole or in Part, in or Into the United States</span></b>\n</p><p class=\"bwalignc\">\n<span>Eat Well Group announces partnership with leading Amazon digital merchandising agency to focus on Amazon.com specific growth across its portfolio brands and products</span>\n</p><p>\nEat Well Investment Group Inc. <b>(</b>the<b> “Company” </b>or<b> “Eat Well Group</b>” or<b> “EWG”) (CN:EWG) (US:EWGFF) (FRA:6BC0)</b> is pleased to announce the engagement of Avenue7Media (“Ave7”) as its lead Amazon digital merchandising agency, focused on the growth of Eat Well’s portfolio investments, brands and consumer products, through Amazon.com.\n</p><p>\nAccording to the “Amazon Advertising Report,” <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fchainstoreage.com%2Fstudy-most-product-searches-begin-amazon&amp;esheet=52562755&amp;newsitemid=20220113005806&amp;lan=en-US&amp;anchor=74%25&amp;index=1&amp;md5=0f55f488d7578250bc4b3fbf2c13b3e5\" data-type=\"url\" class=\"tr-link\" translate=\"no\">74%</a> of U.S. consumers start searching for a product on Amazon, with 56% claiming that, if only able to buy from one store, they would choose Amazon.<sup>1</sup> Today the eCommerce giant drives approximately $30 billion USD in online grocery sales<sup>2</sup> and remains an integral component of Eat Well Group and its portfolio investments omni-channel distribution strategy.\n</p><p>\nWith its winning products that include Sapientia Technologies’ “plant-based cheeto” and Amara Organic Baby Foods shelf-stable products, eCommerce is an efficient and powerful distribution channel. Ave7 has been engaged to develop the online snacking platform for Eat Well Group’s portfolio products, with delivery in Spring 2022, as snacks continue to grow 3-5x the offline sales rates according to internal data analytics through Ave7’s proprietary technology stack.\n</p><p>\n“We are very enthusiastic about the growth potential for the Eat Well Group’s investment portfolio of snacks online, for the long-term,” said Jason Boyce, Founder and CEO of Avenue7Media, a Los Angeles-based firm, who has successfully started and sold two prior Amazon platforms of his own, before creating this next-generation digital merchandising company to help brands in hypergrowth. “With the snacks market being a multi-billion-dollar sector, plant-based good-for-you snacks can become dominant online.”\n</p><p>\n“The team at Avenue7Media are operators with a digital merchandising mindset,” stated Marc Aneed, CEO and Director of Eat Well Group. “We chose to partner with them because they understand Amazon from the technology, shopping behavior, financial, and logistics angles simultaneously. We can’t wait to drive significant growth for years to come,” continued Aneed.\n</p><p>\nAdditionally, the Company is pleased to announce that it will expand its North American and European digital and market awareness campaigns on behalf of its portfolio companies, including press initiatives, advertising, and social media. These marketing and awareness programs include both existing engagements with arm's-length parties and new engagements for an aggregate gross expenditure of $997,000. The Company has engaged the following service providers to support growth of its portfolio investments:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\nPRmediaNow, Inc. (“<b>PRmedia</b>”) to provide media-outreach services to the Company for a term of 6 months beginning on January 5, 2022 and ending on July 5, 2022, for total cash consideration of $20,340 and 200,000 stock options (the “<b>Stock Options</b>”) exercisable at CAD$0.60 per common share in the capital of the Company for a period of two (2) years from the date of issuance. The Stock Options will vest on January 5, 2023. PRmediaNow, Inc., specializes in securing editorial earned media coverage through media outreach with reporters, producers and bloggers.\n</li>\n<li>\nInvestor Brand Network (“<b>IBN</b>”) to provide weekly coverage with expanded editorial content, custom media kid, branding and marketing services to the Company for a term of 6 months beginning on December 3, 2021 and ending on June 3, 2022, for total cash consideration of $58,000. IBN will use a variety of different platforms and media types including but not limited to InvestorWire, social media and IBN newsletters.\n</li>\n<li>\nStockhouse Publishing Ltd. (“<b>Stockhouse</b>”) to provide advertising campaign, video creation and distribution, global insights reports and various marketing collateral and products to the Company for a term of 12 months beginning on December 8, 2021 and ending on December 8, 2022, for total cash consideration of $157,500. The media can be viewed on stockhouse.com.\n</li>\n<li>\nGloBull Media LLC (“<b>GloBull</b>”) to provide Ad display and a DEM Awareness Campaign to run from January 17, 2022 to January 31, 2022, for total cash consideration of USD $118,500.<b> GloBull </b>specializes in digital advertisement placement, sponsored article placement, display advertising distribution, push notification, and search engine marketing with content displayed across the internet.\n</li>\n<li>\nMedia One AG (“<b>Media One</b>”) to provide press initiatives, on-line and traditional media content creation, web-development and webcasting and translation services focused on the European Union for a term of 16 months from February 1, 2022, to June 1, 2023 for total cash consideration of €450,000. Media One will consult towards a variety of different platforms and media types across the internet.\n</li>\n</ul><p>\nAll of the foregoing information related to promotional activity is being disclosed pursuant to a requirement by law.\n</p><p>\nTo learn more, join Eat Well Group’s <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Feepurl.com%2FhHl-9P&amp;esheet=52562755&amp;newsitemid=20220113005806&amp;lan=en-US&amp;anchor=mailing+list&amp;index=2&amp;md5=5aa6ac1d110d96d1bced8c5fb62dc9c8\" data-type=\"url\" class=\"tr-link\" translate=\"no\">mailing list</a> for important updates.\n</p><p>\n<b>ABOUT EAT WELL GROUP</b>\n</p><p>\nEat Well Group is a publicly-traded investment Company primarily focused on high-growth companies in the agribusiness, food tech, plant-based and ESG (environmental, social and governance) sectors. Eat Well Group’s management team has an extensive record of sourcing, financing and building successful companies across a broad range of industries and maintains a current investment mandate on the health/wellness industry. The team has financed and invested in early-stage venture companies for greater than 25 years, resulting in unparalleled access to deal flow and the ability to construct a portfolio of opportunistic investments intended to generate superior risk-adjusted returns.\n</p><p>\nDisclaimer for Forward-Looking Statements\n</p><p>\nThis news release contains “forward-looking information” and “forward-looking statements” within the meaning of applicable Canadian and United States securities laws (collectively, “forward-looking information”). Forward-looking information are often, but not always, identified by the use of words such as “seek,” “anticipate,” “believe,” “plan,” “estimate,” “expect,” “likely” and “intend” and statements that an event or result “may,” “will,” “should,” “could” or “might” occur or be achieved and other similar expressions. Forward-looking information in this news release includes future anticipated business developments for the companies in which Eat Well Group invests. Forward-looking information is based on assumptions that may prove to be incorrect, including but not limited to the ability of the Company to execute its business plan. The Company considers these assumptions to be reasonable in the circumstances. However, forward-looking information is subject to business and economic risks and uncertainties and other factors that could cause actual results of operations to differ materially from those expressed or implied in the forward-looking information. Such risks include, without limitation: the failure to negotiate and execute additional investments in target industries, the ability of the Company to complete investments in a timely manner or at all; the receipt of requisite approvals to complete the additional investments; the ability of the Company to realize the expected benefits and synergies of investments; unexpected disruptions to the operations and businesses of the Company and investee entities as a result of the COVID-19 global pandemic or other disease outbreaks including a resurgence in the cases of COVID-19; the ability of the Company to comply with applicable government regulations in a regulated industry; any change in accounting practices or treatment affecting the consolidation of financial results adverse market conditions; the inherent uncertainty of production and cost estimates and the potential for unexpected costs and expenses; costs of inputs; crop failures; litigation; currency fluctuations; competition; availability of capital and financing on acceptable terms; industry consolidation; loss of key management and/or employees; and other risks detailed herein and from time to time in the filings made by the Company with securities regulators. For more information on the Company and the risks and challenges of their businesses, investors should review their annual filings that are available at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.sedar.com&amp;esheet=52562755&amp;newsitemid=20220113005806&amp;lan=en-US&amp;anchor=www.sedar.com&amp;index=3&amp;md5=fca8c96797e739f8924d84590d197d4a\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.sedar.com</a>.\n</p><p>\n<b><span>The Canadian Securities Exchange has neither approved nor disapproved the information contained herein and does not accept responsibility for the adequacy or accuracy of this news release.</span></b>\n</p><p>\n_______________________\n<br/><sup>1</sup> <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.forbes.com%2Fsites%2Fforbesagencycouncil%2F2021%2F08%2F23%2Fwhy-the-best-opportunity-to-sell-on-amazon-is-here-and-now%2F%3Fsh%3D87fc97876201&amp;esheet=52562755&amp;newsitemid=20220113005806&amp;lan=en-US&amp;anchor=https%3A%2F%2Fwww.forbes.com%2Fsites%2Fforbesagencycouncil%2F2021%2F08%2F23%2Fwhy-the-best-opportunity-to-sell-on-amazon-is-here-and-now%2F%3Fsh%3D87fc97876201&amp;index=4&amp;md5=b81fae4f8c496eff5cc11698dfd3bce1\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.forbes.com/sites/forbesagencycouncil/2021/08/23/why-the-best-opportunity-to-sell-on-amazon-is-here-and-now/?sh=87fc97876201 \n</a><br/><sup>2</sup> <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.emarketer.com%2Fcontent%2Fhow-amazon-walmart-target-compare-digital-grocery-sales&amp;esheet=52562755&amp;newsitemid=20220113005806&amp;lan=en-US&amp;anchor=https%3A%2F%2Fwww.emarketer.com%2Fcontent%2Fhow-amazon-walmart-target-compare-digital-grocery-sales&amp;index=5&amp;md5=310ad47b8464ed8dacf3158e80c081eb\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.emarketer.com/content/how-amazon-walmart-target-compare-digital-grocery-sales</a>\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20220113005806r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjIwMTEzMDA1ODA2cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=19b54d4622bdfe8626805c1f16c23fa4f40a05467d893fdd6ffdf13cf07f26f186863587e0ea3cd2f517d1d51e7773ec23984e8248d0ac60d20001065bb008dd\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20220113005806/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20220113005806/en/</a></span></p><p>\nEat Well Investment Group Inc.\n<br/>Marc Aneed, CEO\n<br/><a href=\"mailto:ir@eatwellgroup.com\" data-type=\"email\" translate=\"no\">ir@eatwellgroup.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.eatwellgroup.com&amp;esheet=52562755&amp;newsitemid=20220113005806&amp;lan=en-US&amp;anchor=www.eatwellgroup.com&amp;index=6&amp;md5=e3f83bc0f01fd000fa0f456c6dd6f8ef\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.eatwellgroup.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2022</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: EAT-WELL-INVESTMENT/AVE7</p></div>"}