{"date": "2022-02-04 11:00:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3012.25, "close": 3152.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Paresh Dave</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Feb 4 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Amazon.com Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a> has racked up four straight quarters of cloud computing sales growth, a streak analysts are calling impressive and easing concerns that a customer shift toward multiple cloud vendors would hurt its leading market share.</p><p><a href=\"https://www.reuters.com/world/the-great-reboot/bank-regulators-tech-giants-are-now-too-big-fail-2021-08-20\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Warnings from industry regulators</a> of the need to cut risk as well as some high-profile cloud outages have increasingly pushed some corporate tech teams to adopt an approach called multicloud. Diversification can also offer better prices and backup options.</p><p>But Amazon's strong cloud performance, a large part of its forecast-beating <a href=\"https://www.reuters.com/business/media-telecom/amazon-hikes-prime-membership-fees-us-2022-02-03\" data-type=\"url\" class=\"tr-link\" translate=\"no\">quarterly results</a> on Thursday, underscores robust growth for much of the cloud industry, especially for the  biggest players.</p><p>Overall spending on cloud infrastructure services jumped 37% to $178 billion in 2021, outpacing 34% growth the year before, according to Synergy Research Group estimates.</p><p><br/></p><p><div class=\"tr-resource-ref\" id=\"g77e7685f-4463-49f3-ba95-a17fed0fb828\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://graphics.reuters.com/TECH-CLOUD/gdpzynkwnvw/chart.png\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9ncmFwaGljcy5yZXV0ZXJzLmNvbS9URUNILUNMT1VEL2dkcHp5bmt3bnZ3L2NoYXJ0LnBuZw==&amp;storyId=urn:newsml:reuters.com:20220204:nL1N2UE37G:6&amp;key=3a376049154edec4dd8a9580d7c8f6591cf66aed726bdbcc895213131ba34ef38ebc7ed225bbf5325029b263e439e7a0f1a323bddbe659f0fbd17ef6c91cd534\"/></div></div></div></p><p>The top three clouds, Amazon Web Services (AWS), Microsoft Corp's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=MSFT.O\" data-type=\"ric\" data-ric=\"MSFT.O\" translate=\"no\" dir=\"ltr\">MSFT.O</a> Azure and Google Cloud, also each grew market share by a percentage point during the last three months of 2021 compared with the prior quarter at the expense of smaller vendors, research company Canalys said on Thursday. </p><p>Canalys pegged their shares at 33% for AWS, 22% for Azure and 9% for Google.</p><p>\"Multicloud doesn't mean spreading your wealth across multiple clouds,\" said Sid Nag, a vice president at tech advisory firm Gartner. \"There's still a primary cloud you're doing most of your business with.\"</p><p>Capital One, which has said it was the first major U.S. bank to fully ditch data centers for the cloud and struck an early deal with AWS, is a case in point.</p><p>While it has adopted Google and Azure for some needs, it has expanded with AWS to become one of its larger users, according to two people familiar with the matter. They declined to be identified due to confidentiality agreements.</p><p>AWS said that a multicloud approach ultimately generates headaches for customers. \"AWS has proven its reliability,\" it said in a statement.</p><p><br/></p><p>MULTICLOUD LIMITATIONS</p><p>Clouds have become big drivers of growth at the big tech companies. AWS accounted for 13% of Amazon's revenue last year and 74% of its operating income. Cloud made up 7.5% of Alphabet's revenue. The Intelligent Cloud unit, of which Azure is a big chunk, brought in 37% of Microsoft’s overall sales.</p><p>Amazon attributed its cloud growth last year to expanding its sales team, adding data centers in new regions and clients moving faster to the cloud in the face of the pandemic. </p><p>Its cloud results were one of several factors sending Amazon's stock as much as 17% higher in extended trade on Thursday. Other cloud companies gained as Amazon's results highlighted the industry's prospects. Hashicorp Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=HCP.O\" data-type=\"ric\" data-ric=\"HCP.O\" translate=\"no\" dir=\"ltr\">HCP.O</a> and Datadog Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=DDOG.O\" data-type=\"ric\" data-ric=\"DDOG.O\" translate=\"no\" dir=\"ltr\">DDOG.O</a>, firms which aim to make multicloud systems easier to manage, gained 5% and 4% respectively.</p><p>The complexities of a multicloud approach may also be currently working in Amazon's favor.</p><p>    Wells Fargo &amp; Co <a href=\"reuters://REALTIME/Verb=FullQuote/ric=WFC.N\" data-type=\"ric\" data-ric=\"WFC.N\" translate=\"no\" dir=\"ltr\">WFC.N</a> last September announced it would move into the multicloud with Azure and Google.</p><p>\"Concentration risk is something that is talked about internally, talked about in the regulatory community as a concern,\" Christopher Marsh-Bourdon, its head of hybrid environments, told Reuters. \"Putting all your eggs in one basket isn’t always the best approach.\"</p><p>But he added that the bank is taking time to develop its expertise and will need at least five years before maintaining a significant presence in the cloud. </p><p>And some companies that are smaller or newer to the cloud prefer one vendor, said Sigal Zarmi, a board member at Hashicorp.</p><p>Some multicloud deals have also been relatively small.</p><p>Verint Systems Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=VRNT.O\" data-type=\"ric\" data-ric=\"VRNT.O\" translate=\"no\" dir=\"ltr\">VRNT.O</a> agreed to use Google Cloud as part of a deal to bring on Google as a client, according to a video last year on Verint's website. But Google Cloud is only one of several providers the business software company uses.</p><p>\"Certain regions and industry sectors have preferences for specific cloud options,\" Verint Chief Product Officer Jaime Meritt told Reuters. \"And we find that a multicloud strategy is the best path for Verint and our customers.\" </p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Paresh Dave and Jeffrey Dastin; Editing by Peter Henderson and Edwina Gibbs)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:paresh.dave@thomsonreuters.com\" data-type=\"email\" translate=\"no\">paresh.dave@thomsonreuters.com</a> ; 415-565-1302; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: TECH-CLOUD/ (ANALYSIS, PIX)</p></div>"}