{"date": "2021-11-14 17:38:18+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3545.68, "close": 3549.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>¶ Emirates NBD Group, Amazon and Etisalat among over 80 leading public and private sector organisations seeking to hire premium Emirati talent as demand rises</p>\n<p>¶ New format for show’s 20th edition boosted by enhanced visitor journey and brand-new show features including RollDXB pop-up, a start-up competition, and on-the-spot interviews</p>\n<p>Dubai: A plethora of public and private sector career opportunities await tens of thousands of Emirati graduates and job seekers at Ru’ya - Careers UAE Redefined – the UAE’s leading recruitment and training exhibition for Emirati youth – which opens for its 20th edition tomorrow (Monday 15th November).</p>\n<p>Running 15 to 17 November from 10am to 6pm at Dubai World Trade Centre (DWTC), Ru’ya - Careers UAE Redefined will attract thousands of job seekers including high school students, college graduates, and those looking to switch career paths.</p>\n<p>Ru’ya Careers UAE Redefined will provide prospective job seekers with access to over 80 leading public and private sector organisations offering a diverse portfolio of internship opportunities and professional roles. Participating companies include Emaratech, Emirates General Petroleum Corp (Emarat), Al Rostamani Group, DP World, Standard Chartered Bank, Majid Al Futtaim, Dell, KPMG, Deliveroo, Amazon and many more.</p>\n<p>This year’s show will serve as a hub for inspiration, conversation and collaboration to empower the country’s top young talent to demonstrate their creativity in a new era of growth for the national workforce across public and private sectors.</p>\n<p>Major employers roll-out strong recruitment drives</p>\n<p>With advancements in technology disrupting the working environment and reshaping the required skill sets for the modern workplace, key exhibitors have revealed a robust commitment to training and coaching for leading Emirati talent.</p>\n<p>Eman Abdulrazzaq, Group Chief Human Resources Officer at Emirates NBD, said: “Our continued participation in Careers UAE is underpinned by our long-term commitment to Emiratization and more</p>\n<p>recently, the UAE government’s new NAFIS initiative. By joining Emirates NBD Group through our Bedaya or Ruwad graduate programs, you’ve got a bright future ahead of you with us. From day one, we’ll prepare you for success based on your career ambitions, whether it be in retail or corporate banking, in one of our subsidiaries like Liv., or in one of our high-growth digital areas like analytics or artificial intelligence. We have a strong and proud brand that will only amplify with more talented UAE Nationals joining our ranks.”</p>\n<p>“Competition to secure Emirati talent is on the rise – which is also why we have launched our brand new Ruwad graduate program to attract the best and brightest. With the shift towards digitisation impacting all roles and the banking sector as a whole, Emirates NBD Group is very focused on upskilling and reskilling to ensure our entire workforce is future-ready, especially through internal academies including our new School of Data Sciences.”</p>\n<p>Pavneet Bajwa, Head of Human Resources (UAE) at Standard Chartered Bank, added: “Standard Chartered has been an active participant in Careers UAE since its establishment. We strongly believe in the platform and its active role in supporting us attract and hire talented UAE nationals for the private sector in general and the banking industry specifically.</p>\n<p>“It is extremely vital to be present in this year’s career fair to maintain our robust Emiratisation strategy along with our Diversity and Inclusion agenda. As a leading international Bank, we strive on attracting both young and experienced talent across all our functions, while providing careers with purpose. One of the key challenges is the increased competition in the market to attract and hire Emiratis, especially in the banking industry, Bajwa added.</p>\n<p>Attendees can expect a live speaking session by Emirati national Ruba AlSawalhi at Standard Chartered, who will talk to aspiring young Emirati leaders about “Personal Branding &amp; Identity”. The session will tap into identification of personal branding values, discussing what enhances and damages persona and brands, while providing insights into business etiquette through a series of discussions and exercises.</p>\n<p>The three-day event follows the recent announcement by the UAE Government as part of the UAE's 'Projects of the 50' plan, a series of major projects to boost the UAE's economy, detailing an AED 24 billion investment to get 75,000 more UAE nationals in private sector employment. As private sector companies must ensure that within five years, 10 per cent of their workforce is Emirati, the show comes at a crucial time as companies reignite their recruitment drives, with jobseekers searching for new and exciting opportunities.</p>\n<p>INSPIRATIONAL SESSIONS, NEW SHOW FEATURES AND ENGAGING OPPORTUNITIES FOR ALL</p>\n<p>As a premier education platform Ru’ya - Careers UAE Redefined has partnered with regional experts to offer a series of training sessions, professional development workshops and motivational seminars for Emirati job candidates. Day one will see HSBC Youth Majlis, Dubai Police’s K9 team, and other experts discuss a number of topics including: Opportunities in the Private Sector; Skills Needed to Prepare for the Future; and Building a Robust Personal Brand in a Competitive Market. Visitors will also meet the people behind the UAE’s Hope Probe Mission to Mars and hear stories of Emirati engineers.</p>\n<p>Inspirational figures pushing boundaries will deliver a series of thought-provoking talks in a series called ‘Urbaneer’ throughout all three days of the show. Moderated by Faisal Al Attar, the talks will bring together individuals in unusual jobs to discuss their journeys, career highs and lows and share valuable advice with visitors. The ground-breaking series will feature the likes of Hazzaa Almansoori, the first Emirati astronaut, and Huda Al Matroushi, the first Emirati female mechanic, who will empower other young women to continue challenging stereotypes in pursuit of their dreams.</p>\n<p>RollDXB, a homegrown roller-skating concept in Dubai is presenting a pop-up roller rink on-site, encouraging visitors to unwind and overcome their fears. The show also includes an interview studio where jobseekers can interact with consultants, in addition to new skills workshops and technique sessions linked to jobs of the future.</p>\n<p>Aliyah Al Banna, General Manager at RollDXB said: “We are honored and excited to be part of the show this year. As a new homegrown business born from the passion of skating, we aim to spread awareness of this beautiful sport, and grow the community of rollerskaters in the region, with particular attention to the classic skating on quads - the four wheels skates popular in the 70’s and 80’s. We love the new direction the exhibition is heading towards, as it engages with the younger generation, allowing them to face their fears, empowering and inspiring them as they search for job opportunities but without missing the fun”.</p>\n<p>New to the show, aspiring entrepreneurs between the age of 16 - 22 looking for support to make their business ideas come to life are participating in ‘The Next You’ - a start-up competition organised by Dubai SME in partnership with DubaiNext. The competition received over 100 entries over a period of two weeks, evidencing how creative, motivated and entrepreneurial the UAE’s youth are.</p>\n<p>Ru’ya - Careers UAE Redefined 2021 is exclusively for UAE nationals and HR practitioners. The fair is free to attend, open from 10am to 6pm from 15 – 17 November. For more information, please visit www.careersuae.ae</p>\n<p>-Ends-</p>\n<p>About Ru’ya Careers UAE Redefined 2021 www.careersuae.ae</p>\n<p>The 20th annual Ru’ya Careers UAE Redefined Exhibition is being held at Za’abeel Halls 1, 2 and 3 at Dubai World Trade Centre, from 15 - 17 Nov 2021. The exhibition is organised by Dubai World Trade Centre.</p>\n<p>Ru’ya Careers UAE Redefined is a high-calibre event that enables talented UAE nationals in all fields to meet directly with recruiters and hiring managers from the UAE’s top employers. Ru’ya Careers UAE Redefined was designed to expose job seekers to various training and career opportunities. Take advantage of the event for exciting networking possibilities, career leads, learn about various companies, meet employers, and to apply for job positions and internships.</p>\n<p>Ru’ya Careers UAE Redefined provides an opportunity for UAE nationals to meet and obtain information on:</p>\n<p>¶ Opportunities within organisations, possible career paths and general company information</p>\n<p>¶ Market information</p>\n<p>¶ Training and education opportunities available in the market</p>\n<p>About Dubai World Trade Centre (DWTC) www.dwtc.com</p>\n<p>As the organiser of Ru’ya Careers UAE Redefined 2021, Dubai World Trade Centre offers more than 40 years’ experience delivering world-class events in the Middle East, providing local, regional and international exhibitors with unmatched expertise and in-depth market knowledge. Our team organises over 20 of the region’s largest and most successful international and regional shows, providing an ideal platform for business development across the Middle East.</p>\n<p>Our commitment to ongoing innovation within the exhibition industry has supported the rapid growth and development of a wide range of business-to-business and business-to-consumer shows, and delivered consistent satisfaction to exhibitors and visitors. DWTC works with the leading trade bodies and industry associations to ensure that all exhibitions deliver full value and are built upon the real needs of their specific sector.</p>\n<p>For more information, please contact:<br/>\nYara Hamdan<br/>\nAction Global Communications<br/>\nE-mail: <a href=\"mailto:careersuae@actionprgroup.com\" data-type=\"email\" translate=\"no\">careersuae@actionprgroup.com</a></p>\n<p>Pragati Malik<br/>\nAction Global Communications<br/>\nE-mail: <a href=\"mailto:careersuae@actionprgroup.com\" data-type=\"email\" translate=\"no\">careersuae@actionprgroup.com</a> </p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}