{"date": "2022-02-08 12:20:00+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Ben Klayman</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">DETROIT, Feb 8 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Specialty vehicle manufacturer Shyft Group Inc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=SHYF.O\" data-type=\"ric\" data-ric=\"SHYF.O\" translate=\"no\" dir=\"ltr\">SHYF.O</a> said on Tuesday it expects to begin building a medium-duty electric delivery van at a plant in the southeastern United States by mid-2023, marking another entry into the commercial EV space.</p><p>The company, based outside Detroit, will begin delivering the custom-built electric vans in the second half of this year to customers for testing, Chief Executive Daryl Adams told Reuters.</p><p>Details of the plant are still being finalized, but it will have an initial annual capacity of 2,500 vans, and Shyft will subsequently add similar factories in the West and middle of the country, he said. </p><p>Shyft's van will have a driving range of 150 to 175 miles, with the ability to enhance that with expanded battery options. Adams declined to say which company would supply the batteries or what the starting price for the van would be.</p><p>Shyft said last June it eventually planned to offer an electric van platform and subsequently said it would build a Class 3 medium-duty electric delivery van from the ground up. It has built custom chassis for about 50 years, and has converted gasoline-powered vehicles into electric ones over the last decade.</p><p>With countries and regions like China and Europe pushing for zero-emission vehicles and companies promising carbon neutral operations over the next several decades, the push for electric commercial vehicles has intensified. Large automakers like Ford Motor Co<a href=\"reuters://REALTIME/Verb=FullQuote/ric=F.N\" data-type=\"ric\" data-ric=\"F.N\" translate=\"no\" dir=\"ltr\">F.N</a>, General Motors Co<a href=\"reuters://REALTIME/Verb=FullQuote/ric=GM.N\" data-type=\"ric\" data-ric=\"GM.N\" translate=\"no\" dir=\"ltr\">GM.N</a> and Stellantis<a href=\"reuters://REALTIME/Verb=FullQuote/ric=STLA.MI\" data-type=\"ric\" data-ric=\"STLA.MI\" translate=\"no\" dir=\"ltr\">STLA.MI</a>, as well as such startups as Rivian <a href=\"reuters://REALTIME/Verb=FullQuote/ric=RIVN.O\" data-type=\"ric\" data-ric=\"RIVN.O\" translate=\"no\" dir=\"ltr\">RIVN.O</a> plan to build electric vans. </p><p>Adams said most of those vehicles are smaller Class 2 vans, and Shyft's decision to enter the Class 3 EV van space came in response to demand from a customer base that includes United Parcel Service <a href=\"reuters://REALTIME/Verb=FullQuote/ric=UPS.N\" data-type=\"ric\" data-ric=\"UPS.N\" translate=\"no\" dir=\"ltr\">UPS.N</a>, FedEx <a href=\"reuters://REALTIME/Verb=FullQuote/ric=FDX.N\" data-type=\"ric\" data-ric=\"FDX.N\" translate=\"no\" dir=\"ltr\">FDX.N</a> and Amazon.com <a href=\"reuters://REALTIME/Verb=FullQuote/ric=AMZN.O\" data-type=\"ric\" data-ric=\"AMZN.O\" translate=\"no\" dir=\"ltr\">AMZN.O</a>. The company has invested up to $75 million on the program.</p><p>\"Unable to find a viable EV chassis option in the market, we decided to build our own,\" Adams said. </p><p>Shyft on Tuesday released teaser images of the van, which will be shown at the NTEA work truck show in Indianapolis in early March, after which it will begin taking orders for the vehicle. </p><p><span class=\"tr-strong\">Shyft will also sell the platform used for the electric van </span>to other manufacturers who want to use it in other markets, including recreational vehicles and municipal buses, Adams said.</p><p>Prototypes of the vans will be built at Shyft's plant in Plymouth, Michigan, before final production transitions to the new plant. The location for that factory is being selected from among three sites that Adams did not identify. </p><p><br/></p><p class=\"tr-signoff\"> (Reporting by Ben Klayman in Detroit;<br/>Editing by Bernadette Baum)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:benjamin.klayman@thomsonreuters.com\" data-type=\"email\" translate=\"no\">benjamin.klayman@thomsonreuters.com</a> ; 313-600-2277; Reuters Messaging: <a class=\"tr-link tr-link-rm\" href=\"rm://benjamin.klayman.thomsonreuters.com@reuters.net\">benjamin.klayman.thomsonreuters.com@reuters.net</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: SHYFT-ELECTRIC/VAN (PIX)</p></div>"}