{"date": "2022-02-25 01:20:07.476000+00:00", "ticker": "AAF", "mrkt_info": {"open": 149.4, "close": 144.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Airtel Africa, a leading provider of telecommunications and mobile money services with a presence in 14 countries across Africa, announces that its B2B provider, Airtel Business Africa, has signed a memorandum of understanding (MoU) with Avaya Holdings Corp, to better equip organizations across the continent to deliver effortless customer and employee experiences by providing customer control and flexibility on its fixed voice service.</p><p>The agreement will see Airtel Business Africa empower its enterprise customers with the Avaya OneCloud? AI-powered experience platform, as they transition to the digital workplace. The platform, bundled with Airtel Africa voice services, includes workstream collaboration, contact center, unified communications, and communications platform as a service solution with Avaya OneCloud CCaaS, OneCloud UCaaS and OneCloud CPaaS.</p></div><div class=\"tr-npp-body\"><p>With this joint offering, Airtel Africa?s customers will be able to procure vertical-focused, communications-enabled solutions on a simple, 24/7, one-stop shop and service support in addition to having access to the latest business devices.</p><p>The MoU builds on an existing partnership between Airtel and Avaya that has seen Airtel make the Avaya Spaces workstream collaboration solution available across multiple African countries on multiple connectivity channels that include internet, microwave and fibre.</p><p>Luc Serviant, Group Enterprise Director, Airtel Business at Airtel Africa commented: ?Airtel Africa is committed to exploring opportunities and possibilities that will enhance enterprise operations, empower entrepreneurs, and enable more productive and successful organizations. Our existing partnership with Avaya has supported key sectors over the last 18 months, ensuring minimum disruption to everyday business while still supporting economic growth. This MoU takes our partnership to a new level that will see us enable enterprises to compete and win in the emerging experience economy.?</p><p>The agreement will also see Airtel Business Africa take part in the recently launched Avaya Experience Builders? initiative. Avaya Experience Builders globally aligns Avaya?s services, partners and developers into an ecosystem that delivers next-generation customer and employee experiences. And as part of the initiative, Airtel will leverage and add to Avaya?s rich ecosystem to make it easier for regional businesses to build and deliver experiences that create deeper relationships with their customers.</p><p>Nour Al Atassi, Director, Service Providers ? Asia, Middle East and Africa, Avaya, said: ?Airtel Africa has helped to foster great customer and employee experiences across Africa with its investments in innovation, and we?re proud to be helping Airtel build on that legacy as we work towards an expanded partnership. We can?t wait to see what African businesses, governments and other organizations can do with the power of Avaya OneCloud as Airtel helps them use the platform to compose effortless experiences for their customers and employees.?</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Euclid Infotech Pvt Ltd.</p></div>"}