{"date": "2022-01-19 15:41:52.548000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>FANSUNITE ENTERTAINMENT INC (\"FANS-Z\")\n- March 5, 2022 Launch Date of VamosGG Cup; Signs\n- Partnerships with Two Prominent Brazilian Esports Streamers\n\n   FansUnite Entertainment Inc. (\"FansUnite\" or the \"Company\") is pleased\nto announce the launch of the VamosGG Cup, a two-day Counter-Strike: Global\nOffensive (\"CS:GO\") tournament featuring gamers, streamers and influencers\nbeginning on March 5, 2022.\n\n   FansUnite's Brazilian esports wagering platform, VamosGG, set new record\nmilestones during the PGL Major 2021, leading the Company to establish the\nVamosGG Cup. The live event will increase their Brazilian brand's\nvisibility among esports fans, mainly CS:GO enthusiasts, and position\nFansUnite to leverage the tournament to generate new registrants among\nspectators.\n\n   \"Given the significant traction we received for VamosGG during the PGL\nMajor 2021, we decided to launch our own branded tournament to grow the\nVamosGG brand,\" said Scott Burton, CEO of FansUnite. \"VamosGG is looking to\nacquire bettors through more cost-effective means than traditional\nadvertising and sponsorship. Influencer advocacy has time and again proven\nto be an effective promotional and conversion tool for the esports\ngeneration. The Brazilian esports community consists of passionate CS:GO\nfans who support and follow their favourite streamers. Partnering with them\nwill create more awareness about VamosGG, leading to more bettors on the\nVamosGG platform.\"\n\n   Overview of VamosGG Cup\n\n   Dates: Saturday, March 5 &amp; Sunday, March 6, 2022\n\n   Participants: Four teams will compete for the title. Each team has a\ndesignated captain that will select four more players to round out their\nfive-person teams, for a total of 20 players participating.\n\n   Format: The teams will compete against each other on a CS:GO game map\nthat will be created exclusively for the VamosGG Cup. The tournament will\nrun for two days. Preliminary rounds are single match, win and advance. The\nGrand Finale for first place will be a best of five match, while the battle\nto determine third place will be a best of three match. Everyone receives a\ncash prize according to their final placement.\n\n   Broadcast/Streaming: The tournament will be streamed live on the four\ncaptains' Twitch and social media channels, as well as on additional\ninfluencer streams that will be announced leading up to the VamosGG Cup.\n\n   VamosGG Cup's Team Captains\n\n   VamosGG has signed exclusive tournament partnerships with the immensely\npopular Brazilian streamers and CS:GO influencers TomahawkTV and JokerBR to\nserve as two of the four team captains. The remaining two captains will be\nannounced in the near future.\n\n   The influencers will live stream the entirety of the VamosGG Cup on\ntheir Twitch channels and other social media platforms, as well as offer\nexclusive player and fan promotions in the month leading up to the event\nand during the tournament. VamosGG will leverage the streamers' large\naudiences to drive traffic to the platform.\n\n   About FansUnite Entertainment Inc.\n\n   FansUnite is a global sports and entertainment company, focusing on\ntechnology related to regulated and lawful online gaming and other related\nproducts. FansUnite has produced a one-of-a-kind complete iGaming platform,\nwith a sports and esports focus geared for the next generation of online\nbettors and casino players. The platform includes products for pre-match\nbetting, in-play betting, daily fantasy, content and a certified RNG to\nproduce casino style chance games. The platform operates multiple B2C\nbrands and B2B software for the online gambling industry. FansUnite also\nlooks to acquire technology platforms and assets with high growth potential\nin new or developing markets. The Company also provides technological\nsolutions and services in the global gaming and entertainment industries.\nIts technology includes fixed/parimutuel odds, in-stream betting, live\nbetting, casino-style games, cryptocurrency wallet and news content.\n\n   For further information, please contact:\n\n   Prit Singh, Investor Relations at FansUnite\nir@fansunite.com\n(905) 510-7636\n\n   Scott Burton, Chief Executive Officer of FansUnite\nscott@fansunite.com\n\n   Darius Eghdami, President of FansUnite\ndarius@fansunite.com\n\n   NEITHER THE CANADIAN SECURITIES EXCHANGE NOR ITS REGULATIONS SERVICES\nPROVIDERS HAVE REVIEWED OR ACCEPT RESPONSIBILITY FOR THE ADEQUACY OR\nACCURACY OF THIS RELEASE\n\n   FORWARD-LOOKING INFORMATION:\n\n   This news release contains certain statements that may constitute\nforward-looking information under &amp;#8206;applicable securities laws. All\nstatements, other than those of historical fact, which address activities,\n&amp;#8206;events, outcomes, results, developments, performance or achievements\nthat FansUnite anticipates or &amp;#8206;expects may or will occur in the\nfuture (in whole or in part) should be considered forward-looking\ninformation. Often, but not always, forward-looking information can be\nidentified by the use of words such &amp;#8206;as \"plans\", \"expects\", \"is\nexpected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\",\n&amp;#8206;&amp;#8206;\"anticipates\", or \"believes\" or variations (including\nnegative variations) of such words and phrases, or &amp;#8206;statements formed\nin the future tense or indicating that certain actions, events or results\n\"may\", \"could\", &amp;#8206;&amp;#8206;\"would\", \"might\" or \"will\" (or other\nvariations of the forgoing) be taken, occur, be achieved, or come to\n&amp;#8206;pass. Forward-looking statements may include, without limitation,\nstatements relating to &amp;#8206;&amp;#8206;&amp;#8206;the success and occurrence of\nany upcoming live or virtual events; influencers social media reach and its\nability to translate into success for FansUnite; FansUnite's ability to\n&amp;#8206;fulfill technology needs with its &amp;#8206;platform; business\ndevelopment &amp;#8206;plans of &amp;#8206;FansUnite; the Company's unique\nportfolio of assets; and discussion of future plans, &amp;#8206;projections,\n&amp;#8206;objectives, estimates &amp;#8206;and forecasts and the timing related\nthereto. Forward-looking statements in this news release include, but are\nnot limited to, discussion of future plans and ability to increase the\nCompany's reach to different regulated betting markets across the United\nStates.\n\n   Forward-looking information are based on assumptions and analyses made\nby the Company in light of its &amp;#8206;experience and its perception of\nhistorical trends, current conditions and expected future developments,\n&amp;#8206;including, but not limited to, expectations and assumptions\nconcerning: interest and foreign exchange &amp;#8206;rates; capital\nefficiencies, cost saving and synergies; growth and growth rates; the\nsuccess in the online &amp;#8206;gambling and sports betting industry; the\nregulatory environment applicable to online gambling and sports\n&amp;#8206;betting; the technological infrastructure and support needed to host\nthe Company's online gambling and &amp;#8206;sports betting platforms and\napplications; any cryptocurrency applications to the Company's business;\n&amp;#8206;and the Company's growth plan. While FansUnite considers these\nassumptions to be reasonable, based &amp;#8206;on information currently\navailable, they may prove to be incorrect. Readers are cautioned not to\nplace &amp;#8206;undue reliance on forward-looking information. In addition,\nforward-looking information necessarily involve &amp;#8206;known and unknown\nrisks, including, without limitation, risks associated with general\neconomic conditions; &amp;#8206;risks associated with the regulatory\nenvironments in the jurisdictions the Company operates in;\n&amp;#8206;technology-related risks that could adversely effect the Company's\nability to operate its online gambling &amp;#8206;and sports betting platforms\nand applications, risks related to the novel coronavirus (COVID-19) global\n&amp;#8206;pandemic and any effects it might have on the Company's business\nthereto. Readers are cautioned that &amp;#8206;the foregoing list is not\nexhaustive. For more information on the risk, uncertainties and assumptions\nthat &amp;#8206;could cause anticipated opportunities and actual results to\ndiffer materially, please refer to the public &amp;#8206;filings of FansUnite\nwhich are available on SEDAR at www.sedar.com. Readers are further\ncautioned not &amp;#8206;to place undue reliance on forward-looking information\nas there can be no assurance that the plans, &amp;#8206;intentions or\nexpectations upon which they are placed will occur. Such information,\nalthough considered &amp;#8206;reasonable by management at the time of\npreparation, may prove to be incorrect and actual results may &amp;#8206;differ\nmaterially from those anticipated. Forward-looking information contained in\nthis news release are &amp;#8206;expressly qualified by this cautionary\nstatement and reflect our expectations as of the date hereof, and\n&amp;#8206;thus are subject to change thereafter. FansUnite disclaims any\nintention or obligation to update or revise any forward-looking\ninformation, whether as a result of new information, future events or\notherwise, &amp;#8206;except as required by applicable law. &amp;#8206;\n\nTel   : 604-329-8669    FANSUNITE ENTERTAINMENT INC\nEmail : graeme@fansunite.com\nWWW   : <a href=\"https://www.fansunite.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.fansunite.com</a>\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201800069.MNPRE2201800968-06074420220119</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}