{"date": "2021-11-09 13:00:03.372000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Mid-Ohio Food Collective Teams Up with Amazon to Deliver Tens of Thousands of Meals to Vulnerable Ohioans</b>\n</p><p class=\"bwalignc\">\n<span>Pilot program delivers groceries directly to the doorsteps of vulnerable neighbors and helps connect families to much needed food</span>\n</p><p>\n<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fmofc.org%2F&amp;esheet=52526128&amp;newsitemid=20211109005704&amp;lan=en-US&amp;anchor=Mid-Ohio+Food+Collective+%28MOFC%29&amp;index=1&amp;md5=f88cb159c00da13ec04af7e27d136e3c\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Mid-Ohio Food Collective (MOFC)</a>, in partnership with <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Famazon.com%2F&amp;esheet=52526128&amp;newsitemid=20211109005704&amp;lan=en-US&amp;anchor=Amazon&amp;index=2&amp;md5=7dd8312868828987c9c4a551c5873207\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon</a>, has launched a pilot program delivering healthy and nutritious groceries directly to the doorsteps of hundreds of seniors, who are unable to travel to a food pantry or a MOFC partner agency. The program began March of this year and serves seniors who live in the pilot area. Amazon donates free delivery services through their network of Amazon delivery service partners, who make safe, contactless deliveries directly to participants’ homes. To date, the pilot program has successfully delivered more than 54,000 meals to over 300 seniors a month during a time when the need for food has increased significantly due to the pandemic.\n</p><p>\n“We are working hard to develop innovative strategies to connect people to food, especially during these confusing and unsettling times of economic and health crisis,” said Matt Habash, President &amp; CEO of Mid-Ohio Food Collective. “Having the capability to bring food to seniors’ homes makes a tremendous difference for our customers who are struggling to put food on their tables. We are incredibly grateful to have an amazing partner in Amazon who is working with us to make healthy meals more accessible during these challenging times.”\n</p><p>\nSince the onset of COVID-19, more than 230,400 families have made more than 1.4 million visits to one of Mid-Ohio Food Collective’s partner agencies. Nearly 35 percent of all our customers are visiting a food pantry for the first time. The pilot program meets the heightened need for food by providing safe, contactless deliveries and a convenient solution to our neighbors who are not able to commute due to a medical disability or other challenging condition.\n</p><p>\nWith the success of the partnership with Amazon, through its <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.aboutamazon.com%2Fnews%2Fcommunity%2Famazon-fights-hunger-delivering-1-million-more-meals-this-summer&amp;esheet=52526128&amp;newsitemid=20211109005704&amp;lan=en-US&amp;anchor=Community+Delivery+program&amp;index=3&amp;md5=b92f468c1394ebd0f58e0b623da6fa23\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Community Delivery program</a>, MOFC will continue to monitor the program metrics while considering the extension of meal deliveries into 2022 to provide meals for up to 700 seniors a month.\n</p><p>\n“Since last year, Amazon has been committed to supporting communities across the U.S. experiencing food insecurity by connecting families with meals direct to their doorstep from local food banks,” said Bettina Stix, Director of Right Now Needs and Disaster Relief at Amazon. “We are thrilled to partner with the Mid-Ohio Food Collective and use our network of Amazon delivery service partners to help families in the greater Columbus region get access to nutritious meals.”\n</p><p>\nSince March 2020, Amazon has supported food banks and community organizations with free, contactless delivery of groceries and pre-packaged meals directly to the doorsteps of vulnerable groups. Using Amazon’s network of delivery service partners around the world, deliveries now total more than 20 million meals to underserved families, vulnerable seniors, and school children in more than 25 U.S. cities and in communities across Australia, Japan, Singapore, Spain, and the U.K.\n</p><p>\n<b>About Mid-Ohio Food Collective</b>\n</p><p>\nMid-Ohio Food Collective is the umbrella organization that holds five assets, Mid-Ohio Foodbank, our anchor asset, Mid-Ohio Farm, Mid-Ohio Markets, Mid-Ohio Farmacy and Mid-Ohio Kitchen. The Mid-Ohio Food Collective has a network of 680 partner agencies across 20 counties, connecting those in need to nutritious food. Learn more by visiting <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fmidohiofoodbank.org%2F&amp;esheet=52526128&amp;newsitemid=20211109005704&amp;lan=en-US&amp;anchor=mofc.org&amp;index=4&amp;md5=f684aee19b749d1416c4cb7c4e38747d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">mofc.org</a>\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211109005704r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTA5MDA1NzA0cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=6eaccb6523a295ef97f6fae173196350df397222c6086d7a12443a7647f4c16a7bf9ac9f84ef6f86aa1ddbcb524628036159baf71380cfd6e0b19326208e004b\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211109005704/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211109005704/en/</a></span></p><p>\nMalik Perkins\n<br/>614.782.5509 (o)\n<br/>937.545.1402 (c)\n<br/><a href=\"mailto:mperkins@midohiofoodbank.org\" data-type=\"email\" translate=\"no\">mperkins@midohiofoodbank.org</a>\n</p><p>\nAmazon.com, Inc.\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: OH-OHIO-FOOD-COLLECTIVE</p></div>"}