{"date": "2021-11-29 20:27:00.144000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>\n<b>Cavirin Selected as Solutions Partner for AWS Inspector-Next Partner Program</b>\n</p><p>\n<b>Cavirin integrates Amazon Inspector into Cavirin's hybrid cloud security and compliance platform</b>\n</p><p>\nCavirin, a pioneer and a leading provider of cloud-based security and compliance solutions, announces native integration with Amazon Inspector by Amazon Web Services, Inc. (AWS). By combining the native capabilities of Amazon Inspector with Cavirin solution's advanced policy-based workflow, security professionals gain powerful insights into system health within a single unified platform.\n</p><p>\nThe Integration of Amazon Inspector enables the inclusion of inspector discoveries into the prioritized remediation workflow of the Cavirin dashboard. Ensuring rapid remediation of vulnerabilities in the AWS environment is key to keeping systems secure. Cavirin's posture management, one-click remediation, and integration with major ticketing systems guarantees a fast track to securing AWS instances.\n</p><p>\n“Our focus has always been to offer the best possible reporting and remediation in the fastest possible time,” said Amar Bhadrashetty, Head of Product Management at Cavirin. “We are excited about the added vulnerability management capability that AWS Inspector brings to our platform. We know our users will be happy to have the greater insight AWS Inspector brings to the table. Typically, Cavirin users manage hundreds of targeted resources. What they need is the ability to see system-wide health from a single view. Based on this single view, we provide the tools to prioritize and rapidly respond.”\n</p><p>\nCavirin’s solution offers real-time monitoring, threat detection, and auto-remediation in the hybrid cloud. This same platform provides immediate access to audit-ready compliance reports.\n</p><p>\nAmazon Inspector is a vulnerability management service that continually scans workloads for software vulnerabilities and unintended network exposure. With a few clicks in the AWS management console, Amazon Inspector can be enabled across all accounts in your organization. Once enabled, Amazon Inspector automatically discovers all running Amazon Elastic Compute Cloud (Amazon EC2) instances and container images residing in Amazon Elastic Container Registry (Amazon ECR) at any scale and immediately starts assessing them for known vulnerabilities.\n</p><p>\nTo learn more about the tools available for maintaining the health and compliance of your hybrid cloud systems, contact Cavirin today at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fcavirin.com&amp;esheet=52541732&amp;newsitemid=20211129005684&amp;lan=en-US&amp;anchor=https%3A%2F%2Fcavirin.com&amp;index=1&amp;md5=3d6b24a9e700d13219edb579bbed4181\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://cavirin.com</a>.\n</p><p>\n<b>About Cavirin</b>\n</p><p>\nCavirin, headquartered in San Jose, Calif., is a privately held, global provider of risk, cybersecurity, and compliance posture intelligence for the hybrid cloud. We are committed to helping customers build their “First Line of Defense” via robust configurations across key cloud services and workloads.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211129005684r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTI5MDA1Njg0cjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=2fb684f5c6d13a2cf6745d6dc27fb00d599e26e889ffca387cc973dfdcdf40f7b79767059cabed62c383be2c64b5fa9bf91f843e2ea68a9acd7b03c7aa43bd7c\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211129005684/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211129005684/en/</a></span></p><p>\n<b>Media Contact: \n</b><br/>Dael Bartlett\n<br/>Email: <a href=\"mailto:dael@cavirin.com\" data-type=\"email\" translate=\"no\">dael@cavirin.com</a><br/>Phone: (408) 383 7615\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: CA-CAVIRIN</p></div>"}