{"date": "2021-07-08 05:35:11+00:00", "ticker": "AVV", "mrkt_info": {"open": 3888.0, "close": 3885.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p><strong>Dubai, UAE:</strong> AVEVA, a global leader in industrial software, driving digital transformation and sustainability, today reaffirmed its support for power providers joining the new breed of digital-industrial companies that are changing their business models to take full advantage of new digital capabilities. The company’s domain expertise across different segments of the electricity value network underscores its ability to speak to the varied needs of power providers globally. It is uniquely placed to offer cutting-edge solutions for power operators to deliver safe, resilient, sustainable, and efficient services while minimizing risk and lowering total cost of operations.</p>\n<p>Today, the key players in the power and utilities sector are striving to balance the fuel mix through big data analytics, accelerating the adoption of natural gas and renewables; optimizing plant operations by using analytics to reduce cost and emissions while maximizing economic output; and developing new ways to interact with customers. The speed and scale of the digital transformation is impacting multiple industries. The digital agenda is being driven by a combination of technologies from cloud, analytics, mobile, machine learning to IoT. Together, these technologies are putting data and intelligence at the center of new business models. Industries, companies and business leaders are grappling with a world that is more volatile and more complex, yet demands greater agility, more speed, and more digital competence.</p>\n<p>Although power companies are making progress on digital transformation and many have adopted technologies that would be considered disruptive such as AI, analytics, and machine learning - many are still weighing up and exploring the opportunities. AVEVA’s comprehensive industrial solutions portfolio ranges from the Digital Twin, Asset Strategy and Asset Performance Management to Connected Worker and Mobile Operator Rounds all designed to enhance digital acceleration and the utilization of cloud technologies across the power sector.</p>\n<p><strong>AVEVA’s Proven Power Sector Track Record</strong></p>\n<p>AVEVA has a track record of co-innovation with major power and utilities customers globally who rely on AVEVA solutions to increase efficiency and safety of workers, improve plant reliability, reduce risks, augment productivity and advance overall business performance with transformative digital and cloud solutions.</p>\n<ul class=\"bulleted-list arrowlist\">\n<li>Leading global producer and distributer of electricity and gas ENEL recently deployed AI-infused AVEVA Predictive Analytics to drive its autonomous plant vision. Today, AVEVA’s solutions are enabling ENEL to optimize the performance and reliability of its assets and to improve business performance. The solutions empowered ENEL’s workforce to pivot overnight to working from home when the pandemic struck, ensuring resiliency and sustainable delivery of critical services.</li>\n<li>Federal Electricity Commission (CFE) in Mexico, deployed AVEVA Smart Gridportfolio to align its assets, operations and workforce to international standards and supply reliable and sustainable electricity across the country.</li>\n<li>US-based Duke Energy is an electric utility company that has also leveraged AVEVA’s predictive asset analytics software to centrally monitor its power generation assets. The company has saved USD $50 million through reduced failures, including a saving of USD $ 30 million from a single early catch event.</li>\n</ul>\n<p><strong>Digital Transformation Requires Power Sector Resilience and Commitment</strong></p>\n<p>The process of digital transformation is not as straightforward as it sounds. It requires investing in infrastructure and new technologies; changing mindsets, public policies, and business models; investing in people through education and on-the-job skills upgrading and developing open standards and ensuring interoperability. It also will require the highest degree of cyber security against potential data privacy and system security risks.</p>\n<p>The current challenging macro-economic environment means that it is even more vital for power companies to equip themselves with technologies that will modernize legacy systems and processes to propel them into the digital future. AVEVA’s solutions portfolio, supports this approach by offering power customers a holistic view of the asset lifecycle and value chain. This helps customers to greatly improve operational safety and eliminate information silos from across IT and OT systems, and also improving collaborative efficiencies in the process.</p>\n<p>“The rapid move to industrial sector digital transformation was not affected by the pandemic, with even more power industry players realizing the importance of having high data availability and embracing a cloud-first approach to increase efficiencies, automate processes, maximize productivity and ensure continuity in all events,” said Evgeny Fedotov, Senior Vice President and Head of EMEA, AVEVA. “Our solutions are helping to play a critical role in enabling companies from all sectors to transform their organizations, through technology, to become more resilient, reliable and efficient. The power sector is currently undergoing a digital transformation that will continue to play out for the next few year to come and it is this transformation that is enhancing the way energy is produced, delivered, and consumed.”</p>\n<p>Access AVEVA’s Power industry content hub and register to watch videos and learn how AVEVA is enabling power companies to drive digital transformation across the asset lifecycle to improve asset reliability, efficiency, and safety via this link: welcome to the Power content hub.</p>\n<p><strong>About AVEVA</strong></p>\n<p>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence.  AVEVA’s comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries. Learn more at <a href=\"http://www.aveva.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.aveva.com</a>. </p>\n<p>Copyright © 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}