{"date": "2022-01-18 00:00:01+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><ul class=\"bulleted-list arrowlist\"><li class=\"tr-summaryitem\">Stellantis shares up over 60% in 1st year, beating Tesla</li><li class=\"tr-summaryitem\">Company to unveil business plan on March 1</li><li class=\"tr-summaryitem\">Investors expect new strategy for China</li></ul><p class=\"tr-by\">By Giulio Piovaccari</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">MILAN, Jan 18 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>If playing catch up with Tesla is what everyone in the auto industry is about then Stellantis, the company formed from the merger of Fiat Chrysler and Peugeot, has had a good start – its shares have far outpaced its U.S. rival in its inaugural year.</p><p>But this is just the first lap.</p><p>Fixing its business in China and overcapacity in Europe are just two areas where analysts want to see Stellantis <a href=\"reuters://REALTIME/Verb=FullQuote/ric=STLA.MI\" data-type=\"ric\" data-ric=\"STLA.MI\" translate=\"no\" dir=\"ltr\">STLA.MI</a> making progress when Chief Executive Carlos Tavares unveils his detailed business plan on March 1. </p><p>After all, despite its shares surging more than 60% since their debut on Jan. 18, 2021 - compared with a 27% gain for Tesla's <a href=\"reuters://REALTIME/Verb=FullQuote/ric=TSLA.O\" data-type=\"ric\" data-ric=\"TSLA.O\" translate=\"no\" dir=\"ltr\">TSLA.O</a> - Stellantis' market value of 59 billion euros  ($67 billion) is still just 6% of its U.S. rival's.</p><p><div class=\"tr-resource-ref\" id=\"g168d7f08-7e2a-4c9b-97b1-af9ca742bfcd\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://fingfx.thomsonreuters.com/gfx/mkt/egpbkjedkvq/Stellantis%20shares.PNG\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9maW5nZngudGhvbXNvbnJldXRlcnMuY29tL2dmeC9ta3QvZWdwYmtqZWRrdnEvU3RlbGxhbnRpcyUyMHNoYXJlcy5QTkc=&amp;storyId=urn:newsml:reuters.com:20220118:nL8N2SK3IL:1&amp;key=9b1655d9e24618ac2ef0db396a36e356d2275597b09069aadcbc6d48261701e977a7847057704670f0d8571cb2732ea016e587e3572e08bebc81fd0556d34670\"/></div></div></div></p><p>A strong first year augurs well, though, with Jefferies analysts saying Tavares has shown vision and ambition with a \"sustained stream of strategic initiatives.\"</p><p>Since forging the world's No. 4 carmaker by production, Tavares has mapped out a 30 billion euro electrification strategy, and formed alliances with Amazon and iPhone assembler Foxconn to accelerate development of software and semiconductors for future connected vehicles. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL4N2TL2L1\" data-type=\"storyId\" data-story-id=\"nL4N2TL2L1\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL8N2SS1A7\" data-type=\"storyId\" data-story-id=\"nL8N2SS1A7\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>He has also drawn up plans for five battery plants and cut deals with unions to keep streamlining its European operations - side-stepping potential labour conflicts and pushing the company's operating profit margin up to around 10%. </p><p>Excluding former Peugeot-controlled parts maker Faurecia <a href=\"reuters://REALTIME/Verb=FullQuote/ric=EPED.PA\" data-type=\"ric\" data-ric=\"EPED.PA\" translate=\"no\" dir=\"ltr\">EPED.PA</a>, Stellantis' workforce was almost unchanged in the past year at around 300,000 - keeping Tavares' promise not to cut jobs or close plants following the merger. </p><p>All this despite facing a semiconductor and supply chain crunch that cost global automakers millions of vehicles in lost production last year and is not expected to ease quickly.</p><p>Marco Santino, a partner at management consultants Oliver Wyman, said Tavares was living up to his reputation as a practical man avoiding a \"muscular\" approach with unions and the outlines of his strategy were in place.</p><p>\"The path has been mapped out already, it needs to be consolidated,\" he said. \"I don't expect fireworks from his business plan\".    </p><p><br/></p><p>CHALLENGES </p><p>But many say more bold action is needed. </p><p>Jefferies analysts, for example, say Stellantis' 14 brands - including Jeep, Ram, Citroen, Opel and Maserati - walk \"a fine line between differentiation and internal competition.\" </p><p>This at a time when Tesla is leading the industry transition to an electric and software-driven future with a single brand and a highly focused strategy.     </p><p>Tavares has said every aspect of the group is under the microscope, including its brands, some of which analysts have suggested could be eliminated to save money.</p><p>\"For the time being, we love them all and you cannot kill what you love,\" the 63-year old said last year.</p><p>\"When you love them, you give them a chance,\" he said, adding each brand would be given 10 years to prove itself profitable. </p><p>As the group enters its second year, another long term challenge is reviving its fortunes in China, the world's biggest auto market, where Fiat Chrysler and Peugeot-owner PSA had almost negligible market shares.</p><p><div class=\"tr-resource-ref\" id=\"g064fe88d-c77d-494d-943f-b101825139aa\"><div class=\"tr-image\"><div class=\"tr-image-components\"><img src=\"https://fingfx.thomsonreuters.com/gfx/mkt/lgpdwjgdmvo/China%20market%20share.PNG\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9maW5nZngudGhvbXNvbnJldXRlcnMuY29tL2dmeC9ta3QvbGdwZHdqZ2Rtdm8vQ2hpbmElMjBtYXJrZXQlMjBzaGFyZS5QTkc=&amp;storyId=urn:newsml:reuters.com:20220118:nL8N2SK3IL:1&amp;key=b47d0220c3abc55b5c4dceb4ee9e785f582e029df0c9405928c2ab573637ba8236399a2002f756c3a5057a2d1f685de2350614af0d3206891ec8fe39833479b4\"/></div></div></div></p><p>\"We are now negotiating and changing very many things at core,\" Tavares has said about his China plans, without giving details.     </p><p>Jefferies analysts said the company could look to leverage its strong Jeep and Maserati brands there. It could also consider using China as an export base to the rest of Asia, or deepen its ties with Foxconn beyond their current joint venture, they said.</p><p>\"Luckily for Tavares, he's got time,\" Oliver Wyman's Santino said. \"Investors' focus is on Europe's turnaround at the moment. And on that he is delivering\".</p><p>($1 = 0.8775 euros)</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Additional reporting by Danilo Masoni in Milan, Brenda Goh in Shanghai and Gilles Guillaume in Paris<br/>Editing by Mark Potter and Carmel Crimmins)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:giulio.piovaccari@thomsonreuters.com\" data-type=\"email\" translate=\"no\">giulio.piovaccari@thomsonreuters.com</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: STELLANTIS-ANNIVERSARY/ (PIX)</p></div>"}