{"date": "2022-01-06 21:11:41.350000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3287.14, "close": 3251.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>EAT WELL INVESTMENT GROUP INC (\"EWG-Z;EWGFF-0\")\n- New Distribution of Amara Organic Foods to Loblaws Stores\n- Across Canada\n\nAmara's organic plant-based baby food is now available in Loblaws locations\nnationwide across Canada, tapping demand for consumers seeking delicious,\nconvenient, plant-based foods for their growing families.\n\n     Eat Well Investment Group Inc., (the \"Company\" or \"Eat Well Group\" or\n\"EWG\") is pleased to announce that it's majority-owned portfolio company,\nAmara Organic Foods (\"Amara\"), one of the fastest-growing baby food brands\nin America, is now available nationwide across Canada in Loblaws Inc.\n(\"Loblaws\") (TSX:L).\n     Established in 1919, the Loblaws group of companies have over\n2,400 locations across Canada and are one of North America's leading\ngrocery and pharmacy chains.\n     \"We are incredibly excited to see Amara add another premier\ndistribution point in Loblaws, one of Canada's most well-known and\nestablished grocery stores. We look forward to seeing Amara become a\nhouse-hold name as it continues to rapidly disrupt legacy baby and toddler\nfood brands,\" stated Marc Aneed, Director and CEO of Eat Well Group. \"We\nexpect our revenue from our CPG investments to equate to approximately\n25-35% of our anticipated $90-110M projected 2022 revenue,\" continued\nAneed.\n     National distribution to Loblaws locations across Canada adds to\nAmara's strong retail footprint with distribution to many of North\nAmerica's leading big-box retailers, including; Whole Foods, Sprouts\nFarmer's Market, and more. Amara is focused on accelerating its omnichannel\nsales distribution strategy and continued growth across natural health food\nstores and traditional big-box retailers, in addition to ecommerce.\n     Eat Well Group's management believes Amara's growth can be attributed\nto the global trend of consumers seeking nutritious plant-based foods to\nadd into their everyday lifestyles, and Amara's delicious toddler snacks\nand baby foods being 100% organic with excellent taste. The infant\nnutrition market is estimated to reach over $109 billion globally by 20271,\nand Amara is poised to be a leader in the plant-based segment.\n     For 15% off and free shipping on Amara products valid until January\n31, 2022, visit www.amaraorganicfoods.com and enter the code:\nTASTETHEDIFFERENCE15\n     To learn more, join Eat Well Group's mailing list for important\nupdates.\n     ABOUT EAT WELL GROUP\n     Eat Well Group is a publicly-traded investment Company primarily\nfocused on high-growth companies in the agribusiness, food tech,\nplant-based and ESG (environmental, social and governance) sectors. Eat\nWell Group's management team has an extensive record of sourcing, financing\nand building successful companies across a broad range of industries and\nmaintains a current investment mandate on the health/wellness industry. The\nteam has financed and invested in early-stage venture companies for greater\nthan 25 years, resulting in unparalleled access to deal flow and the\nability to construct a portfolio of opportunistic investments intended to\ngenerate superior risk-adjusted returns.\n\n     Disclaimer for Forward Looking Statements\n     This news release contains \"forward-looking information\" and\n\"forward-looking statements\" within the meaning of applicable Canadian and\nUnited States securities laws (collectively, \"forward-looking\ninformation\"). Forward-looking information are often, but not always,\nidentified by the use of words such as \"seek,\" \"anticipate,\" \"believe,\"\n\"plan,\" \"estimate,\" \"expect,\" \"likely\" and \"intend\" and statements that an\nevent or result \"may,\" \"will,\" \"should,\" \"could\" or \"might\" occur or be\nachieved and other similar expressions. Forward-looking information in this\nnews release includes future anticipated business developments for the\ncompanies in which Eat Well Group invests. Forward-looking information is\nbased on assumptions that may prove to be incorrect, including but not\nlimited to the ability of the Company or its portfolio companies to execute\ntheir business plans. The Company considers these assumptions to be\nreasonable in the circumstances. However, forward-looking information is\nsubject to business and economic risks and uncertainties and other factors\nthat could cause actual results of operations to differ materially from\nthose expressed or implied in the forward-looking information. Such risks\ninclude, without limitation: the failure to negotiate and execute\nadditional investments in target industries, the ability of the Company to\ncomplete investments in a timely manner or at all; the receipt of requisite\napprovals to complete the additional investments; the ability of the\nCompany to realize the expected benefits and synergies of investments;\nunexpected disruptions to the operations and businesses of the Company and\ninvestee entities as a result of the COVID-19 global pandemic or other\ndisease outbreaks including a resurgence in the cases of COVID-19; the\nability of the Company to comply with applicable government regulations in\na regulated industry; any change in accounting practices or treatment\naffecting the consolidation of financial results adverse market conditions;\nthe inherent uncertainty of production and cost estimates and the potential\nfor unexpected costs and expenses; costs of inputs; crop failures;\nlitigation; currency fluctuations; competition; availability of capital and\nfinancing on acceptable terms; industry consolidation; loss of key\nmanagement and/or employees; and other risks detailed herein and from time\nto time in the filings made by the Company with securities regulators. For\nmore information on the Company and the risks and challenges of their\nbusinesses, investors should review their annual filings that are available\nat www.sedar.com.\n     The Canadian Securities Exchange has neither approved nor disapproved\nthe information contained herein and does not accept responsibility for the\nadequacy or accuracy of this news release.\n\n1https://www.globenewswire.com/en/news-release/2021/05/26/2236117/0/en/Glob\nal-infant-nutrition-market-size-to-register-10-6-CAGR-by-2027.html\n\nContacts:\nEat Well Investment Group Inc.\nMarc Aneed, CEO\nir@eatwellgroup.com\nwww.eatwellgroup.com\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200500769.MNPRE2200502072-07361120220106</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}