{"date": "2022-02-07 16:57:20.142000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3158.71, "close": 3223.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>Every day, we scour Amazon to find the best deals available. Whether it's something for your kitchen or top-rated tech to give your smart home an upgrade, the online shopping giant offers some of the best prices on a  <span>very</span> wide range of items. Whatever you need, Amazon has you covered.</p></div><div class=\"tr-npp-body\"><p><span><span>Get deals and shopping advice delivered straight to your phone.</span> Sign up for text message alerts from the experts at Reviewed.</span> </p><p>Below, you'll find our top Amazon deals today, including one of our favorite e-readers, some yummy candy and a multi-purpose vacuum, all of which have been vetted by our team of deals experts to make sure they're \"best of web\" prices. If you're looking for N95 and KN95 masks this winter, Amazon also has plenty of choices on sale right now, too.</p><p>► <span>Valentine's Day: </span> Shopping for your valentine? We've got deals on chocolates and so much more. </p><p>► <span>Presidents' Day:</span>  Shop the best deals on mattresses, appliances and everything in between ahead of the holiday.</p><p>If you're not already an Amazon Prime subscriber, you can sign up for a 30-day membership for free. An Amazon Prime subscription gets you free two-day shipping and tons of other benefits for $12.99 a month ($6.49 for students and $5.99 for those receiving qualifying government assistance).</p><p class=\"tr-npp-section-title\">The best Amazon deals of the day</p><p><big>1. 29% off: This compact smart display</big> </p><p>Bring your media streaming, video calls and music together in one compact device with Amazon's second generation Echo Show 5. Normally priced at $84.99, this smart home display can be yours for a $25 price cut at $59.99. When we tested the latest Echo Show 5, we were impressed with the improved camera that provided clear video calls and even offered home security video feeds. Not only is it compact enough to fit neatly on any kitchen counter or desk, but it's also made from post-consumer recycled plastics and fabrics.</p><p><span>Get the Amazon Echo Show 5 (Second Generation) for $59.99 (Save $25)</span> </p><p><big>2. Save $30: Our favorite Kindle</big> </p><p>The Amazon Kindle Paperwhite is our favorite Kindle and one of the best e-readers we've ever tested. Right now, you can pick up the 6.8-inch device and virtually flip through all your favorite books for $109.99—$30 off the full $139.99 list price. With the Paperwhite, you have access to the world's largest ebook store, allowing you to read thousands of titles, catch up on podcasts and even tune in to audiobooks when you connect a Bluetooth audio device. We appreciated the larger display screen compared to older devices and the crisp text said display offers. </p><p><span>Get the Amazon Kindle Paperwhite for $109.99 (Save $30)</span> </p><p><big>3. Up to 32% off: These Valentine's Day treats</big> </p><p>Pick up last-minute Valentine's Day goodies for your sweetheart right now at Amazon. Shop markdowns of up to 32% on chocolate, candy, caramel and more. Satisfy your valentine's sweet tooth with a box of Lindt Lindor milk chocolate truffles, down from $18.03 to $15.33 courtesy of a 15% price cut. Featuring 60 individually wrapped mouth-watering truffles—that's just over 25 cents a piece—these premium chocolates are sure to please. For another sweet sale, consider a 24-pack of Brach's Valentine's Day tiny conversation hearts. Usually priced at $13.66, you can get these classic candies for just $10.44 today. </p><p><span>Save up to 32% on Valentine's Day Treats</span>  </p><p><big>4. Less than $1,000: This streaming-ready 4K TV</big> </p><p>Get the best visual experience during your at-home Super Bowl viewing party this year with the Vizio M7 Series 4K TV. Typically listed for $1,299.99, this 75-inch smart screen can be yours for 23% off at $998. Vizio says the M7 features Quantum Color technology for more vibrant imagery than past models and Dolby Vision HDR for outstanding brightness and contrast. It also features the WatchFree+ streaming service built-in that features hundreds of channels of live TV you can access for no extra cost.</p><p><span>Get the Vizio 75-Inch M7 Series Premium 4K UHD Quantum Color LED HDR Smart TV for $998 (Save $301.99)</span> </p><p><big>5. 27% off: This multi-function vacuum</big> </p><p>Whether you've got carpet stains or pet hair on your floors, the Bissell Crosswave Pet Pro can help make your next round of home cleaning easier. Normally priced at $329.59, this wet dry vacuum and mop is now 27% off at $239.99. Bissell says the Crosswave can wash and vacuum solid surfaces including tile and sealed wood floors as well as cushy bases including carpets and rugs. For those with pets, the Crosswave picks up pet hair with ease thanks to a tangle-free brush roll and a pet hair strainer that also keeps it from getting tied up in the vacuum. </p><p><span>Get the Bissell Crosswave Pet Pro All in One Wet Dry Vacuum Cleaner and Mop for $239.99 (Save $89.60)</span> </p><p class=\"tr-npp-section-title\">The best Amazon deals from this week </p><p><big>1. Pure Egyptian Cotton Bed Sheets</big> </p><p>Easily elevate your bed by upgrading your old sheet set with luxurious, resort-style bedding on sale today. Pick up a pack of Pure Egyptian cotton bed sheets right now for as little as $66.29 for the twin size or just $74.79 for the queen size (a $33.20 markdown). These 1,000 thread count Egyptian cotton sheets feature a flat sheet, a deep-pocket fitted sheet and two sateen pillowcases. According to the brand, the sheets are made with fade resistant yarns and anti-pilling materials—so they're sure to last. Available in a variety of colors, this breathable bedding could be the perfect buy if you're looking to refresh your sleep set up. </p><p><span>Get the Pure Egyptian Cotton Bed Sheets from $66.29 with coupon (Save $31.70 to $38)</span> </p><p><big>2. Acer Aspire 5 Laptop</big> </p><p>Whether you're after a laptop that will make working from home easier or a processor that can keep up with your favorite computer games, the Acer Aspire 5 could be a great choice. This laptop features a 15.6-inch full HD display, a convenient backlit keyboard and Alexa connectivity. According to the brand, the device promises desktop-like performance and an extended battery life. Usually priced at $399.99, you can take home the home office essential right now for just $339.99 thanks to a 15% markdown. </p><p><span>Get the Acer Aspire 5 Laptop for $339.99 (Save $60)</span> </p><p><big>3. Samsung 55-Inch The Frame TV</big> </p><p>Upgrade your TV while adding some style to your bedroom or living room with Samsung's The Frame TV, on sale today. Typically listed for $1,499.99 for the 55-inch version, you can get this smart screen for just $997.99 today. Not only does it offer QLED HDR visuals, but the Samsung The Frame's Art Mode also lets you display purchasable pieces of art when you're not watching any shows or movies. It's both an entertainment hub and the perfect piece of home décor. Plus, with built-in Alexa capability, you'll be able to access it hands-free. </p><p><span>Get the Samsung 55-Inch The Frame TV for $997.99 (Save $502)</span> </p><p><big>4. Amazon Fire 4-Series TVs</big> </p><p>Give your home's media room a major visual upgrade with an Amazon Fire TV. Right now, you can shop the 4-series for as much as 30% off at Amazon. You can take home the 50-inch Amazon Fire 4-series 4K UHD smart TV for just $329.99—$140 off the full $469.99 list price. Better still, when you purchase the top-rated TV you can scoop an Amazon Echo Dot Third Generation (a $39.99 value) for free when you enter coupon code <span>FTVDOT22</span> at checkout. If you're looking for the latest device to connect to your Alexa, this TV fits the bill. </p><p><span>Save up to 30% on Amazon Fire 4-Series TVs and get a free Amazon Echo Dot with your purchase</span> </p><p><big>5. Fitbit devices</big> </p><p>If you're looking to keep a closer eye on your health and fitness progress, a fitness tracker could be a great buy. Luckily, Amazon has a variety of Fitbit devices on sale today for as much as 33% off. For instance, the Fitbit Luxe, normally priced at $149.95, is now down to as little as $99.95 courtesy of a 33% discount. The Luxe ranked among our favorite fitness trackers for its sleek design that resembles a piece of jewelry more than a smartwatch. In testing, we found that the tracker had a great mix of health and wellness features, making it easy to record information like heart rate, workout time, calorie burn and more.</p><p><span>Save up to 33% on select Fitbit Devices</span> </p><p class=\"tr-npp-section-title\">Other noteworthy Amazon deals we found </p><ul class=\"bulleted-list arrowlist\"><li>Lodge Pan Scrapers Two-Pack for $2.99 (Save $1.51)</li><li>Costa Farms 7-Inch Aloe Vera White-Natural Décor Planter for $13.01 (Save $7.98)</li><li>One month of Amazon Music Unlimited with an Echo Dot (3rd Generation) for $14.98 (Save $35)</li><li>Venus Visage Teeth Whitening Pen for $16.99 with coupon (Save $10)</li><li>InfinitiPro by Conair 1875 Watt 3-in-1 Ceramic Styler from $19.99 (Save $5 to $15)</li><li>Magicteam Sound Machines White Noise Machine for $23.99 (Save $6)</li><li>Pure Enrichment PureRelief XL Electric Heating Pad for $27.99 with coupon (Save $12)</li><li>Snow Joe SJ-SHLV20 20-Inch Back-Saving Telescoping Snow Shovel for $29.99 (Save $10)</li><li>AquaSonic Black Series Ultra Whitening Toothbrush for $36.95 (Save $23)</li><li>TurboTax Deluxe 2021 Tax Software Federal and State Tax Return PC Download for $39.99 (Save $20)</li><li>InvoSpa Shiatsu Electric Full Body Massager from $42.47 (Save $7.50 to $27.53)</li><li>Black + Decker BDH2000PL 20-Volt Max Handheld Vacuum for $69 (Save $20.99)</li><li>Instant Vortex 5.7-Quart Air Fryer for $79.95 (Save $20.04)</li><li>Amazon Echo Buds (Second Generation) for $79.99 (Save $40)</li><li>NOCO Boost Plus Jump Starter Box for $99.95 (Save $26)</li><li>Fitbit Charge 5 from $119.25 (Save $60 to $60.70)</li><li>Apple AirPods Pro for $179.99 (Save $69.01)</li><li>Apple Watch Series 7 45mm from $369.98 (Save $50 to $59.02)</li><li>Schwinn Fitness IC4 Indoor Cycling Exercise Bike for $798.98 (Save $401.02)</li><li>Sony A90J Bravia XR OLED 4K Ultra HD Smart Google TV from $2,298 (Save $501.99 to $2,001.99)</li> </ul><p><span><span>There's more where this deal came from.</span> Sign up for Reviewed's Perks and Rec newsletter and we'll keep 'em coming every Sunday through Friday.</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Updated daily: Here are the 10 best Amazon deals today</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}