{"date": "2022-01-21 00:01:00+00:00", "ticker": "ABDN", "mrkt_info": {"open": 238.3, "close": 237.8}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-by\">By Nick Carey</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">LONDON, Jan 21 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Electric vehicle (EV) battery startup Britishvolt has secured UK government backing for a battery plant in northern England, enabling 1.7 billion pounds ($2.31 billion) in private funding and boosting national efforts to build zero-emission cars.</p><p>Logistics real estate investor Tritax and investment firm abrdn plc <a href=\"reuters://REALTIME/Verb=FullQuote/ric=ABDN.L\" data-type=\"ric\" data-ric=\"ABDN.L\" translate=\"no\" dir=\"ltr\">ABDN.L</a> will provide the private funding for a 30 gigawatt-hour (GWh) plant in Blyth, Britishvolt said on Friday.</p><p>The government will deliver its finances through its Automotive Transformation Fund. Neither Britishvolt nor the government divulged the amount of state funding, but a source with knowledge of the matter, declining to be named, said it was believed to be around 100 million pounds. </p><p>\"This new battery factory will boost the production of electric vehicles in the UK,\" British Prime Minister Boris Johnson said in a statement, adding it would bring highly-skilled jobs to the industrial north.</p><p>Johnson's government has proposed an effective ban on fossil-fuel cars as of 2030 and has promised to be at the vanguard of the global shift to EVs.</p><p>But its ambitious goals have yet to draw sufficient investment and the country is lagging mainland Europe and Asia in its build up of EV infrastructure and supply chains.</p><p>Fully-electric cars accounted for 11.6% of UK sales in 2021 - more than the cumulative sales for 2016 to 2020 - and made up roughly a quarter of sales in December. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2TL0ZG\" data-type=\"storyId\" data-story-id=\"nL1N2TL0ZG\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span></p><p>The stakes are high <a href=\"https://www.reuters.com/world/uk/running-low-battery-power-brexit-britain-faces-an-acid-test-2021-07-20\" data-type=\"url\" class=\"tr-link\" translate=\"no\">for Brexit Britain</a>. To keep selling into the 27-nation European Union without tariffs, Britain’s car industry, which employs 170,000 people, must ensure EVs and the batteries that power them meet stringent rules of origin - with up to 70% of input in value terms coming from Britain or inside the EU. </p><p>Benchmark Mineral Intelligence (BMI) has forecast that Britain needs at least 175 GWh of battery cell capacity by 2035 to supply around 3 million fully-electric vehicles. </p><p>Aside from Britishvolt's 30 GWh plant, Japanese carmaker Nissan <a href=\"reuters://REALTIME/Verb=FullQuote/ric=7201.T\" data-type=\"ric\" data-ric=\"7201.T\" translate=\"no\" dir=\"ltr\">7201.T</a> plans a 9 GWh plant in Sunderland. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL5N2OD19W\" data-type=\"storyId\" data-story-id=\"nL5N2OD19W\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span>  </p><p>Britishvolt has begun advanced work on its planned 3.8 billion pound battery plant in Blyth and aims to start production in 2023. </p><p>\"This announcement is a major step in putting the UK at the forefront of the global energy transition,\" Britishvolt executive chairman Peter Rolton said in a statement.</p><p>A spokesperson said Britishvolt plans further fundraising as it continues with plans for an eventual public listing.</p><p>Its Blyth plant will be built in three phases and will reach peak production as a 30 GWh plant capable of producing battery packs for over 300,000 vehicles in 2027. </p><p>The startup says at full capacity the plant will directly employ around 3,000 people.</p><p>Britishvolt said it will make further announcements on customers and relationships with UK sports car brands over the coming weeks. </p><p>($1 = 0.7336 pounds)</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting By Nick Carey; editing by Barbara Lewis)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:nick.carey@thomsonreuters.com\" data-type=\"email\" translate=\"no\">nick.carey@thomsonreuters.com</a> ; +44 7385 414 954; ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2022. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: AUTOS-BRITISHVOLT/FACTORY (PIX)</p></div>"}