{"date": "2021-12-09 13:30:07.026000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3523.29, "close": 3483.42}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<h2 class=\"xn-hedline\">Continued relationship with Amazon Web Services empowers Bloomberg Data License clients to streamline their data pipeline on the cloud</h2>\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">NEW YORK, Dec. 9, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">NEW YORK</span>, <span class=\"xn-chron\">Dec. 9, 2021</span> /PRNewswire/ -- Bloomberg announced today that its Data License content is now available to clients on Amazon Web Services (AWS), enabling clients globally to receive content cloud-natively and dramatically reducing data on-boarding time. </p>\n\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/177195/bloomberg_logo.html\">\n                    <div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Bloomberg\" src=\"https://mma.prnewswire.com/media/177195/bloomberg_logo.jpg\" title=\"Bloomberg\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9tbWEucHJuZXdzd2lyZS5jb20vbWVkaWEvMTc3MTk1L2Jsb29tYmVyZ19sb2dvLmpwZw==&amp;key=dd45f3a2d25bd0b221ca0f0cb82a1fba4ab8b540b8076b61014c81ebf21696b9ba6d4252d620f6cbef27a9f3adcfc51324ed43722ec77255aefe33713d28b27b\"/></div></div>\n                        </a>\n                </p>\n\n    </div>\n<p>Building upon Bloomberg's existing relationship with AWS and <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3384524-1&amp;h=1509014681&amp;u=https%3A%2F%2Fwww.bloomberg.com%2Fcompany%2Fpress%2Fbloomberg-launches-real-time-data-in-the-cloud-for-global-clients%2F&amp;a=the+successful+launch\" data-type=\"url\" class=\"tr-link\" translate=\"no\">the successful launch</a> of its real-time data service, B-PIPE, on the cloud, Data License clients now have the cloud-native ability to receive Bloomberg OneData content, including reference, pricing, and regulatory data, as well as research, corporate actions and alternative data for over 50 million securities and 30 thousand fields. Bloomberg Data License clients can now integrate content directly into their AWS specific workloads from Bloomberg's data marketplace, <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3384524-1&amp;h=571075699&amp;u=https%3A%2F%2Fwww.bloomberg.com%2Fprofessional%2Fproduct%2Fenterprise-access-point%2F&amp;a=Bloomberg+Enterprise+Access+Point\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Bloomberg Enterprise Access Point</a>, while maintaining licensing and access controls, as well as consistency across their on-prem or other environments. Available for hosting on AWS S3 and integrated with a variety of AWS services, like AWS Simple Notification Service (SNS), the solution enables clients to kick start innovation and automate legacy data ingestion workflows.</p>\n<p>Receiving Data License content cloud-natively allows users to access both Bulk (subscription based) datasets and customer specified \"Per Security\" datasets directly from client environments using APIs. Data License content is stored in dedicated S3 object stores and enables access via S3 native APIs. This approach allows customers to establish processes to automatically nourish their data lakes upon delivery of bulk files, saving time during nightly processing. Using Bloomberg's RESTful APIs, both users and applications residing further up the technology stack may specify security and field level data required. Bloomberg delivers the data to AWS environments in an analysis-ready format, allowing customers use our native AWS SNS integration to trigger serverless processes to automatically kick-start analysis in cloud-native tools or applications built for the cloud. </p>\n<p>\"As financial professionals move workloads to the cloud, they are looking for flexible and efficient end-to-end integration. They seek a data partner that offers discoverability, clear access control, and interface flexibility alongside high-quality data and metadata to facilitate rapid cloud integration,\" said <span class=\"xn-person\">Cory Albert</span>, Head of Cloud Strategy for Enterprise Data at Bloomberg. \"Bloomberg has long been committed to simplifying the process of data usage using proven technologies to solve client challenges and support their data needs. We've seen tremendous adoption of our real-time solution on the cloud across the front office and are happy to add Data License content to our cloud-native offerings so that clients benefit across the front-, middle- and back-office.\" </p>\n<p>The availability of Data License content on the cloud with AWS will complement Bloomberg's existing solutions, including Bloomberg Enterprise Access Point and the Hypermedia API. Beyond the discovery of content through Bloomberg Enterprise Access Point, clients can also use the web-based marketplace to purchase data, use multiple delivery mechanisms that meet the demands of hybrid environments, and streamline ingestion when using the AWS cloud all with consistent controls and access.  </p>\n<p><span class=\"xn-person\">Sachio Hayashi</span>, Executive Officer at Sony Bank (and head of the Accounting Department and Risk Management Department), using Bloomberg's evaluated pricing via this cloud native solution said, \"We believe this service brings both operational and systemic benefits. In terms of operations, it provides traders with the same data that is used by the middle office for market valuation, enabling them to grasp a company's \"official valuation\"—an evaluation based on financial and managerial accounting—in close to real time. From a systems perspective, we have been connecting multiple external applications to our in-house systems, but we now intend to simplify this set up, which we expect will reduce system update and maintenance costs.\"</p>\n<p>\"Bloomberg continues to make it easier for its clients to access and use data to drive business insights,\" said <span class=\"xn-person\">Scott Mullins</span>, Managing Director, Worldwide Financial Services Business Development at Amazon Web Services. \"We are excited to expand our collaboration to help Bloomberg enhance its data delivery capabilities on the most secure, reliable, and flexible cloud computing environment in the world.\"</p>\n<p><b>About Bloomberg<br/></b>Bloomberg, the global business and financial information and news leader, gives influential decision makers a critical edge by connecting them to a dynamic network of information, people and ideas. The company's strength – delivering data, news and analytics through innovative technology, quickly and accurately – is at the core of the Bloomberg Terminal. Bloomberg's enterprise solutions build on the company's core strength: leveraging technology to allow customers to access, integrate, distribute and manage data and information across organizations more efficiently and effectively. For more information, visit <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3384524-1&amp;h=3059408894&amp;u=http%3A%2F%2Fwww.bloomberg.com%2F&amp;a=www.bloomberg.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.bloomberg.com</a></u> or request a demo.</p>\n<p> </p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n</div>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=NY01933&amp;sd=2021-12-09\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1OWTAxOTMzJnNkPTIwMjEtMTItMDk=&amp;key=9c570ff89de6b8fe41802b46630f8423f984e6bc437b4e2aee3aaeafba3de35a1f1419ace15aa5061e873ed71fa4254db56fef74e64668333069d4d35bf27165\"/></div></div> View original content to download multimedia:<a href=\"https://www.prnewswire.com/news-releases/bloomberg-makes-data-license-content-available-on-the-cloud-301441180.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/bloomberg-makes-data-license-content-available-on-the-cloud-301441180.html</a><p></p>\n<p>SOURCE  Bloomberg</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: BLOOMBERG-CloudAvail</p></div>"}