{"date": "2021-12-12 00:09:45.331000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3444.24, "close": 3381.83}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>ST. LOUIS (AP) — At least two people in Missouri have died and hundreds of homes and buildings are damaged or destroyed after a massive Friday night stormfront that killed dozens in several states, Gov. Mike Parson's office said Saturday.</p><p>Mark Borgmann told the St. Louis Post-Dispatch that a tornado killed his mother and injured his father overnight in St. Charles County. His parents, Ollie and Vernon Borgmann, both 84, were at home when the tornado hit. The tornado swept his parents' single-story home and a neighbor's house off their foundations, scattering debris at least a half-mile. Parson's office said two others in St. Charles County were hospitalized.</p></div><div class=\"tr-npp-body\"><p>Parson's office said that a young child was killed at home and at least nine people were transported to hospitals in Pemiscot County in the Bootheel region.</p><p>The storm system's death toll includes people in a Kentucky candle factory, an Arkansas nursing home, an Illinois Amazon facility east of St. Louis and others in Tennessee.</p><p>Overnight Friday, the National Weather Service issued 31 tornado warnings for Missouri, the governor's office said.</p><p>National Weather Service workers themselves had to take shelter as a tornado passed near their office in Weldon Spring, Missouri, about 30 miles west of St. Louis. Weather service teams on Saturday were surveying storm damage.</p><p>Parson and emergency management officials plan to vist St. Charles and Pemiscot counties Sunday to assess damage.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.</p></div>"}