{"date": "2021-12-14 15:11:25.628000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3391.35, "close": 3466.3}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>USANA HEALTH SCIENCES INC (\"USNA-N\")\n- 4 Ways to Enhance Career in 2022\n\n     As the pandemic lingers, professionals are urged to take four actions\nto enhance their careers in 2022.\n\n     \"In my role, I see professionals serious about their progress master\nfour key practices,\" said Kevin Guest, chairman and CEO of USANA Health\nSciences (NYSE: USNA), a billion-dollar company operating in 24 countries.\n\n     From a lifetime of experiences shared in his bestseller, \"All the\nRight Reasons, 12 Timeless Principles for Living a Life in Harmony,\" Guest\nshares key steps to improve one's career whether returning to the workplace\nor working remotely.\n\n     First, experts across broad industries agree networking is key to\nsuccess.\n\n     \"It's no secret that the most successful professionals are the most\nconnected. Fact is most people choose to work with people they like. The\nmore people you know, the better your opportunities to succeed,\" said\nGuest. \"If it's unpleasant to meet strangers, make a game of it, make it\nfun and find ways to help others. Share ideas and see how strangers become\ncolleagues who become friends and can enhance experiences on your career\npath.\"\n\n     Highlighting the value of networking and relationship building, Guest\nwrites in his book, \"On a pop quiz, a college professor asked: 'What is the\nname of the woman who cleans this building?' The professor was emphasizing\nthat in life, nothing is more important than relationships, which includes\nbeing respectful, even to the point of knowing someone's name.\n\n     \"Class members were stumped by the question but learned the woman's\nname was Dorothy, so I have created the Dorothy Principle to remind us to\nput relationships first because treating others with the utmost respect and\nkindness is a key to success that makes life more harmonious for everyone.\"\n\n     Leading professionals around the world, Guest sees successful\nprofessionals are also intent on keeping their skills up to date.\n\n     \"More than ever, we have tools, technology and access to keep skills\ncurrent and to push them to the next level,\" he said. \"No matter your\nsituation, if workers do not improve skills, they will be quickly left\nbehind in today's fast-paced environment.\"\n\n     To those who feel disadvantaged because of their situation, Guest\ncites Rwandan Immaculee Ilibagiza in what he calls the \"Cardboard Keyboard\"\nprinciple.\n\n     After Rwanda's genocide in 1994, Hutu fighters hunted Ilibagiza, who\nfled for protection. Even with killers outside her window calling her name,\nshe stayed positive, was rescued, traveled to Rwanda's capital and applied\nfor a United Nations job for weeks with no luck.\n\n     \"Immaculee told herself she could master English, which would increase\nemployment opportunities, so she drew a computer keyboard on cardboard and\nspent hours learning how to type,\" he said. \"After weeks of determination\nto learn English, countless attempts to get that job and positive\nself-talk, she was hired.\"\n\n     Increasing visibility in the industry ranks third on the list of\nimproving one's career in 2022.\n\n     \"Being known in your company as a results-oriented problem-solver is\nvital. Sharing your talent with others in the industry only increases your\ncredibility and esteem,\" he said. \"Look for opportunities to write\narticles, post insights on social sites and speak up in meetings. Everyone\nhas something to share, and actively setting a schedule to share\nprofessional perspectives can position you as a leader.\"\n\n     Progressive companies have an awards strategy, which positively\nbenefits the company, the teams and their customers. Guest says the same\nstrategy can work for the individual.\n\n     \"Apply for awards to enhance your career,\" Guest said. \"Awards and\nrecognition are third-party endorsements that speak to a person's talent\nand value. But it's not about the fancy trophy; it's about others affirming\nthat you are the best at what you do, which helps define you and\nstrengthens your personal brand identity.\n\n     \"This fourth step has incredible ROI because it can open doors and\nexpand your network of colleagues. Again, the point is to increase\nword-of-mouth endorsements and referrals, which is fast-tracked by winning\nawards in your field of expertise.\"\n\n     Designed to help others find keys to successful careers and life, All\nthe Right Reasons reveals 12 principles for living a life in harmony. All\nproceeds from sales of the bestseller are aimed at feeding two million\nmeals to hungry children. Available on Amazon, the book provides 40 meals\nfor each single purchase.\n\n     For more information, visit www.kevinguest.com.\n\n     MEDIA CONTACT: Tim Brown, Candid Communications tim@candidcom.com\n801-557-1466 m\n<a href=\"http://www.usanahealthsciences.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.usanahealthsciences.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2134700220.MNPRE2134701762-06494820211214</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}