{"date": "2020-12-10 12:36:36+00:00", "ticker": "AAF", "mrkt_info": {"open": 93.9, "close": 93.4}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-story-p1\"><span class=\"tr-dateline\">LAGOS, Dec 10 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>Nigeria has directed all telecommunications firms, including giants such as Airtel and MTN, to stop selling SIM cards while it audits rule compliance, according to a statement from the Nigeria Communications Commission. </p><p>The statement did not indicate how long the audit would take but said the NCC could grant exemptions \"where it is absolutely necessary.\"</p><p>\"Mobile Network Operators (MNOs) are hereby directed to immediately suspend the sale, registration and activation of new SIM Cards until the audit exercise is concluded, and government has conveyed the new direction,\" the statement said. </p><p>It said the audit would check whether companies were complying with SIM card registration rules.</p><p>Nigeria created the SIM card registration rules in an attempt to stop terrorists and criminals from using unregistered SIM cards.</p><p>Other Nigerian carriers affected by the announcement include 9Mobile and Globacom Ltd.</p><p>MTN said it stopped the sale, registration and activation of SIM cards as directed. \"We regret the inconvenience this will cause some of our customers and are committed to working with the NCC to complete the planned audit in an efficient and seamless manner\". </p><p>Airtel did not immediately respond to a request for comment.</p><p>In 2015, the communications regulator handed MTN Nigeria a 1.04 trillion naira fine for failing to disconnect unregistered SIM cards, but MTN negotiated a reduced fine to clear its path to list on the Nigerian Stock Exchange.</p><p><br/></p><p><br/></p><p><br/></p><p class=\"tr-signoff\"> (Reporting By Libby George; Editing by Steve Orlofsky)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:Libby.George@thomsonreuters.com\" data-type=\"email\" translate=\"no\">Libby.George@thomsonreuters.com</a> ; +234 809 065 5059 ; Reuters Messaging: <a href=\"mailto:libby.george@thomsonreuters.com\" data-type=\"email\" translate=\"no\">libby.george@thomsonreuters.com</a> ))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2020. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NIGERIA-TELECOMS/</p></div>"}