{"date": "2021-12-15 09:53:18.967000+00:00", "ticker": "AVV", "mrkt_info": {"open": 3333.0, "close": 3271.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>Dubai, UAE – AVEVA, a global leader in industrial software, driving digital transformation and sustainability, has announced the expansion of its Middle East executive leadership team with the appointment of Nayef Bou Chaaya as the company’s Vice President Sales and Head of Middle East and Africa. The new appointment strengthens AVEVA’s partner and customer relations at a time when the company is facilitating digital transformation for an increasing number of industrial businesses in the region and around the world.</p>\n<p>Bou Chaaya is a seasoned executive management professional with three decades of software sales experience, focused on the oil &amp; gas, energy, infrastructure and food &amp; beverage sectors. He joins from Schneider Electric, where he led Process Automation Business Development in the Middle East, preceded by various senior sales and operations leadership positions within Schneider Electric and Invensys.</p>\n<p>Raised in Lebanon, Bou Chaaya holds a bachelor’s degree in computer science from Lebanese American University and will be based in Dubai. AVEVA will leverage his deep expertise to lead the MEA organization and to help partners around the world to strengthen their operational and environmental sustainability.</p>\n<p>“We welcome and look forward to the strategic direction and dynamic leadership Nayef Bou Chaaya will bring to the one of AVEVA’s key markets,” said Caspar Herzberg, Chief Revenue Officer, AVEVA.</p>\n<p>Bou Chaaya said, “I’m looking forward to joining AVEVA at an exciting time when the company is driving digital transformation and sustainability in the region.</p>\n<p>“Momentum across the Middle East and Africa has been building around accelerating the use of advanced technologies to achieve climate neutrality. AVEVA has been at the forefront of the trend, having pioneered innovations that optimize performance, efficiency and sustainability over several decades. I am delighted to be tasked with strengthening and driving the delivery of our game-changing software and services across the region and beyond.”</p>\n<p>-Ends-<strong> </strong></p>\n<p><strong>About AVEVA</strong></p>\n<p><span>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence.  AVEVA’s comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries. Learn more at <a href=\"http://www.aveva.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.aveva.com</a>. </span></p>\n<p><span>Copyright © 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</span></p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Â© Press Release</p></div>"}