{"date": "2022-01-12 18:42:04.362000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3307.24, "close": 3224.28}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MOGO INC (\"MOGO-TQ\")\n- Appoints Senior Tech Executive as Chief People Officer\n\n    Mogo Inc. (\"Mogo\" or the \"Company\"), a digital payments and financial\ntechnology company, announced the appointment of highly experienced leader\nAllan Smith to the newly created role of Chief People Officer.\n\n    Smith brings to Mogo 15 years of expertise as an analytical human\nresources leader with global experience in progressively demanding\nleadership roles in Fortune 50 as well as hyper-growth SaaS and fintech\ncompanies. Most recently, Smith served as Senior Director for fintech\nleader SoFi (NASDAQ:SOFI), where he led the people function across SoFi\nInternational and its subsidiary Galileo. Previously, he held multiple HR\nleadership roles with Amazon (NASDAQ:AMZN) over a 7-year period of rapid\ngrowth. Smith also led a geographically dispersed global HR team for\nAnaplan and served as Senior HR Business Partner with Veeva Systems. He has\nan MBA in Organizational Behavior/Human Resource Management from Brigham\nYoung University.\n\n    \"We've been fortunate to attract and build an outstanding team at Mogo,\nand we're excited to have Allan lead our people efforts going forward as we\nlook to significantly expand our organization while continuing to retain\nand advance top talent,\" said David Feller, CEO of Mogo. \"We believe his\nexperience in building world-class teams in fintech and fast-growing\nsoftware companies will make him a highly impactful new addition to our\nleadership team.\"\n\n    \"Having worked at multiple high-growth, world-class organizations, I\nwas attracted to Mogo's strong position in the Canadian market, their\ngrowth trajectory, and their vision to build a next-generation financial\nplatform,\" said Allan Smith. \"They have also assembled a talented and\npassionate team, and I look forward to building on this strong base to\nsupport the continued growth of the business.\"\n\n    About Mogo\n\n    Mogo is empowering its close to 1.8 million members with simple digital\nsolutions to improve their finances. Through the free Mogo app, consumers\ncan access a digital spending account with Mogo Visa* Platinum Prepaid\nCard, the only card of its kind in Canada. The MogoCard makes it easy to\nenjoy spending control while doing good for the planet by planting a tree\nfor every purchase. The Mogo app also enables you to easily buy and sell\nbitcoin, get free monthly credit score monitoring and ID fraud protection,\nand access personal loans. Mogo's wholly-owned subsidiary, Carta Worldwide,\nalso offers a digital payments platform that powers the next-generation\ncard programs from innovative fintech companies in Europe, North America\nand APAC, while Mogo's wholly-owned subsidiary Moka is bringing automated,\nfully-managed flat-fee investing to Canadians from coast to coast. To learn\nmore, please visit mogo.ca or download the mobile app (iOS or Android).\n\n Contact Information:\n\nCraig Armitage\nInvestor Relations\ncraiga@mogo.ca\n(416) 347-8954\nUS Investor Relations Contact\nLytham Partners, LLC\nBen Shamsian\nNew York | Phoenix\n646-829-9701\nshamsian@lythampartners.com\n\nTel   : 604-659-4380    MOGO FINANCE TECHNOLOGY INC\nFax   : 604-733-4944\nEmail : investors@mogo.ca\nWWW   : <a href=\"http://www.mogo.ca\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.mogo.ca</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201100427.MNPRE2201102047-09230220220112</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}