{"date": "2021-11-23 15:42:00.341000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MINIM INC (\"MINM-Q\")\n- The Perfect Gamer Gifts: Motorola WiFi 6 Gateway Series\n- Launches for Cable Subscribers\n\n   Minim Inc., the creator of intelligent networking products under the\nglobally recognized Motorola brand, today introduces its high-speed WiFi 6\nmodem/router series in time for gamer gifting. The Motorola MT8733 and\nMotorola MG8725 each saves homes up to $1681 in annual modem rental fees\nand gives gamers a leading edge with multi-gigabit DOCSIS 3.1 speed, a\npowerful AX6000 router, and the motosync app for malware and ad blocking.\n\n   \"The holiday season is here with an expected strong showing for consumer\ntechnology gifting,\" said Gray Chynoweth, CEO of Minim. \"At the same time,\nnearly half of holiday shoppers are concerned that they will have\ndifficulty finding items-- particularly in gaming gear. We hope shoppers\nwill turn to giving the gift of great internet. Our new AX modem/routers\njoin our top-selling portfolio of Motorola networking devices, including\nthe Motorola MG8702 with the motosync app, a best-selling cable\nmodem/router in Amazon. They're great gifts for gamers.\"3\n\n   Motorola MT8733: High-Speed Gateway for Xfinity Voice Subscribers\n\n   The Motorola MT8733 is a high-performance modem/router designed\nexclusively for Comcast Xfinity customers, offering Xfinity Voice support.\nNow available on MotorolaNetwork.com, Amazon and Best Buy online for\n$409.99, this product delivers:\n\n   ?      DOCSIS 3.1 support\n\n   ?      Built-in AX6000 4x4 router\n\n   ?      One 2.5 Gig Ethernet port and three 1 Gig Ethernet ports for\nwired connections\n\n   ?      Two phone lines for reliable communications and support for\nComcast's enhanced call features, including caller ID, call forwarding, and\nconference calling\n\n   ?      motosync app for advanced network management, security, parental\ncontrols, and more-- included at no additional charge\n\n   ?      2-year warranty\n\n   Motorola MG8725: Premium Performance, Competitive Pricing\n\n   The Motorola MG8725 is the \"luxury car\" of cable modem/routers with a\ncompetitive price point for Xfinity, Spectrum, and Cox Subscribers. This\nhardware model was the first to receive the Low Latency DOCSIS (LLD)\ncertification by CableLabs, making it LLD ready (requires a firmware update\nwhen supported and certified by cable providers). The Motorola MG8725 is\nnow available on MotorolaNetwork.com and is expected on Amazon in time for\nCyber Monday for $399.994. This product delivers:\n\n   ?      DOCSIS 3.1 support\n\n   ?      Built-in AX6000 4x4 router\n\n   ?      One 2.5 Gig Ethernet port and three 1 Gig Ethernet ports for\nwired connections\n\n   ?      motosync app for advanced network management, security, parental\ncontrols, and more\n\n   ?      2-year warranty\n\n   \"Low latency is essential to gamer accuracy,\" said top YouTube tech\ninfluencer, Shane Starnes2. \"Latency higher than 30 ms will put your device\na few seconds behind your opponent, making it nearly impossible to hit a\nmoving target and perform to your fullest potential.\"\n\n   Shoppers can expect a WiFi 6 modem/router deal this holiday season. To\nget the latest promotions, sign up for Deal Alerts here.\n\n   1 Savings based on $14 average monthly rental fee for Comcast Xfinity\nservice. Savings will vary by service plan and/or service provider. Check\nyour local service plans.\n\n   2 Shane Starnes received compensation in exchange for reviewing the\nMotorola MH7603 WiFi 6 System on YouTube.\n\n   3 Holiday shopping predictions cited from NPD and National Retail\nFederation. As of November 22, 2021, the MG8702 is on Amazon's Best Seller\nList for Cable Modem/Router Combo devices.\n\n   4 Pricing is determined by the retailer and is subject to change.\n\n   About Minim\n\n   Minim, Inc. (NASDAQ: MINM) is the creator of intelligent networking\nproducts that dependably connect people to the information they need and\nthe people they love. Headquartered in Manchester, NH, the company delivers\nsmart software-driven communications products under the globally recognized\nMotorola brand and Minim(R) trademark. Minim end users benefit from a\npersonalized and secure WiFi experience, leading to happy and safe homes\nwhere things just work. To learn more, visit <a href=\"https://www.minim.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.minim.com</a>.\n\n   MOTOROLA and the Stylized M Logo are trademarks or registered trademarks\nof Motorola Trademark Holdings, LLC and are used under license.\n\n Contact Information:\n\nContact:\n   Nicole Zheng at (908) 337-2481 or nicole@minim.com\n\n   Investor Relations Contact:\n\n   James Carbonara, Hayden IR at (646) 755-7412 or james@haydenir.com\n\n   About Motorola Strategic Brand Partnerships\n\n   For over 90 years the Motorola brand has been known around the world for\nhigh quality, innovative and trusted products. Motorola's Strategic Brand\nPartnership program seeks to leverage the power of this iconic brand by\nteaming with dynamic companies who offer unique, high quality products that\nenrich consumers' lives. Strategic brand partners work closely with\nMotorola engineers while developing and manufacturing their products,\nensuring that their products meet the exacting safety, quality, and\nreliability standards that consumers have come to expect from Motorola. To\nlearn more about Motorola strategic brand partnerships, follow us\n@ShopMotorola.\n\n   Forward-Looking Statements\n\n   This press release contains \"forward-looking statements\", within the\nmeaning of the safe harbor provisions of the U.S. Private Securities\nLitigation Reform Act of 1995.  Such forward-looking statements relate to\nMinim's plans, expectations, and intentions. Actual results may be\nmaterially different from expectations as a result of known and unknown\nrisks, including: risks associated with Minim's potential inability to\nrealize intended benefits of the acquisition by merger of Zoom\nConnectivity, Inc.; the potential increase in tariffs on the company's\nimports; the potential supply interruptions from manufacturing the\ncompany's products in Vietnam; risks relating to global semiconductor\nshortages; potential changes in NAFTA; the potential need for additional\nfunding which Minim may be unable to obtain; declining demand for certain\nof Minim's products; delays, unanticipated costs, interruptions or other\nuncertainties associated with Minim's production and shipping; Minim's\nreliance on several key outsourcing partners; uncertainty of key customers'\nplans and orders; risks relating to product certifications; Minim's\ndependence on key employees; uncertainty of new product development,\nincluding certification and overall project delays, budget overruns; the\nrisk that newly introduced products may contain undetected errors or\ndefects or otherwise not perform as anticipated; costs and senior\nmanagement distractions due to patent related matters; risks from a\nmaterial weakness in our internal control over financial reporting; the\nimpact of the COVID-19 pandemic; and other risks set forth in Minim's\nfilings with the Securities and Exchange Commission. Minim cautions readers\nnot to place undue reliance upon any such forward-looking statements, which\nspeak only as of the date made. Minim expressly disclaims any obligation or\nundertaking to release publicly any updates or revisions to any such\nstatements to reflect any change in Minim's expectations or any change in\nevents, conditions or circumstance on which any such statement is based.\n                         ______________________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2132600344.MNPRE2132601749-07340320211123</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}