{"date": "2022-01-13 14:31:11.762000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3307.24, "close": 3224.28}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>UMAX GROUP CORP (\"UMAX-0\")\n- Season 2 of Comedy Specials in Downtown LA\n\n     UMAX Group Corp. a Nevada corporation, has announced Season 2 of its\ncomedy specials under its Funny Media Group imprint. FMG will commence\nfilming March 6, 2022, with a goal of 100 specials.\n\n     After the acquisition of Funny Media Group in May 2021, UMAX has now\nfully transitioned into comedy development as the vehicle to achieve a\ncash-flow positive operation and to provide the best return on\nshareholder's investment.\n\n     Rondell Fletcher (UMAX President and CEO) says Season 2 will feature\nnew comedians, new sets, new graphics, and a new energy.\n\n     \"We literally have comedians calling us and texting us every single\nday to get in on Season 2,\" Fletcher says. \"We've made some changes to the\nlook, and we are excited to get started.\"\n\n     Season One featured 206 total specials, 75 of which have been released\non YouTube. Those specials have racked up more than 1.8M views and FMG is\non pace to hit 100,000 subscribers in a few months.\n\n     \"People are loving this project,\" Fletcher says. \"Both the viewers and\nthe comedians themselves and the stature of the Comedy Cube has risen\nfast.\"\n\n     The \"Comedy Cube\" is the 6,000-sq.ft. location in Downtown Los Angeles\nwhere all the specials are taped.\n\n     Fletcher announced that FMG will also co-sponsor Laughter Hours-aka\nSteven Briggs Comedy Night. This once-a-month comedy project includes\nmusical entertainment, new and upcoming comics, and an array of sponsors.\n\n     Mr. Fletcher has an extensive background in production and media. He\nhas owned his own production studio in Los Angeles for the past 20 years\nand has produced national shows for CNN, FOX, Food Network and Comedy\nCentral, among others.\n\n     The short-term goal for Funny Media Group is to produce content for\nstreaming services such as Netflix and Amazon with the long-term goal of\nbuilding a large media catalog for acquisition.\n\n     About Us\n\n     UMAX Group Corp. is a Nevada corporation, is a public-quoted Pink\nSheet issuer under the ticker symbol \"UMAX\". UMAX reports as an alternative\nreporting issuer with OTC Markets Group, Inc. and is current in its\nmandatory required filings (E.g., \"Pink Sheet Current\").\n\n     Disclaimer Regarding Forward Looking Statements\n\n     Certain statements that we make may constitute \"forward-looking\nstatements\" under the Private Securities Litigation Reform Act of 1995.\nForward-looking statements include information concerning future?strategic\nobjectives, business prospects, anticipated savings, financial results\n(including expenses, earnings, liquidity, cash flow and capital\nexpenditures), industry or market conditions, demand for and pricing of our\nproducts, acquisitions and divestitures, anticipated results of litigation\nand regulatory developments or general economic conditions.? In addition,\nwords such as \"believes,\" \"expects,\" \"anticipates,\" \"intends,\" \"plans,\"\n\"estimates,\" \"projects,\" \"forecasts,\" and future or conditional verbs such\nas \"will,\" \"may,\" \"could,\" \"should,\" and \"would,\" as well as any other\nstatement that necessarily depends on future events, are intended to\nidentify forward-looking statements. Forward-looking statements are not\nguarantees, and they involve risks, uncertainties, and assumptions.\n?Although we make such statements based on assumptions that we believe to\nbe reasonable, there can be no assurance that actual results will not\ndiffer materially from those expressed in the forward-looking statements.?\nWe caution investors not to rely unduly on any forward-looking?statements.\n\n     Company Information:\n\n     UMAX Group Corp.\n\n     2020 Bay Avenue\n\n     Los Angeles, California 90021\n\n     Web: New website under construction\n\n     Website: <a href=\"https://funnymediagroup.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://funnymediagroup.com</a>/\n\n     Instagram: <a href=\"https://www.instagram.com/funnymediagroupofficial/?hl=en\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.instagram.com/funnymediagroupofficial/?hl=en</a>\n\n     YouTube:https://www.youtube.com/c/FunnyMediaGroup\n\nContact Information:\n\nContact: Jack Zietz\n\nEmail: investors@umaxgrpcorp.com\n\nTel   : 714-325-2123    UMAX GROUP CORP\nWWW   : <a href=\"http://www.umaxcorp.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">http://www.umaxcorp.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201200630.MNPRE2201201807-06303820220113</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}