{"date": "2022-01-17 11:00:31.122000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3178.35, "close": 3033.35}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Here's a list of offers you can avail on Amazon and Flipkart, as part of their Republic Day sale.</p><p>Following yesterday's Prime-exclusive deals, Amazon's Great Republic Day sale is now live for everyone. The sale will be live until January 20, and see great discounts on a range of products such as electronics, fashion, beauty products, and more. On the side, Flipkart is running their Big Saving Days sale as well, which runs until January 22, 2022. Here are the best deals you can avail on gadgets.</p></div><div class=\"tr-npp-body\"><p>Note: On Amazon, owners of an SBI (State Bank of India) credit cards get an instant 10 percent discount of up to Rs 1,750 on all purchases. On Flipkart, ICICI Bank card holders get 10 percent off.</p><p>Samsung Galaxy S20 FE 5G</p><p>As weird as it sounds, the Galaxy S20 FE is not a cheaper variant of the S20, but rather, an entirely different phone that Samsung is trying to market as \"affordable flagships.\" And at a price of Rs 36,990, it comes with all the bells and whistles such as a Snapdragon 865 processor, coupled with 8GBs of RAM and 128GBs of storage. The backside, which is plastic, houses a triple-camera setup – a 12MP main sensor, 8MP telephoto, and 12MP ultra-wide lens. The full-HD AMOLED display measures 6.5-inches and offers a 120Hz variable refresh rate.</p><p>The Mi Notebook 14 is targeted at those wanting a decent performing, thin, everyday laptop at an affordable cost. On Amazon, it is currently listed at Rs 49,990 – a 24 percent price drop, and comes packed with a 10th Gen Intel Core i7, that should handle heavy-threaded workloads with ease. For discrete graphics, it relies on an NVIDIA MX350 GPU, which can help the occasional low-end gaming. For storage, you get a 512GB SSD only, and it includes an 8GB DDR4 RAM that is not expandable. The bezels are extremely thin, though at the cost of no in-built webcam.</p><p>Samsung Galaxy Tab S7 FE</p><p>The Galaxy Tab S7 FE takes the cake in the premium tablet segment, offering decent hardware, an S-Pen for writing/drawing, and is extremely slim and lightweight. The Android-based device is priced at Rs 37,999, and comes in a 4G RAM + 64GB storage option. This is further expandable to 1TB via a microSD card. The 12.4-inch screen is sufficiently large and vibrant, thanks to its cinematic 16:10 aspect ratio that offers resolutions of 2560 x 1600. It uses a Snapdragon 750G processor that is capable of handling several Chrome tabs, and comes packed with an 8MP rear camera and a 5MP front.</p><p>Sony WH-1000XM3 headphones</p><p>Sony has been doing well in its industry-grade headphone category, with great noise cancelling options. The WH-1000XM3 adds a USB Type-C charging port and deeper ear pads that entirely cushion your earlobes. As part of the sale, the headphones are priced at Rs 15,990, and feature powerful 40mm drivers that offer rich sounds that, sort of, \"jump at you.\" The controls are fully touch-sensitive, and with the Sony Headphones Connect companion app, you get a range of additional features. One can adjust the equaliser, position the sound source, and even optimise noise cancellation based on the surrounding environment.</p><p>ASUS ROG Strix G17 (2021)</p><p>The Strix G17, as the name suggests, provides a 17.3-inch screen real estate that is ideal for gaming enthusiasts. The AMD Ryzen 7 4800H offers enough horsepower for 1080p streaming, which is then paired with an RTX 3050 GPU. The laptop does not come with a hard drive as an additional storage option, but you do get a 512GB SSD. For memory, you get 16GB of DDR4, running at 3200MHz, which is about the maximum it can get. The display hosts a 144Hz refresh rate, and the laptop is priced at Rs 90,990. Amazon is also offering a Rs 1000 coupon code which gets applied during checkout.</p><p>Samsung Galaxy Buds Pro</p><p>Samsung's latest offering in the audio segment, the Galaxy Buds Pro brings intelligent ANC that lets one seamlessly switch between noise-cancelling and ambient sounds. It has a Voice Detect feature that instantly switches between the two upon detecting the wearer's voice. The buds are priced at Rs 8,990 – a 50 percent drop, and provide 5 hours of uninterrupted playback on single charge, with an additional 13 hours with the case. You get the standard touch controls, noise-free calling with 3 in-built microphones, and an IPX7 rated water resistance.</p><p>Apple iPhone 12 Mini</p><p>The iPhone 12 Mini is great for those looking to get a compact phone with premium design and hardware. The device features a 5.4-inch Super Retina OLED screen, with thin bezels that offer an 85 percent screen to body ratio. At its core, you have an Apple-design A14 Bionic chipset with 4GB RAM. On Flipkart, you can buy the 64 GB storage option for Rs 41,999, while the larger 256GB option is available at Rs 64,999. The phone has a rear dual-camera setup – 12MP wide and 12MP ultra-wide lenses, and another 12MP at the front for selfies and video calling.</p><p>Copyright 2022 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}