{"date": "2021-11-17 20:18:18.762000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3540.7, "close": 3696.06}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\">\n<p>AAP Rolling News Bulletin for Nov 18 at 0730</p>\n</div>\n<div class=\"tr-npp-body\">\n<p>UK Amazon (LONDON)</p>\n<p>Amazon.com Inc will stop accepting Visa Inc credit cards issued in the United Kingdom from next year because of the high transaction fees charged by the payment processor, the e-commerce giant says.</p>\n<p>\"As a result of Visa's continued high cost of payments, we regret that Amazon.co.uk will no longer accept UK-issued Visa credit cards as of 19 January, 2022,\" an Amazon spokesperson said in an emailed statement.</p>\n<p>Amazon customers can still use Visa debit cards, Mastercard and Amex credit cards and Eurocard, the company said in a note to its customers.</p>\n<p>\"We are very disappointed that Amazon is threatening to restrict consumer choice in the future,\" a Visa spokesperson said in a statement.</p>\n<p>\"We continue to work toward a resolution so our cardholders can use their preferred Visa credit cards at Amazon UK without Amazon-imposed restrictions come January 2022.\"</p>\n<p>US Rittenhouse (KENOSHA)</p>\n<p>The jury in the Wisconsin murder trial of Kyle Rittenhouse has asked about viewing video related to the case, indicating it was still weighing evidence on its second day of deliberations on whether to convict or acquit the teenager.</p>\n<p>The 12-member jury on Wednesday sent a note to Kenosha County Judge Bruce Schroeder asking whether it can view video in its private room or in the courtroom. It was not immediately clear what video it was seeking to review.</p>\n<p>Schroeder said the jury would be required to view the evidence in the courtroom, which he would clear of public attendees and the media. After a full day on Monday, the jury has been deliberating for about 11 hours.</p>\n<p>Mark Richards, a lawyer for Rittenhouse, said he objected to the jury reviewing drone video that was an important part of the prosecution's case. The video shows Rittenhouse shooting Joseph Rosenbaum, one of two men he killed during racial justice protests in Kenosha, Wisconsin on August 25, 2020.</p>\n<p>US MalcolmX (NEW YORK)</p>\n<p>Two of the three men convicted in the assassination of Malcolm X are set to be cleared after insisting on their innocence since the 1965 killing of one of the United States' most formidable fighters for civil rights, Manhattan's top prosecutor says.</p>\n<p>Prosecutors now say authorities withheld evidence that favored the defence in the trial of Muhammad Aziz, now 83, and the late Khalil Islam, according to The New York Times.</p>\n<p>Aziz and Islam spent decades in prison for the crime but a recent documentary sparked a nearly two-year investigation by their lawyers and the Manhattan district attorney's office.</p>\n<p>A court date is expected on Thursday.</p>\n<p>\"These men did not get the justice that they deserved,\" District Attorney Cyrus Vance Jr told the NYT.</p>\n<p>US Rust (LOS ANGELES)</p>\n<p>A crew member working on the Rust movie last month says in a lawsuit that the script never called for a gun to be fired during a rehearsal scene with Alec Baldwin, according to the Hollywood Reporter.</p>\n<p>Baldwin killed a cinematographer when the gun, loaded with a live round, went off on the set.</p>\n<p>The lawsuit was filed in Los Angeles on Wednesday by Mamie Mitchell, who was the script supervisor on the low-budget Western being made in New Mexico.</p>\n<p>It names Baldwin and the movie producers.</p>\n<p>Mitchell is claiming assault, intentional infliction of emotional distress and deliberate infliction of harm, the Hollywood Reporter said on Wednesday, citing a copy of the court papers it obtained.</p>\n<p>Mitchell and her lawyer, Gloria Allred, were due to hold a news conference in Los Angeles later on Wednesday.</p>\n<p>Afghan Aust (CANBERRA)</p>\n<p>Temporary humanitarian visas issued to Afghans who helped Australian forces and were trapped on the ground after the allied withdrawal will be extended.</p>\n<p>The decision to extend the visas on an \"ongoing basis\" affects certified local workers, including interpreters, under the Department of Defence, the Department of Foreign Affairs and Trade and the Australian Federal Police.</p>\n<p>It also includes people who worked in other capacities with the Australian government in Afghanistan, and their families who were issued temporary humanitarian visas, the federal government said on Thursday.</p>\n<p>More than 5,600 temporary humanitarian visas were issued during the Afghanistan crisis in August.</p>\n<p>More than 3,500 Afghan temporary humanitarian visa holders have begun their settlement journey in Australia.</p>\n<p>Immigration minister Alex Hawke called on the ruling Taliban to not stop people who want to leave Afghanistan.</p>\n<p>Virus Dutch (AMSTERDAM)</p>\n<p>Dutch health authorities say they are running short of COVID-19 tests as the Netherlands registered more than 20,000 new coronavirus cases for the second day in a row, the highest since the pandemic began.</p>\n<p>\"We are coming up against the maximum of our capacity,\" said Jaap Eikelboom, head of COVID-19 operations at the National Public Health Service.</p>\n<p>The service said it was working to expand test capacity amid a new surge that has caught health authorities and Prime Minister Mark Rutte's government off guard.</p>\n<p>About 85 per cent of the adult Dutch population is fully vaccinated.</p>\n<p>The National Institute for Health (RIVM) on Tuesday reported a record of more than 110,000 new cases in the week ended November 16, an increase of 44 per cent from the week before, with the strongest rise among children aged 4-12.</p>\n<p>Royals Meghan (LOS ANGELES)</p>\n<p>Meghan, the wife of Prince Harry, is appearing on The Ellen DeGeneres Show in her first visit to a television talk show since becoming a member of the British royal family.</p>\n<p>Meghan, formally known as the Duchess of Sussex, sat down with DeGeneres for an episode that will air in the United States on Thursday, producers of the daytime show said on Wednesday.</p>\n<p>It was the first big TV appearance for Meghan since she and Harry gave a bombshell interview to Oprah Winfrey in March and spelled out their unhappiness at life within the royal family.</p>\n<p>The former Suits actress, who gave up her acting career when she married Harry in 2018, related an anecdote about her many auditions when she was starting out as an actress in Los Angeles, according to a clip of her surprise appearance.</p>\n<p>US Bannon (WASHINGTON, D. C.)</p>\n<p>Former US president Donald Trump's longtime adviser Steve Bannon has pleaded not guilty to criminal charges that he defied a congressional subpoena from a US House panel investigating the deadly January 6 Capitol riot, according to court documents.</p>\n<p>Bannon, who made his initial court appearance in court on Monday, was indicted last week by a federal grand jury on two counts of contempt of Congress.</p>\n<p>Bannon has vowed to fight the congressional subpoena, telling reporters outside the courthouse on Monday that he believes the prosecution is a politically motivated attack against him by President Joe Biden, Attorney General Merrick Garland and House of Representatives Speaker Nancy Pelosi.</p>\n<p>He was due to be arraigned in court on Thursday but agreed to waive his right to a formal reading of the indictment, according to court documents filed on Wednesday.</p>\n<p>Canada Floods (ABBOTSFORD)</p>\n<p>Canada has deployed the air force to help British Columbia deal with massive floods that killed one person, with more rain expected in coming days.</p>\n<p>Mudslides destroyed roads and bridges and severed access to the country's largest port in Vancouver, disrupting global supply chains already struggling to deal with problems caused by COVID-19.</p>\n<p>After a phenomenon known as an atmospheric river dumped a month's worth of rain in two days, officials are concerned that another downpour could overwhelm a pumping station near Abbotsford, a city of 160,000 to the east of Vancouver, which has already been partly evacuated.</p>\n<p>Mayor Henry Braun said the station was running at full capacity.</p>\n<p>Volunteers built a dam around the station overnight, he said.</p>\n<p>\"That will buy us some more time but if we had another weather event like we just went through, we are in deep doo-doo (trouble),\" he told reporters on Wednesday.</p>\n<p>US Hackers (WASHINGTON, D. C.)</p>\n<p>Hackers linked to the Iranian government have been targeting a \"broad range of victims\" inside the United States, including by deploying ransomware, according to an advisory issued by US, UK and Australian officials.</p>\n<p>The advisory said that in recent months, Iran's government has exploited computer vulnerabilities exposed by hackers before they can be fixed and targeted entities in the transportation, health care and public health sectors.</p>\n<p>The attackers leveraged the initial hack for additional operations, such as data exfiltration, ransomware and extortion, according to the advisory.</p>\n<p>The group has used the same Microsoft Exchange vulnerability in Australia, officials say.</p>\n<p>The warning is notable because even though ransomware attacks remain prevalent in the US, most of the significant ones in the past year have been attributed to Russia-based criminal hacker gangs rather than Iranian hackers.</p>\n<p>In sport ...</p>\n<p>RU Erasmus (CAPE TOWN)</p>\n<p>South Africa director of rugby Rassie Erasmus has been found guilty of misconduct by an independent committee for his hour-long video critique of match officials, particularly Australian referee Nic Berry, during the British &amp; Irish Lions series - but he says he will appeal against the verdict.</p>\n<p>Erasmus, who coached the Springboks to the 2019 Rugby World Cup title, has been banned from all rugby activity for two months after six charges of misconduct against him were upheld, World Rugby announced on Wednesday.</p>\n<p>He's also suspended from all match-day activities, including coaching and media engagement, until September 30, 2022 while South Africa Rugby has been fined Stg 20,000 ($A37,000), World Rugby said.</p>\n<p>Erasmus, who was also told he must apologise to the officials he criticised, has indicated he will appeal the verdict, as will SA Rugby.</p>\n<p>Gol EPGA (LONDON)</p>\n<p>Min Woo Lee is ready to set out on his quest to be crowned top golfer on the 2021 European Tour, backed by a huge vote of confidence in his \"super talent\" from his illustrious Australian colleague Adam Scott.</p>\n<p>Lee, still only 23, has an outside shot at winning the Race to Dubai, the season-long Order of Merit on the European Tour, but must continue his recent superb form and win the season's final event, the World Tour Championship, to have any chance.</p>\n<p>Asked by AAP about his young compatriot's chances, former Masters champ Scott, speaking from the US where he's preparing for the RSM Classic, said: \"Min Woo might win the whole thing and we see a new star of golf.\"</p>\n<p>Ends Bulletin</p>\n<p>Rolling News Desk inquiries : 02 9322 8611</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 Australian Associated Press</p></div>"}