{"date": "2021-10-04 07:03:53+00:00", "ticker": "AVV", "mrkt_info": {"open": 3488.0, "close": 3485.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>Dubai, UAE – AVEVA, a global leader in industrial software, driving digital transformation and sustainability, reveals that 85% of businesses plan to increase their investment in digital transformation over the next three years in order to tackle climate change, embrace automation and unlock the performance benefits of advanced technologies. The findings were drawn from an AVEVA-commissioned survey* focused on innovation priorities of senior industry leaders and managers.</p>\n<p>AVEVA surveyed over 850 digital transformation experts across industries such as manufacturing including large-scale agribusiness and food and beverage, infrastructure, energy, power and chemical processing. The objective was to understand the different market opportunities, pressures and innovations driving industries to embrace digital operations, using a combination of AI, industrial software and human insight to deliver unprecedented performance.</p>\n<p>“Industrial leaders are leveraging advanced analytics and digital innovation to rethink how they design, engineer and operate,” says Ravi Gopinath, Chief Strategy Officer and Chief Cloud Officer, AVEVA. “Bringing together rich, timely and accurate industrial data with the scope and scale of the cloud, smart analytics and artificial intelligence (AI) are empowering industrial teams to collaborate better, operate with agility and elevate what they can achieve. This is set to transform how we all live and work.”</p>\n<p><strong>Digital acceleration, driven by the pandemic</strong></p>\n<p>Nine out of ten industrial companies see combining advanced technologies such as the industrial internet of things (IIoT), AI and cloud with their teams’ insights, as key to driving better performance in a post-pandemic world. AI and automation are now seen as necessary technologies in order to keep pace with competitors. In China and Germany, more than half (56% and 55% respectively) have made digital transformation their top priority over the coming year, with investments focused on workforce solutions, cyber security, connected worker strategies and cloud.</p>\n<p><strong>Tackling Climate Change Through Digital Transformation</strong></p>\n<p>The pandemic has increased focus on the need for urgent climate action and the majority of industrial enterprises (90%) cite this as a core action area. Nine in ten (89%) are committed to achieving net-zero carbon emissions across their businesses and to tackling climate change within a five-year time horizon. Indeed, focus on sustainability has become a prerequisite for success in industry, leaders affirmed.</p>\n<p>Sustainability-led demands will consequently drive innovation across the value chain, 85% of companies say. These companies are planning to increase visibility and performance assurance to sustainability related metrics as a result. Germany, Austria and Switzerland lead the global race for environment-linked business innovation: 47% in these countries see it as a significant focus, as opposed to 41% worldwide.</p>\n<p>About 80% of industrial companies are focused on meeting or exceeding environmental regulations, while 83% say they will prioritize the transition to renewable energy sources. Supporting circularity and recycling within the value chain is important for 83% of customers, led by Latin America (44% of companies).</p>\n<p>“At AVEVA, we are committed to helping our customers unlock the benefits of digital transformation to drive efficiency and sustainability. As the industrial world accelerates, AVEVA’s solutions offer a proven pathway to support the shift to net zero while driving profitability and sustainability. Our study shows that Performance Intelligence, which is AVEVA’s unique capability to combine data and AI-infused analytics that span the entire industrial lifecycle, is accelerating sustainability for many businesses. The new research reveals that 75% of companies believe they are on a journey to realizing Performance Intelligence, while 89% state that they are committed to driving sustainability. At AVEVA, we are committed to supporting both of these aspirations, to drive even greater value,” Gopinath concluded.</p>\n<p>* A total of 850 C-suite leaders, business unit heads, executives and senior managers worldwide were interviewed in June 2021 by research house Savanta for the AVEVA survey, titled Approaching The Age of Performance. Respondents were based in Germany, the USA, Canada, the UK, Mexico, Brazil and China.</p>\n<p>-Ends-</p>\n<p><strong> </strong><strong>About AVEVA</strong></p>\n<p><span>AVEVA is a global leader in industrial software, driving digital transformation and sustainability. By connecting the power of information and artificial intelligence with human insight, AVEVA enables teams to use their data to unlock new value. We call this Performance Intelligence.  AVEVA’s comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through a trusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world. The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices in over 40 countries. Learn more at <a href=\"http://www.aveva.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.aveva.com</a>. </span></p>\n<p><span>Copyright © 2021 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and product- names are the trademarks of their respective companies.</span></p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}