{"date": "2021-11-30 22:12:51.039000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Apple has confirmed that it will now offer App Store gift cards in India via Amazon. Read on to know more.</p><p>Apple has started offering its App Store gift cards in India via Amazon. The gift cards will be available in various denominations starting from Rs 200 and going up to Rs 5,000.</p></div><div class=\"tr-npp-body\"><p>It will make it easier for users to purchase digital content including apps, games, music, and more, without having to use a debit card or any other mode of online payment.</p><p>The gift cards will grant users the ability to buy apps from the App Store, purchase games on Apple Arcade, purchase subscriptions to access Apple Music and Apple TV+, and get ebooks and audiobooks from Apple Books.</p><p>Additionally, users will also be able to use the gift cars to buy goods and services from Apple's iTunes Store and iCloud subscription.</p><p>Apple is offering gift cards in denominations of Rs 200, Rs 500, Rs 1,000, Rs 2,000, and Rs 5,000. Interested users can get their hands on these gift cards via Amazon India.</p><p>As per the dedicated gift card page, the company states that gift cards that are purchased from Amazon India will only be valid on purchases made in India. Additionally, Apple says that users will not be able to redeem these gift cards for cash, for resale, or for shipments outside of India.</p><p>Users will only be able to make use of these gift cards to buy Apple goods and services, and not for any other payment. Apple has also warned users that if they get approached by someone to use the codes for any other kind of payment, it is likely because they are being targeted as part of a scam.</p><p>Copyright 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 IE Online Media Services Pvt. Ltd., distributed by Contify.com</p></div>"}