{"date": "2021-08-03 15:33:10.865000+00:00", "ticker": "AAF", "mrkt_info": {"open": 86.85, "close": 89.4}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Bharti Airtel on Tuesday reported a net profit of Rs 283.5 crore, in the first quarter ended June 30 (Q1FY22). This was much lower than consensus estimates which had pegged the same at Rs 604 crore. The company had reported a loss of Rs 15,933 crore in the year ago quarter on account of one-time provision for dues related to adjusted gross revenues.</p><p>The June quarter profit was aided by the sale of tower assets in Africa of about $175 million (Rs 1,279.6 crore). On a sequential basis, the reported profit was down 63 per cent.</p></div><div class=\"tr-npp-body\"><p>\u0093Our consolidated revenues at Rs 26,853.6 crore grew by Rs 1,106 crore over the last quarter representing a sequential growth of 4.3 per cent while EBITDA margins improved from 48.9 per cent to 49.1 per cent. While our wireless revenue was impacted by the Covid lockdown-induced slowdown in terms of device shipments and a financial squeeze at the lower end of the market, our overall performance reflected the resilience and strength of our portfolio,\" Gopal Vittal, MD and CEO, India &amp; South Asia, said. Revenues were marginally higher than street expectations.</p><p>Shares of Airtel closed at Rs 580.20 on BSE, up 2.68 per cent from the previous close.</p><p>At the operating level, the consolidated earnings before interest, tax, depreciation and amortisation (EBITDA) during the first quarter came in at Rs 13,189 crore which was up 30 per cent YoY. Margins improved by 570 basis points y-o-y to 49.1 per cent.</p><p>\u0093We added 5.1 million 4G customers during the quarter and our enterprise business in India continued to deliver strongly. Our Homes business grew by just about 13 per cent over last year and added 285,000 customers in the quarter, the highest ever,\" Vittal said.</p><p>Airtel Africa announced the sale of tower assets belonging to Airtel Tanzania in June. Around USD 60 million from the proceeds will be used to invest in network and sales infrastructure in Tanzania and for distribution to the Government of Tanzania. The rest of the proceeds will be used to reduce debt at the group level, the company had said at the time of the deal.</p><p>In the India mobile business, Bharti Airtel's average revenue per user (ARPU), the matrix that measures the revenue generated per unit or subscriber, stood at Rs 146 up 0.6 per cent on a sequential basis (Rs 145) while it was down seven per cent from Rs 157 in the year ago period.</p><p>With the decline in corona virus cases and gradual opening of the economy towards the end of the quarter, we see a cautious return to normalcy, said Airtel in an exchange filing.</p><p>The company said it has deployed additional spectrum across 900 MHz, 1,800 MHz, 2,100 MHz and 2,300 MHz bands in multiple circles during the quarter to improve network availability and data speeds, delivering the best network experience to its customers.</p><p>The India business posted quarterly revenues of Rs 18,828 crore, an increase of an increase of 19 per cent year-on-year on a comparable basis, while mobile services revenue was up 21.9 per cent YoY on a comparable basis on account of improving realisations and sustained increase in 4G customer base.</p><p>Homes business segment witnessed a revenue growth of 12.9 per cent over last year with highest ever customer additions of 285,000 during the quarter to reach a total base of 3.35 million.</p><p>According to the data by the Telecom Regulatory Authority of India (TRAI) Airtel has added over 517,000 subscribers in April and lost 4.6 million of them in the month of May due to the second wave and resultant lockdowns.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Business Standard Ltd.</p></div>"}