{"date": "2021-11-09 16:22:10.771000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3488.98, "close": 3482.05}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p><span>— Recommendations are independently chosen by Reviewed's editors. Purchases you make through our links may earn us a commission.</span> </p><p>The holiday shopping season is here! We can't think of any better way to escalate the excitement of Santa's arrival than a toy-filled Advent calendar. And if you've been hunting for the year's hottest Lego Advent Calendar, you're in luck—they're on sale at Amazon right now.</p></div><div class=\"tr-npp-body\"><p><span><span>Tackle your holiday shopping with deals and expert advice delivered straight to your phone.</span> Sign up for text message alerts from the deal-hunting team at Reviewed.</span> </p><p>Lego Advent Calendars are some of the most sought-after advent calendars around. Filled with collectible pieces, they are always some of the first to sell out. If you're looking to pick one up for the holiday season, act fast—many of the year's hottest models are on sale on Amazon right now for <span>20% off</span> . </p><p>Filled with coveted and collectible mini-figures, these sets are arguably the best way to build a mini-fig collection. Each countdown calendar features 24 compartments filled with unique miniature gifts that you often can't find in any other kits. </p><p><span>Related:</span>  Aldi wine Advent calendar, beer, toys, candy and more collections are on sale</p><p>Seeing these wildly popular collectible calendars at such low prices is basically a holiday miracle you shouldn't sleep on!</p><p class=\"tr-npp-section-title\">Where to buy Lego Advent Calendars on sale </p><p>The Star Wars, Harry Potter and Lego City Advent calendars typically sell out every year, leaving a rush on the secondary market. This year, another top performer is the hotly anticipated Avengers calendar, which is filled with minifigures like Iron Man, Spider-Man, Black Widow, Thor, Captain Marvel, Thanos and Nick Fury.</p><p>Right now, each of these is on sale at Amazon. We don't anticipate these prices (or stock) to last much longer, so act fast if you want to pick one up: </p><ul class=\"bulleted-list arrowlist\"><li><span>Get the Lego City 2021 Advent Calendar at Amazon for $23.99</span>   <span>(Save $6)</span> </li><li><span>Get the Lego Star Wars 2021 Advent Calendar at Amazon for $31.99 (Save $8)</span> </li><li><span>Get the Lego Harry Potter 2021 Advent Calendar at Amazon for $31.99</span>   <span>(Save $8)</span> </li><li><span>Get the Lego Avengers 2021 Advent Calendar at Amazon for $31.99</span>   <span>(Save $8)</span> </li> </ul><p><span><span>Don't get thwarted by shipping delays or sold-out favorites this holiday season.</span> Sign up for our free weekly newsletter and get the product reviews, deals and holiday gift guides you need to start shopping now.)</span> </p><p><span>The product experts at <span>Reviewed</span> have all your shopping needs covered. Follow Reviewed on <span>Facebook</span> , <span>Twitter</span> , <span>Instagram</span> , <span>TikTok</span> or <span>Flipboard</span> for the latest deals, product reviews and more.</span> </p><p><span>Prices were accurate at the time this article was published but may change over time.</span> </p><p><span>This article originally appeared on Reviewed: Lego Advent Calendars are on sale at Amazon right now—snag these discounts before they're gone</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2021 GANNETT</p></div>"}