{"date": "2021-12-06 19:11:16.053000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Washington [US], December 6 (ANI): Primetime Emmy Award winner William Shatner's space trip on Blue Origin will be documented in the Amazon special episode 'Shatner in Space'.</p><p>Washington [US], December 6 (ANI): Primetime Emmy Award winner William Shatner's space trip on Blue Origin will be documented in the Amazon special episode 'Shatner in Space'.</p></div><div class=\"tr-npp-body\"><p>According to Deadline, the one-hour special episode will premiere on December 15 in the US, Canada, UK, Australia, and New Zealand; other territories will be added in early 2022.</p><p>The special episode will give viewers an inside look at the before, during, and after of the historic trip that saw him become the oldest person ever to travel to space.</p><p>Reportedly, at the time of his flight on October 13 alongside Chris Boshuizen, Glen de Vries, and Audrey Powers, the 'Star Trek' actor was 90 years old.</p><p>While announcing the one-hour special during a virtual panel for CCXP Worlds on Sunday, the actor said, \"My time in space was the most profound experience I could have ever imagined.\"</p><p>\"This special documenting my journey gives a dramatic view of that experience, and my hope is that it inspires the world to see we must go to space to save Earth,\" the veteran actor said in a statement.</p><p>He also shared the poster of the upcoming episode on his Twitter handle on Monday and wrote, \"I'm hoping the @PrimeVideo. special is a gift for everyone on this final night of #Chanukah.\"</p><p>Deadline reported that 'Shatner in Space' is produced by Amazon Studios, Blue Origin, Film 45, Jason Ehrlich Productions, and Bright Spot Content. (ANI)</p><p>Copyright © 2021 aninews.in All rights reserved. Provided by SyndiGate Media Inc. ( <a href=\"http://syndigate.info\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Syndigate.info</a> ).</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SyndiGate. All Rights Reserved.</p></div>"}