{"date": "2022-01-06 14:55:06.497000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3350.44, "close": 3265.08}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>RACKSPACE TECHNOLOGY INC (\"RXT-Q\")\n- Onica, A Rackspace Technology Company, Announces AWS Emissions\n- Monitoring and Surveillance Solution Deployment Partnership\n\n     Onica by Rackspace Technology, the Amazon Web Services (AWS) focused\nbusiness group of Rackspace Technology(R), a leading end-to-end, multicloud\ntechnology solutions company, today announced its deployment relationship\nwith AWS on Emissions Monitoring and Surveillance (EMS). EMS is a new\nsolution to help facility engineers, operations general managers, and\nenvironmental teams see direct measurements of emissions (initially\nmethane) so they can quickly act (maintain, operate, design), driving down\nper-unit-volume carbon intensity (kgCO2e/bbl), reducing equipment failures\nand safety incidents, retaining product volume, and curtailing\nenvironmental impacts through Leak Detection and Repair.\n\n     How EMS works:\n1. Adds new direct observations where needed (including a selection of\npre-integrated 3rd party options for satellite, airplane, unmanned aerial\nvehicle, stationary continuous monitoring systems, and internet of things\nsensors)\n2. Combines those and existing sensors and supervisory control and data\nacquisition systems to provide a continuous, comprehensive view of\nemissions reality\n3. Integrates that emissions data with disparate industrial data sources\nwithin a facility or enterprise, connecting localized operational\ntechnology data, plant technical data and business information systems in a\nsingle repository so customers can optimize emissions alongside production\nand uptime\n\n     Having this data all together lets customers analyze it faster and get\nit into the applications and workflows where it is most needed. This\nenables the repairs and optimizations needed to meet methane emission\nreduction goals and reduce overall carbon intensity.\n\n     \"We're proud to work alongside AWS to help energy companies drive down\nper-unit-volume carbon intensity, reduce equipment failures, safety\nincidents, retain product volume, and curtail environmental impacts through\nLeak Detection and Repair,\" said Mike Melanson, Vice President, Strategic\nAlliance Partnerships for Rackspace Technology. \"A solution that addresses\nclimate change is especially timely, compelling, and increases our scope\nand industry expertise in this area.\"\n\n     The EMSsolution automates integration of methane emissions data\nsources from disparate third parties (and operational data) into the tools\nand workflows where it is most needed, providing geospatial views of\nemissions, alerts, and advanced analytics. These capabilities enable the\nrepairs and optimizations needed to meet methane emission reduction goals,\nand reduce overall emissions intensity.\n\n     EMS shows engineers emissions data so they can fix leaks faster and\noptimize operations to minimize unnecessary emissions. It shows emissions\non a continuous basis, consolidating multiple sources, and alongside\nequipment operational data, breaking down the data silos impeding emissions\nanalysis today. It also dramatically accelerates the deployment of new\nsensor inputs, analytic tools, and workflow integrations through its\nscalable technical and commercial framework, making many new component\ndeployments possible in a matter of days.\n\n     As an official Deployment Partner, Onica by Rackspace Technology can\nhelp customers assess their readiness for, plan for, and execute the\nimplementation of the EMS solution.\n\n     For more information on AWS Emissions Monitoring and surveillance\nvisit: aws.amazon.com/energy/solutions/emissions-monitoring-surveillance/\n\n     About Rackspace Technology\nRackspace Technology is a leading end-to-end multicloud technology services\ncompany. We can design, build, and operate our customers' cloud\nenvironments across all major technology platforms, irrespective of\ntechnology stack or deployment model. We partner with our customers at\nevery stage of their cloud journey, enabling them to modernize\napplications, build new products and adopt innovative technologies.\n\n     Contact:Natalie Silva\n     Rackspace Technology Corporate Communications\n     publicrelations@rackspace.com\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2200400373.MNPRE2200401849-08103120220105</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}