{"date": "2021-11-30 15:40:49.518000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>SUMO LOGIC INC (\"SUMO-Q\")\n- Drives Unified Observability with Expanded Tracing Visibility\n- into AWS Lambda\n\n     Sumo Logic the pioneer in continuous intelligence, announced that\nexpanded tracing visibility into AWS Lambda functions is now available.\nPowered by AWS CloudWatch, AWS CloudTrail and OpenTelemetry, Sumo Logic now\nleverages AWS Lambda telemetry: logs, metrics and traces required to\nprovide full end-to-end application visibility.\n\n     Now certified as an AWS Lambda Ready Partner, Sumo Logic delivers\nunified observability to customers building and operating Lambda functions,\nproviding unique views into resource utilization and application stack\nperformance for the best possible end-user experience. In addition to\ntelemetry, Sumo Logic analyzes how functions perform during transactions\nand correlates that performance to the wide range of AWS services in a\ncustomer application.\n\n     \"OpenTelemetry is the future of observability, and Sumo Logic\naccelerates our customers' digital transformation,\" said Erez Barak, VP of\nProduct Development, Sumo Logic. \"With our latest investments in\nOpenTelemetry and the extension of our deep partnership with AWS, we\nprovide enterprises and our developer community the choices and cloud\nservices needed for rapid app development and real-time insight to action\nacross their business.\"\n\n     Armed with intuitive workflows, Sumo Logic can bring in CloudWatch\nlogs and metrics data for AWS Lambda, along with data for other key AWS\nservices, such as EC2, ECS, RDS, DynamoDB, API Gateway, Elasticache, ELB.\nWith unified observability, customers building and operating Lambda\nfunctions get unique views into resource utilization and application stack\nperformance for the best possible end-user experience. Additionally, Sumo\nLogic's automated machine-learning and advanced analytics capabilities\nquickly surface the root cause of an issue, allowing users to dedicate more\nresources to new feature development and fewer outages.\n\n     The Sumo Logic Continuous Intelligence Platform(TM) serves as the\nbackbone for the suite of Sumo Logic observability solutions, delivering a\ncloud-native, open and flexible infrastructure that allows enterprises to\nrealize additional value from its AWS investments.\n\n     In two separate announcements, Sumo Logic also unveiled that it was\nnamed ISV Partner of the Year by Amazon Web Services and detailed its\nsupport for AWS Security Reference Architecture and Amazon Inspector.\n\n     About Sumo Logic\nSumo Logic Inc. (Nasdaq: SUMO) is the pioneer in continuous intelligence, a\nnew category of software, which enables organizations of all sizes to\naddress the data challenges and opportunities presented by digital\ntransformation, modern applications, and cloud computing. The Sumo Logic\nContinuous Intelligence Platform(TM) automates the collection, ingestion,\nand analysis of application, infrastructure, security, and IoT data to\nderive actionable insights within seconds. More than 2,100 customers around\nthe world rely on Sumo Logic to build, run, and secure their modern\napplications and cloud infrastructures. Only Sumo Logic delivers its\nplatform as a true, multi-tenant SaaS architecture, across multiple\nuse-cases, enabling businesses to thrive in the Intelligence Economy. For\nmore information, visit www.sumologic.com.\n\n     Sumo Logic is a trademark or registered trademark of Sumo Logic in the\nUnited States and in foreign countries. All other company and product names\nmay be trademarks or registered trademarks of their respective owners.\n\n     Any information regarding offerings, updates, functionality, or other\nmodifications, including release dates, is subject to change without\nnotice. The development, release, and timing of any offering, update,\nfunctionality, or modification described herein remains at the sole\ndiscretion of Sumo Logic, and should not be relied upon in making a\npurchase decision, nor as a representation, warranty, or commitment to\ndeliver specific offerings, updates, functionalities, or modifications in\nthe future.\n\n Contact Information:\n\nContact:Carmen Harris\nSumo Logic\ncharris@sumologic.com\n(650) 414-1584\n\nTel   : 650-810-8700    SUMO LOGIC INC\nWWW   : <a href=\"https://www.sumologic.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.sumologic.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2021 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2133300339.MNPRE2133302233-07213020211130</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Thomson Reuters Limited.</p></div>"}