{"date": "2020-12-13 06:19:46+00:00", "ticker": "AVV", "mrkt_info": {"open": 3195.0, "close": 3164.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>Dubai, UAE:– OEG LLC, an innovator and leader in industrial learning platform software and content which enables companies to build, maintain and evolve learning resources specific to their industry and operations, today announced a significant new strategic learning partnership with AVEVA, a global leader in engineering and industrial software.</p>\n<p>The partnership will integrate OEG’s 3D advanced, remote learning content into the AVEVA Unified Learning offering to optimize and ensure remote operator safety and efficiency, which has become particularly important for  industrial organizations during the current global pandemic.</p>\n<p>AVEVA Unified Learning delivers engaging off-the-shelf and customer training programs for industrial operators, bringing together the latest technologies with sound instructional design to deliver competency-based experiential learning, empowering operators to perform better in less time. The OEG content will be used in conjunction with AVEVA’s Learning Management System and high-fidelity Operator Training Simulators to provide a library of on-demand, cloud-based, experiential courses for industrial customers to enhance the training of process operators.</p>\n<p>“The OEG Knowledge Library will enhance AVEVA Unified Learning with rich, purpose-built content for basic process operator training, as well as reduce learning time and improve knowledge retention to enable our customers to build and sustain workforce competence,” commented Ravi Gopinath, Chief Cloud Officer and Chief Product Officer, AVEVA.</p>\n<p>Today’s workforce is increasingly preferring to learn in an on-demand, self-paced manner versus a traditional classroom environment. This trend, fueled by the challenges of the COVID-19 pandemic, is driving a shift in the training strategies of process manufacturing companies as more and more opt for a virtual environment.</p>\n<p>Ted Davis, President and CEO of OEG, added: “We are thrilled to partner with AVEVA to become part of the AVEVA Unified learning solution. This partnership will accelerate our fundamental mission, to bring life-like, immersive content to enhance learner engagement, enjoyment, retention and facilitate greater efficacy in adult learning to the process industries.”</p>\n<p>-Ends-</p>\n<p><strong>About OEG</strong></p>\n<p><span>OEG creates industrial learning platform software and learning content which enables companies to build, maintain and evolve learning resources specific to their industry and operations. We believe advancements in learning technology should also serve to enhance the human learning experience. Our content and tools help in building learner confidence and improving workforce safety and efficiency.</span><strong> </strong></p>\n<p><strong>About AVEVA</strong></p>\n<p><span>AVEVA is a global leader in engineering and industrial software driving digital transformation across the entire asset and operations life cycle of capital-intensive industries.  The company’s engineering, planning and operations, asset performance, and monitoring and control solutions deliver proven results to over 16,000 customers across the globe. Its customers are supported by the largest industrial software ecosystem, including 4,200 partners and 5,700 certified developers. AVEVA is headquartered in Cambridge, UK, with over 4,400 employees at 80 locations in over 40 countries. For more details visit: www.aveva.com </span></p>\n<p><span>Copyright © 2020 AVEVA Solutions Limited. All rights reserved. AVEVA Solutions Limited is owned by AVEVA Group plc. AVEVA, the AVEVA logos and AVEVA product names are trademarks or registered trademarks of AVEVA Group plc or its subsidiaries in the United Kingdom and other countries. Other brands and products names are the trademarks of their respective companies.</span></p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}