{"date": "2021-11-02 01:52:31.048000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3318.11, "close": 3384.0}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Singapore</p><p>AMAZON is now the new anchor tenant at Asia Square, with the opening of its 100,000 sq ft Singapore corporate office in the Marina Bay retail and office development. The multinational tech company also plans to create over 200 new jobs in Singapore by end-2022.</p></div><div class=\"tr-npp-body\"><p>The new office, which is part of local expansion plans, spans three floors. It will house over 30 teams and up to 700 employees from Amazon's consumer business and corporate functions, it said in a press statement on Wednesday (Oct 27).</p><p>These include employees supporting Amazon.sg and Amazon Fresh, Amazon Advertising, Prime Video, seller enablement and other regional corporate functions, the company announced.</p><p>The office contains a product showcase area, 50 breakout areas for informal discussions and brainstorming, as well as 5 large meeting rooms with videoconferencing capabilities. It also includes facilities for work and learning - 33 quiet rooms and 12 phone booths. There are also 2 training rooms which can double up as physical town hall event spaces.</p><p>At present, there are over 110 job openings in Singapore. Amazon plans to add more than 200 new jobs to these departments to expand its range of offerings in the Republic, as well as include more support for local businesses to go global, it added.</p><p>Amazon Singapore country manager Henry Low said the new office demonstrates the company's ongoing commitment to invest in Singapore, as well as the long-term potential for the country to be a leader in the global digital economy.</p><p>\"The way we work has been changed by the pandemic forever so as our teams continue to grow here, the new space will ensure they have the flexibility and ample space to collaborate, co-create, and continue to innovate on our customers' behalf,\" Low added.</p><p>Minister for Trade and Industry Gan Kim Yong said Amazon has been a key partner in supporting the local business community and helping to grow Singapore's ecosystem. Besides providing a retail platform for Singapore businesses, it also offers various tools and services to help local sellers expand their consumer reach.</p><p>\"I am grateful for Amazon's close partnership in various government initiatives throughout the pandemic that has helped Singapore SMEs move towards digital enablement and e-commerce adoption,\" he added.</p><p>The company has also created job opportunities in the areas of cloud services, operations and logistics, and data engineering. It employs around 2,000 workers across its various business units in Singapore, of which the majority are Singapore citizens or permanent residents, Gan added.</p><p>Amazon began infrastructure operations in Singapore in 2008. It later launched the Amazon Web Services Infrastructure Region for Singapore in April 2010 to offer cloud computing services. Since then, the tech giant has expanded its offerings to include Amazon.sg online retail, Amazon Fresh, Amazon Prime membership, Prime Video, Twitch, and more.</p><p>In 2017, Amazon established its Amazon Prime Now facility in Singapore - which has since expanded to two fulfilment centres and a last-mile delivery centre. Two years later, it launched Amazon.sg for local consumers.</p><p>Its other business units Audible, an audiobook and podcast service, and Twitch, a livestreaming platform for gamers, have also sited their regional headquarters in Singapore.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 SPH</p></div>"}