{"date": "2021-12-03 15:26:13.131000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3443.72, "close": 3389.79}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-dateline\"><p>Dec 03, 2021</p></div><div class=\"tr-npp-lead\"><p><span>Amazon</span><a href=\"https://www.zacks.com/stock/quote/AMZN\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AMZN</a> has revealed 18 utility-scale wind and solar energy projects in a bid to fuel its carbon emission-free drive.Notably, out of these projects, eight will be based in the United States. Further, four will be located in Finland, four in Spain, one in Italy and another one in Ireland.The renewable energy produced by the new projects will be utilized in supplying energy to the AWS data centers, Amazon's fulfillment centers and corporate offices.We believe that the latest move bodes well for the company's goal of reaching net-zero carbon emissions by 2040.The move makes the company the biggest corporate investor in renewable energy by bringing its total count of renewable energy projects to 274 on a global basis.Notably, growing investments in these projects have accelerated the pace of Amazon's journey toward powering its infrastructure with 100% renewable energy. The goal was initially targeted to be met by 2030, which is now expected to be achieved by 2025.</p></div><div class=\"tr-npp-body\"><p class=\"tr-npp-section-title\">Amazon.com, Inc. Price and Consensus</p><p> </p><p><a href=\"https://www.zacks.com/stock/chart/AMZN/price-consensus-chart?icid=chart-AMZN-price-consensus-chart\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. price-consensus-chart</a> | <a href=\"https://www.zacks.com/stock/quote/AMZN?icid=chart-AMZN-price-consensus-chart\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. Quote</a> </p><p class=\"tr-npp-section-title\">Amazon's Growing Efforts</p><p>Amazon has been shifting its focus from fossil fuels to clean energy for quite some time now. The shift to clean energy sources is anticipated to reduce costs in the near term, which is a major positive. Additionally, the company can generate healthy returns from strengthening solar and wind investments as there are several associated tax incentives.Apart from the latest move, the company's climate-friendly program, which focuses on environment-friendly products, remains a major positive. Under the new program, customers can view the Climate Pledge Friendly label, while purchasing more than 25,000 products.Amazon recently revealed 14 wind and solar energy projects, out of which 11 will be based in the United States, one will be located in Canada, one in Finland, and another one in Spain. All the endeavors reflect Amazon's Climate Pledge commitment.However, mounting expenses, owing to growing such endeavors, remain major concerns for the margin expansion of Amazon, which currently carries a Zacks Rank #5 (Strong Sell).You can see<span><a href=\"https://www.zacks.com/stocks/buy-list/?ADID=zp_1link&amp;ICID=zpi%20_1link\" data-type=\"url\" class=\"tr-link\" translate=\"no\">the complete list of today's Zacks #1 Rank (Strong Buy) stocks here</a> </span>.</p><p class=\"tr-npp-section-title\">Zero-Carbon Mission Gaining Steam</p><p>The carbon-free push is gaining strong traction across the technology sector.Not only Amazon but companies like<span>Apple</span><a href=\"https://www.zacks.com/stock/quote/AAPL\" data-type=\"url\" class=\"tr-link\" translate=\"no\">AAPL</a> ,<span>Alphabet</span><a href=\"https://www.zacks.com/stock/quote/GOOGL\" data-type=\"url\" class=\"tr-link\" translate=\"no\">GOOGL</a> and<span>Microsoft</span><a href=\"https://www.zacks.com/stock/quote/MSFT\" data-type=\"url\" class=\"tr-link\" translate=\"no\">MSFT</a> are also taking initiatives to lower overall carbon footprints and cut energy bills substantially.Apple is looking for ways to develop a carbon-free project soon. AAPL committed to being carbon-neutral across its manufacturing supply chain, product life cycle and overall business by 2030. Further, it was recently announced that 175 Apple suppliers have agreed to transition to using renewable energy.Alphabet's aggressive three-fold strategy, which includes energy efficiency, renewable energy procurement and carbon offsets, remains noteworthy. Notably, the company's division Google has been carbon neutral since 2007. GOOGL is aiming to be carbon-free by 2030.Microsoft is gathering steam to become carbon negative by 2030. Additionally, MSFT aims to remove all the emissions, which it has released since its founding year, by 2050.</p><p><span>Zacks' Top Picks to Cash in on Artificial Intelligence</span></p><p>In 2021, this world-changing technology is projected to generate $327.5 billion in revenue. Now Shark Tank star and billionaire investor Mark Cuban says AI will create \"the world's first trillionaires.\" Zacks' urgent special report reveals 3 AI picks investors need to know about today.</p><p><a href=\"https://www.zacks.com/registration/ultimatetrader/welcome/eoffer/4e87?add=1749&amp;adid=NEWSTEX_CONTENT_ZU_AIREPORT_A_ANALYSTBLOG_257_12032021&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_corporate_actions-1835028\" data-type=\"url\" class=\"tr-link\" translate=\"no\">See 3 Artificial Intelligence Stocks With Extreme Upside Potential&gt;&gt;</a></p><p>Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.</p><p><a href=\"http://www.zacks.com/registration/pfp/?ALERT=RPT_7BST_LP194&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_257&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_corporate_actions-1835028\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Click to get this free report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=AMZN&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_257&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_corporate_actions-1835028\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Amazon.com, Inc. (AMZN): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=AAPL&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_257&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_corporate_actions-1835028\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Apple Inc. (AAPL): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=MSFT&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_257&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_corporate_actions-1835028\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Microsoft Corporation (MSFT): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/registration/pfp?ALERT=ZER_LINK&amp;d_alert=ZER_CONF&amp;t=GOOGL&amp;ADID=NEWSTEX_CONTENT_ZER_ARTCAT_ANALYSTBLOG_257&amp;cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_corporate_actions-1835028\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Alphabet Inc. (GOOGL): Free Stock Analysis Report</a></p><p><a href=\"http://www.zacks.com/stock/news/1835028/amazon-s-amzn-18-projects-to-bolster-net-zero-carbon-efforts?cid=CS-NEWSTEX-FT-analyst_blog%7Ccompany_news_-_corporate_actions-1835028\" data-type=\"url\" class=\"tr-link\" translate=\"no\">To read this article on Zacks.com click here.</a></p><p><a href=\"http://www.zacks.com/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Zacks Investment Research</a></p><p>The views expressed in any and all content distributed by Newstex and its re-distributors (collectively, the \"Newstex Authoritative Content\") are solely those of the respective author(s) and not necessarily the views of Newstex or its re-distributors. Stories from such authors are provided \"AS IS,\" with no warranties, and confer no rights. The material and information provided in Newstex Authoritative Content are for general information only and should not, in any respect, be relied on as professional advice. Newstex Authoritative Content is not \"read and approved\" before it is posted. Accordingly, neither Newstex nor its re-distributors make any claims, promises or guarantees about the accuracy, completeness, or adequacy of the information contained therein or linked to from such content, nor do they take responsibility for any aspect of such content. The Newstex Authoritative Content shall be construed as author-based content and commentary. Accordingly, no warranties or other guarantees are offered as to the quality of the opinions, commentary or anything else appearing in such Newstex Authoritative Content. Newstex and its re-distributors expressly reserve the right to delete stories at its and their sole discretion.</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 Zacks Investment Research</p></div>"}