{"date": "2021-11-10 06:25:21+00:00", "ticker": "ABDN", "mrkt_info": {"open": 263.9, "close": 262.5}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p>Dubai, United Arab Emirates – A new survey conducted by Aetna International — which polled over 1000 workers in the UAE — has revealed that many employees are reluctant to use health and well-being benefits offered by their employers, for fear of being judged and worries about how management will react if they find out.</p>\n<p>When respondents were asked what stops them from accessing the current health and well-being benefits provided by their employer, the top reason cited (29%) was fear that their career progression would be impacted if HR/management found out that they were struggling. 22% said that they didn’t feel comfortable accessing benefits as they felt no one else was and 20% also worried about how they would be perceived by colleagues if they used health and well-being resources.</p>\n<p>This worrying level of stigma is particularly acute when it comes to mental health. 27% of UAE respondents cited worrying about HR/management finding out details about their mental health as a key reason they avoid using their health and well-being benefits.  </p>\n<p><span>“We know from previous research that businesses in the UAE have notably increased their support for employee health and well-being over the last 18 months, and have become much more sensitive to the stress, anxiety and other pressures people face on a daily basis,”</span> commented David Healy, CEO EMEA at Aetna International. <span>“In spite of these best efforts, these findings suggest that a significant number of employees may try to cope alone with mental or physical health challenges. Sadly stigma, particularly around mental health, means some employees still believe they could face repercussions if they reveal they are struggling, which should never be the case in any workplace.”</span></p>\n<p><strong>Action employers can take</strong></p>\n<p>The survey data shows there are a number of steps employers can take to remove this stigma and encourage employees to seek the help they need:</p>\n<ul class=\"bulleted-list arrowlist\">\n<li><strong><span>Encourage leaders to be more empathetic and enhance the communication on health and well-being</span></strong> — 35% of UAE respondents said they would be more likely to access health and well-being support if leadership communicated more about available resources.</li>\n</ul>\n<ul class=\"bulleted-list arrowlist\">\n<li><strong><span>Build a culture and work environment where employees feel safe to openly discuss the physical, mental and emotional issues they are facing</span></strong> — 33% of UAE employees said that knowing there is clear policy on mental health that ensures they will not be penalized for accessing support and 38% said that knowing their peers are also accessing the same resources would be two key criteria that will encourage them to use more employer provided health and well-being resources.</li>\n</ul>\n<ul class=\"bulleted-list arrowlist\">\n<li><strong><span>Offer regular trainings and webinars</span></strong> specifically around practical tips for managing well-being and how to spot and support employees and colleagues who might be struggling with mental health.<strong> </strong></li>\n</ul>\n<p><span>“The lessons and research over the past 18 months have made it clear that a more compassionate and open workplace culture is the first step in fostering better employee health. A culture where we encourage employees to talk about important issues, thereby easing the pressure to exude an aura of resilience — never ill, always ready for more work, available 24/7. In a competitive world, nobody wants to be thought of as the weak link. But normalizing discussions around issues such as health, and particularly mental wellness, could become one of the most important requirements of a sound talent strategy and company culture in the post-COVID economy,”</span> concluded Healy.</p>\n<p>-Ends-</p>\n<p><strong>About Aetna International</strong></p>\n<p><span>Aetna International is committed to helping create a stronger, healthier global community by delivering comprehensive health care benefits and population health solutions worldwide. One of the largest providers of international private medical insurance, Aetna International serves around 800,000 members worldwide, including expatriates, local nationals and business travelers. Its global benefits include medical, dental, vision and emergency assistance and, in some regions, life and disability. Aetna International also offers customised technological and health management solutions for health care systems, government entities and large employers to improve people’s health, enhance quality of care and contain costs. Aetna International is a subsidiary of Aetna, a CVS Health company, which serves an estimated 34 million people with information and resources to help them make better informed decisions about their health care.</span></p>\n<p>For more information, see <a href=\"http://www.aetnainternational.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.aetnainternational.com</a> </p>\n<p>Media enquiries for Aetna International:<br/>\nVernon Saldanha<br/>\nProcre8 (on behalf of Aetna International)<br/>\n<a href=\"mailto:vernon@procre8.biz\" data-type=\"email\" translate=\"no\">vernon@procre8.biz</a> </p>\n<div><b><span>Send us your press releases to</span> <a href=\"mailto:pressrelease.zawya@refinitiv.com\" data-type=\"email\" translate=\"no\">pressrelease.zawya@refinitiv.com</a></b></div>\n<br/>\n<div class=\"footnote-disclaimer\">\n<p>Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release.</p>\n<p>The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk.</p>\n<p>To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages.</p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">© Press Release</p></div>"}