{"date": "2022-01-21 16:02:57.653000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3033.35, "close": 2890.88}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Nearly 334,000 baby pacifiers are being recalled because they could pose a choking risk.</p><p>According to the recall notice posted on the U.S. Consumer Product Safety Commission website, Mushie &amp; Co is recalling its \"FRIGG silicone pacifiers\" because the \"base of the silicone nipple has a fine slit that can cause the nipple to detach from the plastic shield, posing a choking hazard.\"</p></div><div class=\"tr-npp-body\"><p>Two designs of the pacifiers are included in the recall – classic and daisy – and both came in two sizes 0-6 months and 6-18 months. They were sold in more than 40 colors at TJ Maxx, SpearmintLOVE, Lil' Tulips, Olivia &amp; Jade Company stores nationwide and online at Amazon.com and Mushie.com.</p><p><span>► <span>Recalls you need to know about: </span> Check out USA TODAY's curated database of consumer product recalls for the latest information</span> </p><p><span><span>►Free COVID tests from the government:</span> Here's how you can order at-home test kits online or with new hotline</span> </p><p>No injuries have been reported, the recall notice said, but the company has received eight reports of the silicone nipple detaching from the plastic shield of the pacifier and 200 reports from outside the U.S. of the nipple detaching. </p><p>Consumers are advised to \"immediately stop using the recalled pacifiers and contact the firm for a full refund or credit,\" the recall said.</p><p class=\"tr-npp-section-title\">Mushie pacifier recall 2022: How to get a refund</p><p>To get a refund or credit, consumers are asked to \"cut the silicone nipple from the base of the pacifier and send a photograph of both the detached silicone nipple and the base of the pacifier to Mushie &amp; Co at: Mushie.com/pages/recalls. Consumers should then properly dispose of the pacifier by placing both pieces into the garbage.\"</p><p>A single pacifier cost about $8 and a two-pack cost about $15, the company said.</p><p>For questions about the recall and more information, call Mushie &amp; Co at 877-687-4431 Monday through Friday, email at productsafety@mushie.com, or online at Mushie.com/pages/recalls.</p><p><span><span>►Save better, spend better:  </span> Money tips and advice delivered right to your inbox. Sign up here</span> </p><p><span><span>►New Amazon store:</span> Amazon to open its first in-person clothing store. What we know about the new Amazon Style.</span> </p><p><span>Follow USA TODAY reporter Kelly Tyko on Twitter:  <a href=\"https://twitter.com/KellyTyko\">@KellyTyko <span>. For shopping news, tips and deals, join us on our Shopping Ninjas Facebook group. </span> </a> </span> </p><p><span>This article originally appeared on USA TODAY: Pacifier recall 2022: Frigg pacifiers sold at Amazon, TJ Maxx recalled due to choking hazard</span> </p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright © 2022 GANNETT</p></div>"}