{"date": "2021-11-23 20:34:21.934000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3572.57, "close": 3580.41}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-lead\"><p>Amazon's announcement that it would<span><a href=\"https://www.americanbanker.com/news/amazons-u-k-visa-ban-could-foreshadow-larger-fight-in-u-s\" data-type=\"url\" class=\"tr-link\" translate=\"no\">halt acceptance of Visa credit cards</a> </span>in the U.K. in January due to \"high costs\" comes at the same time that the e-commerce company is expanding an internal payment app and enhancing alternative point-of-sale credit.</p><p>The installment lender Affirm earlier in November said its service would be fully available on Amazon in the U.S. by the end of the year and will be embedded as a payment method in the Amazon Pay app. At nearly the same time, PayPal announced Amazon would support PayPal's<span><a href=\"https://www.americanbanker.com/payments/news/amazon-to-accept-paypals-venmo\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Venmo</a> </span>as a payment option.</p></div><div class=\"tr-npp-body\"><p>The fintech deals allow Amazon to support credit card alternatives like account-to-account payments and instant credit at checkout. This makes Amazon less reliant on traditional bank-issued cards, experts say.</p><p>Amazon in August began testing Affirm's buy now/pay later product with a limited number of consumers. The upgrade takes Affirm out of beta at Amazon, making it the only non-credit card BNPL option at Amazon in the U.S. through at least January 2023, per terms of the deal.</p><p>While these options compete with credit cards, Amazon also heavily markets the credit cards that benefit the retailer, such as the co-branded Amazon Visa card issued by JPMorgan Chase. The common denominator in all of these partnerships is the Amazon brand being front and center. <br/> </p><p>\"Amazon doesn't want to be regulated like a bank, but it does want to control much of the delivery of services to and engagement with consumers, in many cases relegating banks to being backend utilities,\" said Eric Grover, a principal at Intrepid Ventures.Banks and the card networks are battling with fintechs such as Affirm, Afterpay and Klarna to supply BNPL lending. Placing Affirm's BNPL product directly in Amazon's payment app puts the fintech's option in a prominent position while Amazon fights with the card brands over credit card fees in Europe and potentially the U.S., where<span><a href=\"https://www.americanbanker.com/payments/articles/visa-mastercard-to-delay-merchant-fee-hikes-another-year\" data-type=\"url\" class=\"tr-link\" translate=\"no\">Visa and Mastercard plan interchange hikes</a> </span>in 2022.</p><p>If Affirm and other alternative payment options gain favor, Amazon would have more leverage in negotiating its fees with the card networks.</p><p>\"Who blinks next is largely a function of what consumers do at this juncture,\" said Don Apgar, director of the merchant services practice at Mercator Advisory Group. \"If Amazon feels a sales pinch, they may have to concede the inherent value of Visa's interchange fees. If consumers switch issuers to replace their Visa card with a Mastercard so they can continue shopping on Amazon, then Visa will likely have to reassess what it thought was its value proposition and re-price interchange accordingly.\"</p><p>Amazon did not return a request for comment on its Affirm relationship. In an email, an Affirm spokesperson said, \"Expanding our relationship with Amazon is a compelling opportunity to rapidly expand Affirm's network and become millions of more people's favorite way to pay over time.\"</p><p>Amazon isn't betting all of its chips on installment lending. Starting In 2022, U.S. consumers will be able to pay with PayPal's Venmo on Amazon.com and Amazon's mobile app.</p><p>The arrangement will help the financial services strategies of both PayPal and Amazon. For PayPal, placing Venmo within Amazon helps boost PayPal's goals to monetize Venmo, and it also helps<span><a href=\"https://www.yahoo.com/now/investors-dumped-paypal-earnings-2-184931474.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">offset earnings softness</a> </span>resulting from the supply chain crunch.</p><p>\"With the acceptance by Amazon of Venmo payments, a Venmo account becomes even more like a checking account for everyday use, which is likely to encourage Venmo users to hold greater balances in their Venmo account rather than using a bank checking account,\" said Andrew Steadman, senior research director at Gartner.</p><p>For Amazon, there's an opportunity to provide an additional payment option for third-party sellers and merchants. Amazon in the past two years has spent<span><a href=\"https://blog.aboutamazon.eu/policy/how-amazon-and-third-party-sellers-together-give-customers-more-choice\" data-type=\"url\" class=\"tr-link\" translate=\"no\">nearly $4 billion on tools</a> </span>for its third-party sellers such as logistics, management, sales report technology and advertising platforms. These investments are an effort to keep those sellers from using other e-commerce platforms. With Venmo's support of real-time payments from The Clearing House and eventually from the Federal Reserve's FedNow, Venmo could be very attractive to merchants on the Amazon platform, Steadman said. It will also improve cash flow if Amazon routes those payments to merchant accounts in real time, according to Steadman.</p><p>Amazon's scale provides a large market for financial services. The company's enrolled Prime membership currently totals about 200 million, with 175 million in the U.S., according to<span><a href=\"https://www.businessofapps.com/data/amazon-statistics/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">The Business of Apps</a> </span>.</p><p>Amazon in October<span><a href=\"https://www.usnews.com/news/technology/articles/2021-10-19/softbank-amazon-accel-invest-108-million-in-banking-platform-pismo\" data-type=\"url\" class=\"tr-link\" translate=\"no\">invested in Pismo</a> </span>, a Brazilian bank and payment technology company that plans to open an office in Austin following the investment, a move that gives Amazon access to bank and payment technology that could help the e-commerce company add additional financial products.</p><p>\"To date, Amazon has largely been partnering to provide financial products and services,\" said Rick Oglesby, president of AZ Payments Group. \"As it achieves scale through some of these partnerships, it will get more attractive to take them in-house, so it's likely that they will be, or already are, looking at those opportunities.\"</p></div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 American Banker. All Rights Reserved.</p></div>"}