{"date": "2021-11-30 18:40:00.165000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}.storyContent .bwlistdisc{list-style-type:disc;}</style><p class=\"bwalignc\">\n<b>AWS Announces New Serverless Options for Three Analytics Services</b>\n</p><p class=\"bwalignc\">\n<span>New serverless options for Amazon Redshift, Amazon MSK, and Amazon EMR help customers analyze data at scale without having to configure, scale, or manage the underlying infrastructure</span>\n</p><p class=\"bwalignc\">\n<span>Roche, Riot Games, and Intuit among customers using new serverless analytics options</span>\n</p><p>\nToday, at AWS re:Invent, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), announced three new serverless options for its suite of analytics services that make it easier to analyze data at any scale without having to configure, scale, or manage the underlying infrastructure. A new serverless option for Amazon Redshift automatically sets up and scales resources in seconds, giving customers the ability to run high-performance analytics workloads on petabytes of data without having to manage data warehouse clusters. A new serverless option for Amazon Managed Streaming for Apache Kafka (Amazon MSK) quickly scales resources to vastly simplify real-time data ingestion and streaming. Amazon EMR now provides a serverless option for customers to run analytics applications using open-source big data frameworks like Apache Spark, Hive, and Presto without having to provision, manage, and scale the underlying infrastructure.\n</p><p>\n“Some customers want fine-grained control over every aspect of their workloads, but other customers have asked AWS to take the guesswork out of managing their analytics infrastructure so they can move faster and expand the use of analytics in their organizations. Today, we are helping customers reduce the complexity of managing their analytics infrastructure by offering serverless versions of three popular analytics services,” said Rahul Pathak, Vice President of Analytics at AWS. “This makes it significantly easier and more cost effective for customers to modernize their infrastructure and unify vast amounts of data from a variety of endpoints. Now, customers can run analytics workloads at any scale and quickly deliver insights to the people and applications that need it—without having to even think about managing infrastructure.”\n</p><p>\nAWS customers use a wide variety of purpose-built analytics services to make data-driven decisions, including Amazon Redshift for data warehousing, Amazon MSK for processing real-time data streams, and Amazon EMR for running Apache Spark, Hive, Presto, and other open-source big data frameworks. These services offer powerful analytics capabilities for a variety of use cases, but there is a subset of customers who want to benefit from AWS analytics services and don’t want to put in the time needed to learn how to manage the underlying clusters or servers. To remove the complexity of scaling and managing infrastructure, AWS introduced the concept of serverless, event-driven computing in 2014, and many customers have adopted serverless technologies on AWS because it removes the need to configure, scale, or manage servers or provision compute instances and storage to meet peak capacity for their applications. The new serverless options announced today extend these capabilities to AWS analytics engines to automatically add or subtract resources to provide just the right amount of capacity to meet the demands of data analytics at any scale, so customers do not need to worry about constantly right-sizing clusters or over provisioning for peak capacity—saving them time and helping them optimize costs. With today’s announcements, customers can now enjoy the automatic provisioning, on-demand scaling, and pay-as-you-go pricing of serverless to lower costs, expand analytics to more users, and quickly and easily get started with AWS analytics services, including:\n</p><ul class=\"bulleted-list arrowlist\">\n<li>\n<b>Serverless data warehouse with Amazon Redshift Serverless: </b>Today, tens of thousands of customers are collectively processing more than two exabytes of data with Amazon Redshift every day. Amazon Redshift offers up to 3x better price performance and up to 10x better query performance than other enterprise cloud data warehouses, providing customers with faster data analytics at lower cost. The new serverless option for Amazon Redshift now makes it even easier to get insights from data quickly without the need to set up, manage, or scale clusters. Customers currently managing their own Amazon Redshift clusters can easily move them to the new serverless option using the Amazon Redshift console or the application programming interface (API) without making changes to their applications. To learn more about the new serverless option for Amazon Redshift, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fredshift%2Fredshift-serverless&amp;esheet=52542176&amp;newsitemid=20211130005973&amp;lan=en-US&amp;anchor=aws.amazon.com%2Fredshift%2Fredshift-serverless&amp;index=1&amp;md5=322c58785a4589c11336b5d3490c5b8d\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com/redshift/redshift-serverless</a>.\n</li>\n<li>\n<b>Serverless data streaming with Amazon MSK Serverless:</b> Today’s organizations are increasingly adopting Apache Kafka to capture and analyze real-time data streams from IoT devices, website clickstreams, database logs, and many other sources where dynamic data is continuously generated. Amazon MSK Serverless now builds, manages, and scales clusters automatically, so customers no longer have to worry about capacity planning or unpredictable workloads. To get started with Amazon MSK Serverless, customers simply create a cluster in the Amazon MSK console, set up a private and secure Apache Kafka endpoint, and use new or existing Apache Kafka clients to stream data. To learn more about Amazon MSK Serverless, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Fmsk%2Ffeatures%2Fmsk-serverless&amp;esheet=52542176&amp;newsitemid=20211130005973&amp;lan=en-US&amp;anchor=aws.amazon.com%2Fmsk%2Ffeatures%2Fmsk-serverless&amp;index=2&amp;md5=da4f452367d3ff89553f597002e35c61\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com/msk/features/msk-serverless</a>.\n</li>\n<li>\n<b>Serverless big data analytics with Amazon EMR Serverless:</b> Tens of thousands of customers use Amazon EMR to run open-source frameworks like Apache Spark, Hive, and Presto for large-scale distributed data processing jobs, interactive SQL queries, and machine learning applications. With Amazon EMR Serverless, customers simply specify the framework they want to run, and Amazon EMR Serverless provisions, manages, and scales the compute and memory resources up and down as workload demands change. Customers can get started with Amazon EMR Serverless by simply selecting an open-source framework and submitting their job using Amazon EMR APIs, the AWS Command Line Interface (AWS CLI), or the AWS Management Console. To learn more about Amazon EMR Serverless, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Faws.amazon.com%2Femr%2Fserverless&amp;esheet=52542176&amp;newsitemid=20211130005973&amp;lan=en-US&amp;anchor=aws.amazon.com%2Femr%2Fserverless&amp;index=3&amp;md5=d41088f9841eed4eddc04cd5357ff3a2\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com/emr/serverless</a>.\n</li>\n</ul><p>\nRoche is one of the largest pharmaceutical companies in the world and the leading provider of cancer treatments globally. “Amazon Redshift Serverless helps us complete our data management without having to manage clusters and optimizes our cost by provisioning just the right amount of capacity to meet demand,” said Dr. Yannick Misteli, Lead Cloud Platform and ML Engineer at Roche. “Amazon Redshift Serverless is reducing the operational burden, lowering costs, and enabling scale for the Roche Go-to-Market domain. This simplification is a game changer, helping us rapidly onboard and support a variety of analytics-heavy use cases without friction.”\n</p><p>\nRiot Games is a video game developer and publisher, renowned for creating one of the world’s most-played PC games: League of Legends. “We ingest about 20 terabytes of data per day using Amazon MSK on AWS, and reducing the time to query this data after it is produced is critical for us. With Amazon MSK, we now have a mechanism for streaming data into our ecosystem while eliminating the heavy lifting of running Apache Kafka on our own,” said Wesley Kerr, Sr. Principal Data Scientist at Riot Games. “Amazon MSK Serverless will further streamline our operations, as it allows us to keep up with changes in demand without having to take scaling actions. As a result, our developers can worry less about scaling Apache Kafka and focus more on offering the best gaming experiences around the world.”\n</p><p>\nIntuit is the global technology platform that helps consumers and small businesses overcome their most important financial challenges, serving more than 100 million customers worldwide with TurboTax, QuickBooks, Mint, Credit Karma, and Mailchimp. “At Intuit we use Apache Kafka as a central event bus that sits between thousands of decoupled microservices that power our products,” said Ritesh Bansal, Director of Engineering at Intuit. “We recently migrated our self-managed Apache Kafka clusters to Amazon MSK because it allows us to redirect engineering talent towards innovations closer to our end customers. We’re excited about Amazon MSK Serverless, which will make managing our scale and capacity much easier.”\n</p><p>\nThe Orchard, a Sony Music Entertainment subsidiary, collects, processes, and distributes music from labels and artists to Spotify, Amazon Music, and other streaming providers and physical retailers. “Amazon MSK has helped us accelerate the pace at which we are launching production ready applications that process streaming data for The Orchard Suite,” said Farouk Umar, Engineering Manager at The Orchard. “Amazon MSK Serverless enables teams that are not familiar with Apache Kafka scaling to benefit from Amazon MSK, allowing us to fully decentralize Apache Kafka in our organization and provide a better developer experience. As a result, we are able to scale adoption of Apache Kafka faster, which helps us accelerate adoption of our event-driven strategy.”\n</p><p>\nClassmethod, Inc. is a leading cloud integrator with expertise in big data, mobile, and artificial intelligence. “Our data integration platform service, called Customer Story Analytics (CSA), integrates Amazon Redshift, Amazon S3, Amazon Aurora, and other services to avoid data silos and provide powerful, unified governance between data services,” said Satoru Ishikawa, Solution Architect, Data Integration Division at Classmethod. “Amazon Redshift Serverless automates the sizing of compute and storage and quickly scales to meet demand. This elastic serverless experience mitigates manual operational costs, expands data access among departments, and accelerates autonomy on data analytics and machine learning, allowing us to scale the CSA business in new and exciting ways.”\n</p><p>\nSedric is an AI risk and compliance excellence platform designed for the new generation of fintech. “Ease of use and self-service data access is key for our analytics initiatives. With Amazon Redshift Serverless, we don’t have to think about managing the data warehouse,” said Tomer Levi, Vice President of R&amp;D at Sedric. “Data from Amazon S3 gets loaded 7x faster for us than our previous solution, helping us get actionable insights from millions of customer events. We are thrilled with the performance improvements and cost optimizations we are seeing with Amazon Redshift Serverless.”\n</p><p>\nZS Associates is a global professional services firm that helps companies develop and deliver products for their customers. “We leverage AWS heavily for our data analytics strategy and have had tremendous success over the years. Our SaaS products depend on Amazon EMR versions to upgrade Spark reliably and remove the undifferentiated heavy lifting,” said Anirudh Vohra, Associate Director of Cloud Architecture at ZS. “However, some of our workloads don’t need the level of customization offered by Amazon EMR on EC2, and we want to simply run certain Apache Spark applications without worrying about managing and scaling servers or clusters. We are excited about the launch of Amazon EMR Serverless and look forward to porting our workloads with ad-hoc analytics needs onto Amazon EMR Serverless.”\n</p><p>\n<b>About Amazon Web Services</b>\n</p><p>\nFor over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 81 Availability Zones within 25 geographic regions, with announced plans for 27 more Availability Zones and nine more AWS Regions in Australia, Canada, India, Indonesia, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Faws.amazon.com%2F&amp;esheet=52542176&amp;newsitemid=20211130005973&amp;lan=en-US&amp;anchor=aws.amazon.com&amp;index=4&amp;md5=c75ff212fe3aa0d7135776b23e600918\" data-type=\"url\" class=\"tr-link\" translate=\"no\">aws.amazon.com</a>.\n</p><p>\n<b>About Amazon</b>\n</p><p>\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Famazon.com%2Fabout&amp;esheet=52542176&amp;newsitemid=20211130005973&amp;lan=en-US&amp;anchor=amazon.com%2Fabout&amp;index=5&amp;md5=b379f3fb613c99e0be75deb3b9a997e7\" data-type=\"url\" class=\"tr-link\" translate=\"no\">amazon.com/about</a> and follow @AmazonNews.\n</p><p></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"alt\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20211130005973r1&amp;sid=ny6r2&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jdHMuYnVzaW5lc3N3aXJlLmNvbS9jdC9DVD9pZD1id25ld3Mmc3R5PTIwMjExMTMwMDA1OTczcjEmc2lkPW55NnIyJmRpc3Rybz1ueCZsYW5nPWVu&amp;key=f681882c45bd852e730199ce6e5851445f45aa431b9d56a10203785c738311ff9e5659a8317f97c5203d21bcf368e89e702c452b53b828a32390aa09753e6354\"/></div></div><span class=\"bwct31415\"><p></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211130005973/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211130005973/en/</a></span></p><p>\nAmazon.com, Inc.\n<br/>Media Hotline\n<br/><a href=\"mailto:Amazon-pr@amazon.com\" data-type=\"email\" translate=\"no\">Amazon-pr@amazon.com</a><br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.amazon.com%2Fpr&amp;esheet=52542176&amp;newsitemid=20211130005973&amp;lan=en-US&amp;anchor=www.amazon.com%2Fpr&amp;index=6&amp;md5=9b394f4d40ca6b579155a981fbc59f79\" data-type=\"url\" class=\"tr-link\" translate=\"no\">www.amazon.com/pr</a>\n</p></span><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: NV-AMAZON-WEB-SERVICES</p></div>"}