{"date": "2022-02-18 15:11:19.611000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3162.01, "close": 3052.03}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>ESPORTS ENTERTAINMENT GROUP INC (\"GMBL-Q\")\n- EGL Club Clash to be Aired Worldwide on ESTV\n\n     Esports Entertainment Group, Inc. (\"EEG\" or the \"Company\") announced\nthat its EGL Club Clash program will be aired worldwide on EsportsTV\n(\"ESTV\"). EGL Club Clash gives fans the opportunity to play on behalf of\ntheir favorite professional sports organization to prove which team has the\ngreatest gamers.\n\n     EGL Club Clash includes gamers representing the National Football\nLeague's New England Patriots, Tampa Bay Buccaneers, Denver Broncos,\nIndianapolis Colts, and Los Angeles Chargers; the National Basketball\nAssociation's Cleveland Cavaliers; and Major League Soccer's Philadelphia\nUnion and New England Revolution.\n\n     \"Airing EGL Club Clash on ESTV presents a tremendous opportunity for\nus and reflects the success we are having in expanding esports engagement,\"\nsaid Grant Johnson, CEO of Esports Entertainment Group. \"ESTV has seen\ntheir unique viewership grow by nearly 22 percent in the last quarter and\nthey average more than 300,000 unique viewers per day. We believe that\nairing significant events via their platform will greatly amplify the\nvisibility of the EGL Club Clash program as well as further our\nrelationship with current and new high-profile professional sports teams.\"\n\n     Interested spectators in more than 45 countries will have the ability\nto tune into the EGL Club Clash via several streaming platforms including\nRoku, Amazon Fire TV, Samsung TVPlus, LG TV, Sling TV, Vizio, YouTube and\nTwitch. For a full list of where to watch, visit\n<a href=\"https://www.estv.co/distribution\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.estv.co/distribution</a>.\n\n     \"ESTV is excited to continue our partnerships with the leading\norganizations in esports, including EGL and EEG,\" said Eric Yoon, Founder &amp;\nCEO of Esports Television. \"Driving ESTV's core mission to bring the\nlatest, most engaging and compelling esports content into homes across the\nglobe is further fueled by these tournaments, their participant activities,\nand their exciting new partners such as the Cleveland Cavaliers. We look\nforward to an exciting future with EGL and EEG as partners, driving\ninnovative and engaging opportunities across gaming and media.\"\n\n     EGL's proprietary technology platform makes live and online events and\ntournaments possible by allowing gamers to compete and enjoy a wide range\nof content relating to esports and video games from anywhere in the world.\nServices include full turnkey esports events, live broadcast production,\ngame launches, and online branded tournaments. Fortnite, Madden, Apex\nLegends, and Rocket League are among the titles featured.\n\n     About ESTV\nESTV is the first worldwide 24-7 live linear video channel dedicated to\nesports. Launched in May 2019, ESTV streams live linear feeds and AVOD\nservices, providing round-the-clock coverage of esports athletes and gaming\nfranchises from an insider perspective. ESTV is available on the Roku(r)\nChannel (U.S. &amp; Canada), Amazon Fire TV, LG TV, Samsung TVPlus, Dish(r)\nSling TV, VIZIO, Rakuten TV (Europe), TCL TV (worldwide), ZEASN\n(worldwide), Hisense Sharp (worldwide), RAD TV (Playstation, Google TV&amp;\nAndroid TV), EASY TV (Brazil), Select TV, TikiLIVE, XOD Global(worldwide),\nand SimulTV in the U.S. and international territories. ESTV is also\navailable on Twitch, YouTube and Facebook. ESTV partners with the world's\ntop gaming networks and production partners for the most robust esports\ncontent lineup on linear, online and mobile. ESTV is also an exclusive\nbroadcast partner for esports events for the Department of Defense's Joint\nBase Lewis-McChord and for NFL Alumni. For more information, please visit\nwww.estv.co.\n\n     About Esports Entertainment Group\nEsports Entertainment Group is a full stack esports and online gambling\ncompany fueled by the growth of video-gaming and the ascendance of esports\nwith new generations. Our mission is to help connect the world at large\nwith the future of sports entertainment in unique and enriching ways that\nbring fans and gamers together. Esports Entertainment Group and its\naffiliates are well-poised to help fans and players to stay connected and\ninvolved with their favorite esports. From traditional sports partnerships\nwith professional NFL/NHL/NBA/FIFA teams, community-focused tournaments in\na wide range of esports, and boots-on-the-ground LAN cafes, EEG has\ninfluence over the full-spectrum of esports and gaming at all levels. The\nCompany maintains offices in New Jersey, the UK and Malta. For more\ninformation visit www.esportsentertainmentgroup.com.\n\n     FORWARD-LOOKING STATEMENTS\nThe information contained herein includes forward-looking statements. These\nstatements relate to future events or to our future financial performance,\nand involve known and unknown risks, uncertainties and other factors that\nmay cause our actual results, levels of activity, performance, or\nachievements to be materially different from any future results, levels of\nactivity, performance or achievements expressed or implied by these\nforward-looking statements. You should not place undue reliance on\nforward-looking statements since they involve known and unknown risks,\nuncertainties and other factors which are, in some cases, beyond our\ncontrol and which could, and likely will, materially affect actual results,\nlevels of activity, performance or achievements. Any forward-looking\nstatement reflects our current views with respect to future events and is\nsubject to these and other risks, uncertainties and assumptions relating to\nour operations, results of operations, growth strategy and liquidity. We\nassume no obligation to publicly update or revise these forward-looking\nstatements for any reason, or to update the reasons actual results could\ndiffer materially from those anticipated in these forward-looking\nstatements, even if new information becomes available in the future. The\nsafe harbor for forward-looking statements contained in the Securities\nLitigation Reform Act of 1995 protects companies from liability for their\nforward-looking statements if they comply with the requirements of the Act.\n\nContact:\n\nMedia Inquiries\nbrandon.apter@esportsentertainmentgroup.com\neeg@kcsa.com\n\nInvestor Relations Inquiries\nJeff@esportsentertainmentgroup.com\n\nJCIR\nJoseph Jaffoni, James Leahy, Norberto Aja\n212-835-8500\ngmbl@jcir.com\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2204800104.MNPRE2204800498-05434220220218</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}