{"date": "2021-12-08 09:30:21.893000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3427.37, "close": 3523.16}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent span.prnews_span{font-size:8pt;}.storyContent li.prnews_li{font-size:8pt;}.storyContent p.prnews_p{font-size:0.62em;margin:0in;}</style><div class=\"xn-newslines\">\n\n<p class=\"xn-distributor\">PR Newswire</p>\n<p class=\"xn-dateline\">NEW YORK, Dec. 8, 2021</p></div>\n\n<div class=\"xn-content\">\n\n<p><span class=\"xn-location\">NEW YORK</span>, <span class=\"xn-chron\">Dec. 8, 2021</span> /PRNewswire/ -- <span id=\"spanHghlt7676\">On <span class=\"xn-chron\">Dec. 8</span>, the new Khaleeji Arabic language for Alexa, Amazon's cloud-based service that powers devices like Amazon Echo, was officially released in <span class=\"xn-location\">Saudi Arabia</span> and the UAE. </span><span class=\"xn-person\">Tuya Smart</span> (NYSE: TUYA), a leading global IoT development platform, is providing solutions to enable global business partners, especially those in the <span class=\"xn-location\">Middle East</span>, to integrate Alexa's new Khaleeji Arabic language into their products. </p>\n<p><b>Increased Brands Access for Rapid Market Development</b></p>\n<p>Through the Tuya Smart Life App, developers can now freely access the Khaleeji Arabic language. In order to further meet the customized needs of developers, Tuya has also launched access and skill customization value-added services for the Arabic (SA) model, enabling developers to customize Alexa Arabic voice interaction skills for their own brands.</p>\n<p>Currently, <span class=\"xn-person\">Tuya Smart</span> has already assisted several partners in the UAE to integrate Alexa in Arabic into their devices and services and expand business in the <span class=\"xn-location\">Middle East</span>, including Kuaf from Enlight, a well-known lighting company; Porodo/Powerology from Teqtronix, a leading consumer electronics company; Evvoli from Masa, a leading UAE home appliance company; Hypnotek, the smart home brand under Marketing Home Group; and Wonderful, a well-known Saudi Arabian lighting group.</p>\n<p><b>Increased Alexa Integration to Expanded C</b><b>ommercial </b><b>Spaces</b></p>\n<p>In 2020, Tuya was listed as an <span class=\"xn-person\">Alexa Voice Service</span> (AVS) Systems Integrator, providing a comprehensive range of hardware and software AVS solutions to help device manufacturers quickly integrate Alexa into IoT devices and bring products to market faster and more efficiently.</p>\n<p>To further help developers rapidly obtain Amazon certification and smoothly enter the overseas smart voice system, Tuya not only helps developers obtain Works with Alexa (WWA) official certification. The Company has also launched an Amazon Alexa Built-in (ABI) testing and certification service that shortens the ABI certification cycle from over 12 weeks to around six weeks. Simultaneously, Tuya has also implemented an <span class=\"xn-person\">Alexa App</span>-to-App Account Linking function to allow users to seamlessly link all \"Powered by Tuya\" smart devices to Alexa in the Tuya Smart App without having to switch between multiple apps.</p>\n<p>Deep integration with Alexa has always been an important task of Tuya, and the <span class=\"xn-location\">Middle East</span> is an important market for the Company. Access to the Alexa Khaleeji Arabic language will not only enable Tuya partners to quickly tap into the <span class=\"xn-location\">Middle East</span> smart home market, but also offer the features of Alexa to their customers.</p>\n<p><b>About <span class=\"xn-person\">Tuya Smart</span></b></p>\n<p><span class=\"xn-person\">Tuya Smart</span> (NYSE: TUYA) is a global IoT development platform that builds interconnectivity standards to bridge the intelligent needs of brands, OEMs, developers, and retail chains across a broad range of smart devices and industries. Based on the global public cloud, Tuya connects different intelligent scenarios and smart devices by providing hardware development tools, integrating global cloud services, and offering a smart business development platform. Tuya provides comprehensive smart empowerment from technology to marketing to foster a neutral, open, and accessible developer ecosystem.</p>\n <p> </p>\n<p id=\"PURL\"></p><div class=\"tr-image\"><div class=\"tr-image-components\"><img alt=\"Cision\" src=\"https://c212.net/c/img/favicon.png?sn=CN00653&amp;sd=2021-12-08\" title=\"Cision\" style=\"max-height:12px\" data-internal-src=\"https://rp.cp.dtc.reuint.com/Apps/NewsServices/images?apiKey=95a7d790-a5d1-4907-9c62-c9d7a1d29f80&amp;type=base64Url&amp;id=aHR0cHM6Ly9jMjEyLm5ldC9jL2ltZy9mYXZpY29uLnBuZz9zbj1DTjAwNjUzJnNkPTIwMjEtMTItMDg=&amp;key=70dd4e506804ff16b54ece563a54d01e0d6a841cd84a3394f06c49e6ecb1ca3599854f02a7eb50b9b4d731777dc723a54da71de571f10c14683c494feaea3066\"/></div></div> View original content:<a href=\"https://www.prnewswire.com/news-releases/tuya-smart-helps-brands-integrate-new-alexa-arabic-language-into-their-products-and-build-alexa-skills-301439935.html\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.prnewswire.com/news-releases/tuya-smart-helps-brands-integrate-new-alexa-arabic-language-into-their-products-and-build-alexa-skills-301439935.html</a><p></p>\n<p>SOURCE  <span class=\"xn-person\">Tuya Smart</span></p>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2021 PR Newswire Association,LLC. All Rights Reserved.</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: Tuya-Smart</p></div>"}