{"date": "2021-12-01 19:52:17.071000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3507.07, "close": 3437.36}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}.storyContent .bwalignc{text-align:center;}</style><p class=\"bwalignc\">\n<b>Intelligent Medical Objects and Amazon Web Services Collaborate to Enhance Data Led Cloud Migrations in Healthcare</b>\n</p><p class=\"bwalignc\">\n<span>Collaboration will migrate clinical data and unlock data value using leading terminology technology</span>\n</p><p>\nIntelligent Medical Objects (IMO) today announced a strategic collaboration with Amazon Web Services (AWS) to streamline health data migrations to the cloud for AWS customers. The collaboration will support the secure migration of clinical data using IMO’s industry leading medical terminology technology, regulatory code mapping, and semantic normalization capabilities. IMO’s technology allows AWS customers to migrate their health data to a cloud native environment quickly and seamlessly.\n</p><p>\n“This is an exciting opportunity for IMO to use our technology and expertise to ensure critical data quality standards are met in AWS cloud migrations at a large scale,” said Ivana Naeymi-Rad, Chief Operating Officer at IMO.\n</p><p>\nThis collaboration benefits healthcare and life sciences customers looking to migrate clinical data sets to AWS and need support to unlock the value of that data currently held within the proprietary schemas of electronic health records (EHRs) and other systems. Currently, this process can be slow and time consuming. The data being securely migrated includes clinical data for diagnosis, conditions, and treatments from surgeries, medications, labs, imaging, and radiology.\n</p><p>\nFor example, a large health system on the East Coast needed to move uncoded data from multiple EHRs into its cloud environment. This was an effort to decrease uncoded problems and help clinical staff gain better insights into patients across its healthcare ecosystem and make sure the data was clean when transitioned. IMO helped find, code, and recommend good data to transition to the EHR, enabling the staff to better understand patients and decrease patient safety issues arising from miss or non-coded datasets. During this migration project, IMO's tools and services accelerated the customers' ability to make use of this data, compared to manual efforts.\n</p><p>\nData quality is a critical component of managing population health and supporting Artificial Intelligence and Machine Learning workloads. Moving to the cloud helps to maintain data retention compliance requirements which helps to maximize an organization’s operational and cost efficiencies. Combining the precision of IMO’s data interoperability capabilities and the security and agility of AWS could help rationalize complex clinical data at a global scale.\n</p><p>\n<b>About IMO</b>\n</p><p>\nIntelligent Medical Objects is a healthcare data enablement company. From clinical documentation at the point of care to complex approaches to population health management, IMO ensures clinical data integrity and quality—making patient information fit-for-purpose across the healthcare ecosystem. For almost three decades, IMO’s footprint in EHRs—across more than 4,500 US hospitals—powers our expert ability to capture and preserve clinical intent wherever and however data is used. Our primary clients span individual doctors and physician groups, hospitals and clinics, large integrated delivery networks, inpatient ORs and surgical centers, global electronic health record providers, health information exchanges, clinical data registries, payers, life sciences companies, and healthcare analytics vendors.\n</p><p>\nIMO is built on a culture that celebrates and practices diversity, equity, and inclusion. Our technology platform and evolving portfolio of products are grounded in our industry leading medical terminologies, which are clinically vetted and always current, capturing data at the highest level of specificity. IMO understands how data must then be transformed to efficiently extract the greatest value. In short, IMO is the catalyst that enables accurate documentation, precise population cohorting, optimized reimbursements, robust analytics, and better care decisions to optimize patient outcomes. Our employees strive every day to make a meaningful impact in healthcare.\n</p><p><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20211201005239/en/\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.businesswire.com/news/home/20211201005239/en/</a></span></p><p>\n<b>Media Contacts IMO \n</b><br/>Jessica Emond\n<br/>202.257.1808/ <a href=\"mailto:jemond@imohealth.com\" data-type=\"email\" translate=\"no\">jemond@imohealth.com</a>\n</p><p>\nRachel Hutman\n<br/>301.801.5540/ <a href=\"mailto:rachel@fordhutmanmedia.com\" data-type=\"email\" translate=\"no\">rachel@fordhutmanmedia.com</a>\n</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright Business Wire 2021</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: IL-INTELLIGENT-MED-OBJ</p></div>"}