{"date": "2022-01-27 17:12:32.407000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 2777.45, "close": 2879.56}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p></p><pre>\n    NEW YORK (AP) ? Amazon workers have lined up enough support \nto vote on whether to unionize a New York City warehouse, federal \nlabor officials said this week in a big step forward after a setback \nthis fall for one of the first organizing drives at the nation's \nlargest online retailer. \n    The National Labor Relations Board confirmed Thursday that \nthe nascent Amazon Labor Union gathered enough signatures to \nhold an election, on a date to be set after a Feb. 16 court hearing \non such particulars as what workers the union would represent. \nThe workers withdrew a similar request in November after running \ninto snags over the number of current employees who had signed \non. \n    \"We quickly bounced back\" and kept gathering more signatures, \norganizer Christian Smalls said Thursday, a day after getting \nthe green light from the NLRB. \"That was the celebratory moment \nfor us yesterday, the fact that we were able to achieve that even \nafter facing the withdrawal.\" \n    Smalls ? who was fired after organizing a March 2020 protest \nover coronavirus safeguards at the warehouse ? said the \nwould-be union submitted over 2,500 signatures in favor of a \nvote, comfortably clearing the NLRB threshold of 30% of workers \nthe potential union would cover. That's 5,000 employees, in \nthis case. \n    Still, Seattle-based Amazon Inc. continued to question whether \nthe union drive has enough backing. \n    \"We're skeptical that there are a sufficient number of legitimate \nsignatures, and we're seeking to understand how these signatures \nwere verified,\" spokesperson Kelly Nantel said. She argued \nthat the turn of events in the fall showed that most workers at \nthe Staten Island warehouse don't want to unionize. \n    Smalls countered that the company's doubts don't hold water, \nnoting that the NLRB gave the OK after getting the signatures. \n    The developments come as Amazon faces a do-over union vote among \nwarehouse workers in Bessemer, Alabama, during the next two \nmonths. \n    Workers there rejected the proposed union last spring. It was \na rare unionization vote within Amazon, which aggressively \ncampaigned against the push for collective bargaining in Bessemer. \n    The NLRB ordered a new election after saying the company destroyed \ntrust in the election by putting a mailbox at the employee entrance \n? a move the board said gave a false impression that the \ncompany was conducting the mail-in vote. Amazon maintained \nit was trying to make voting easier. \n    In a settlement with the NLRB last month, Amazon promised to let \nits 750,000 U.S. workers organize freely and not to retaliate. \n    The company is the nation's second-largest private employer, \nafter Walmart. \n    Workers at a number of big U.S. companies have been pressing for \nbetter pay and working conditions amid the pandemic and the labor \nshortage that emerged after shutdowns ended. \n    In one example, workers OK'd unionizing in two of three recent \nvotes at Starbucks shops in and around Buffalo, New York. \n\n\n    Copyright ? 2022 Refinitiv and/or its affiliates. All \nrights reserved. The Refinitiv content received through this \nservice is the intellectual property of Refinitiv or its third \nparty suppliers. Republication or redistribution of content \nprovided by Refinitiv is expressly prohibited without the prior \nwritten consent of Refinitiv, except where permitted by the \nterms of the relevant Refinitiv service agreement. Neither \nRefinitiv nor its third party suppliers shall be liable for any \nerrors, omissions or delays in content, or for any actions taken \nin reliance thereon. Refinitiv and its logo are trademarks or \ntrademarks of the Refinitiv group of companies around the world. \n\n\n    </pre>\n\n<p></p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) 2022 Refinitiv. All rights reserved.</p></div>"}