{"date": "2021-11-30 03:43:36+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3561.57, "close": 3443.72}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><p class=\"tr-advisory\">Adds Adobe data on U.S. spending</p><p class=\"tr-by\">By Uday Sampath Kumar</p><p class=\"tr-story-p1\"><span class=\"tr-dateline\">Nov 29 (Reuters)</span><span class=\"tr-dl-sep\"> - </span>U.S. retailers' online sales likely slowed this Cyber Monday, as fewer discounts and limited choices due to global supply-chain disruptions deterred shoppers, but other data points suggested American consumers are in pretty good health. </p><p>Retailers had also spread out promotional deals across more weeks to protect profit margins from surging supply chain costs and to better manage inventories amid widespread product shortages ahead of the Christmas shopping season.</p><p>Those attempts have pinched sales on what are traditionally some of the biggest shopping days of the year, with Adobe Analytics data over the weekend showing spending online during Black Friday fell for the first time ever. <span> (<a href=\"reuters://REALTIME/verb=NewsStory/ric=nL1N2SH2D7\" data-type=\"storyId\" data-story-id=\"nL1N2SH2D7\" translate=\"no\" dir=\"ltr\" class=\"tr-pnac\">Full Story</a>)</span> </p><p>\"Online sales on big shopping days like Thanksgiving and Black Friday are decreasing for the first time in history, and it is beginning to smooth out the shape of the overall season,\" said Taylor Schreiner, director, Adobe Digital Insights.</p><p>U.S. spending on Cyber Monday crossed $7 billion as of 9 p.m. ET, according to the Adobe Digital Economy Index.</p><p>Adobe now expects consumers to spend between $10.4 billion and $11.1 billion and forecast that customers could spend $2.5 billion between 7 p.m. PT and 11 p.m. PT.</p><p>      <span class=\"tr-strong\">Early estimates showed spending to </span>be between $10.2 billion and $11.3 billion. That translates to roughly flat growth at the midpoint compared to last year's $10.8 billion, which was a near 15% jump from 2019.      </p><p>Excitement on social media around Cyber Monday is also ebbing.</p><p>\"Cyber Monday continues to be extremely relevant, particularly in the digital world, but the buzz has been more muted than we've seen in recent history,\" said Rob Garf, general manager of retail at Salesforce.</p><p>Discount rates in the United States in the week leading up to Cyber Monday were on average 8% lower than last year, according to Salesforce.    </p><p>The holiday season kicks off just as the new Omicron coronavirus variant has triggered uncertainty over the economic reopening, but experts say it is too early to predict the impact on consumer spending.</p><p>On Black Friday, the day after Thanksgiving, U.S. shoppers spent roughly $8.9 billion online, down from $9 billion a year earlier, according to Adobe d<span class=\"tr-strong\">ata</span>. </p><p>A separate data point released Monday by MasterCard SpendingPulse, which calculates overall U.S. retail sales across payment methods, found U.S. shoppers spent 14% more on merchandise excluding automobiles from Nov 26 to 28, compared to the same holiday weekend a year earlier. The estimates include purchases made in stores. </p><p>Shoppers' spending online increased 5% over the three-day period compared to a year earlier, and by 28.7% when compared to the same period in 2019, according to MasterCard SpendingPulse.</p><p><br/></p><div style=\"display:none;\" class=\"tr-sandwichbox\"></div><p class=\"tr-signoff\"> (Reporting by Uday Sampath in Bengaluru. Additional reporting by Arriana McLymore in Raleigh, NC and Ann Maria Shibu in Bengaluru; Editing by Sriraj Kalluvila, Nick Zieminski and Arun Koyyur)</p><p class=\"tr-contactinfo\">(( <a href=\"mailto:UdaySampath.Kumar@thomsonreuters.com\" data-type=\"email\" translate=\"no\">UdaySampath.Kumar@thomsonreuters.com</a> ; within U.S. +1 646 223 8780; Twitter: <a href=\"https://twitter.com/sampath_uday\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://twitter.com/sampath_uday</a> ;))</p><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">(c) Copyright Thomson Reuters 2021. Click For Restrictions - https://agency.reuters.com/en/copyright.html</p><p class=\"line-break\"><br/></p><p class=\"tr-slugline\">Keywords: RETAIL-HOLIDAYSHOPPING/CYBERMONDAY (UPDATE 3, PIX)</p></div>"}