{"date": "2022-01-14 14:41:56.141000+00:00", "ticker": "AMZN", "mrkt_info": {"open": 3304.14, "close": 3242.76}, "html": "<div class=\"storyContent\" lang=\"en\"><style type=\"text/css\">.storyContent * {border-color:inherit !important;outline-color:inherit !important;}</style><div class=\"tr-npp-body\">\n<pre>MOTORSPORT GAMES INC (\"MSGM-Q\")\n- 24 Hours of Le Mans Virtual eRacing Finale Event to be Broadcast\n- Digitally Around the World\n\n     A host of major broadcasters, including Motor Trend in the USA and\nEurosport across Europe and Asia, will televise this weekend's 24 Hours of\nLe Mans Virtual Series eRacing Finale Event on January 15 and 16, 2022,\nbringing the exhilarating combined world of motorsport and esports to\nmillions of homes across the globe. This marks the culmination of this\nyear's series, made possible through a joint venture between Motorsport\nGames and the Automobile Club de l'Ouest (ACO).\n\n     A special TV show covering this unique two-day event will be produced\nlive from Paris and will include an expert commentary team made up of FIA\nWorld Endurance Championship lead commentator Martin Haven, esports experts\nChris McCarthy and Lewis McGlade, motorsport commentator Ben Constanduros,\nplus \"pitlane\" reporter Hayley Edmonds. Also in the studio will be current\nWEC competitor, 2020 Le Mans Virtual driver and FIA F2 and F3 commentator\nAlex Brundle to bring a driver's eye to proceedings.\n\n     The 200 eRacing drivers - representing 39 different nationalities -\npiloting the 50 cars (4-drivers in each car in rotation over the 24 hours)\nwill be located in 28 different countries. This is fully reflected in the\ndigital interest from broadcasters globally.\n\n     Eurosport will cover the full 2-day eRace event live throughout its\nEuropean regions on Eurosport Player, and global coverage will be on\nMotorsport.tv. Also airing the full 24 hours on OTT channels in Europe will\nbe L'Equipe Live in France, Sport 10 (pay TV), RTBF Auvio (OTT) in Belgium\nand Viaplay in Sweden, Norway and Finland. Sport 1 in Germany, Austria and\nSwitzerland will show a special 44 minute program on Sunday evening,\nbroadcasted on free-to-air TV with a potential reach of 72 million viewers.\n\n     Motor Trend will cover the full eRace live in North America on its OTT\nservice, while Star+ will show the 24 Hours of Le Mans Virtual eRacing\nFinale Event in Latin America plus Brazil. SuperSport DStv will take the\nbroadcast live on its dedicated motorsport channel across Africa, thus\nextending the coverage to five continents around the world.\n\n     Finally, the ACO and FIA WEC's official social media channels will be\nshowing all the action live from start to finish, as will the Le Mans\nVirtual Series official website (www.lemansvirtual.com). The broadcast\nbegins at 7:30 AM EST (13:30 CET/12:30 GMT) and the famous French national\nflag will be dropped for the start of the biggest endurance esports event\nof the year at 8:00 AM EST (14:00 CET/13:00 GMT).\n     More information including press releases, visuals, official poster\nand a presentation can be found HERE. All information on the event can also\nbe found on www.lemansvirtual.com.\n\n     About Le Mans Virtual Series\nLe Mans Virtual Series is a global, elite esports series made up of five\nrounds which bring together endurance racing and sim racing' top teams to\ncompete on some of the world's most famous racetracks. International\nFIA-licensed real-world drivers are teamed up with leading esports\nprotagonists to take on endurance classics for a total prize fund of US\n$250,000, culminating in the prestigious 24 Hours of Le Mans Virtual which\nwill take place entirely online. The Le Mans Virtual Series is a joint\nventure between leading racing game developer, publisher and esports\necosystem provider of official motorsport racing series throughout the\nworld, Motorsport Games, and the Automobile Club de l'Ouest (ACO) - the\ncreator and organizer of the world-famous 24 Hours of Le Mans and promoter\nof the FIA World Endurance Championship (FIA WEC). www.lemansvirtual.com\n\n//st\n\nRound 1   4 Hours of Monza, Italy        September 25, 2021    Online only\n\nRound 2   6 Hours of Spa, Belgium        October 16, 2021      Online only\n\nRound 3   8 Hours of Nurburgring,        November 13, 2021     Online only\n          Germany\n\nRound 4   6 Hours of Sebring, USA        December 18, 2021     Online only\n\nRound 5   24 Hours of Le Mans Virtual    January 15/16, 2022   Online only\n\n//et\n\n     About Motorsport Games\nMotorsport Games, a Motorsport Network company, combines innovative and\nengaging video games with exciting esports competitions and content for\nracing fans and gamers around the globe. The Company is the officially\nlicensed video game developer and publisher for iconic motorsport racing\nseries, including NASCAR, INDYCAR, 24 Hours of Le Mans and the British\nTouring Car Championship (\"BTCC\"), across PC, PlayStation, Xbox, Nintendo\nSwitch and mobile. Motorsport Games is an award-winning esports partner of\nchoice for 24 Hours of Le Mans, Formula E, BTCC, the FIA World Rallycross\nChampionship and the eNASCAR Heat Pro League, among others. For more\ninformation about Motorsport Games, visit www.motorsportgames.com.\n\n     Forward-Looking Statements:\nCertain statements in this press release which are not historical facts are\nforward-looking statements within the meaning of Section 27A of the\nSecurities Act of 1933, as amended, and Section 21E of the Securities\nExchange Act of 1934, as amended, and are provided pursuant to the safe\nharbor provisions of the Private Securities Litigation Reform Act of 1995.\nAny statements in this press release that are not statements of historical\nfact may be deemed forward-looking statements. Words such as \"continue,\"\n\"will,\" \"may,\" \"could,\" \"should,\" \"expect,\" \"expected,\" \"plans,\" \"intend,\"\n\"anticipate,\" \"believe,\" \"estimate,\" \"predict,\" \"potential,\" and similar\nexpressions are intended to identify such forward-looking statements. These\nforward-looking statements include, but are not limited to, statements\nconcerning the expected future impact of new or planned products, features,\nofferings or events, including, without limitation the Le Mans Virtual\nSeries events, and the timing of launching such products, features,\nofferings or events. All forward-looking statements involve significant\nrisks and uncertainties that could cause actual results to differ\nmaterially from those expressed or implied in the forward-looking\nstatements, many of which are generally outside the control of Motorsport\nGames and are difficult to predict. Examples of such risks and\nuncertainties include, but are not limited to difficulties, delays in or\nunanticipated events that may impact the timing and scope of new product\nlaunches, such as due to delays and higher than anticipated expenses\nrelated to the ongoing and prolonged COVID-19 pandemic. Factors other than\nthose referred to above could also cause Motorsport Games' results to\ndiffer materially from expected results. Additional factors that could\ncause actual results to differ materially from those expressed or implied\nin the forward-looking statements can be found in Motorsport Games' filings\nwith the SEC, which may be found at www.sec.gov and at\nir.motorsportgames.com, including its Annual Report on Form 10-K for the\nfiscal year ended December 31, 2020, its Quarterly Reports on Form 10-Q\nfiled with the SEC during 2021, as well as in its subsequent filings with\nthe SEC. Motorsport Games anticipates that subsequent events and\ndevelopments may cause its plans, intentions and expectations to change.\nMotorsport Games assumes no obligation, and it specifically disclaims any\nintention or obligation, to update any forward-looking statements, whether\nas a result of new information, future events or otherwise, except as\nexpressly required by law. Forward-looking statements speak only as of the\ndate they are made and should not be relied upon as representing Motorsport\nGames' plans and expectations as of any subsequent date. Additionally, the\nbusiness and financial materials and any other statement or disclosure on,\nor made available through, Motorsport Games' website or other websites\nreferenced or linked to this press release shall not be incorporated by\nreference into this press release.\n\n     Website and Social Media Disclosure:\nInvestors and others should note that we announce material financial\ninformation to our investors using our investor relations website\n(ir.motorsportgames.com), SEC filings, press releases, public conference\ncalls and webcasts. We use these channels, as well as social media and\nblogs, to communicate with our investors and the public about our company\nand our products. It is possible that the information we post on our\nwebsites, social media and blogs could be deemed to be material\ninformation. Therefore, we encourage investors, the media and others\ninterested in our company to review the information we post on these\nwebsites, social media channels and blogs, including the following (which\nlist we will update from time to time on our investor relations website):\n\n//st\n\n         Websites              Social Media\n\n         motorsportgames.com   Twitter: @msportgames &amp; @traxiongg\n\n         traxion.gg            Instagram: msportgames &amp; traxiongg\n\n         motorsport.com        Facebook: Motorsport Games &amp; traxiongg\n\n                               LinkedIn: Motorsport Games\n\n                               Twitch: traxiongg\n\n                               Reddit: traxiongg\n\n//et\n\n     The contents of these websites and social media channels are not part\nof, nor will they be incorporated by reference into, this press release.\n\n     Investors:\nAshley DeSimone\nAshley.Desimone@icrinc.com\n\n     US Press:\nASTRSK PR\nmotorsportgames@astrskpr.com\n\n     EU / UK Press:\nSwipe Right PR\nmotorsport@swipterightpr.com\n\n     A photo accompanying this announcement is available at\n<a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/427b79e4-add1-4651-8e04\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.globenewswire.com/NewsRoom/AttachmentNg/427b79e4-add1-4651-8e04</a>\n-36f1d42e66d6\n\nTel   : 305-507-8799    MOTORSPORT GAMES INC\nEmail : investors@motorsportgames.com\nWWW   : <a href=\"https://www.motorsportgames.com\" data-type=\"url\" class=\"tr-link\" translate=\"no\">https://www.motorsportgames.com</a>\n\n                       ______________________________\n       _______________________________________________\n\n     ____________________________________________________________   \n      (c)2022 Market News Publishing Inc.  All rights reserved.    \n Toronto:(416)366-8881   Vancouver:(604)689-1101   Fax:(604)689-1106\n\n     2201300167.MNPRE2201300640-06174020220114</pre>\n</div><p class=\"line-break\"><br/></p><p class=\"tr-copyright\">Copyright (c) 2022 Thomson Reuters Limited.</p></div>"}